{"credit":[],"function":[{"operation":[{"term":"Protein subcellular localisation prediction","uri":"http://edamontology.org/operation_2489"}]}],"labels":{"toolType":["Web application"],"topic":[{"term":"Functional, regulatory and non-coding RNA","uri":"http://edamontology.org/topic_0659"},{"term":"Microarray experiment","uri":"http://edamontology.org/topic_3518"},{"term":"Small molecules","uri":"http://edamontology.org/topic_0154"},{"term":"Model organisms","uri":"http://edamontology.org/topic_0621"}]},"publication":[{"abstract":"MicroRNAs (miRNAs) are short RNAs that act as guides for the degradation and translational repression of protein-coding mRNAs. A large body of work showed that miRNAs are involved in the regulation of a broad range of biological functions, from development to cardiac and immune system function, to metabolism, to cancer. For most of the over 500 miRNAs that are encoded in the human genome the functions still remain to be uncovered. Identifying miRNAs whose expression changes between cell types or between normal and pathological conditions is an important step towards characterizing their function as is the prediction of mRNAs that could be targeted by these miRNAs. To provide the community the possibility of exploring interactively miRNA expression patterns and the candidate targets of miRNAs in an integrated environment, we developed the MirZ web server, which is accessible at www.mirz.unibas.ch. The server provides experimental and computational biologists with statistical analysis and data mining tools operating on up-to-date databases of sequencing-based miRNA expression profiles and of predicted miRNA target sites in species ranging from Caenorhabditis elegans to Homo sapiens.","authors":["Hausser J.","Berninger P.","Rodak C.","Jantscher Y.","Wirth S.","Zavolan M."],"cit_count":67,"journal":"Nucleic Acids Research","pmid":"19468042","title":"MirZ: An integrated microRNA expression atlas and target prediction resource","year":"2009-08-04"}],"summary":{"biotoolsCURIE":"biotools:mirz","biotoolsID":"mirz","description":"Web server that for evaluation and analysis of miRNA. It integrates two miRNA resources: the smiRNAdb miRNA expression atlas and the E1MMo miRNA target prediction algorithm.","homepage":"http://www.mirz.unibas.ch","name":"MirZ"}}