{
    "additionDate": "2020-01-09T17:55:01Z",
    "biotoolsCURIE": "biotools:clmDCA",
    "biotoolsID": "clmDCA",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "dwsun@ict.ac.cn",
            "name": "Shiwei Sun",
            "typeEntity": "Person"
        },
        {
            "email": "zheng@itp.ac.cn",
            "name": "Wei-Mou Zheng",
            "typeEntity": "Person"
        },
        {
            "email": "dbu@ict.ac.cn",
            "name": "Dongbo Bu",
            "orcidid": "https://orcid.org/0000-0003-4119-4238",
            "typeEntity": "Person"
        }
    ],
    "description": "Predicting protein inter-residue contacts using composite likelihood maximization and deep learning. Improving residue-residue contacts prediction.\nWelcome to use clmDCA for protein contact prediction.\nCOLORS is more effcient than PSICOV, mfDCA and plmDCA.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Contact map calculation",
                    "uri": "http://edamontology.org/operation_0392"
                },
                {
                    "term": "Residue contact prediction",
                    "uri": "http://edamontology.org/operation_0272"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ]
        }
    ],
    "homepage": "http://protein.ict.ac.cn/clmDCA/",
    "lastUpdate": "2020-12-16T14:51:18Z",
    "name": "clmDCA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3051-7",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Accurate prediction of inter-residue contacts of a protein is important to calculating its tertiary structure. Analysis of co-evolutionary events among residues has been proved effective in inferring inter-residue contacts. The Markov random field (MRF) technique, although being widely used for contact prediction, suffers from the following dilemma: the actual likelihood function of MRF is accurate but time-consuming to calculate; in contrast, approximations to the actual likelihood, say pseudo-likelihood, are efficient to calculate but inaccurate. Thus, how to achieve both accuracy and efficiency simultaneously remains a challenge. Results: In this study, we present such an approach (called clmDCA) for contact prediction. Unlike plmDCA using pseudo-likelihood, i.e., the product of conditional probability of individual residues, our approach uses composite-likelihood, i.e., the product of conditional probability of all residue pairs. Composite likelihood has been theoretically proved as a better approximation to the actual likelihood function than pseudo-likelihood. Meanwhile, composite likelihood is still efficient to maximize, thus ensuring the efficiency of clmDCA. We present comprehensive experiments on popular benchmark datasets, including PSICOV dataset and CASP-11 dataset, to show that: i) clmDCA alone outperforms the existing MRF-based approaches in prediction accuracy. i i) When equipped with deep learning technique for refinement, the prediction accuracy of clmDCA was further significantly improved, suggesting the suitability of clmDCA for subsequent refinement procedure. We further present a successful application of the predicted contacts to accurately build tertiary structures for proteins in the PSICOV dataset. Conclusions: Composite likelihood maximization algorithm can efficiently estimate the parameters of Markov Random Fields and can improve the prediction accuracy of protein inter-residue contacts.",
                "authors": [
                    {
                        "name": "Zhang H."
                    },
                    {
                        "name": "Zhang Q."
                    },
                    {
                        "name": "Ju F."
                    },
                    {
                        "name": "Zhu J."
                    },
                    {
                        "name": "Gao Y."
                    },
                    {
                        "name": "Xie Z."
                    },
                    {
                        "name": "Deng M."
                    },
                    {
                        "name": "Sun S."
                    },
                    {
                        "name": "Zheng W.-M."
                    },
                    {
                        "name": "Bu D."
                    }
                ],
                "citationCount": 3,
                "date": "2019-10-29T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Predicting protein inter-residue contacts using composite likelihood maximization and deep learning"
            },
            "pmcid": "PMC6821021",
            "pmid": "31664895"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}