{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://sfb.kaust.edu.sa/Pages/Home.aspx"}],"function":[{"operation":[{"term":"Clustering","uri":"http://edamontology.org/operation_3432"}]}],"labels":{"language":["MATLAB"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Cancer","uri":"http://edamontology.org/topic_2640"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/kaustnmf-non-negative-matrix-factorization-by-maximizing-correntropy-for-cancer-clustering.html"}],"publication":[{"abstract":"Background: Non-negative matrix factorization (NMF) has been shown to be a powerful tool for clustering gene expression data, which are widely used to classify cancers. NMF aims to find two non-negative matrices whose product closely approximates the original matrix. Traditional NMF methods minimize either the l2 norm or the Kullback-Leibler distance between the product of the two matrices and the original matrix. Correntropy was recently shown to be an effective similarity measurement due to its stability to outliers or noise.Results: We propose a maximum correntropy criterion (MCC)-based NMF method (NMF-MCC) for gene expression data-based cancer clustering. Instead of minimizing the l2 norm or the Kullback-Leibler distance, NMF-MCC maximizes the correntropy between the product of the two matrices and the original matrix. The optimization problem can be solved by an expectation conditional maximization algorithm.Conclusions: Extensive experiments on six cancer benchmark sets demonstrate that the proposed method is significantly more accurate than the state-of-the-art methods in cancer clustering. © 2013 Wang et al.; licensee BioMed Central Ltd.","authors":["Wang J.J.Y.","Wang X.","Gao X."],"cit_count":65,"doi":"10.1186/1471-2105-14-107","journal":"BMC Bioinformatics","title":"Non-negative matrix factorization by maximizing correntropy for cancer clustering","type":"Primary","year":"2013-03-24"}],"summary":{"biotoolsCURIE":"biotools:kaustnmf","biotoolsID":"kaustnmf","description":"KAUSTNMF is a maximum correntropy criterion-based non-negative matrix factorization package.","homepage":"http://sfb.kaust.edu.sa/Pages/Software.aspx","name":"KAUSTNMF"}}