
{
    "credit": [
        {
            "email": "john.walshaw@bbsrc.ac.uk",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.chm.bris.ac.uk/org/woolfson/index.html"
        },
        {
            "email": "g.bartlett@bristol.ac.uk",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://coiledcoils.chm.bris.ac.uk/socket/README"
        },
        {
            "type": "User manual",
            "url": "http://coiledcoils.chm.bris.ac.uk/socket/manual.txt"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Web application"
        ],
        "topic": [
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Protein structure analysis",
                "uri": "http://edamontology.org/topic_2814"
            },
            {
                "term": "Protein sites, features and motifs",
                "uri": "http://edamontology.org/topic_3510"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/socket-3-03-identifies-knobs-into-holes-packing-protein-structures.html"
        }
    ],
    "publication": [
        {
            "abstract": "The coiled coil is arguably the simplest protein-structure motif and probably the most ubiquitous facilitator of protein-protein interactions. Coiled coils comprise two or more α-helices that wind around each other to form \"supercoils\". The hallmark of most coiled coils is a regular sequence pattern known as the heptad repeat. Despite this apparent simplicity and relatedness at the sequence level, coiled coils display a considerable degree of structural diversity: the helices may be arranged parallel or anti-parallel and may form a variety of oligomer states. To aid studies of coiled coils, we developed SOCKET, a computer program to identify these motifs automatically in protein structures. We used SOCKET to gather a set of unambiguous coiled-coil structures from the RCSB Protein Data Bank. Rather than searching for sequence features, the algorithm recognises the characteristic knobs-into-holes side-chain packing of coiled coils; this proved to be straightforward to implement and was able to distinguish coiled coils from the great majority of helix-helix packing arrangements observed in globular domains. SOCKET unambiguously defines coiled-coil helix boundaries, oligomerisation states and helix orientations, and also assigns heptad registers. Structures retrieved from the Protein Data Bank included parallel and anti-parallel variants of two, three and four-stranded coiled coils, one example of a parallel pentamer and a small number of structures that extend the classical description of a coiled coil. We anticipate that our structural database and the associated sequence data that we have gathered will be of use in identifying principles for coiled-coil assembly, prediction and design. To illustrate this we give examples of sequence and structural analyses of the structures that are possible using the new data bases, and we present amino acid profiles for the heptad repeats of different motifs. © 2001 Academic Press.",
            "authors": [
                "Walshaw J.",
                "Woolfson D.N."
            ],
            "cit_count": 247,
            "journal": "Journal of Molecular Biology",
            "pmid": "11292353",
            "title": "SOCKET: A program for identifying and analysing coiled-coil motifs within protein structures",
            "year": "2001-04-13"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:socket",
        "biotoolsID": "socket",
        "description": "The tool finds the Knobs-into-Holes mode of packing between alpha-helices which is characteristic of coiled coils. It unambiguously defines the beginning and end of coiled-coil motifs in protein structures and assigns a heptad register to the sequence, highlighting the core-residues with a RasMol script if required.",
        "homepage": "http://coiledcoils.chm.bris.ac.uk/socket/",
        "name": "SOCKET"
    }
}