{
    "additionDate": "2017-12-18T00:11:46Z",
    "biotoolsCURIE": "biotools:rmaexpress",
    "biotoolsID": "rmaexpress",
    "credit": [
        {
            "email": "terry@wehi.edu.au",
            "name": "Terrence Speed",
            "orcidid": "http://orcid.org/0000-0002-5403-7998",
            "typeEntity": "Person"
        },
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://bmbolstad.com/"
        }
    ],
    "description": "Compute gene expression summary values for Affymetrix Genechip® data using the Robust Multichip Average expression summary and carry out quality assessment using probe-level metrics.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://rmaexpress.bmbolstad.com/RMAExpress_UsersGuide.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Microarray data analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://rmaexpress.bmbolstad.com/",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-16T12:49:53Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/rmaexpress-1-0-5-generate-rma-expression-measures-affy-data.html"
        }
    ],
    "name": "RMAExpress",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/19.2.185",
            "metadata": {
                "abstract": "Motivation: When running experiments that involve multiple high density oligonucleotide arrays, it is important to remove sources of variation between arrays of non-biological origin. Normalization is a process for reducing this variation. It is common to see non-linear relations between arrays and the standard normalization provided by Affymetrix does not perform well in these situations. Results: We present three methods of performing normalization at the probe intensity level. These methods are called complete data methods because they make use of data from all arrays in an experiment to form the normalizing relation. These algorithms are compared to two methods that make use of a baseline array: a one number scaling based algorithm and a method that uses a non-linear normalizing relation by comparing the variability and bias of an expression measure. Two publicly available datasets are used to carry out the comparisons. The simplest and quickest complete data method is found to perform favorably.",
                "authors": [
                    {
                        "name": "Astrand M."
                    },
                    {
                        "name": "Bolstad B.M."
                    },
                    {
                        "name": "Irizarry R.A."
                    },
                    {
                        "name": "Speed T.P."
                    }
                ],
                "citationCount": 6078,
                "date": "2003-02-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "A comparison of normalization methods for high density oligonucleotide array data based on variance and bias"
            },
            "pmcid": "PMC150247",
            "pmid": "12538238",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/biostatistics/4.2.249",
            "metadata": {
                "abstract": "In this paper we report exploratory analyses of high-density oligonucleotide array data from the Affymetrix GeneChip system with the objective of improving upon currently used measures of gene expression. Our analyses make use of three data sets: a small experimental study consisting of five MGU74A mouse GeneChip arrays, part of the data from an extensive spike-in study conducted by Gene Logic and Wyeth's Genetics Institute involving 95 HG-U95A human GeneChip arrays; and part of a dilution study conducted by Gene Logic involving 75 HG-U95A GeneChip arrays. We display some familiar features of the perfect match and mismatch probe (PM and MM) values of these data, and examine the variance-mean relationship with probe-level data from probes believed to be defective, and so delivering noise only. We explain why we need to normalize the arrays to one another using probe level intensities. We then examine the behavior of the PM and MM using spike-in data and assess three commonly used summary measures: Affymetrix's (i) average difference (AvDiff) and (ii) MAS 5.0 signal, and (iii) the Li and Wong multiplicative model-based expression index (MBEI). The exploratory data analyses of the probe level data motivate a new summary measure that is a robust multi-array average (RMA) of background-adjusted, normalized, and log-transformed PM values. We evaluate the four expression summary measures using the dilution study data, assessing their behavior in terms of bias, variance and (for MBEI and RMA) model fit. Finally, we evaluate the algorithms in terms of their ability to detect known levels of differential expression using the spike-in data. We conclude that there is no obvious downside to using RMA and attaching a standard error (SE) to this quantity using a linear model which removes probe-specific affinities.",
                "authors": [
                    {
                        "name": "Antonellis K.J."
                    },
                    {
                        "name": "Beazer-Barclay Y.D."
                    },
                    {
                        "name": "Collin F."
                    },
                    {
                        "name": "Hobbs B."
                    },
                    {
                        "name": "Irizarry R.A."
                    },
                    {
                        "name": "Scherf U."
                    },
                    {
                        "name": "Speed T.P."
                    }
                ],
                "citationCount": 8009,
                "date": "2003-01-01T00:00:00Z",
                "journal": "Biostatistics (Oxford, England)",
                "title": "Exploration, normalization, and summaries of high density oligonucleotide array probe level data."
            },
            "type": [
                "Primary"
            ]
        },
        {
            "metadata": {
                "abstract": "High density oligonucleotide array technology is widely used in many areas of biomedical research for quantitative and highly parallel measurements of gene expression. Affymetrix GeneChip arrays are the most popular. In this technology each gene is typically represented by a set of 11-20 pairs of probes. In order to obtain expression measures it is necessary to summarize the probe level data. Using two extensive spike-in studies and a dilution study, we developed a set of tools for assessing the effectiveness of expression measures. We found that the performance of the current version of the default expression measure provided by Affymetrix Microarray Suite can be significantly improved by the use of probe level summaries derived from empirically motivated statistical models. In particular, improvements in the ability to detect differentially expressed genes are demonstrated.",
                "authors": [
                    {
                        "name": "Bolstad B.M."
                    },
                    {
                        "name": "Collin F."
                    },
                    {
                        "name": "Cope L.M."
                    },
                    {
                        "name": "Hobbs B."
                    },
                    {
                        "name": "Irizarry R.A."
                    },
                    {
                        "name": "Speed T.P."
                    }
                ],
                "citationCount": 3882,
                "date": "2003-02-15T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "Summaries of Affymetrix GeneChip probe level data"
            },
            "pmid": "12582260",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1,
    "version": [
        "1.1.0"
    ]
}
