{
    "name": "Loc3D", 
    "description": "Database of predicted subcellular localization for eukaryotic proteins of known three-dimensional (3D) structure and includes tools to predict the subcellular localization for submitted protein sequences.", 
    "homepage": "http://cubic.bioc.columbia.edu/db/LOC3d/", 
    "biotoolsID": "loc3d", 
    "biotoolsCURIE": "biotools:loc3d", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2489", 
                    "term": "Protein subcellular localisation prediction"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0267", 
                    "term": "Protein secondary structure prediction"
                }, 
                {
                    "uri": "http://edamontology.org/operation_3092", 
                    "term": "Protein feature detection"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0474", 
                    "term": "Protein structure prediction"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0082", 
            "term": "Structure prediction"
        }, 
        {
            "uri": "http://edamontology.org/topic_0078", 
            "term": "Proteins"
        }, 
        {
            "uri": "http://edamontology.org/topic_0621", 
            "term": "Model organisms"
        }, 
        {
            "uri": "http://edamontology.org/topic_0166", 
            "term": "Protein structural motifs and surfaces"
        }, 
        {
            "uri": "http://edamontology.org/topic_0081", 
            "term": "Structure analysis"
        }
    ], 
    "operatingSystem": [], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [], 
    "publication": [
        {
            "doi": null, 
            "pmid": "12824321", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "LOC3D: Annotate sub-cellular localization for protein structures", 
                "abstract": "LOC3D (http://cubic.bioc.columbia.edu/db/LOC3d/) is both a weekly-updated database and a web server for predictions of sub-cellular localization for eukaryotic proteins of known three-dimensional (3D) structure. Localization is predicted using four different methods: (i) PredictNLS, prediction of nuclear proteins through nuclear localization signals; (ii) LOChom, inferring localization through sequence homology; (iii) LOCkey, inferring localization through automatic text analysis of SWISS-PROT keywords; and (iv) LOC3Dini, ab initio prediction through a system of neural networks and vector support machines. The final prediction is based on the method that predicts localization with the highest confidence. The LOC3D database currently contains predictions for >8700 eukaryotic protein chains taken from the Protein Data Bank (PDB). The web server can be used to predict sub-cellular localization for proteins for which only a predicted structure is available from threading servers. This makes the resource of particular interest to structural genomics initiatives.", 
                "date": "2003-07-01T00:00:00Z", 
                "citationCount": 31, 
                "authors": [
                    {
                        "name": "Nair R."
                    }, 
                    {
                        "name": "Rost B."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }, 
        {
            "doi": null, 
            "pmid": "15808855", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Mimicking cellular sorting improves prediction of subcellular localization", 
                "abstract": "Predicting the native subcellular compartment of a protein is an important step toward elucidating its function. Here we introduce LOCtree, a hierarchical system combining support vector machines (SVMs) and other prediction methods. LOCtree predicts the subcellular compartment of a protein by mimicking the mechanism of cellular sorting and exploiting a variety of sequence and predicted structural features in its input. Currently LOCtree does not predict localization for membrane proteins, since the compositional properties of membrane proteins significantly differ from those of non-membrane proteins. While any information about function can be used by the system, we present estimates of performance that are valid when only the amino acid sequence of a protein is known. When evaluated on a non-redundant test set, LOCtree achieved sustained levels of 74% accuracy for non-plant eukaryotes, 70% for plants, and 84% for prokaryotes. We rigorously benchmarked LOCtree in comparison to the best alternative methods for localization prediction. LOCtree outperformed all other methods in nearly all benchmarks. Localization assignments using LOCtree agreed quite well with data from recent large-scale experiments. Our preliminary analysis of a few entirely sequenced organisms, namely human (Homo sapiens), yeast (Saccharomyces cerevisiae), and weed (Arabidopsis thaliana) suggested that over 35% of all non-membrane proteins are nuclear, about 20% are retained in the cytosol, and that every fifth protein in the weed resides in the chloroplast. © 2005 Elsevier Ltd. All rights reserved.", 
                "date": "2005-04-22T00:00:00Z", 
                "citationCount": 237, 
                "authors": [
                    {
                        "name": "Nair R."
                    }, 
                    {
                        "name": "Rost B."
                    }
                ], 
                "journal": "Journal of Molecular Biology"
            }
        }, 
        {
            "doi": null, 
            "pmid": "14635133", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Better Prediction of Sub-Cellular Localization by Combining Evolutionary and Structural Information", 
                "abstract": "The native sub-cellular compartment of a protein is one aspect of its function. Thus, predicting localization is an important step toward predicting function. Short zip code-like sequence fragments regulate some of the shuttling between compartments. Cataloguing and predicting such motifs is the most accurate means of determining localization in silico. However, only few motifs are currently known, and not all the trafficking appears regulated in this way. The amino acid composition of a protein correlates with its localization. All general prediction methods employed this observation. Here, we explored the evolutionary information contained in multiple alignments and aspects of protein structure to predict localization in absence of homology and targeting motifs. Our final system combined statistical rules and a variety of neural networks to achieve an overall four-state accuracy above 65%, a significant improvement over systems using only composition. The system was at its best for extra-cellular and nuclear proteins; it was significantly less accurate than TargetP for mitochondrial proteins. Interestingly, all methods that were developed on SWISS-PROT sequences failed grossly when fed with sequences from proteins of known structures taken from PDB. We therefore developed two separate systems: one for proteins of known structure and one for proteins of unknown structure. Finally, we applied the PDB-based system along with homology-based inferences and automatic text analysis to annotate all eukaryotic proteins in the PDB (http://cubic.bioc. columbia.edu/db/LOC3D). We imagine that this pilot method-certainly in combination with similar tools-may be valuable target selection in structural genomics. © 2003 Wiley-Liss, Inc.", 
                "date": "2003-12-01T00:00:00Z", 
                "citationCount": 67, 
                "authors": [
                    {
                        "name": "Nair R."
                    }, 
                    {
                        "name": "Rost B."
                    }
                ], 
                "journal": "Proteins: Structure, Function and Genetics"
            }
        }
    ], 
    "credit": [], 
    "owner": "ELIXIR-EE", 
    "additionDate": "2017-02-10T11:34:04Z", 
    "lastUpdate": "2018-12-10T12:58:39Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 1, 
    "elixir_badge": 0
}