{
    "accessibility": "Open access",
    "additionDate": "2022-05-18T07:43:57.796391Z",
    "biotoolsCURIE": "biotools:autoscore-survival",
    "biotoolsID": "autoscore-survival",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Bibhas Chakraborty"
        },
        {
            "name": "Feng Xie"
        }
    ],
    "description": "Given a new dataset with time-to-event outcomes and baseline covariates, the AutoScore-Survival package provides a pipeline of functions to split data and implement the six modules to generate the final scores that require minimal manipulation from users.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/nliulab/AutoScore-Survival",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-05-18T07:43:57.798663Z",
    "name": "AutoScore-Survival",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.JBI.2021.103959",
            "metadata": {
                "abstract": "© 2021 Elsevier Inc.Background: Scoring systems are highly interpretable and widely used to evaluate time-to-event outcomes in healthcare research. However, existing time-to-event scores are predominantly created ad-hoc using a few manually selected variables based on clinician's knowledge, suggesting an unmet need for a robust and efficient generic score-generating method. Methods: AutoScore was previously developed as an interpretable machine learning score generator, integrating both machine learning and point-based scores in the strong discriminability and accessibility. We have further extended it to the time-to-event outcomes and developed AutoScore-Survival, for generating time-to-event scores with right-censored survival data. Random survival forest provided an efficient solution for selecting variables, and Cox regression was used for score weighting. We implemented our proposed method as an R package. We illustrated our method in a study of 90-day survival prediction for patients in intensive care units and compared its performance with other survival models, the random survival forest, and two traditional clinical scores. Results: The AutoScore-Survival-derived scoring system was more parsimonious than survival models built using traditional variable selection methods (e.g., penalized likelihood approach and stepwise variable selection), and its performance was comparable to survival models using the same set of variables. Although AutoScore-Survival achieved a comparable integrated area under the curve of 0.782 (95% CI: 0.767–0.794), the integer-valued time-to-event scores generated are favorable in clinical applications because they are easier to compute and interpret. Conclusions: Our proposed AutoScore-Survival provides a robust and easy-to-use machine learning-based clinical score generator to studies of time-to-event outcomes. It gives a systematic guideline to facilitate the future development of time-to-event scores for clinical applications.",
                "authors": [
                    {
                        "name": "Chakraborty B."
                    },
                    {
                        "name": "Goldstein B.A."
                    },
                    {
                        "name": "Liu N."
                    },
                    {
                        "name": "Ning Y."
                    },
                    {
                        "name": "Ong M.E.H."
                    },
                    {
                        "name": "Xie F."
                    },
                    {
                        "name": "Yuan H."
                    }
                ],
                "citationCount": 3,
                "date": "2022-01-01T00:00:00Z",
                "journal": "Journal of Biomedical Informatics",
                "title": "AutoScore-Survival: Developing interpretable machine learning-based time-to-event scores with right-censored survival data"
            },
            "pmid": "34826628"
        }
    ],
    "toolType": [
        "Library",
        "Workbench"
    ],
    "topic": [
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ],
    "validated": 1
}
