{
    "accessibility": "Open access",
    "additionDate": "2024-03-27T20:56:23.161012Z",
    "biotoolsCURIE": "biotools:unmf",
    "biotoolsID": "unmf",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ko.abe@med.nagoya-u.ac.jp",
            "name": "Ko Abe",
            "typeEntity": "Person"
        },
        {
            "name": "Teppei Shimamura",
            "typeEntity": "Person"
        }
    ],
    "description": "moltenNMF is an R package for Nonnegative Matrix Factorization for tidy data format.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Principal component analysis",
                    "uri": "http://edamontology.org/operation_3960"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/abikoushi/moltenNMF",
    "language": [
        "C",
        "C++",
        "R"
    ],
    "lastUpdate": "2024-11-24T14:05:59.731652Z",
    "name": "UNMF",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bib/bbad253",
            "metadata": {
                "abstract": "Factor analysis, ranging from principal component analysis to nonnegative matrix factorization, represents a foremost approach in analyzing multi-dimensional data to extract valuable patterns, and is increasingly being applied in the context of multi-dimensional omics datasets represented in tensor form. However, traditional analytical methods are heavily dependent on the format and structure of the data itself, and if these change even slightly, the analyst must change their data analysis strategy and techniques and spend a considerable amount of time on data preprocessing. Additionally, many traditional methods cannot be applied as-is in the presence of missing values in the data. We present a new statistical framework, unified nonnegative matrix factorization (UNMF), for finding informative patterns in messy biological data sets. UNMF is designed for tidy data format and structure, making data analysis easier and simplifying the development of data analysis tools. UNMF can handle a wide range of data structures and formats, and works seamlessly with tensor data including missing observations and repeated measurements. The usefulness of UNMF is demonstrated through its application to several multi-dimensional omics data, offering user-friendly and unified features for analysis and integration. Its application holds great potential for the life science community. UNMF is implemented with R and is available from GitHub (https://github.com/abikoushi/moltenNMF).",
                "authors": [
                    {
                        "name": "Abe K."
                    },
                    {
                        "name": "Shimamura T."
                    }
                ],
                "citationCount": 4,
                "date": "2023-09-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "UNMF: a unified nonnegative matrix factorization for multi-dimensional omics data"
            },
            "pmcid": "PMC10516365",
            "pmid": "37478378"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
