{
    "accessibility": "Open access",
    "additionDate": "2017-01-13T13:17:03Z",
    "biotoolsCURIE": "biotools:webprinses",
    "biotoolsID": "webprinses",
    "cost": "Free of charge",
    "description": "A tool encompasses two separate software applications. The first is WebPrInSeS-C which performs automated sequence verification of user-defined open-reading frame (ORF) clone libraries. The second is WebPrInSeS-E, which identifies positive hits in cDNA or ORF-based library screening experiments such as yeast one- or two-hybrid assays.",
    "download": [
        {
            "type": "Software package",
            "url": "https://updeplasrv1.epfl.ch/prinses/PrInSeS-G-1.0.0.beta.tgz",
            "version": "1.0.0.beta"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequencing quality control",
                    "uri": "http://edamontology.org/operation_3218"
                }
            ]
        }
    ],
    "homepage": "https://updeplasrv1.epfl.ch/prinses/",
    "lastUpdate": "2020-06-16T10:55:24Z",
    "license": "Unlicense",
    "link": [
        {
            "type": [
                "Discussion forum"
            ],
            "url": "https://groups.google.com/forum/?hl=en#!forum/prinsesg"
        }
    ],
    "maturity": "Emerging",
    "name": "WebPrInSeS",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "doi": "10.1093/nar/gkq431",
            "metadata": {
                "abstract": "High-throughput sequencing (HTS) is revolutionizing our ability to obtain cheap, fast and reliable sequence information. Many experimental approaches are expected to benefit from the incorporation of such sequencing features in their pipeline. Consequently, software tools that facilitate such an incorporation should be of great interest. In this context, we developed WebPrInSeS, a web server tool allowing automated full-length clone sequence identification and verification using HTS data. WebPrInSeS encompasses two separate software applications. The first is WebPrInSeS-C which performs automated sequence verification of user-defined open-reading frame (ORF) clone libraries. The second is WebPrInSeS-E, which identifies positive hits in cDNA or ORF-based library screening experiments such as yeast oneor two-hybrid assays. Both tools perform de novo assembly using HTS data from any of the three major sequencing platforms. Thus, WebPrInSeS provides a highly integrated, cost-effective and efficient way to sequence-verify or identify clones of interest. WebPrInSeS is available at http://webprinses.epfl.ch/ and is open to all users. © The Author(s) 2010. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Massouras A."
                    },
                    {
                        "name": "Decouttere F."
                    },
                    {
                        "name": "Hens K."
                    },
                    {
                        "name": "Deplancke B."
                    }
                ],
                "citationCount": 5,
                "date": "2010-05-25T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "WebPrInSeS: Automated full-length clone sequence identification and verification using high-throughput sequencing data"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Clone verification",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}