
{
    "credit": [
        {
            "email": "kianvl@bionet.nsc.ru",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://mga.bionet.nsc.ru/soft/index.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Linkage analysis",
                    "uri": "http://edamontology.org/operation_0283"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Perl",
            "Fortran"
        ],
        "operatingSystem": [
            "Linux",
            "Windows"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Population genetics",
                "uri": "http://edamontology.org/topic_3056"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/gads-parametric-linkage-analysis-of-quantitative-traits.html"
        }
    ],
    "publication": [
        {
            "abstract": "Often the quantitative data coming from proteomics and metabolomics studies have irregular distribution with a spike. None of the wide used methods for human QTL mapping are applicable to such traits. Researchers have to reduce the sample, excluding the spike, and analyze only continuous measurements. In this study, we propose a method for the parametric linkage analysis of traits with a spike in the distribution, and a software GADS, which implements this method. Our software includes not only the programs for parametric linkage analysis, but also the program for complex segregation analysis, which allows the estimation of the model parameters used in linkage. We tested our method on the real data about vertical cup-to-disc ratio, the important characteristic of the optic disc associated with glaucoma, in a large pedigree from a Dutch isolated population. Significant linkage signal was identified on chromosome 6 with the help of GADS, whereas the analysis of the normal distributed part of the sample demonstrated only a suggestive linkage peak on this chromosome. The software GADS is freely available at http://mga.bionet.nsc.ru/soft/index.html. © 2011 Elsevier Ltd. All rights reserved.",
            "authors": [
                "Axenovich T.I.",
                "Zorkoltseva I.V."
            ],
            "cit_count": 0,
            "journal": "Computational Biology and Chemistry",
            "pmid": "22340440",
            "title": "GADS software for parametric linkage analysis of quantitative traits distributed as a point-mass mixture",
            "year": "2012-02-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:gads",
        "biotoolsID": "gads",
        "description": "Software for Genetic Analyses of quantitative traits Distributed with Spike on the base of large pedigrees without loops.",
        "homepage": "http://mga.bionet.nsc.ru/soft/index.html",
        "name": "GADS"
    }
}