
{
    "credit": [
        {
            "email": "dragonbw@163.com",
            "name": "Bo Liao",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://github.com/qiukunlong/seeksv/blob/master/README.md"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/qiukunlong/seeksv/releases",
            "version": "1.2.3"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Indel detection",
                    "uri": "http://edamontology.org/operation_0452"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Structural variation detection",
                    "uri": "http://edamontology.org/operation_3228"
                }
            ]
        }
    ],
    "labels": {
        "accessibility": [
            "Open access"
        ],
        "cost": "Free of charge",
        "language": [
            "C++"
        ],
        "license": "Apache-2.0",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Genetic variation",
                "uri": "http://edamontology.org/topic_0199"
            },
            {
                "term": "RNA immunoprecipitation",
                "uri": "http://edamontology.org/topic_3794"
            },
            {
                "term": "Oncology",
                "uri": "http://edamontology.org/topic_2640"
            }
        ]
    },
    "link": [
        {
            "type": "ISSUE_TRACKER",
            "url": "https://github.com/qiukunlong/seeksv/issues"
        }
    ],
    "publication": [
        {
            "abstract": "© The Author 2017. Published by Oxford University Press. All rights reserved. Motivation: Many forms of variations exist in the human genome including single nucleotide polymorphism, small insert/deletion (DEL) (indel) and structural variation (SV). Somatically acquired SV may regulate the expression of tumor-related genes and result in cell proliferation and uncontrolled growth, eventually inducing tumor formation. Virus integration with host genome sequence is a type of SV that causes the related gene instability and normal cells to transform into tumor cells. Cancer SVs and viral integration sites must be discovered in a genome-wide scale for clarifying the mechanism of tumor occurrence and development. Results: In this paper, we propose a new tool called seeksv to detect somatic SVs and viral integration events. Seeksv simultaneously uses split read signal, discordant paired-end read signal, read depth signal and the fragment with two ends unmapped. Seeksv can detect DEL, insertion, inversion and inter-chromosome transfer at single-nucleotide resolution. Different types of sequencing data, such as single-end sequencing data or paired-end sequencing data can accommodate to detect SV. Seeksv develops a rescue model for SV with breakpoints located in sequence homology regions. Results on simulated and real data from the 1000 Genomes Project and esophageal squamous cell carcinoma samples show that seeksv has higher efficiency and precision compared with other similar software in detecting SVs. For the discovery of hepatitis B virus integration sites from probe capture data, the verified experiments show that more than 90% viral integration sequences detected by seeksv are true.",
            "authors": [
                "Liang Y.",
                "Qiu K.",
                "Liao B.",
                "Zhu W.",
                "Huang X.",
                "Li L.",
                "Chen X.",
                "Li K."
            ],
            "cit_count": 6,
            "doi": "10.1093/bioinformatics/btw591",
            "journal": "Bioinformatics",
            "title": "Seeksv: An accurate tool for somatic structural variation and virus integration detection",
            "type": "Primary",
            "year": "2017-01-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:Seeksv",
        "biotoolsID": "Seeksv",
        "description": "Accurate tool for somatic structural variation and virus integration detection.",
        "homepage": "https://github.com/qiukunlong/seeksv",
        "name": "Seeksv"
    }
}