{
    "additionDate": "2015-02-04T09:14:43Z",
    "biotoolsCURIE": "biotools:molgenis_compute",
    "biotoolsID": "molgenis_compute",
    "collectionID": [
        "BioMedBridges Tools"
    ],
    "credit": [
        {
            "email": "m.a.swertz@rug.nl",
            "name": "Morris Swertz",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "molgenis-hackers@googlegroups.com",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "UMC Groningen and collaborators",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "name": "BioMedBridges",
            "typeEntity": "Consortium",
            "typeRole": [
                "Documentor"
            ],
            "url": "http://www.biomedbridges.eu"
        }
    ],
    "description": "Workflow tool useful for core facilities to create pipelines that run on PBS or SGE clusters or on GRIDS. It ships with pipelines for alignment and SNP/SV calling of Illumina next generation data and with pipelines for GWAS imputation using impute2, minimach or beagle.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.molgenis.org/wiki/ComputeStart"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "homepage": "http://www.molgenis.org/wiki/ComputeStart",
    "lastUpdate": "2018-12-10T12:58:50Z",
    "name": "MOLGENIS compute",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mswertz",
    "publication": [
        {
            "doi": "10.1186/s13104-015-1309-3",
            "metadata": {
                "abstract": "© 2015 Kanterakis et al.Background: Genotype imputation is an important procedure in current genomic analysis such as genome-wide association studies, meta-analyses and fine mapping. Although high quality tools are available that perform the steps of this process, considerable effort and expertise is required to set up and run a best practice imputation pipeline, particularly for larger genotype datasets, where imputation has to scale out in parallel on computer clusters. Results: Here we present MOLGENIS-impute, an 'imputation in a box' solution that seamlessly and transparently automates the set up and running of all the steps of the imputation process. These steps include genome build liftover (liftovering), genotype phasing with SHAPEIT2, quality control, sample and chromosomal chunking/merging, and imputation with IMPUTE2. MOLGENIS-impute builds on MOLGENIS-compute, a simple pipeline management platform for submission and monitoring of bioinformatics tasks in High Performance Computing (HPC) environments like local/cloud servers, clusters and grids. All the required tools, data and scripts are downloaded and installed in a single step. Researchers with diverse backgrounds and expertise have tested MOLGENIS-impute on different locations and imputed over 30,000 samples so far using the 1,000 Genomes Project and new Genome of the Netherlands data as the imputation reference. The tests have been performed on PBS/SGE clusters, cloud VMs and in a grid HPC environment. Conclusions: MOLGENIS-impute gives priority to the ease of setting up, configuring and running an imputation. It has minimal dependencies and wraps the pipeline in a simple command line interface, without sacrificing flexibility to adapt or limiting the options of underlying imputation tools. It does not require knowledge of a workflow system or programming, and is targeted at researchers who just want to apply best practices in imputation via simple commands. It is built on the MOLGENIS compute workflow framework to enable customization with additional computational steps or it can be included in other bioinformatics pipelines. It is available as open source from: https://github.com/molgenis/molgenis-imputation.",
                "authors": [
                    {
                        "name": "Byelas H."
                    },
                    {
                        "name": "Deelen P."
                    },
                    {
                        "name": "Dijkstra M."
                    },
                    {
                        "name": "Kanterakis A."
                    },
                    {
                        "name": "Swertz M.A."
                    },
                    {
                        "name": "Van Dijk F."
                    }
                ],
                "citationCount": 7,
                "date": "2015-08-19T00:00:00Z",
                "journal": "BMC Research Notes",
                "title": "Molgenis-impute: Imputation pipeline in a box"
            },
            "type": [
                "Review"
            ]
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Data management",
            "uri": "http://edamontology.org/topic_3071"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}
