{"credit":[{"name":"bils.se","typeEntity":"Institute","typeRoles":["Provider"]},{"email":"penriister@gmail.com","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://structure.bmc.lu.se/MultiDisp/MultiDinst.html"}],"function":[{"input":[{"data":{"term":"Sequence alignment","uri":"http://edamontology.org/data_0863"}}],"operation":[{"term":"Sequence visualisation","uri":"http://edamontology.org/operation_0564"}],"output":[{"data":{"term":"Sequence profile","uri":"http://edamontology.org/data_1354"}}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Data visualisation","uri":"http://edamontology.org/topic_0092"}]},"publication":[{"abstract":"A large number of disease-causing mutations have been identified from several protein kinases. KinMutBase is a comprehensive knowledge base for human disease-related mutations in protein kinase domains (http:// bioinf.uta.fi/KinMutBase/). The latest version contains 582 different mutations for 1,790 cases in 1,322 families. KinMutBase entries are described on the DNA, mRNA, and protein level. Numbers for affected patients and families are also provided. KinMutBase has extensive amount of links and cross-references to literature, other databases, and information sources. There are numerous interactive pages about sequences, structures, mutation statistics, and diseases. Detailed statistical study was done on frequencies of different types of mutations both on the DNA and protein level in serine/threonine kinase (PSK) and tyrosine kinase (PTK). Three-dimensional structures indicate clustering of disease-related mutations mainly to conserved subdomains, and substrate and coligand binding amino acids, although mutations appear throughout the sequences. CpG containing codons, especially for arginine, constitute the majority of mutational hotspots. There are certain clear differences in mutation patterns and types between PSKs and PTKs. © 2005 Wiley-Liss, Inc.","authors":["Ortutay C.","Valiaho J.","Stenberg K.","Vihinen M."],"cit_count":52,"doi":"10.1002/humu.20166","journal":"Human Mutation","title":"KinMutBase: A registry of disease-causing mutations in protein kinase domains","type":"Other","year":"2005-05-01"}],"summary":{"biotoolsCURIE":"biotools:multidisp","biotoolsID":"multidisp","description":"A tool for analysing and visualising multiple sequence alignments (MSAs).","homepage":"http://structure.bmc.lu.se/MultiDisp/index.html","name":"MultiDisp","version":["1"]}}