{
    "additionDate": "2018-09-03T04:24:15Z",
    "biotoolsCURIE": "biotools:condor",
    "biotoolsID": "condor",
    "credit": [
        {
            "email": "hantke@xray.bmc.uu.se",
            "name": "Max F. Hantke",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Simulation tool to predict X-ray far-field scattering amplitudes of isolated particles for customized experimental designs and samples, which the user defines by an atomic or a refractive index model.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://lmb.icm.uu.se/condor/static/docs/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                }
            ]
        }
    ],
    "homepage": "https://github.com/FXIhub/condor",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "BSD-2-Clause",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/FXIhub/condor/issues"
        }
    ],
    "name": "Condor",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1107/S1600576716009213",
            "metadata": {
                "abstract": "© Max F. Hantke et al. 2016.Flash X-ray imaging has the potential to determine structures down to molecular resolution without the need for crystallization. The ability to accurately predict the diffraction signal and to identify the optimal experimental configuration within the limits of the instrument is important for successful data collection. This article introduces Condor, an open-source simulation tool to predict X-ray far-field scattering amplitudes of isolated particles for customized experimental designs and samples, which the user defines by an atomic or a refractive index model. The software enables researchers to test whether their envisaged imaging experiment is feasible, and to optimize critical parameters for reaching the best possible result. It also aims to support researchers who intend to create or advance reconstruction algorithms by simulating realistic test data. Condor is designed to be easy to use and can be either installed as a Python package or used from its web interface (http://lmb.icm.uu.se/condor). X-ray free-electron lasers have high running costs and beam time at these facilities is precious. Data quality can be substantially improved by using simulations to guide the experimental design and simplify data analysis.Condor, an open-source simulation tool to predict X-ray scattering amplitudes for flash X-ray imaging experiments, is introduced.",
                "authors": [
                    {
                        "name": "Hantke M.F."
                    },
                    {
                        "name": "Ekeberg T."
                    },
                    {
                        "name": "Maia F.R.N.C."
                    }
                ],
                "citationCount": 18,
                "date": "2016-08-01T00:00:00Z",
                "journal": "Journal of Applied Crystallography",
                "title": "Condor: A simulation tool for flash X-ray imaging"
            },
            "pmcid": "PMC4970500",
            "pmid": "27504081",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application"
    ],
    "topic": [
        {
            "term": "X-ray diffraction",
            "uri": "http://edamontology.org/topic_2828"
        },
        {
            "term": "Experimental design and studies",
            "uri": "http://edamontology.org/topic_3678"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}