
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://sourceforge.net/projects/operasf/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://sourceforge.net/p/operasf/wiki/The%20OPERA%20wiki/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Animal and Crop Genomics"
        ],
        "language": [
            "Perl"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequence assembly",
                "uri": "http://edamontology.org/topic_0196"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2016 Gao et al.The assembly of large, repeat-rich eukaryotic genomes represents a significant challenge in genomics. While long-read technologies have made the high-quality assembly of small, microbial genomes increasingly feasible, data generation can be expensive for larger genomes. OPERA-LG is a scalable, exact algorithm for the scaffold assembly of large, repeat-rich genomes, out-performing state-of-the-art programs for scaffold correctness and contiguity. It provides a rigorous framework for scaffolding of repetitive sequences and a systematic approach for combining data from different second-generation and third-generation sequencing technologies. OPERA-LG provides an avenue for systematic augmentation and improvement of thousands of existing draft eukaryotic genome assemblies.",
            "authors": [
                "Gao S.",
                "Bertrand D.",
                "Chia B.K.H.",
                "Nagarajan N."
            ],
            "cit_count": 8,
            "doi": "10.1186/s13059-016-0951-y",
            "journal": "Genome Biology",
            "title": "OPERA-LG: Efficient and exact scaffolding of large, repeat-rich eukaryotic genomes with performance guarantees",
            "type": "Primary",
            "year": "2016-05-11"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:opera-lg",
        "biotoolsID": "opera-lg",
        "description": "Scalable, exact algorithm for the scaffold assembly of large, repeat-rich genomes, out-performing state-of-the-art programs for scaffold correctness and contiguity. It provides a rigorous framework for scaffolding of repetitive sequences and a systematic approach for combining data from different second-generation and third-generation sequencing technologies.",
        "homepage": "https://sourceforge.net/projects/operasf/",
        "name": "OPERA-LG"
    }
}