{
    "accessibility": "Open access",
    "additionDate": "2021-05-28T06:23:39Z",
    "biotoolsCURIE": "biotools:inflect",
    "biotoolsID": "inflect",
    "cost": "Free of charge",
    "description": "Optimizing Computational Workflows for Thermal Proteome Profiling Data Analysis.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Mass spectra calibration",
                    "uri": "http://edamontology.org/operation_3627"
                },
                {
                    "term": "Nucleic acid melting curve plotting",
                    "uri": "http://edamontology.org/operation_0458"
                },
                {
                    "term": "Protein quantification",
                    "uri": "http://edamontology.org/operation_3630"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/Inflect/index.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-05-28T06:23:39Z",
    "name": "Inflect",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1021/ACS.JPROTEOME.0C00872",
            "metadata": {
                "abstract": "© 2021 The Authors. Published by American Chemical Society.The CETSA and Thermal Proteome Profiling (TPP) analytical methods are invaluable for the study of protein-ligand interactions and protein stability in a cellular context. These tools have increasingly been leveraged in work ranging from understanding signaling paradigms to drug discovery. Consequently, there is an important need to optimize the data analysis pipeline that is used to calculate protein melt temperatures (Tm) and relative melt shifts from proteomics abundance data. Here, we report a user-friendly analysis of the melt shift calculation workflow where we describe the impact of each individual calculation step on the final output list of stabilized and destabilized proteins. This report also includes a description of how key steps in the analysis workflow quantitatively impact the list of stabilized/destabilized proteins from an experiment. We applied our findings to develop a more optimized analysis workflow that illustrates the dramatic sensitivity of chosen calculation steps on the final list of reported proteins of interest in a study and have made the R based program Inflect available for research community use through the CRAN repository [McCracken, N. Inflect: Melt Curve Fitting and Melt Shift Analysis. R package version 1.0.3, 2021]. The Inflect outputs include melt curves for each protein which passes filtering criteria in addition to a data matrix which is directly compatible with downstream packages such as UpsetR for replicate comparisons and identification of biologically relevant changes. Overall, this work provides an essential resource for scientists as they analyze data from TPP and CETSA experiments and implement their own analysis pipelines geared toward specific applications.",
                "authors": [
                    {
                        "name": "McCracken N.A."
                    },
                    {
                        "name": "Mosley A.L."
                    },
                    {
                        "name": "Peck Justice S.A."
                    },
                    {
                        "name": "Wijeratne A.B."
                    }
                ],
                "date": "2021-04-02T00:00:00Z",
                "journal": "Journal of Proteome Research",
                "title": "Inflect: Optimizing Computational Workflows for Thermal Proteome Profiling Data Analysis"
            },
            "pmcid": "PMC8022325",
            "pmid": "33660510",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ]
}
