{
    "accessibility": "Open access",
    "additionDate": "2023-08-17T10:37:36.585689Z",
    "biotoolsCURIE": "biotools:covid-19_mvss",
    "biotoolsID": "covid-19_mvss",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "kuanrong.chan@duke-nus.edu.sg",
            "name": "Kuan Rong Chan",
            "orcidid": "https://orcid.org/0000-0002-2427-671X",
            "typeEntity": "Person"
        }
    ],
    "description": "The online platform to query gene expression differences between severe and mild COVID-19 patients in these datasets.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Expression data",
                        "uri": "http://edamontology.org/data_2603"
                    }
                }
            ],
            "operation": [
                {
                    "term": "DNA vaccine design",
                    "uri": "http://edamontology.org/operation_0560"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Plot",
                        "uri": "http://edamontology.org/data_2884"
                    }
                }
            ]
        }
    ],
    "homepage": "https://kuanrongchan-covid19-severity-app-t7l38g.streamlitapp.com/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-08-17T10:37:36.590123Z",
    "license": "CC-BY-4.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/kuanrongchan/COVID19-severity"
        }
    ],
    "name": "COVID-19 MvsS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.EBIOM.2023.104472",
            "metadata": {
                "abstract": "Background: Mass vaccination has dramatically reduced the incidence of severe COVID-19, with most cases now presenting as self-limiting upper respiratory tract infections. However, those with co-morbidities, the elderly and immunocompromised, as well as the unvaccinated, remain disproportionately vulnerable to severe COVID-19 and its sequelae. Furthermore, as the effectiveness of vaccination wanes with time, immune escape SARS-CoV-2 variants could emerge to cause severe COVID-19. Reliable prognostic biomarkers for severe disease could be used as early indicator of re-emergence of severe COVID-19 as well as for triaging of patients for antiviral therapy. Methods: We performed a systematic review and re-analysis of 7 publicly available datasets, analysing a total of 140 severe and 181 mild COVID-19 patients, to determine the most consistent differentially regulated genes in peripheral blood of severe COVID-19 patients. In addition, we included an independent cohort where blood transcriptomics of COVID-19 patients were prospectively and longitudinally monitored previously, to track the time in which these gene expression changes occur before nadir of respiratory function. Single cell RNA-sequencing of peripheral blood mononuclear cells from publicly available datasets was then used to determine the immune cell subsets involved. Findings: The most consistent differentially regulated genes in peripheral blood of severe COVID-19 patients were MCEMP1, HLA-DRA and ETS1 across the 7 transcriptomics datasets. Moreover, we found significantly heightened MCEMP1 and reduced HLA-DRA expression as early as four days before the nadir of respiratory function, and the differential expression of MCEMP1 and HLA-DRA occurred predominantly in CD14+ cells. The online platform which we developed is publicly available at https://kuanrongchan-covid19-severity-app-t7l38g.streamlitapp.com/, for users to query gene expression differences between severe and mild COVID-19 patients in these datasets. Interpretation: Elevated MCEMP1 and reduced HLA-DRA gene expression in CD14+ cells during the early phase of disease are prognostic of severe COVID-19. Funding: K.R.C is funded by the National Medical Research Council (NMRC) of Singapore under the Open Fund Individual Research Grant ( MOH-000610). E.E.O. is funded by the NMRC Senior Clinician-Scientist Award ( MOH-000135-00). J.G.H.L. is funded by the NMRC under the Clinician-Scientist Award ( NMRC/CSAINV/013/2016-01). S.K. is funded by the NMRC under the Transition Award. This study was sponsored in part by a generous gift from The Hour Glass.",
                "authors": [
                    {
                        "name": "Chan K.R."
                    },
                    {
                        "name": "Kalimuddin S."
                    },
                    {
                        "name": "Koh C.W.T."
                    },
                    {
                        "name": "Low J.G.H."
                    },
                    {
                        "name": "Ng D.H.L."
                    },
                    {
                        "name": "Ong E.Z."
                    },
                    {
                        "name": "Ooi E.E."
                    },
                    {
                        "name": "Ooi J.S.G."
                    },
                    {
                        "name": "Qin S."
                    },
                    {
                        "name": "Sam H."
                    },
                    {
                        "name": "Zhang S.L.X."
                    }
                ],
                "citationCount": 1,
                "date": "2023-03-01T00:00:00Z",
                "journal": "eBioMedicine",
                "title": "Early peripheral blood MCEMP1 and HLA-DRA expression predicts COVID-19 prognosis"
            },
            "pmcid": "PMC9934388",
            "pmid": "36801619",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application",
        "Web application"
    ],
    "topic": [
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Virology",
            "uri": "http://edamontology.org/topic_0781"
        }
    ]
}
