{
    "additionDate": "2020-01-23T16:19:46Z",
    "biotoolsCURIE": "biotools:SPROUTS",
    "biotoolsID": "SPROUTS",
    "description": "SPROUTS has two general functions.\nThe first is to provide existing mutation data given a protein specified by a PDB ID. This is Query mode.\nThe second is to generate new mutation data based on a new PDB ID or a user input. This is Submit mode.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://sprouts.rpbs.univ-paris-diderot.fr/",
    "lastUpdate": "2020-01-23T16:19:46Z",
    "name": "SPROUTS",
    "owner": "reyjul",
    "publication": [
        {
            "doi": "10.1515/bams-2014-0015",
            "metadata": {
                "abstract": "The transition state ensemble during the folding process of globular proteins occurs when a sufficient number of intrachain contacts are formed, mainly, but not exclusively, due to hydrophobic interactions. These contacts are related to the folding nucleus, and they contribute to the stability of the native structure, although they may disappear after the energetic barrier of transition states has been passed. A number of structure and sequence analyses, as well as protein engineering studies, have shown that the signature of the folding nucleus is surprisingly present in the native three-dimensional structure, in the form of closed loops, and also in the early folding events. These findings support the idea that the residues of the folding nucleus become buried in the very first folding events, therefore helping the formation of closed loops that act as anchor structures, speed up the process, and overcome the Levinthal paradox. We present here a review of an algorithm intended to simulate in a discrete space the early steps of the folding process. It is based on a Monte Carlo simulation where perturbations, or moves, are randomly applied to residues within a sequence. In contrast with many technically similar approaches, this model does not intend to fold the protein but to calculate the number of non-covalent neighbors of each residue, during the early steps of the folding process. Amino acids along the sequence are categorized as most interacting residues (MIRs) or least interacting residues. The MIR method can be applied under a variety of circumstances. In the cases tested thus far, MIR has successfully identified the exact residue whose mutation causes a switch in conformation. This follows with the idea thatMIR identifies residues that are important in the folding process. Most MIR positions correspond to hydrophobic residues; correspondingly, MIRs have zero or very low accessible surface area. Alongside the review of the MIR method, we present a new postprocessing method called smoothed MIR (SMIR), which refines the original MIR method by exploiting the knowledge of residue hydrophobicity. We review known results and present new ones, focusing on the ability of MIR to predict structural changes, secondary structure, and the improved precision with the SMIR method.",
                "authors": [
                    {
                        "name": "Acuna R."
                    },
                    {
                        "name": "Lacroix Z."
                    },
                    {
                        "name": "Papandreou N."
                    },
                    {
                        "name": "Chomilier J."
                    }
                ],
                "citationCount": 4,
                "date": "2014-12-01T00:00:00Z",
                "journal": "Bio-Algorithms and Med-Systems",
                "title": "Protein intrachain contact prediction with most interacting residues (MIR)"
            }
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}