{
    "additionDate": "2017-02-10T14:15:39Z",
    "biotoolsCURIE": "biotools:biobayesnet",
    "biotoolsID": "biobayesnet",
    "description": "Server for feature extraction and Bayesian network modeling of biological sequence data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                },
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                },
                {
                    "term": "Network simulation",
                    "uri": "http://edamontology.org/operation_3562"
                }
            ]
        }
    ],
    "homepage": "http://biwww3.informatik.uni-freiburg.de:8080/BioBayesNet/",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:40Z",
    "name": "BioBayesNet",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "BioBayesNet is a new web application that allows the easy modeling and classification of biological data using Bayesian networks. To learn Bayesian networks the user can either upload a set of annotated FASTA sequences or a set of pre-computed feature vectors. In case of FASTA sequences, the server is able to generate a wide range of sequence and structural features from the sequences. These features are used to learn Bayesian networks. An automatic feature selection procedure assists in selecting discriminative features, providing an (locally) optimal set of features. The output includes several quality measures of the overall network and individual features as well as a graphical representation of the network structure, which allows to explore dependencies between features. Finally, the learned Bayesian network or another uploaded network can be used to classify new data. BioBayesNet facilitates the use of Bayesian networks in biological sequences analysis and is flexible to support modeling and classification applications in various scientific fields. The BioBayesNet server is available at http://biwww3. informatik.uni-freiburg.de: 8080/BioBayesNet/. © 2007 The Author(s).",
                "authors": [
                    {
                        "name": "Nikolajewa S."
                    },
                    {
                        "name": "Pudimat R."
                    },
                    {
                        "name": "Hiller M."
                    },
                    {
                        "name": "Platzer M."
                    },
                    {
                        "name": "Backofen R."
                    }
                ],
                "citationCount": 14,
                "date": "2007-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "BioBayesNet: A web server for feature extraction and Bayesian network modeling of biological sequence data"
            },
            "pmid": "17537825"
        },
        {
            "metadata": {
                "abstract": "Motivation: The identification of transcription factor binding sites in promoter sequences is an important problem, since it reveals information about the transcriptional regulation of genes. For analysing transcriptional regulation, computational approaches for predicting putative binding sites are applied. Commonly used stochastic models for binding sites are position-specific score matrices, which show weak predictive power. Results: We have developed a probabilistic modelling approach, which allows to consider diverse characteristic binding site properties to obtain more accurate representations of binding sites. These properties are modelled as random variables in Bayesian networks, which are capable of dealing with dependencies among binding site properties. Cross-validation on several datasets shows improvements in the false positive error rate and the significance (P-value) of true binding sites. © The Author 2005. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Pudimat R."
                    },
                    {
                        "name": "Schukat-Talamazzini E.-G."
                    },
                    {
                        "name": "Backofen R."
                    }
                ],
                "citationCount": 26,
                "date": "2005-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "A multiple-feature framework for modelling and predicting transcription factor binding sites"
            },
            "pmid": "15905283"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}