{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://cgil.uoguelph.ca/people/"}],"documentation":[{"type":"GENERAL","url":"http://www.aps.uoguelph.ca/~msargol/fimpute/"}],"function":[{"operation":[{"term":"Imputation","uri":"http://edamontology.org/operation_3557"}]}],"labels":{"collectionID":["Animal and Crop Genomics"],"operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"Population genetics","uri":"http://edamontology.org/topic_3056"}]},"publication":[{"abstract":"Background: Genotype imputation can help reduce genotyping costs particularly for implementation of genomic selection. In applications entailing large populations, recovering the genotypes of untyped loci using information from reference individuals that were genotyped with a higher density panel is computationally challenging. Popular imputation methods are based upon the Hidden Markov model and have computational constraints due to an intensive sampling process. A fast, deterministic approach, which makes use of both family and population information, is presented here. All individuals are related and, therefore, share haplotypes which may differ in length and frequency based on their relationships. The method starts with family imputation if pedigree information is available, and then exploits close relationships by searching for long haplotype matches in the reference group using overlapping sliding windows. The search continues as the window size is shrunk in each chromosome sweep in order to capture more distant relationships.Results: The proposed method gave higher or similar imputation accuracy than Beagle and Impute2 in cattle data sets when all available information was used. When close relatives of target individuals were present in the reference group, the method resulted in higher accuracy compared to the other two methods even when the pedigree was not used. Rare variants were also imputed with higher accuracy. Finally, computing requirements were considerably lower than those of Beagle and Impute2. The presented method took 28 minutes to impute from 6 k to 50 k genotypes for 2,000 individuals with a reference size of 64,429 individuals.Conclusions: The proposed method efficiently makes use of information from close and distant relatives for accurate genotype imputation. In addition to its high imputation accuracy, the method is fast, owing to its deterministic nature and, therefore, it can easily be used in large data sets where the use of other methods is impractical. © 2014 Sargolzaei et al.; licensee BioMed Central Ltd.","authors":["Sargolzaei M.","Chesnais J.P.","Schenkel F.S."],"cit_count":192,"doi":"10.1186/1471-2164-15-478","journal":"BMC Genomics","title":"A new approach for efficient genotype imputation using information from relatives","type":"Primary","year":"2014-06-17"}],"summary":{"biotoolsCURIE":"biotools:fimpute","biotoolsID":"fimpute","description":"Developed for large scale genotype imputation in livestock where hundreds of thousands of individuals are genotypes with different panels. It uses an overlapping sliding window approach to exploit relationships or haplotype similarities between target and reference individuals. The process starts with long windows to capture haplotype similarity between close relatives.","homepage":"http://www.aps.uoguelph.ca/~msargol/fimpute/","name":"FImpute"}}