{
    "name": "Precise", 
    "description": "Predict regulatory cis-acting elements through DNA sequences. This tool aimed at advanced mining of specific biological data: sequence data of DNA sequences that lie upstream of regions with known coding function.", 
    "homepage": "http://www.wageningenur.nl/en/show/PRECISE-Prediction-of-REgulatory-CISacting-Elements.htm", 
    "biotoolsID": "precise", 
    "biotoolsCURIE": "biotools:precise", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0438", 
                    "term": "Regulatory element prediction"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Desktop application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0080", 
            "term": "Sequence analysis"
        }, 
        {
            "uri": "http://edamontology.org/topic_0654", 
            "term": "DNA"
        }, 
        {
            "uri": "http://edamontology.org/topic_0749", 
            "term": "Transcription factors and regulatory sites"
        }
    ], 
    "operatingSystem": [
        "Windows"
    ], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/precise-predict-regulatory-cis-acting-elements.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://www.wur.nl/upload_mm/1/3/c/5766fafc-a226-4d7c-998f-0c14ab689755_precise_manual.pdf", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "16135709", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "PRECISE: Software for prediction of cis-acting regulatory elements", 
                "abstract": "The regulation of gene expression at the transcription initiation level is highly complex and requires the presence of multiple transcription factors. These transcription factors are often proteins or peptides that bind to the so-called cis-acting elements, which are present in the promoter regions and conserved among different species. In order to predict these cis-acting elements, a computer program called PRECISE (Prediction of REgulatory CIS-acting Elements) was developed. The power of the tool lies in its user-friendly interface and in the possibility of using empirical motif frequency tables to filter through the many discovered motifs. The tools to create the empirical motif frequency table (e.g., from a whole genome sequence) are included in the package. In the first case study, the upstream regions of all the genes in the Arabidopsis genome were used to create an empirical motif frequency table and a set of 64 upstream sequences of genes known to be involved in starch metabolism was subjected to analysis by PRECISE. The 20 motifs with the highest specificity in the selected set were analyzed in more detail. Of these 20 motifs, 15 showed a very high or complete homology to the sequences of known cis-acting elements. These cis-acting elements are regulated by light, auxin, and abscisic acid, and confer specific expression in sink organs such as leaves and seeds. All these factors have been shown to play an important role in starch biosynthesis. In the second case study, the upstream regions of 16 genes whose transcription is induced by gibberellins (GA) in Arabidopsis were analyzed with PRECISE and compared to the motifs present in the PLACE database. Among the most promising motifs found by PRECISE were 6 of the 17 known GA motifs. These results indicate the power of the PRECISE software package in the prediction of regulatory elements. © The American Genetic Association. 2005. All rights reserved.", 
                "date": "2005-09-01T00:00:00Z", 
                "citationCount": 3, 
                "authors": [
                    {
                        "name": "Trindade L.M."
                    }, 
                    {
                        "name": "Van Berloo R."
                    }, 
                    {
                        "name": "Fiers M."
                    }, 
                    {
                        "name": "Visser R.G.F."
                    }
                ], 
                "journal": "Journal of Heredity"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": null, 
            "url": "http://www.wageningenur.nl/en/Expertise-Services/Collaboration-and-partnerships/Plant-Breeding.htm", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T18:56:12Z", 
    "lastUpdate": "2018-12-10T12:58:57Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}