{
    "additionDate": "2021-01-18T12:03:41Z",
    "biotoolsCURIE": "biotools:salign",
    "biotoolsID": "salign",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hammad.naveed@nu.edu.pk",
            "name": "Hammad Naveed",
            "orcidid": "https://orcid.org/0000-0002-1867-974X",
            "typeEntity": "Person"
        }
    ],
    "description": "structure aware method for global PPI network alignment.\n\nTo reproduce the results reported in SAlign paper, use \"Reproduce_Paper_Results\" folder. This folder contains all the files that are used in alignment generation and evaluation.\n\n\"SAlign and SAlign_mc Code\" folder contains code with test example. If you want to run SAlign on your own collected datasets please run \"SAlign and SAlign_mc Code\" folder.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Global alignment",
                    "uri": "http://edamontology.org/operation_0496"
                },
                {
                    "term": "Pairwise sequence alignment",
                    "uri": "http://edamontology.org/operation_0491"
                },
                {
                    "term": "Global structure alignment",
                    "uri": "http://edamontology.org/operation_0510"
                },
                {
                    "term": "Pairwise structure alignment",
                    "uri": "http://edamontology.org/operation_0503"
                },
                {
                    "term": "Local alignment",
                    "uri": "http://edamontology.org/operation_0495"
                }
            ]
        }
    ],
    "homepage": "https://github.com/cbrl-nuces/SAlign",
    "lastUpdate": "2021-02-10T15:21:38Z",
    "name": "SAlign",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03827-5",
            "metadata": {
                "abstract": "© 2020, The Author(s).Background: High throughput experiments have generated a significantly large amount of protein interaction data, which is being used to study protein networks. Studying complete protein networks can reveal more insight about healthy/disease states than studying proteins in isolation. Similarly, a comparative study of protein–protein interaction (PPI) networks of different species reveals important insights which may help in disease analysis and drug design. The study of PPI network alignment can also helps in understanding the different biological systems of different species. It can also be used in transfer of knowledge across different species. Different aligners have been introduced in the last decade but developing an accurate and scalable global alignment algorithm that can ensures the biological significance alignment is still challenging. Results: This paper presents a novel global pairwise network alignment algorithm, SAlign, which uses topological and biological information in the alignment process. The proposed algorithm incorporates sequence and structural information for computing biological scores, whereas previous algorithms only use sequence information. The alignment based on the proposed technique shows that the combined effect of structure and sequence results in significantly better pairwise alignments. We have compared SAlign with state-of-art algorithms on the basis of semantic similarity of alignment and the number of aligned nodes on multiple PPI network pairs. The results of SAlign on the network pairs which have high percentage of proteins with available structure are 3–63% semantically better than all existing techniques. Furthermore, it also aligns 5–14% more nodes of these network pairs as compared to existing aligners. The results of SAlign on other PPI network pairs are comparable or better than all existing techniques. We also introduce SAlign mc, a Monte Carlo based alignment algorithm, that produces multiple network alignments with similar semantic similarity. This helps the user to pick biologically meaningful alignments. Conclusion: The proposed algorithm has the ability to find the alignments that are more biologically significant/relevant as compared to the alignments of existing aligners. Furthermore, the proposed method is able to generate alternate alignments that help in studying different genes/proteins of the specie.",
                "authors": [
                    {
                        "name": "Ayub U."
                    },
                    {
                        "name": "Haider I."
                    },
                    {
                        "name": "Naveed H."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SAlign–a structure aware method for global PPI network alignment"
            },
            "pmcid": "PMC7640460",
            "pmid": "33148180"
        }
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Protein interaction experiment",
            "uri": "http://edamontology.org/topic_3957"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        }
    ]
}