{
    "additionDate": "2020-01-09T17:49:35Z",
    "biotoolsCURIE": "biotools:ODIAC",
    "biotoolsID": "ODIAC",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "tomohiro.oda@nasa.gov",
            "name": "Tomohiro Oda",
            "typeEntity": "Person"
        }
    ],
    "description": "A global, monthly fossil-fuel CO2 gridded emission data product for tracer transport simulations and surface flux inversions.\n\nCenter for Global Environmental Research.\n\nThe Open-Data Inventory for Anthropogenic Carbon dioxide (ODIAC) is a high-spatial resolution global emission data product of CO2 emissions from fossil fuel combustion (Oda and Maksyutov, 2011). In 2009, the first version of ODIAC was developed by Drs. Tomohiro Oda (now at USRA/NASA Goddard) and Shamil Maksyutov under the Greenhouse gases Observing SATellite (GOSAT) project at the National Institute for Environmental Studies (NIES) in Japan.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'ODIAC2016', 'ODIAC2017'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "homepage": "http://db.cger.nies.go.jp/dataset/ODIAC/",
    "lastUpdate": "2020-01-09T17:49:35Z",
    "name": "ODIAC",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.5194/ESSD-10-87-2018",
            "metadata": {
                "abstract": "© Author(s) 2018.The Open-source Data Inventory for Anthropogenic CO2 (ODIAC) is a global high-spatial-resolution gridded emissions data product that distributes carbon dioxide (CO2) emissions from fossil fuel combustion. The emissions spatial distributions are estimated at a 1 × 1km spatial resolution over land using power plant profiles (emissions intensity and geographical location) and satellite-observed nighttime lights. This paper describes the year 2016 version of the ODIAC emissions data product (ODIAC2016) and presents analyses that help guide data users, especially for atmospheric CO2 tracer transport simulations and flux inversion analysis. Since the original publication in 2011, we have made modifications to our emissions modeling framework in order to deliver a comprehensive global gridded emissions data product. Major changes from the 2011 publication are (1) the use of emissions estimates made by the Carbon Dioxide Information Analysis Center (CDIAC) at the Oak Ridge National Laboratory (ORNL) by fuel type (solid, liquid, gas, cement manufacturing, gas flaring, and international aviation and marine bunkers); (2) the use of multiple spatial emissions proxies by fuel type such as (a) nighttime light data specific to gas flaring and (b) ship/aircraft fleet tracks; and (3) the inclusion of emissions temporal variations. Using global fuel consumption data, we extrapolated the CDIAC emissions estimates for the recent years and produced the ODIAC2016 emissions data product that covers 2000-2015. Our emissions data can be viewed as an extended version of CDIAC gridded emissions data product, which should allow data users to impose global fossil fuel emissions in a more comprehensive manner than the original CDIAC product. Our new emissions modeling framework allows us to produce future versions of the ODIAC emissions data product with a timely update. Such capability has become more significant given the CDIAC/ORNL's shutdown. The ODIAC data product could play an important role in supporting carbon cycle science, especially modeling studies with space-based CO2 data collected in near real time by ongoing carbon observing missions such as the Japanese Greenhouse gases Observing SATellite (GOSAT), NASA's Orbiting Carbon Observatory-2 (OCO-2), and upcoming future missions. The ODIAC emissions data product including the latest version of the ODIAC emissions data (ODIAC2017, 2000-2016) is distributed from http://db.cger.nies.go.jp/dataset/ODIAC/ with a DOI (https://doi.org/10.17595/20170411.001).",
                "authors": [
                    {
                        "name": "Oda T."
                    },
                    {
                        "name": "Maksyutov S."
                    },
                    {
                        "name": "Andres R.J."
                    }
                ],
                "citationCount": 61,
                "date": "2018-01-18T00:00:00Z",
                "journal": "Earth System Science Data",
                "title": "The Open-source Data Inventory for Anthropogenic CO2, version 2016 (ODIAC2016): A global monthly fossil fuel CO2 gridded emissions data product for tracer transport simulations and surface flux inversions"
            },
            "pmcid": "PMC6818511",
            "pmid": "31662803"
        }
    ],
    "topic": [
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ]
}