{
    "additionDate": "2020-01-09T18:00:57Z",
    "biotoolsCURIE": "biotools:funtrp",
    "biotoolsID": "funtrp",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "mmiller@bromberglab.org",
            "name": "Maximilian Miller",
            "orcidid": "https://orcid.org/0000-0002-1335-9499",
            "typeEntity": "Person"
        },
        {
            "email": "yana@bromberglab.org",
            "name": "Yana Bromberg",
            "typeEntity": "Person"
        }
    ],
    "description": "identifying protein positions for variation driven functional tuning.\n\nEvaluating the impact of non-synonymous genetic variants is essential for uncovering disease associations and mechanisms of evolution. An in-depth understanding of sequence changes is also fundamental for synthetic protein design and stability assessments. However, the variant effect predictor performance gain observed in recent years has not kept up with the increased complexity of new methods. One likely reason for this might be that most approaches use similar sets of gene and protein features for modeling variant effects, often emphasizing sequence conservation. While high levels of conservation highlight residues essential for protein activity, much of the variation observable in vivo is arguably weaker in its impact, thus requiring evaluation at a higher level of resolution",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant effect prediction",
                    "uri": "http://edamontology.org/operation_0331"
                },
                {
                    "term": "Dimethyl",
                    "uri": "http://edamontology.org/operation_3642"
                },
                {
                    "term": "Metal-binding site prediction",
                    "uri": "http://edamontology.org/operation_3898"
                }
            ]
        }
    ],
    "homepage": "https://services.bromberglab.org/funtrp",
    "lastUpdate": "2020-01-09T18:00:57Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://bitbucket.org/bromberglab/funtrp"
        }
    ],
    "name": "funtrp",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/NAR/GKZ818",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press on behalf of Nucleic Acids Research.Evaluating the impact of non-synonymous genetic variants is essential for uncovering disease associations and mechanisms of evolution. An in-depth understanding of sequence changes is also fundamental for synthetic protein design and stability assessments. However, the variant effect predictor performance gain observed in recent years has not kept up with the increased complexity of new methods. One likely reason for this might be that most approaches use similar sets of gene and protein features for modeling variant effects, often emphasizing sequence conservation. While high levels of conservation highlight residues essential for protein activity, much of the variation observable in vivo is arguably weaker in its impact, thus requiring evaluation at a higher level of resolution. Here, we describe functionNeutral/Toggle/Rheostatpredictor (funtrp), a novel computational method that categorizes protein positions based on the position-specific expected range of mutational impacts: Neutral (weak/no effects), Rheostat (function-tuning positions), or Toggle (on/off switches). We show that position types do not correlate strongly with familiar protein features such as conservation or protein disorder. We also find that position type distribution varies across different protein functions. Finally, we demonstrate that position types can improve performance of existing variant effect predictors and suggest a way forward for the development of new ones.",
                "authors": [
                    {
                        "name": "Miller M."
                    },
                    {
                        "name": "Vitale D."
                    },
                    {
                        "name": "Kahn P.C."
                    },
                    {
                        "name": "Rost B."
                    },
                    {
                        "name": "Bromberg Y."
                    }
                ],
                "citationCount": 3,
                "date": "2019-12-02T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "funtrp: identifying protein positions for variation driven functional tuning"
            },
            "pmcid": "PMC6868392",
            "pmid": "31584091"
        }
    ],
    "topic": [
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        }
    ]
}