{
    "additionDate": "2019-11-14T18:22:04Z",
    "biotoolsCURIE": "biotools:FAConstructor",
    "biotoolsID": "FAConstructor",
    "confidence_flag": "tool",
    "description": "An interactive tool for geometric modeling of nerve fiber architectures in the brain | The fiber arcitecture constructor (FAConstructor) allows a simple and effective creation of fiber models based on mathematical functions or the manual input of data points. Models are visualized during creation and can be interacted with by translating them in the 3-dimensional space",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/3d-pli/FAConstructor",
    "language": [
        "C++"
    ],
    "lastUpdate": "2024-11-24T20:52:04.837021Z",
    "license": "GPL-3.0",
    "name": "FAConstructor",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/s11548-019-02053-6",
            "metadata": {
                "abstract": "Purpose: The technique 3D polarized light imaging (3D-PLI) allows to reconstruct nerve fiber orientations of postmortem brains with ultra-high resolution. To better understand the physical principles behind 3D-PLI and improve the accuracy and reliability of the reconstructed fiber orientations, numerical simulations are employed which use synthetic nerve fiber models as input. As the generation of fiber models can be challenging and very time-consuming, we have developed the open source FAConstructor tool which enables a fast and efficient generation of synthetic fiber models for 3D-PLI simulations. Methods : The program was developed as an interactive tool, allowing the user to define fiber pathways with interpolation methods or parametric functions and providing visual feedback. Results : Performance tests showed that most processes scale almost linearly with the amount of fiber points in FAConstructor. Fiber models consisting of < 1.6 million data points retain a frame rate of more than 30 frames per second, which guarantees a stable and fluent workflow. The applicability of FAConstructor was demonstrated on a well-defined fiber model (Fiber Cup phantom) for two different simulation approaches, reproducing effects known from 3D-PLI measurements. Conclusion : We have implemented a user-friendly and efficient tool that enables an interactive and fast generation of synthetic nerve fiber configurations for 3D-PLI simulations. Already existing fiber models can easily be modified, allowing to simulate many different fiber models in a reasonable amount of time.",
                "authors": [
                    {
                        "name": "Amunts K."
                    },
                    {
                        "name": "Axer M."
                    },
                    {
                        "name": "Ginsburger K."
                    },
                    {
                        "name": "Matuschke F."
                    },
                    {
                        "name": "Menzel M."
                    },
                    {
                        "name": "Poupon C."
                    },
                    {
                        "name": "Reuter J.A."
                    },
                    {
                        "name": "Schubert N."
                    }
                ],
                "citationCount": 4,
                "date": "2019-11-01T00:00:00Z",
                "journal": "International Journal of Computer Assisted Radiology and Surgery",
                "title": "FAConstructor: an interactive tool for geometric modeling of nerve fiber architectures in the brain"
            },
            "pmcid": "PMC6851223",
            "pmid": "31401715"
        }
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        }
    ],
    "validated": 1
}
