{
    "accessibility": "Open access",
    "additionDate": "2016-03-24T16:22:28Z",
    "biotoolsCURIE": "biotools:repet",
    "biotoolsID": "repet",
    "collectionID": [
        "REPET",
        "elixir-fr-sdp-2019"
    ],
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "urgi-repet@versailles.inra.fr",
            "name": "URGI",
            "note": "This tool has a \"Numero de depot APP\": FR 001 480007 000 R P 2008 000 31 235",
            "typeEntity": "Institute",
            "typeRole": [
                "Developer",
                "Contributor",
                "Maintainer",
                "Provider",
                "Support",
                "Documentor"
            ],
            "url": "http://urgi.versailles.inra.fr/"
        }
    ],
    "description": "The REPET package integrates bioinformatics pipelines dedicated to detecte, annotate and analyse transposable elements (TEs) in genomic sequences. The main pipelines are (i) TEdenovo, which search for interspersed repeats, build consensus sequences and classify them according to TE features, and (ii)\n TEannot, which mines a genome with a library of TE sequences, for instance the one produced by the TEdenovo pipeline, to provide TE annotations exported into GFF3 files.",
    "documentation": [
        {
            "note": "see also https://urgi.versailles.inra.fr/Tools/REPET/README",
            "type": [
                "General"
            ],
            "url": "https://urgi.versailles.inra.fr/Tools/REPET"
        },
        {
            "type": [
                "Installation instructions"
            ],
            "url": "https://urgi.versailles.inra.fr/Tools/REPET/INSTALL"
        },
        {
            "note": "See also https://urgi.versailles.inra.fr/Tools/REPET/TEannot-tuto",
            "type": [
                "User manual"
            ],
            "url": "https://urgi.versailles.inra.fr/Tools/REPET/TEdenovo-tuto"
        },
        {
            "note": "Usualy for v2.5\nFor the v3.0 it is in progress, it will be available in 2020 (june); Tutorial",
            "type": [
                "Training material"
            ],
            "url": "https://biosphere.france-bioinformatique.fr/wikia2/index.php/REPET_practical_course_urgi"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://urgi.versailles.inra.fr/download/repet/REPET_linux-x64-3.0.tar.gz",
            "version": "v3.0"
        }
    ],
    "editPermission": {
        "authors": [
            "vjamilloux"
        ],
        "type": "group"
    },
    "elixirNode": [
        "France"
    ],
    "elixirPlatform": [
        "Tools"
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "DNA sequence",
                        "uri": "http://edamontology.org/data_3494"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Repeat sequence detection",
                    "uri": "http://edamontology.org/operation_0379"
                },
                {
                    "term": "Repeat sequence analysis",
                    "uri": "http://edamontology.org/operation_0237"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "DNA sequence",
                        "uri": "http://edamontology.org/data_3494"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Feature table",
                        "uri": "http://edamontology.org/data_1270"
                    },
                    "format": [
                        {
                            "term": "Sequence feature table format (text)",
                            "uri": "http://edamontology.org/format_2206"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Annotation track",
                        "uri": "http://edamontology.org/data_3002"
                    },
                    "format": [
                        {
                            "term": "GFF3-seq",
                            "uri": "http://edamontology.org/format_1939"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "https://urgi.versailles.inra.fr/Tools/REPET",
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:27Z",
    "license": "CECILL-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://urgi.versailles.inra.fr/download/repet/"
        }
    ],
    "maturity": "Legacy",
    "name": "REPET",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Institut Francais de Bioinform",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0091929",
            "metadata": {
                "abstract": "Summary: The classification of transposable elements (TEs) is key step towards deciphering their potential impact on the genome. However, this process is often based on manual sequence inspection by TE experts. With the wealth of genomic sequences now available, this task requires automation, making it accessible to most scientists. We propose a new tool, PASTEC, which classifies TEs by searching for structural features and similarities. This tool outperforms currently available software for TE classification. The main innovation of PASTEC is the search for HMM profiles, which is useful for inferring the classification of unknown TE on the basis of conserved functional domains of the proteins. In addition, PASTEC is the only tool providing an exhaustive spectrum of possible classifications to the order level of the Wicker hierarchical TE classification system. It can also automatically classify other repeated elements, such as SSR (Simple Sequence Repeats), rDNA or potential repeated host genes. Finally, the output of this new tool is designed to facilitate manual curation by providing to biologists with all the evidence accumulated for each TE consensus. Availability: PASTEC is available as a REPET module or standalone software (http://urgi.versailles.inra.fr/download/repet/REPET-linux-x64-2.2.tar. gz). It requires a Unix-like system. There are two standalone versions: one of which is parallelized (requiring Sun grid Engine or Torque), and the other of which is not. © 2014 Hoede et al.",
                "authors": [
                    {
                        "name": "Hoede C."
                    },
                    {
                        "name": "Arnoux S."
                    },
                    {
                        "name": "Moisset M."
                    },
                    {
                        "name": "Chaumier T."
                    },
                    {
                        "name": "Inizan O."
                    },
                    {
                        "name": "Jamilloux V."
                    },
                    {
                        "name": "Quesneville H."
                    }
                ],
                "citationCount": 80,
                "date": "2014-05-02T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "PASTEC: An automatic transposable element classification tool"
            },
            "pmcid": "PMC4008368",
            "pmid": "24786468",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1371/journal.pone.0016526",
            "metadata": {
                "abstract": "Transposable elements (TEs) are mobile, repetitive DNA sequences that are almost ubiquitous in prokaryotic and eukaryotic genomes. They have a large impact on genome structure, function and evolution. With the recent development of highthroughput sequencing methods, many genome sequences have become available, making possible comparative studies of TE dynamics at an unprecedented scale. Several methods have been proposed for the de novo identification of TEs in sequenced genomes. Most begin with the detection of genomic repeats, but the subsequent steps for defining TE families differ. High-quality TE annotations are available for the Drosophila melanogaster and Arabidopsis thaliana genome sequences, providing a solid basis for the benchmarking of such methods. We compared the performance of specific algorithms for the clustering of interspersed repeats and found that only a particular combination of algorithms detected TE families with good recovery of the reference sequences. We then applied a new procedure for reconciling the different clustering results and classifying TE sequences. The whole approach was implemented in a pipeline using the REPET package. Finally, we show that our combined approach highlights the dynamics of well defined TE families by making it possible to identify structural variations among their copies. This approach makes it possible to annotate TE families and to study their diversification in a single analysis, improving our understanding of TE dynamics at the whole-genome scale and for diverse species. © 2011 Flutre et al.",
                "authors": [
                    {
                        "name": "Flutre T."
                    },
                    {
                        "name": "Duprat E."
                    },
                    {
                        "name": "Feuillet C."
                    },
                    {
                        "name": "Quesneville H."
                    }
                ],
                "citationCount": 213,
                "date": "2011-02-09T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Considering transposable element diversification in de novo annotation approaches"
            },
            "pmcid": "PMC3031573",
            "pmid": "21304975",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1371/journal.pcbi.0010022",
            "metadata": {
                "abstract": "Transposable elements (TEs) are mobile, repetitive sequences that make up significant fractions of metazoan genomes. Despite their near ubiquity and importance in genome and chromosome biology, most efforts to annotate TEs in genome sequences rely on the results of a single computational program, RepeatMasker. In contrast, recent advances in gene annotation indicate that high-quality gene models can be produced from combining multiple independent sources of computational evidence. To elevate the quality of TE annotations to a level comparable to that of gene models, we have developed a combined evidence-model TE annotation pipeline, analogous to systems used for gene annotation, by integrating results from multiple homology-based and de novo TE identification methods. As proof of principle, we have annotated \"TE models\" in Drosophila melanogaster Release 4 genomic sequences using the combined computational evidence derived from RepeatMasker, BLASTER, TBLASTX, all-by-all BLASTN, RECON, TE-HMM and the previous Release 3.1 annotation. Our system is designed for use with the Apollo genome annotation tool, allowing automatic results to be curated manually to produce reliable annotations. The euchromatic TE fraction of D. melanogaster is now estimated at 5.3% (cf. 3.86% in Release 3.1), and we found a substantially higher number of TEs (n = 6,013) than previously identified (n = 1,572). Most of the new TEs derive from small fragments of a few hundred nucleotides long and highly abundant families not previously annotated (e.g., INE-1). We also estimated that 518 TE copies (8.6%) are inserted into at least one other TE, forming a nest of elements. The pipeline allows rapid and thorough annotation of even the most complex TE models, including highly deleted and/or nested elements such as those often found in heterochromatic sequences. Our pipeline can be easily adapted to other genome sequences, such as those of the D. melanogaster heterochromatin or other species in the genus Drosophila. © 2005 Quesneville et al.",
                "authors": [
                    {
                        "name": "Quesneville H."
                    },
                    {
                        "name": "Bergman C.M."
                    },
                    {
                        "name": "Andrieu O."
                    },
                    {
                        "name": "Autard D."
                    },
                    {
                        "name": "Nouaud D."
                    },
                    {
                        "name": "Ashburner M."
                    },
                    {
                        "name": "Anxolabehere D."
                    }
                ],
                "citationCount": 183,
                "date": "2005-12-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Combined evidence annotation of transposable elements in genome sequences"
            },
            "pmcid": "PMC1185648",
            "pmid": "16110336",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1007/s00239-003-0007-2",
            "metadata": {
                "abstract": "The techniques that are usually used to detect transposable elements (TEs) in nucleic acid sequences rely on sequence similarity with previously characterized elements. However, these methods are likely to miss many elements in various organisms. We tested two strategies for the detection of unknown elements. The first, which we call \"TBLASTX strategy,\" searches for TE sequences by comparing the six-frame translations of the nucleic acid sequences of known TEs with the genomic sequence of interest. The second, \"repeat-based strategy,\" searches genomic sequences for long repeats and clusters them in groups of similar sequences. TE copies from a given family are expected to cluster together. We tested the Drosophila melanogaster genomic sequence and the recently sequenced Anopheles gambiae genome in which most TEs remain unknown. We showed that the \"TBLASTX strategy\" is very efficient as it detected at least 332 new TE families in D. melanogaster and 400 in A. gambiae. This was unexpected in Drosophila as TEs of this organism have been extensively studied. The \"repeat-based strategy\" appeared to be very inefficient because of two problems: (i) TE copies are heavily deleted and few copies share homologous regions, and (ii) segmental duplications are frequent and it is not easy to distinguish them from TE copies.",
                "authors": [
                    {
                        "name": "Quesneville H."
                    },
                    {
                        "name": "Nouaud D."
                    },
                    {
                        "name": "Anxolabehere D."
                    }
                ],
                "citationCount": 44,
                "date": "2003-12-29T00:00:00Z",
                "journal": "Journal of Molecular Evolution",
                "title": "Detection of New Transposable Element Families in Drosophila melanogaster and Anopheles gambiae Genomes"
            },
            "pmid": "15008403",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1109/JPROC.2016.2590833",
            "metadata": {
                "abstract": "© 1963-2012 IEEE.Transposable elements (TEs) constitute the most dynamic and the largest component of large plant genomes: for example, 80% to 90% of the maize genome and the wheat genome may be TEs. De novo TE annotation is therefore a computational challenge, and we investigated, using current tools in the REPET package, new strategies to overcome the difficulties. We tested our methodological developments on the sequence of the chromosome 3B of the hexaploid wheat; this chromosome is ~1 Gb, one of the 'fattest' genomes ever sequenced. We successfully established various strategies for annotating TEs in such a complex dataset. Our analyses show that all of our strategies can overcome the current limitations for de novo TE discovery in large plant genomes. Relative to annotation based on a library of known TEs, our de novo approaches improved genome coverage (from 84% to 90%), and the number of full length annotated copies from 14 830 to 15 905. We also developed two new metrics for qualifying TE annotation: NTE50 involves measuring the number, and LTE50 the smallest sizes of annotations that cover 50% of the genome. NTE50 decreased the number of annotations from 124 868 to 93 633 and LTE50 increased it from 1839 to 2659. This work shows how to obtain comprehensive and high-quality automatic TE annotation for a number of economically and agronomically important species.",
                "authors": [
                    {
                        "name": "Jamilloux V."
                    },
                    {
                        "name": "Daron J."
                    },
                    {
                        "name": "Choulet F."
                    },
                    {
                        "name": "Quesneville H."
                    }
                ],
                "citationCount": 6,
                "date": "2017-03-01T00:00:00Z",
                "journal": "Proceedings of the IEEE",
                "title": "De Novo Annotation of Transposable Elements: Tackling the Fat Genome Issue"
            },
            "type": [
                "Method"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence composition, complexity and repeats",
            "uri": "http://edamontology.org/topic_0157"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        }
    ],
    "version": [
        "v3.0"
    ]
}