
{
    "credit": [
        {
            "name": "Con",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://www.animalgenome.org/helpdesk?subj=/bioinfo/tools/beap/index.php"
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "https://www.animalgenome.org/bioinfo/tools/beap/userguide.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Linkage disequilibrium calculation",
                    "uri": "http://edamontology.org/operation_0488"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java",
            "Perl"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Sequence assembly",
                "uri": "http://edamontology.org/topic_0196"
            }
        ]
    },
    "publication": [
        {
            "pmid": "19159488"
        },
        {
            "abstract": "Background. Fine-mapping projects require a high density of SNP markers and positional candidate gene sequences. In species with incomplete genomic sequence, the DNA sequences needed to generate markers for fine-mapping within a linkage analysis confidence interval may be available but may not have been assembled. To manually piece these sequences together is laborious and costly. Moreover, annotation and assembly of short, incomplete DNA sequences is time consuming and not always straightforward. Findings. We have created a tool called BEAP that combines BLAST and CAP3 to retrieve sequences and construct contigs for localized genomic regions in species with unfinished sequence drafts. The rational is that a completed genome can be used as a template to query target genomic sequence for closing the gaps or extending contig sequence length in species whose genome is incomplete on the basis that good homology exists. Each user must define what template sequence is appropriate based on comparative mapping data such as radiation hybrid (RH) maps or other evidence linking the gene sequence of the template species to the target species. Conclusion. The BEAP software creates contigs suitable for discovery of orthologous genes for positional cloning. The resulting sequence alignments can be viewed graphically with a Java graphical user interface (GUI), allowing users to evaluate contig sequence quality and predict SNPs. We demonstrate the successful use of BEAP to generate genomic template sequence for positional cloning of the Angus dwarfism mutation. The software is available for free online for use on UNIX systems at http://www.animalgenome.org/bioinfo/tools/ beap/. © 2009 Reecy et al.",
            "authors": [
                "Koltes J.E.",
                "Hu Z.-L.",
                "Fritz E.",
                "Reecy J.M."
            ],
            "cit_count": 3,
            "doi": "10.1186/1756-0500-2-11",
            "journal": "BMC Research Notes",
            "title": "BEAP: The BLAST Extension and Alignment Program- a tool for contig construction and analysis of preliminary genome sequence",
            "type": "Primary",
            "year": "2009-12-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:beap",
        "biotoolsID": "beap",
        "description": "BEAP uses a short starting DNA fragment, often a EST or partial gene segment, as “primer”, to recursively blast nucleotide databases in an attempt to obtain all sequences that overlaps, directly or indirectly, with the “primer” therefore help to “extend” the length of the original sequence for constructing a “full length” sequence for functional analysis, or at least to obtain neighboring regions of the segment for SNP discovery and linkage disequilibrium analysis.",
        "homepage": "http://www.animalgenome.org/bioinfo/tools/beap/",
        "name": "BEAP"
    }
}