{
    "additionDate": "2018-10-02T08:21:04Z",
    "biotoolsCURIE": "biotools:amtrak",
    "biotoolsID": "amtrak",
    "credit": [
        {
            "email": "cathale@iiserpune.ac.in",
            "name": "Chaitanya A. Athale",
            "orcidid": "http://orcid.org/0000-0002-9506-2153",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Automated multi-peak tracking kymography (AMTraK) is a software tool that uses peak information and distance minimization to track and automatically quantify kymographs.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.iiserpune.ac.in/~cathale/SupplementaryMaterial/src-amtrak/AmtraK_User_Guide.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "http://www.iiserpune.ac.in/~cathale/SupplementaryMaterial/Amtrak.html",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2019-01-13T18:19:02Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/athale/AMTraK"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/athale/AMTraK/issues"
        }
    ],
    "name": "AMTraK",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0167620",
            "metadata": {
                "abstract": "© 2016 Chaphalkar et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Kymographs or space-time plots are widely used in cell biology to reduce the dimensions of a time-series in microscopy for both qualitative and quantitative insight into spatio-temporal dynamics. While multiple tools for image kymography have been described before, quantification remains largely manual. Here, we describe a novel software tool for automated multipeak tracking kymography (AMTraK), which uses peak information and distance minimization to track and automatically quantify kymographs, integrated in a GUI. The program takes fluorescence time-series data as an input and tracks contours in the kymographs based on intensity and gradient peaks. By integrating a branch-point detection method, it can be used to identify merging and splitting events of tracks, important in separation and coalescence events. In tests with synthetic images, we demonstrate sub-pixel positional accuracy of the program. We test the program by quantifying sub-cellular dynamics in rod-shaped bacteria, microtubule (MT) transport and vesicle dynamics. A time-series of E. coli cell division with labeled nucleoid DNA is used to identify the time-point and rate at which the nucleoid segregates. The mean velocity of microtubule (MT) gliding motility due to a recombinant kinesin motor is estimated as 0.5 μm/s, in agreement with published values, and comparable to estimates using software for nanometer precision filament-tracking. We proceed to employ AMTraK to analyze previously published time-series microscopy data where kymographs had been manually quantified: clathrin polymerization kinetics during vesicle formation and anterograde and retrograde transport in axons. AMTraK analysis not only reproduces the reported parameters, it also provides an objective and automated method for reproducible analysis of kymographs from in vitro and in vivo fluorescence microscopy time-series of sub-cellular dynamics.",
                "authors": [
                    {
                        "name": "Chaphalkar A.R."
                    },
                    {
                        "name": "Jain K."
                    },
                    {
                        "name": "Gangan M.S."
                    },
                    {
                        "name": "Athale C.A."
                    }
                ],
                "citationCount": 5,
                "date": "2016-12-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Automated multi-peak tracking kymography (AMTraK): A tool to quantify sub-cellular dynamics with sub-pixel accuracy"
            },
            "pmcid": "PMC5167257",
            "pmid": "27992448",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Light microscopy",
            "uri": "http://edamontology.org/topic_3385"
        },
        {
            "term": "Applied mathematics",
            "uri": "http://edamontology.org/topic_3569"
        }
    ],
    "validated": 1
}