{
    "accessibility": "Open access",
    "additionDate": "2021-01-18T09:31:23Z",
    "biotoolsCURIE": "biotools:foragegrassbase",
    "biotoolsID": "foragegrassbase",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mallikarjuna.rao.kovi@nmbu.no",
            "name": "Mallikarjuna Rao Kovi",
            "typeEntity": "Person"
        }
    ],
    "description": "ForageGrassBase is molecular resource for the forage grass meadow fescue (Festuca pratensis Huds.).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                },
                {
                    "term": "Genome visualisation",
                    "uri": "http://edamontology.org/operation_3208"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "http://foragegrass.org/",
    "lastUpdate": "2021-03-11T10:41:33Z",
    "name": "ForageGrassBase",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAAA046",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press.Meadow fescue (Festuca pratensis Huds.) is one of the most important forage grasses in temperate regions. It is a diploid (2n = 14) outbreeding species that belongs to the genus Festuca. Together with Lolium perenne, they are the most important genera of forage grasses. Meadow fescue has very high quality of yield with good winter survival and persistency. However, extensive genomic resources for meadow fescue have not become available so far. To address this lack of comprehensive publicly available datasets, we have developed functionally annotated draft genome sequences of two meadow fescue genotypes, 'HF7/2' and 'B14/16', and constructed the platform ForageGrassBase, available at http://foragegrass.org/, for data visualization, download and querying. This is the first open-access platform that provides extensive genomic resources related to this forage grass species. The current database provides the most up-to-date draft genome sequence along with structural and functional annotations for genes that can be accessed using Genome Browser (GBrowse), along with comparative genomic alignments to Arabidopsis, L. perenne, barley, rice, Brachypodium and maize genomes. We have integrated homologous search tool BLAST also for the users to analyze their data. Combined, GBrowse, BLAST and downloadable data gives a user-friendly access to meadow fescue genomic resources. To our knowledge, ForageGrassBase is the first genome database dedicated to forage grasses. The current forage grass database provides valuable resources for a range of research fields related to meadow fescue and other forage crop species, as well as for plant research communities in general. The genome database can be accessed at http://foragegrass.org.",
                "authors": [
                    {
                        "name": "Kovi M.R."
                    },
                    {
                        "name": "Rognli O.A."
                    },
                    {
                        "name": "Samy J.K.A."
                    }
                ],
                "citationCount": 1,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Database",
                "title": "ForageGrassBase: Molecular resource for the forage grass meadow fescue (Festuca pratensis Huds.)"
            },
            "pmcid": "PMC7294657",
            "pmid": "32539086"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Nutritional science",
            "uri": "http://edamontology.org/topic_3390"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ]
}
