{
    "additionDate": "2018-08-23T08:09:30Z",
    "biotoolsCURIE": "biotools:andsystem",
    "biotoolsID": "andsystem",
    "credit": [
        {
            "email": "salix@bionet.nsc.ru",
            "name": "Vladimir A Ivanisenko",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Tool, developed for the reconstruction of molecular genetic networks. It is based on an automated text- and data- mining techniques.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www-bionet.sscc.ru/psd/andhcv/ANDVisio_help2013.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                }
            ]
        }
    ],
    "homepage": "http://pbiosoft.com/en/andsystem",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "name": "ANDSystem",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/1752-0509-9-S2-S2",
            "metadata": {
                "abstract": "© 2015 Ivanisenko et al.; licensee BioMed Central Ltd.Background: Sufficient knowledge of molecular and genetic interactions, which comprise the entire basis of the functioning of living systems, is one of the necessary requirements for successfully answering almost any research question in the field of biology and medicine. To date, more than 24 million scientific papers can be found in PubMed, with many of them containing descriptions of a wide range of biological processes. The analysis of such tremendous amounts of data requires the use of automated text-mining approaches. Although a handful of tools have recently been developed to meet this need, none of them provide error-free extraction of highly detailed information. Results: The ANDSystem package was developed for the reconstruction and analysis of molecular genetic networks based on an automated text-mining technique. It provides a detailed description of the various types of interactions between genes, proteins, microRNA's, metabolites, cellular components, pathways and diseases, taking into account the specificity of cell lines and organisms. Although the accuracy of ANDSystem is comparable to other well known text-mining tools, such as Pathway Studio and STRING, it outperforms them in having the ability to identify an increased number of interaction types. Conclusion: The use of ANDSystem, in combination with Pathway Studio and STRING, can improve the quality of the automated reconstruction of molecular and genetic networks. ANDSystem should provide a useful tool for researchers working in a number of different fields, including biology, biotechnology, pharmacology and medicine.",
                "authors": [
                    {
                        "name": "Demenkov P.S."
                    },
                    {
                        "name": "Ivanisenko N.V."
                    },
                    {
                        "name": "Ivanisenko T.V."
                    },
                    {
                        "name": "Ivanisenko V.A."
                    },
                    {
                        "name": "Kolchanov N.A."
                    },
                    {
                        "name": "Saik O.V."
                    },
                    {
                        "name": "Tiys E.S."
                    }
                ],
                "citationCount": 37,
                "date": "2015-04-15T00:00:00Z",
                "journal": "BMC Systems Biology",
                "title": "ANDSystem: An Associative Network Discovery System for automated literature mining in the field of biology"
            }
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        }
    ],
    "validated": 1
}
