{
    "accessibility": "Open access",
    "additionDate": "2022-07-17T12:11:32.677146Z",
    "biotoolsCURIE": "biotools:chapao",
    "biotoolsID": "chapao",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "shams_bayzid@cse.buet.ac.bd",
            "name": "Md. Shamsuzzoha Bayzid",
            "orcidid": "https://orcid.org/0000-0002-5640-0615",
            "typeEntity": "Person"
        },
        {
            "name": "Md Ashiqur Rahman",
            "orcidid": "https://orcid.org/0000-0002-2933-2637"
        }
    ],
    "description": "CHAPAO (Compressing Alignments using Hierarchical and Probabilistic Approach) is a novel reference-based technique for compressing MSA files.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome indexing",
                    "uri": "http://edamontology.org/operation_3211"
                },
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ashiq24/CHAPAO",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-07-17T12:11:32.679741Z",
    "license": "MIT",
    "name": "CHAPAO",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0265360",
            "metadata": {
                "abstract": "© 2022 Rahman et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Background High-throughput experimental technologies are generating tremendous amounts of genomic data, offering valuable resources to answer important questions and extract biological insights. Storing this sheer amount of genomic data has become a major concern in bioinformatics. General purpose compression techniques (e.g. gzip, bzip2, 7-zip) are being widely used due to their pervasiveness and relatively good speed. However, they are not customized for genomic data and may fail to leverage special characteristics and redundancy of the biomolecular sequences. Results We present a new lossless compression method CHAPAO (COmpressing Alignments using Hierarchical and Probabilistic Approach), which is especially designed for multiple sequence alignments (MSAs) of biomolecular data and offers very good compression gain. We have introduced a novel hierarchical referencing technique to represent biomolecular sequences which combines likelihood based analyses of the sequence similarities and graph theoretic algorithms. We performed an extensive evaluation study using a collection of real biological data from the avian phylogenomics project, 1000 plants project (1KP), and 16S and 23S rRNA datasets. We report the performance of CHAPAO in comparison with general purpose compression techniques as well as with MFCompress and Nucleotide Archival Format (NAF)-two of the best known methods especially designed for FASTA files. Experimental results suggest that CHAPAO offers significant improvements in compression gain over most other alternative methods. CHAPAO is freely available as an open source software at https://github.com/ashiq24/CHAPAO. Conclusion CHAPAO advances the state-of-the-art in compression algorithms and represents a potential alternative to the general purpose compression techniques as well as to the existing specialized compression techniques for biomolecular sequences.",
                "authors": [
                    {
                        "name": "Abdullah S.M."
                    },
                    {
                        "name": "Bayzid M.S."
                    },
                    {
                        "name": "Rahman M.A."
                    },
                    {
                        "name": "Tutul A.A."
                    }
                ],
                "date": "2022-04-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "CHAPAO: Likelihood and hierarchical reference-based representation of biomolecular sequences and applications to compressing multiple sequence alignments"
            },
            "pmcid": "PMC9015123",
            "pmid": "35436292"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Phylogenomics",
            "uri": "http://edamontology.org/topic_0194"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ],
    "validated": 1
}
