{
    "accessibility": "Open access",
    "additionDate": "2019-08-04T10:14:31Z",
    "biotoolsCURIE": "biotools:al3c",
    "biotoolsID": "al3c",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "astram@usc.edu",
            "name": "Alexander H. Stram",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Software for parameter inference using Approximate Bayesian Computation.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/ahstram/al3c/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/ahstram/al3c",
    "language": [
        "C++"
    ],
    "lastUpdate": "2020-06-16T10:55:24Z",
    "license": "Unlicense",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/ahstram/al3c/issues"
        }
    ],
    "maturity": "Mature",
    "name": "al3c",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btv393",
            "metadata": {
                "abstract": "© The Author 2015. Published by Oxford University Press. All rights reserved.Motivation: The development of Approximate Bayesian Computation (ABC) algorithms for parameter inference which are both computationally efficient and scalable in parallel computing environments is an important area of research. Monte Carlo rejection sampling, a fundamental component of ABC algorithms, is trivial to distribute over multiple processors but is inherently inefficient. While development of algorithms such as ABC Sequential Monte Carlo (ABC-SMC) help address the inherent inefficiencies of rejection sampling, such approaches are not as easily scaled on multiple processors. As a result, current Bayesian inference software offerings that use ABC-SMC lack the ability to scale in parallel computing environments. Results: We present al3c, a C++ framework for implementing ABC-SMC in parallel. By requiring only that users define essential functions such as the simulation model and prior distribution function, al3c abstracts the user from both the complexities of parallel programming and the details of the ABC-SMC algorithm. By using the al3c framework, the user is able to scale the ABC-SMC algorithm in parallel computing environments for his or her specific application, with minimal programming overhead. Availability and implementation: al3c is offered as a static binary for Linux and OS-X computing environments. The user completes an XML configuration file and C++ plug-in template for the specific application, which are used by al3c to obtain the desired results. Users can download the static binaries, source code, reference documentation and examples (including those in this article) by visiting https://github.com/ahstram/al3c.",
                "authors": [
                    {
                        "name": "Chen G.K."
                    },
                    {
                        "name": "Marjoram P."
                    },
                    {
                        "name": "Stram A.H."
                    }
                ],
                "citationCount": 2,
                "date": "2015-12-18T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "al3c: High-performance software for parameter inference using Approximate Bayesian Computation"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Computer science",
            "uri": "http://edamontology.org/topic_3316"
        },
        {
            "term": "Environmental science",
            "uri": "http://edamontology.org/topic_3855"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ],
    "validated": 1
}
