{
    "additionDate": "2020-01-14T09:05:40Z",
    "biotoolsCURIE": "biotools:DeepPheno",
    "biotoolsID": "DeepPheno",
    "confidence_flag": "tool",
    "description": "DeepPheno is a method for predicting gene-phenotype (HPO classes) associations from gene functional annotations (GO classes). Predicting single gene knockout phenotypes.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene functional annotation",
                    "uri": "http://edamontology.org/operation_3672"
                },
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bio-ontology-research-group/deeppheno",
    "language": [
        "Groovy",
        "Python"
    ],
    "lastUpdate": "2020-12-20T11:17:13Z",
    "license": "BSD-3-Clause",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/bio-ontology-research-group/deeppheno/issues"
        }
    ],
    "name": "DeepPheno",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/839332"
        },
        {
            "doi": "10.1371/journal.pcbi.1008453",
            "metadata": {
                "abstract": "© 2020 Kulmanov, Hoehndorf. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Predicting the phenotypes resulting from molecular perturbations is one of the key challenges in genetics. Both forward and reverse genetic screen are employed to identify the molecular mechanisms underlying phenotypes and disease, and these resulted in a large number of genotype-phenotype association being available for humans and model organisms. Combined with recent advances in machine learning, it may now be possible to predict human phenotypes resulting from particular molecular aberrations. We developed DeepPheno, a neural network based hierarchical multi-class multi-label classification method for predicting the phenotypes resulting from loss-of-function in single genes. DeepPheno uses the functional annotations with gene products to predict the phenotypes resulting from a loss-of-function; additionally, we employ a two-step procedure in which we predict these functions first and then predict phenotypes. Prediction of phenotypes is ontology-based and we propose a novel ontology-based classifier suitable for very large hierarchical classification tasks. These methods allow us to predict phenotypes associated with any known protein-coding gene. We evaluate our approach using evaluation metrics established by the CAFA challenge and compare with top performing CAFA2 methods as well as several state of the art phenotype prediction approaches, demonstrating the improvement of DeepPheno over established methods. Furthermore, we show that predictions generated by DeepPheno are applicable to predicting gene-disease associations based on comparing phenotypes, and that a large number of new predictions made by DeepPheno have recently been added as phenotype databases.",
                "authors": [
                    {
                        "name": "Hoehndorf R."
                    },
                    {
                        "name": "Kulmanov M."
                    }
                ],
                "date": "2020-11-18T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "DeepPheno: Predicting single gene loss-of-function phenotypes using an ontology-aware hierarchical classifier"
            },
            "pmcid": "PMC7710064",
            "pmid": "33206638"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        }
    ],
    "validated": 1
}
