{
    "accessibility": [],
    "additionDate": "2017-02-14T09:36:28Z",
    "biotoolsCURIE": "biotools:predikin",
    "biotoolsID": "predikin",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": null,
            "gridid": null,
            "name": "Contact Form",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://predikin.biosci.uq.edu.au/contact/"
        }
    ],
    "description": "The Predikin web server allows users to predict substrates of protein kinases. Users input a protein kinase for evaluation",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "http://predikin.biosci.uq.edu.au/documentation/"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Protein fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Transmembrane protein prediction",
                    "uri": "http://edamontology.org/operation_0269"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://predikin.biosci.uq.edu.au",
    "homepage_status": 0,
    "language": [],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "license": null,
    "link": [],
    "maturity": null,
    "name": "Predikin",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": null,
            "metadata": {
                "abstract": "The Predikin webserver allows users to predict substrates of protein kinases. The Predikin system is built from three components: a database of protein kinase substrates that links phosphorylation sites with specific protein kinase sequences; a perl module to analyse query protein kinases and a web interface through which users can submit protein kinases for analysis. The Predikin perl module provides methods to (i) locate protein kinase catalytic domains in a sequence, (ii) classify them by type or family, (iii) identify substrate-determining residues, (iv) generate weighted scoring matrices using three different methods, (v) extract putative phosphorylation sites in query substrate sequences and (vi) score phosphorylation sites for a given kinase, using optional filters. The web interface provides user-friendly access to each of these functions and allows users to obtain rapidly a set of predictions that they can export for further analysis. The server is available at http://predikin.biosci.uq.edu.au.",
                "authors": [
                    {
                        "name": "Saunders N.F."
                    },
                    {
                        "name": "Kobe B."
                    }
                ],
                "citationCount": 27,
                "date": "2008-01-01T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "The Predikin webserver: improved prediction of protein kinase peptide specificity using structural information."
            },
            "note": null,
            "pmcid": null,
            "pmid": "18477637",
            "type": null,
            "version": null
        },
        {
            "doi": null,
            "metadata": {
                "abstract": "Background: We have previously described an approach to predicting the substrate specificity of serine-threonine protein kinases. The method, named Predikin, identifies key conserved substrate-determining residues in the kinase catalytic domain that contact the substrate in the region of the phosphorylation site and so determine the sequence surrounding the phosphorylation site. Predikin was implemented originally as a web application written in Javascript. Results: Here, we describe a new version of Predikin, completely revised and rewritten as a modular framework that provides multiple enhancements compared with the original. Predikin now consists of two components: (i) PredikinDB, a database of phosphorylation sites that links substrates to kinase sequences and (ii) a Perl module, which provides methods to classify protein kinases, reliably identify substrate-determining residues, generate scoring matrices and score putative phosphorylation sites in query sequences. The performance of Predikin as measured using receiver operator characteristic (ROC) graph analysis equals or surpasses that of existing comparable methods. The Predikin website has been redesigned to incorporate the new features. Conclusion: New features in Predikin include the use of SQL queries to PredikinDB to generate predictions, scoring of predictions, more reliable identification of substrate-determining residues and putative phosphorylation sites, extended options to handle protein kinase and substrate data and an improved web interface. The new features significantly enhance the ability of Predikin to analyse protein kinases and their substrates. Predikin is available at http://predikin.biosci.uq.edu.au. © 2008 Saunders et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Saunders N.F.W."
                    },
                    {
                        "name": "Brinkworth R.I."
                    },
                    {
                        "name": "Huber T."
                    },
                    {
                        "name": "Kemp B.E."
                    },
                    {
                        "name": "Kobe B."
                    }
                ],
                "citationCount": 42,
                "date": "2008-05-26T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Predikin and PredikinDB: A computational framework for the prediction of protein kinase peptide specificity and an associated database of phosphorylation sites"
            },
            "note": null,
            "pmcid": null,
            "pmid": "18501020",
            "type": null,
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Function analysis",
            "uri": "http://edamontology.org/topic_1775"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1,
    "version": []
}