{
    "additionDate": "2021-01-18T09:02:04Z",
    "biotoolsCURIE": "biotools:cipr",
    "biotoolsID": "cipr",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "atakan.ekiz@path.utah.edu",
            "name": "H. Atakan Ekiz",
            "typeEntity": "Person"
        },
        {
            "email": "ryan.oconnell@path.utah.edu",
            "name": "Ryan M. O’Connell",
            "typeEntity": "Person"
        }
    ],
    "description": "Cluster Identity Predictor (CIPR) is a web-based R/shiny app and R package to annotate cell clusters in single cell RNA sequencing experiments. CIPR provides a graphical user interface to quickly score gene expression profiles of unknown cell clusters against mouse or human references, or a custom dataset provided by the user. CIPR can be easily integrated into the current pipelines to facilitate scRNAseq data analysis. During the analysis of single cell RNA sequencing (scRNAseq) data, annotating the biological identity of cell clusters is an important step before downstream analyses and it remains technically challenging.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression profile clustering",
                    "uri": "http://edamontology.org/operation_0313"
                },
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "homepage": "https://aekiz.shinyapps.io/CIPR/",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-11T18:29:57Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/atakanekiz/CIPR-Shiny"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/atakanekiz/CIPR-Package"
        }
    ],
    "name": "CIPR",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-020-3538-2",
            "metadata": {
                "abstract": "BACKGROUND: Single cell RNA sequencing (scRNAseq) has provided invaluable insights into cellular heterogeneity and functional states in health and disease. During the analysis of scRNAseq data, annotating the biological identity of cell clusters is an important step before downstream analyses and it remains technically challenging. The current solutions for annotating single cell clusters generally lack a graphical user interface, can be computationally intensive or have a limited scope. On the other hand, manually annotating single cell clusters by examining the expression of marker genes can be subjective and labor-intensive. To improve the quality and efficiency of annotating cell clusters in scRNAseq data, we present a web-based R/Shiny app and R package, Cluster Identity PRedictor (CIPR), which provides a graphical user interface to quickly score gene expression profiles of unknown cell clusters against mouse or human references, or a custom dataset provided by the user. CIPR can be easily integrated into the current pipelines to facilitate scRNAseq data analysis. RESULTS: CIPR employs multiple approaches for calculating the identity score at the cluster level and can accept inputs generated by popular scRNAseq analysis software. CIPR provides 2 mouse and 5 human reference datasets, and its pipeline allows inter-species comparisons and the ability to upload a custom reference dataset for specialized studies. The option to filter out lowly variable genes and to exclude irrelevant reference cell subsets from the analysis can improve the discriminatory power of CIPR suggesting that it can be tailored to different experimental contexts. Benchmarking CIPR against existing functionally similar software revealed that our algorithm is less computationally demanding, it performs significantly faster and provides accurate predictions for multiple cell clusters in a scRNAseq experiment involving tumor-infiltrating immune cells. CONCLUSIONS: CIPR facilitates scRNAseq data analysis by annotating unknown cell clusters in an objective and efficient manner. Platform independence owing to Shiny framework and the requirement for a minimal programming experience allows this software to be used by researchers from different backgrounds. CIPR can accurately predict the identity of a variety of cell clusters and can be used in various experimental contexts across a broad spectrum of research areas.",
                "authors": [
                    {
                        "name": "Ekiz H.A."
                    },
                    {
                        "name": "Conley C.J."
                    },
                    {
                        "name": "Stephens W.Z."
                    },
                    {
                        "name": "O'Connell R.M."
                    }
                ],
                "citationCount": 5,
                "date": "2020-05-15T00:00:00Z",
                "journal": "BMC bioinformatics",
                "title": "CIPR: a web-based R/shiny app and R package to annotate cell clusters in single cell RNA sequencing experiments"
            },
            "pmcid": "PMC7227235",
            "pmid": "32414321"
        }
    ],
    "toolType": [
        "Library",
        "Web application"
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        }
    ]
}