{"credit":[{"email":"mathilde@abi.snv.jussieu.fr","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://wwwabi.snv.jussieu.fr/Yakusa/html/help_general.html"}],"function":[{"operation":[{"term":"Database search","uri":"http://edamontology.org/operation_2421"},{"term":"Protein structure analysis","uri":"http://edamontology.org/operation_2406"}]}],"labels":{"operatingSystem":["Linux","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Proteins","uri":"http://edamontology.org/topic_0078"},{"term":"Molecular modelling","uri":"http://edamontology.org/topic_2275"},{"term":"Protein structure analysis","uri":"http://edamontology.org/topic_2814"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/yakusa-scan-structural-database-query-protein-structure.html"}],"publication":[{"abstract":"YAKUSA is a program designed for rapid scanning of a structural database with a query protein structure. It searches for the longest common substructures called SHSPs (structural high-scoring pairs) existing between a query structure and every structure in the structural database. It makes use of protein backbone internal coordinates (a angles) in order to describe protein structures as sequences of symbols. The structural similarities are established in 5 steps, the first 3 being analogous to those used in BLAST: (1) building up a deterministic finite automaton describing all patterns identical or similar to those in the query structure; (2) searching for all these patterns in every structure in the database; (3) extending the patterns to longer matching substructures (i.e., SHSPs); (4) selecting compatible SHSPs for each query-database structure pair; and (5) ranking the query-database structure pairs using 3 scores based on SHSP similarity, on SHSP probabilities, and on spatial compatibility of SHSPs. Structural fragment probabilities are estimated according to a mixture transition distribution model, which is an approximation of a high-order Markov chain model. With regard to sensitivity and selectivity of the structural matches, YAKUSA compares well to the best related programs, although it is by far faster: A typical database scan takes about 40 s CPU time on a desktop personal computer. It has also been implemented on a Web server for real-time searches. © 2005 Wiley-Liss, Inc.","authors":["Carpentier M.","Brouillet S.","Pothier J."],"cit_count":56,"journal":"Proteins: Structure, Function and Genetics","pmid":"16049912","title":"YAKUSA: A fast structural database scanning method","year":"2005-10-01"}],"summary":{"biotoolsCURIE":"biotools:yakusa","biotoolsID":"yakusa","description":"Program devised to rapidly scan a structural database with a query protein structure. It searches for the longest common substructures, called SHSP for “structural high scoring pairs”, between a query structure and every structure in the structural database. It makes use of protein backbone internal coordinates (α angles) in order to describe protein structures as sequences of symbols. It uses a deterministic finite automaton for pattern matching.","homepage":"http://wwwabi.snv.jussieu.fr/Yakusa/html/help_general.html","name":"YAKUSA"}}