{
    "name": "ProBias", 
    "description": "It is a novel sensitive method for the detection of user-defined compositional bias in biological sequences.\nIt automatically searches a user-supplied protein sequence for segments that contain unusually dense clusters of user-specified amino acid types and computes analytical estimates of the statistical significance of each cluster.", 
    "homepage": "http://lcg.rit.albany.edu/bias/", 
    "biotoolsID": "probias", 
    "biotoolsCURIE": "biotools:probias", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2479", 
                    "term": "Protein sequence analysis"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }, 
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2423", 
                    "term": "Detection"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0080", 
            "term": "Sequences"
        }, 
        {
            "uri": "http://edamontology.org/topic_2269", 
            "term": "Statistics"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "Perl"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/probiasbias-detect-compositional-bias-biological-sequences.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://lcg.rit.albany.edu/bias/bias_guide_v1_0.txt", 
            "type": "Manual", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btl049", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "A novel sensitive method for the detection of user-defined compositional bias in biological sequences", 
                "abstract": "Motivation: Most biological sequences contain compositionally biased segments in which one or more residue types are significantly overrepresented. The function and evolution of these segments are poorly understood. Usually, all types of compositionally biased segments are masked and ignored during sequence analysis. However, it has been shown for a number of proteins that biased segments that contain amino acids with similar chemical properties are involved in a variety of molecular functions and human diseases. A detailed large-scale analysis of the functional implications and evolutionary conservation of different compositionally biased segments requires a sensitive method capable of detecting user-specified types of compositional bias. Results: We present BIAS, a novel sensitive method for the detection of compositionally biased segments composed of a user-specified set of residue types. BIAS uses the discrete scan statistics that provides a highly accurate correction for multiple tests to compute analytical estimates of the significance of each compositionally biased segment. The method can take into account global compositional bias when computing analytical estimates of the significance of local clusters. BIAS is benchmarked against SEG, SAPS and CAST programs. We also use BIAS to show that groups of proteins with the same biological function are significantly associated with particular types of compositionally biased segments. © 2006 Oxford University Press.", 
                "date": "2006-05-01T00:00:00Z", 
                "citationCount": 11, 
                "authors": [
                    {
                        "name": "Kuznetsov I.B."
                    }, 
                    {
                        "name": "Hwang S."
                    }
                ], 
                "journal": "Bioinformatics"
            }
        }, 
        {
            "doi": "10.1093/bioinformatics/btn233", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "ProBias: A web-server for the identification of user-specified types of compositionally biased segments in protein sequences", 
                "abstract": "Summary: Most proteins contain compositionally biased segments (CBS) in which one or more amino acid types are significantly overrepresented. CBS that contain amino acids with similar chemical properties can have functional and structural importance. This article describes ProBias, a web-server that searches a protein sequence for CBS composed of user-specified amino acid types. ProBias utilizes the discrete scan statistics to estimate statistical significance of CBS and is able to detect even subtle local deviations from the random independence model. The web-server also analyzes the global compositional bias of the input sequence. In the case of novel proteins that lack functional annotation, statistically significant CBS reported by ProBias can be used to guide the search for potential functionally important sites or domains. © The Author 2008. Published by Oxford University Press. All rights reserved.", 
                "date": "2008-07-01T00:00:00Z", 
                "citationCount": 3, 
                "authors": [
                    {
                        "name": "Kuznetsov I.B."
                    }
                ], 
                "journal": "Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": "ikuznetsov@albany.edu", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-12-18T00:11:09Z", 
    "lastUpdate": "2018-12-10T12:58:59Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}