{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2021-05-05T11:06:06Z",
    "biotoolsCURIE": "biotools:emgonoff",
    "biotoolsID": "emgonoff",
    "collectionID": [
        "MATLAB",
        "File Exchange"
    ],
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "name": "Kieran Coghlan",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.mathworks.com/matlabcentral/profile/870472-kieran-coghlan"
        }
    ],
    "description": "Finds the \"on\" and \"off\" indicies of a single raw surface EMG burst (muscle contraction).",
    "download": [
        {
            "type": "Screenshot",
            "url": "https://www.mathworks.com//matlabcentral/images/default_screenshot.jpg"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://www.mathworks.com/matlabcentral/fileexchange/11049-emgonoff",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-05-24T08:20:54.958411Z",
    "name": "EMGONOFF",
    "operatingSystem": [
        "Windows",
        "Linux",
        "Mac"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/S0921-884X(96)95190-5",
            "metadata": {
                "abstract": "Little consensus exists in the literature regarding methods for determination of the onset of electromyographic (EMG) activity. The aim of this study was to compare the relative accuracy of a range of computer-based techniques with respect to EMG onset determined visually by an experienced examiner. Twenty-seven methods were compared which varied in terms of EMG processing (low pass filtering at 10, 50 and 500 Hz), threshold value (1, 2 and 3 SD beyond mean of baseline activity) and the number of samples for which the mean must exceed the defined threshold (20, 50 and 100 ms). Three hundred randomly selected trials of a postural task were evaluated using each technique. The visual determination of EMG onset was found to be highly repeatable between days. Linear regression equations were calculated for the values selected by each computer method which indicated that the onset values selected by the majority of the parameter combinations deviated significantly from the visually derived onset values. Several methods accurately selected the time of onset of EMG activity and are recommended for future use.",
                "authors": [
                    {
                        "name": "Hodges P.W."
                    },
                    {
                        "name": "Bui B.H."
                    }
                ],
                "citationCount": 693,
                "date": "1996-12-01T00:00:00Z",
                "journal": "Electroencephalography and Clinical Neurophysiology - Electromyography and Motor Control",
                "title": "A comparison of computer-based methods for the determination of onset of muscle contraction using electromyography"
            },
            "type": [
                "Method"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "version": [
        "1.0.0.0"
    ]
}