{
    "additionDate": "2021-01-18T07:39:57Z",
    "biotoolsCURIE": "biotools:gedi",
    "biotoolsID": "gedi",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ic2465@cumc.columbia.edu",
            "name": "Izaak Coleman",
            "orcidid": "https://orcid.org/0000-0003-4697-6079",
            "typeEntity": "Person"
        }
    ],
    "description": "Applying suffix arrays to increase the repertoire of detectable SNVs in tumour genomes.\n\nGeDi: Generalised suffix array-based Direct SNV caller.\n\nGeneralised suffix array-based Direct SNV caller, or GeDi, detects somatic Single Nucleotide Variants (SNVs) within paired tumour-control NGS datasets.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome indexing",
                    "uri": "http://edamontology.org/operation_3211"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://github.com/izaak-coleman/GeDi",
    "language": [
        "C",
        "C++",
        "Perl",
        "Shell"
    ],
    "lastUpdate": "2021-01-22T18:45:31Z",
    "license": "MIT",
    "name": "GeDi",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-020-3367-3",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Current popular variant calling pipelines rely on the mapping coordinates of each input read to a reference genome in order to detect variants. Since reads deriving from variant loci that diverge in sequence substantially from the reference are often assigned incorrect mapping coordinates, variant calling pipelines that rely on mapping coordinates can exhibit reduced sensitivity. Results: In this work we present GeDi, a suffix array-based somatic single nucleotide variant (SNV) calling algorithm that does not rely on read mapping coordinates to detect SNVs and is therefore capable of reference-free and mapping-free SNV detection. GeDi executes with practical runtime and memory resource requirements, is capable of SNV detection at very low allele frequency (<1%), and detects SNVs with high sensitivity at complex variant loci, dramatically outperforming MuTect, a well-established pipeline. Conclusion: By designing novel suffix-array based SNV calling methods, we have developed a practical SNV calling software, GeDi, that can characterise SNVs at complex variant loci and at low allele frequency thus increasing the repertoire of detectable SNVs in tumour genomes. We expect GeDi to find use cases in targeted-deep sequencing analysis, and to serve as a replacement and improvement over previous suffix-array based SNV calling methods.",
                "authors": [
                    {
                        "name": "Arram J."
                    },
                    {
                        "name": "Coleman I."
                    },
                    {
                        "name": "Corleone G."
                    },
                    {
                        "name": "Luk W."
                    },
                    {
                        "name": "Magnani L."
                    },
                    {
                        "name": "Ng H.-C."
                    }
                ],
                "date": "2020-02-05T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "GeDi: applying suffix arrays to increase the repertoire of detectable SNVs in tumour genomes"
            },
            "pmcid": "PMC7003401",
            "pmid": "32024475"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
