{
    "accessibility": "Open access",
    "additionDate": "2024-05-20T16:08:27.345178Z",
    "biotoolsCURIE": "biotools:tpe-old",
    "biotoolsID": "tpe-old",
    "cost": "Free of charge",
    "description": "Interactive tool to analyze genes based on their position across species. Specifically, it can be used to investigate the effect of telomere length on gene regulation. Telomeres are repetitive DNA sequences at the end of chromosomes that shorten with every cell division. The regulation of a number of genes has been reported to depend on the length of telomeres. Gene positions across species can be a valuable dataset for analyzing effects like this because genes that are regulated by position effects may exhibit patterns in the position of their orthologs.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Identifier",
                        "uri": "http://edamontology.org/data_0842"
                    },
                    "format": [
                        {
                            "term": "plain text format (unformatted)",
                            "uri": "http://edamontology.org/format_1964"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Statistical estimate score",
                        "uri": "http://edamontology.org/data_0951"
                    }
                }
            ]
        }
    ],
    "homepage": "https://tpe-old.uni-rostock.de/",
    "language": [
        "JavaScript",
        "R"
    ],
    "lastUpdate": "2024-05-20T16:08:27.347359Z",
    "license": "AGPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/johrpan/geposanui"
        }
    ],
    "maturity": "Mature",
    "name": "TPE-OLD",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "smoe",
    "publication": [
        {
            "doi": "10.1093/nargab/lqae037",
            "metadata": {
                "abstract": "In this paper, we present a comprehensive computational framework aimed at suggesting genes whose transcriptional regulation is likely to be influenced by their chromosomal position. This framework provides a user-friendly web interface, enabling researchers to explore the positional properties of all human genes and their orthologs across species, with a focus on their relation to the telomeres. Our approach involves multiple scoring methods, each adjustable by users, representing different features of the genes' positional variation across species. The resulting rankings can be combined to identify candidate genes that may be subject to position effects. Furthermore, the ranking can be tailored to a specific set of reference genes. We evaluate the method within the context of TPE-OLD, a mechanism where telomeres can exert a direct influence on gene expression across considerable genomic distances, and empower researchers to delve deeper into genes of interest, analyzing their position across species and estimating their susceptibility to position effects like TPE-OLD. We also provide simple enrichment analyses of user-provided gene lists in relation to top-ranking candidate genes.",
                "authors": [
                    {
                        "name": "Fuellen G."
                    },
                    {
                        "name": "Moller S."
                    },
                    {
                        "name": "Projahn E.F."
                    },
                    {
                        "name": "Walter M."
                    }
                ],
                "date": "2024-06-01T00:00:00Z",
                "journal": "NAR Genomics and Bioinformatics",
                "title": "Proposing candidate genes under telomeric control based on cross-species position data"
            },
            "pmcid": "PMC11044432",
            "pmid": "38666215",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script",
        "Web application"
    ],
    "topic": [
        {
            "term": "Cytogenetics",
            "uri": "http://edamontology.org/topic_3959"
        },
        {
            "term": "Functional genomics",
            "uri": "http://edamontology.org/topic_0085"
        }
    ],
    "version": [
        "1.0.1"
    ]
}
