{
    "additionDate": "2021-01-18T08:05:45Z",
    "biotoolsCURIE": "biotools:circad",
    "biotoolsID": "circad",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "vinods@igib.in",
            "name": "Vinod Scaria",
            "typeEntity": "Person"
        }
    ],
    "description": "circad is a comprehensive manually curated resource of circular RNA associated with diseases. Circular RNAs (circRNAs) are unique transcript isoforms characterised by back splicing of exon ends to form a covalently closed loop or circular conformation.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                }
            ]
        }
    ],
    "homepage": "http://clingen.igib.res.in/circad/",
    "lastUpdate": "2021-02-11T18:39:37Z",
    "name": "circad",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAAA019",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press.Circular RNAs (circRNAs) are unique transcript isoforms characterized by back splicing of exon ends to form a covalently closed loop or circular conformation. These transcript isoforms are now known to be expressed in a variety of organisms across the kingdoms of life. Recent studies have shown the role of circRNAs in a number of diseases and increasing evidence points to their potential application as biomarkers in these diseases. We have created a comprehensive manually curated database of circular RNAs associated with diseases. This database is available at URL http://clingen.igib.res.in/circad/. The Database lists more than 1300 circRNAs associated with 150 diseases and mapping to 113 International Statistical Classification of Diseases (ICD) codes with evidence of association linked to published literature. The database is unique in many ways. Firstly, it provides ready-to-use primers to work with, in order to use circRNAs as biomarkers or to perform functional studies. It additionally lists the assay and PCR primer details including experimentally validated ones as a ready reference to researchers along with fold change and statistical significance. It also provides standard disease nomenclature as per the ICD codes. To the best of our knowledge, circad is the most comprehensive and updated database of disease associated circular RNAs. Availability: http://clingen.igib.res.in/circad/",
                "authors": [
                    {
                        "name": "Rophina M."
                    },
                    {
                        "name": "Sharma D."
                    },
                    {
                        "name": "Poojary M."
                    },
                    {
                        "name": "Scaria V."
                    }
                ],
                "citationCount": 3,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Database",
                "title": "Circad: A comprehensive manually curated resource of circular RNA associated with diseases"
            },
            "pmcid": "PMC7100626",
            "pmid": "32219412"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        }
    ]
}