{
    "additionDate": "2021-01-18T09:45:37Z",
    "biotoolsCURIE": "biotools:epitoc2",
    "biotoolsID": "epitoc2",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "andrew@picb.ac.cn",
            "name": "Andrew E. Teschendorff",
            "orcidid": "https://orcid.org/0000-0001-7410-6527",
            "typeEntity": "Person"
        }
    ],
    "description": "epiTOC2 is an R-script that aims to estimate the mitotic age of a sample profiled genome-wide at the DNA methylation level. It is based on a mitotic clock model where DNA methylation errors occuring during cell-division accrue in the adult stem cell pool of a tissue, allowing tracking of the number of stem-cell divisions. epiTOC2 not only estimates the cumulative number of stem-cell divisions, but also allows the intrinsic rate of stem-cell division per stem-cell per year to be estimated if the chronological age of the sample(s) is known.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                }
            ]
        }
    ],
    "homepage": "https://doi.org/10.5281/zenodo.2632938",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-08T08:34:39Z",
    "name": "epiTOC2",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S13073-020-00752-3",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: DNA methylation changes that accrue in the stem cell pool of an adult tissue in line with the cumulative number of cell divisions may contribute to the observed variation in cancer risk among tissues and individuals. Thus, the construction of epigenetic \"mitotic\"clocks that can measure the lifetime number of stem cell divisions is of paramount interest. Methods: Building upon a dynamic model of DNA methylation gain in unmethylated CpG-rich regions, we here derive a novel mitotic clock (\"epiTOC2\") that can directly estimate the cumulative number of stem cell divisions in a tissue. We compare epiTOC2 to a different mitotic model, based on hypomethylation at solo-WCGW sites (\"HypoClock\"), in terms of their ability to measure mitotic age of normal adult tissues and predict cancer risk. Results: Using epiTOC2, we estimate the intrinsic stem cell division rate for different normal tissue types, demonstrating excellent agreement (Pearson correlation = 0.92, R 2 = 0.85, P = 3e-6) with those derived from experiment. In contrast, HypoClock's estimates do not (Pearson correlation = 0.30, R 2 = 0.09, P = 0.29). We validate these results in independent datasets profiling normal adult tissue types. While both epiTOC2 and HypoClock correctly predict an increased mitotic rate in cancer, epiTOC2 is more robust and significantly better at discriminating preneoplastic lesions characterized by chronic inflammation, a major driver of tissue turnover and cancer risk. Our data suggest that DNA methylation loss at solo-WCGWs is significant only when cells are under high replicative stress and that epiTOC2 is a better mitotic age and cancer risk prediction model for normal adult tissues. Conclusions: These results have profound implications for our understanding of epigenetic clocks and for developing cancer risk prediction or early detection assays. We propose that measurement of DNAm at the 163 epiTOC2 CpGs in adult pre-neoplastic lesions, and potentially in serum cell-free DNA, could provide the basis for building feasible pre-diagnostic or cancer risk assays. epiTOC2 is freely available from https://doi.org/10.5281/zenodo.2632938",
                "authors": [
                    {
                        "name": "Teschendorff A.E."
                    }
                ],
                "citationCount": 7,
                "date": "2020-06-24T00:00:00Z",
                "journal": "Genome Medicine",
                "title": "A comparison of epigenetic mitotic-like clocks for cancer risk prediction"
            },
            "pmcid": "PMC7315560",
            "pmid": "32580750"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Methylated DNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3674"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ]
}