{
    "additionDate": "2019-08-14T13:24:19Z",
    "biotoolsCURIE": "biotools:tailfindr",
    "biotoolsID": "tailfindr",
    "cost": "Free of charge",
    "description": "tailfindr is a R package for estimating poly(A)-tail lengths in Oxford Nanopore RNA and DNA reads.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/adnaniazi/tailfindr",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-08-14T13:24:35Z",
    "license": "GPL-3.0",
    "name": "tailfindr",
    "owner": "adnaniazi",
    "publication": [
        {
            "doi": "10.1261/rna.071332.119",
            "metadata": {
                "abstract": "© 2019 Krause et al.Polyadenylation at the 3′′-end is a major regulator of messenger RNA and its length is known to affect nuclear export, stability, and translation, among others. Only recently have strategies emerged that allow for genome-wide poly(A) length assessment. These methods identify genes connected to poly(A) tail measurements indirectly by short-read alignment to genetic 3′′-ends. Concurrently, Oxford Nanopore Technologies (ONT) established full-length isoform-specific RNA sequencing containing the entire poly(A) tail. However, assessing poly(A) length through base-calling has so far not been possible due to the inability to resolve long homopolymeric stretches in ONT sequencing. Here we present tailfindr, an R package to estimate poly(A) tail length on ONT long-read sequencing data. tailfindr operates on unaligned, base-called data. It measures poly(A) tail length from both native RNA and DNA sequencing, which makes poly(A) tail studies by full-length cDNA approaches possible for the first time. We assess tailfindr’s performance across different poly(A) lengths, demonstrating that tailfindr is a versatile tool providing poly(A) tail estimates across a wide range of sequencing conditions.",
                "authors": [
                    {
                        "name": "Krause M."
                    },
                    {
                        "name": "Labun K."
                    },
                    {
                        "name": "Muller F.S."
                    },
                    {
                        "name": "Niazi A.M."
                    },
                    {
                        "name": "Torres Cleuren Y.N."
                    },
                    {
                        "name": "Valen E."
                    }
                ],
                "citationCount": 14,
                "date": "2019-01-01T00:00:00Z",
                "journal": "RNA",
                "title": "TailFindR: Alignment-free poly(A) length measurement for Oxford Nanopore RNA and DNA sequencing"
            }
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        }
    ],
    "validated": 1
}
