{
    "additionDate": "2019-11-14T19:28:21Z",
    "biotoolsCURIE": "biotools:Bionitio",
    "biotoolsID": "Bionitio",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "bjpope@unimelb.edu.au",
            "name": "Bernard Pope",
            "orcidid": "https://orcid.org/0000-0002-4840-1095",
            "typeEntity": "Person"
        }
    ],
    "description": "Demonstrating and facilitating best practices for bioinformatics command-line software | Demonstrating best practices for bioinformatics command line tools | Bionitio provides a template for command line bioinformatics tools in various programming languages | The purpose of the tool is to provide an easy-to-understand working example that is built on best-practice software engineering principles. It can be used as a basis for learning and as a solid foundation for starting new projects. We provide a script called bionitio-boot.sh for starting new projects from bionitio, which saves time and ensures good programming practices are adopted from the beginning (see below for details)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bionitio-team/bionitio",
    "language": [
        "Shell"
    ],
    "lastUpdate": "2020-12-09T13:57:55Z",
    "license": "MIT",
    "name": "Bionitio",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/GIGASCIENCE/GIZ109",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Background: Bioinformatics software tools are often created ad hoc, frequently by people without extensive training in software development. In particular, for beginners, the barrier to entry in bioinformatics software development is high, especially if they want to adopt good programming practices. Even experienced developers do not always follow best practices. This results in the proliferation of poorer-quality bioinformatics software, leading to limited scalability and inefficient use of resources; lack of reproducibility, usability, adaptability, and interoperability; and erroneous or inaccurate results. Findings: We have developed Bionitio, a tool that automates the process of starting new bioinformatics software projects following recommended best practices. With a single command, the user can create a new well-structured project in 1 of 12 programming languages. The resulting software is functional, carrying out a prototypical bioinformatics task, and thus serves as both a working example and a template for building new tools. Key features include command-line argument parsing, error handling, progress logging, defined exit status values, a test suite, a version number, standardized building and packaging, user documentation, code documentation, a standard open source software license, software revision control, and containerization. Conclusions: Bionitio serves as a learning aid for beginner-to-intermediate bioinformatics programmers and provides an excellent starting point for new projects. This helps developers adopt good programming practices from the beginning of a project and encourages high-quality tools to be developed more rapidly. This also benefits users because tools are more easily installed and consistent in their usage. Bionitio is released as open source software under the MIT License and is available at https://github.com/bionitio-team/bionitio.",
                "authors": [
                    {
                        "name": "Georgeson P."
                    },
                    {
                        "name": "Syme A."
                    },
                    {
                        "name": "Sloggett C."
                    },
                    {
                        "name": "Chung J."
                    },
                    {
                        "name": "Dashnow H."
                    },
                    {
                        "name": "Milton M."
                    },
                    {
                        "name": "Lonsdale A."
                    },
                    {
                        "name": "Powell D."
                    },
                    {
                        "name": "Seemann T."
                    },
                    {
                        "name": "Pope B."
                    }
                ],
                "date": "2019-09-01T00:00:00Z",
                "journal": "GigaScience",
                "title": "Bionitio: Demonstrating and facilitating best practices for bioinformatics command-line software"
            },
            "pmcid": "PMC6755254",
            "pmid": "31544213"
        }
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}