{
    "additionDate": "2017-03-24T11:45:06Z",
    "biotoolsCURIE": "biotools:lipid_maps",
    "biotoolsID": "lipid_maps",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.lipidmaps.org/about/contact.html"
        }
    ],
    "description": "LIPID Metabolites And Pathways Strategy (LIPID MAPS) is a consortium that presents a collection of tools for performing tasks such as drawing lipid structures and predicting possible structures from mass spectrometry data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.lipidmaps.org/downloads/toolspackage/docs/html/index.html"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                },
                {
                    "term": "ID mapping",
                    "uri": "http://edamontology.org/operation_3282"
                },
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "homepage": "http://www.lipidmaps.org/tools/index.html",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2019-06-27T09:07:12Z",
    "name": "LIPID MAPS",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "The LIPID MAPS Structure Database (LMSD) is a relational database encompassing structures and annotations of biologically relevant lipids. Structures of lipids in the database come from four sources: (i) LIPID MAPS Consortium's core laboratories and partners; (ii) lipids identified by LIPID MAPS experiments; (iii) computationally generated structures for appropriate lipid classes; (iv) biologically relevant lipids manually curated from LIPID BANK, LIPIDAT and other public sources. All the lipid structures in LMSD are drawn in a consistent fashion. In addition to a classification-based retrieval of lipids, users can search LMSD using either text-based or structure-based search options. The text-based search implementation supports data retrieval by any combination of these data fields: LIPID MAPS ID, systematic or common name, mass, formula, category, main class, and subclass data fields. The structure-based search, in conjunction with optional data fields, provides the capability to perform a substructure search or exact match for the structure drawn by the user. Search results, in addition to structure and annotations, also include relevant links to external databases. The LMSD is publicly available at www.lipidmaps.org/data/ structure/. © 2007 Oxford University Press.",
                "authors": [
                    {
                        "name": "Sud M."
                    },
                    {
                        "name": "Fahy E."
                    },
                    {
                        "name": "Cotter D."
                    },
                    {
                        "name": "Brown A."
                    },
                    {
                        "name": "Dennis E.A."
                    },
                    {
                        "name": "Glass C.K."
                    },
                    {
                        "name": "Merrill Jr. A.H."
                    },
                    {
                        "name": "Murphy R.C."
                    },
                    {
                        "name": "Raetz C.R.H."
                    },
                    {
                        "name": "Russell D.W."
                    },
                    {
                        "name": "Subramaniam S."
                    }
                ],
                "citationCount": 624,
                "date": "2007-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "LMSD: LIPID MAPS structure database"
            },
            "pmid": "17098933"
        },
        {
            "metadata": {
                "abstract": "The LIPID MAPS Proteome Database (LMPD) is an object-relational database of lipid-associated protein sequences and annotations. The initial release contains 2959 records, representing human and mouse proteins involved in lipid metabolism. UniProt IDs were obtained based on keyword search of KEGG and GO databases, and this LMPD protein list was then enhanced with annotations from UniProt, EntrezGene, ENZYME, GO, KEGG and other public resources. We also assigned associations with general lipid categories, based on GO and KEGG annotations. Users may search LMPD by database ID or keyword, and filter by species and/or lipid class associations; from the search results, one can then access a compilation of data relevant to each protein of interest, cross-linked to external databases. The LIPID MAPS Proteome Database (LMPD) is publicly available from the LIPID MAPS Consortium website (http://www.lipidmaps.org/). The direct URL is http://www.lipidmaps.org/data/proteome/index.cgi.",
                "authors": [
                    {
                        "name": "Cotter D."
                    },
                    {
                        "name": "Maer A."
                    },
                    {
                        "name": "Guda C."
                    },
                    {
                        "name": "Saunders B."
                    },
                    {
                        "name": "Subramaniam S."
                    }
                ],
                "citationCount": 57,
                "date": "2006-01-01T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "LMPD: LIPID MAPS proteome database."
            },
            "pmid": "16381922"
        },
        {
            "metadata": {
                "abstract": "Lipids are produced, transported, and recognized by the concerted actions of numerous enzymes, binding proteins, and receptors. A comprehensive analysis of lipid molecules, \"lipidomics,\" in the context of genomics and proteomics is crucial to understanding cellular physiology and pathology; consequently, lipid biology has become a major research target of the postgenomic revolution and systems biology. To facilitate international communication about lipids, a comprehensive classification of lipids with a common platform that is compatible with informatics requirements has been developed to deal with the massive amounts of data that will be generated by our lipid community. As an initial step in this development, we divide lipids into eight categories (fatty acyls, glycerolipids, glycerophospholipids, sphingolipids, sterol lipids, prenol lipids, saccharolipids, and polyketides) containing distinct classes and subclasses of molecules, devise a common manner of representing the chemical structures of individual lipids and their derivatives, and provide a 12 digit identifier for each unique lipid molecule. The lipid classification scheme is chemically based and driven by the distinct hydrophobic and hydrophilic elements that compose the lipid. This structured vocabulary will facilitate the systematization of lipid biology and enable the cataloging of lipids and their properties in a way that is compatible with other macromolecular databases. Copyright © 2005 by the American Society for Biochemistry and Molecular Biology, Inc.",
                "authors": [
                    {
                        "name": "Fahy E."
                    },
                    {
                        "name": "Subramaniam S."
                    },
                    {
                        "name": "Brown H.A."
                    },
                    {
                        "name": "Glass C.K."
                    },
                    {
                        "name": "Merrill Jr. A.H."
                    },
                    {
                        "name": "Murphy R.C."
                    },
                    {
                        "name": "Raetz C.R.H."
                    },
                    {
                        "name": "Russell D.W."
                    },
                    {
                        "name": "Seyama Y."
                    },
                    {
                        "name": "Shaw W."
                    },
                    {
                        "name": "Shimizu T."
                    },
                    {
                        "name": "Spener F."
                    },
                    {
                        "name": "Van Meer G."
                    },
                    {
                        "name": "VanNieuwenhze M.S."
                    },
                    {
                        "name": "White S.H."
                    },
                    {
                        "name": "Witztum J.L."
                    },
                    {
                        "name": "Dennis E.A."
                    }
                ],
                "citationCount": 949,
                "date": "2005-01-01T00:00:00Z",
                "journal": "Journal of Lipid Research",
                "title": "A comprehensive classification system for lipids"
            },
            "pmid": "15722563"
        },
        {
            "metadata": {
                "abstract": "The LIPID MAPS consortium has developed a number of online tools for performing tasks such as drawing lipid structures and predicting possible structures from mass spectrometry (MS) data. A simple online interface has been developed to enable an end-user to rapidly generate a variety of lipid chemical structures, along with corresponding systematic names and ontological information. The structure-drawing tools are available for six categories of lipids: (i) fatty acyls, (ii) glycerolipids, (iii) glycerophospholipids, (iv) cardiolipins, (v) sphingolipids and (vi) sterols. Within each category, the structure-drawing tools support the specification of various parameters such as chain lengths at a specific sn position, head groups, double bond positions and stereochemistry to generate a specific lipid structure. The structure-drawing tools have also been integrated with a second set of online tools which predict possible lipid structures from precursor-ion and product-ion MS experimental data. The MS prediction tools are available for three categories of lipids: (i) mono/di/triacylglycerols, (ii) glycerophospholipids and (iii) cardiolipins. The LIPID MAPS online tools are publicly available at www.lipidmaps.org/tools/. © 2007 The Author(s).",
                "authors": [
                    {
                        "name": "Fahy E."
                    },
                    {
                        "name": "Sud M."
                    },
                    {
                        "name": "Cotter D."
                    },
                    {
                        "name": "Subramaniam S."
                    }
                ],
                "citationCount": 481,
                "date": "2007-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "LIPID MAPS online tools for lipid research"
            },
            "pmid": "17584797"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Lipids",
            "uri": "http://edamontology.org/topic_0153"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}