{
    "additionDate": "2018-08-05T06:05:41Z",
    "biotoolsCURIE": "biotools:conan",
    "biotoolsID": "conan",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "email": "csaba.daday@h-its.org",
            "name": "Csaba Daday",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "Davide Mercadante",
            "orcidid": "https://orcid.org/0000-0001-6792-7706",
            "typeEntity": "Person"
        }
    ],
    "description": "Using molecular dynamics trajectories, analyzes inter-residue contacts, creates videos of time-resolved contact maps, and performs correlation, principal component, and cluster analysis, revealing how specific contacts relate to functionally relevant states sampled by molecular dynamics.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/HITS-MBM/conan/blob/master/README.md"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                }
            ]
        }
    ],
    "homepage": "https://github.com/HITS-MBM/conan",
    "language": [
        "Python"
    ],
    "lastUpdate": "2019-03-26T08:14:01Z",
    "license": "GPL-3.0",
    "name": "CONAN",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1016/j.bpj.2018.01.033",
            "metadata": {
                "abstract": "© 2018 Biophysical SocietyThe analysis of contacts is a powerful tool to understand biomolecular function in a series of contexts, from the investigation of dynamical behavior at equilibrium to the study of nonequilibrium dynamics in which the system moves between multiple states. We thus propose a tool called CONtact ANalysis (CONAN) that, from molecular dynamics (MD) trajectories, analyzes interresidue contacts, creates videos of time-resolved contact maps, and performs correlation, principal component, and cluster analysis, revealing how specific contacts relate to functionally relevant states sampled by MD. We present how CONAN can identify features describing the dynamics of ubiquitin both at equilibrium and during mechanical unfolding. Additionally, we show the analysis of MD trajectories of an α-synuclein mutant peptide that undergoes an α-β conformational transition that can be easily monitored using CONAN, which identifies the multiple states that the peptide explores along its conformational dynamics. The high versatility and ease of use of the software make CONAN a tool that can significantly facilitate the understanding of the complex dynamical behavior of proteins or other biomolecules. CONAN and its documentation are freely available for download on GitHub.",
                "authors": [
                    {
                        "name": "Mercadante D."
                    },
                    {
                        "name": "Grater F."
                    },
                    {
                        "name": "Daday C."
                    }
                ],
                "citationCount": 20,
                "date": "2018-03-27T00:00:00Z",
                "journal": "Biophysical Journal",
                "title": "CONAN: A Tool to Decode Dynamical Information from Molecular Interaction Maps"
            },
            "pmid": "29590584",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        }
    ],
    "validated": 1
}