{
    "accessibility": "Open access",
    "additionDate": "2022-03-20T16:35:37.417399Z",
    "biotoolsCURIE": "biotools:serotypefinder",
    "biotoolsID": "serotypefinder",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Flemming Scheutz"
        },
        {
            "name": "Katrine G Joensen"
        }
    ],
    "description": "SerotypeFinder identifies the serotype in total or partial sequenced isolates of E. coli.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence",
                        "uri": "http://edamontology.org/data_2044"
                    },
                    "format": [
                        {
                            "term": "FASTQ",
                            "uri": "http://edamontology.org/format_1930"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Gene name",
                        "uri": "http://edamontology.org/data_2299"
                    }
                },
                {
                    "data": {
                        "term": "Sequence similarity",
                        "uri": "http://edamontology.org/data_1413"
                    }
                }
            ]
        }
    ],
    "homepage": "https://cge.cbs.dtu.dk/services/SerotypeFinder/",
    "lastUpdate": "2022-03-20T16:35:37.421303Z",
    "name": "SerotypeFinder",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1128/JCM.00008-15",
            "metadata": {
                "abstract": "Copyright © 2015, American Society for Microbiology. All Rights Reserved.Accurate and rapid typing of pathogens is essential for effective surveillance and outbreak detection. Conventional serotyping of Escherichia coli is a delicate, laborious, time-consuming, and expensive procedure. With whole-genome sequencing (WGS) becoming cheaper, it has vast potential in routine typing and surveillance. The aim of this study was to establish a valid and publicly available tool for WGS-based in silico serotyping of E. coli applicable for routine typing and surveillance. A FASTA database of specific O-antigen processing system genes for O typing and flagellin genes for H typing was created as a component of the publicly available Web tools hosted by the Center for Genomic Epidemiology (CGE) (www.genomicepidemiology.org). All E. coli isolates available with WGS data and conventional serotype information were subjected to WGS-based serotyping employing this specific SerotypeFinder CGE tool. SerotypeFinder was evaluated on 682 E. coli genomes, 108 of which were sequenced for this study, where both the whole genome and the serotype were available. In total, 601 and 509 isolates were included for O and H typing, respectively. The O-antigen genes wzx, wzy, wzm, and wzt and the flagellin genes fliC, flkA, fllA, flmA, and flnA were detected in 569 and 508 genome sequences, respectively. SerotypeFinder for WGS-based O and H typing predicted 560 of 569 O types and 504 of 508 H types, consistent with conventional serotyping. In combination with other available WGS typing tools, E. coli serotyping can be performed solely from WGS data, providing faster and cheaper typing than current routine procedures and making WGS typing a superior alternative to conventional typing strategies.",
                "authors": [
                    {
                        "name": "Aarestrup F.M."
                    },
                    {
                        "name": "Iguchi A."
                    },
                    {
                        "name": "Joensen K.G."
                    },
                    {
                        "name": "Scheutz F."
                    },
                    {
                        "name": "Tetzschner A.M.M."
                    }
                ],
                "citationCount": 415,
                "date": "2015-08-01T00:00:00Z",
                "journal": "Journal of Clinical Microbiology",
                "title": "Rapid and easy in silico serotyping of Escherichia coli isolates by use of whole-genome sequencing data"
            },
            "pmcid": "PMC4508402",
            "pmid": "25972421"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1,
    "version": [
        "2.0"
    ]
}
