{
    "additionDate": "2021-03-19T08:46:14Z",
    "biotoolsCURIE": "biotools:syn-view",
    "biotoolsID": "syn-view",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mehmet-direnc.mungan@uni-tuebingen.de",
            "name": "Mehmet Direnç Mungan",
            "typeEntity": "Person"
        }
    ],
    "description": "A Phylogeny-Based Synteny Exploration Tool for the Identification of Gene Clusters Linked to Antibiotic Resistance.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Natural product identification",
                    "uri": "http://edamontology.org/operation_3803"
                },
                {
                    "term": "Antimicrobial resistance prediction",
                    "uri": "http://edamontology.org/operation_3482"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "https://bitbucket.org/jstahlecker/syn-view/",
    "lastUpdate": "2021-04-11T09:49:40.651724Z",
    "name": "SYN-view",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3390/MOLECULES26010144",
            "metadata": {
                "abstract": "The development of new antibacterial drugs has become one of the most important tasks of the century in order to overcome the posing threat of drug resistance in pathogenic bacteria. Many antibiotics originate from natural products produced by various microorganisms. Over the last decades, bioinformatical approaches have facilitated the discovery and characterization of these small compounds using genome mining methodologies. A key part of this process is the identification of the most promising biosynthetic gene clusters (BGCs), which encode novel natural products. In 2017, the Antibiotic Resistant Target Seeker (ARTS) was developed in order to enable an automated target-directed genome mining approach. ARTS identifies possible resistant target genes within antibiotic gene clusters, in order to detect promising BGCs encoding antibiotics with novel modes of action. Although ARTS can predict promising targets based on multiple criteria, it provides little information about the cluster structures of possible resistant genes. Here, we present SYN-view. Based on a phylogenetic approach, SYN-view allows for easy comparison of gene clusters of interest and distinguishing genes with regular housekeeping functions from genes functioning as antibiotic resistant targets. Our aim is to implement our proposed method into the ARTS web-server, further improving the target-directed genome mining strategy of the ARTS pipeline.",
                "authors": [
                    {
                        "name": "Stahlecker J."
                    },
                    {
                        "name": "Mingyar E."
                    },
                    {
                        "name": "Ziemert N."
                    },
                    {
                        "name": "Mungan M.D."
                    }
                ],
                "date": "2020-12-31T00:00:00Z",
                "journal": "Molecules (Basel, Switzerland)",
                "title": "SYN-View: A Phylogeny-Based Synteny Exploration Tool for the Identification of Gene Clusters Linked to Antibiotic Resistance"
            },
            "pmcid": "PMC7795190",
            "pmid": "33396183"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Drug development",
            "uri": "http://edamontology.org/topic_3373"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}