
{
    "credit": [
        {
            "email": "sergi.picart@upc.edu",
            "name": "Sergio Picart-Armada",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://bioconductor.org/packages/release/bioc/manuals/FELLA/man/FELLA.pdf"
        }
    ],
    "download": [
        {
            "url": "http://bioconductor.org/packages/release/bioc/src/contrib/FELLA_1.0.0.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "language": [
            "R"
        ],
        "license": "GPL-3.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "Metabolomics",
                "uri": "http://edamontology.org/topic_3172"
            }
        ]
    },
    "link": [
        {
            "type": "Mirror",
            "url": "http://bioconductor.org/packages/FELLA/"
        },
        {
            "type": "Repository",
            "url": "https://git.bioconductor.org/packages/FELLA"
        }
    ],
    "publication": [
        {
            "abstract": "© 2017 Picart-Armada et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited. Metabolomics experiments identify metabolites whose abundance varies as the conditions under study change. Pathway enrichment tools help in the identification of key metabolic processes and in building a plausible biological explanation for these variations. Although several methods are available for pathway enrichment using experimental evidence, metabolomics does not yet have a comprehensive overview in a network layout at multiple molecular levels. We propose a novel pathway enrichment procedure for analysing summary metabolomics data based on sub-network analysis in a graph representation of a reference database. Relevant entries are extracted from the database according to statistical measures over a null diffusive process that accounts for network topology and pathway crosstalk. Entries are reported as a sub-pathway network, including not only pathways, but also modules, enzymes, reactions and possibly other compound candidates for further analyses. This provides a richer biological context, suitable for generating new study hypotheses and potential enzymatic targets. Using this method, we report results from cells depleted for an uncharacterised mitochondrial gene using GC and LC-MS data and employing KEGG as a knowledge base. Partial validation is provided with NMR-based tracking of 13C glucose labelling of these cells.",
            "authors": [
                "Picart-Armada S.",
                "Fernandez-Albert F.",
                "Vinaixa M.",
                "Rodriguez M.A.",
                "Aivio S.",
                "Stracker T.H.",
                "Yanes O.",
                "Perera-Lluna A."
            ],
            "cit_count": 3,
            "doi": "10.1371/journal.pone.0189012",
            "journal": "PLoS ONE",
            "title": "Null diffusion-based enrichment for metabolomics data",
            "year": "2017-12-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:fella",
        "biotoolsID": "fella",
        "description": "Enrichment of metabolomics data using KEGG entries. Given a set of affected compounds, FELLA suggests affected reactions, enzymes, modules and pathways using label propagation in a knowledge model network. The resulting subnetwork can be visualised and exported.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/FELLA.html",
        "name": "FELLA",
        "version": [
            "1.0.0"
        ]
    }
}