
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.compbio.dundee.ac.uk/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://www.compbio.dundee.ac.uk/www-nod/HelpDoc.jsp"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Detection",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequences",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/nod-1-3-nucleolar-localization-sequences-detection.html"
        }
    ],
    "publication": [
        {
            "abstract": "Background: Nucleolar localization sequences (NoLSs) are short targeting sequences responsible for the localization of proteins to the nucleolus. Given the large number of proteins experimentally detected in the nucleolus and the central role of this subnuclear compartment in the cell, NoLSs are likely to be important regulatory elements controlling cellular traffic. Although many proteins have been reported to contain NoLSs, the systematic characterization of this group of targeting motifs has only recently been carried out.Results: Here, we describe NoD, a web server and a command line program that predicts the presence of NoLSs in proteins. Using the web server, users can submit protein sequences through the NoD input form and are provided with a graphical output of the NoLS score as a function of protein position. While the web server is most convenient for making prediction for just a few proteins, the command line version of NoD can return predictions for complete proteomes. NoD is based on our recently described human-trained artificial neural network predictor. Through stringent independent testing of the predictor using available experimentally validated NoLS-containing eukaryotic and viral proteins, the NoD sensitivity and positive predictive value were estimated to be 71% and 79% respectively.Conclusions: NoD is the first tool to provide predictions of nucleolar localization sequences in diverse eukaryotes and viruses. NoD can be run interactively online at http://www.compbio.dundee.ac.uk/nod or downloaded to use locally. © 2011 Scott et al; licensee BioMed Central Ltd.",
            "authors": [
                "Scott M.S.",
                "Troshin P.V.",
                "Barton G.J."
            ],
            "cit_count": 55,
            "doi": "10.1186/1471-2105-12-317",
            "journal": "BMC Bioinformatics",
            "title": "NoD: A Nucleolar localization sequence detector for eukaryotic and viral proteins",
            "type": "Primary",
            "year": "2011-08-03"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:nod",
        "biotoolsID": "nod",
        "description": "NoD is a predictor of nucleolar localization sequences (NoLSs) in proteins. NoLSs are short basic motifs that localize proteins to the nucleolus, a sub-compartment of the nucleus. You can search the set of NoLSs predicted in 9531 human proteins out of the 43534 human proteins considered (from IPI version 3.40).",
        "homepage": "http://www.compbio.dundee.ac.uk/www-nod/",
        "name": "NoD",
        "version": [
            "1.3"
        ]
    }
}