
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://bhi-kimlab.github.io/contact/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://www.rna-seqblog.com/piclust-a-density-based-pirna-clustering-algorithm/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence similarity search",
                    "uri": "http://edamontology.org/operation_0346"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Functional, regulatory and non-coding RNA",
                "uri": "http://edamontology.org/topic_0659"
            },
            {
                "term": "RNA-Seq",
                "uri": "http://edamontology.org/topic_3170"
            },
            {
                "term": "RNA",
                "uri": "http://edamontology.org/topic_0099"
            },
            {
                "term": "RNA-Seq",
                "uri": "http://edamontology.org/topic_3170"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/piclust-find-pirna-clusters-and-transcripts-from-small-rna-seq-data.html"
        }
    ],
    "publication": [
        {
            "abstract": "Piwi-interacting RNAs (piRNAs) are recently discovered, endogenous small non-coding RNAs. piRNAs protect the genome from invasive transposable elements (TE) and sustain integrity of the genome in germ cell lineages. Small RNA-sequencing data can be used to detect piRNA activations in a cell under a specific condition. However, identification of cell specific piRNA activations requires sophisticated computational methods. As of now, there is only one computational method, proTRAC, to locate activated piRNAs from the sequencing data. proTRAC detects piRNA clusters based on a probabilistic analysis with assumption of a uniform distribution. Unfortunately, we were not able to locate activated piRNAs from our proprietary sequencing data in chicken germ cells using proTRAC. With a careful investigation on data sets, we found that a uniform or any statistical distribution for detecting piRNA clusters may not be assumed. Furthermore, small RNA-seq data contains many different types of RNAs which was not carefully taken into account in previous studies. To improve piRNA cluster identification, we developed piClust that uses a density based clustering approach without assumption of any parametric distribution. In previous studies, it is known that piRNAs exhibit a strong tendency of forming piRNA clusters in syntenic regions of the genome. Thus, the density based clustering approach is effective and robust to the existence of non-piRNAs or noise in the data. In experiments with piRNA data from human, mouse, rat and chicken, piClust was able to detect piRNA clusters from total small RNA-seq data from germ cell lines, while proTRAC was not successful. piClust outperformed proTRAC in terms of sensitivity and running time (up to 200 folds). © 2014 Elsevier Ltd.",
            "authors": [
                "Jung I.",
                "Park J.C.",
                "Kim S."
            ],
            "cit_count": 14,
            "journal": "Computational Biology and Chemistry",
            "pmid": "24656595",
            "title": "PiClust: A density based piRNA clustering algorithm",
            "year": "2014-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:piclust",
        "biotoolsID": "piclust",
        "description": "Use a density based clustering approach without assumption of any parametric distribution to improve piRNA cluster identification.",
        "homepage": "http://epigenomics.snu.ac.kr/piclustweb/",
        "name": "piClust"
    }
}