{
    "additionDate": "2020-03-30T09:12:42Z",
    "biotoolsCURIE": "biotools:meander",
    "biotoolsID": "meander",
    "credit": [
        {
            "name": "Georgios Pavlopoulos",
            "orcidid": "http://orcid.org/0000-0002-4577-8276"
        }
    ],
    "description": "A tool for comparative genomics aiming to aid researchers in identifying and visualizing Structural Variations with the use of Hilbert curves",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://sites.google.com/site/meanderviz/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2020-03-30T09:12:42Z",
    "maturity": "Mature",
    "name": "Meander",
    "owner": "g.pavlopoulos",
    "publication": [
        {
            "metadata": {
                "abstract": "The introduction of next generation sequencing methods in genome studies has made it possible to shift research from a gene-centric approach to a genome wide view. Although methods and tools to detect single nucleotide polymorphisms are becoming more mature, methods to identify and visualize structural variation (SV) are still in their infancy. Most genome browsers can only compare a given sequence to a reference genome; therefore, direct comparison of multiple individuals still remains a challenge. Therefore, the implementation of efficient approaches to explore and visualize SVs and directly compare two or more individuals is desirable. In this article, we present a visualization approach that uses space-filling Hilbert curves to explore SVs based on both read-depth and pair-end information. An interactive open-source Java application, called Meander, implements the proposed methodology, and its functionality is demonstrated using two cases. With Meander, users can explore variations at different levels of resolution and simultaneously compare up to four different individuals against a common reference. The application was developed using Java version 1.6 and Processing.org and can be run on any platform. It can be found at http://homes.esat.kuleuven.be/~bioiuser/meander. © 2013 The Author(s).",
                "authors": [
                    {
                        "name": "Pavlopoulos G.A."
                    },
                    {
                        "name": "Kumar P."
                    },
                    {
                        "name": "Sifrim A."
                    },
                    {
                        "name": "Sakai R."
                    },
                    {
                        "name": "Lin M.L."
                    },
                    {
                        "name": "Voet T."
                    },
                    {
                        "name": "Moreau Y."
                    },
                    {
                        "name": "Aerts J."
                    }
                ],
                "citationCount": 3,
                "date": "2013-06-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Meander: Visually exploring the structural variome using space-filling curves"
            },
            "pmid": "23605045"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ]
}