{
    "additionDate": "2020-01-14T08:58:52Z",
    "biotoolsCURIE": "biotools:QMEANDisCo",
    "biotoolsID": "QMEANDisCo",
    "confidence_flag": "tool",
    "description": "Distance Constraints Applied on Model Quality Estimation.\n\nQMEAN, the Qualitative Model Energy ANalysis, is a composite scoring function assessing the major geometrical aspects of protein structures. Estimates of structure quality are provided for full structures as well as on a local per residue scale.\n\nQMEAN Qualitative Model Energy ANalysis.\n\nQMEAN - Qualitative Model Energy ANalysis.\n\nReference for the QMEANDisCo scoring function:.\n\nFor optimum performance, please add the SEQRES of your model here.\n\nMerge branch 'release-3.1.0' · 3c2b6012.\n\nLocal quality is either estimated using the raw QMEAN scoring function or one of the two specialized functions QMEANBrane and QMEANDisCo. They all provide scores in range [0,1] with one being good.\n\nReference for the QMEAN scoring function:",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Protein structure validation",
                    "uri": "http://edamontology.org/operation_0321"
                }
            ]
        }
    ],
    "homepage": "https://swissmodel.expasy.org/qmean",
    "lastUpdate": "2020-12-11T14:27:55Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://git.scicore.unibas.ch/schwede/QMEAN"
        }
    ],
    "name": "QMEANDisCo",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ828",
            "metadata": {
                "abstract": "© The Author(s) 2019.Motivation: Methods that estimate the quality of a 3D protein structure model in absence of an experimental reference structure are crucial to determine a model’s utility and potential applications. Single model methods assess individual models whereas consensus methods require an ensemble of models as input. In this work, we extend the single model composite score QMEAN that employs statistical potentials of mean force and agreement terms by introducing a consensus-based distance constraint (DisCo) score. Results: DisCo exploits distance distributions from experimentally determined protein structures that are homologous to the model being assessed. Feed-forward neural networks are trained to adaptively weigh contributions by the multi-template DisCo score and classical single model QMEAN parameters. The result is the composite score QMEANDisCo, which combines the accuracy of consensus methods with the broad applicability of single model approaches. We also demonstrate that, despite being the de-facto standard for structure prediction benchmarking, CASP models are not the ideal data source to train predictive methods for model quality estimation. For performance assessment, QMEANDisCo is continuously benchmarked within the CAMEO project and participated in CASP13. For both, it ranks among the top performers and excels with low response times.",
                "authors": [
                    {
                        "name": "Studer G."
                    },
                    {
                        "name": "Rempfer C."
                    },
                    {
                        "name": "Waterhouse A.M."
                    },
                    {
                        "name": "Gumienny R."
                    },
                    {
                        "name": "Haas J."
                    },
                    {
                        "name": "Schwede T."
                    }
                ],
                "citationCount": 38,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "QMEANDisCo—distance constraints applied on model quality estimation"
            },
            "pmid": "31697312"
        }
    ],
    "topic": [
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        }
    ],
    "validated": 1
}