{
    "additionDate": "2021-01-18T11:25:39Z",
    "biotoolsCURIE": "biotools:ienhancer-xg",
    "biotoolsID": "ienhancer-xg",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "fxz326@hnu.edu.cn",
            "name": "Xiangzheng Fu",
            "typeEntity": "Person"
        },
        {
            "email": "xzeng@hnu.edu.cn",
            "name": "Xiangxiang Zeng",
            "typeEntity": "Person"
        }
    ],
    "description": "Interpretable sequence-based enhancers and their strength predictor.\n\nThe program is developed for enhaner prediction, including five individual feature-based models: spectrum profile, mismatch profile, subsequence profile, PSSM and PseDNC, and ensemble learning model. Before the prediction, please make sure your computer has installed the software: the python package: repDNA and shap.\n\nrepDNA (http://bioinformatics.hitsz.edu.cn/repDNA/).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jimmyrate/ienhancer-xg",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-03T07:39:58Z",
    "name": "iEnhancer-XG",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA914",
            "metadata": {
                "abstract": "© 2021 Oxford University Press. All rights reserved.Motivation: Enhancers are non-coding DNA fragments with high position variability and free scattering. They play an important role in controlling gene expression. As machine learning has become more widely used in identifying enhancers, a number of bioinformatic tools have been developed. Although several models for identifying enhancers and their strengths have been proposed, their accuracy and efficiency have yet to be improved. Results: We propose a two-layer predictor called iEnhancer-XG. It comprises a one-layer predictor (for identifying enhancers) and a second classifier (for their strength) and uses XGBoost as a base classifier and five feature extraction methods, namely, k-Spectrum Profile, Mismatch k-tuple, Subsequence Profile, Position-specific scoring matrix (PSSM) and Pseudo dinucleotide composition (PseDNC). Each method has an independent output. We place the feature vector matrix into the ensemble learning for fusion. This experiment involves the method of SHapley Additive explanations to provide interpretability for the previous black box machine learning methods and improve their credibility. The accuracies of the ensemble learning method are 0.811 (first layer) and 0.657 (second layer). The rigorous 10-fold cross-validation confirms that the proposed method is significantly better than existing technologies.",
                "authors": [
                    {
                        "name": "Cai L."
                    },
                    {
                        "name": "Fu X."
                    },
                    {
                        "name": "Gao M."
                    },
                    {
                        "name": "Peng L."
                    },
                    {
                        "name": "Ren X."
                    },
                    {
                        "name": "Zeng X."
                    }
                ],
                "citationCount": 6,
                "date": "2021-04-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "IEnhancer-XG: Interpretable sequence-based enhancers and their strength predictor"
            },
            "pmid": "33119044"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}
