{
    "name": "micropower", 
    "description": "Package designed to facilitate power estimation for microbiome studies that will be analyzed with pairwise distances (beta diversity) and PERMANOVA (a non-parametric extension of multivariate analysis of variance to a matrix of pairwise distances).", 
    "homepage": "https://github.com/brendankelly/micropower", 
    "biotoolsID": "micropower", 
    "biotoolsCURIE": "biotools:micropower", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3221", 
                    "term": "Species frequency estimation"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3697", 
            "term": "Microbial ecology"
        }, 
        {
            "uri": "http://edamontology.org/topic_3301", 
            "term": "Microbiology"
        }
    ], 
    "operatingSystem": [
        "Linux"
    ], 
    "language": [
        "R"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/micropower-power-estimation-for-microbiome-studies.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "https://github.com/brendankelly/micropower/blob/master/README.md", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "25819674", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Power and sample-size estimation for microbiome studies using pairwise distances and PERMANOVA", 
                "abstract": "© The Author 2015. Published by Oxford University Press. All rights reserved. For Permissions, please e-mail: journals.permissions@oup.com. Motivation: The variation in community composition between microbiome samples, termed beta diversity, can be measured by pairwise distance based on either presence-absence or quantitative species abundance data. PERMANOVA, a permutation-based extension of multivariate analysis of variance to a matrix of pairwise distances, partitions within-group and between-group distances to permit assessment of the effect of an exposure or intervention (grouping factor) upon the sampled microbiome. Within-group distance and exposure/intervention effect size must be accurately modeled to estimate statistical power for a microbiome study that will be analyzed with pairwise distances and PERMANOVA. Results: We present a framework for PERMANOVA power estimation tailored to marker-gene microbiome studies that will be analyzed by pairwise distances, which includes: (i) a novel method for distance matrix simulation that permits modeling of within-group pairwise distances according to pre-specified population parameters; (ii) a method to incorporate effects of different sizes within the simulated distance matrix; (iii) a simulation-based method for estimating PERMANOVA power from simulated distance matrices; and (iv) an R statistical software package that implements the above. Matrices of pairwise distances can be efficiently simulated to satisfy the triangle inequality and incorporate group-level effects, which are quantified by the adjusted coefficient of determination, omega-squared (x2). From simulated distance matrices, available PERMANOVA power or necessary sample size can be estimated for a planned microbiome study.", 
                "date": "2015-01-01T00:00:00Z", 
                "citationCount": 60, 
                "authors": [
                    {
                        "name": "Kelly B.J."
                    }, 
                    {
                        "name": "Gross R."
                    }, 
                    {
                        "name": "Bittinger K."
                    }, 
                    {
                        "name": "Sherrill-Mix S."
                    }, 
                    {
                        "name": "Lewis J.D."
                    }, 
                    {
                        "name": "Collman R.G."
                    }, 
                    {
                        "name": "Bushman F.D."
                    }, 
                    {
                        "name": "Li H."
                    }
                ], 
                "journal": "Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": "Frederic Bushman", 
            "email": "bushman@mail.med.upenn.edu", 
            "url": "http://www.bushmanlab.org/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T19:07:09Z", 
    "lastUpdate": "2018-12-10T12:58:51Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}