{
    "additionDate": "2018-04-22T10:58:58Z",
    "biotoolsCURIE": "biotools:phyinformr",
    "biotoolsID": "phyinformr",
    "credit": [
        {
            "email": "alex.dornburg@naturalsciences.org",
            "name": "Alex Dornburg",
            "orcidid": "http://orcid.org/0000-0003-0863-2283",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Open source software package that performs rapid calculation of phylogenetic information content using the latest advances in phylogenetic informativeness based theory.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/carolinafishes/PhyInformR/blob/master/README.md"
        },
        {
            "type": [
                "User manual"
            ],
            "url": "https://carolinafishes.github.io/images/PhyInformR.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree analysis",
                    "uri": "http://edamontology.org/operation_0324"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Phylogenetic tree visualisation",
                    "uri": "http://edamontology.org/operation_0567"
                }
            ]
        }
    ],
    "homepage": "https://carolinafishes.github.io/software/phyinformR/",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-13T18:05:10Z",
    "name": "PhyInformR",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1186/S12862-016-0837-3",
            "metadata": {
                "abstract": "© 2016 The Author(s)Background: Analyses of phylogenetic informativeness represent an important step in screening potential or existing datasets for their proclivity toward convergent or parallel evolution of molecular sites. However, while new theory has been developed from which to predict the utility of sequence data, adoption of these advances have been stymied by a lack of software enabling application of advances in theory, especially for large next-generation sequence data sets. Moreover, there are no theoretical barriers to application of the phylogenetic informativeness or the calculation of quartet internode resolution probabilities in a Bayesian setting that more robustly accounts for uncertainty, yet there is no software with which a computationally intensive Bayesian approach to experimental design could be implemented. Results: We introduce PhyInformR, an open source software package that performs rapid calculation of phylogenetic information content using the latest advances in phylogenetic informativeness based theory. These advances include modifications that incorporate uneven branch lengths and any model of nucleotide substitution to provide assessments of the phylogenetic utility of any given dataset or dataset partition. PhyInformR provides new tools for data visualization and routines optimized for rapid statistical calculations, including approaches making use of Bayesian posterior distributions and parallel processing. By implementing the computation on user hardware, PhyInformR increases the potential power users can apply toward screening datasets for phylogenetic/genomic information content by orders of magnitude. Conclusions: PhyInformR provides a means to implement diverse substitution models and specify uneven branch lengths for phylogenetic informativeness or calculations providing quartet based probabilities of resolution, produce novel visualizations, and facilitate analyses of next-generation sequence datasets while incorporating phylogenetic uncertainty through the use parallel processing. As an open source program, PhyInformR is fully customizable and expandable, thereby allowing for advanced methodologies to be readily integrated into local bioinformatics pipelines. Software is available through CRAN and a package containing the software, a detailed manual, and additional sample data is also provided freely through github: https://github.com/carolinafishes/PhyInformR .",
                "authors": [
                    {
                        "name": "Dornburg A."
                    },
                    {
                        "name": "Fisk J.N."
                    },
                    {
                        "name": "Tamagnan J."
                    },
                    {
                        "name": "Townsend J.P."
                    }
                ],
                "citationCount": 19,
                "date": "2016-12-01T00:00:00Z",
                "journal": "BMC Evolutionary Biology",
                "title": "PhyInformR: phylogenetic experimental design and phylogenomic data exploration in R"
            },
            "pmcid": "PMC5134231",
            "pmid": "27905871",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        }
    ],
    "validated": 1
}
