{
    "accessibility": "Open access",
    "additionDate": "2022-12-30T23:52:02.823170Z",
    "biotoolsCURIE": "biotools:idvip",
    "biotoolsID": "idvip",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Hui-Ju Kao"
        },
        {
            "name": "Shun-Long Weng"
        },
        {
            "name": "Kai-Yao Huang",
            "orcidid": "https://orcid.org/0000-0001-9855-1035"
        }
    ],
    "description": "iDVIP is a web server for identifying Viral integrase inhibitory peptides (VINIPs).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein sequence",
                        "uri": "http://edamontology.org/data_2976"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Peptide identification",
                    "uri": "http://edamontology.org/operation_3631"
                }
            ]
        }
    ],
    "homepage": "http://mer.hc.mmh.org.tw/iDVIP/",
    "lastUpdate": "2024-11-24T15:14:51.915715Z",
    "name": "iDVIP",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/bib/bbac406",
            "metadata": {
                "abstract": "Antiretroviral peptides are a kind of bioactive peptides that present inhibitory activity against retroviruses through various mechanisms. Among them, viral integrase inhibitory peptides (VINIPs) are a class of antiretroviral peptides that have the ability to block the action of integrase proteins, which is essential for retroviral replication. As the number of experimentally verified bioactive peptides has increased significantly, the lack of in silico machine learning approaches can effectively predict the peptides with the integrase inhibitory activity. Here, we have developed the first prediction model for identifying the novel VINIPs using the sequence characteristics, and the hybrid feature set was considered to improve the predictive ability. The performance was evaluated by 5-fold cross-validation based on the training dataset, and the result indicates the proposed model is capable of predicting the VINIPs, with a sensitivity of 85.82%, a specificity of 88.81%, an accuracy of 88.37%, a balanced accuracy of 87.32% and a Matthews correlation coefficient value of 0.64. Most importantly, the model also consistently provides effective performance in independent testing. To sum up, we propose the first computational approach for identifying and characterizing the VINIPs, which can be considered novel antiretroviral therapy agents. Ultimately, to facilitate further research and development, iDVIP, an automatic computational tool that predicts the VINIPs has been developed, which is now freely available at http://mer.hc.mmh.org.tw/iDVIP/.",
                "authors": [
                    {
                        "name": "Chen C.-H."
                    },
                    {
                        "name": "Huang K.-Y."
                    },
                    {
                        "name": "Kao H.-J."
                    },
                    {
                        "name": "Weng S.-L."
                    },
                    {
                        "name": "Weng T.-H."
                    }
                ],
                "citationCount": 2,
                "date": "2022-11-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "iDVIP: identification and characterization of viral integrase inhibitory peptides"
            },
            "pmid": "36215051"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
