{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2021-03-19T08:47:53Z",
    "biotoolsCURIE": "biotools:anduin",
    "biotoolsID": "anduin",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Maximilian T. Löffler",
            "orcidid": "https://orcid.org/0000-0002-6022-3682",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Anduin is a freely available research tool to segment vertebrae in a CT scan, uploaded as NIFTI data. It allows to calculate trabecular vBMD, download the segmentation as NIFTI, and vertebral centroid coordinates as JSON files.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://anduin.bonescreen.de",
    "lastUpdate": "2024-11-24T20:37:16.702162Z",
    "license": "CC-BY-SA-4.0",
    "name": "anduin",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1007/s00330-020-07655-2",
            "metadata": {
                "abstract": "Objectives: To compare spinal bone measures derived from automatic and manual assessment in routine CT with dual energy X-ray absorptiometry (DXA) in their association with prevalent osteoporotic vertebral fractures using our fully automated framework (https://anduin.bonescreen.de) to assess various bone measures in clinical CT. Methods: We included 192 patients (141 women, 51 men; age 70.2 ± 9.7 years) who had lumbar DXA and CT available (within 1 year). Automatic assessment of spinal bone measures in CT included segmentation of vertebrae using a convolutional neural network (CNN), reduction to the vertebral body, and extraction of bone mineral content (BMC), trabecular and integral volumetric bone mineral density (vBMD), and CT-based areal BMD (aBMD) using asynchronous calibration. Moreover, trabecular bone was manually sampled (manual vBMD). Results: A total of 148 patients (77%) had vertebral fractures and significantly lower values in all bone measures compared to patients without fractures (p ≤ 0.001). Except for BMC, all CT-based measures performed significantly better as predictors for vertebral fractures compared to DXA (e.g., AUC = 0.885 for trabecular vBMD and AUC = 0.86 for integral vBMD vs. AUC = 0.668 for DXA aBMD, respectively; both p < 0.001). Age- and sex-adjusted associations with fracture status were strongest for manual vBMD (OR = 7.3, [95%] CI 3.8–14.3) followed by automatically assessed trabecular vBMD (OR = 6.9, CI 3.5–13.4) and integral vBMD (OR = 4.3, CI 2.5–7.6). Diagnostic cutoffs of integral vBMD for osteoporosis (< 160 mg/cm3) or low bone mass (160 ≤ BMD < 190 mg/cm3) had sensitivity (84%/41%) and specificity (78%/95%) similar to trabecular vBMD. Conclusions: Fully automatic osteoporosis screening in routine CT of the spine is feasible. CT-based measures can better identify individuals with reduced bone mass who suffered from vertebral fractures than DXA. Key Points: • Opportunistic osteoporosis screening of spinal bone measures derived from clinical routine CT is feasible in a fully automatic fashion using a deep learning-driven framework (https://anduin.bonescreen.de). • Manually sampled volumetric BMD (vBMD) and automatically assessed trabecular and integral vBMD were the best predictors for prevalent vertebral fractures. • Except for bone mineral content, all CT-based bone measures performed significantly better than DXA-based measures. • We introduce diagnostic thresholds of integral vBMD for osteoporosis (< 160 mg/cm3) and low bone mass (160 ≤ BMD < 190 mg/cm3) with almost equal sensitivity and specificity compared to conventional thresholds of quantitative CT as proposed by the American College of Radiology (osteoporosis < 80 mg/cm3).",
                "authors": [
                    {
                        "name": "Baum T."
                    },
                    {
                        "name": "Burian E."
                    },
                    {
                        "name": "El Husseini M."
                    },
                    {
                        "name": "Gempt J."
                    },
                    {
                        "name": "Jacob A."
                    },
                    {
                        "name": "Kirschke J.S."
                    },
                    {
                        "name": "Loffler M.T."
                    },
                    {
                        "name": "Scharr A."
                    },
                    {
                        "name": "Sekuboyina A."
                    },
                    {
                        "name": "Sollmann N."
                    },
                    {
                        "name": "Tetteh G."
                    },
                    {
                        "name": "Zimmer C."
                    }
                ],
                "citationCount": 62,
                "date": "2021-08-01T00:00:00Z",
                "journal": "European Radiology",
                "title": "Automatic opportunistic osteoporosis screening in routine CT: improved prediction of patients with prevalent vertebral fractures compared to DXA"
            },
            "pmcid": "PMC8270840",
            "pmid": "33507353"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Musculoskeletal medicine",
            "uri": "http://edamontology.org/topic_3416"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ]
}
