{
    "additionDate": "2017-12-18T00:10:20Z",
    "biotoolsCURIE": "biotools:pgm",
    "biotoolsID": "pgm",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "email": "bridges@cse.msstate.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The PGM Tool provides a standalone application for mapping peptides back to their source genome on a number of operating system platforms with standard desktop computer hardware and executes very rapidly for a variety of datasets. Allowing the selection of different genetic codes for different organisms allows researchers to easily customize the tool to their own research interests and is recommended for anyone working to structurally annotate genomes using MS derived proteomics data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.agbase.msstate.edu/tools/pgm/readme"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "homepage": "http://www.agbase.msstate.edu/tools/pgm/",
    "language": [
        "Java",
        "Perl"
    ],
    "lastUpdate": "2019-03-26T08:31:49Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/pgm-1-0-proteogenomic-mapping-tool.html"
        }
    ],
    "name": "PGM",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-12-115",
            "metadata": {
                "abstract": "Background: High-throughput mass spectrometry (MS) proteomics data is increasingly being used to complement traditional structural genome annotation methods. To keep pace with the high speed of experimental data generation and to aid in structural genome annotation, experimentally observed peptides need to be mapped back to their source genome location quickly and exactly. Previously, the tools to do this have been limited to custom scripts designed by individual research groups to analyze their own data, are generally not widely available, and do not scale well with large eukaryotic genomes.Results: The Proteogenomic Mapping Tool includes a Java implementation of the Aho-Corasick string searching algorithm which takes as input standardized file types and rapidly searches experimentally observed peptides against a given genome translated in all 6 reading frames for exact matches. The Java implementation allows the application to scale well with larger eukaryotic genomes while providing cross-platform functionality.Conclusions: The Proteogenomic Mapping Tool provides a standalone application for mapping peptides back to their source genome on a number of operating system platforms with standard desktop computer hardware and executes very rapidly for a variety of datasets. Allowing the selection of different genetic codes for different organisms allows researchers to easily customize the tool to their own research interests and is recommended for anyone working to structurally annotate genomes using MS derived proteomics data. © 2011 Sanders et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Sanders W.S."
                    },
                    {
                        "name": "Wang N."
                    },
                    {
                        "name": "Bridges S.M."
                    },
                    {
                        "name": "Malone B.M."
                    },
                    {
                        "name": "Dandass Y.S."
                    },
                    {
                        "name": "McCarthy F.M."
                    },
                    {
                        "name": "Nanduri B."
                    },
                    {
                        "name": "Lawrence M.L."
                    },
                    {
                        "name": "Burgess S.C."
                    }
                ],
                "citationCount": 31,
                "date": "2011-04-22T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "The proteogenomic mapping tool"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Peptides",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1,
    "version": [
        "1.1"
    ]
}