{
    "additionDate": "2021-01-18T10:50:21Z",
    "biotoolsCURIE": "biotools:pbsim2",
    "biotoolsID": "pbsim2",
    "credit": [
        {
            "email": "mhamada@waseda.jp",
            "name": "Michiaki Hamada",
            "typeEntity": "Person"
        }
    ],
    "description": "pbsim2 is a simulator for long read sequencers with a novel generative model of quality scores.\n\n\nWhen a coverage depth is 100x and a length of reference sequence is about 10M, PBSIM generates simulated dataset in several minutes. The runtime is roughly proportional to the coverage depth and the length of reference sequence. PBSIM requires memory of the length of reference sequence plus several mega bytes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Base-calling",
                    "uri": "http://edamontology.org/operation_3185"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "homepage": "https://github.com/yukiteruono/pbsim2",
    "language": [
        "C++",
        "Shell"
    ],
    "lastUpdate": "2024-11-24T20:47:02.510739Z",
    "license": "GPL-2.0",
    "name": "PBSIM2",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btaa835",
            "metadata": {
                "abstract": "Motivation: Recent advances in high-throughput long-read sequencers, such as PacBio and Oxford Nanopore sequencers, produce longer reads with more errors than short-read sequencers. In addition to the high error rates of reads, non-uniformity of errors leads to difficulties in various downstream analyses using long reads. Many useful simulators, which characterize long-read error patterns and simulate them, have been developed. However, there is still room for improvement in the simulation of the non-uniformity of errors. Results: To capture characteristics of errors in reads for long-read sequencers, here, we introduce a generative model for quality scores, in which a hidden Markov Model with a latest model selection method, called factorized information criteria, is utilized. We evaluated our developed simulator from various points, indicating that our simulator successfully simulates reads that are consistent with real reads. Availability and implementation: The source codes of PBSIM2 are freely available from https://github.com/yukiter uono/pbsim2.",
                "authors": [
                    {
                        "name": "Asai K."
                    },
                    {
                        "name": "Hamada M."
                    },
                    {
                        "name": "Ono Y."
                    }
                ],
                "citationCount": 72,
                "date": "2021-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "PBSIM2: A simulator for long-read sequencers with a novel generative model of quality scores"
            },
            "pmcid": "PMC8097687",
            "pmid": "32976553"
        }
    ],
    "topic": [
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
