{
    "additionDate": "2022-08-15T11:04:54.500757Z",
    "biotoolsCURIE": "biotools:deephiscom",
    "biotoolsID": "deephiscom",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "tspark@stats.snu.ac.kr",
            "name": "Taesung Park",
            "typeEntity": "Person"
        }
    ],
    "description": "DeepHisCoM (Deep-learning pathway analysis using Hierarchical structured CoMponent models) which uses deep learning analysis to find complex relationships between biological factors and pathways.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Pathway analysis",
                    "uri": "http://edamontology.org/operation_3928"
                },
                {
                    "term": "SNP annotation",
                    "uri": "http://edamontology.org/operation_3661"
                }
            ]
        }
    ],
    "homepage": "https://github.com/chanwoo-park-official/DeepHisCoM",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:49:32.004373Z",
    "license": "Not licensed",
    "name": "DeepHisCoM",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/bib/bbac171",
            "metadata": {
                "abstract": "Many statistical methods for pathway analysis have been used to identify pathways associated with the disease along with biological factors such as genes and proteins. However, most pathway analysis methods neglect the complex nonlinear relationship between biological factors and pathways. In this study, we propose a Deep-learning pathway analysis using Hierarchical structured CoMponent models (DeepHisCoM) that utilize deep learning to consider a nonlinear complex contribution of biological factors to pathways by constructing a multilayered model which accounts for hierarchical biological structure. Through simulation studies, DeepHisCoM was shown to have a higher power in the nonlinear pathway effect and comparable power for the linear pathway effect when compared to the conventional pathway methods. Application to hepatocellular carcinoma (HCC) omics datasets, including metabolomic, transcriptomic and metagenomic datasets, demonstrated that DeepHisCoM successfully identified three well-known pathways that are highly associated with HCC, such as lysine degradation, valine, leucine and isoleucine biosynthesis and phenylalanine, tyrosine and tryptophan. Application to the coronavirus disease-2019 (COVID-19) single-nucleotide polymorphism (SNP) dataset also showed that DeepHisCoM identified four pathways that are highly associated with the severity of COVID-19, such as mitogen-activated protein kinase (MAPK) signaling pathway, gonadotropin-releasing hormone (GnRH) signaling pathway, hypertrophic cardiomyopathy and dilated cardiomyopathy. Codes are available at https://github.com/chanwoo-park-official/DeepHisCoM.",
                "authors": [
                    {
                        "name": "Kim B."
                    },
                    {
                        "name": "Park C."
                    },
                    {
                        "name": "Park T."
                    }
                ],
                "citationCount": 2,
                "date": "2022-09-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "DeepHisCoM: Deep learning pathway analysis using hierarchical structural component models"
            },
            "pmid": "35598329"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
