{
    "additionDate": "2017-08-03T19:06:09Z",
    "biotoolsCURIE": "biotools:ihsp-pseraaac",
    "biotoolsID": "ihsp-pseraaac",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "email": "hlin@uestc.edu.cn",
            "name": "Hao Lin",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://lin.uestc.edu.cn/"
        }
    ],
    "description": "This web-server was developed to identify the family of heat shock proteins by using reduced amino acid alphabet.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://lin.uestc.edu.cn/server/iHSPred/readme"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                },
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "homepage": "http://lin.uestc.edu.cn/server/iHSP-PseRAAAC",
    "lastUpdate": "2019-03-26T08:19:17Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/ihsp-pseraaac-identifying-the-heat-shock-protein-families.html"
        }
    ],
    "name": "iHSP-PseRAAAC",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Heat shock proteins (HSPs) are a type of functionally related proteins present in all living organisms, both prokaryotes and eukaryotes. They play essential roles in protein-protein interactions such as folding and assisting in the establishment of proper protein conformation and prevention of unwanted protein aggregation. Their dysfunction may cause various life-threatening disorders, such as Parkinson's, Alzheimer's, and cardiovascular diseases. Based on their functions, HSPs are usually classified into six families: (i) HSP20 or sHSP, (ii) HSP40 or J-class proteins, (iii) HSP60 or GroEL/ES, (iv) HSP70, (v) HSP90, and (vi) HSP100. Although considerable progress has been achieved in discriminating HSPs from other proteins, it is still a big challenge to identify HSPs among their six different functional types according to their sequence information alone. With the avalanche of protein sequences generated in the post-genomic age, it is highly desirable to develop a high-throughput computational tool in this regard. To take up such a challenge, a predictor called iHSP-PseRAAAC has been developed by incorporating the reduced amino acid alphabet information into the general form of pseudo amino acid composition. One of the remarkable advantages of introducing the reduced amino acid alphabet is being able to avoid the notorious dimension disaster or overfitting problem in statistical prediction. It was observed that the overall success rate achieved by iHSP-PseRAAAC in identifying the functional types of HSPs among the aforementioned six types was more than 87%, which was derived by the jackknife test on a stringent benchmark dataset in which none of HSPs included has P40% pairwise sequence identity to any other in the same subset. It has not escaped our notice that the reduced amino acid alphabet approach can also be used to investigate other protein classification problems. As a user-friendly web server, iHSP-PseRAAAC is accessible to the public at http://lin.uestc.edu.cn/ server/iHSP-PseRAAAC. © 2013 Elsevier Inc. All rights reserved.",
                "authors": [
                    {
                        "name": "Chen W."
                    },
                    {
                        "name": "Chou K.-C."
                    },
                    {
                        "name": "Feng P.-M."
                    },
                    {
                        "name": "Lin H."
                    }
                ],
                "citationCount": 255,
                "date": "2013-01-01T00:00:00Z",
                "journal": "Analytical Biochemistry",
                "title": "IHSP-PseRAAAC: Identifying the heat shock protein families using pseudo reduced amino acid alphabet composition"
            },
            "pmid": "23756733"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ],
    "validated": 1
}
