{
    "additionDate": "2023-10-25T13:29:41.773029Z",
    "biotoolsCURIE": "biotools:eccbase",
    "biotoolsID": "eccbase",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "zoulingyun@cqu.edu.cn",
            "name": "Lingyun Zou",
            "typeEntity": "Person"
        }
    ],
    "description": "High-quality database for exploration and characterization of extrachromosomal circular DNAs in cancer.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "homepage": "http://www.eccbase.net",
    "lastUpdate": "2024-11-24T14:36:50.853086Z",
    "name": "eccBase",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/j.csbj.2023.04.012",
            "metadata": {
                "abstract": "Extrachromosomal circular DNAs (eccDNAs) are widely observed in eukaryotes. Previous studies have demonstrated that eccDNAs are essential to cancer progression, and found that they can not only express in normal cells to regulate RNA, but also function differently in different tissues. It is of major interest to conduct computational or experiments assay to elucidate the mechanisms of eccDNA function, uncover key eccDNAs associated with diseases, and even develop related algorithms for liquid biopsy. Naturally, a comprehensive eccDNAs data resource is urgently needed to provide annotation and analysis more in-depth research. In this study, we constructed the eccBase (http://www.eccbase.net) in literature curation and database retrieval, which was the first database mainly collecting eccDNAs from Homo sapiens (n = 754,391) and Mus musculus (n = 481,381). Homo sapiens eccDNAs were taken from 50 kinds of cancer tissue and/or cell line, and 5 kinds of healthy tissues. The Mus musculus eccDNAs were sourced from 13 kinds of healthy tissue and/or cell line. We thoroughly annotated all eccDNA molecules in terms of basic information, genomic composition, regulatory elements, epigenetic modifications, and raw data. EccBase provided users with the ability to browse, search, download for targets of interest, as well as similarity alignment by the integrated BLAST. Further, comparative analysis suggested the cancer eccDNA is composed of nucleosomes and is prominently derived from the gene-dense regions. We also initially revealed that eccDNAs are strongly tissue-specific. In short, we have started a robust database for eccDNA resource utilization, which may facilitate studying the role of eccDNA in cancer development and therapy, cell function maintenance, and tissue differentiation.",
                "authors": [
                    {
                        "name": "Lu X."
                    },
                    {
                        "name": "Sun H."
                    },
                    {
                        "name": "Zou L."
                    }
                ],
                "citationCount": 7,
                "date": "2023-01-01T00:00:00Z",
                "journal": "Computational and Structural Biotechnology Journal",
                "title": "EccBase: A high-quality database for exploration and characterization of extrachromosomal circular DNAs in cancer"
            },
            "pmcid": "PMC10126927",
            "pmid": "37114214",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}
