
{
    "credit": [
        {
            "email": "khanjav@mail.nih.gov",
            "name": "Javed Khan",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "pmeltzer@nhgri.nih.gov",
            "name": "Paul S. Meltzer",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://research.nhgri.nih.gov/microarray/index.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression clustering",
                    "uri": "http://edamontology.org/operation_0313"
                },
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Gene expression correlation",
                    "uri": "http://edamontology.org/operation_3463"
                }
            ]
        }
    ],
    "labels": {
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "Gene transcripts",
                "uri": "http://edamontology.org/topic_3512"
            },
            {
                "term": "Gene regulation",
                "uri": "http://edamontology.org/topic_0204"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Oncology",
                "uri": "http://edamontology.org/topic_2640"
            }
        ]
    },
    "publication": [
        {
            "abstract": "The effects of hormone and growth factor signaling on gene expression contribute significantly to breast tumorigenesis and disease progression; however, the targets of signaling networks associated with deregulated growth are not well understood. We defined the dynamic transcriptional effects elicited in MCF7, T-47D, and MDA-MB-436 breast cancer cell lines by nine regulators of growth and differentiation (17β-estradiol, antiestrogens fulvestrant and tamoxifen, progestin R5020, antiprogestin RU486, all-trans-retinoic acid, epidermal growth factor, mitogen-activated protein/extracellular signal-regulated kinase 1/2 inhibitor U0126 and phorbol ester 12-O-tetradecanoylphorbol-13-acetate) and compared the patterns of gene regulation to published tumor expression profiles. The complex pattern of response to these agents revealed unexpected relationships between their effects, including a profound overlap in genes regulated by both steroids and epidermal growth factor, and striking overlaps between fulvestrant and all-trans-retinoic acid. Estrogen-responsive genes could be divided into two major clusters, only one of which is associated with cell proliferation. Gene ontology analysis was used to highlight functionally distinct biological responses to different mitogens. Significant correlations were identified between several clusters of drug-responsive genes and genes that discriminate estrogen receptor status or disease outcome in patient samples. The majority of estrogen receptor status discriminators were not responsive in our dataset and are therefore likely to reflect underlying differences in histogenesis and disease progression rather than growth factor signaling. This article highlights the overall impact at the gene expression level of diverse regulators of breast cancer growth and links the behavior of breast cancer cells in culture to important clinical properties of human breast tumors.",
            "authors": [
                "Cunliffe H.E.",
                "Ringner M.",
                "Bilke S.",
                "Walker R.L.",
                "Cheung J.M.",
                "Chen Y.",
                "Meltzer P.S."
            ],
            "cit_count": 78,
            "journal": "Cancer Research",
            "pmid": "14612509",
            "title": "The Gene Expression Response of Breast Cancer to Growth Regulators: Patterns and Correlation with Tumor Expression Profiles",
            "year": "2003-11-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:nhgri_micorarray_project",
        "biotoolsID": "nhgri_micorarray_project",
        "description": "Protocols, analysis and resources; BLAST against the 15K set cDNA library clones (from 15,000 human UniGene clusters; clones are available).",
        "homepage": "http://research.nhgri.nih.gov/microarray/index.html",
        "name": "NHGRI Micorarray Project"
    }
}