{"credit":[{"email":"ivanam@bii.a-star.edu.sg","name":"Dr. Ivana Mihalek","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"zhangzh@bii.a-star.edu.sg","name":"Ms. Zhang Zong Hong","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://epsf.bmad.bii.a-star.edu.sg/cube/db/html/doc.html"}],"function":[{"operation":[{"term":"Sequence alignment analysis (conservation)","uri":"http://edamontology.org/operation_0448"},{"term":"Protein feature detection","uri":"http://edamontology.org/operation_3092"}]}],"labels":{"language":["C"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Database portal"],"topic":[{"term":"Gene and protein families","uri":"http://edamontology.org/topic_0623"},{"term":"Proteins","uri":"http://edamontology.org/topic_0078"},{"term":"Model organisms","uri":"http://edamontology.org/topic_0621"}]},"publication":[{"abstract":"Cube-DB is a database of pre-evaluated results for detection of functional divergence in human/vertebrate protein families. The analysis is organized around the nomenclature associated with the human proteins, but based on all currently available vertebrate genomes. Using full genomes enables us, through a mutual-best-hit strategy, to construct comparable taxonomical samples for all paralogues under consideration. Functional specialization is scored on the residue level according to two models of behavior after divergence: heterotachy and homotachy. In the first case, the positions on the protein sequence are scored highly if they are conserved in the reference group of orthologs, and overlap poorly with the residue type choice in the paralogs groups (such positions will also be termed functional determinants). The second model additionally requires conservation within each group of paralogs (functional discriminants). The scoring functions are phylogeny independent, but sensitive to the residue type similarity. The results are presented as a table of per-residue scores, and mapped onto related structure (when available) via browser-embedded visualization tool. They can also be downloaded as a spreadsheet table, and sessions for two additional molecular visualization tools. The database interface is available at http://epsf.bmad.bii.a-star.edu. sg/cube/db/html/home.html. © The Author(s) 2011.","authors":["Zhang Z.H.","Bharatham K.","Chee S.M.Q.","Mihalek I."],"cit_count":3,"journal":"Nucleic Acids Research","pmid":"22139934","title":"Cube-DB: Detection of functional divergence in human protein families","year":"2012-01-01"}],"summary":{"biotoolsCURIE":"biotools:cube-db","biotoolsID":"cube-db","description":"A database of pre-evaluated results for detection of functional divergence in human/vertebrate protein families, but based on all currently available vertebrate genomes.","homepage":"http://epsf.bmad.bii.a-star.edu.sg/cube/db/html/home.html","name":"CUBE-DB"}}