{
    "additionDate": "2021-01-18T10:22:44Z",
    "biotoolsCURIE": "biotools:reconcnv",
    "biotoolsID": "reconcnv",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "dwparson@texaschildrens.org",
            "name": "D Williams Parsons",
            "typeEntity": "Person"
        }
    ],
    "description": "Interactive visualization of copy number data from high-throughput sequencing.\n\nPerforming copy number analysis from targeted capture high-throughput sequencing has been a challenging task.\n\nReconCNV has been developed to overcome this challenge by providing interactive dashboard for hunting copy number variations (CNVs) from high-throughput sequencing data.",
    "download": [
        {
            "type": "Container file",
            "url": "https://hub.docker.com/repository/docker/raghuc1990/reconcnv"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://github.com/rghu/reconCNV",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-06T11:39:05Z",
    "license": "GPL-3.0",
    "name": "reconCNV",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA746",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Summary: Copy number variation (CNV) is an important category of unbalanced structural rearrangement. While methods for detecting CNV in high-throughput targeted sequencing have become increasingly sophisticated, dedicated tools for interactive and dynamic visualization of CNV from these data are still lacking. We describe reconCNV, a tool that produces an interactive and annotated web-based dashboard for viewing and summarizing CNVs detected in next-generation sequencing (NGS) data. reconCNV is designed to work with delimited result files from most NGS CNV callers with minor adjustments to the configuration file. The reconCNV output is an HTML file that is viewable on any modern web browser, requires no backend server, and can be readily appended to existing analysis pipelines. In addition to a standard CNV track for visualizing relative fold change and absolute copy number, the tool includes an auxiliary variant allele fraction track for visualizing underlying allelic imbalance and loss of heterozygosity. A feature to mask assay-specific technical artifacts and a direct HTML link out to the UCSC Genome Browser are also included to augment the reviewer experience. By providing a light-weight plugin for interactive visualization to existing NGS CNV pipelines, reconCNV can facilitate efficient NGS CNV visualization and interpretation in both research and clinical settings.",
                "authors": [
                    {
                        "name": "Chandramohan R."
                    },
                    {
                        "name": "Kakkar N."
                    },
                    {
                        "name": "Roy A."
                    },
                    {
                        "name": "Parsons D.W."
                    }
                ],
                "date": "2021-04-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "ReconCNV: Interactive visualization of copy number data from high-throughput sequencing"
            },
            "pmid": "32821910"
        }
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ]
}