{
    "additionDate": "2017-01-13T13:13:57Z",
    "biotoolsCURIE": "biotools:catch",
    "biotoolsID": "catch",
    "credit": [
        {
            "email": "fnielsen@cmbi.ru.nl",
            "name": "Fiona Nielsen",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A tool for exploring patterns in ChIP profiling data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://www.bioinformatics.org/download/catch/CATCH_User_manual_2011.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "homepage": "http://catch.cmbi.ru.nl",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "maturity": "Mature",
    "name": "CATCH",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0028272",
            "metadata": {
                "abstract": "Chromatin Immuno Precipitation (ChIP) profiling detects in vivo protein-DNA binding, and has revealed a large combinatorial complexity in the binding of chromatin associated proteins and their post-translational modifications. To fully explore the spatial and combinatorial patterns in ChIP-profiling data and detect potentially meaningful patterns, the areas of enrichment must be aligned and clustered, which is an algorithmically and computationally challenging task. We have developed CATCHprofiles, a novel tool for exhaustive pattern detection in ChIP profiling data. CATCHprofiles is built upon a computationally efficient implementation for the exhaustive alignment and hierarchical clustering of ChIP profiling data. The tool features a graphical interface for examination and browsing of the clustering results. CATCHprofiles requires no prior knowledge about functional sites, detects known binding patterns \"ab initio\", and enables the detection of new patterns from ChIP data at a high resolution, exemplified by the detection of asymmetric histone and histone modification patterns around H2A.Z-enriched sites. CATCHprofiles' capability for exhaustive analysis combined with its ease-of-use makes it an invaluable tool for explorative research based on ChIP profiling data. CATCHprofiles and the CATCH algorithm run on all platforms and is available for free through the CATCH website: http://catch.cmbi.ru.nl/. User support is available by subscribing to the mailing list catch-users@bioinformatics.org. © 2012 Nielsen et al.",
                "authors": [
                    {
                        "name": "Favrholdt L.M."
                    },
                    {
                        "name": "Friborg R.M."
                    },
                    {
                        "name": "Huynen M."
                    },
                    {
                        "name": "Markus K.G."
                    },
                    {
                        "name": "Nielsen F.G.G."
                    },
                    {
                        "name": "Stunnenberg H.G."
                    }
                ],
                "citationCount": 7,
                "date": "2012-01-04T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "CATCHprofiles: Clustering and alignment tool for chip profiles"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "ChIP-on-chip",
            "uri": "http://edamontology.org/topic_3179"
        },
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        }
    ],
    "validated": 1
}
