{
    "additionDate": "2019-11-14T19:53:53Z",
    "biotoolsCURIE": "biotools:MetaboList",
    "biotoolsID": "MetaboList",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "infusoriosentandreu@gmail.com",
            "name": "Enrique Sentandreu",
            "orcidid": "https://orcid.org/0000-0002-4157-580X",
            "typeEntity": "Person"
        },
        {
            "email": "tiziani@austin.utexas.edu",
            "name": "Stefano Tiziani",
            "orcidid": "https://orcid.org/0000-0002-7230-0307",
            "typeEntity": "Person"
        }
    ],
    "description": "> MEDIUM CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'R-MetaboList 2' | A Flexible Tool for Metabolite Annotation from High-Resolution Data-Independent Acquisition Mass Spectrometry Analysis | Annotation of Metabolites from Liquid Chromatography-Mass Spectrometry Data | Automatic metabolite annotation from Liquid Chromatography-Mass Spectrometry (LC-MS and LC-MS/MS DIA) analysis",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Natural product identification",
                    "uri": "http://edamontology.org/operation_3803"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://CRAN.R-project.org/package=MetaboList",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-11-14T19:53:53Z",
    "license": "GPL-2.0",
    "name": "MetaboList",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3390/METABO9090187",
            "metadata": {
                "abstract": "© 2019 by the authors. Licensee MDPI, Basel, Switzerland.Technological advancements have permitted the development of innovative multiplexing strategies for data independent acquisition (DIA) mass spectrometry (MS). Software solutions and extensive compound libraries facilitate the efficient analysis of MS1 data, regardless of the analytical platform. However, the development of comparable tools for DIA data analysis has significantly lagged. This research introduces an update to the former MetaboList R package and a workflow for full-scan MS1 and MS/MS DIA processing of metabolomic data from multiplexed liquid chromatography high-resolution mass spectrometry (LC-HRMS) experiments. When compared to the former version, new functions have been added to address isolated MS1 and MS/MS workflows, processing of MS/MS data from stepped collision energies, performance scoring of metabolite annotations, and batch job analysis were incorporated into the update. The flexibility and efficiency of this strategy were assessed through the study of the metabolite profiles of human urine, leukemia cell culture, and medium samples analyzed by either liquid chromatography quadrupole time-of-flight (q-TOF) or quadrupole orbital (q-Orbitrap) instruments. This open-source alternative was designed to promote global metabolomic strategies based on recursive retrospective research of multiplexed DIA analysis.",
                "authors": [
                    {
                        "name": "Peris-Diaz M.D."
                    },
                    {
                        "name": "Sweeney S.R."
                    },
                    {
                        "name": "Rodak O."
                    },
                    {
                        "name": "Sentandreu E."
                    },
                    {
                        "name": "Tiziani S."
                    }
                ],
                "citationCount": 1,
                "date": "2019-09-01T00:00:00Z",
                "journal": "Metabolites",
                "title": "R-metabolist 2: A flexible tool for metabolite annotation from high-resolution data-independent acquisition mass spectrometry analysis"
            },
            "pmcid": "PMC6780920",
            "pmid": "31533242"
        }
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}