{
    "accessibility": "Open access",
    "additionDate": "2024-08-28T09:09:21.326316Z",
    "biotoolsCURIE": "biotools:magma-pipeline",
    "biotoolsID": "magma-pipeline",
    "collectionID": [
        "Mycobacterium tuberculosis"
    ],
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Abhinav Sharma",
            "orcidid": "https://orcid.org/0000-0002-6402-6993"
        },
        {
            "name": "Annelies Van Rie",
            "orcidid": "https://orcid.org/0000-0001-7666-3263"
        },
        {
            "name": "Lennert Verboven",
            "orcidid": "https://orcid.org/0000-0002-5647-5852"
        },
        {
            "name": "Robin Warren",
            "orcidid": "https://orcid.org/0000-0001-5741-7358"
        },
        {
            "name": "Tim Heupink",
            "orcidid": "https://orcid.org/0000-0001-6237-3898"
        },
        {
            "name": "Vincent Rennie",
            "orcidid": "https://orcid.org/0000-0002-1031-2441"
        },
        {
            "name": "Miguel de Diego Fuertes",
            "url": "https://torch-consortium.com/migiel"
        }
    ],
    "description": "The MAGMA pipeline for comprehensive genomic analyses of clinical Mycobacterium tuberculosis samples",
    "documentation": [
        {
            "note": "The documentation website for MAGMA pipeline. The main focus is upon usage and interpretation of outputs.",
            "type": [
                "User manual"
            ],
            "url": "https://torch-consortium.github.io/MAGMA/usage.html"
        }
    ],
    "download": [
        {
            "note": "Reference EXIT-RIF GVCF",
            "type": "Other",
            "url": "https://zenodo.org/record/8054182"
        },
        {
            "note": "The source code for v2.0.0 release",
            "type": "Source code",
            "url": "https://github.com/TORCH-Consortium/MAGMA/releases/tag/v2.0.0",
            "version": "v2.0.0"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/TORCH-Consortium/MAGMA",
    "language": [
        "Groovy",
        "Java",
        "Python"
    ],
    "lastUpdate": "2024-11-24T13:48:57.678468Z",
    "license": "GPL-3.0",
    "link": [
        {
            "note": "MAGMA pipeline discussion forum",
            "type": [
                "Discussion forum"
            ],
            "url": "https://github.com/TORCH-Consortium/MAGMA/discussions"
        },
        {
            "note": "MAGMA pipeline issue tracker",
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/TORCH-Consortium/MAGMA/issues"
        }
    ],
    "maturity": "Mature",
    "name": "MAGMA",
    "owner": "abhi18av",
    "publication": [
        {
            "doi": "10.1371/journal.pcbi.1011648",
            "metadata": {
                "abstract": "Background Whole genome sequencing (WGS) holds great potential for the management and control of tuberculosis. Accurate analysis of samples with low mycobacterial burden, which are characterized by low (<20x) coverage and high (>40%) levels of contamination, is challenging. We created the MAGMA (Maximum Accessible Genome for Mtb Analysis) bioinformatics pipeline for analysis of clinical Mtb samples. Methods and results High accuracy variant calling is achieved by using a long seedlength during read mapping to filter out contaminants, variant quality score recalibration with machine learning to identify genuine genomic variants, and joint variant calling for low Mtb coverage genomes. MAGMA automatically generates a standardized and comprehensive output of drug resistance information and resistance classification based on the WHO catalogue of Mtb mutations. MAGMA automatically generates phylogenetic trees with drug resistance annotations and trees that visualize the presence of clusters. Drug resistance and phylogeny outputs from sequencing data of 79 primary liquid cultures were compared between the MAGMA and MTBseq pipelines. The MTBseq pipeline reported only a proportion of the variants in candidate drug resistance genes that were reported by MAGMA. Notable differences were in structural variants, variants in highly conserved rrs and rrl genes, and variants in candidate resistance genes for bedaquiline, clofazmine, and delamanid. Phylogeny results were similar between pipelines but only MAGMA visualized clusters. Conclusion The MAGMA pipeline could facilitate the integration of WGS into clinical care as it generates clinically relevant data on drug resistance and phylogeny in an automated, standardized, and reproducible manner.",
                "authors": [
                    {
                        "name": "Fuertes M.D.D."
                    },
                    {
                        "name": "Heupink T.H."
                    },
                    {
                        "name": "Rennie V."
                    },
                    {
                        "name": "Sharma A."
                    },
                    {
                        "name": "Van Rie A."
                    },
                    {
                        "name": "Verboven L."
                    },
                    {
                        "name": "Warren R.M."
                    }
                ],
                "citationCount": 5,
                "date": "2023-11-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "The MAGMA pipeline for comprehensive genomic analyses of clinical Mycobacterium tuberculosis samples"
            }
        },
        {
            "doi": "10.1099/mgen.0.000689",
            "metadata": {
                "abstract": "Improved understanding of the genomic variants that allow Mycobacterium tuberculosis (Mtb) to acquire drug resistance, or tol-erance, and increase its virulence are important factors in controlling the current tuberculosis epidemic. Current approaches to Mtb sequencing, however, cannot reveal Mtb’s full genomic diversity due to the strict requirements of low contamination levels, high Mtb sequence coverage and elimination of complex regions. We have developed the XBS (compleX Bacterial Samples) bio-informatics pipeline, which implements joint calling and machine-learning-based variant filtering tools to specifically improve variant detection in the important Mtb samples that do not meet these criteria, such as those from unbiased sputum samples. Using novel simulated datasets, which permit exact accuracy verification, XBS was compared to the UVP and MTBseq pipelines. Accuracy statistics showed that all three pipelines performed equally well for sequence data that resemble those obtained from culture isolates of high depth of coverage and low-level contamination. In the complex genomic regions, however, XBS accurately identified 9.0 % more SNPs and 8.1 % more single nucleotide insertions and deletions than the WHO-endorsed unified analysis variant pipeline. XBS also had superior accuracy for sequence data that resemble those obtained directly from sputum samples, where depth of coverage is typically very low and contamination levels are high. XBS was the only pipeline not affected by low depth of coverage (5–10×), type of contamination and excessive contamination levels (>50 %). Simulation results were confirmed using whole genome sequencing (WGS) data from clinical samples, confirming the superior performance of XBS with a higher sensitivity (98.8%) when analysing culture isolates and identification of 13.9 % more variable sites in WGS data from sputum samples as compared to MTBseq, without evidence for false positive variants when rRNA regions were excluded. The XBS pipeline facilitates sequencing of less-than-perfect Mtb samples. These advances will benefit future clinical applications of Mtb sequencing, especially WGS directly from clinical specimens, thereby avoiding in vitro biases and making many more samples available for drug resistance and other genomic analyses. The additional genetic resolution and increased sample success rate will improve genome-wide association studies and sequence-based transmission studies.",
                "authors": [
                    {
                        "name": "Heupink T.H."
                    },
                    {
                        "name": "Van Rie A."
                    },
                    {
                        "name": "Verboven L."
                    },
                    {
                        "name": "Warren R.M."
                    }
                ],
                "citationCount": 14,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Microbial Genomics",
                "title": "Comprehensive and accurate genetic variant identification from contaminated and low-coverage Mycobacterium tuberculosis whole genome sequencing data"
            },
            "pmcid": "PMC8743552",
            "pmid": "34793294"
        }
    ],
    "relation": [
        {
            "biotoolsID": "XBS",
            "type": "includes"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        }
    ]
}
