{
    "additionDate": "2018-06-11T19:14:01Z",
    "biotoolsCURIE": "biotools:gatekeeper",
    "biotoolsID": "gatekeeper",
    "credit": [
        {
            "email": "mohammedalser@bilkent.edu.tr",
            "name": "Mohammed Alser",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "calkan@cs.bilkent.edu.tr",
            "name": "Can Alkan",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "onur.mutlu@inf.ethz.ch",
            "name": "Onur Mutlu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Fast Alignment Filter for DNA Short Read Mapping.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/BilkentCompGen/GateKeeper"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BilkentCompGen/GateKeeper",
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "GateKeeper",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btx342",
            "metadata": {
                "abstract": "© The Author (2017). Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.comMotivation: High throughput DNA sequencing (HTS) technologies generate an excessive number of small DNA segments -called short reads- that cause significant computational burden. To analyze the entire genome, each of the billions of short reads must be mapped to a reference genome based on the similarity between a read and 'candidate' locations in that reference genome. The similarity measurement, called alignment, formulated as an approximate string matching problem, is the computational bottleneck because: (i) it is implemented using quadratic-time dynamic programming algorithms and (ii) the majority of candidate locations in the reference genome do not align with a given read due to high dissimilarity. Calculating the alignment of such incorrect candidate locations consumes an overwhelming majority of a modern read mapper's execution time. Therefore, it is crucial to develop a fast and effective filter that can detect incorrect candidate locations and eliminate them before invoking computationally costly alignment algorithms.Results: We propose GateKeeper, a new hardware accelerator that functions as a pre-alignment step that quickly filters out most incorrect candidate locations. GateKeeper is the first design to accelerate pre-alignment using Field-Programmable Gate Arrays (FPGAs), which can perform pre-alignment much faster than software. When implemented on a single FPGA chip, GateKeeper maintains high accuracy (on average >96%) while providing, on average, 90-fold and 130-fold speedup over the state-of-the-art software pre-alignment techniques, Adjacency Filter and Shifted Hamming Distance (SHD), respectively. The addition of GateKeeper as a pre-alignment step can reduce the verification time of the mrFAST mapper by a factor of 10.Availability and implementation: https://github.com/BilkentCompGen/GateKeeper.Contact: mohammedalser@bilkent.edu.tr or onur.mutlu@inf.ethz.ch or calkan@cs.bilkent.edu.tr.Supplementary information: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Alser M."
                    },
                    {
                        "name": "Hassan H."
                    },
                    {
                        "name": "Xin H."
                    },
                    {
                        "name": "Ergin O."
                    },
                    {
                        "name": "Mutlu O."
                    },
                    {
                        "name": "Alkan C."
                    }
                ],
                "citationCount": 35,
                "date": "2017-11-01T00:00:00Z",
                "journal": "Bioinformatics (Oxford, England)",
                "title": "GateKeeper: a new hardware architecture for accelerating pre-alignment in DNA short read mapping"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}