{
    "additionDate": "2021-01-18T11:11:08Z",
    "biotoolsCURIE": "biotools:fleximap",
    "biotoolsID": "fleximap",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "i.nobeli@bbk.ac.uk",
            "name": "Irene Nobeli",
            "typeEntity": "Person"
        }
    ],
    "description": "flexiMAP (flexible Modeling of Alternative PolyAdenylation) is a regression-based method for discovering differential alternative polyadenylation events in standard RNA-seq data. It is a beta-regression-based method implemented in R, for discovering differential alternative polyadenylation events in standard RNA-seq data. Importantly, flexiMAP allows the modeling of multiple known covariates that often confound the results of RNA-seq data analysis.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "RNA-seq read count analysis",
                    "uri": "http://edamontology.org/operation_3563"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/kszkop/flexiMAP",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-11T09:46:32Z",
    "license": "MIT",
    "name": "flexiMAP",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA854",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press.MOTIVATION: We present flexible Modeling of Alternative PolyAdenylation (flexiMAP), a new beta-regression-based method implemented in R, for discovering differential alternative polyadenylation events in standard RNA-seq data. RESULTS: We show, using both simulated and real data, that flexiMAP exhibits a good balance between specificity and sensitivity and compares favourably to existing methods, especially at low fold changes. In addition, the tests on simulated data reveal some hitherto unrecognized caveats of existing methods. Importantly, flexiMAP allows modeling of multiple known covariates that often confound the results of RNA-seq data analysis. AVAILABILITY AND IMPLEMENTATION: The flexiMAP R package is available at: https://github.com/kszkop/flexiMAP. Scripts and data to reproduce the analysis in this paper are available at: https://doi.org/10.5281/zenodo.3689788. SUPPLEMENTARY INFORMATION: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Moss D.S."
                    },
                    {
                        "name": "Nobeli I."
                    },
                    {
                        "name": "Szkop K.J."
                    }
                ],
                "date": "2021-06-16T00:00:00Z",
                "journal": "Bioinformatics (Oxford, England)",
                "title": "flexiMAP: a regression-based method for discovering differential alternative polyadenylation events in standard RNA-seq data"
            },
            "pmid": "33051680"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
