{
    "accessibility": "Open access",
    "additionDate": "2021-01-07T14:35:00Z",
    "biotoolsCURIE": "biotools:mlplasmids",
    "biotoolsID": "mlplasmids",
    "collectionID": [
        "Genomics"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "email": "a.c.schurch@umcutrecht.nl",
            "name": "Anita Schürch",
            "orcidid": "https://orcid.org/0000-0003-1894-7545",
            "typeEntity": "Person",
            "typeRole": [
                "Contributor",
                "Maintainer"
            ]
        },
        {
            "email": "a.c.schurch@umcutrecht.nl",
            "name": "Sergio Arredondo-Alonso",
            "orcidid": "https://orcid.org/0000-0002-4445-2442",
            "typeEntity": "Person",
            "typeRole": [
                "Developer",
                "Maintainer"
            ]
        }
    ],
    "description": "mlplasmids consists of binary classifiers to predict contigs either as plasmid-derived or chromosome-derived.\nIt currently classifies short-read contigs as chromosomes and plasmids for Enterococcus faecium, Escherichia coli and Klebsiella pneumoniae.",
    "documentation": [
        {
            "note": "README of the repository",
            "type": [
                "Other"
            ],
            "url": "https://gitlab.com/sirarredondo/mlplasmids/-/blob/master/README.Rmd"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://gitlab.com/sirarredondo/mlplasmids/-/releases/v1.0.0",
            "version": "V1.0.0"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "elixirCommunity": [
        "Microbial Biotechnology"
    ],
    "elixirNode": [
        "Netherlands"
    ],
    "elixirPlatform": [
        "Tools"
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Nucleic acid sequence",
                        "uri": "http://edamontology.org/data_2977"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                },
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Feature table",
                        "uri": "http://edamontology.org/data_1270"
                    }
                }
            ]
        }
    ],
    "homepage": "https://gitlab.com/sirarredondo/mlplasmids",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-09-21T12:35:01.650974Z",
    "license": "GPL-3.0",
    "link": [
        {
            "note": "webserver with GUI of mlplasmids",
            "type": [
                "Other"
            ],
            "url": "https://sarredondo.shinyapps.io/mlplasmids"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://gitlab.com/sirarredondo/mlplasmids/-/issues"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://gitlab.com/sirarredondo/mlplasmids"
        }
    ],
    "maturity": "Emerging",
    "name": "mlplasmids",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "aschuerch",
    "publication": [
        {
            "doi": "10.1099/mgen.0.000224",
            "metadata": {
                "abstract": "Assembly of bacterial short-read whole-genome sequencing data frequently results in hundreds of contigs for which the origin, plasmid or chromosome, is unclear. Complete genomes resolved by long-read sequencing can be used to generate and label short-read contigs. These were used to train several popular machine learning methods to classify the origin of contigs from Enterococcus faecium, Klebsiella pneumoniae and Escherichia coli using pentamer frequencies. We selected support-vector machine (SVM) models as the best classifier for all three bacterial species (F1-score E. faecium=0.92, F1-score K. pneumoniae=0.90, F1-score E. coli=0.76), which outperformed other existing plasmid prediction tools using a benchmarking set of isolates. We demonstrated the scalability of our models by accurately predicting the plasmidome of a large collection of 1644 E. faecium isolates and illustrate its applicability by predicting the location of antibiotic-resistance genes in all three species. The SVM classifiers are publicly available as an R package and graphical-user interface called 'mlplasmids'. We anticipate that this tool may significantly facilitate research on the dissemination of plasmids encoding antibiotic resistance and/or contributing to host adaptation.",
                "authors": [
                    {
                        "name": "Arredondo-Alonso S."
                    },
                    {
                        "name": "Braat J.C."
                    },
                    {
                        "name": "Corander J."
                    },
                    {
                        "name": "Rogers M.R.C."
                    },
                    {
                        "name": "Schurch A.C."
                    },
                    {
                        "name": "Top J."
                    },
                    {
                        "name": "Verschuuren T.D."
                    },
                    {
                        "name": "Willems R.J.L."
                    }
                ],
                "citationCount": 50,
                "date": "2018-11-01T00:00:00Z",
                "journal": "Microbial genomics",
                "title": "mlplasmids: a user-friendly tool to predict plasmid- and chromosome-derived sequences for single species"
            },
            "pmcid": "PMC6321875",
            "pmid": "30383524",
            "type": [
                "Method"
            ],
            "version": "V1.0.0"
        },
        {
            "doi": "10.1128/mBio.03284-19",
            "metadata": {
                "abstract": "© 2020 Arredondo-Alonso et al.Enterococcus faecium is a gut commensal of humans and animals but is also listed on the WHO global priority list of multidrug-resistant pathogens. Many of its antibiotic resistance traits reside on plasmids and have the potential to be disseminated by horizontal gene transfer. Here, we present the first comprehensive population-wide analysis of the pan-plasmidome of a clinically important bacterium, by whole-genome sequence analysis of 1,644 isolates from hospital, commensal, and animal sources of E. faecium. Long-read sequencing on a selection of isolates resulted in the completion of 305 plasmids that exhibited high levels of sequence modularity. We further investigated the entirety of all plasmids of each isolate (plas-midome) using a combination of short-read sequencing and machine-learning classi-fiers. Clustering of the plasmid sequences unraveled different E. faecium populations with a clear association with hospitalized patient isolates, suggesting different optimal configurations of plasmids in the hospital environment. The characterization of these populations allowed us to identify common mechanisms of plasmid stabilization such as toxin-antitoxin systems and genes exclusively present in particular plasmidome populations exemplified by copper resistance, phosphotransferase systems, or bacteriocin genes potentially involved in niche adaptation. Based on the distribution of k-mer distances between isolates, we concluded that plasmidomes rather than chromosomes are most informative for source specificity of E. faecium. IMPORTANCE Enterococcus faecium is one of the most frequent nosocomial pathogens of hospital-acquired infections. E. faecium has gained resistance against most commonly available antibiotics, most notably, against ampicillin, gentamicin, and vancomycin, which renders infections difficult to treat. Many antibiotic resistance traits, in particular, vancomycin resistance, can be encoded in autonomous and extrachromosomal elements called plasmids. These sequences can be disseminated to other isolates by horizontal gene transfer and confer novel mechanisms to source specificity. In our study, we elucidated the total plasmid content, referred to as the plasmidome, of 1,644 E. faecium isolates by using short-and long-read whole-genome technologies with the combination of a machine-learning classifier. This was fundamental to investigate the full collection of plasmid sequences present in our collection (pan-plasmidome) and to observe the potential transfer of plasmid sequences between E. faecium hosts. We observed that E. faecium isolates from hospitalized patients carried a larger number of plasmid sequences compared to that from other sources, and they elucidated different configurations of plasmidome populations in the hospital environment. We assessed the contribution of different genomic components and observed that plasmid sequences have the highest contribution to source specificity. Our study suggests that E. faecium plasmids are regulated by complex ecological constraints rather than physical interaction between hosts.",
                "authors": [
                    {
                        "name": "Arredondo-Alonso S."
                    },
                    {
                        "name": "Braat J.C."
                    },
                    {
                        "name": "Corander J."
                    },
                    {
                        "name": "Kaski S."
                    },
                    {
                        "name": "Marttinen P."
                    },
                    {
                        "name": "McNally A."
                    },
                    {
                        "name": "Pensar J."
                    },
                    {
                        "name": "Pesonen M."
                    },
                    {
                        "name": "Puranen S."
                    },
                    {
                        "name": "Rogers M.R.C."
                    },
                    {
                        "name": "Schurch A.C."
                    },
                    {
                        "name": "Top J."
                    },
                    {
                        "name": "Willems R.J.L."
                    },
                    {
                        "name": "van Schaik W."
                    }
                ],
                "citationCount": 20,
                "date": "2020-01-01T00:00:00Z",
                "journal": "mBio",
                "title": "Plasmids shaped the recent emergence of the major nosocomial pathogen Enterococcus faecium"
            },
            "pmcid": "PMC7018651",
            "pmid": "32047136",
            "type": [
                "Usage"
            ],
            "version": "V1.0.0"
        }
    ],
    "relation": [
        {
            "biotoolsID": "gplas",
            "type": "usedBy"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web service"
    ],
    "topic": [
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ],
    "validated": 1,
    "version": [
        "V1.0.0",
        "V2.0.0",
        "V2.1.0"
    ]
}
