{
    "additionDate": "2016-05-17T10:18:10Z",
    "biotoolsCURIE": "biotools:syntren",
    "biotoolsID": "syntren",
    "collectionID": [
        "BIG N2N",
        "UGent"
    ],
    "credit": [
        {
            "email": "kathleen.marchal@intec.ugent.be",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "ugent.be",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        }
    ],
    "description": "Synthetic transcriptional regulatory networks. A generator of synthetic gene expression data for design and analysis of structure learning algorithms.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bioinformatics.intec.ugent.be/kmarchal/SynTReN/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Gene expression data",
                        "uri": "http://edamontology.org/data_2603"
                    },
                    "format": [
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Simulated gene expression data generation",
                    "uri": "http://edamontology.org/operation_3566"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Pathway or network",
                        "uri": "http://edamontology.org/data_2600"
                    },
                    "format": [
                        {
                            "term": "XML",
                            "uri": "http://edamontology.org/format_2332"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://bioinformatics.intec.ugent.be/kmarchal/SynTReN/index.html",
    "lastUpdate": "2018-12-10T12:58:52Z",
    "name": "SynTReN",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Katrijn.Vannerum@ugent.be",
    "publication": [
        {
            "doi": "10.1186/1471-2105-7-43",
            "metadata": {
                "abstract": "Background: The development of algorithms to infer the structure of gene regulatory networks based on expression data is an important subject in bioinformatics research. Validation of these algorithms requires benchmark data sets for which the underlying network is known. Since experimental data sets of the appropriate size and design are usually not available, there is a clear need to generate well-characterized synthetic data sets that allow thorough testing of learning algorithms in a fast and reproducible manner. Results: In this paper we describe a network generator that creates synthetic transcriptional regulatory networks and produces simulated gene expression data that approximates experimental data. Network topologies are generated by selecting subnetworks from previously described regulatory networks.Interaction kinetics are modeled by equations based on Michaelis- Menten and Hill kinetics. Our results show that the statistical properties of these topologies more closely approximate those of genuine biological networks than do those of different types of random graph models. Several user-definable parameters adjust the complexity of the resulting data set with respect to the structure learning algorithms. Conclusion: This network generation technique offers a valid alternative to existing methods. The topological characteristics of the generated networks more closely resemble the characteristics of real transcriptional networks. Simulation of the network scales well to large networks. The generator models different types of biological interactions and produces biologically plausible synthetic gene expression data. © 2006 Van den Bulcke et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Ma H."
                    },
                    {
                        "name": "Marchal K."
                    },
                    {
                        "name": "Naudts B."
                    },
                    {
                        "name": "Van Leemput K."
                    },
                    {
                        "name": "Van den Bulcke T."
                    },
                    {
                        "name": "Verschoren A."
                    },
                    {
                        "name": "de Moor B."
                    },
                    {
                        "name": "van Remortel P."
                    }
                ],
                "citationCount": 197,
                "date": "2006-01-26T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SynTReN: A generator of synthetic gene expression data for design and analysis of structure learning algorithms"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1,
    "version": [
        "1.2"
    ]
}
