
{
    "credit": [
        {
            "email": "lwang@cs.cityu.edu.hk",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://sites.google.com/site/guofeics/p-binder#TOC-Author"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://sites.google.com/site/guofeics/p-binder"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Protein binding sites",
                "uri": "http://edamontology.org/topic_3534"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/p-binder-predicting-the-binding-sites-on-pair-of-given-proteins.html"
        }
    ],
    "publication": [
        {
            "abstract": "Determination of binding sites between proteins is widely applied in many fields, such as drug design and the structural and functional analysis. The protein-protein binding sites can be formed by two subunits in a complex. Understanding energetics and mechanisms of complexes remains one of the essential problems in binding site prediction. We develop a system, P-Binder, for identifying binding sites based on shape complementarity, side-chain conformations and interacting amino acid information. P-Binder utilizes an enumeration method to generate all possible configurations between two proteins, and uses a side-chain packing program to identify the bound states. The system reports the binding sites with the highest ranked configurations, evaluated through a linear combination of four statistical energy items. The experiments show that our method performs better than other prediction methods. A comparison with some existing approaches shows P-Binder to improve the success rate by at least 12.3%. We test P-Binder on 176 protein-protein complexes in Benchmark v4.0. The overall values of accuracy and coverage are 63.8% and 68.8% for the bound state, and 51.0% and 60.9% for the unbound state. © 2014 Bentham Science Publishers.",
            "authors": [
                "Guo F.",
                "Li S.C.",
                "Fan Y.",
                "Wang L."
            ],
            "cit_count": 1,
            "journal": "Current Protein and Peptide Science",
            "pmid": "25059323",
            "title": "Identifying protein-protein binding sites with a combined energy function",
            "year": "2014-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:p-binder",
        "biotoolsID": "p-binder",
        "description": "Tool for predicting the binding sites on pair of given proteins.",
        "homepage": "https://sites.google.com/site/guofeics/p-binder",
        "name": "P-Binder"
    }
}