{
    "additionDate": "2020-01-14T19:37:29Z",
    "biotoolsCURIE": "biotools:QuantiMus",
    "biotoolsID": "QuantiMus",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "armando.villalta@uci.edu",
            "name": "S. Armando Villalta",
            "typeEntity": "Person"
        }
    ],
    "description": "A Machine Learning-Based Approach for High Precision Analysis of Skeletal Muscle Morphology.\n\nQuantiMus is a machine-learning based program used for histological analysis of skeletal muscle. Developed as a plugin for the image analysis tool flika, QuantiMus is a versatile, fast, and precise to complete histological analysis. QuantiMus is written in Python and is open-source",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://quantimus.github.io",
    "lastUpdate": "2020-12-11T15:04:24Z",
    "name": "QuantiMus",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FPHYS.2019.01416",
            "metadata": {
                "abstract": "© Copyright © 2019 Kastenschmidt, Ellefsen, Mannaa, Giebel, Yahia, Ayer, Pham, Rios, Vetrone, Mozaffar and Villalta.Skeletal muscle injury provokes a regenerative response, characterized by the de novo generation of myofibers that are distinguished by central nucleation and re-expression of developmentally restricted genes. In addition to these characteristics, myofiber cross-sectional area (CSA) is widely used to evaluate muscle hypertrophic and regenerative responses. Here, we introduce QuantiMus, a free software program that uses machine learning algorithms to quantify muscle morphology and molecular features with high precision and quick processing-time. The ability of QuantiMus to define and measure myofibers was compared to manual measurement or other automated software programs. QuantiMus rapidly and accurately defined total myofibers and measured CSA with comparable performance but quantified the CSA of centrally-nucleated fibers (CNFs) with greater precision compared to other software. It additionally quantified the fluorescence intensity of individual myofibers of human and mouse muscle, which was used to assess the distribution of myofiber type, based on the myosin heavy chain isoform that was expressed. Furthermore, analysis of entire quadriceps cross-sections of healthy and mdx mice showed that dystrophic muscle had an increased frequency of Evans blue dye+ injured myofibers. QuantiMus also revealed that the proportion of centrally nucleated, regenerating myofibers that express embryonic myosin heavy chain (eMyHC) or neural cell adhesion molecule (NCAM) were increased in dystrophic mice. Our findings reveal that QuantiMus has several advantages over existing software. The unique self-learning capacity of the machine learning algorithms provides superior accuracy and the ability to rapidly interrogate the complete muscle section. These qualities increase rigor and reproducibility by avoiding methods that rely on the sampling of representative areas of a section. This is of particular importance for the analysis of dystrophic muscle given the “patchy” distribution of muscle pathology. QuantiMus is an open source tool, allowing customization to meet investigator-specific needs and provides novel analytical approaches for quantifying muscle morphology.",
                "authors": [
                    {
                        "name": "Kastenschmidt J.M."
                    },
                    {
                        "name": "Ellefsen K.L."
                    },
                    {
                        "name": "Mannaa A.H."
                    },
                    {
                        "name": "Giebel J.J."
                    },
                    {
                        "name": "Yahia R."
                    },
                    {
                        "name": "Ayer R.E."
                    },
                    {
                        "name": "Pham P."
                    },
                    {
                        "name": "Rios R."
                    },
                    {
                        "name": "Vetrone S.A."
                    },
                    {
                        "name": "Mozaffar T."
                    },
                    {
                        "name": "Villalta S.A."
                    }
                ],
                "citationCount": 6,
                "date": "2019-11-29T00:00:00Z",
                "journal": "Frontiers in Physiology",
                "title": "QuantiMus: A Machine Learning-Based Approach for High Precision Analysis of Skeletal Muscle Morphology"
            },
            "pmcid": "PMC6895564",
            "pmid": "31849692"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}