
{
    "credit": [
        {
            "email": "ppdock@post.tau.ac.il",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://bioinfo3d.cs.tau.ac.il/wk/index.php/Main_Page"
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://bioinfo3d.cs.tau.ac.il/MultiProt/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Multiple structure alignment",
                    "uri": "http://edamontology.org/operation_0504"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Web application"
        ],
        "topic": [
            {
                "term": "Protein structure analysis",
                "uri": "http://edamontology.org/topic_2814"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/multiprot-multiple-protein-structure-alignment.html"
        }
    ],
    "publication": [
        {
            "abstract": "Here, we present MultiProt, a fully automated highly efficient technique to detect multiple structural alignments of protein structures. MultiProt finds the common geometrical cores between input molecules. To date, most methods for multiple alignment start from the pairwise alignment solutions. This may lead to a small overall alignment. In contrast, our method derives multiple alignments from simultaneous superpositions of input molecules. Further, our method does not require that all input molecules participate in the alignment. Actually, it efficiently detects high scoring partial multiple alignments for all possible number of molecules in the input. To demonstrate the power of MultiProt, we provide a number of case studies. First, we demonstrate known multiple alignments of protein structures to illustrate the performance of MultiProt. Next, we present various biological applications. These include: (1) a partial alignment of hinge-bent domains; (2) identification of functional groups of G-proteins; (3) analysis of binding sites; and (4) protein-protein interface alignment. Some applications preserve the sequence order of the residues in the alignment, whereas others are order-independent. It is their residue sequence order-independence that allows application of MultiProt to derive multiple alignments of binding sites and of protein-protein interfaces, making MultiProt an extremely useful structural tool. © 2004 Wiley-Liss, Inc.",
            "authors": [
                "Shatsky M.",
                "Nussinov R.",
                "Wolfson H.J."
            ],
            "cit_count": 320,
            "journal": "Proteins: Structure, Function and Genetics",
            "pmid": "15162494",
            "title": "A method for simultaneous alignment of multiple protein structures",
            "year": "2004-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:multiprot",
        "biotoolsID": "multiprot",
        "description": "Fully automated highly efficient technique which detects the multiple structural alignments of protein structures. It finds the common geometrical cores between the input molecules.",
        "homepage": "http://bioinfo3d.cs.tau.ac.il/MultiProt/",
        "name": "MultiProt"
    }
}