{
    "accessibility": "Open access",
    "additionDate": "2023-09-18T12:05:22.732571Z",
    "biotoolsCURIE": "biotools:mf_pcba",
    "biotoolsID": "mf_pcba",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "db804@cam.ac.uk",
            "name": "David Buterez",
            "orcidid": "https://orcid.org/0000-0001-6558-0833",
            "typeEntity": "Person"
        }
    ],
    "description": "The tool can be used to download, filter, and assemble the MF-PCBA datasets in a format that is easily usable for machine learning.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                }
            ]
        }
    ],
    "homepage": "https://github.com/davidbuterez/mf-pcba",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2023-09-18T12:05:22.735075Z",
    "license": "MIT",
    "name": "MF-PCBA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.2C01569",
            "metadata": {
                "abstract": "High-throughput screening (HTS), as one of the key techniques in drug discovery, is frequently used to identify promising drug candidates in a largely automated and cost-effective way. One of the necessary conditions for successful HTS campaigns is a large and diverse compound library, enabling hundreds of thousands of activity measurements per project. Such collections of data hold great promise for computational and experimental drug discovery efforts, especially when leveraged in combination with modern deep learning techniques, and can potentially lead to improved drug activity predictions and cheaper and more effective experimental design. However, existing collections of machine-learning-ready public datasets do not exploit the multiple data modalities present in real-world HTS projects. Thus, the largest fraction of experimental measurements, corresponding to hundreds of thousands of “noisy” activity values from primary screening, are effectively ignored in the majority of machine learning models of HTS data. To address these limitations, we introduce Multifidelity PubChem BioAssay (MF-PCBA), a curated collection of 60 datasets that includes two data modalities for each dataset, corresponding to primary and confirmatory screening, an aspect that we call multifidelity. Multifidelity data accurately reflect real-world HTS conventions and present a new, challenging task for machine learning: the integration of low- and high-fidelity measurements through molecular representation learning, taking into account the orders-of-magnitude difference in size between the primary and confirmatory screens. Here we detail the steps taken to assemble MF-PCBA in terms of data acquisition from PubChem and the filtering steps required to curate the raw data. We also provide an evaluation of a recent deep-learning-based method for multifidelity integration across the introduced datasets, demonstrating the benefit of leveraging all HTS modalities, and a discussion in terms of the roughness of the molecular activity landscape. In total, MF-PCBA contains over 16.6 million unique molecule-protein interactions. The datasets can be easily assembled by using the source code available at https://github.com/davidbuterez/mf-pcba.",
                "authors": [
                    {
                        "name": "Buterez D."
                    },
                    {
                        "name": "Janet J.P."
                    },
                    {
                        "name": "Kiddle S.J."
                    },
                    {
                        "name": "Lio P."
                    }
                ],
                "citationCount": 1,
                "date": "2023-05-08T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "MF-PCBA: Multifidelity High-Throughput Screening Benchmarks for Drug Discovery and Machine Learning"
            },
            "pmcid": "PMC10170507",
            "pmid": "37058588",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}
