{
    "additionDate": "2017-01-17T15:07:46Z",
    "biotoolsCURIE": "biotools:beast",
    "biotoolsID": "beast",
    "collectionID": [
        "EBI Training Tools"
    ],
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://groups.google.com/group/beast-users"
        }
    ],
    "description": "The Bayesian Evolutionary Analysis Sampling Trees is a cross-platform program for Bayesian analysis of molecular sequences using MCMC (Markov chain Monte Carlo). It is entirely orientated towards rooted, time-measured phylogenies inferred using strict or relaxed molecular clock models. It can be used as a method of reconstructing phylogenies but is also a framework for testing evolutionary hypotheses without conditioning on a single tree topology.",
    "documentation": [
        {
            "type": "General",
            "url": "http://beast.community/first_tutorial"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                },
                {
                    "term": "Phylogenetic tree generation (from molecular sequences)",
                    "uri": "http://edamontology.org/operation_0540"
                },
                {
                    "term": "Phylogenetic tree generation (maximum likelihood and Bayesian methods)",
                    "uri": "http://edamontology.org/operation_0547"
                }
            ]
        }
    ],
    "homepage": "http://beast.bio.ed.ac.uk/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:55Z",
    "name": "BEAST",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ebi_training_import",
    "publication": [
        {
            "doi": "10.1093/molbev/mss075",
            "metadata": {
                "abstract": "Computational evolutionary biology, statistical phylogenetics and coalescent-based population genetics are becoming increasingly central to the analysis and understanding of molecular sequence data. We present the Bayesian Evolutionary Analysis by Sampling Trees (BEAST) software package version 1.7, which implements a family of Markov chain Monte Carlo (MCMC) algorithms for Bayesian phylogenetic inference, divergence time dating, coalescent analysis, phylogeography and related molecular evolutionary analyses. This package includes an enhanced graphical user interface program called Bayesian Evolutionary Analysis Utility (BEAUti) that enables access to advanced models for molecular sequence and phenotypic trait evolution that were previously available to developers only. The package also provides new tools for visualizing and summarizing multispecies coalescent and phylogeographic analyses. BEAUti and BEAST 1.7 are open source under the GNU lesser general public license and available at http://beast-mcmc.googlecode.com and http://beast.bio.ed.ac.uk. © The Author 2012. Published by Oxford University Press on behalf of the Society for Molecular Biology and Evolution. All rights reserved.",
                "authors": [
                    {
                        "name": "Drummond A.J."
                    },
                    {
                        "name": "Suchard M.A."
                    },
                    {
                        "name": "Xie D."
                    },
                    {
                        "name": "Rambaut A."
                    }
                ],
                "citationCount": 4985,
                "date": "2012-08-01T00:00:00Z",
                "journal": "Molecular Biology and Evolution",
                "title": "Bayesian phylogenetics with BEAUti and the BEAST 1.7"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}