{
    "additionDate": "2017-01-17T15:07:46Z",
    "biotoolsCURIE": "biotools:beast",
    "biotoolsID": "beast",
    "collectionID": [
        "EBI Training Tools"
    ],
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://groups.google.com/group/beast-users"
        }
    ],
    "description": "The Bayesian Evolutionary Analysis Sampling Trees is a cross-platform program for Bayesian analysis of molecular sequences using MCMC (Markov chain Monte Carlo). It is entirely orientated towards rooted, time-measured phylogenies inferred using strict or relaxed molecular clock models. It can be used as a method of reconstructing phylogenies but is also a framework for testing evolutionary hypotheses without conditioning on a single tree topology.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://beast.community/first_tutorial"
        }
    ],
    "editPermission": {
        "authors": [
            "sergitobara"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                },
                {
                    "term": "Phylogenetic tree generation (from molecular sequences)",
                    "uri": "http://edamontology.org/operation_0540"
                },
                {
                    "term": "Phylogenetic tree generation (maximum likelihood and Bayesian methods)",
                    "uri": "http://edamontology.org/operation_0547"
                }
            ]
        }
    ],
    "homepage": "http://beast.bio.ed.ac.uk/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2022-06-21T13:21:16.387963Z",
    "name": "BEAST",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ebi_training_import",
    "publication": [
        {
            "doi": "10.1093/molbev/mss075",
            "metadata": {
                "abstract": "Computational evolutionary biology, statistical phylogenetics and coalescent-based population genetics are becoming increasingly central to the analysis and understanding of molecular sequence data. We present the Bayesian Evolutionary Analysis by Sampling Trees (BEAST) software package version 1.7, which implements a family of Markov chain Monte Carlo (MCMC) algorithms for Bayesian phylogenetic inference, divergence time dating, coalescent analysis, phylogeography and related molecular evolutionary analyses. This package includes an enhanced graphical user interface program called Bayesian Evolutionary Analysis Utility (BEAUti) that enables access to advanced models for molecular sequence and phenotypic trait evolution that were previously available to developers only. The package also provides new tools for visualizing and summarizing multispecies coalescent and phylogeographic analyses. BEAUti and BEAST 1.7 are open source under the GNU lesser general public license and available at http://beast-mcmc.googlecode.com and http://beast.bio.ed.ac.uk. © The Author 2012. Published by Oxford University Press on behalf of the Society for Molecular Biology and Evolution. All rights reserved.",
                "authors": [
                    {
                        "name": "Drummond A.J."
                    },
                    {
                        "name": "Rambaut A."
                    },
                    {
                        "name": "Suchard M.A."
                    },
                    {
                        "name": "Xie D."
                    }
                ],
                "citationCount": 7434,
                "date": "2012-08-01T00:00:00Z",
                "journal": "Molecular Biology and Evolution",
                "title": "Bayesian phylogenetics with BEAUti and the BEAST 1.7"
            }
        },
        {
            "doi": "10.1186/1471-2148-7-214",
            "metadata": {
                "abstract": "Background. The evolutionary analysis of molecular sequence variation is a statistical enterprise. This is reflected in the increased use of probabilistic models for phylogenetic inference, multiple sequence alignment, and molecular population genetics. Here we present BEAST: a fast, flexible software architecture for Bayesian analysis of molecular sequences related by an evolutionary tree. A large number of popular stochastic models of sequence evolution are provided and tree-based models suitable for both within- and between-species sequence data are implemented. Results. BEAST version 1.4.6 consists of 81000 lines of Java source code, 779 classes and 81 packages. It provides models for DNA and protein sequence evolution, highly parametric coalescent analysis, relaxed clock phylogenetics, non-contemporaneous sequence data, statistical alignment and a wide range of options for prior distributions. BEAST source code is object-oriented, modular in design and freely available at http://beast-mcmc.googlecode.com/ under the GNU LGPL license. Conclusion. BEAST is a powerful and flexible evolutionary analysis package for molecular sequence variation. It also provides a resource for the further development of new models and statistical methods of evolutionary analysis. © 2007 Drummond and Rambaut; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Drummond A.J."
                    },
                    {
                        "name": "Rambaut A."
                    }
                ],
                "citationCount": 9741,
                "date": "2007-12-01T00:00:00Z",
                "journal": "BMC Evolutionary Biology",
                "title": "BEAST: Bayesian evolutionary analysis by sampling trees"
            },
            "pmcid": "PMC2247476",
            "pmid": "17996036"
        },
        {
            "doi": "10.1093/ve/vey016",
            "pmcid": "PMC6007674",
            "pmid": "29942656"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}
