{
    "additionDate": "2017-08-03T19:04:05Z",
    "biotoolsCURIE": "biotools:vect",
    "biotoolsID": "vect",
    "credit": [
        {
            "email": "vect@www.complex.iastate.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.complex.iastate.edu/"
        }
    ],
    "description": "Visual extraction conversion program that provides biomedical researches with minimal computer programming background a way to generate data extraction and conversion programs. It provides a convenient graphical user interface that allows using common point and click methods to extract and arrange data in the way that is useful to their purposes and then provides the computer program to generate such results on other documents with the same formatting.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://complexcomputation.org/download/Vect/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Service composition",
                    "uri": "http://edamontology.org/operation_3762"
                }
            ]
        }
    ],
    "homepage": "http://www.complex.iastate.edu/download/Vect/",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/vect-1-01-visual-extraction-conversion-tool.html"
        }
    ],
    "name": "Vect",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Modern high-throughput biological research produces enormous amount of data that must be processed by computers, but many biologists dealing with these data are not professional programmers. Despite increased awareness of interdisciplinary training in bioinformatics, many biologists still find it difficult to create their own computational solutions. VECT, the Visual Extraction and Conversion Tool, has been developed to assist nonprogrammers to create simple bioinformatics without having to master a programming language. VECT provides a unified graphical user interface for data extraction, data conversion, output composition, and Perl code generation. Programming using VECT is achieved by visually performing the desired data extraction, conversion, and output composition tasks using some sample user data. These tasks are then compiled by VECT into an executable Perl program, which can be saved for later use and can carry out the same computation independently of VECT. VECT is released under the GNU General Public License and is freely available for all major computing platforms including Macintosh® OS X, Linux, and Microsoft® Windows® at www.complex.iastate.edu.",
                "authors": [
                    {
                        "name": "Chou H.-H."
                    }
                ],
                "date": "2005-01-01T00:00:00Z",
                "journal": "BioTechniques",
                "title": "VECT: An automatic visual Perl programming tool for nonprogrammers"
            },
            "pmid": "15884679"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        },
        {
            "term": "Omics",
            "uri": "http://edamontology.org/topic_3391"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        }
    ],
    "validated": 1
}
