
{
    "credit": [
        {
            "email": "rsalaris@cs.sfu.ca",
            "name": "taveRNA team",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "RNA secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0278"
                },
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                },
                {
                    "term": "RNA secondary structure alignment",
                    "uri": "http://edamontology.org/operation_0502"
                },
                {
                    "term": "RNA secondary structure analysis",
                    "uri": "http://edamontology.org/operation_2439"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++",
            "C"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Functional, regulatory and non-coding RNA",
                "uri": "http://edamontology.org/topic_0659"
            },
            {
                "term": "Gene transcripts",
                "uri": "http://edamontology.org/topic_3512"
            },
            {
                "term": "RNA",
                "uri": "http://edamontology.org/topic_0099"
            },
            {
                "term": "Structure prediction",
                "uri": "http://edamontology.org/topic_0082"
            },
            {
                "term": "Nucleic acid structure analysis",
                "uri": "http://edamontology.org/topic_0097"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Recent studies demonstrating the existence of special noncoding \"antisense\" RNAs used in post transcriptional gene regulation have received considerable attention. These RNAs are synthesized naturally to control gene expression in C. elegans, Drosophila, and other organisms; they are known to regulate plasmid copy numbers in E. coli as well. Small RNAs have also been artificially constructed to knock out genes of interest in humans and other organisms for the purpose of finding out more about their functions. Although there are a number of algorithms for predicting the secondary structure of a single RNA molecule, no such algorithm exists for reliably predicting the joint secondary structure of two interacting RNA molecules or measuring the stability of such a joint structure. In this paper, we describe the RNA-RNA interaction prediction (RIP) problem between an antisense RNA and its target mRNA and develop efficient algorithms to solve it. Our algorithms minimize the joint free energy between the two RNA molecules under a number of energy models with growing complexity. Because the computational resources needed by our most accurate approach is prohibitive for long RNA molecules, we also describe how to speed up our techniques through a number of heuristic approaches while experimentally maintaining the original accuracy. Equipped with this fast approach, we apply our method to discover targets for any given antisense RNA in the associated genome sequence. © Mary Ann Liebert, Inc.",
            "authors": [
                "Alkan C.",
                "Karakoc E.",
                "Nadeau J.H.",
                "Sahinalp S.C.",
                "Zhang K."
            ],
            "cit_count": 84,
            "journal": "Journal of Computational Biology",
            "pmid": "16597239",
            "title": "RNA-RNA interaction prediction and antisense RNA target search",
            "year": "2006-03-01"
        },
        {
            "abstract": "We present taveRNA, a web server package that hosts three RNA web services: alteRNA, inteRNA and pRuNA. alteRNA is a new alternative for RNA secondary structure prediction. It is based on a dynamic programming solution that minimizes the sum of energy density and free energy of an RNA structure. inteRNA is the first RNA-RNA interaction structure prediction web service. It also employs a dynamic programming algorithm to minimize the free energy of the resulting joint structure of the two interacting RNAs. Lastly, pRuNA is an efficient database pruning service; which given a query RNA, eliminates a significant portion of an ncRNA database and returns only a few ncRNAs as potential regulators. taveRNA is available at http://compbio.cs.sfu.ca/taverna. © 2007 The Author(s).",
            "authors": [
                "Aksay C.",
                "Salari R.",
                "Karakoc E.",
                "Alkan C.",
                "Sahinalp S.C."
            ],
            "cit_count": 11,
            "journal": "Nucleic Acids Research",
            "pmid": "17488837",
            "title": "TaveRNA: A web suite for RNA algorithms and applications",
            "year": "2007-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:taverna_compbio",
        "biotoolsID": "taverna_compbio",
        "description": "taveRNA hosts three RNA web services: alteRNA, inteRNA and pRuNA. alteRNA is an alternative to many RNA folding methods. inteRNA predicts the joint secondary structure of two RNA sequences. pRuNA is an database pruning method which given a query RNA returns only a few ncRNAs as potential regulators.",
        "homepage": "http://compbio.cs.sfu.ca/taverna/",
        "name": "taveRNA"
    }
}