{
    "additionDate": "2017-08-20T15:20:21Z",
    "biotoolsCURIE": "biotools:cgqtl",
    "biotoolsID": "cgqtl",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "email": "micha@agri.huji.ac.il",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Database for candidate genes for QTL for milk production traits in cattle",
    "editPermission": {
        "authors": [
            "animalandcropgenomics"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "http://cowry.agri.huji.ac.il/QTLMAP/qtlmap.htm",
    "lastUpdate": "2020-01-19T17:47:47Z",
    "license": "Not licensed",
    "name": "cgQTL",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1186/1471-2164-8-183",
            "metadata": {
                "abstract": "Background: Many studies have found segregating quantitative trait loci (QTL) for milk production traits in different dairy cattle populations. However, even for relatively large effects with a saturated marker map the confidence interval for QTL location by linkage analysis spans tens of map units, or hundreds of genes. Combining mapping and arraying has been suggested as an approach to identify candidate genes. Thus, gene expression analysis in the mammary gland of genes positioned in the confidence interval of the QTL can bridge the gap between fine mapping and quantitative trait nucleotide (QTN) determination. Results: We hybridized Affymetrix microarray (MG-U74v2), containing 12,488 murine probes, with RNA derived from mammary gland of virgin, pregnant, lactating and involuting C57BL/6J mice in a total of nine biological replicates. We combined microarray data from two additional studies that used the same design in mice with a total of 75 biological replicates. The same filtering and normalization was applied to each microarray data using GeneSpring software. Analysis of variance identified 249 differentially expressed probe sets common to the three experiments along the four developmental stages of puberty, pregnancy, lactation and involution. 212 genes were assigned to their bovine map positions through comparative mapping, and thus form a list of candidate genes for previously identified QTLs for milk production traits. A total of 82 of the genes showed mammary gland-specific expression with at least 3-fold expression over the median representing all tissues tested in GeneAtlas. Conclusion: This work presents a web tool for candidate genes for QTL (cgQTL) that allows navigation between the map of bovine milk production QTL, potential candidate genes and their level of expression in mammary gland arrays and in GeneAtlas. Three out of four confirmed genes that affect QTL in livestock (ABCG2, DGAT1, GDF8, IGF2) were over expressed in the target organ. Thus, cgQTL can be used to determine priority of candidate genes for QTN analysis based on differential expression in the target organ. © 2007 Ron et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Gregg J.P."
                    },
                    {
                        "name": "Israeli G."
                    },
                    {
                        "name": "Medrano J.F."
                    },
                    {
                        "name": "Ron M."
                    },
                    {
                        "name": "Seroussi E."
                    },
                    {
                        "name": "Shani M."
                    },
                    {
                        "name": "Weller J.I."
                    }
                ],
                "citationCount": 36,
                "date": "2007-06-20T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Combining mouse mammary gland gene expression and comparative mapping for the identification of candidate genes for QTL of milk production traits in cattle"
            },
            "pmcid": "PMC1906769",
            "pmid": "17584498",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ],
    "validated": 1
}
