{
    "additionDate": "2020-01-14T19:55:30Z",
    "biotoolsCURIE": "biotools:CS2Structure",
    "biotoolsID": "CS2Structure",
    "confidence_flag": "tool",
    "description": "C2Structure: Extracting Structural Information Directly From NMR Chemical Shifts. Conditional Prediction of Ribonucleic Acid Secondary Structure Using Chemical Shifts.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "RNA secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0278"
                },
                {
                    "term": "RNA structure prediction",
                    "uri": "http://edamontology.org/operation_2441"
                }
            ]
        }
    ],
    "homepage": "https://github.com/atfrank/CS2Structure",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-14T18:52:27Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/atfrank/CS2Structure/issues"
        }
    ],
    "name": "CS2Structure",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/ACS.JPCB.9B09814",
            "metadata": {
                "abstract": "Copyright © 2019 American Chemical Society.Inspired by methods that utilize chemical-mapping data to guide secondary structure prediction, we sought to develop a framework for using assigned chemical shift data to guide ribonucleic acid (RNA) secondary structure prediction. We first used machine learning to develop classifiers that predict the base-pairing status of individual residues in an RNA based on their assigned chemical shifts. Then, we used these base-pairing status predictions as restraints to guide RNA folding algorithms. Our results showed that we could recover the correct secondary fold of most of the 108 RNAs in our data set with remarkable accuracy. Finally, we tested whether we could use the base-pairing status predictions that we obtained from assigned chemical shift data to conditionally predict the secondary structure of RNA. To achieve this, we attempted to model two distinct conformational states of the microRNA-20b and the fluoride riboswitch using assigned chemical shifts that were available for both conformational states of each of these test RNAs. For both test cases, we found that by using the base-pairing status predictions that we obtained from assigned chemical shift data as folding restraints, we could generate structures that closely resembled the known structure of the two distinct states. A command-line tool for chemical shifts to base-pairing status predictions in RNA has been incorporated into our CS2Structure Git repository and can be accessed via https://github.com/atfrank/CS2Structure.",
                "authors": [
                    {
                        "name": "Frank A.T."
                    },
                    {
                        "name": "Zhang K."
                    }
                ],
                "citationCount": 1,
                "date": "2020-01-23T00:00:00Z",
                "journal": "Journal of Physical Chemistry B",
                "title": "Conditional Prediction of Ribonucleic Acid Secondary Structure Using Chemical Shifts"
            },
            "pmid": "31829591"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}
