{
    "additionDate": "2021-01-18T11:24:15Z",
    "biotoolsCURIE": "biotools:scope-cheminformatics",
    "biotoolsID": "scope-cheminformatics",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "ebaker@ncsu.edu",
            "typeEntity": "Person"
        },
        {
            "email": "dmreif@ncsu.edu",
            "typeEntity": "Person"
        }
    ],
    "description": "a cheminformatics toolbox for investigating lipidomic changes in complex systems.\n\n.\n\nTo run any of the r scripts provided, clone the repository and open the SCOPE_Lipid_Analysis.Rproj file in Rstudio. Run the scripts within the project, so that they can find the relevant paths on your machine. Example data files for dual Case vs. Control comparison are included for building biological-structure relationships.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BakerLabNCSU/SCOPE",
    "lastUpdate": "2021-02-13T15:16:11Z",
    "name": "SCOPE",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1039/D0AN01638A",
            "metadata": {
                "abstract": "© 2020 The Royal Society of Chemistry.Since its inception, the main goal of the lipidomics field has been to characterize lipid species and their respective biological roles. However, difficulties in both full speciation and biological interpretation have rendered these objectives extremely challenging and as a result, limited our understanding of lipid mechanisms and dysregulation. While mass spectrometry-based advancements have significantly increased the ability to identify lipid species, less progress has been made surrounding biological interpretations. We have therefore developed a Structural-based Connectivity and Omic Phenotype Evaluations (SCOPE) cheminformatics toolbox to aid in these evaluations. SCOPE enables the assessment and visualization of two main lipidomic associations: structure/biological connections and metadata linkages either separately or in tandem. To assess structure and biological relationships, SCOPE utilizes key lipid structural moieties such as head group and fatty acyl composition and links them to their respective biological relationships through hierarchical clustering and grouped heatmaps. Metadata arising from phenotypic and environmental factors such as age and diet is then correlated with the lipid structures and/or biological relationships, utilizing Toxicological Prioritization Index (ToxPi) software. Here, SCOPE is demonstrated for various applications from environmental studies to clinical assessments to showcase new biological connections not previously observed with other techniques.",
                "authors": [
                    {
                        "name": "Odenkirk M.T."
                    },
                    {
                        "name": "Zin P.P.K."
                    },
                    {
                        "name": "Ash J.R."
                    },
                    {
                        "name": "Reif D.M."
                    },
                    {
                        "name": "Fourches D."
                    },
                    {
                        "name": "Baker E.S."
                    }
                ],
                "citationCount": 3,
                "date": "2020-11-21T00:00:00Z",
                "journal": "Analyst",
                "title": "Structural-based connectivity and omic phenotype evaluations (SCOPE): A cheminformatics toolbox for investigating lipidomic changes in complex systems"
            },
            "pmcid": "PMC7695036",
            "pmid": "33094747"
        }
    ],
    "topic": [
        {
            "term": "Lipids",
            "uri": "http://edamontology.org/topic_0153"
        },
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Toxicology",
            "uri": "http://edamontology.org/topic_2840"
        }
    ]
}