{
    "additionDate": "2022-03-28T09:20:26.908661Z",
    "biotoolsCURIE": "biotools:argeos",
    "biotoolsID": "argeos",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "chistyakov@belozersky.msu.ru",
            "name": "Dmitry V. Chistyakov",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "ARGEOS is a bioinformatic tool for detailed systematics search in GEO and ArrayExpress. ARGEOS will allow you to carry out a systematic search for transcriptomes, collecting all the unique datasets from the most popular databases. With the web tool, you can conveniently select publicly available datasets for data reanalysis! All you need is to compose a query that will be searched. ARGEOS will let you carry out a systematic search for transcriptomes, methylation data, CHIP-seq experiments, and many others. Handy output format minimizes the need for additional information.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://www.ar-geos.org",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-03-28T09:20:26.911254Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/gleb-gavrish/ARGEOS/issues"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/gleb-gavrish/ARGEOS"
        }
    ],
    "name": "ARGEOS",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3390/BIOLOGY10101026",
            "metadata": {
                "abstract": "© 2021 by the authors. Licensee MDPI, Basel, Switzerland.Conduct a reanalysis of transcriptome data for studying intracellular signaling or solving other experimental problems is becoming increasingly popular. Gene expression data are archived as microarray or RNA-seq datasets mainly in two public databases: Gene Expression Omnibus (GEO) and ArrayExpress (AE). These databases were not initially intended to systematically search datasets, making it challenging to conduct a secondary study. Therefore, we have created the ARGEOS service, which has the following advantages that facilitate the search: (1) Users can simultaneously send several requests that are supposed to be used for systematic searches, and it is possible to correct the requests; (2) advanced analysis of information about the dataset is available. The service collects detailed protocols, information on the number of datasets, analyzes the availability of raw data, and provides other reference information. All this contributes to both rapid data analysis with the search for the most relevant datasets and to the systematic search with detailed analysis of the information of the datasets. The efficiency of the service is shown in the example of analyzing transcriptome data of activated (polarized) cells. We have performed a systematic search of studies of cell polarization (when cells are exposed to different immune stimuli). The web interface for ARGEOS is user-friendly and straightforward. It can be used by a person who is not familiar with database searching.",
                "authors": [
                    {
                        "name": "Chistyakov D.V."
                    },
                    {
                        "name": "Gavrish G.E."
                    },
                    {
                        "name": "Sergeeva M.G."
                    }
                ],
                "citationCount": 2,
                "date": "2021-10-01T00:00:00Z",
                "journal": "Biology",
                "title": "ARGEOS: A new bioinformatic tool for detailed systematics search in GEO and arrayexpress"
            },
            "pmcid": "PMC8533512",
            "pmid": "34681124",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Bioinformatics portal"
    ],
    "topic": [
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
