{
    "additionDate": "2017-01-17T15:01:06Z",
    "biotoolsCURIE": "biotools:smap",
    "biotoolsID": "smap",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "robin.andersson@lcb.uu.se",
            "name": "Robin Andersson",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Functions and classes for DNA copy number profiling of array-CGH data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/SMAP.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/SMAP_1.38.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/SMAP.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:54Z",
    "license": "GPL-2.0",
    "name": "SMAP",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btn003",
            "metadata": {
                "abstract": "Motivation: Copy number profiling methods aim at assigning DNA copy numbers to chromosomal regions using measurements from microarray-based comparative genomic hybridizations. Among the proposed methods to this end, Hidden Markov Model (HMM)-based approaches seem promising since DNA copy number transitions are naturally captured in the model. Current discrete-index HMM-based approaches do not, however, take into account heterogeneous information regarding the genomic overlap between clones. Moreover, the majority of existing methods are restricted to chromosome-wise analysis. Results: We introduce a novel Segmental Maximum A Posteriori approach, SMAP, for DNA copy number profiling. Our method is based on discrete-index Hidden Markov Modeling and incorporates genomic distance and overlap between clones. We exploit a priori information through user-controllable parameterization that enables the identification of copy number deviations of various lengths and amplitudes. The model parameters may be inferred at a genome-wide scale to avoid overfitting of model parameters often resulting from chromosome-wise model inference. We report superior performances of SMAP on synthetic data when compared with two recent methods. When applied on our new experimental data, SMAP readily recognizes already known genetic aberrations including both large-scale regions with aberrant DNA copy number and changes affecting only single features on the array. We highlight the differences between the prediction of SMAP and the compared methods and show that SMAP accurately determines copy number changes and benefits from overlap consideration. © 2008 The Author(s).",
                "authors": [
                    {
                        "name": "Andersson R."
                    },
                    {
                        "name": "Bruder C.E.G."
                    },
                    {
                        "name": "Piotrowski A."
                    },
                    {
                        "name": "Menzel U."
                    },
                    {
                        "name": "Nord H."
                    },
                    {
                        "name": "Sandgren J."
                    },
                    {
                        "name": "Hvidsten T.R."
                    },
                    {
                        "name": "de Stahl T.D."
                    },
                    {
                        "name": "Dumanski J.P."
                    },
                    {
                        "name": "Komorowski J."
                    }
                ],
                "citationCount": 26,
                "date": "2008-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "A segmental maximum a posteriori approach to genome-wide copy number profiling"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "DNA structural variation",
            "uri": "http://edamontology.org/topic_3175"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ],
    "validated": 1,
    "version": [
        "1.38.0"
    ]
}