{
    "additionDate": "2021-01-18T07:00:24Z",
    "biotoolsCURIE": "biotools:be-ff",
    "biotoolsID": "be-ff",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "rabinowitz.roy@gmail.com",
            "name": "Rabinowitz Roy",
            "typeEntity": "Person"
        }
    ],
    "description": "BE-FF (Base Editors Functional Finder) is a pythonic tool that identifies suitable base editors to repair a given single nucleotide variation (SNV). The web tool does not require any registration, installation or additional plugins. By inserting the reference and variation nucleotides, BE-FF attempts to find base editors that provide precise correction.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Reverse complement",
                    "uri": "http://edamontology.org/operation_0363"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "http://danioffenlab.pythonanywhere.com/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-31T17:05:01Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/RoyRabinowitz/BE-FF"
        }
    ],
    "name": "BE-FF",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1101/2020.01.06.890244"
        },
        {
            "doi": "10.1093/nar/gkaa215",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.Base editing is a genome-editing approach that employs the CRISPR/Cas system to precisely install point mutations within the genome. A deaminase enzyme is fused to a deactivated Cas and enables transition conversions. The diversified repertoire of base editors provides a wide range of base editing possibilities. However, existing base editors cannot induce transversion substitutions and activate only within a specified region relative to the binding site, thus, they cannot precisely correct every point mutation. Here, we present BE-FF (Base Editors Functional Finder), a novel computational tool that identifies suitable base editors to correct the translated sequence erred by a point mutation. When a precise correction is impossible, BE-FF aims to mutate bystander nucleotides in order to induce synonymous corrections that will correct the coding sequence. To measure BE-FF practicality, we analysed a database of human pathogenic point mutations. Out of the transition mutations, 60.9% coding sequences could be corrected. Notably, 19.4% of the feasible corrections were not achieved by precise corrections but only by synonymous corrections. Moreover, 298 cases of transversion-derived pathogenic mutations were detected to be potentially repairable by base editing via synonymous corrections, although base editing is considered impractical for such mutations.",
                "authors": [
                    {
                        "name": "Abadi S."
                    },
                    {
                        "name": "Almog S."
                    },
                    {
                        "name": "Offen D."
                    },
                    {
                        "name": "Rabinowitz R."
                    }
                ],
                "citationCount": 4,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Prediction of synonymous corrections by the BE-FF computational tool expands the targeting scope of base editing"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Biochemistry",
            "uri": "http://edamontology.org/topic_3292"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genetic engineering",
            "uri": "http://edamontology.org/topic_3912"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        }
    ]
}
