{
    "additionDate": "2019-11-14T20:05:07Z",
    "biotoolsCURIE": "biotools:PCSR",
    "biotoolsID": "PCSR",
    "confidence_flag": "low",
    "description": "> LOW CONFIDENCE! | > HOMEPAGE MISSING! | > CORRECT NAME OF TOOL COULD ALSO BE 'PCSR people', 'XDR-TB' | Palliative care and symptom relief for people affected by multidrug-resistant tuberculosis | The World Health Organization (WHO) defines palliative care as the prevention and relief of the physical, psychological, social and spiritual suffering of adults and children with life-threatening illnesses and psycho-social support for their families. Palliative care and symptom relief (PCSR) also addresses suffering in nonlife-threatening situations such as after cure. PCSR should never be considered a substitute for tuberculosis (TB) prevention and treatment, but should be accessible by everyone in need. PCSR can reduce suffering and improve quality of life of patients with end-stage chronic illnesses while reducing costs for health care systems and providing financial risk protection for patients' families",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31533877",
    "lastUpdate": "2019-11-14T20:05:07Z",
    "name": "PCSR",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.5588/IJTLD.18.0428",
            "metadata": {
                "abstract": "© 2019 The Union.The World Health Organization (WHO) defines palliative care as the prevention and relief of the physical, psychological, social and spiritual suffering of adults and children with life-threatening illnesses and psycho-social support for their families. Palliative care and symptom relief (PCSR) also addresses suffering in nonlife-threatening situations such as after cure. PCSR should never be considered a substitute for tuberculosis (TB) prevention and treatment, but should be accessible by everyone in need. PCSR can reduce suffering and improve quality of life of patients with end-stage chronic illnesses while reducing costs for health care systems and providing financial risk protection for patients' families. It also may help enable patients to adhere to long and noxious treatments and thereby reduce mortality and help protect public health. Basic PCSR can be taught easily to TB specialists as well as primary care clinicians and delivered in hospitals, clinics or patients' homes combined with infection control. For these reasons, integration of PCSR into multidrug-resistant (MDR) and extensively drug-resistant TB (XDR-TB) treatment programs is medically and morally imperative. We propose an essential package of PCSR for people with M/XDR-TB that includes a set of safe, effective and inexpensive medicines and equipment, social supports for patients and caregivers living in extreme poverty, and necessary human resources. The package aligns with WHO guidance on programmatic management of drugresistant (DR) TB and should be universally accessible by people affected by M/XDR-TB. We also describe the ethical practice of PCSR for people with M/XDR-TB and identify needed areas of research in PCSR for people with M/XDR-TB.",
                "authors": [
                    {
                        "name": "Krakauer E.L."
                    },
                    {
                        "name": "Dheda K."
                    },
                    {
                        "name": "Kalsdorf B."
                    },
                    {
                        "name": "Kuksa L."
                    },
                    {
                        "name": "Nadkarni A."
                    },
                    {
                        "name": "Nhung N.V."
                    },
                    {
                        "name": "Selwyn P."
                    },
                    {
                        "name": "Shin S."
                    },
                    {
                        "name": "Skrahina A."
                    },
                    {
                        "name": "Jaramillo E."
                    }
                ],
                "date": "2019-08-01T00:00:00Z",
                "journal": "International Journal of Tuberculosis and Lung Disease",
                "title": "Palliative care and symptom relief for people affected by multidrug-resistant tuberculosis"
            },
            "pmid": "31533877"
        }
    ],
    "topic": [
        {
            "term": "Critical care medicine",
            "uri": "http://edamontology.org/topic_3403"
        },
        {
            "term": "Medicines research and development",
            "uri": "http://edamontology.org/topic_3376"
        },
        {
            "term": "Complementary medicine",
            "uri": "http://edamontology.org/topic_3423"
        }
    ]
}