{
    "additionDate": "2022-10-09T11:22:49.164936Z",
    "biotoolsCURIE": "biotools:deep-b3",
    "biotoolsID": "deep-b3",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Qiang Tang"
        },
        {
            "name": "Wei Chen"
        }
    ],
    "description": "A deep learning–based multi-model framework model, called Deep-B3, to predict the BBB permeability of candidate compounds.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://cbcb.cdutcm.edu.cn/deepb3/document/"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://cbcb.cdutcm.edu.cn/deepb3/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-10-09T11:22:49.167689Z",
    "license": "Other",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/GreatChenLab/Deep-B3"
        }
    ],
    "name": "Deep-B3",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAC357",
            "metadata": {
                "abstract": "© The Author(s) 2022. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.The ability of a compound to permeate across the blood-brain barrier (BBB) is a significant factor for central nervous system drug development. Thus, for speeding up the drug discovery process, it is crucial to perform high-throughput screenings to predict the BBB permeability of the candidate compounds. Although experimental methods are capable of determining BBB permeability, they are still cost-ineffective and time-consuming. To complement the shortcomings of existing methods, we present a deep learning-based multi-model framework model, called Deep-B3, to predict the BBB permeability of candidate compounds. In Deep-B3, the samples are encoded in three kinds of features, namely molecular descriptors and fingerprints, molecular graph and simplified molecular input line entry system (SMILES) text notation. The pre-trained models were built to extract latent features from the molecular graph and SMILES. These features depicted the compounds in terms of tabular data, image and text, respectively. The validation results yielded from the independent dataset demonstrated that the performance of Deep-B3 is superior to that of the state-of-the-art models. Hence, Deep-B3 holds the potential to become a useful tool for drug development. A freely available online web-server for Deep-B3 was established at http://cbcb.cdutcm.edu.cn/deepb3/, and the source code and dataset of Deep-B3 are available at https://github.com/GreatChenLab/Deep-B3.",
                "authors": [
                    {
                        "name": "Chen W."
                    },
                    {
                        "name": "Nie F."
                    },
                    {
                        "name": "Tang Q."
                    },
                    {
                        "name": "Zhao Q."
                    }
                ],
                "date": "2022-09-20T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "A merged molecular representation deep learning method for blood-brain barrier permeability prediction"
            },
            "pmid": "36002937"
        }
    ],
    "toolType": [
        "Script",
        "Web application"
    ],
    "topic": [
        {
            "term": "Drug development",
            "uri": "http://edamontology.org/topic_3373"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ]
}
