{
    "additionDate": "2021-01-18T08:38:06Z",
    "biotoolsCURIE": "biotools:genopheno",
    "biotoolsID": "genopheno",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "paul_avillach@hms.harvard.edu",
            "name": "Paul Avillach",
            "typeEntity": "Person"
        }
    ],
    "description": "Cataloging large-scale phenotypic and next-generation sequencing data within human datasets.\n\nGenoPheno-CatalogShiny is an R Shiny App developed to provide a dynamic on-line catalog with datasets containing both, genomic sequencing and clinical data for the same patients.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                }
            ]
        }
    ],
    "homepage": "https://avillachlab.shinyapps.io/genophenocatalog/",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-22T19:33:42Z",
    "license": "Apache-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/hms-dbmi/GenoPheno-CatalogShiny"
        }
    ],
    "name": "GenoPheno",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAA033",
            "metadata": {
                "abstract": "© 2020 The Author(s). Published by Oxford University Press.Precision medicine promises to revolutionize treatment, shifting therapeutic approaches from the classical one-size-fits-all to those more tailored to the patient's individual genomic profile, lifestyle and environmental exposures. Yet, to advance precision medicine's main objective-ensuring the optimum diagnosis, treatment and prognosis for each individual-investigators need access to large-scale clinical and genomic data repositories. Despite the vast proliferation of these datasets, locating and obtaining access to many remains a challenge. We sought to provide an overview of available patient-level datasets that contain both genotypic data, obtained by next-generation sequencing, and phenotypic data- A nd to create a dynamic, online catalog for consultation, contribution and revision by the research community. Datasets included in this review conform to six specific inclusion parameters that are: (i) contain data from more than 500 human subjects; (ii) contain both genotypic and phenotypic data from the same subjects; (iii) include whole genome sequencing or whole exome sequencing data; (iv) include at least 100 recorded phenotypic variables per subject; (v) accessible through a website or collaboration with investigators and (vi) make access information available in English. Using these criteria, we identified 30 datasets, reviewed them and provided results in the release version of a catalog, which is publicly available through a dynamic Web application and on GitHub. Users can review as well as contribute new datasets for inclusion (Web: Https://avillachlab.shinyapps.io/genophenocatalog/; GitHub: Https://github.com/hms-dbmi/GenoPheno-CatalogShiny).",
                "authors": [
                    {
                        "name": "Gutierrez-Sacristan A."
                    },
                    {
                        "name": "De Niz C."
                    },
                    {
                        "name": "Kothari C."
                    },
                    {
                        "name": "Kong S.W."
                    },
                    {
                        "name": "Mandl K.D."
                    },
                    {
                        "name": "Avillach P."
                    }
                ],
                "citationCount": 1,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "GenoPheno: Cataloging large-scale phenotypic and next-generation sequencing data within human datasets"
            },
            "pmid": "32249310"
        }
    ],
    "toolType": [
        "Library",
        "Web application"
    ],
    "topic": [
        {
            "term": "Biobank",
            "uri": "http://edamontology.org/topic_3337"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ],
    "validated": 1
}