
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.sidowlab.org/contact/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://mendel.stanford.edu/sidowlab/downloads/gerp/index.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid feature detection",
                    "uri": "http://edamontology.org/operation_0415"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Animal and Crop Genomics"
        ],
        "language": [
            "C++"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/gerp-20110522-analyze-evolutionary-rates-find-constrained-elements-multiple-alignment.html"
        }
    ],
    "publication": [
        {
            "abstract": "Computational efforts to identify functional elements within genomes leverage comparative sequence information by looking for regions that exhibit evidence of selective constraint. One way of detecting constrained elements is to follow a bottom-up approach by computing constraint scores for individual positions of a multiple alignment and then defining constrained elements as segments of contiguous, highly scoring nucleotide positions. Here we present GERP++, a new tool that uses maximum likelihood evolutionary rate estimation for position-specific scoring and, in contrast to previous bottomup methods, a novel dynamic programming approach to subsequently define constrained elements. GERP++ evaluates a richer set of candidate element breakpoints and ranks them based on statistical significance, eliminating the need for biased heuristic extension techniques. Using GERP++ we identify over 1.3 million constrained elements spanning over 7% of the human genome. We predict a higher fraction than earlier estimates largely due to the annotation of longer constrained elements, which improves one to one correspondence between predicted elements with known functional sequences. GERP++ is an efficient and effective tool to provide both nucleotide- and element-level constraint scores within deep multiple sequence alignments. © 2010 Davydov et al.",
            "authors": [
                "Davydov E.V.",
                "Goode D.L.",
                "Sirota M.",
                "Cooper G.M.",
                "Sidow A.",
                "Batzoglou S."
            ],
            "cit_count": 519,
            "journal": "PLoS Computational Biology",
            "pmid": "21152010",
            "title": "Identifying a high fraction of the human genome to be under selective constraint using GERP++",
            "year": "2010-12-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:gerp",
        "biotoolsID": "gerp",
        "description": "Identify constrained elements in multiple alignments by quantifying substitution deficits. These deficits represent substitutions that would have occurred if the element were neutral DNA, but did not occur because the element has been under functional constraint.",
        "homepage": "http://mendel.stanford.edu/sidowlab/downloads/gerp/index.html",
        "name": "GERP++"
    }
}