{
    "additionDate": "2021-01-18T09:42:22Z",
    "biotoolsCURIE": "biotools:quovadopro",
    "biotoolsID": "quovadopro",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "thomas.schwarz@childrens.harvard.edu",
            "name": "Thomas L. Schwarz",
            "typeEntity": "Person"
        }
    ],
    "description": "Autonomous Tool for Measuring Intracellular Dynamics using Temporal Variance.\n\nTrafficking of intracellular cargo is essential to cellular function and can be defective in pathological states including cancer and neurodegeneration. Tools to quantify intracellular traffic are thus necessary for understanding this fundamental cellular process, studying disease mechanisms, and testing the effects of therapeutic pharmaceuticals. IQuoVadoPro that autonomously quantifies the movement of fluorescently tagged intracellular cargo. QuoVadoPro infers the extent of intracellular motility based on the variance of pixel illumination in a series of time-lapse images. The algorithm is an unconventional approach to the automatic measurement of intracellular traffic and is suitable for quantifying movements of intracellular cargo under diverse experimental paradigms.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ThomasSchwarzLab/QuoVadoPro/blob/master/instructions_ReadMeFirst.docx",
    "lastUpdate": "2021-02-03T12:10:36Z",
    "name": "QuoVadoPro",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1002/CPCB.108",
            "metadata": {
                "abstract": "© 2020 Wiley Periodicals LLC.Trafficking of intracellular cargo is essential to cellular function and can be defective in pathological states including cancer and neurodegeneration. Tools to quantify intracellular traffic are thus necessary for understanding this fundamental cellular process, studying disease mechanisms, and testing the effects of therapeutic pharmaceuticals. In this article we introduce an algorithm called QuoVadoPro that autonomously quantifies the movement of fluorescently tagged intracellular cargo. QuoVadoPro infers the extent of intracellular motility based on the variance of pixel illumination in a series of time-lapse images. The algorithm is an unconventional approach to the automatic measurement of intracellular traffic and is suitable for quantifying movements of intracellular cargo under diverse experimental paradigms. QuoVadoPro is particularly useful to measure intracellular cargo movement in non-neuronal cells, where cargo trafficking occurs as short movements in mixed directions. The algorithm can be applied to images with low temporal or spatial resolutions and to intracellular cargo with varying shapes or sizes, like mitochondria or endoplasmic reticulum: situations in which conventional methods such as kymography and particle tracking cannot be applied. In this article we present a stepwise protocol for using the QuoVadoPro software, illustrate its methodology with common examples, discuss critical parameters for reliable data analysis, and demonstrate its use with a previously published example. © 2020 Wiley Periodicals LLC. Basic Protocol: QuoVadoPro, an autonomous tool for measuring intracellular dynamics using temporal variance.",
                "authors": [
                    {
                        "name": "Basu H."
                    },
                    {
                        "name": "Schwarz T.L."
                    }
                ],
                "citationCount": 1,
                "date": "2020-06-01T00:00:00Z",
                "journal": "Current protocols in cell biology",
                "title": "QuoVadoPro, an Autonomous Tool for Measuring Intracellular Dynamics using Temporal Variance"
            },
            "pmid": "32569415"
        }
    ],
    "topic": [
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        }
    ]
}