{
    "additionDate": "2024-01-02T01:14:24.126287Z",
    "biotoolsCURIE": "biotools:neurowrap",
    "biotoolsID": "neurowrap",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "zbowen@fraunhofer.org",
            "name": "Zac Bowen",
            "typeEntity": "Person"
        }
    ],
    "description": "Integrating, validating, and sharing neurodata analysis workflows.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "http://www.neurowrap.org",
    "lastUpdate": "2024-11-24T14:25:40.278421Z",
    "name": "NeuroWRAP",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/fninf.2023.1082111",
            "metadata": {
                "abstract": "Multiphoton calcium imaging is one of the most powerful tools in modern neuroscience. However, multiphoton data require significant pre-processing of images and post-processing of extracted signals. As a result, many algorithms and pipelines have been developed for the analysis of multiphoton data, particularly two-photon imaging data. Most current studies use one of several algorithms and pipelines that are published and publicly available, and add customized upstream and downstream analysis elements to fit the needs of individual researchers. The vast differences in algorithm choices, parameter settings, pipeline composition, and data sources combine to make collaboration difficult, and raise questions about the reproducibility and robustness of experimental results. We present our solution, called NeuroWRAP (www.neurowrap.org), which is a tool that wraps multiple published algorithms together, and enables integration of custom algorithms. It enables development of collaborative, shareable custom workflows and reproducible data analysis for multiphoton calcium imaging data enabling easy collaboration between researchers. NeuroWRAP implements an approach to evaluate the sensitivity and robustness of the configured pipelines. When this sensitivity analysis is applied to a crucial step of image analysis, cell segmentation, we find a substantial difference between two popular workflows, CaImAn and Suite2p. NeuroWRAP harnesses this difference by introducing consensus analysis, utilizing two workflows in conjunction to significantly increase the trustworthiness and robustness of cell segmentation results.",
                "authors": [
                    {
                        "name": "Ayyangar U."
                    },
                    {
                        "name": "Bowen Z."
                    },
                    {
                        "name": "Diep M."
                    },
                    {
                        "name": "Kanold P.O."
                    },
                    {
                        "name": "Losert W."
                    },
                    {
                        "name": "Magnusson G."
                    },
                    {
                        "name": "Smirnov A."
                    }
                ],
                "date": "2023-01-01T00:00:00Z",
                "journal": "Frontiers in Neuroinformatics",
                "title": "NeuroWRAP: integrating, validating, and sharing neurodata analysis workflows"
            },
            "pmcid": "PMC10166805",
            "pmid": "37181735"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
