{"credit":[{"email":"anne.biton@gmail.com","name":"Anne Biton","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"url":"http://bioconductor.org/packages/release/bioc/html/MineICA.html"}],"download":[{"type":"Source code","url":"http://bioconductor/packages/release/bioc/src/contrib/MineICA_1.14.0.tar.gz"}],"function":[{"operation":[{"term":"Analysis","uri":"http://edamontology.org/operation_2945"}]}],"labels":{"collectionID":["BioConductor"],"language":["R"],"license":"GPL-2.0","operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool","Library"],"topic":[{"term":"Transcriptomics","uri":"http://edamontology.org/topic_3308"},{"term":"Gene transcripts","uri":"http://edamontology.org/topic_3512"},{"term":"Gene expression","uri":"http://edamontology.org/topic_0203"}]},"publication":[{"abstract":"© 2014 Ching Siang Tan et al.When gene expression data are too large to be processed, they are transformed into a reduced representation set of genes. Transforming large-scale gene expression data into a set of genes is called feature extraction. If the genes extracted are carefully chosen, this gene set can extract the relevant information from the large-scale gene expression data, allowing further analysis by using this reduced representation instead of the full size data. In this paper, we review numerous software applications that can be used for feature extraction. The software reviewed is mainly for Principal Component Analysis (PCA), Independent Component Analysis (ICA), Partial Least Squares (PLS), and Local Linear Embedding (LLE). A summary and sources of the software are provided in the last section for each feature extraction method.","authors":["Tan C.S.","Ting W.S.","Mohamad M.S.","Chan W.H.","Deris S.","Ali Shah Z."],"cit_count":5,"doi":"10.1155/2014/213656","journal":"BioMed Research International","title":"A Review of Feature Extraction Software for Microarray Gene Expression Data","type":"Review","year":"2014-01-01"}],"summary":{"biotoolsCURIE":"biotools:mineica","biotoolsID":"mineica","description":"The goal of this tool is to perform Independent Component Analysis (ICA) on multiple transcriptome datasets, integrating additional data (e.g molecular, clinical and pathological). This integrative ICA helps the biological interpretation of the components by studying their association with variables (e.g sample annotations) and gene sets, and enables the comparison of components from different datasets using correlation-based graph.","homepage":"http://bioconductor.org/packages/release/bioc/html/MineICA.html","name":"MineICA","version":["1.14.0"]}}