{
    "additionDate": "2021-01-18T09:06:49Z",
    "biotoolsCURIE": "biotools:enano",
    "biotoolsID": "enano",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "iochoal@unav.es",
            "name": "Idoia Ochoa",
            "typeEntity": "Person"
        },
        {
            "email": "almartin@fing.edu.uy",
            "name": "Álvaro Martín",
            "typeEntity": "Person"
        }
    ],
    "description": "An encoder for nanopore FASTQ files.\n\nENANO is a FASTQ lossless compression algorithm especially designed for nanopore sequencing FASTQ files. We tested ENANO and current state-of-the-art compressors on several publicly available nanopore datasets. The results show that our algorithm consistently achieves the best compression performance on every nanopore dataset, while being computationally efficient in terms of speed and memory requirements when compared to existing alternatives.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Base-calling",
                    "uri": "http://edamontology.org/operation_3185"
                }
            ]
        }
    ],
    "homepage": "https://github.com/guilledufort/EnanoFASTQ",
    "language": [
        "C++",
        "Shell"
    ],
    "lastUpdate": "2021-03-07T10:48:09Z",
    "license": "MIT",
    "name": "ENANO",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA551",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved.Motivation: The amount of genomic data generated globally is seeing explosive growth, leading to increasing needs for processing, storage and transmission resources, which motivates the development of efficient compression tools for these data. Work so far has focused mainly on the compression of data generated by short-read technologies. However, nanopore sequencing technologies are rapidly gaining popularity due to the advantages offered by the large increase in the average size of the produced reads, the reduction in their cost and the portability of the sequencing technology. We present ENANO (Encoder for NANOpore), a novel lossless compression algorithm especially designed for nanopore sequencing FASTQ files. Results: The main focus of ENANO is on the compression of the quality scores, as they dominate the size of the compressed file. ENANO offers two modes, Maximum Compression and Fast (default), which trade-off compression efficiency and speed. We tested ENANO, the current state-of-the-art compressor SPRING and the general compressor pigz on several publicly available nanopore datasets. The results show that the proposed algorithm consistently achieves the best compression performance (in both modes) on every considered nanopore dataset, with an average improvement over pigz and SPRING of >24.7% and 6.3%, respectively. In addition, in terms of encoding and decoding speeds, ENANO is 2.9× and 1.7× times faster than SPRING, respectively, with memory consumption up to 0.2 GB. Availability and implementation: ENANO is freely available for download at: https://github.com/guilledufort/ EnanoFASTQ. Supplementary information: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Alvarez G.D."
                    },
                    {
                        "name": "Seroussi G."
                    },
                    {
                        "name": "Smircich P."
                    },
                    {
                        "name": "Sotelo J."
                    },
                    {
                        "name": "Ochoa I."
                    },
                    {
                        "name": "Martin A."
                    }
                ],
                "date": "2020-08-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "ENANO: Encoder for NANOpore FASTQ files"
            },
            "pmid": "32470109"
        }
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        }
    ]
}