{
    "additionDate": "2020-01-14T20:02:08Z",
    "biotoolsCURIE": "biotools:miRsyn",
    "biotoolsID": "miRsyn",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "raonn@uestc.edu.cn",
            "name": "Nini Rao",
            "typeEntity": "Person"
        },
        {
            "email": "thuc.le@unisa.edu.au",
            "name": "Thuc Duy Le",
            "typeEntity": "Person"
        }
    ],
    "description": "Identifying miRNA synergism using multiple-intervention causal inference.\n\nStudying multiple microRNAs (miRNAs) synergism in gene regulation could help to understand the regulatory mechanisms of complicated human diseases caused by miRNAs.\n\nA novel method for identifying miRNA synergism using multiple-intervention causal inference.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network comparison",
                    "uri": "http://edamontology.org/operation_0277"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                }
            ]
        }
    ],
    "homepage": "https://github.com/zhangjunpeng411/miRsyn",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-29T09:11:03Z",
    "license": "GPL-3.0",
    "name": "miRsyn",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3215-5",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Studying multiple microRNAs (miRNAs) synergism in gene regulation could help to understand the regulatory mechanisms of complicated human diseases caused by miRNAs. Several existing methods have been presented to infer miRNA synergism. Most of the current methods assume that miRNAs with shared targets at the sequence level are working synergistically. However, it is unclear if miRNAs with shared targets are working in concert to regulate the targets or they individually regulate the targets at different time points or different biological processes. A standard method to test the synergistic activities is to knock-down multiple miRNAs at the same time and measure the changes in the target genes. However, this approach may not be practical as we would have too many sets of miRNAs to test. Results: n this paper, we present a novel framework called miRsyn for inferring miRNA synergism by using a causal inference method that mimics the multiple-intervention experiments, e.g. knocking-down multiple miRNAs, with observational data. Our results show that several miRNA-miRNA pairs that have shared targets at the sequence level are not working synergistically at the expression level. Moreover, the identified miRNA synergistic network is small-world and biologically meaningful, and a number of miRNA synergistic modules are significantly enriched in breast cancer. Our further analyses also reveal that most of synergistic miRNA-miRNA pairs show the same expression patterns. The comparison results indicate that the proposed multiple-intervention causal inference method performs better than the single-intervention causal inference method in identifying miRNA synergistic network. Conclusions: Taken together, the results imply that miRsyn is a promising framework for identifying miRNA synergism, and it could enhance the understanding of miRNA synergism in breast cancer.",
                "authors": [
                    {
                        "name": "Zhang J."
                    },
                    {
                        "name": "Pham V.V.H."
                    },
                    {
                        "name": "Liu L."
                    },
                    {
                        "name": "Xu T."
                    },
                    {
                        "name": "Truong B."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Rao N."
                    },
                    {
                        "name": "Le T.D."
                    }
                ],
                "citationCount": 4,
                "date": "2019-12-27T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Identifying miRNA synergism using multiple-intervention causal inference"
            },
            "pmcid": "PMC6933624",
            "pmid": "31881825"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}