{
    "additionDate": "2020-01-14T19:52:14Z",
    "biotoolsCURIE": "biotools:DrOn",
    "biotoolsID": "DrOn",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "jpbona@uams.edu",
            "name": "Jonathan P. Bona",
            "typeEntity": "Person"
        }
    ],
    "description": "Enhancing the drug ontology with semantically-rich representations of National Drug Codes and RxNorm unique concept identifiers.\n\nBACKGROUND:The Drug Ontology (DrOn) is a modular, extensible ontology of drug products, their ingredients, and their biological activity created to enable comparative effectiveness and health services researchers to query National Drug Codes (NDCs) that represent products by ingredient, by molecular disposition, by therapeutic disposition, and by physiological effect (e.g., diuretic). It is based on the RxNorm drug terminology maintained by the U. S. National Library of Medicine, and on the Chemical Entities of Biological Interest ontology. Both national drug codes (NDCs) and RxNorm unique concept identifiers (RXCUIS) can undergo changes over time that can obfuscate their meaning when these identifiers occur in historic data",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "http://purl.org/dron/identifiers/dron-identifiers.owl",
    "lastUpdate": "2020-01-14T19:52:14Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://bitbucket.org/jbona/dron-identifiers"
        }
    ],
    "name": "DrOn",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3192-8",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: The Drug Ontology (DrOn) is a modular, extensible ontology of drug products, their ingredients, and their biological activity created to enable comparative effectiveness and health services researchers to query National Drug Codes (NDCs) that represent products by ingredient, by molecular disposition, by therapeutic disposition, and by physiological effect (e.g., diuretic). It is based on the RxNorm drug terminology maintained by the U.S. National Library of Medicine, and on the Chemical Entities of Biological Interest ontology. Both national drug codes (NDCs) and RxNorm unique concept identifiers (RXCUIS) can undergo changes over time that can obfuscate their meaning when these identifiers occur in historic data. We present a new approach to modeling these entities within DrOn that will allow users of DrOn working with historic prescription data to more easily and correctly interpret that data. Results: We have implemented a full accounting of national drug codes and RxNorm unique concept identifiers as information content entities, and of the processes involved in managing their creation and changes. This includes an OWL file that implements and defines the classes necessary to model these entities. A separate file contains an instance-level prototype in OWL that demonstrates the feasibility of this approach to representing NDCs and RXCUIs and the processes of managing them by retrieving and representing several individual NDCs, both active and inactive, and the RXCUIs to which they are connected. We also demonstrate how historic information about these identifiers in DrOn can be easily retrieved using a simple SPARQL query. Conclusions: An accurate model of how these identifiers operate in reality is a valuable addition to DrOn that enhances its usefulness as a knowledge management resource for working with historic data.",
                "authors": [
                    {
                        "name": "Bona J.P."
                    },
                    {
                        "name": "Brochhausen M."
                    },
                    {
                        "name": "Hogan W.R."
                    }
                ],
                "date": "2019-12-23T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Enhancing the drug ontology with semantically-rich representations of National Drug Codes and RxNorm unique concept identifiers"
            },
            "pmcid": "PMC6927112",
            "pmid": "31865907"
        }
    ],
    "topic": [
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        },
        {
            "term": "Compound libraries and screening",
            "uri": "http://edamontology.org/topic_3343"
        }
    ]
}