{
    "additionDate": "2021-01-18T10:21:58Z",
    "biotoolsCURIE": "biotools:morphomap",
    "biotoolsID": "morphomap",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "antonio.profico@york.ac.uk",
            "name": "Antonio Profico",
            "typeEntity": "Person"
        }
    ],
    "description": "An R package for long bone landmarking, cortical thickness, and cross-sectional geometry mapping.\n\nmorphomap at each section extracts two sets of semilandmarks, cortical thickness, cortical area and the parameters useful for cross-sectional Geometry. morphomap returns also 2D and 3D cortical maps. The morphomap package from a single input (an oriented 3D mesh) is capable to produce the output suitable for thickness geometry, shape analysis and cross-sectional geometry.\n\nMorphometric Maps, Bone Landmarking and Cross Sectional Geometry.\n\nExtract cross sections from long bone meshes at specified intervals along the diaphysis. Calculate two and three-dimensional morphometric maps, cross-sectional geometric parameters, and semilandmarks on the periosteal and endosteal contours of each cross section.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "homepage": "https://github.com/AProfico/morphomap",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-26T09:50:31Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://CRAN.R-project.org/package=morphomap"
        }
    ],
    "name": "morphomap",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1002/AJPA.24140",
            "metadata": {
                "abstract": "© 2020 The Authors. American Journal of Physical Anthropology published by Wiley Periodicals LLC.Objectives: This study describes and demonstrates the functionalities and application of a new R package, morphomap, designed to extract shape information as semilandmarks in multiple sections, build cortical thickness maps, and calculate biomechanical parameters on long bones. Methods: morphomap creates, from a single input (an oriented 3D mesh representing the long bone surface), multiple evenly spaced virtual sections. morphomap then directly and rapidly computes morphometric and biomechanical parameters on each of these sections. The R package comprises three modules: (a) to place semilandmarks on the inner and outer outlines of each section, (b) to extract cortical thicknesses for 2D and 3D morphometric mapping, and (c) to compute cross-sectional geometry. Results: In this article, we apply morphomap to femora from Homo sapiens and Pan troglodytes to demonstrate its utility and show its typical outputs. morphomap greatly facilitates rapid analysis and functional interpretation of long bone form and should prove a valuable addition to the osteoarcheological analysis software toolkit. Conclusions: Long bone loading history is commonly retrodicted by calculating biomechanical parameters such as area moments of inertia, analyzing external shape and measuring cortical thickness. morphomap is a software written in the open source R environment, it integrates the main methodological approaches (geometric morphometrics, cortical morphometric maps, and cross-sectional geometry) used to parametrize long bones.",
                "authors": [
                    {
                        "name": "Profico A."
                    },
                    {
                        "name": "Bondioli L."
                    },
                    {
                        "name": "Raia P."
                    },
                    {
                        "name": "O'Higgins P."
                    },
                    {
                        "name": "Marchi D."
                    }
                ],
                "citationCount": 2,
                "date": "2021-01-01T00:00:00Z",
                "journal": "American Journal of Physical Anthropology",
                "title": "morphomap: An R package for long bone landmarking, cortical thickness, and cross-sectional geometry mapping"
            },
            "pmid": "32865237"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        }
    ]
}