{
    "accessibility": "Open access",
    "additionDate": "2016-02-25T09:12:05Z",
    "biotoolsCURIE": "biotools:the_ithanet_portal",
    "biotoolsID": "the_ithanet_portal",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ithanet@ithanet.eu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "Petros Kountouris",
            "orcidid": "http://orcid.org/0000-0003-2681-4355",
            "typeEntity": "Person",
            "typeRole": [
                "Contributor"
            ]
        },
        {
            "name": "cing.ac.cy",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        }
    ],
    "description": "The portal integrates information on news, events, clinical trials, thalassaemia-related organisations, research projects, and other scientific networks. Most importantly, disease-specific databases are developed and maintained on the portal, such as databases of haemoglobin variations (IthaGenes, IthaCNV), epidemiology (IthaMaps) and genotype-phenotype annotation (IthaPhen).",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://www.ithanet.eu/home/about-ithanet"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "homepage": "https://www.ithanet.eu",
    "lastUpdate": "2024-09-18T11:06:05.062766Z",
    "link": [
        {
            "note": "Frequently Asked Questions",
            "type": [
                "Other"
            ],
            "url": "https://www.ithanet.eu/home/faqs"
        }
    ],
    "maturity": "Mature",
    "name": "ITHANET",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "petrosk@cing.ac.cy",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0103020",
            "metadata": {
                "abstract": "Inherited haemoglobinopathies are the most common monogenic diseases, with millions of carriers and patients worldwide. At present, we know several hundred disease-causing mutations on the globin gene clusters, in addition to numerous clinically important trans-acting disease modifiers encoded elsewhere and a multitude of polymorphisms with relevance for advanced diagnostic approaches. Moreover, new disease-linked variations are discovered every year that are not included in traditional and often functionally limited locus-specific databases. This paper presents IthaGenes, a new interactive database of haemoglobin variations, which stores information about genes and variations affecting haemoglobin disorders. In addition, IthaGenes organises phenotype, relevant publications and external links, while embedding the NCBI Sequence Viewer for graphical representation of each variation. Finally, IthaGenes is integrated with the companion tool IthaMaps for the display of corresponding epidemiological data on distribution maps. IthaGenes is incorporated in the ITHANET community portal and is free and publicly available at http://www.ithanet.eu/db/ithagenes. © 2014 Kountouris et al.",
                "authors": [
                    {
                        "name": "Fanis P."
                    },
                    {
                        "name": "Feleki X."
                    },
                    {
                        "name": "Kleanthous M."
                    },
                    {
                        "name": "Kountouris P."
                    },
                    {
                        "name": "Lederer C.W."
                    },
                    {
                        "name": "Old J."
                    }
                ],
                "citationCount": 181,
                "date": "2014-07-24T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "IthaGenes: An interactive database for haemoglobin variations and epidemiology"
            },
            "pmcid": "PMC4109966",
            "pmid": "25058394",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1080/03630260903089177",
            "metadata": {
                "abstract": "Hemoglobin (Hb) disorders are common, potentially lethal monogenic diseases, posing a global health challenge. With worldwide migration and intermixing of carriers, demanding flexible health planning and patient care, hemoglobinopathies may serve as a paradigm for the use of electronic infrastructure tools in the collection of data, the dissemination of knowledge, the harmonization of treatment, and the coordination of research and preventive programs. ITHANET, a network covering thalassemias and other hemoglobinopathies, comprises 26 organizations from 16 countries, including non-European countries of origin for these diseases (Egypt, Israel, Lebanon, Tunisia and Turkey). Using electronic infrastructure tools, ITHANET aims to strengthen cross-border communication and data transfer, cooperative research and treatment of thalassemia, and to improve support and information of those affected by hemoglobinopathies. Moreover, the consortium has established the ITHANET Portal, a novel web-based instrument for the dissemination of information on hemoglobinopathies to researchers, clinicians and patients. The ITHANET Portal is a growing public resource, providing forums for discussion and research coordination, and giving access to courses and databases organized by ITHANET partners. Already a popular repository for diagnostic protocols and news related to hemoglobinopathies, the ITHANET Portal also provides a searchable, extendable database of thalassemia mutations and associated background information. The experience of ITHANET is exemplary for a consortium bringing together disparate organizations from heterogeneous partner countries to face a common health challenge. The ITHANET Portal as a web-based tool born out of this experience amends some of the problems encountered and facilitates education and international exchange of data and expertise for hemoglobinopathies. Copyright © Informa Healthcare USA, Inc.",
                "authors": [
                    {
                        "name": "Aydinok Y."
                    },
                    {
                        "name": "Basak A.N."
                    },
                    {
                        "name": "Christou S."
                    },
                    {
                        "name": "El-Beshlawy A."
                    },
                    {
                        "name": "Eleftheriou A."
                    },
                    {
                        "name": "Fattoum S."
                    },
                    {
                        "name": "Felice A.E."
                    },
                    {
                        "name": "Fibach E."
                    },
                    {
                        "name": "Galanello R."
                    },
                    {
                        "name": "Gambari R."
                    },
                    {
                        "name": "Gavrila L."
                    },
                    {
                        "name": "Giordano P.C."
                    },
                    {
                        "name": "Grosveld F."
                    },
                    {
                        "name": "Hassapopoulou H."
                    },
                    {
                        "name": "Hladka E."
                    },
                    {
                        "name": "Kanavakis E."
                    },
                    {
                        "name": "Kleanthous M."
                    },
                    {
                        "name": "Lederer C.W."
                    },
                    {
                        "name": "Locatelli F."
                    },
                    {
                        "name": "Old J."
                    },
                    {
                        "name": "Patrinos G.P."
                    },
                    {
                        "name": "Romeo G."
                    },
                    {
                        "name": "Taher A."
                    },
                    {
                        "name": "Traeger-Synodinos J."
                    },
                    {
                        "name": "Vassiliou P."
                    },
                    {
                        "name": "Villegas A."
                    },
                    {
                        "name": "Voskaridou E."
                    },
                    {
                        "name": "Wajcman H."
                    },
                    {
                        "name": "Zafeiropoulos A."
                    }
                ],
                "citationCount": 19,
                "date": "2009-06-01T00:00:00Z",
                "journal": "Hemoglobin",
                "title": "An electronic infrastructure for research and treatment of the thalassemias and other hemoglobinopathies: The Euro-Mediterranean ITHANET project"
            },
            "pmid": "19657830",
            "type": [
                "Other"
            ]
        },
        {
            "metadata": {
                "abstract": "Haemoglobinopathies are the commonest monogenic diseases worldwide and are caused by variants in the globin gene clusters. With over 2400 variants detected to date, their interpretation using the American College of Medical Genetics and Genomics (ACMG)/Association for Molecular Pathology (AMP) guidelines is challenging and computational evidence can provide valuable input about their functional annotation. While many in silico predictors have already been developed, their performance varies for different genes and diseases. In this study, we evaluate 31 in silico predictors using a dataset of 1627 variants in HBA1, HBA2, and HBB. By varying the decision threshold for each tool, we analyse their performance (a) as binary classifiers of pathogenicity and (b) by using different non-overlapping pathogenic and benign thresholds for their optimal use in the ACMG/AMP framework. Our results show that CADD, Eigen-PC, and REVEL are the overall top performers, with the former reaching moderate strength level for pathogenic prediction. Eigen-PC and REVEL achieve the highest accuracies for missense variants, while CADD is also a reliable predictor of non-missense variants. Moreover, SpliceAI is the top performing splicing predictor, reaching strong level of evidence, while GERP++ and phyloP are the most accurate conservation tools. This study provides evidence about the optimal use of computational tools in globin gene clusters under the ACMG/AMP framework.",
                "authors": [
                    {
                        "name": "Bento C."
                    },
                    {
                        "name": "Esa E."
                    },
                    {
                        "name": "Fylaktou I."
                    },
                    {
                        "name": "Halim-Fikri H."
                    },
                    {
                        "name": "Hamid F.S.A."
                    },
                    {
                        "name": "Harteveld C.L."
                    },
                    {
                        "name": "Kakouri A.C."
                    },
                    {
                        "name": "Kleanthous M."
                    },
                    {
                        "name": "Kountouris P."
                    },
                    {
                        "name": "Minaidou A."
                    },
                    {
                        "name": "Stephanou C."
                    },
                    {
                        "name": "Tamana S."
                    },
                    {
                        "name": "Traeger-Synodinos J."
                    },
                    {
                        "name": "Xenophontos M."
                    },
                    {
                        "name": "Yasin N.M."
                    },
                    {
                        "name": "Zilfalil B.A."
                    }
                ],
                "citationCount": 4,
                "date": "2022-01-01T00:00:00Z",
                "journal": "eLife",
                "title": "Evaluation of in silico predictors on short nucleotide variants in HBA1, HBA2, and HBB associated with haemoglobinopathies"
            },
            "pmid": "36453528",
            "type": [
                "Usage"
            ]
        },
        {
            "metadata": {
                "abstract": "Several types of haemoglobinopathies are caused by copy number variants (CNVs). While diagnosis is often based on haematological and biochemical parameters, a definitive diagnosis requires molecular DNA analysis. In some cases, the molecular characterisation of large deletions/duplications is challenging and inconclusive and often requires the use of specific diagnostic procedures, such as multiplex ligation-dependent probe amplification (MLPA). Herein, we collected and comprehensively analysed all known CNVs associated with haemoglobinopathies. The dataset of 291 CNVs was retrieved from the IthaGenes database and was further manually annotated to specify genomic locations, breakpoints and MLPA probes relevant for each CNV. We developed IthaCNVs, a publicly available and easy-to-use online tool that can facilitate the diagnosis of rare and diagnostically challenging haemoglobinopathy cases attributed to CNVs. Importantly, it facilitates the filtering of available entries based on the type of breakpoint information, on specific chromosomal and locus positions, on MLPA probes, and on affected gene(s). IthaCNVs brings together manually curated information about CNV genomic locations, functional effects, and information that can facilitate CNV characterisation through MLPA. It can help laboratory staff and clinicians confirm suspected diagnosis of CNVs based on molecular DNA screening and analysis.",
                "authors": [
                    {
                        "name": "Bento C."
                    },
                    {
                        "name": "Harteveld C.L."
                    },
                    {
                        "name": "Kleanthous M."
                    },
                    {
                        "name": "Kountouris P."
                    },
                    {
                        "name": "Minaidou A."
                    },
                    {
                        "name": "Stephanou C."
                    },
                    {
                        "name": "Tamana S."
                    },
                    {
                        "name": "Xenophontos M."
                    }
                ],
                "citationCount": 3,
                "date": "2022-12-01T00:00:00Z",
                "journal": "International Journal of Molecular Sciences",
                "title": "A Novel Tool for the Analysis and Detection of Copy Number Variants Associated with Haemoglobinopathies"
            },
            "pmid": "36555557",
            "type": [
                "Usage"
            ]
        },
        {
            "pmid": "31717530",
            "type": [
                "Usage"
            ]
        },
        {
            "pmid": "37359188",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        },
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Haematology",
            "uri": "http://edamontology.org/topic_3408"
        },
        {
            "term": "Human genetics",
            "uri": "http://edamontology.org/topic_3574"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Molecular genetics",
            "uri": "http://edamontology.org/topic_3321"
        },
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        }
    ],
    "validated": 1
}
