{
    "additionDate": "2020-01-14T09:32:10Z",
    "biotoolsCURIE": "biotools:spm-pathway",
    "biotoolsID": "spm-pathway",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "sahandk@sfu.ca",
            "name": "Sahand Khakabimamaghani",
            "orcidid": "https://orcid.org/0000-0002-5178-0188",
            "typeEntity": "Person"
        }
    ],
    "description": "Uncovering the subtype-specific temporal order of cancer pathway dysregulation.\n\nSubtype-specific Pathway Linear Progression Model.\n\nAn integer linear program for simultaneous identification of cancer pathways, cancer subtyes and subtype-specific order of pathway dysregulation. The input is the Cancer Cell Fraction (CCF) matrix with rows corresponding to samples and columns indicating somatic genetic variants for which CCF values are measured. The output consists of a partitioning samples into subtypes, a partitioning of variants into pathways, and a linear progression model of the pathways for each subtype.\n\nOur software SPM consists of three separate parts: intermediate file generation (matGenerator.cpp), the main algorithm implementation (SPM.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Dalton386/SPM",
    "language": [
        "C++",
        "R"
    ],
    "lastUpdate": "2020-12-24T13:45:08Z",
    "name": "SPM",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1007451",
            "metadata": {
                "abstract": "© 2019 Khakabimamaghani et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Cancer is driven by genetic mutations that dysregulate pathways important for proper cell function. Therefore, discovering these cancer pathways and their dysregulation order is key to understanding and treating cancer. However, the heterogeneity of mutations between different individuals makes this challenging and requires that cancer progression is studied in a subtype-specific way. To address this challenge, we provide a mathematical model, called Subtype-specific Pathway Linear Progression Model (SPM), that simultaneously captures cancer subtypes and pathways and order of dysregulation of the pathways within each subtype. Experiments with synthetic data indicate the robustness of SPM to problem specifics including noise compared to an existing method. Moreover, experimental results on glioblastoma multiforme and colorectal adenocarcinoma show the consistency of SPM's results with the existing knowledge and its superiority to an existing method in certain cases. The implementation of our method is available at https://github.com/Dalton386/SPM.",
                "authors": [
                    {
                        "name": "Ding D."
                    },
                    {
                        "name": "Ester M."
                    },
                    {
                        "name": "Khakabimamaghani S."
                    },
                    {
                        "name": "Snow O."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Uncovering the subtype-specific temporal order of cancer pathway dysregulation"
            },
            "pmcid": "PMC6872169",
            "pmid": "31710622"
        }
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ],
    "validated": 1
}
