{
    "additionDate": "2017-03-24T09:34:08Z",
    "biotoolsCURIE": "biotools:modeller",
    "biotoolsID": "modeller",
    "credit": [
        {
            "email": "modeller-care@salilab.org",
            "name": "Modeller Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://salilab.org/index.html"
        }
    ],
    "description": "Used for homology or comparative modeling of protein three-dimensional structures. The user provides an alignment of a sequence to be modeled with known related structures and MODELLER automatically calculates a model containing all non-hydrogen atoms.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://salilab.org/modeller/wiki/"
        },
        {
            "type": [
                "User manual"
            ],
            "url": "https://salilab.org/modeller/9.19/manual.pdf"
        }
    ],
    "editPermission": {
        "authors": [
            "sergitobara"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                }
            ]
        }
    ],
    "homepage": "http://salilab.org/modeller/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-07-11T14:44:42.934822Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/modeller-9-10-comparative-protein-structure-modeling.html"
        }
    ],
    "name": "MODELLER",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": "10.1002/cpbi.3",
            "metadata": {
                "abstract": "© 2016 by John Wiley & Sons, Inc.Comparative protein structure modeling predicts the three-dimensional structure of a given protein sequence (target) based primarily on its alignment to one or more proteins of known structure (templates). The prediction process consists of fold assignment, target-template alignment, model building, and model evaluation. This unit describes how to calculate comparative models using the program MODELLER and how to use the ModBase database of such models, and discusses all four steps of comparative modeling, frequently observed errors, and some applications. Modeling lactate dehydrogenase from Trichomonas vaginalis (TvLDH) is described as an example. The download and installation of the MODELLER software is also described.",
                "authors": [
                    {
                        "name": "Sali A."
                    },
                    {
                        "name": "Webb B."
                    }
                ],
                "citationCount": 1224,
                "date": "2016-01-01T00:00:00Z",
                "journal": "Current Protocols in Bioinformatics",
                "title": "Comparative protein structure modeling using MODELLER"
            },
            "pmcid": "PMC5031415",
            "pmid": "27322406"
        },
        {
            "doi": "10.1110/ps.9.9.1753",
            "metadata": {
                "abstract": "Comparative protein structure prediction is limited mostly by the errors in alignment and loop modeling. We describe here a new automated modeling technique that significantly improves the accuracy of loop predictions in protein structures. The positions of all nonhydrogen atoms of the loop are optimized in a fixed environment with respect to a pseudo energy function. The energy is a sum of many spatial restraints that include the bond length, bond angle, and improper dihedral angle terms from the CHARMM-22 force field, statistical preferences for the main-chain and side-chain dihedral angles, and statistical preferences for nonbonded atomic contacts that depend on the two atom types, their distance through space, and separation in sequence. The energy function is optimized with the method of conjugate gradients combined with molecular dynamics and simulated annealing. Typically, the predicted loop conformation corresponds to the lowest energy conformation among 500 independent optimizations. Predictions were made for 40 loops of known structure at each length from 1 to 14 residues. The accuracy of loop predictions is evaluated as a function of thoroughness of conformational sampling, loop length, and structural properties of native loops. When accuracy is measured by local superposition of the model on the native loop, 100, 90, and 30% of 4-, 8-, and 12-residue loop predictions, respectively, had <2 Å RMSD error for the mainchain N, C(α), C, and O atoms; the average accuracies were 0.59 ± 0.05, 1.16 ± 0.10, and 2.61 ± 0.16 Å respectively. To simulate real comparative modeling problems, the method was also evaluated by predicting loops of known structure in only approximately correct environments with errors typical of comparative modeling without misalignment. When the RMSD distortion of the main-chain stem atoms is 2.5 Å, the average loop prediction error increased by 180, 25, and 3% for 4-, 8-, and 12-residue loops, respectively. The accuracy of the lowest energy prediction for a given loop can be estimated from the structural variability among a number of low energy predictions. The relative value of the present method is gauged by (1) comparing it with one of the most successful previously described methods, and (2) describing its accuracy in recent blind predictions of protein structure. Finally, it is shown that the average accuracy of prediction is limited primarily by the accuracy of the energy function rather than by the extent of conformational sampling.",
                "authors": [
                    {
                        "name": "Fiser A."
                    },
                    {
                        "name": "Kinh Gian Do R."
                    },
                    {
                        "name": "Sali A."
                    }
                ],
                "citationCount": 1575,
                "date": "2000-01-01T00:00:00Z",
                "journal": "Protein Science",
                "title": "Modeling of loops in protein structures"
            },
            "pmcid": "PMC2144714",
            "pmid": "11045621"
        },
        {
            "doi": "10.1006/jmbi.1993.1626",
            "metadata": {
                "abstract": "We describe a comparative protein modelling method designed to find the most probable structure for a sequence given its alignment with related structures. The three-dimensional (3D) model is obtained by optimally satisfying spatial restraints derived from the alignment and expressed as probability density functions (pdfs) for the features restrained. For example, the probabilities for main-chain conformations of a modelled residue may be restrained by its residue type, main-chain conformation of an equivalent residue in a related protein, and the local similarity between the two sequences. Several such pdfs are obtained from the correlations between structural features in 17 families of homologous proteins which have been aligned on the basis of their 3D structures. The pdfs restrain Cα-Cα distances, main-chain N-O distances, main-chain and side-chain dihedral angles. A smoothing procedure is used in the derivation of these relationships to minimize the problem of a sparse database. The 3D model of a protein is obtained by optimization of the molecular pdf such that the model violates the input restraints as little as possible. The molecular pdf is derived as a combination of pdfs restraining individual spatial features of the whole molecule. The optimization procedure is a variable target function method that applies the conjugate gradients algorithm to positions of all non-hydrogen atoms. The method is automated and is illustrated by the modelling of trypsin from two other serine proteinases. © 1993 Academic Press Limited.",
                "authors": [
                    {
                        "name": "Blundell T.L."
                    },
                    {
                        "name": "Sali A."
                    }
                ],
                "citationCount": 10251,
                "date": "1993-12-05T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "Comparative protein modelling by satisfaction of spatial restraints"
            },
            "pmid": "8254673"
        },
        {
            "doi": "10.1007/978-1-4939-0366-5_1",
            "metadata": {
                "abstract": "© Springer Science+Business Media New York 2014.Genome sequencing projects have resulted in a rapid increase in the number of known protein sequences. In contrast, only about one-hundredth of these sequences have been characterized at atomic resolution using experimental structure determination methods. Computational protein structure modelling techniques have the potential to bridge this sequence–structure gap. In this chapter, we present an example that illustrates the use of MODELLER to construct a comparative model for a protein with unknown structure. Automation of a similar protocol has resulted in models of useful accuracy for domains in more than half of all known protein sequences.",
                "authors": [
                    {
                        "name": "Sali A."
                    },
                    {
                        "name": "Webb B."
                    }
                ],
                "citationCount": 444,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Methods in Molecular Biology",
                "title": "Protein structure modeling with MODELLER"
            },
            "pmid": "24573470"
        },
        {
            "doi": "10.1146/annurev.biophys.29.1.291",
            "metadata": {
                "abstract": "Comparative modeling predicts the three-dimensional structure of a given protein sequence (target) based primarily on its alignment to one or more proteins of known structure (templates). The prediction process consists of fold assignment, target-template alignment, model building, and model evaluation. The number of protein sequences that can be modeled and the accuracy of the predictions are increasing steadily because of the growth in the number of known protein structures and because of the improvements in the modeling software. Further advances are necessary in recognizing weak sequence-structure similarities, aligning sequences with structures, modeling of rigid body shifts, distortions, loops and side chains, as well as detecting errors in a model. Despite these problems, it is currently possible to model with useful accuracy significant parts of approximately one third of all known protein sequences. The use of individual comparative models in biology is already rewarding and increasingly widespread. A major new challenge for comparative modeling is the integration of it with the torrents of data from genome sequencing projects as well as from functional and structural genomics. In particular, there is a need to develop an automated, rapid, robust, sensitive, and accurate comparative modeling pipeline applicable to whole genomes. Such large-scale modeling is likely to encourage new kinds of applications for the many resulting models, based on their large number and completeness at the level of the family, organism, or functional network.",
                "authors": [
                    {
                        "name": "Fiser A."
                    },
                    {
                        "name": "Marti-Renom M.A."
                    },
                    {
                        "name": "Melo F."
                    },
                    {
                        "name": "Sali A."
                    },
                    {
                        "name": "Sanchez R."
                    },
                    {
                        "name": "Stuart A.C."
                    }
                ],
                "citationCount": 2496,
                "date": "2000-08-14T00:00:00Z",
                "journal": "Annual Review of Biophysics and Biomolecular Structure",
                "title": "Comparative protein structure modeling of genes and genomes"
            },
            "pmid": "10940251"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ],
    "validated": 1
}
