{
    "additionDate": "2021-01-18T09:29:12Z",
    "biotoolsCURIE": "biotools:dbmhcc",
    "biotoolsID": "dbmhcc",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "yuting@dragon.nchu.edu.tw",
            "name": "Yu-Ting Chen",
            "orcidid": "https://orcid.org/0000-0003-4579-6498",
            "typeEntity": "Person"
        }
    ],
    "description": "dBMHCC is a comprehensive hepatocellular carcinoma (HCC) biomarker database provides a reliable prediction system for novel HCC phosphorylated biomarkers.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                }
            ]
        }
    ],
    "homepage": "http://predictor.nchu.edu.tw/dBMHCC",
    "lastUpdate": "2021-02-22T15:27:11Z",
    "name": "dBMHCC",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0234084",
            "metadata": {
                "abstract": "© 2020 Chu et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Hepatocellular carcinoma (HCC), which is associated with an absence of obvious symptoms and poor prognosis, is the second leading cause of cancer death worldwide. Genome-wide molecular biology studies should provide biological insights into HCC development. Based on the importance of phosphorylation for signal transduction, several protein kinase inhibitors have been developed that improve the survival of cancer patients. However, a comprehensive database of HCC-related phosphorylated biomarkers (HCCPMs) and novel HCCPMs prediction platform has been lacking. We have thus constructed the dBMHCC databases to provide expression profiles, phosphorylation and drug information, and evidence type; gathered information on HCC-related pathways and their involved genes as candidate HCC biomarkers; and established a system for evaluating protein phosphorylation and HCC-related biomarkers to improve the reliability of biomarker prediction. The resulting dBMHCC contains 611 notable HCC-related genes, 234 HCC-related pathways, 17 phosphorylation-related motifs and their 255 corresponding protein kinases, 5955 HCC biomarkers, and 1077 predicted HCCPMs. Methionine adenosyltransferase 2B (MAT2B) and acireductone dioxygenase 1 (ADI1), which regulate HCC development and hepatitis C virus infection, respectively, were among the top 10 HCCPMs predicted by dBMHCC. Platelet-derived growth factor receptor alpha (PDGFRA), which had the highest evaluation score, was identified as the target of one HCC drug (Regorafenib), five cancer drugs, and four non-cancer drugs. dBMHCC is an open resource for HCC phosphorylated biomarkers, which supports researchers investigating the development of HCC and designing novel diagnosis methods and drug treatments. Database URL: http://predictor.nchu.edu.tw/dBMHCC.",
                "authors": [
                    {
                        "name": "Chen C.-W."
                    },
                    {
                        "name": "Chen Y.-T."
                    },
                    {
                        "name": "Chien C.-H."
                    },
                    {
                        "name": "Chu Y.-W."
                    },
                    {
                        "name": "Sung M.-I."
                    }
                ],
                "citationCount": 2,
                "date": "2020-06-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "DBMHCC: A comprehensive hepatocellular carcinoma (HCC) biomarker database provides a reliable prediction system for novel HCC phosphorylated biomarkers"
            },
            "pmcid": "PMC7272086",
            "pmid": "32497121"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        }
    ]
}
