{
    "additionDate": "2018-05-10T19:35:19Z",
    "biotoolsCURIE": "biotools:indigo",
    "biotoolsID": "indigo",
    "credit": [
        {
            "email": "intikhab.alam@kaust.edu.sa",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "indigo_help@kaust.edu.sa",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "allan.kamau@kaust.edu.sa",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "INtegrated Data Warehouse of MIcrobial GenOmes with Examples from the Red Sea Extremophiles.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.cbrc.kaust.edu.sa/indigo/cbrcredsea/indigo_help.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence annotation",
                    "uri": "http://edamontology.org/operation_0361"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://www.cbrc.kaust.edu.sa/indigo/begin.do",
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "INDIGO",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0082210",
            "metadata": {
                "abstract": "Background: The next generation sequencing technologies substantially increased the throughput of microbial genome sequencing. To functionally annotate newly sequenced microbial genomes, a variety of experimental and computational methods are used. Integration of information from different sources is a powerful approach to enhance such annotation. Functional analysis of microbial genomes, necessary for downstream experiments, crucially depends on this annotation but it is hampered by the current lack of suitable information integration and exploration systems for microbial genomes. Results: We developed a data warehouse system (INDIGO) that enables the integration of annotations for exploration and analysis of newly sequenced microbial genomes. INDIGO offers an opportunity to construct complex queries and combine annotations from multiple sources starting from genomic sequence to protein domain, gene ontology and pathway levels. This data warehouse is aimed at being populated with information from genomes of pure cultures and uncultured single cells of Red Sea bacteria and Archaea. Currently, INDIGO contains information from Salinisphaera shabanensis, Haloplasma contractile, and Halorhabdus tiamatea - extremophiles isolated from deep-sea anoxic brine lakes of the Red Sea. We provide examples of utilizing the system to gain new insights into specific aspects on the unique lifestyle and adaptations of these organisms to extreme environments. Conclusions: We developed a data warehouse system, INDIGO, which enables comprehensive integration of information from various resources to be used for annotation, exploration and analysis of microbial genomes. It will be regularly updated and extended with new genomes. It is aimed to serve as a resource dedicated to the Red Sea microbes. In addition, through INDIGO, we provide our Automatic Annotation of Microbial Genomes (AAMG) pipeline. The INDIGO web server is freely available at http://www.cbrc.kaust.edu.sa/indigo. © 2013 Alam et al.",
                "authors": [
                    {
                        "name": "Alam I."
                    },
                    {
                        "name": "Antunes A."
                    },
                    {
                        "name": "Kamau A.A."
                    },
                    {
                        "name": "Alawi W.B."
                    },
                    {
                        "name": "Kalkatawi M."
                    },
                    {
                        "name": "Stingl U."
                    },
                    {
                        "name": "Bajic V.B."
                    }
                ],
                "citationCount": 53,
                "date": "2013-12-06T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "INDIGO - Integrated data warehouse of microbial genomes with examples from the red sea extremophiles"
            },
            "pmcid": "PMC3855842",
            "pmid": "24324765"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        }
    ],
    "validated": 1
}