
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Simulation analysis",
                    "uri": "http://edamontology.org/operation_0244"
                },
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "labels": {
        "topic": [
            {
                "term": "Molecular dynamics",
                "uri": "http://edamontology.org/topic_0176"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Imaging",
                "uri": "http://edamontology.org/topic_3382"
            },
            {
                "term": "Protein folds and structural domains",
                "uri": "http://edamontology.org/topic_0736"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019 Wiley Periodicals, Inc.The interactions between tumor necrosis factors (TNFs) and their corresponding receptors (TNFRs) play a pivotal role in inflammatory responses. Upon ligand binding, TNFR receptors were found to form oligomers on cell surfaces. However, the underlying mechanism of oligomerization is not fully understood. In order to tackle this problem, molecular dynamics (MD) simulations have been applied to the complex between TNF receptor-1 (TNFR1) and its ligand TNF-α as a specific test system. The simulations on both all-atom (AA) and coarse-grained (CG) levels achieved the similar results that the extracellular domains of TNFR1 can undergo large fluctuations on plasma membrane, while the dynamics of TNFα-TNFR1 complex is much more constrained. Using the CG model with the Martini force field, we are able to simulate the systems that contain multiple TNFα-TNFR1 complexes with the timescale of microseconds. We found that complexes can aggregate into oligomers on the plasma membrane through the lateral interactions between receptors at the end of the CG simulations. We suggest that this spatial organization is essential to the efficiency of signal transduction for ligands that belong to the TNF superfamily. We further show that the aggregation of two complexes is initiated by the association between the N-terminal domains of TNFR1 receptors. Interestingly, the cis-interfaces between N-terminal regions of two TNF receptors have been observed in the previous X-ray crystallographic experiment. Therefore, we provide supportive evidence that cis-interface is of functional importance in triggering the receptor oligomerization. Taken together, our study brings insights to understand the molecular mechanism of TNF signaling.",
            "authors": [
                "Su Z.",
                "Wu Y."
            ],
            "cit_count": 0,
            "doi": "10.1002/PROT.25854",
            "journal": "Proteins: Structure, Function and Bioinformatics",
            "pmid": "31710744",
            "title": "Computational simulations of TNF receptor oligomerization on plasma membrane",
            "year": "2019-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:TNFR1",
        "biotoolsID": "TNFR1",
        "description": "Computational simulations of TNF receptor oligomerization on plasma membrane.\n\nThe interactions between tumor necrosis factors (TNFs) and their corresponding receptors (TNFRs) play a pivotal role in inflammatory responses. Upon ligand binding, TNFR receptors were found to form oligomers on cell surfaces. However, the underlying mechanism of oligomerization is not fully understood. In order to tackle this problem, molecular dynamics (MD) simulations have been applied to the complex between TNF receptor-1 (TNFR1) and its ligand TNF-α as a specific test system. The simulations on both all-atom (AA) and coarse-grained (CG) levels achieved the similar results that the extracellular domains of TNFR1 can undergo large fluctuations on plasma membrane, while the dynamics of TNFα-TNFR1 complex is much more constrained.\n\n||| HOMEPAGE BROKEN!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'TNF', 'TNFa-TNFR1'",
        "homepage": "http://www.cbligand.org/downloads/TNF_TNFR1.pdb",
        "name": "TNFR1"
    }
}