{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://gcrg.ucsd.edu/Researchers/Palsson"}],"documentation":[{"type":"GENERAL","url":"http://gcrg.ucsd.edu/sites/default/files/Attachments/Images/downloads/extreme_pathway_analysis/MATHEMATICAEXPA.pdf"}],"function":[{"operation":[{"term":"Pathway analysis","uri":"http://edamontology.org/operation_2497"}]}],"labels":{"language":["C++"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Systems biology","uri":"http://edamontology.org/topic_2259"},{"term":"Networks","uri":"http://edamontology.org/topic_0602"},{"term":"Pathways","uri":"http://edamontology.org/topic_0602"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/expa-050216-extreme-pathway-analysis-metabolic-networks.html"}],"publication":[{"abstract":"Background: The set of extreme pathways (ExPa), {pi}, defines the convex basis vectors used for the mathematical characterization of the null space of the stoichiometric matrix for biochemical reaction networks. ExPa analysis has been used for a number of studies to determine properties of metabolic networks as well as to obtain insight into their physiological and functional states in silico. However, the number of ExPas, p = {pi} , grows with the size and complexity of the network being studied, and this poses a computational challenge. For this study, we investigated the relationship between the number of extreme pathways and simple network properties. Results: We established an estimating function for the number of ExPas using these easily obtainable network measurements. In particular, it was found that log [p] had an exponential relationship with log [∑i=1Rd1d+1 c1], where R = Reff is the number of active reactions in a network, d-i and d+i the incoming and outgoing degrees of the reactions ri ∈ Reff, and ci the clustering coefficient for each active reaction. Conclusion: This relationship typically gave an estimate of the number of extreme pathways to within a factor of 10 of the true number. Such a function providing an estimate for the total number of ExPas for a given system will enable researchers to decide whether ExPas analysis is an appropriate investigative tool. © 2007 Yeung et al.; licensee BioMed Central Ltd.","authors":["Yeung M.","Thiele I.","Palsson B.Oo."],"cit_count":39,"doi":"10.1186/1471-2105-8-363","journal":"BMC Bioinformatics","title":"Estimation of the number of extreme pathways for metabolic networks","type":"Primary","year":"2007-09-27"}],"summary":{"biotoolsCURIE":"biotools:expa","biotoolsID":"expa","description":"ExPa (extreme pathways analysis) , a generating set for all possible steady state flux maps in a biochemical reaction network, can be computed from the stoichiometric matrix, an incidence-like matrix reflecting the network topology. ExPa compute these pathways.","homepage":"http://gcrg.ucsd.edu/Downloads/ExtremePathwayAnalysis","name":"ExPA","version":["50216"]}}