{
    "accessibility": "Open access",
    "additionDate": "2022-09-03T22:53:27.172850Z",
    "biotoolsCURIE": "biotools:rformer",
    "biotoolsID": "rformer",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Lu Chen"
        },
        {
            "name": "Zheng Gong"
        },
        {
            "name": "Yuanhao Cai",
            "orcidid": "https://orcid.org/0000-0002-8266-7102"
        },
        {
            "name": "Zhuo Deng",
            "orcidid": "https://orcid.org/0000-0002-8907-588X"
        }
    ],
    "description": "Transformer-Based Generative Adversarial Network for Real Fundus Image Restoration on a New Clinical Benchmark.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://github.com/dengzhuo-AI/Real-Fundus",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-09-03T22:53:27.175330Z",
    "license": "Not licensed",
    "name": "RFormer",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1109/JBHI.2022.3187103",
            "metadata": {
                "abstract": "AuthorOphthalmologists have used fundus images to screen and diagnose eye diseases. However, different equipments and ophthalmologists pose large variations to the quality of fundus images. Low-quality (LQ) degraded fundus images easily lead to uncertainty in clinical screening and generally increase the risk of misdiagnosis. Thus, real fundus image restoration is worth studying. Unfortunately, real clinical benchmark has not been explored for this task so far. In this paper, we investigate the real clinical fundus image restoration problem. Firstly, We establish a clinical dataset, Real Fundus (RF), including 120 low- and high-quality (HQ) image pairs. Then we propose a novel Transformer-based Generative Adversarial Network (RFormer) to restore the real degradation of clinical fundus images. The key component in our network is the Window-based Self-Attention Block (WSAB) which captures non-local self-similarity and long-range dependencies. To produce more visually pleasant results, a Transformer-based discriminator is introduced. Extensive experiments on our clinical benchmark show that the proposed RFormer significantly outperforms the state-of-the-art (SOTA) methods. In addition, experiments of downstream tasks such as vessel segmentation and optic disc/cup detection demonstrate that our proposed RFormer benefits clinical fundus image analysis and applications. The dataset, code, and models will be made publicly available at <uri>https://github.com/dengzhuo-AI/Real-Fundus</uri>.",
                "authors": [
                    {
                        "name": "Bao Q."
                    },
                    {
                        "name": "Cai Y."
                    },
                    {
                        "name": "Chen L."
                    },
                    {
                        "name": "Deng Z."
                    },
                    {
                        "name": "Fang D."
                    },
                    {
                        "name": "Gong Z."
                    },
                    {
                        "name": "Ma L."
                    },
                    {
                        "name": "Yang W."
                    },
                    {
                        "name": "Yao X."
                    },
                    {
                        "name": "Zhang S."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "IEEE Journal of Biomedical and Health Informatics",
                "title": "RFormer: Transformer-Based Generative Adversarial Network for Real Fundus Image Restoration on a New Clinical Benchmark"
            },
            "pmid": "35767498"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
