{
    "additionDate": "2021-01-18T08:08:49Z",
    "biotoolsCURIE": "biotools:idbp-dep",
    "biotoolsID": "idbp-dep",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Xiaoning Song",
            "typeEntity": "Person"
        }
    ],
    "description": "Sequence-based Detection of DNA-binding Proteins using Multiple-view Features Allied with Feature Selection.\n\nDNA-binding proteins play essential roles in many molecular functions and gene regulation. Therefore, it becomes highly desirable to develop effective computational techniques for detecting DNA-binding proteins. In this paper, we proposed a new method, iDBP-DEP, which performs DNA-binding prediction by using the discriminative feature derived from multi-view feature sources including evolutionary profile, dipeptide composition, and physicochemical properties with feature selection. We evaluated iDBP-DEP on two benchmark datasets, i. e., PDB1075 and PDB594 by rigorous Jackknife test. Compared with the state-of-the-art sequence-based DNA-binding predictors, the proposed iDBP-DEP achieved 1.8 % and 3.0 % improvements of accuracy (Acc) and Mathew's Correlation Coefficient (MCC), respectively, on PDB1075 dataset; 7.4 % and 14.8 % improvements of Acc and MCC, respectively, on PDB594",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA binding site prediction",
                    "uri": "http://edamontology.org/operation_3903"
                },
                {
                    "term": "DNA-binding protein prediction",
                    "uri": "http://edamontology.org/operation_3900"
                },
                {
                    "term": "RNA-binding protein prediction",
                    "uri": "http://edamontology.org/operation_3901"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Zll-codeside/iDBP-DEP",
    "lastUpdate": "2021-02-02T07:46:10Z",
    "name": "iDBP-DEP",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1002/MINF.202000006",
            "metadata": {
                "abstract": "© 2020 Wiley-VCH Verlag GmbH & Co. KGaA, WeinheimDNA-binding proteins play essential roles in many molecular functions and gene regulation. Therefore, it becomes highly desirable to develop effective computational techniques for detecting DNA-binding proteins. In this paper, we proposed a new method, iDBP-DEP, which performs DNA-binding prediction by using the discriminative feature derived from multi-view feature sources including evolutionary profile, dipeptide composition, and physicochemical properties with feature selection. We evaluated iDBP-DEP on two benchmark datasets, i. e., PDB1075 and PDB594 by rigorous Jackknife test. Compared with the state-of-the-art sequence-based DNA-binding predictors, the proposed iDBP-DEP achieved 1.8 % and 3.0 % improvements of accuracy (Acc) and Mathew's Correlation Coefficient (MCC), respectively, on PDB1075 dataset; 7.4 % and 14.8 % improvements of Acc and MCC, respectively, on PDB594. The independent validation test with PDB186 show that the proposed method achieved the best performances on Acc (80.1 %) and MCC (0.684), which further demonstrated the robustness of iDBP-DEP for the detection of DNA-binding proteins. Datasets and codes used in this study are freely available at https://githup.com/Zll-codeside/iDBP-DEP.",
                "authors": [
                    {
                        "name": "Song X."
                    },
                    {
                        "name": "Sun J."
                    },
                    {
                        "name": "Yu D.-J."
                    },
                    {
                        "name": "Zhou L."
                    }
                ],
                "citationCount": 2,
                "date": "2020-08-01T00:00:00Z",
                "journal": "Molecular Informatics",
                "title": "Sequence-based Detection of DNA-binding Proteins using Multiple-view Features Allied with Feature Selection"
            },
            "pmid": "32144887"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
