{
    "additionDate": "2021-01-18T12:01:00Z",
    "biotoolsCURIE": "biotools:argonaut",
    "biotoolsID": "argonaut",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "coon@wisc.edu",
            "name": "Joshua J. Coon",
            "typeEntity": "Person"
        },
        {
            "email": "shishkova@wisc.edu",
            "name": "Evgenia Shishkova",
            "typeEntity": "Person"
        }
    ],
    "description": "Argonaut is a web-based utility which facilitates collaborative exploration of Condition/Control-type mass spectrometry experiments. Spreadsheets of quantitative values can be uploaded and organized in a way that best describes your specific experimental setup. Brief statistical analysis is conducted on uploaded data to calculate the significance of molecular perturbations for each condition. These data can then be queried on-the-fly to conduct commonly conducted analyses inside the data portal, including volcano plots, GO enrichment, linear correlations, and others.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/coongroup/Argonaut"
        }
    ],
    "download": [
        {
            "type": "Container file",
            "url": "https://hub.docker.com/r/coonlabs/argonaut"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                }
            ]
        }
    ],
    "homepage": "https://hub.docker.com/r/coonlabs/argonaut",
    "language": [
        "JavaScript",
        "PHP"
    ],
    "lastUpdate": "2021-01-28T18:46:45Z",
    "link": [
        {
            "note": "Username: guest\nPassword: password",
            "type": [
                "Other"
            ],
            "url": "https://www.coonlabdatadev.com/"
        }
    ],
    "name": "Argonaut",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.PATTER.2020.100122",
            "metadata": {
                "abstract": "© 2020Researchers now generate large multi-omic datasets using increasingly mature mass spectrometry techniques at an astounding pace, facing new challenges of “Big Data” dissemination, visualization, and exploration. Conveniently, web-based data portals accommodate the complexity of multi-omic experiments and the many experts involved. However, developing these tailored companion resources requires programming expertise and knowledge of web server architecture—a substantial burden for most. Here, we describe Argonaut, a simple, code-free, and user-friendly platform for creating customizable, interactive data-hosting websites. Argonaut carries out real-time statistical analyses of the data, which it organizes into easily sharable projects. Collaborating researchers worldwide can explore the results, visualized through popular plots, and modify them to streamline data interpretation. Increasing the pace and ease of access to multi-omic data, Argonaut aims to propel discovery of new biological insights. We showcase the capabilities of this tool using a published multi-omics dataset on the large mitochondrial protease deletion collection. Modern systems biology experiments profile thousands of biomolecules across many experimental conditions to generate insights about the biological system. While data collection for these experiments can be routine, interpretation of the resultant datasets often requires interlaboratory collaboration of scientists with diverse expertise and is hindered by challenges inherent to sharing and exploring “Big Data.” We have developed Argonaut, a web-based platform purpose-built to accommodate large-scale, multi-omic experiments and to enable intuitive and interactive exploration of the associated data. Argonaut presents the experimental results in an online code-free environment, empowering both experts and non-experts worldwide to easily interact with and share the data. Our platform aims to streamline derivation of impactful experimental conclusions by overcoming the hurdles of working with large datasets and lowering the barrier to entry for biological and clinical collaborators. High-throughput biomolecule profiling experiments have become more routine as quantitative technologies come to maturity. However, challenges in interpreting and broadly disseminating the generated biological “Big Data” sets have not been comprehensively addressed. We have developed Argonaut, a simple, code-free, and user-friendly platform for creation of interactive data-hosting websites. Argonaut conducts real-time statistical analysis of measured biomolecules, visualizes data using popular plots, and can be securely shared with and explored by collaborators across the globe.",
                "authors": [
                    {
                        "name": "Brademan D.R."
                    },
                    {
                        "name": "Miller I.J."
                    },
                    {
                        "name": "Kwiecien N.W."
                    },
                    {
                        "name": "Pagliarini D.J."
                    },
                    {
                        "name": "Westphall M.S."
                    },
                    {
                        "name": "Coon J.J."
                    },
                    {
                        "name": "Shishkova E."
                    }
                ],
                "citationCount": 1,
                "date": "2020-10-09T00:00:00Z",
                "journal": "Patterns",
                "title": "Argonaut: A Web Platform for Collaborative Multi-omic Data Visualization and Exploration"
            },
            "pmcid": "PMC7641515",
            "pmid": "33154995"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Lipids",
            "uri": "http://edamontology.org/topic_0153"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ]
}