{"credit":[{"email":"yangxinyi@picb.ac.cn","name":"Xinyi YANG","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"url":"http://bioconductor.org/packages/release/bioc/html/SPEM.html"}],"download":[{"type":"Source code","url":"http://bioconductor/packages/release/bioc/src/contrib/SPEM_1.14.0.tar.gz"}],"function":[{"input":[{"data":{"term":"Gene expression data","uri":"http://edamontology.org/data_2603"},"format":[{"term":"TSV","uri":"http://edamontology.org/format_3475"}]}],"operation":[{"term":"Pathway or network prediction","uri":"http://edamontology.org/operation_3439"},{"term":"Molecular dynamics","uri":"http://edamontology.org/operation_2476"}],"output":[{"data":{"term":"Pathway or network","uri":"http://edamontology.org/data_2600"},"format":[{"term":"Biological pathway or network format","uri":"http://edamontology.org/format_2013"}]}]}],"labels":{"collectionID":["BioConductor"],"language":["R"],"license":"GPL-2.0","operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool","Library"],"topic":[{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"}]},"publication":[{"abstract":"Advances in experimental biology, coupled with advances in computational power, bring new challenges to the interdisciplinary field of computational biology. One such broad challenge lies in the reverse engineering of gene networks, and goes from determining the structure of static networks, to reconstructing the dynamics of interactions from time series data. Here, we focus our attention on the latter area, and in particular, on parameterizing a dynamic network of oriented interactions between genes. By basing the parameterizing approach on a known power-law relationship model between connected genes (S-system), we are able to account for non-linearity in the network, without compromising the ability to analyze network characteristics. In this article, we introduce the S-System Parameter Estimation Method (SPEM). SPEM, a freely available R software package (http://www.picb.ac.cn/ ClinicalGenomicNTW/temp3.html), takes gene expression data in time series and returns the network of interactions as a set of differential equations. The methods, which are presented and tested here, are shown to provide accurate results not only on synthetic data, but more importantly on real and therefore noisy by nature, biological data. In summary, SPEM shows high sensitivity and positive predicted values, as well as free availability and expansibility (because based on open source software). We expect these characteristics to make it a useful and broadly applicable software in the challenging reconstruction of dynamic gene networks. © 2012 Mary Ann Liebert, Inc.","authors":["Yang X.","Dent J.E.","Nardini C."],"cit_count":13,"doi":"10.1089/cmb.2011.0269","journal":"Journal of Computational Biology","title":"An S-System Parameter Estimation Method (SPEM) for biological networks","type":"Primary","year":"2012-02-01"}],"summary":{"biotoolsCURIE":"biotools:spem","biotoolsID":"spem","description":"This package can optimize the parameter in S-system models given time series data.","homepage":"http://bioconductor.org/packages/release/bioc/html/SPEM.html","name":"SPEM","version":["1.14.0"]}}