{
    "additionDate": "2024-04-18T13:12:26.515271Z",
    "biotoolsCURIE": "biotools:sno_dca",
    "biotoolsID": "sno_dca",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jjh163yx@163.com",
            "name": "Jianhua Jia",
            "typeEntity": "Person"
        }
    ],
    "description": "A model for predicting S-nitrosylation sites based on densely connected convolutional networks and attention mechanism.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "https://sno.cangmang.xyz/SNO-DCA",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-04-18T13:12:26.517501Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/peanono/SNO-DCA"
        }
    ],
    "name": "SNO-DCA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.HELIYON.2023.E23187",
            "metadata": {
                "abstract": "Protein S-nitrosylation is a reversible oxidative reduction post-translational modification that is widely present in the biological community. S-nitrosylation can regulate protein function and is closely associated with a variety of diseases, thus identifying S-nitrosylation sites are crucial for revealing the function of proteins and related drug discovery. Traditional experimental methods are time-consuming and expensive; therefore, it is necessary to explore more efficient computational methods. Deep learning algorithms perform well in the field of bioinformatics sites prediction, and many studies show that they outperform existing machine learning algorithms. In this work, we proposed a deep learning algorithm-based predictor SNO-DCA for distinguishing between S-nitrosylated and non-S-nitrosylated sequences. First, one-hot encoding of protein sequences was performed. Second, the dense convolutional blocks were used to capture feature information, and an attention module was added to weigh different features to improve the prediction ability of the model. The 10-fold cross-validation and independent testing experimental results show that our SNO-DCA model outperforms existing S-nitrosylation sites prediction models under imbalanced data. In this paper, a web server prediction website: https://sno.cangmang.xyz/SNO-DCA/was established to provide an online prediction service for users. SNO-DCA can be available at https://github.com/peanono/SNO-DCA.",
                "authors": [
                    {
                        "name": "Jia J."
                    },
                    {
                        "name": "Lv P."
                    },
                    {
                        "name": "Qiu W."
                    },
                    {
                        "name": "Wei X."
                    }
                ],
                "date": "2024-01-15T00:00:00Z",
                "journal": "Heliyon",
                "title": "SNO-DCA: A model for predicting S-nitrosylation sites based on densely connected convolutional networks and attention mechanism"
            },
            "pmcid": "PMC10750070",
            "pmid": "38148797"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Protein sites, features and motifs",
            "uri": "http://edamontology.org/topic_3510"
        }
    ]
}
