{
    "accessibility": [],
    "additionDate": "2017-02-10T14:15:41Z",
    "biotoolsCURIE": "biotools:nast",
    "biotoolsID": "nast",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [],
    "description": "Multiple sequence alignment server for comparative analysis of 16S rRNA gene sequences from bacteria and archaea.",
    "documentation": [],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                },
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                },
                {
                    "term": "Sequence alignment analysis",
                    "uri": "http://edamontology.org/operation_0258"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://greengenes.lbl.gov/cgi-bin/nph-NAST_align.cgi",
    "homepage_status": 1,
    "language": [],
    "lastUpdate": "2018-12-10T12:58:40Z",
    "license": null,
    "link": [],
    "maturity": null,
    "name": "NAST",
    "operatingSystem": [],
    "otherID": [],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": null,
            "metadata": {
                "abstract": "Motivation: Prokaryotic organisms have been identified utilizing the sequence variation of the 16S rRNA gene. Variations steer the design of DNA probes for the detection of taxonomic groups or specific organisms. The long-term goal of our project is to create probe arrays capable of identifying 16S rDNA sequences in unknown samples. This necessitated the authentication, categorization and alignment of the >75000 publicly available '16S' sequences. Preferably, the entire process should be computationally administrated so the aligned collection could periodically absorb 16S rDNA sequences from the public records. A complete multiple sequence alignment would provide a foundation for computational probe selection and facilitates microbial taxonomy and phylogeny. Results: Here we report the alignment and similarity clustering of 62 662 16S rDNA sequences and an approach for designing effective probes for each cluster. A novel alignment compression algorithm, NAST (Nearest Alignment Space Termination), was designed to produce the uniform multiple sequence alignment referred to as the prokMSA. From the prokMSA, 9020 Operational Taxonomic Units (OTUs) were found based on transitive sequence similarities. An automated approach to probe design was straightforward using the prokMSA clustered into OTUs. As a test case, multiple probes were computationally picked for each of the 27 OTUs that were identified within the Staphylococcus Group. The probes were incorporated into a customized microarray and were able to correctly categorize Staphylococcus aureus and Bacillus anthracis into their correct OTUs. Although a successful probe picking strategy is outlined, the main focus of creating the prokMSA was to provide a comprehensive, categorized, updateable 16S rDNA collection useful as a foundation for any probe selection algorithm.",
                "authors": [
                    {
                        "name": "DeSantis T.Z."
                    },
                    {
                        "name": "Dubosarskiy I."
                    },
                    {
                        "name": "Murray S.R."
                    },
                    {
                        "name": "Andersen G.L."
                    }
                ],
                "citationCount": 88,
                "date": "2003-08-12T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Comprehensive aligned sequence construction for automated design of effective probes (CASCADE-P) using 16S rDNA"
            },
            "note": null,
            "pmcid": null,
            "pmid": "12912825",
            "type": null,
            "version": null
        },
        {
            "doi": null,
            "metadata": {
                "abstract": "Microbiologists conducting surveys of bacterial and archaeal diversity often require comparative alignments of thousands of 16S rRNA genes collected from a sample. The computational resources and bioinformatics expertise required to construct such an alignment has inhibited high-throughput analysis. It was hypothesized that an online tool could be developed to efficiently align thousands of 16S rRNA genes via the NAST (Nearest Alignment Space Termination) algorithm for creating multiple sequence alignments (MSA). The tool was implemented with a web-interface at http://greengenes.lbl.gov/NAST. Each user-submitted sequence is compared with Greengenes' 'Core Set' ∼10 000 aligned non-chimeric sequences representative of the currently recognized diversity among bacteria and archaea. User sequences are oriented and paired with their closest match in the Core Set to serve as a template for inserting gap characters. Non-16S data (sequence from vector or surrounding genomic regions) are conveniently removed in the returned alignment. From the resulting MSA, distance matrices can be calculated for diversity estimates and organisms can be classified by taxonomy. The ability to align and categorize large sequence sets using a simple interface has enabled researchers with various experience levels to obtain bacterial and archaeal community profiles. © The Author 2006. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "DeSantis T.Z."
                    },
                    {
                        "name": "Hugenholtz P."
                    },
                    {
                        "name": "Keller K."
                    },
                    {
                        "name": "Brodie E.L."
                    },
                    {
                        "name": "Larsen N."
                    },
                    {
                        "name": "Piceno Y.M."
                    },
                    {
                        "name": "Phan R."
                    },
                    {
                        "name": "Andersen G.L."
                    }
                ],
                "citationCount": 711,
                "date": "2006-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "NAST: A multiple sequence alignment server for comparative analysis of 16S rRNA genes"
            },
            "note": null,
            "pmcid": null,
            "pmid": "16845035",
            "type": null,
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        }
    ],
    "validated": 1,
    "version": []
}