{
    "additionDate": "2020-01-09T17:50:39Z",
    "biotoolsCURIE": "biotools:APAatlas",
    "biotoolsID": "APAatlas",
    "confidence_flag": "tool",
    "description": "decoding alternative polyadenylation across human tissues.\n\nThe APA atlas refers to \" A lternative P oly A denylation atlas in human tissues\". Widespread alternative polyadenylation (APA) occurs during cell proliferation and differentiation, exhibits strong tissue specificity. Recent studies have highlighted the important role of APA in transcription regulation. Here we systematically characterize APA profile in 9,475 samples across 53 human tissues from Genotype-Tissue Expression (GTEx) project with two algorisms, and analyzed the association between APA events with traits and mRNA expression. These APA events may uncover novel mechanisms for the transcription regulation, development of tissues and phenotypes",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://hanlab.uth.edu/apa/",
    "lastUpdate": "2024-11-24T20:57:15.212757Z",
    "name": "APAatlas",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/nar/gkz876",
            "metadata": {
                "abstract": "Alternative polyadenylation (APA) is an RNA-processing mechanism on the 3′ terminus that generates distinct isoforms of mRNAs and/or other RNA polymerase II transcripts with different 3′UTR lengths. Widespread APA affects post-transcriptional gene regulation in mRNA translation, stability, and localization, and exhibits strong tissue specificity. However, no existing database provides comprehensive information about APA events in a large number of human normal tissues. Using the RNA-seq data from the Genotype-Tissue Expression project, we systematically identified APA events from 9475 samples across 53 human tissues and examined their associations with multiple traits and gene expression across tissues. We further developed APAatlas, a user-friendly database (https://hanlab.uth.edu/apa/) for searching, browsing and downloading related information. APAatlas will help the biomedical research community elucidate the functions and mechanisms of APA events in human tissues.",
                "authors": [
                    {
                        "name": "Diao L."
                    },
                    {
                        "name": "Han L."
                    },
                    {
                        "name": "Hong W."
                    },
                    {
                        "name": "Jing Y."
                    },
                    {
                        "name": "Li S."
                    },
                    {
                        "name": "Liang H."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Ruan H."
                    },
                    {
                        "name": "Ye Y."
                    },
                    {
                        "name": "Zhang H."
                    },
                    {
                        "name": "Zhang Z."
                    }
                ],
                "citationCount": 37,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "APAatlas: Decoding alternative polyadenylation across human tissues"
            },
            "pmcid": "PMC6943053",
            "pmid": "31586392"
        }
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
