
{
    "credit": [
        {
            "email": "cgvieira@ibmc.up.pt",
            "name": "Cristina P. Vieira",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "mrjato@uvigo.es",
            "name": "Miguel Reboiro-Jato",
            "typeEntity": "Person",
            "typeRoles": [
                "Developer"
            ]
        },
        {
            "email": "hlfernandez@uvigo.es",
            "name": "Hugo López-Fernández",
            "typeEntity": "Person",
            "typeRoles": [
                "Developer"
            ]
        },
        {
            "email": "nvazquezg@gmail.com",
            "name": "Noé Vázquez",
            "typeEntity": "Person",
            "typeRoles": [
                "Developer"
            ]
        },
        {
            "email": "jbvieira@ibmc.up.pt",
            "name": "Jorge Vieira",
            "typeEntity": "Person",
            "typeRoles": [
                "Contributor"
            ]
        },
        {
            "email": "riverola@uvigo.es",
            "name": "Florentino Fdez-Riverola",
            "typeEntity": "Person",
            "typeRoles": [
                "Contributor"
            ]
        },
        {
            "name": "Instituto de Investigação e Inovação em Saúde (i3S)",
            "typeEntity": "Institute",
            "typeRoles": [
            ],
            "url": "https://www.i3s.up.pt/"
        },
        {
            "name": "Instituto de Biologia Molecular e Celular (IBMC)",
            "typeEntity": "Institute",
            "typeRoles": [
            ],
            "url": "https://www.ibmc.up.pt/"
        },
        {
            "name": "Universidade de Vigo",
            "typeEntity": "Institute",
            "typeRoles": [
            ],
            "url": "https://www.uvigo.gal/en"
        },
        {
            "name": "Centro de Investigaciones Biomédicas (CINBIO)",
            "typeEntity": "Institute",
            "typeRoles": [
            ],
            "url": "http://cinbio.es/en/portada-en/"
        },
        {
            "name": "Instituto de Investigación Sanitaria Galicia Sur (IISGS)",
            "typeEntity": "Institute",
            "typeRoles": [
            ],
            "url": "http://www.iisgaliciasur.es/?lang=en"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Gene identifier",
                        "uri": "http://edamontology.org/data_1025"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "labels": {
        "accessibility": [
            "Open access"
        ],
        "elixirNode": [
            "Portugal"
        ],
        "elixirPlatform": [
            "Data"
        ],
        "maturity": "Mature",
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Protein interactions",
                "uri": "http://edamontology.org/topic_0128"
            }
        ]
    },
    "link": [
        {
            "note": "EvoPPI frontend",
            "type": "REPOSITORY",
            "url": "https://github.com/sing-group/evoppi-frontend"
        },
        {
            "note": "EvoPPI backend",
            "type": "REPOSITORY",
            "url": "https://github.com/sing-group/evoppi-backend"
        }
    ],
    "publication": [
        {
            "abstract": "© 2019, International Association of Scientists in the Interdisciplinary Areas.Protein–protein interaction (PPI) data is essential to elucidate the complex molecular relationships in living systems, and thus understand the biological functions at cellular and systems levels. The complete map of PPIs that can occur in a living organism is called the interactome. For animals, PPI data is stored in multiple databases (e.g., BioGRID, CCSB, DroID, FlyBase, HIPPIE, HitPredict, HomoMINT, INstruct, Interactome3D, mentha, MINT, and PINA2) with different formats. This makes PPI comparisons difficult to perform, especially between species, since orthologous proteins may have different names. Moreover, there is only a partial overlap between databases, even when considering a single species. The EvoPPI (http://evoppi.i3s.up.pt) web application presented in this paper allows comparison of data from the different databases at the species level, or between species using a BLAST approach. We show its usefulness by performing a comparative study of the interactome of the nine polyglutamine (polyQ) disease proteins, namely androgen receptor (AR), atrophin-1 (ATN1), ataxin 1 (ATXN1), ataxin 2 (ATXN2), ataxin 3 (ATXN3), ataxin 7 (ATXN7), calcium voltage-gated channel subunit alpha1 A (CACNA1A), Huntingtin (HTT), and TATA-binding protein (TBP). Here we show that none of the human interactors of these proteins is common to all nine interactomes. Only 15 proteins are common to at least 4 of these polyQ disease proteins, and 40% of these are involved in ubiquitin protein ligase-binding function. The results obtained in this study suggest that polyQ disease proteins are involved in different functional networks. Comparisons with Mus musculus PPIs are also made for AR and TBP, using EvoPPI BLAST search approach (a unique feature of EvoPPI), with the goal of understanding why there is a significant excess of common interactors for these proteins in humans.",
            "authors": [
                "Vazquez N.",
                "Rocha S.",
                "Lopez-Fernandez H.",
                "Torres A.",
                "Camacho R.",
                "Fdez-Riverola F.",
                "Vieira J.",
                "Vieira C.P.",
                "Reboiro-Jato M."
            ],
            "cit_count": 0,
            "doi": "10.1007/s12539-019-00317-y",
            "journal": "Interdisciplinary Sciences: Computational Life Sciences",
            "title": "EvoPPI 1.0: a Web Platform for Within- and Between-Species Multiple Interactome Comparisons and Application to Nine PolyQ Proteins Determining Neurodegenerative Diseases",
            "type": "Primary",
            "year": "2019-03-01"
        },
        {
            "abstract": "© Springer Nature Switzerland AG 2019.Biological processes are mediated by protein-protein interactions (PPI) that have been studied using different methodologies, and organized as centralized repositories - PPI databases. The data stored in the different PPI databases only overlaps partially. Moreover, some of the repositories are dedicated to a species or subset of species, not all have the same functionalities, or store data in the same format, making comparisons between different databases difficult to perform. Therefore, here we present EvoPPI (http://evoppi.i3s.up.pt), an open source web application tool that allows users to compare the protein interactions reported in two different interactomes. When interactomes belong to different species, a versatile BLAST search approach is used to identify orthologous/paralogous genes, which to our knowledge is a unique feature of EvoPPI.",
            "authors": [
                "Vazquez N.",
                "Rocha S.",
                "Lopez-Fernandez H.",
                "Torres A.",
                "Camacho R.",
                "Fdez-Riverola F.",
                "Vieira J.",
                "Vieira C.P.",
                "Reboiro-Jato M."
            ],
            "cit_count": 0,
            "doi": "10.1007/978-3-319-98702-6_18",
            "journal": "Advances in Intelligent Systems and Computing",
            "title": "EvoPPI: A web application to compare protein-protein interactions (PPIs) from different databases and species",
            "type": "Primary",
            "year": "2019-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:EvoPPI",
        "biotoolsID": "EvoPPI",
        "description": "EvoPPI allows the easy comparison of publicly available data from the main Protein-Protein Interaction (PPI) databases for the same and distinct species.",
        "homepage": "http://evoppi.i3s.up.pt/",
        "name": "EvoPPI"
    }
}