{
    "additionDate": "2021-09-27T08:16:42.507895Z",
    "biotoolsCURIE": "biotools:matsas",
    "biotoolsID": "matsas",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "amirsaman.rezaeyan@gmail.com",
            "name": "Amirsaman Rezaeyan",
            "orcidid": "https://orcid.org/0000-0002-5608-8115",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "MATSAS is a package of programs that analyse small angle scattering of neutrons and X-rays data obtained from porous systems. MATSAS has initially been developed for sedimentary rocks but can be used for other microstructures such as biological macromolecules, composite nanomaterials, or polymers.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Scatter plot plotting",
                    "uri": "http://edamontology.org/operation_2940"
                }
            ]
        }
    ],
    "homepage": "https://github.com/matsas-software/MATSAS",
    "language": [
        "MATLAB",
        "SAS"
    ],
    "lastUpdate": "2021-09-27T08:16:42.511302Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/matsas-software/MATSAS/issues"
        }
    ],
    "name": "MATSAS",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1107/S1600576721000674",
            "metadata": {
                "abstract": "© 2021 International Union of Crystallography. All rights reserved.MATSAS is a script-based MATLAB program for analysis of X-ray and neutron small-angle scattering (SAS) data obtained from various facilities. The program has primarily been developed for sedimentary rock samples but is equally applicable to other porous media. MATSAS imports raw SAS data from.xls(x) or.csv files, combines small-angle and very small angle scattering data, subtracts the sample background, and displays the processed scattering curves in log-log plots. MATSAS uses the polydisperse spherical (PDSP) model to obtain structural information on the scatterers (scattering objects); for a porous system, the results include specific surface area (SSA), porosity (Φ), and differential and logarithmic differential pore area/volume distributions. In addition, pore and surface fractal dimensions (D p and D s, respectively) are obtained from the scattering profiles. The program package allows simultaneous and rapid analysis of a batch of samples, and the results are then exported to.xlsx and.csv files with separate spreadsheets for individual samples. MATSAS is the first SAS program that delivers a full suite of pore characterizations for sedimentary rocks. MATSAS is an open-source package and is freely available at GitHub (https://github.com/matsas-software/MATSAS).",
                "authors": [
                    {
                        "name": "Rezaeyan A."
                    },
                    {
                        "name": "Pipich V."
                    },
                    {
                        "name": "Busch A."
                    }
                ],
                "date": "2021-04-01T00:00:00Z",
                "journal": "Journal of Applied Crystallography",
                "title": "MATSAS: A small-angle scattering computing tool for porous systems"
            },
            "pmcid": "PMC8056760",
            "pmid": "33953661",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Neutron diffraction",
            "uri": "http://edamontology.org/topic_3448"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Data acquisition",
            "uri": "http://edamontology.org/topic_3077"
        }
    ]
}