{
    "additionDate": "2024-07-24T11:13:46.468561Z",
    "biotoolsCURIE": "biotools:hnscpred",
    "biotoolsID": "hnscpred",
    "credit": [
        {
            "email": "raghava@iiitd.ac.in",
            "name": "Dr. Gajendra P. S. Raghava",
            "url": "https://webs.iiitd.edu.in/raghava/"
        }
    ],
    "description": "HNSCPred - A Package To Predict Head and Neck Squamous Cell Carcinoma Using Single Cell Data",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://webs.iiitd.edu.in/raghava/hnscpred/",
    "lastUpdate": "2024-11-24T13:49:57.649614Z",
    "link": [
        {
            "type": [
                "Service"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/hnscpred/"
        }
    ],
    "name": "HNSCPred",
    "owner": "raghavagps",
    "publication": [
        {
            "doi": "10.3389/fmolb.2024.1395721",
            "metadata": {
                "abstract": "Background: Head and Neck Squamous Cell Carcinoma (HNSCC) is the seventh most highly prevalent cancer type worldwide. Early detection of HNSCC is one of the important challenges in managing the treatment of the cancer patients. Existing techniques for detecting HNSCC are costly, expensive, and invasive in nature. Methods: In this study, we aimed to address this issue by developing classification models using machine learning and deep learning techniques, focusing on single-cell transcriptomics to distinguish between HNSCC and normal samples. Furthermore, we built models to classify HNSCC samples into HPV-positive (HPV+) and HPV-negative (HPV−) categories. In this study, we have used GSE181919 dataset, we have extracted 20 primary cancer (HNSCC) samples, and 9 normal tissues samples. The primary cancer samples contained 13 HPV− and 7 HPV+ samples. The models developed in this study have been trained on 80% of the dataset and validated on the remaining 20%. To develop an efficient model, we performed feature selection using mRMR method to shortlist a small number of genes from a plethora of genes. We also performed Gene Ontology (GO) enrichment analysis on the 100 shortlisted genes. Results: Artificial Neural Network based model trained on 100 genes outperformed the other classifiers with an AUROC of 0.91 for HNSCC classification for the validation set. The same algorithm achieved an AUROC of 0.83 for the classification of HPV+ and HPV− patients on the validation set. In GO enrichment analysis, it was found that most genes were involved in binding and catalytic activities. Conclusion: A software package has been developed in Python which allows users to identify HNSCC in patients along with their HPV status. It is available at https://webs.iiitd.edu.in/raghava/hnscpred/.",
                "authors": [
                    {
                        "name": "Arora A."
                    },
                    {
                        "name": "Dhall A."
                    },
                    {
                        "name": "Jarwal A."
                    },
                    {
                        "name": "Patiyal S."
                    },
                    {
                        "name": "Raghava G.P.S."
                    },
                    {
                        "name": "Srivastava A."
                    }
                ],
                "date": "2024-01-01T00:00:00Z",
                "journal": "Frontiers in Molecular Biosciences",
                "title": "A deep learning method for classification of HNSCC and HPV patients using single-cell transcriptomics"
            },
            "pmid": "38872916"
        }
    ]
}
