{
    "additionDate": "2017-08-03T18:53:49Z",
    "biotoolsCURIE": "biotools:pcscs",
    "biotoolsID": "pcscs",
    "credit": [
        {
            "email": "msw@usc.edu",
            "name": "Dr. Michael S. Waterman",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://meta.cmb.usc.edu/d2/"
        }
    ],
    "description": "Theoretical power calculator for D2 and D2*. The sofware facilitates the use of D2 or D2* for sequence or genome comparison and for evaluation of statistical power for detecting the relationship between the sequences.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://meta.cmb.usc.edu/d2/doc/help.htm"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Comparison",
                    "uri": "http://edamontology.org/operation_2424"
                }
            ]
        }
    ],
    "homepage": "http://meta.cmb.usc.edu/d2/",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/pcscs-power-calculator-sequence-comparison-statistic.html"
        }
    ],
    "name": "PCSCS",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Rapid methods for alignment-free sequence comparison make large-scale comparisons between sequences increasingly feasible. Here we study the power of the statistic D2, which counts the number of matching k-tuples between two sequences, as well as D2 *, which uses centralized counts, and D2 S, which is a self-standardized version, both from a theoretical viewpoint and numerically, providing an easy to use program. The power is assessed under two alternative hidden Markov models; the first one assumes that the two sequences share a common motif, whereas the second model is a pattern transfer model; the null model is that the two sequences are composed of independent and identically distributed letters and they are independent. Under the first alternative model, the means of the tuple counts in the individual sequences change, whereas under the second alternative model, the marginal means are the same as under the null model. Using the limit distributions of the count statistics under the null and the alternative models, we find that generally, asymptotically D2 S has the largest power, followed by D2 *, whereas the power of D2 can even be zero in some cases. In contrast, even for sequences of length 140,000 bp, in simulations D2 * generally has the largest power. Under the first alternative model of a shared motif, the power of D2 * approaches 100% when sufficiently many motifs are shared, and we recommend the use of D2 * for such practical applications. Under the second alternative model of pattern transfer, the power for all three count statistics does not increase with sequence length when the sequence is sufficiently long, and hence none of the three statistics under consideration can be recommended in such a situation. We illustrate the approach on 323 transcription factor binding motifs with length at most 10 from JASPAR CORE (October 12, 2009 version), verifying that D2 * is generally more powerful than D2. The program to calculate the power of D2, D 2 * and D2 S can be downloaded from http://meta.cmb.usc.edu/d2. Supplementary Material is available at www.liebertonline.com/cmb. Copyright 2010, Mary Ann Liebert, Inc.",
                "authors": [
                    {
                        "name": "Wan L."
                    },
                    {
                        "name": "Reinert G."
                    },
                    {
                        "name": "Sun F."
                    },
                    {
                        "name": "Waterman M.S."
                    }
                ],
                "citationCount": 51,
                "date": "2010-11-01T00:00:00Z",
                "journal": "Journal of Computational Biology",
                "title": "Alignment-free sequence comparison (II): Theoretical power of comparison statistics"
            },
            "pmid": "20973742"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Data quality management",
            "uri": "http://edamontology.org/topic_3572"
        }
    ],
    "validated": 1
}