{
    "additionDate": "2017-08-03T19:02:10Z",
    "biotoolsCURIE": "biotools:structurelab",
    "biotoolsID": "structurelab",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://binkley2.ncifcrf.gov/users/bshapiro/group.html"
        }
    ],
    "description": "A computational system which has been developed to permit the use of a broad array of approaches to the analysis of the structure of RNA. The goal of the development is to provide a large set of tools that can be well integrated with experimental biology to aid in the process of the determination of the underlying structure of RNA sequences.",
    "documentation": [
        {
            "type": "General",
            "url": "https://binkley2.ncifcrf.gov/users/bshapiro/software.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid sequence analysis",
                    "uri": "http://edamontology.org/operation_2478"
                }
            ]
        }
    ],
    "homepage": "https://binkley2.ncifcrf.gov/users/bshapiro/structurelab/structureLab.html",
    "language": [
        "Lisp"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/structurelab-4-5-0-rna-structure-analysis.html"
        }
    ],
    "name": "StructureLab",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "STRUCTURELAB is a computational system that has been developed to permit the use of a broad array of approaches for the analysis of the structure of RNA. The goal of the development is to provide a large set of tools that can be well integrated with experimental biology to aid in the process of the determination of the underlying structure of RNA sequences. The approach taken views the structure determination problem as one of dealing with a database of many computationally generated structures and provides the capability to analyze this data set from different perspectives. Many algorithms are integrated into one system that also utilizes a heterogeneous computing approach permitting the use of several computer architectures to help solve the posed problems. These different computational platforms make it relatively easy to incorporate currently existing programs as well as newly developed algorithms and to best match these algorithms to the appropriate hardware. The system has been written in Common Lisp running on SUN or SGI Unix workstations, and it utilizes a network of participating machines defined in reconfigurable tables. A window-based interface makes this heterogeneous environment as transparent to the user as possible.",
                "authors": [
                    {
                        "name": "Shapiro B.A."
                    },
                    {
                        "name": "Kasprzak W."
                    }
                ],
                "citationCount": 27,
                "date": "1996-08-01T00:00:00Z",
                "journal": "Journal of Molecular Graphics",
                "title": "STRUCTURELAB: A heterogeneous bioinformatics system for RNA structure analysis"
            },
            "pmid": "9076633"
        }
    ],
    "toolType": [
        "Suite"
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        }
    ],
    "validated": 1
}