{
    "additionDate": "2022-01-10T13:34:47.946004Z",
    "biotoolsCURIE": "biotools:ckd",
    "biotoolsID": "ckd",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "DONGY@yuhs.ac",
            "name": "Dongwoo Chae",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "KIMSY326@yuhs.ac",
            "name": "So Yeon Kim",
            "orcidid": "https://orcid.org/0000-0001-5352-157X",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "jiangyanxiancu@outlook.com",
            "name": "Yanxia Jiang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A predictive models for chronic kidney disease after radical or partial nephrectomy in renal cell cancer using early postoperative serum creatinine levels. An easy-to-operate web-based calculator for predicting the progression of chronic kidney disease.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Incident curve plotting",
                    "uri": "http://edamontology.org/operation_3503"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://dongy.shinyapps.io/aki_ckd",
    "lastUpdate": "2022-01-10T13:34:47.948699Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://ncutool.shinyapps.io/CKDprogression/"
        }
    ],
    "name": "CKD",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12967-021-02976-2",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Several predictive factors for chronic kidney disease (CKD) following radical nephrectomy (RN) or partial nephrectomy (PN) have been identified. However, early postoperative laboratory values were infrequently considered as potential predictors. Therefore, this study aimed to develop predictive models for CKD 1 year after RN or PN using early postoperative laboratory values, including serum creatinine (SCr) levels, in addition to preoperative and intraoperative factors. Moreover, the optimal SCr sampling time point for the best prediction of CKD was determined. Methods: Data were retrospectively collected from patients with renal cell cancer who underwent laparoscopic or robotic RN (n = 557) or PN (n = 999). Preoperative, intraoperative, and postoperative factors, including laboratory values, were incorporated during model development. We developed 8 final models using information collected at different time points (preoperative, postoperative day [POD] 0 to 5, and postoperative 1 month). Lastly, we combined all possible subsets of the developed models to generate 120 meta-models. Furthermore, we built a web application to facilitate the implementation of the model. Results: The magnitude of postoperative elevation of SCr and history of CKD were the most important predictors for CKD at 1 year, followed by RN (compared to PN) and older age. Among the final models, the model using features of POD 4 showed the best performance for correctly predicting the stages of CKD at 1 year compared to other models (accuracy: 79% of POD 4 model versus 75% of POD 0 model, 76% of POD 1 model, 77% of POD 2 model, 78% of POD 3 model, 76% of POD 5 model, and 73% in postoperative 1 month model). Therefore, POD 4 may be the optimal sampling time point for postoperative SCr. A web application is hosted at https://dongy.shinyapps.io/aki_ckd. Conclusions: Our predictive model, which incorporated postoperative laboratory values, especially SCr levels, in addition to preoperative and intraoperative factors, effectively predicted the occurrence of CKD 1 year after RN or PN and may be helpful for comprehensive management planning.",
                "authors": [
                    {
                        "name": "Chae D."
                    },
                    {
                        "name": "Kim N.Y."
                    },
                    {
                        "name": "Kim K.J."
                    },
                    {
                        "name": "Park K."
                    },
                    {
                        "name": "Oh C."
                    },
                    {
                        "name": "Kim S.Y."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "Journal of Translational Medicine",
                "title": "Predictive models for chronic kidney disease after radical or partial nephrectomy in renal cell cancer using early postoperative serum creatinine levels"
            },
            "pmcid": "PMC8283951",
            "pmid": "34271916",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1186/S12967-021-02942-Y",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: This study aimed to establish and validate an easy-to-operate novel scoring system based on simple and readily available clinical indices for predicting the progression of chronic kidney disease (CKD). Methods: We retrospectively evaluated 1045 eligible CKD patients from a publicly available database. Factors included in the model were determined by univariate and multiple Cox proportional hazard analyses based on the training set. Results: Independent prognostic factors including etiology, hemoglobin level, creatinine level, proteinuria, and urinary protein/creatinine ratio were determined and contained in the model. The model showed good calibration and discrimination. The area under the curve (AUC) values generated to predict 1-, 2-, and 3-year progression-free survival in the training set were 0.947, 0.931, and 0.939, respectively. In the validation set, the model still revealed excellent calibration and discrimination, and the AUC values generated to predict 1-, 2-, and 3-year progression-free survival were 0.948, 0.933, and 0.915, respectively. In addition, decision curve analysis demonstrated that the model was clinically beneficial. Moreover, to visualize the prediction results, we established a web-based calculator (https://ncutool.shinyapps.io/CKDprogression/). Conclusion: An easy-to-operate model based on five relevant factors was developed and validated as a conventional tool to assist doctors with clinical decision-making and personalized treatment.",
                "authors": [
                    {
                        "name": "Xu Q."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Fang Y."
                    },
                    {
                        "name": "Feng S."
                    },
                    {
                        "name": "Chen C."
                    },
                    {
                        "name": "Jiang Y."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "Journal of Translational Medicine",
                "title": "An easy-to-operate web-based calculator for predicting the progression of chronic kidney disease"
            },
            "pmcid": "PMC8254928",
            "pmid": "34217324"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Urology and nephrology",
            "uri": "http://edamontology.org/topic_3422"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        }
    ]
}