{
    "additionDate": "2019-11-14T18:42:33Z",
    "biotoolsCURIE": "biotools:informer",
    "biotoolsID": "informer",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "newton@stat.wisc.edu",
            "name": "Michael A. Newton",
            "orcidid": "https://orcid.org/0000-0001-9038-878X",
            "typeEntity": "Person"
        }
    ],
    "description": "Predicting kinase inhibitors using bioactivity matrix derived informer sets | This repository implements in Matlab the Regression Selection method described in \"Zhang, Huikun, Lee, Ching-pei, Ericksen, Spencer S., Mason, Blake J., Wlodarchak, Nathan, Mitchell, Julie C., Wildman, Scott A., Wright, Stephen J., Nowak, Robert, Gitter, Anthony, Hoffman, F. Michael, and Newton, Michael A. Minimally-supervised, chemogenomic strategies for effective compound prioritization on kinases.\" | This repository implements two experiments described in the manuscript: | Training a single model for prediction on new kinases | Conducting leave-one-out cross-validation and outputing the final leave-one-out prediction on each input kinase",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/leepei/informer",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2020-12-14T12:28:54Z",
    "license": "Unlicense",
    "name": "Informer",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1006813",
            "metadata": {
                "abstract": "© 2019 Zhang et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Prediction of compounds that are active against a desired biological target is a common step in drug discovery efforts. Virtual screening methods seek some active-enriched fraction of a library for experimental testing. Where data are too scarce to train supervised learning models for compound prioritization, initial screening must provide the necessary data. Commonly, such an initial library is selected on the basis of chemical diversity by some pseudo-random process (for example, the first few plates of a larger library) or by selecting an entire smaller library. These approaches may not produce a sufficient number or diversity of actives. An alternative approach is to select an informer set of screening compounds on the basis of chemogenomic information from previous testing of compounds against a large number of targets. We compare different ways of using chemogenomic data to choose a small informer set of compounds based on previously measured bioactivity data. We develop this Informer-Based-Ranking (IBR) approach using the Published Kinase Inhibitor Sets (PKIS) as the chemogenomic data to select the informer sets. We test the informer compounds on a target that is not part of the chemogenomic data, then predict the activity of the remaining compounds based on the experimental informer data and the chemogenomic data. Through new chemical screening experiments, we demonstrate the utility of IBR strategies in a prospective test on three kinase targets not included in the PKIS.",
                "authors": [
                    {
                        "name": "Ananiev G.E."
                    },
                    {
                        "name": "Ericksen S.S."
                    },
                    {
                        "name": "Gitter A."
                    },
                    {
                        "name": "Hoffmann F.M."
                    },
                    {
                        "name": "Lee C.-P."
                    },
                    {
                        "name": "Mitchell J.C."
                    },
                    {
                        "name": "Newton M.A."
                    },
                    {
                        "name": "Wildman S.A."
                    },
                    {
                        "name": "Wlodarchak N."
                    },
                    {
                        "name": "Wright S.J."
                    },
                    {
                        "name": "Yu P."
                    },
                    {
                        "name": "Zhang H."
                    }
                ],
                "citationCount": 5,
                "date": "2019-01-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Predicting kinase inhibitors using bioactivity matrix derived informer sets"
            },
            "pmcid": "PMC6695194",
            "pmid": "31381559"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Compound libraries and screening",
            "uri": "http://edamontology.org/topic_3343"
        },
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
