{
    "additionDate": "2021-03-19T08:40:09Z",
    "biotoolsCURIE": "biotools:egygene-gelanalyzer4",
    "biotoolsID": "egygene-gelanalyzer4",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "egynouh@agr.asu.edu.eg",
            "name": "N. E. Ahmed",
            "typeEntity": "Person"
        }
    ],
    "description": "EgyGene GelAnalyzer4 is a powerful image analysis software for one-dimensional gel electrophoresis.",
    "download": [
        {
            "type": "Downloads page",
            "url": "https://drive.google.com/file/d/18t8cBse8tmYsx2Ht-4ONhUYOzx-aS_57/view?usp=sharing"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Phylogenetic inference",
                    "uri": "http://edamontology.org/operation_0323"
                },
                {
                    "term": "Phylogenetic tree editing",
                    "uri": "http://edamontology.org/operation_0326"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://egygenes.blogspot.com/p/egygene-gelanalyzer4.html",
    "lastUpdate": "2021-04-10T12:46:51.261760Z",
    "name": "EgyGene GelAnalyzer4",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S43141-020-00114-X",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Gel image analysis is a cornerstone in electrophoresis-based experiments. Nature of the experiment determines the target of the analysis. Implemented features within different software for gel images and their outputs are variable. EgyGene GelAnalyzer4 software aimed to make a powerful, easy, and almost all-in-one software for gel image analysis. Results: EgyGene GelAnalyzer4 is a software for analyzing the gel images. The program consists of six main parts: gel image enhancement, image analysis, data merging, molecular markers detection, phylogenetic tree prediction, and population parameters estimation. Firstly, the gel image enhancement part enhances the gel image colors and clarity. Then, the image is analyzed in the second part using both automatic and manual detection of lanes and bands. The third part, data merging, is for merging several analyses for different samples/gels together to produce one table comprises the entire experiment. The fourth section, markers detection, collects several pre-analyzed data for the same samples to detect their molecular markers based on some user-defined criteria. The fifth part uses the outputs of the previous parts to draw the phylogenetic tree between samples. The program constructs a phylogenetic tree using unweighted pair group method with arithmetic mean (UPGMA) method. Fourteen different equations are used to calculate the similarity percentages: Anderberg, Czekanowski, Dice, Faith, Gower and Legendre, Jaccard, Nei and Li, Rogers and Tanimoto, Russel and Rao, simple matching, Sokal and Michener, Sokal and Sneath 1, Sokal and Sneath 2, and Sorensen. The last section calculates the population parameters for the pre-analyzed images before. EgyGene GelAnalyzer4 is designed and programed using Microsoft Visual Studio 2012 Express version, based on the Dot Net FrameWork 4.5 edition, whereas its icons are created using the freeware Greenfish Icon Editor Pro 3.2.5.1. Conclusions: EgyGene GelAnalyzer4 is a simple, fast, and user-friendly software with six novel features: changing the order of lanes within the gel image, splitting the detecting lane into two lanes, merging of several detected lanes into just one, splitting a single band into two bands, merging two or more bands to be a single band, and comparing data of several analyzed images with a big number of samples and merging it together in a single table and detection of molecular markers between samples. In addition to the basic features and outputs of other image analysis software such as calculation of relative mobility values, molecular weights/sizes estimation, DNA/RNA/protein quantity within bands, table of present/absent of bands, polymorphism percentage, similarity percentages and phylogeny, population parameters, enhancing the image colors and clarity, and merging data for several gels. In addition, writing names of samples and the detected markers on the image. EgyGene GelAnalyzer4 provides many several features, which may be not available together in any other alternative.",
                "authors": [
                    {
                        "name": "Ahmed N.E."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "Journal of Genetic Engineering and Biotechnology",
                "title": "EgyGene GelAnalyzer4: a powerful image analysis software for one-dimensional gel electrophoresis"
            },
            "pmcid": "PMC7835265",
            "pmid": "33495900"
        }
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        }
    ]
}