{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2022-09-06T12:00:43.771654Z",
    "biotoolsCURIE": "biotools:cdsimpute",
    "biotoolsID": "cdsimpute",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Riasat Azim"
        },
        {
            "name": "Shoaib Ahmed Dipu"
        },
        {
            "name": "Shulin Wang"
        }
    ],
    "description": "CDSImpute is a novel effective method to impute the dropout events of a scRNA-seq expression matrix.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                }
            ]
        }
    ],
    "homepage": "https://github.com/riasatazim/CDSImpute",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-09-06T12:00:43.774369Z",
    "license": "GPL-3.0",
    "name": "CDSImpute",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.COMPBIOMED.2022.105658",
            "metadata": {
                "abstract": "© 2022 Elsevier LtdBackground: Single-cell RNA-sequencing enables the opportunity to investigate cell heterogeneity, discover new types of cells and to perform transcriptomic reconstruction at a single-cell resolution. Due to technical inadequacy, the presence of dropout events hinders the downstream and differential expression analysis. Therefore, it demands an efficient and accurate approach to recover the true gene expression. To fill the gap, we present a novel Single-cell RNA dropout imputation method to retrieve the original gene expression of the genes with excessive zero and near-zero counts. Result: Here we have developed CDSImpute (Correlation Distance Similarity Imputation) to identify dropouts induced in scRNA-seq data rather than biological zeros and recover true gene expression. By taking into consideration correlation and negative distance between cells, a similar cell list has been created and by borrowing the gene expression from similar cells dropout has been detected and corrected simultaneously. The improvement is consistent with simulation data and several publicly available scRNA-seq datasets. The clustering accuracy of CDSImpute is evaluated by adjusted rand index on Kolod, Pollen and Usoskin datasets are 1.00, 0.79 and 0.34 respectively. CDSImpute achieves improved performance compared to the three existing methods evaluated by precise cell-type identification and differentially expressed gene detection from scRNA-seq Data. Conclusion: CDSImpute is a novel effective method to impute the dropout events of a scRNA-seq expression matrix. The package is implemented in the R language and is available at https://github.com/riasatazim/CDSImpute.",
                "authors": [
                    {
                        "name": "Azim R."
                    },
                    {
                        "name": "Dipu S.A."
                    },
                    {
                        "name": "Wang S."
                    }
                ],
                "date": "2022-07-01T00:00:00Z",
                "journal": "Computers in Biology and Medicine",
                "title": "CDSImpute: An ensemble similarity imputation method for single-cell RNA sequence dropouts"
            },
            "pmid": "35751187"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
