{
    "additionDate": "2017-02-10T11:35:21Z",
    "biotoolsCURIE": "biotools:rsat",
    "biotoolsID": "rsat",
    "collectionID": [
        "elixir-fr-sdp-2019",
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "email": "Jacques.van-Helden@univ-amu.fr",
            "name": "Jacques van Helden",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Regulatory Sequence Analysis Tools (RSAT) is a software suite combining specialised tools for the detection of regulatory signals in non-coding sequences. It includes tools for sequence retrieval, pattern discovery, pattern matching, genome-scale pattern matching, feature-map drawing, random sequence generation and other utilities. Tools may be accessed separately or connected to other tools. As well, the tools are available as web services for integration into programmatic work flows.",
    "documentation": [
        {
            "type": "General",
            "url": "http://rsat.eu"
        }
    ],
    "editPermission": {
        "authors": [
            "olisand"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence motif discovery",
                    "uri": "http://edamontology.org/operation_0238"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Transcriptional regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0438"
                },
                {
                    "term": "cis-regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0441"
                }
            ]
        }
    ],
    "homepage": "http://rsat.eu",
    "language": [
        "Java",
        "Perl",
        "Python"
    ],
    "lastUpdate": "2020-01-24T09:49:10Z",
    "license": "Other",
    "name": "RSAT suite",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "jvanheld",
    "publication": [
        {
            "metadata": {
                "abstract": "A series of computer programs were developed for the analysis of regulatory sequences, with a special focus on yeast. These tools are publicly available on the web (http://www.ucmb.ulb.ac.be/bioinformatics/rsa-tools/). Basically, three classical problems can be addressed: (a) search for known regulatory patterns in the upstream regions of known genes; (b) discovery of unknown regulatory patterns within a set of upstream regions known to be co-regulated; (c) search for unknown genes potentially regulated by a known transcription factor. Each of these tasks can be performed on basis of a simple (string) or more refined (matrix) description of the regulatory patterns. A feature-map progam automatically generates visual representations of the positions at which patterns were found. The site also provides a series of general utilities, such as generation of random sequence, automatic drawing of XY graphs, interconversions between sequence formats, etc. Several tools are linked together to allow their sequential utilization (piping), but each one can also be used independently by filling the web form with external data. This widens the scope of the site to the analysis of nonregulatory and/or non-yeast sequences. Copyright (C) 2000 John Wiley and Sons, Ltd.",
                "authors": [
                    {
                        "name": "Van Helden J."
                    },
                    {
                        "name": "Andre B."
                    },
                    {
                        "name": "Collado-Vides J."
                    }
                ],
                "citationCount": 146,
                "date": "2000-01-30T00:00:00Z",
                "journal": "Yeast",
                "title": "A web site for the computational analysis of yeast regulatory sequences"
            },
            "pmid": "10641039"
        },
        {
            "metadata": {
                "abstract": "The web resource Regulatory Sequence Analysis Tools (RSAT) (http://rsat.ulb.ac.be/rsat) offers a collection of software tools dedicated to the prediction of regulatory sites in non-coding DNA sequences. These tools include sequence retrieval, pattern discovery, pattern matching, genome-scale pattern matching, feature-map drawing, random sequence generation and other utilities. Alternative formats are supported for the representation of regulatory motifs (strings or position-specific scoring matrices) and several algorithms are proposed for pattern discovery. RSAT currently holds >100 fully sequenced genomes and these data are regularly updated from GenBank.",
                "authors": [
                    {
                        "name": "van Helden J."
                    }
                ],
                "citationCount": 329,
                "date": "2003-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Regulatory Sequence Analysis Tools"
            },
            "pmid": "12824373"
        },
        {
            "metadata": {
                "abstract": "We present here a simple and fast method allowing the isolation of DNA binding sites for transcription factors from families of coregulated genes, with results illustrated in Saccharomyces cerevisiae. Although conceptually simple, the algorithm proved efficient for extracting, from most of the yeast regulatory families analyzed, the upstream regulatory sequences which had been previously found by experimental analysis. Furthermore, putative new regulatory sites are predicted within upstream regions of several regulons. The method is based on the detection of over-represented oligonucleotides. A specificity of this approach is to define the statistical significance of a site based on tables of oligonucleotide frequencies observed in all non-coding sequences from the yeast genome. In contrast with heuristic methods, this oligonucleotide analysis is rigorous and exhaustive. Its range of detection is however limited to relatively simple patterns: short motifs with a highly conserved core. These features seem to be shared by a good number of regulatory sites in yeast. This, and similar methods, should be increasingly required to identify unknown regulatory elements within the numerous new coregulated families resulting from measurements of gene expression levels at the genomic scale.",
                "authors": [
                    {
                        "name": "Van Helden J."
                    },
                    {
                        "name": "Andre B."
                    },
                    {
                        "name": "Collado-Vides J."
                    }
                ],
                "citationCount": 565,
                "date": "1998-09-04T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "Extracting regulatory sites from the upstream region of yeast genes by computational analysis of oligonucleotide frequencies"
            },
            "pmid": "9719638"
        },
        {
            "metadata": {
                "abstract": "The regulatory sequence analysis tools (RSAT, http://rsat.ulb.ac.be/rsat/) is a software suite that integrates a wide collection of modular tools for the detection of cis-regulatory elements in genome sequences. The suite includes programs for sequence retrieval, pattern discovery, phylogenetic footprint detection, pattern matching, genome scanning and feature map drawing. Random controls can be performed with random gene selections or by generating random sequences according to a variety of background models (Bernoulli, Markov). Beyond the original word-based pattern-discovery tools (oligo-analysis and dyad-analysis), we recently added a battery of tools for matrix-based detection of cis-acting elements, with some original features (adaptive background models, Markov-chain estimation of P-values) that do not exist in other matrix-based scanning tools. The web server offers an intuitive interface, where each program can be accessed either separately or connected to the other tools. In addition, the tools are now available as web services, enabling their integration in programmatic workflows. Genomes are regularly updated from various genome repositories (NCBI and EnsEMBL) and 682 organisms are currently supported. Since 1998, the tools have been used by several hundreds of researchers from all over the world. Several predictions made with RSAT were validated experimentally and published.",
                "authors": [
                    {
                        "name": "Thomas-Chollier M."
                    },
                    {
                        "name": "Sand O."
                    },
                    {
                        "name": "Turatsinze J.V."
                    },
                    {
                        "name": "Janky R."
                    },
                    {
                        "name": "Defrance M."
                    },
                    {
                        "name": "Vervisch E."
                    },
                    {
                        "name": "Brohee S."
                    },
                    {
                        "name": "van Helden J."
                    }
                ],
                "citationCount": 197,
                "date": "2008-01-01T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "RSAT: regulatory sequence analysis tools."
            },
            "pmid": "18495751"
        }
    ],
    "relation": [
        {
            "biotoolsID": "rsat_-_retrieve_sequence",
            "type": "includes"
        },
        {
            "biotoolsID": "rsat_peak-motifs",
            "type": "includes"
        },
        {
            "biotoolsID": "rsat_var-tools",
            "type": "includes"
        },
        {
            "biotoolsID": "retrieve_matrix",
            "type": "includes"
        },
        {
            "biotoolsID": "rsat-position-analysis",
            "type": "includes"
        }
    ],
    "toolType": [
        "Web application",
        "Suite"
    ],
    "topic": [
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "DNA binding sites",
            "uri": "http://edamontology.org/topic_3125"
        }
    ]
}