{
    "additionDate": "2024-01-01T23:49:19.346233Z",
    "biotoolsCURIE": "biotools:cellremorph",
    "biotoolsID": "cellremorph",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "laura.keto@tuni.fi",
            "name": "Laura Keto",
            "orcidid": "https://orcid.org/0000-0003-4649-1805",
            "typeEntity": "Person"
        },
        {
            "email": "tiina.manninen@tuni.fi",
            "name": "Tiina Manninen",
            "orcidid": "https://orcid.org/0000-0002-0456-1185",
            "typeEntity": "Person"
        }
    ],
    "description": "A toolkit for transforming, selecting, and slicing 3D cell structures on the road to morphologically detailed astrocyte simulations.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/lauraketo/CellRemorph",
    "lastUpdate": "2024-11-24T14:25:58.951558Z",
    "license": "GPL-3.0",
    "name": "CellRemorph",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/s12021-023-09627-5",
            "metadata": {
                "abstract": "Understanding functions of astrocytes can be greatly enhanced by building and simulating computational models that capture their morphological details. Novel computational tools enable utilization of existing morphological data of astrocytes and building models that have appropriate level of details for specific simulation purposes. In addition to analyzing existing computational tools for constructing, transforming, and assessing astrocyte morphologies, we present here the CellRemorph toolkit implemented as an add-on for Blender, a 3D modeling platform increasingly recognized for its utility for manipulating 3D biological data. To our knowledge, CellRemorph is the first toolkit for transforming astrocyte morphologies from polygonal surface meshes into adjustable surface point clouds and vice versa, precisely selecting nanoprocesses, and slicing morphologies into segments with equal surface areas or volumes. CellRemorph is an open-source toolkit under the GNU General Public License and easily accessible via an intuitive graphical user interface. CellRemorph will be a valuable addition to other Blender add-ons, providing novel functionality that facilitates the creation of realistic astrocyte morphologies for different types of morphologically detailed simulations elucidating the role of astrocytes both in health and disease.",
                "authors": [
                    {
                        "name": "Keto L."
                    },
                    {
                        "name": "Manninen T."
                    }
                ],
                "citationCount": 3,
                "date": "2023-07-01T00:00:00Z",
                "journal": "Neuroinformatics",
                "title": "CellRemorph: A Toolkit for Transforming, Selecting, and Slicing 3D Cell Structures on the Road to Morphologically Detailed Astrocyte Simulations"
            },
            "pmcid": "PMC10406679",
            "pmid": "37133688",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Electron microscopy",
            "uri": "http://edamontology.org/topic_0611"
        },
        {
            "term": "Light microscopy",
            "uri": "http://edamontology.org/topic_3385"
        }
    ]
}
