{
    "additionDate": "2021-03-19T08:35:42Z",
    "biotoolsCURIE": "biotools:psims",
    "biotoolsID": "psims",
    "confidence_flag": "tool",
    "description": "A Declarative Writer for mzML and mzIdentML for Python.\n\nPrototype work for a unified API for writing PSIMS standardized XML documents, currently just mzML and MzIdentML.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                },
                {
                    "term": "Format validation",
                    "uri": "http://edamontology.org/operation_0336"
                },
                {
                    "term": "Protein-protein interaction analysis",
                    "uri": "http://edamontology.org/operation_2949"
                }
            ]
        }
    ],
    "homepage": "https://github.com/mobiusklein/psims",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2024-11-24T20:38:05.942895Z",
    "license": "Apache-2.0",
    "name": "psims",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1074/mcp.rp118.001070",
            "metadata": {
                "abstract": "Summary: mzML and mzIdentML are commonly used, powerful tools for representing mass spectrometry data and derived identification information. These formats are complex, requiring non-trivial logic to translate data into the appropriate representation. Most published implementations are tightly coupled to data structures. The most complete implementations are written in compiled languages that cannot expose the complete flexibility of the implementation to external programs or bindings. To our knowledge, there are no complete implementations for mzML or mzIdentML available to scripting languages like Python or R. We present psims, a library written in Python for writing mzML and mzIdentML. The library allows writing either XML format using built-in Python data structures. It includes a controlled vocabulary resolution system to simplify the encoding process and an identity tracking system to manage entity relationships. The source code is available at https:// github.com/mobiusklein/psims, and through the Python Package Index as psims, licensed under the Apache 2 common license.",
                "authors": [
                    {
                        "name": "Klein J."
                    },
                    {
                        "name": "Zaia J."
                    }
                ],
                "citationCount": 11,
                "date": "2019-03-01T00:00:00Z",
                "journal": "Molecular and Cellular Proteomics",
                "title": "Psims - A Declarative Writer for mzML and mzIdentML for Python"
            },
            "pmcid": "PMC6398200",
            "pmid": "30563850"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ]
}
