{
    "name": "BioTextQuest+", 
    "description": "Implements an enhanced version of the TextQuest algorithm, providing a user friendly web-based interface. BTQ collects abstracts from Medline literature and OMIM databases matching a user query. Identification of relevant terms enables the representation of text records in a Vector Space Model and the calculation of pairwise document similarities. Employing suitable clustering algorithms, results are transformed into clusters of records along with their corresponding terms.", 
    "homepage": "http://bioinformatics.med.uoc.gr/biotextquest", 
    "biotoolsID": "biotextquest", 
    "biotoolsCURIE": "biotools:biotextquest", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3279", 
                    "term": "Document clustering"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3307", 
            "term": "Computational biology"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "JavaScript"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "http://bioinformatics.med.uoc.gr/biotextquest/help.html", 
            "type": "Manual", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btu524", 
            "pmid": "25100685", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "BioTextQuest+: A knowledge integration platform for literature mining and concept discovery", 
                "abstract": "© The Author 2014. Published by Oxford University Press.The iterative process of finding relevant information in biomedical literature and performing bioinformatics analyses might result in an endless loop for an inexperienced user, considering the exponential growth of scientific corpora and the plethora of tools designed to mine PubMed® and related biological databases. Herein, we describe BioTextQuest+, a web-based interactive knowledge exploration platform with significant advances to its predecessor (BioTextQuest), aiming to bridge processes such as bioentity recognition, functional annotation, document clustering and data integration towards literature mining and concept discovery. BioTextQuest+ enables PubMed and OMIM querying, retrieval of abstracts related to a targeted request and optimal detection of genes, proteins, molecular functions, pathways and biological processes within the retrieved documents. The front-end interface facilitates the browsing of document clustering per subject, the analysis of term co-occurrence, the generation of tag clouds containing highly represented terms per cluster and at-a-glance popup windows with information about relevant genes and proteins. Moreover, to support experimental research, BioTextQuest+ addresses integration of its primary functionality with biological repositories and software tools able to deliver further bioinformatics services. The Google-like interface extends beyond simple use by offering a range of advanced parameterization for expert users. We demonstrate the functionality of BioTextQuest+ through several exemplary research scenarios including author disambiguation, functional term enrichment, knowledge acquisition and concept discovery linking major human diseases, such as obesity and ageing.", 
                "date": "2014-01-01T00:00:00Z", 
                "citationCount": 10, 
                "authors": [
                    {
                        "name": "Papanikolaou N."
                    }, 
                    {
                        "name": "Pavlopoulos G.A."
                    }, 
                    {
                        "name": "Pafilis E."
                    }, 
                    {
                        "name": "Theodosiou T."
                    }, 
                    {
                        "name": "Schneider R."
                    }, 
                    {
                        "name": "Satagopam V.P."
                    }, 
                    {
                        "name": "Ouzounis C.A."
                    }, 
                    {
                        "name": "Eliopoulos A.G."
                    }, 
                    {
                        "name": "Promponas V.J."
                    }, 
                    {
                        "name": "Iliopoulos I."
                    }
                ], 
                "journal": "Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": "IOANNIS ILIOPOULOS", 
            "email": "iliopj@med.uoc.gr", 
            "url": "http://bioinformatics.med.uoc.gr/biotextquest", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "Iliopoulos", 
    "additionDate": "2017-09-19T13:22:48Z", 
    "lastUpdate": "2018-12-10T12:58:59Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}