{
    "additionDate": "2021-01-18T11:52:12Z",
    "biotoolsCURIE": "biotools:topodb",
    "biotoolsID": "topodb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "alessandro.didonna@ucsf.edu",
            "name": "Alessandro Didonna",
            "orcidid": "https://orcid.org/0000-0001-7510-9658",
            "typeEntity": "Person"
        }
    ],
    "description": "a novel multifunctional management system for laboratory animal colonies.\n\nTopoDB requires Ruby version >= 2.5.2, Ruby on Rails version >= 5.2.0, and bundler version 2.0 . We recommend using rbenv to install and manage Ruby gems.\n\nLog in as the admin user that was created as part of the sample data set: email: admin@topodb.topo, password: admin123 . Once logged in as the administrator it is strongly recommended that you create new users to handle day-to-day activities in the application and that you change the Administrator account password (failure to do so can put your data at risk). Both of these activities can be done either directly in the users database table, or through the included rails admin feature, available in the main navigation bar.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://github.com/UCSF-MS-DCC/TopoDB",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2021-03-01T10:14:54Z",
    "license": "MIT",
    "name": "TopoDB",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAAA098",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press.Animal models are widely employed in basic research to test mechanistic hypotheses in a complex biological environment as well as to evaluate the therapeutic potential of candidate compounds in preclinical settings. Rodents, and in particular mice, represent the most common in vivo models for their small size, short lifespan and possibility to manipulate their genome. Over time, a typical laboratory will develop a substantial number of inbred strains and transgenic mouse lines, requiring a substantial effort, in both logistic and economic terms, to maintain an animal colony for research purposes and to safeguard the integrity of results. To meet this need, here we present TopoDB, a robust and extensible web-based platform for the rational management of laboratory animals. TopoDB allows an easy tracking of individual animals within the colony and breeding protocols as well as the convenient storage of both genetic and phenotypic data generated in the different experiments. Altogether, these features facilitate and enhance the design of in vivo research, thus reducing the number of necessary animals and the housing costs. In summary, TopoDB represents a novel valuable tool in modern biomedical research. Database URL: https://github.com/UCSF-MS-DCC/TopoDB.",
                "authors": [
                    {
                        "name": "Didonna A."
                    },
                    {
                        "name": "Matsunaga A."
                    },
                    {
                        "name": "Oksenberg J.R."
                    },
                    {
                        "name": "Renschen A."
                    },
                    {
                        "name": "Santaniello A."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Database",
                "title": "TopoDB: A novel multifunctional management system for laboratory animal colonies"
            },
            "pmcid": "PMC7673335",
            "pmid": "33206961"
        }
    ],
    "topic": [
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Laboratory animal science",
            "uri": "http://edamontology.org/topic_3386"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}
