{
    "accessibility": "Open access",
    "additionDate": "2022-10-19T19:23:28.624637Z",
    "biotoolsCURIE": "biotools:mfl-net",
    "biotoolsID": "mfl-net",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Amogh Manoj Joshi"
        },
        {
            "name": "Deepak Ranjan Nayak",
            "orcidid": "https://orcid.org/0000-0002-8929-5778"
        }
    ],
    "description": "An Efficient Lightweight Multi-Scale Feature Learning CNN for COVID-19 Diagnosis from CT Images.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                }
            ]
        }
    ],
    "homepage": "https://github.com/AmoghJ001/MFL_Net",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-10-19T19:23:28.627114Z",
    "license": "Not licensed",
    "name": "MFL-Net",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1109/JBHI.2022.3196489",
            "metadata": {
                "abstract": "IEEETimely and accurate diagnosis of coronavirus disease 2019 (COVID-19) is crucial in curbing its spread. Slow testing results of reverse transcription-polymerase chain reaction (RT-PCR) and a shortage of test kits have led to consider chest computed tomography (CT) as an alternative screening and diagnostic tool. Many deep learning methods, especially convolutional neural networks (CNNs), have been developed to detect COVID-19 cases from chest CT scans. Most of these models demand a vast number of parameters which often suffer from overfitting in the presence of limited chest CT training data. Moreover, the linearly stacked single-branched architecture based models hamper the extraction of multi-scale features, reducing the detection performance. In this paper, to handle these issues, we propose an extremely lightweight CNN with multi-scale feature learning blocks called as MFL-Net. The MFL-Net comprises a sequence of MFL blocks that combines multiple convolutional layers with <inline-formula><tex-math notation=\"LaTeX\">$3\\times 3$</tex-math></inline-formula> filters and residual connections effectively, thereby extracting multi-scale features at different levels and preserving them throughout the block. The model has only 0.78M parameters and requires low computational cost and memory space compared to heavy ImageNet pretrained CNN architectures. Comprehensive experiments are carried out using two publicly available COVID-19 CT imaging datasets. The results demonstrate that the proposed model achieves higher performance than pretrained CNN models and state-of-the-art methods on both datasets even in the presence of limited training CT data despite having an extremely lightweight architecture. The proposed method proves to be an effective aid for the healthcare system in the accurate and timely diagnosis of COVID-19. The codes and models are available for users at <uri>https://github.com/AmoghJ001/MFL_Net</uri>.",
                "authors": [
                    {
                        "name": "Joshi A.M."
                    },
                    {
                        "name": "Nayak D.R."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "IEEE Journal of Biomedical and Health Informatics",
                "title": "MFL-Net: An Efficient Lightweight Multi-Scale Feature Learning CNN for COVID-19 Diagnosis from CT Images"
            },
            "pmid": "35981061"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ]
}
