{
    "accessibility": "Open access",
    "additionDate": "2024-07-26T13:55:34.883433Z",
    "biotoolsCURIE": "biotools:pacu",
    "biotoolsID": "pacu",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "bert.bogaerts@sciensano.be",
            "name": "Bert Bogaerts",
            "orcidid": "https://orcid.org/0000-0003-2806-4033",
            "typeEntity": "Person"
        }
    ],
    "description": "PACU is a workflow for whole genome sequencing based phylogeny of Illumina and ONT R9/R10 data.\nPACU stands for the Prokaryotic Awesome variant Calling Utility and is named after an omnivorous fish (that eats both Illumina and ONT reads).",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/BioinformaticsPlatformWIV-ISP/PACU"
        }
    ],
    "download": [
        {
            "type": "Downloads page",
            "url": "https://github.com/BioinformaticsPlatformWIV-ISP/PACU/tags"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "cmd": "PACU",
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BioinformaticsPlatformWIV-ISP/PACU",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-07-26T14:02:52.890066Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Galaxy service"
            ],
            "url": "https://galaxy.sciensano.be/"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/BioinformaticsPlatformWIV-ISP/PACU"
        }
    ],
    "maturity": "Emerging",
    "name": "PACU",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "BertBog",
    "publication": [
        {
            "doi": "10.1128/jcm.01576-23",
            "metadata": {
                "abstract": "Whole-genome sequencing has become the method of choice for bacterial outbreak investigation, with most clinical and public health laboratories currently routinely using short-read Illumina sequencing. Recently, long-read Oxford Nanopore Technologies (ONT) sequencing has gained prominence and may offer advantages over short-read sequencing, particularly with the recent introduction of the R10 chemistry, which promises much lower error rates than the R9 chemistry. However, limited information is available on its performance for bacterial single-nucleotide polymorphism (SNP)-based outbreak investigation. We present an open-source workflow, Prokaryotic Awesome variant Calling Utility (PACU) (https://github.com/BioinformaticsPlatformWIV-ISP/PACU), for constructing SNP phylogenies using Illumina and/or ONT R9/R10 sequencing data. The workflow was evaluated using outbreak data sets of Shiga toxin-producing Escherichia coli and Listeria monocytogenes by comparing ONT R9 and R10 with Illumina data. The performance of each sequencing technology was evaluated not only separately but also by integrating samples sequenced by different technologies/chemistries into the same phylogenomic analysis. Additionally, the minimum sequencing time required to obtain accurate phylogenetic results using nanopore sequencing was evaluated. PACU allowed accurate identification of outbreak clusters for both species using all technologies/chemistries, but ONT R9 results deviated slightly more from the Illumina results. ONT R10 results showed trends very similar to Illumina, and we found that integrating data sets sequenced by either Illumina or ONT R10 for different isolates into the same analysis produced stable and highly accurate phylogenomic results. The resulting phylogenies for these two outbreaks stabilized after ~20 hours of sequencing for ONT R9 and ~8 hours for ONT R10. This study provides a proof of concept for using ONT R10, either in isolation or in combination with Illumina, for rapid and accurate bacterial SNP-based outbreak investigation.",
                "authors": [
                    {
                        "name": "Bogaerts B."
                    },
                    {
                        "name": "De Keersmaecker S.C.J."
                    },
                    {
                        "name": "Delbrassinne L."
                    },
                    {
                        "name": "Godfroid M."
                    },
                    {
                        "name": "Hoffman S."
                    },
                    {
                        "name": "Mattheus W."
                    },
                    {
                        "name": "Nouws S."
                    },
                    {
                        "name": "Roosens N.H.C."
                    },
                    {
                        "name": "Van den Bossche A."
                    },
                    {
                        "name": "Vanneste K."
                    },
                    {
                        "name": "Verhaegen B."
                    }
                ],
                "citationCount": 2,
                "date": "2024-05-01T00:00:00Z",
                "journal": "Journal of Clinical Microbiology",
                "title": "Closing the gap: Oxford Nanopore Technologies R10 sequencing allows comparable results to Illumina sequencing for SNP-based outbreak investigation of bacterial pathogens"
            },
            "pmcid": "PMC11077942",
            "pmid": "38441926",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "version": [
        "0.0.3"
    ]
}
