{
    "additionDate": "2017-03-27T11:53:43Z",
    "biotoolsCURIE": "biotools:cddb",
    "biotoolsID": "cddb",
    "credit": [
        {
            "email": "mark.bathe@mit.edu",
            "name": "Mark Bathe",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Database for comprehensive results on the conformational dynamics of high molecular weight proteins and protein assemblies. Analysis is performed using a coarse-grained computational approach that is applied to most structures present in the electron microscopy data bank (EMDB). Results include equilibrium thermal fluctuations and elastic strain energy distributions that identify protein domains flexibility, functional-transitions associated domains, and correlations in molecular motions.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://en.wikipedia.org/wiki/Conformational_dynamics_data_bank"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein molecular weight calculation",
                    "uri": "http://edamontology.org/operation_0398"
                },
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Protein flexibility and motion analysis",
                    "uri": "http://edamontology.org/operation_0244"
                }
            ]
        }
    ],
    "homepage": "http://www.cdyn.org",
    "language": [
        "PHP",
        "SQL"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "name": "CDDB",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "The conformational dynamics data bank (CDDB, http://www.cdyn.org) is a database that aims to provide comprehensive results on the conformational dynamics of high molecular weight proteins and protein assemblies. Analysis is performed using a recently introduced coarse-grained computational approach that is applied to the majority of structures present in the electron microscopy data bank (EMDB). Results include equilibrium thermal fluctuations and elastic strain energy distributions that identify rigid versus flexible protein domains generally, as well as those associated with specific functional transitions, and correlations in molecular motions that identify molecular regions that are highly coupled dynamically, with implications for allosteric mechanisms. A practical web-based search interface enables users to easily collect conformational dynamics data in various formats. The data bank is maintained and updated automatically to include conformational dynamics results for new structural entries as they become available in the EMDB. The CDDB complements static structural information to facilitate the investigation and interpretation of the biological function of proteins and protein assemblies essential to cell function. © The Author(s) 2010.",
                "authors": [
                    {
                        "name": "Kim D.-N."
                    },
                    {
                        "name": "Altschuler J."
                    },
                    {
                        "name": "Strong C."
                    },
                    {
                        "name": "McGill G."
                    },
                    {
                        "name": "Bathe M."
                    }
                ],
                "citationCount": 11,
                "date": "2011-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Conformational dynamics data bank: A database for conformational dynamics of proteins and supramolecular protein assemblies"
            },
            "pmid": "21051356"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Electron microscopy",
            "uri": "http://edamontology.org/topic_0611"
        }
    ],
    "validated": 1
}