{
    "additionDate": "2017-08-03T18:50:43Z",
    "biotoolsCURIE": "biotools:matrixmatchmaker",
    "biotoolsID": "matrixmatchmaker",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.uhnresearch.ca/labs/tillier/index.htm"
        }
    ],
    "description": "MatrixMatchMaker or MMM predicts interacting proteins using coevolution",
    "documentation": [
        {
            "type": "General",
            "url": "http://wwwlabs.uhnresearch.ca/tillier/index.htm"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "homepage": "http://www.uhnresearch.ca/labs/tillier/software.htm#8",
    "lastUpdate": "2019-08-14T07:06:26Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/matrixmatchmaker-20121201-predicts-interacting-proteins-coevolution.html"
        }
    ],
    "name": "MatrixMatchMaker",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Niloofar",
    "publication": [
        {
            "metadata": {
                "abstract": "Coevolution maintains interactions between phenotypic traits through the process of reciprocal natural selection. Detecting molecular coevolution can expose functional interactions between molecules in the cell, generating insights into biological processes, pathways, and the networks of interactions important for cellular function. Prediction of interaction partners from different protein families exploits the property that interacting proteins can follow similar patterns and relative rates of evolution. Current methods for detecting coevolution based on the similarity of phylogenetic trees or evolutionary distance matrices have, however, been limited by requiring coevolution over the entire evolutionary history considered and are inaccurate in the presence of paralogous copies. We present a novel method for determining coevolving protein partners by finding the largest common submatrix in a given pair of distance matrices, with the size of the largest common submatrix measuring the strength of coevolution. This approach permits us to consider matrices of different size and scale, to find lineage-specific coevolution, and to predict multiple interaction partners. We used MatrixMatchMaker to predict protein-protein interactions in the human genome. We show that proteins that are known to interact physically are more strongly coevolving than proteins that simply belong to the same biochemical pathway. The human coevolution network is highly connected, suggesting many more protein-protein interactions than are currently known from high-throughput and other experimental evidence. These most strongly coevolving proteins suggest interactions that have been maintained over long periods of evolutionary time, and that are thus likely to be of fundamental importance to cellular function. © 2009 by Cold Spring Harbor Laboratory Press.",
                "authors": [
                    {
                        "name": "Tillier E.R.M."
                    },
                    {
                        "name": "Charlebois R.L."
                    }
                ],
                "citationCount": 31,
                "date": "2009-10-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "The human protein coevolution network"
            },
            "pmid": "19696150"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ],
    "validated": 1
}