{
    "additionDate": "2017-02-10T14:15:36Z",
    "biotoolsCURIE": "biotools:biologicalnetworks",
    "biotoolsID": "biologicalnetworks",
    "description": "Allows retrieval, construction, and visualization of biological networks and allows for the analysis of high-throughput expression data by mapping onto network graphs. It queries the PathSys system, a combined database of biological pathways, gene regulatory networks, and protein interaction maps.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                },
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                },
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                },
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Protein interaction network analysis",
                    "uri": "http://edamontology.org/operation_0276"
                }
            ]
        }
    ],
    "homepage": "http://brak.sdsc.edu/pub/BiologicalNetworks/",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:40Z",
    "name": "BiologicalNetworks",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: The goal of information integration in systems biology is to combine information from a number of databases and data sets, which are obtained from both high and low throughput experiments, under one data management scheme such that the cumulative information provides greater biological insight than is possible with individual information sources considered separately. Results: Here we present PathSys, a graph-based system for creating a combined database of networks of interaction for generating integrated view of biological mechanisms. We used PathSys to integrate over 14 curated and publicly contributed data sources for the budding yeast (S. cerevisiae) and Gene Ontology. A number of exploratory questions were formulated as a combination of relational and graph-based queries to the integrated database. Thus, PathSys is a general-purpose, scalable, graph-data warehouse of biological information, complete with a graph manipulation and a query language, a storage mechanism and a generic data-importing mechanism through schema-mapping. Conclusion: Results from several test studies demonstrate the effectiveness of the approach in retrieving biologically interesting relations between genes and proteins, the networks connecting them, and of the utility of PathSys as a scalable graph-based warehouse for interaction-network integration and a hypothesis generator system. The PathSys's client software, named BiologicalNetworks, developed for navigation and analyses of molecular networks, is available as a Java Web Start application at http://brak.sdsc.edu/pub/Biological Networks. © 2006 Baitaluk et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Baitaluk M."
                    },
                    {
                        "name": "Godbole S."
                    },
                    {
                        "name": "Gupta A."
                    },
                    {
                        "name": "Qian X."
                    },
                    {
                        "name": "Raval A."
                    },
                    {
                        "name": "Ray A."
                    }
                ],
                "citationCount": 40,
                "date": "2006-02-07T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "PathSys: Integrating molecular interaction graphs for systems biology"
            },
            "pmid": "16464251"
        },
        {
            "metadata": {
                "abstract": "Systems level investigation of genomic scale information requires the development of truly integrated databases dealing with heterogeneous data, which can be queried for simple properties of genes or other database objects as well as for complex network level properties, for the analysis and modelling of complex biological processes. Towards that goal, we recently constructed PathSys, a data integration platform for systemsbiology, which provides dynamic integration over a diverse set of databases [Baitaluk et al. (2006) BMC Bioinformatics 7, 55]. Here we describe a server, BiologicalNetworks, which provides visualization, analysis services and an information management framework over PathSys. The server allows easy retrieval, construction and visualization of complex biological networks, including genome-scale integrated networks of protein-protein, protein-DNA and genetic interactions. Most importantly, BiologicalNetworks addresses the need for systematic presentation and analysis of high-throughput expression data by mapping and analysis of expression profiles of genes or proteins simultaneously on to regulatory, metabolic and cellular networks. BiologicalNetworks Server is available at http://brak.sdsc.edu/pub/BiologicalNetworks. © The Author 2006. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Baitaluk M."
                    },
                    {
                        "name": "Gupta A."
                    },
                    {
                        "name": "Ray A."
                    },
                    {
                        "name": "Sedova M."
                    }
                ],
                "citationCount": 73,
                "date": "2006-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "BiologicalNetworks: Visualization and analysis tool for systems biology"
            },
            "pmid": "16845051"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ],
    "validated": 1
}
