{
    "name": "FunClust", 
    "description": "A web server for the identification of structural motifs in a set of non-homologous protein structures.", 
    "homepage": "http://pdbfun.uniroma2.it/funclust/", 
    "biotoolsID": "funclust", 
    "biotoolsCURIE": "biotools:funclust", 
    "version": [
        "1"
    ], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2483", 
                    "term": "Structure comparison"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0081", 
            "term": "Structure analysis"
        }
    ], 
    "operatingSystem": [], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [], 
    "publication": [
        {
            "doi": "10.1186/1471-2105-9-S2-S2", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "FunClust: A web server for the identification of structural motifs in a set of non-homologous protein structures", 
                "abstract": "Background: The occurrence of very similar structural motifs brought about by different parts of non homologous proteins is often indicative of a common function. Indeed, relatively small local structures can mediate binding to a common partner, be it a protein, a nucleic acid, a cofactor or a substrate. While it is relatively easy to identify short amino acid or nucleotide sequence motifs in a given set of proteins or genes, and many methods do exist for this purpose, much more challenging is the identification of common local substructures, especially if they are formed by non consecutive residues in the sequence. Results: Here we describe a publicly available tool, able to identify common structural motifs shared by different non homologous proteins in an unsupervised mode. The motifs can be as short as three residues and need not to be contiguous or even present in the same order in the sequence. Users can submit a set of protein structures deemed or not to share a common function (e.g. they bind similar ligands, or share a common epitope). The server finds and lists structural motifs composed of three or more spatially well conserved residues shared by at least three of the submitted structures. The method uses a local structural comparison algorithm to identify subsets of similar amino acids between each pair of input protein chains and a clustering procedure to group similarities shared among different structure pairs. Conclusions: FunClust is fast, completely sequence independent, and does not need an a priori knowledge of the motif to be found. The output consists of a list of aligned structural matches displayed in both tabular and graphical form. We show here examples of its usefulness by searching for the largest common structural motifs in test sets of non homologous proteins and showing that the identified motifs correspond to a known common functional feature. © 2008 Ausiello et al.; licensee BioMed Central Ltd.", 
                "date": "2008-03-26T00:00:00Z", 
                "citationCount": 28, 
                "authors": [
                    {
                        "name": "Ausiello G."
                    }, 
                    {
                        "name": "Gherardini P.F."
                    }, 
                    {
                        "name": "Marcatili P."
                    }, 
                    {
                        "name": "Tramontano A."
                    }, 
                    {
                        "name": "Via A."
                    }, 
                    {
                        "name": "Helmer-Citterich M."
                    }
                ], 
                "journal": "BMC Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": "ELIXIR-ITA-TORVERGATA", 
            "email": null, 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Institute", 
            "typeRole": [
                "Provider"
            ], 
            "note": null
        }, 
        {
            "name": null, 
            "email": "citterich@uniroma2.it", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "ELIXIR-ITA-TORVERGATA", 
    "additionDate": "2015-01-22T11:45:57Z", 
    "lastUpdate": "2018-12-10T12:58:34Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 1, 
    "elixir_badge": 0
}