{
    "additionDate": "2020-01-14T09:33:17Z",
    "biotoolsCURIE": "biotools:SCDO",
    "biotoolsID": "SCDO",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "nicola.mulder@uct.ac.za",
            "typeEntity": "Person"
        }
    ],
    "description": "enabling universal sickle cell-based knowledge representation.\n\nSickle Cell Disease Ontology Project – SCDO.\n\nhttp://scdontology.h3abionet.org.\n\nSickle Cell Disease Ontology Project.\n\nThe Sickle Cell Disease Ontology (SCDO) project is a collaboration between H3ABioNet (Pan African Bioinformatics Network) and SPAN (Sickle Cell Disease Pan African Network). The SCDO is currently under development and its purpose is to 1) establish community standardized SCD terms and descriptions, 2) establish canonical and hierarchical representation of knowledge on SCD and 3) link to other ontologies and bodies of work such as DO, PhenX MeSH, ICD, NCI’s thesaurus, SNOMED and OMIM.\n\nThe Sickle Cell Disease Ontology (SCDO) project is a collaboration between H3ABioNet (Pan African Bioinformatics Network) and SPAN (Sickle Cell Disease Pan African Network).\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'Sickle Cell Disease Ontology', 'SCD overcomes'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                }
            ]
        }
    ],
    "homepage": "http://scdontology.h3abionet.org",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-01-14T09:33:17Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://www.ebi.ac.uk/ols/ontologies/scdo"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/scdodev/scdo-ontology"
        },
        {
            "type": [
                "Other"
            ],
            "url": "https://bioportal.bioontology.org/ontologies/SCDO"
        }
    ],
    "name": "SCDO",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAZ118",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press.Sickle cell disease (SCD) is one of the most common monogenic diseases in humans with multiple phenotypic expressions that can manifest as both acute and chronic complications. Although described more than a century ago, challenges in comprehensive disease management and collaborative research on this disease are compounded by the complex molecular and clinical phenotypes of SCD, environmental and psychosocial factors, limited therapeutic options and ambiguous terminology. This ambiguous terminology has hampered the integration and interoperability of existing SCD knowledge, and SCD research translation. The SCD Ontology (SCDO), which is a community-driven integrative and universal knowledge representation system for SCD, overcomes this issue by providing a controlled vocabulary developed by a group of experts in both SCD and ontology design. SCDO is the first and most comprehensive standardized human- and machine-readable resource that unambiguously represents terminology and concepts about SCD for researchers, patients and clinicians. It is built around the central concept 'hemoglobinopathy', allowing inclusion of non-SCD haemoglobinopathies, such as thalassaemias, which may interfere with or influence SCD phenotypic manifestations. This collaboratively developed ontology constitutes a comprehensive knowledge management system and standardized terminology of various SCD-related factors. The SCDO will promote interoperability of different research datasets, facilitate seamless data sharing and collaborations, including meta-analyses within the SCD community, and support the development and curation of data-basing and clinical informatics in SCD.",
                "citationCount": 1,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Database : the journal of biological databases and curation",
                "title": "The Sickle Cell Disease Ontology: enabling universal sickle cell-based knowledge representation"
            },
            "pmcid": "PMC6878945",
            "pmid": "31769834"
        }
    ],
    "topic": [
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ]
}