{
    "additionDate": "2018-05-03T16:37:27Z",
    "biotoolsCURIE": "biotools:nessm",
    "biotoolsID": "nessm",
    "credit": [
        {
            "email": "ccwei@sjtu.edu.cn",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "chenmodexiaoxi@126.com",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A Next-Generation Sequencing Simulator for Metagenomics.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://cbb.sjtu.edu.cn/~ccwei/pub/software/NeSSM.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "http://cbb.sjtu.edu.cn/~ccwei/pub/software/NeSSM.php",
    "language": [
        "C",
        "Perl"
    ],
    "lastUpdate": "2021-04-26T07:51:05Z",
    "name": "NeSSM",
    "operatingSystem": [
        "Linux"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_011941"
        }
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0075448",
            "metadata": {
                "abstract": "Background:Metagenomics can reveal the vast majority of microbes that have been missed by traditional cultivation-based methods. Due to its extremely wide range of application areas, fast metagenome sequencing simulation systems with high fidelity are in great demand to facilitate the development and comparison of metagenomics analysis tools.Results:We present here a customizable metagenome simulation system: NeSSM (Next-generation Sequencing Simulator for Metagenomics). Combining complete genomes currently available, a community composition table, and sequencing parameters, it can simulate metagenome sequencing better than existing systems. Sequencing error models based on the explicit distribution of errors at each base and sequencing coverage bias are incorporated in the simulation. In order to improve the fidelity of simulation, tools are provided by NeSSM to estimate the sequencing error models, sequencing coverage bias and the community composition directly from existing metagenome sequencing data. Currently, NeSSM supports single-end and pair-end sequencing for both 454 and Illumina platforms. In addition, a GPU (graphics processing units) version of NeSSM is also developed to accelerate the simulation. By comparing the simulated sequencing data from NeSSM with experimental metagenome sequencing data, we have demonstrated that NeSSM performs better in many aspects than existing popular metagenome simulators, such as MetaSim, GemSIM and Grinder. The GPU version of NeSSM is more than one-order of magnitude faster than MetaSim.Conclusions:NeSSM is a fast simulation system for high-throughput metagenome sequencing. It can be helpful to develop tools and evaluate strategies for metagenomics analysis and it's freely available for academic users at http://cbb.sjtu.edu.cn/ccwei/pub/software/NeSSM.php. © 2013 Jia et al.",
                "authors": [
                    {
                        "name": "Cai K."
                    },
                    {
                        "name": "Hu Z."
                    },
                    {
                        "name": "Jia B."
                    },
                    {
                        "name": "Ma L."
                    },
                    {
                        "name": "Wei C."
                    },
                    {
                        "name": "Xuan L."
                    }
                ],
                "citationCount": 38,
                "date": "2013-10-04T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "NeSSM: A Next-Generation Sequencing Simulator for Metagenomics"
            },
            "pmcid": "PMC3790878",
            "pmid": "24124490"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Simulation experiment",
            "uri": "http://edamontology.org/topic_3524"
        }
    ],
    "validated": 1
}
