{
    "accessibility": "Open access",
    "additionDate": "2021-11-11T19:22:59.973502Z",
    "biotoolsCURIE": "biotools:ioat",
    "biotoolsID": "ioat",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "feiliu@scut.edu.cn",
            "name": "Fei Liu",
            "typeEntity": "Person"
        }
    ],
    "description": "An interactive tool for statistical analysis of omics data and clinical data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/WlSunshine/IOAT-software/blob/master/report.doc"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/WlSunshine/IOAT-software",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2021-11-11T19:22:59.976068Z",
    "name": "IOAT",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04253-X",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: With the development of high-throughput sequencing technology, a huge amount of multi-omics data has been accumulated. Although there are many software tools for statistical analysis and visual development of omics data, these tools are not suitable for private data and non-technical users. Besides, most of these tools have specialized in only one or perhaps a few data typesare, without combining clinical information. What’s more, users could not choose data processing and model selection flexibly when using these tools. Results: To help non-technical users to understand and analyze private multi-omics data and ensure data security, we developed an interactive desk tool for statistical analysis and visualization of omics and clinical data (shortly IOAT). Our mainly targets csv format data, and combines clinical data with high-dimensional multi-omics data. It also contains various operations, such as data preprocessing, feature selection, risk assessment, clustering, and survival analysis. By using this tool, users can safely and conveniently try a combination of various methods on their private multi-omics data to find a model suitable for their data, conduct risk assessment and determine their cancer subtypes. At the same time, the tool can also provide them with references to genes that are closely related to tumor staging, facilitating the development of precision oncology. We review IOAT’s main features and demonstrate its analysis capabilities on a lung from TCGA. Conclusions: IOAT is a local desktop tool, which provides a set of multi-omics data integration solutions. It can quickly perform a complete analysis of cancer genome data for subtype discovery and biomarker identification without security issues and writing any code. Thus, our tool can enable cancer biologists and biomedicine researchers to analyze their data more easily and safely. IOAT can be downloaded for free from https://github.com/WlSunshine/IOAT-software.",
                "authors": [
                    {
                        "name": "Cai H."
                    },
                    {
                        "name": "Liu F."
                    },
                    {
                        "name": "Wu L."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "IOAT: an interactive tool for statistical analysis of omics data and clinical data"
            },
            "pmcid": "PMC8204560",
            "pmid": "34130622"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        }
    ],
    "validated": 1
}
