{
    "additionDate": "2018-05-21T19:17:39Z",
    "biotoolsCURIE": "biotools:drvm",
    "biotoolsID": "drvm",
    "credit": [
        {
            "email": "jade@nhri.org.tw",
            "name": "Yu-Chieh Liao",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "oliver0618@nhri.org.tw",
            "name": "Hsin-Hung Lin",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Efficient genome assembly of known eukaryotic viruses from metagenomes.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://sourceforge.net/projects/sb2nhri/files/drVM/readme.txt/download"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/projects/sb2nhri/files/drVM/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "license": "GPL-3.0",
    "name": "drVM",
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/GIGASCIENCE/GIX003",
            "metadata": {
                "abstract": "© The Author 2017.Background: Virus discovery using high-throughput next-generation sequencing has become more commonplace. However, although analysis of deep next-generation sequencing data allows us to identity potential pathogens, the entire analytical procedure requires competency in the bioinformatics domain, which includes implementing proper software packages and preparing prerequisite databases. Simple and user-friendly bioinformatics pipelines are urgently required to obtain complete viral genome sequences from metagenomic data. Results: This manuscript presents a pipeline, drVM (detect and reconstruct known viral genomes from metagenomes), for rapid viral read identification, genus-level read partition, read normalization, de novo assembly, sequence annotation, and coverage profiling. The first two procedures and sequence annotation rely on known viral genomes as a reference database. drVM was validated via the analysis of over 300 sequencing runs generated by Illumina and Ion Torrent platforms to provide complete viral genome assemblies for a variety of virus types including DNA viruses, RNA viruses, and retroviruses. drVM is available for free download at: https://sourceforge.net/projects/sb2nhri/files/drVM/and is also assembled as a Docker container, an Amazon machine image, and a virtual machine to facilitate seamless deployment. Conclusions: drVM was compared with other viral detection tools to demonstrate its merits in terms of viral genome completeness and reduced computation time. This substantiates the platform's potential to produce prompt and accurate viral genome sequences from clinical samples.",
                "authors": [
                    {
                        "name": "Lin H.-H."
                    },
                    {
                        "name": "Liao Y.-C."
                    }
                ],
                "citationCount": 11,
                "date": "2017-02-01T00:00:00Z",
                "journal": "GigaScience",
                "title": "drVM: A new tool for efficient genome assembly of known eukaryotic viruses from metagenomes"
            },
            "pmcid": "PMC5466706",
            "pmid": "28369462"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Virology",
            "uri": "http://edamontology.org/topic_0781"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ],
    "validated": 1
}