{
    "accessibility": "Open access",
    "additionDate": "2023-11-08T11:00:28.875232Z",
    "biotoolsCURIE": "biotools:lagrange-ng",
    "biotoolsID": "lagrange-ng",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ben.bettisworth@h-its.org",
            "name": "Ben Bettisworth",
            "orcidid": "https://orcid.org/0000-0002-9130-6878",
            "typeEntity": "Person"
        },
        {
            "name": "Alexandros Stamatakis",
            "typeEntity": "Person"
        },
        {
            "name": "Stephen A Smith",
            "typeEntity": "Person"
        }
    ],
    "description": "This is a plotting tool for Lagrange-NG, which is a tool for inferring ancestral biogeographies. It takes the results JSON file and plots the results as an SVG. The results are plotted as a phylogram with pie charts at the interior nodes displaying the likelihood weight ratio for the top distributions.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic inference",
                    "uri": "http://edamontology.org/operation_0323"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/computations/lagrange-ng",
    "language": [
        "C++"
    ],
    "lastUpdate": "2023-11-08T11:00:28.877905Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/computations/lagrange-ng-plotter"
        }
    ],
    "name": "Lagrange-NG",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/SYSBIO/SYAD002",
            "metadata": {
                "abstract": "Computing ancestral ranges via the Dispersion Extinction and Cladogensis (DEC) model of biogeography is characterized by an exponential number of states relative to the number of regions considered. This is because the DEC model requires computing a large matrix exponential, which typically accounts for up to 80% of overall runtime. Therefore, the kinds of biogeographical analyses that can be conducted under the DEC model are limited by the number of regions under consideration. In this work, we present a completely redesigned efficient version of the popular tool Lagrange which is up to 49 times faster with multithreading enabled, and is also 26 times faster when using only one thread. We call this new version Lagrange-NG (Lagrange-Next Generation). The increased computational efficiency allows Lagrange-NG to analyze datasets with a large number of regions in a reasonable amount of time, up to 12 regions in approximately 18 min. We achieve these speedups using a relatively new method of computing the matrix exponential based on Krylov subspaces. In order to validate the correctness of Lagrange-NG, we also introduce a novel metric on range distributions for trees so that researchers can assess the difference between any two range inferences. Finally, Lagrange-NG exhibits substantially higher adherence to coding quality standards. It improves a respective software quality indicator as implemented in the SoftWipe tool from average (5.5; Lagrange) to high (7.8; Lagrange-NG). Lagrange-NG is freely available under GPL2.",
                "authors": [
                    {
                        "name": "Bettisworth B."
                    },
                    {
                        "name": "Smith S.A."
                    },
                    {
                        "name": "Stamatakis A."
                    }
                ],
                "date": "2023-01-01T00:00:00Z",
                "journal": "Systematic Biology",
                "title": "Lagrange-NG: The next generation of Lagrange"
            },
            "pmcid": "PMC10198646",
            "pmid": "36705582"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        }
    ]
}
