{
    "accessibility": "Open access",
    "additionDate": "2024-01-05T11:58:58.454847Z",
    "biotoolsCURIE": "biotools:asmbpls_da",
    "biotoolsID": "asmbpls_da",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "susmita.datta@ufl.edu",
            "name": "Susmita Datta",
            "typeEntity": "Person"
        }
    ],
    "description": "Integrative method for identifying key biomarkers from multi-omics data.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                }
            ]
        }
    ],
    "homepage": "https://github.com/RunzhiZ/asmbPLS",
    "language": [
        "C++",
        "R"
    ],
    "lastUpdate": "2024-11-24T14:23:08.137509Z",
    "name": "asmbPLS-DA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3390/genes14050961",
            "metadata": {
                "abstract": "With the growing use of high-throughput technologies, multi-omics data containing various types of high-dimensional omics data is increasingly being generated to explore the association between the molecular mechanism of the host and diseases. In this study, we present an adaptive sparse multi-block partial least square discriminant analysis (asmbPLS-DA), an extension of our previous work, asmbPLS. This integrative approach identifies the most relevant features across different types of omics data while discriminating multiple disease outcome groups. We used simulation data with various scenarios and a real dataset from the TCGA project to demonstrate that asmbPLS-DA can identify key biomarkers from each type of omics data with better biological relevance than existing competitive methods. Moreover, asmbPLS-DA showed comparable performance in the classification of subjects in terms of disease status or phenotypes using integrated multi-omics molecular profiles, especially when combined with other classification algorithms, such as linear discriminant analysis and random forest. We have made the R package called asmbPLS that implements this method publicly available on GitHub. Overall, asmbPLS-DA achieved competitive performance in terms of feature selection and classification. We believe that asmbPLS-DA can be a valuable tool for multi-omics research.",
                "authors": [
                    {
                        "name": "Datta S."
                    },
                    {
                        "name": "Zhang R."
                    }
                ],
                "citationCount": 3,
                "date": "2023-05-01T00:00:00Z",
                "journal": "Genes",
                "title": "Adaptive Sparse Multi-Block PLS Discriminant Analysis: An Integrative Method for Identifying Key Biomarkers from Multi-Omics Data"
            },
            "pmcid": "PMC10218045",
            "pmid": "37239321"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ]
}
