{
    "accessibility": "Open access",
    "additionDate": "2021-04-25T01:26:32Z",
    "biotoolsCURIE": "biotools:parmatt",
    "biotoolsID": "parmatt",
    "cost": "Free of charge",
    "description": "parMatt: parallel multiple alignment of protein 3D-structures with translations and twists for distributed-memory systems. parMatt is based on a popular Matt software.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://biokinet.belozersky.msu.ru/sites/default/data/parMATT_user_manual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Multiple structure alignment",
                    "uri": "http://edamontology.org/operation_0504"
                }
            ]
        }
    ],
    "homepage": "https://biokinet.belozersky.msu.ru/parmatt",
    "language": [
        "C"
    ],
    "lastUpdate": "2024-11-24T20:28:41.438653Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://biokinet.belozersky.msu.ru/parmatt"
        }
    ],
    "name": "parMatt",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "n-canter",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btz224",
            "metadata": {
                "abstract": "Motivation: Accurate structural alignment of proteins is crucial at studying structure-function relationship in evolutionarily distant homologues. Various software tools were proposed to align multiple protein 3D-structures utilizing one CPU and thus are of limited productivity at large-scale analysis of protein families/superfamilies. Results: The parMATT is a hybrid MPI/pthreads/OpenMP parallel re-implementation of the MATT algorithm to align multiple protein 3D-structures by allowing translations and twists. The parMATT can be faster than MATT on a single multi-core CPU, and provides a much greater speedup when executed on distributed-memory systems, i.e. computing clusters and supercomputers hosting memory-independent computing nodes. The most computationally demanding steps of the MATT algorithm - the initial construction of pairwise alignments between all input structures and further iterative progression of the multiple alignment - were parallelized using MPI and pthreads, and the concluding refinement step was optimized by introducing the OpenMP support. The parMATT can significantly accelerate the time-consuming process of building a multiple structural alignment from a large set of 3D-records of homologous proteins. Availability and implementation: The source code is available at https://biokinet.belozersky.msu.ru/parMATT. Supplementary information: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Popova N.N."
                    },
                    {
                        "name": "Shegay M.V."
                    },
                    {
                        "name": "Suplatov D.A."
                    },
                    {
                        "name": "Svedas V.K."
                    },
                    {
                        "name": "Voevodin V.V."
                    }
                ],
                "citationCount": 18,
                "date": "2019-11-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "ParMATT: Parallel multiple alignment of protein 3D-structures with translations and twists for distributed-memory systems"
            },
            "pmid": "30918940"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        }
    ]
}
