
{
    "credit": [
        {
            "name": "SIB Swiss Institute of Bioinformatics",
            "typeRoles": [
            ],
            "url": "http://www.sib.swiss"
        },
        {
            "name": "Evolutionary Systems Biology Group - University of Zurich",
            "typeRoles": [
            ],
            "url": "http://www.sib.swiss/wagner-andreas/wagner-andreas-sub"
        },
        {
            "email": "joshua.payne@ieu.uzh.ch",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "http://ieu-genonets.uzh.ch/learn"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://ieu-genonets.uzh.ch/python_package"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Genotype/phenotype report",
                        "uri": "http://edamontology.org/data_0920"
                    },
                    "format": [
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Network simulation",
                    "uri": "http://edamontology.org/operation_3562"
                },
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Pathway or network",
                        "uri": "http://edamontology.org/data_2600"
                    }
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Web application"
        ],
        "topic": [
            {
                "term": "Evolutionary biology",
                "uri": "http://edamontology.org/topic_3299"
            },
            {
                "term": "Systems biology",
                "uri": "http://edamontology.org/topic_2259"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author(s) 2016. Published by Oxford University Press on behalf of Nucleic Acids Research. A genotype network is a graph in which vertices represent genotypes that have the same phenotype. Edges connect vertices if their corresponding genotypes differ in a single small mutation. Genotype networks are used to study the organization of genotype spaces. They have shed light on the relationship between robustness and evolvability in biological systems as different as RNA macromolecules and transcriptional regulatory circuits. Despite the importance of genotype networks, no tool exists for their automatic construction, analysis and visualization. Here we fill this gap by presenting the Genonets Server, a tool that provides the following features: (i) the construction of genotype networks for categorical and univariate phenotypes from DNA, RNA, amino acid or binary sequences; (ii) analyses of genotype network topology and how it relates to robustness and evolvability, as well as analyses of genotype network topography and how it relates to the navigability of a genotype network via mutation and natural selection; (iii) multiple interactive visualizations that facilitate exploratory research and education. The Genonets Server is freely available at http://ieu-genonets.uzh.ch.",
            "authors": [
                "Khalid F.",
                "Aguilar-Rodriguez J.",
                "Wagner A.",
                "Payne J.L."
            ],
            "cit_count": 3,
            "doi": "10.1093/nar/gkw313",
            "journal": "Nucleic acids research",
            "title": "Genonets server-a web server for the construction, analysis and visualization of genotype networks",
            "year": "2016-07-08"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:genonets",
        "biotoolsID": "genonets",
        "description": "A genotype network is a graph in which vertices represent genotypes that have the same phenotype. This tool provides the following features: (i) the construction of genotype networks for categorical and univariate phenotypes; (ii) analyses of genotype network topology and how it relates to robustness and evolvability, as well as analyses of genotype network topography and how it relates to the navigability of a genotype network; (iii) multiple interactive visualizations.",
        "homepage": "http://ieu-genonets.uzh.ch",
        "name": "Genonets"
    }
}