{
    "additionDate": "2024-02-22T13:20:37.052399Z",
    "biotoolsCURIE": "biotools:genz_explorer",
    "biotoolsID": "genz_explorer",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "aroberts@foodsystems.org",
            "name": "Andrew Roberts",
            "typeEntity": "Person"
        }
    ],
    "description": "Tool for visualizing agroclimate to inform research and regulatory risk assessment.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://foodsystems.org/resources/genz/",
    "lastUpdate": "2024-02-22T13:20:37.055793Z",
    "name": "GEnZ Explorer",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/S11248-023-00354-W",
            "metadata": {
                "abstract": "Confined field trials (CFT) of genetically engineered (GE) crops are used to generate data to inform environmental risk assessments (ERA). ERAs are required by regulatory authorities before novel GE crops can be released for cultivation. The transportability of CFT data to inform risk assessment in countries other than those where the CFT was conducted has been discussed previously in an analysis showing that the primary difference between CFT locations potentially impacting trial outcomes is the physical environment, particularly the agroclimate. This means that data from trials carried out in similar agroclimates could be considered relevant and sufficient to satisfy regulatory requirements for CFT data, irrespective of the country where the CFTs are conducted. This paper describes the development of an open-source tool to assist in determining the transportability of CFT data. This tool provides agroclimate together with overall crop production information to assist regulators and applicants in making informed choices on whether data from previous CFTs can inform an environmental risk assessment in a new country, as well as help developers determine optimal locations for planning future CFTs. The GEnZ Explorer is a freely available, thoroughly documented, and open-source tool that allows users to identify the agroclimate zones that are relevant for the production of 21 major crops and crop categories or to determine the agroclimatic zone at a specific location. This tool will help provide additional scientific justification for CFT data transportability, along with spatial visualization, to help ensure regulatory transparency.",
                "authors": [
                    {
                        "name": "Garcia-Alonso M."
                    },
                    {
                        "name": "Hendley P."
                    },
                    {
                        "name": "Jarvis L."
                    },
                    {
                        "name": "Melnick R.L."
                    },
                    {
                        "name": "Metzger M.J."
                    },
                    {
                        "name": "Ramankutty N."
                    },
                    {
                        "name": "Roberts A."
                    },
                    {
                        "name": "Teem J.L."
                    }
                ],
                "date": "2023-08-01T00:00:00Z",
                "journal": "Transgenic Research",
                "title": "GEnZ explorer: a tool for visualizing agroclimate to inform research and regulatory risk assessment"
            },
            "pmcid": "PMC10409678",
            "pmid": "37278871"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Biological databases",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Genetic engineering",
            "uri": "http://edamontology.org/topic_3912"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ]
}
