{
    "additionDate": "2024-04-18T13:41:16.316985Z",
    "biotoolsCURIE": "biotools:twnbiome",
    "biotoolsID": "twnbiome",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "chuangey@ntu.edu.tw",
            "name": "Eric Y. Chuang",
            "typeEntity": "Person"
        },
        {
            "email": "tplu@ntu.edu.tw",
            "name": "Tzu-Pin Lu",
            "typeEntity": "Person"
        }
    ],
    "description": "A public database of the healthy taiwanese gut microbiome.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://twnbiome.cgm.ntu.edu.tw/",
    "lastUpdate": "2024-04-18T13:41:16.319370Z",
    "name": "Twnbiome",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-023-05585-6",
            "metadata": {
                "abstract": "With new advances in next generation sequencing (NGS) technology at reduced costs, research on bacterial genomes in the environment has become affordable. Compared to traditional methods, NGS provides high-throughput sequencing reads and the ability to identify many species in the microbiome that were previously unknown. Numerous bioinformatics tools and algorithms have been developed to conduct such analyses. However, in order to obtain biologically meaningful results, the researcher must select the proper tools and combine them to construct an efficient pipeline. This complex procedure may include tens of tools, each of which require correct parameter settings. Furthermore, an NGS data analysis involves multiple series of command-line tools and requires extensive computational resources, which imposes a high barrier for biologists and clinicians to conduct NGS analysis and even interpret their own data. Therefore, we established a public gut microbiome database, which we call Twnbiome, created using healthy subjects from Taiwan, with the goal of enabling microbiota research for the Taiwanese population. Twnbiome provides users with a baseline gut microbiome panel from a healthy Taiwanese cohort, which can be utilized as a reference for conducting case-control studies for a variety of diseases. It is an interactive, informative, and user-friendly database. Twnbiome additionally offers an analysis pipeline, where users can upload their data and download analyzed results. Twnbiome offers an online database which non-bioinformatics users such as clinicians and doctors can not only utilize to access a control set of data, but also analyze raw data with a few easy clicks. All results are customizable with ready-made plots and easily downloadable tables. Database URL: http://twnbiome.cgm.ntu.edu.tw/ .",
                "authors": [
                    {
                        "name": "Chattopadhyay A."
                    },
                    {
                        "name": "Chen H.-K."
                    },
                    {
                        "name": "Chiu H.-M."
                    },
                    {
                        "name": "Chuang E.Y."
                    },
                    {
                        "name": "Lai L.-C."
                    },
                    {
                        "name": "Lee C.-Y."
                    },
                    {
                        "name": "Lee Y.-C."
                    },
                    {
                        "name": "Li Y.-H."
                    },
                    {
                        "name": "Liu C.-L."
                    },
                    {
                        "name": "Lu T.-P."
                    },
                    {
                        "name": "Ni Y.-H."
                    },
                    {
                        "name": "Tsai M.-H."
                    }
                ],
                "date": "2023-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Twnbiome: a public database of the healthy Taiwanese gut microbiome"
            },
            "pmcid": "PMC10722848",
            "pmid": "38097965"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Biological databases",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
