{
    "additionDate": "2021-01-18T10:31:58Z",
    "biotoolsCURIE": "biotools:ohd",
    "biotoolsID": "ohd",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "wdduncan@gmail.com",
            "name": "William D. Duncan",
            "orcidid": "https://orcid.org/0000-0001-9625-1899",
            "typeEntity": "Person"
        }
    ],
    "description": "Structuring, reuse and analysis of electronic dental data using the Oral Health and Disease Ontology.\n\nWe need a standardized approach that enables efficient access to information in Electronic Dental Records, and integration across different dental care providers and EHR systems.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Ontology visualisation",
                    "uri": "http://edamontology.org/operation_3559"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/oral-health-and-disease-ontologies/ohd-ontology",
    "language": [
        "Lisp",
        "R"
    ],
    "lastUpdate": "2021-03-13T18:57:22Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/oral-health-and-disease-ontologies/ohd-ontology/blob/master/src/analysis/survival.r"
        }
    ],
    "name": "OHD",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S13326-020-00222-0",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: A key challenge for improving the quality of health care is to be able to use a common framework to work with patient information acquired in any of the health and life science disciplines. Patient information collected during dental care exposes many of the challenges that confront a wider scale approach. For example, to improve the quality of dental care, we must be able to collect and analyze data about dental procedures from multiple practices. However, a number of challenges make doing so difficult. First, dental electronic health record (EHR) information is often stored in complex relational databases that are poorly documented. Second, there is not a commonly accepted and implemented database schema for dental EHR systems. Third, integrative work that attempts to bridge dentistry and other settings in healthcare is made difficult by the disconnect between representations of medical information within dental and other disciplines' EHR systems. As dentistry increasingly concerns itself with the general health of a patient, for example in increased efforts to monitor heart health and systemic disease, the impact of this disconnect becomes more and more severe. To demonstrate how to address these problems, we have developed the open-source Oral Health and Disease Ontology (OHD) and our instance-based representation as a framework for dental and medical health care information. We envision a time when medical record systems use a common data back end that would make interoperating trivial and obviate the need for a dedicated messaging framework to move data between systems. The OHD is not yet complete. It includes enough to be useful and to demonstrate how it is constructed. We demonstrate its utility in an analysis of longevity of dental restorations. Our first narrow use case provides a prototype, and is intended demonstrate a prospective design for a principled data backend that can be used consistently and encompass both dental and medical information in a single framework. Results: The OHD contains over 1900 classes and 59 relationships. Most of the classes and relationships were imported from existing OBO Foundry ontologies. Using the LSW2 (LISP Semantic Web) software library, we translated data from a dental practice's EHR system into a corresponding Web Ontology Language (OWL) representation based on the OHD framework. The OWL representation was then loaded into a triple store, and as a proof of concept, we addressed a question of clinical relevance - a survival analysis of the longevity of resin filling restorations. We provide queries using SPARQL and statistical analysis code in R to demonstrate how to perform clinical research using a framework such as the OHD, and we compare our results with previous studies. Conclusions: This proof-of-concept project translated data from a single practice. By using dental practice data, we demonstrate that the OHD and the instance-based approach are sufficient to represent data generated in real-world, routine clinical settings. While the OHD is applicable to integration of data from multiple practices with different dental EHR systems, we intend our work to be understood as a prospective design for EHR data storage that would simplify medical informatics. The system has well-understood semantics because of our use of BFO-based realist ontology and its representation in OWL. The data model is a well-defined web standard.",
                "authors": [
                    {
                        "name": "Acharya A."
                    },
                    {
                        "name": "Caplan D.J."
                    },
                    {
                        "name": "Duncan W.D."
                    },
                    {
                        "name": "Haendel M."
                    },
                    {
                        "name": "Hernandez P."
                    },
                    {
                        "name": "Ruttenberg A."
                    },
                    {
                        "name": "Schleyer T."
                    },
                    {
                        "name": "Song M."
                    },
                    {
                        "name": "Thyvalikakath T."
                    },
                    {
                        "name": "Torniai C."
                    }
                ],
                "citationCount": 1,
                "date": "2020-08-20T00:00:00Z",
                "journal": "Journal of Biomedical Semantics",
                "title": "Structuring, reuse and analysis of electronic dental data using the Oral Health and Disease Ontology"
            },
            "pmcid": "PMC7439527",
            "pmid": "32819435"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biological databases",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Dentistry",
            "uri": "http://edamontology.org/topic_3405"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Medicines research and development",
            "uri": "http://edamontology.org/topic_3376"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        }
    ]
}
