
{
    "credit": [
        {
            "email": "yzhuangliu@gmail.com",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://github.com/yongzhuang/TrioCNV"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Structural variation detection",
                    "uri": "http://edamontology.org/operation_3228"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R",
            "Java"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Whole genome sequencing",
                "uri": "http://edamontology.org/topic_3673"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Genetic variation",
                "uri": "http://edamontology.org/topic_0199"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/triocnv-joint-detection-of-copy-number-variations-in-parent-offspring-trios.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2015 The Author. All rights reserved.Motivation: Whole genome sequencing (WGS) of parent-offspring trios is a powerful approach for identifying disease-associated genes via detecting copy number variations (CNVs). Existing approaches, which detect CNVs for each individual in a trio independently, usually yield low-detection accuracy. Joint modeling approaches leveraging Mendelian transmission within the parent-offspring trio can be an efficient strategy to improve CNV detection accuracy. Results: In this study, we developed TrioCNV, a novel approach for jointly detecting CNVs in parent-offspring trios from WGS data. Using negative binomial regression, we modeled the read depth signal while considering both GC content bias and mappability bias. Moreover, we incorporated the family relationship and used a hidden Markov model to jointly infer CNVs for three samples of a parent-offspring trio. Through application to both simulated data and a trio from 1000 Genomes Project, we showed that TrioCNV achieved superior performance than existing approaches.",
            "authors": [
                "Liu Y.",
                "Liu J.",
                "Lu J.",
                "Peng J.",
                "Juan L.",
                "Zhu X.",
                "Li B.",
                "Wang Y."
            ],
            "cit_count": 2,
            "journal": "Bioinformatics",
            "pmid": "26644415",
            "title": "Joint detection of copy number variations in parent-offspring trios",
            "year": "2016-04-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:triocnv",
        "biotoolsID": "triocnv",
        "description": "A tool designed to jointly detect CNVs from WGS data in parent-offspring trios.  It models read depth signal with the negative binomial regression to accommodate over-dispersion and considered GC content and mappability bias.",
        "homepage": "https://github.com/yongzhuang/TrioCNV",
        "name": "TrioCNV"
    }
}