{"credit":[],"function":[{"operation":[{"term":"Essential dynamics","uri":"http://edamontology.org/operation_3891"},{"term":"Visualisation","uri":"http://edamontology.org/operation_0337"},{"term":"Mapping","uri":"http://edamontology.org/operation_2429"}]}],"labels":{"topic":[{"term":"Mapping","uri":"http://edamontology.org/topic_0102"},{"term":"Imaging","uri":"http://edamontology.org/topic_3382"},{"term":"Computer science","uri":"http://edamontology.org/topic_3316"}]},"publication":[{"abstract":"© MDPI AG. All rights reserved.As mobile mapping systems become a mature technology, there are many applications for the process of the measured data. One interesting application is the use of driving simulators that can be used to analyze the data of tire vibration or vehicle simulations. In previous research, we presented our proposed method that can create a precise three-dimensional point cloud model of road surface regions and trajectory points. Our data sets were obtained by a vehicle-mounted mobile mapping system (MMS). The collected data were converted into point cloud data and color images. In this paper, we utilize the previous results as input data and present a solution that can generate an elevation grid for building an OpenCRG model. The OpenCRG project was originally developed to describe road surface elevation data, and also defined an open file format. As it can be difficult to generate a regular grid from point cloud directly, the road surface is first divided into straight lines, circular arcs, and and clothoids. Secondly, a non-regular grid which contains the elevation of road surface points is created for each road surface segment. Then, a regular grid is generated by accurately interpolating the elevation values from the non-regular grid. Finally, the curved regular grid (CRG) model files are created based on the above procedures, and can be visualized by OpenCRG tools. The experimental results on real-world data show that the proposed approach provided a very-high-resolution road surface elevation model.","authors":["Su J.","Miyazaki R.","Tamaki T.","Kaneda K."],"cit_count":0,"doi":"10.3390/S19245373","journal":"Sensors (Switzerland)","pmid":"31817491","title":"High-resolution representation for mobile mapping data in curved regular grid model","year":"2019-12-02"}],"summary":{"biotoolsCURIE":"biotools:OpenCRG","biotoolsID":"OpenCRG","description":"High-Resolution Representation for Mobile Mapping Data in Curved Regular Grid Model.\n\nWelcome to the World of OpenCRG®!.\n\nThe OpenCRG® initiative was launched in October 2008. Its objective is the provision of a series of open file formats and open source tools for the detailed description, creation and evaluation of road surfaces. It is suitable for a broad range of applications including e.g. tyre and driving simulations.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'road', 'road surface', 'elevation'","homepage":"http://www.opencrg.org/","name":"OpenCRG"}}