{
    "additionDate": "2020-01-09T18:10:39Z",
    "biotoolsCURIE": "biotools:LASSI",
    "biotoolsID": "LASSI",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "pappu@wustl.edu",
            "name": "Rohit V. Pappu",
            "orcidid": "https://orcid.org/0000-0003-2568-1378",
            "typeEntity": "Person"
        }
    ],
    "description": "A lattice model for simulating phase transitions of multivalent proteins.\n\nMany biomolecular condensates form via spontaneous phase transitions that are driven by multivalent proteins. These molecules are biological instantiations of associative polymers that conform to a so-called stickers-and-spacers architecture. The stickers are protein-protein or protein-RNA interaction motifs and or domains that can form reversible, non-covalent crosslinks with one another. Spacers are interspersed between stickers and their preferential interactions with solvent molecules determine the cooperativity of phase transitions. Here, we report the development of an open source computational engine known as LASSI (LAttice simulation engine for Sticker and Spacer Interactions) that enables the calculation of full phase diagrams for multicomponent systems comprising of coarse-grained representations of multivalent proteins.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Protein-protein interaction analysis",
                    "uri": "http://edamontology.org/operation_2949"
                },
                {
                    "term": "Forcefield parameterisation",
                    "uri": "http://edamontology.org/operation_3893"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Pappulab/LASSI",
    "lastUpdate": "2020-12-22T10:21:13Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/Pappulab/LASSI"
        }
    ],
    "name": "LASSI",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1007028",
            "metadata": {
                "abstract": "© 2019 Choi et al.Many biomolecular condensates form via spontaneous phase transitions that are driven by multivalent proteins. These molecules are biological instantiations of associative polymers that conform to a so-called stickers-and-spacers architecture. The stickers are protein-protein or protein-RNA interaction motifs and / or domains that can form reversible, non-covalent crosslinks with one another. Spacers are interspersed between stickers and their preferential interactions with solvent molecules determine the cooperativity of phase transitions. Here, we report the development of an open source computational engine known as LASSI (LAttice simulation engine for Sticker and Spacer Interactions) that enables the calculation of full phase diagrams for multicomponent systems comprising of coarse-grained representations of multivalent proteins. LASSI is designed to enable computationally efficient phenomenological modeling of spontaneous phase transitions of multicomponent mixtures comprising of multivalent proteins and RNA molecules. We demonstrate the application of LASSI using simulations of linear and branched multivalent proteins. We show that dense phases are best described as droplet-spanning networks that are characterized by reversible physical crosslinks among multivalent proteins. We connect recent observations regarding correlations between apparent stoichiometry and dwell times of condensates to being proxies for the internal structural organization, specifically the convolution of internal density and extent of networking, within condensates. Finally, we demonstrate that the concept of saturation concentration thresholds does not apply to multicomponent systems where obligate heterotypic interactions drive phase transitions. This emerges from the ellipsoidal structures of phase diagrams for multicomponent systems and it has direct implications for the regulation of biomolecular condensates in vivo.",
                "authors": [
                    {
                        "name": "Choi J.-M."
                    },
                    {
                        "name": "Dar F."
                    },
                    {
                        "name": "Pappu R.V."
                    }
                ],
                "citationCount": 57,
                "date": "2019-01-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "LASSI: A lattice model for simulating phase transitions of multivalent proteins"
            },
            "pmcid": "PMC6822780",
            "pmid": "31634364"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        }
    ],
    "validated": 1
}