{
    "additionDate": "2021-01-18T11:31:46Z",
    "biotoolsCURIE": "biotools:kd-klnmf",
    "biotoolsID": "kd-klnmf",
    "confidence_flag": "tool",
    "description": "Identification of lncRNAs subcellular localization with multiple features and nonnegative matrix factorization.\n\nLong non-coding RNAs (lncRNAs) refer to functional RNA molecules with a length more than 200 nucleotides and have minimal or no function to encode proteins. In recent years, more studies show that lncRNAs subcellular localization has valuable clues for their biological functions. So it is count for much to identify lncRNAs subcellular localization. In this paper, a novel statistical model named KD-KLNMF is constructed to predict lncRNAs subcellular localization. Firstly, k-mer and dinucleotide-based spatial autocorrelation are incorporated as the feature vector. Then, Synthetic Minority Over-sampling Technique is used to deal with the imbalance dataset. Next, Kullback-Leibler divergence-based nonnegative matrix factorization is applied to select optimal features. And then we utilize support vector machine as the classifier after comparing with other classifiers",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                },
                {
                    "term": "k-mer counting",
                    "uri": "http://edamontology.org/operation_3472"
                }
            ]
        }
    ],
    "homepage": "https://github.com/HuijuanQiao/KD-KLNMF",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-02-12T10:22:11Z",
    "name": "KD-KLNMF",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/J.AB.2020.113995",
            "metadata": {
                "abstract": "© 2020 Elsevier Inc.Long non-coding RNAs (lncRNAs) refer to functional RNA molecules with a length more than 200 nucleotides and have minimal or no function to encode proteins. In recent years, more studies show that lncRNAs subcellular localization has valuable clues for their biological functions. So it is count for much to identify lncRNAs subcellular localization. In this paper, a novel statistical model named KD-KLNMF is constructed to predict lncRNAs subcellular localization. Firstly, k-mer and dinucleotide-based spatial autocorrelation are incorporated as the feature vector. Then, Synthetic Minority Over-sampling Technique is used to deal with the imbalance dataset. Next, Kullback-Leibler divergence-based nonnegative matrix factorization is applied to select optimal features. And then we utilize support vector machine as the classifier after comparing with other classifiers. Finally, the jackknife test is performed to evaluate the model. The overall accuracies reach 97.24% and 92.86% on training dataset and independent dataset, respectively. The results are better than the previous methods, which indicate that our model will be a useful and feasible tool to identify lncRNAs subcellular localization. The datasets and source code are freely available at https://github.com/HuijuanQiao/KD-KLNMF.",
                "authors": [
                    {
                        "name": "Qiao H."
                    },
                    {
                        "name": "Zhang S."
                    }
                ],
                "citationCount": 3,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Analytical Biochemistry",
                "title": "KD-KLNMF: Identification of lncRNAs subcellular localization with multiple features and nonnegative matrix factorization"
            },
            "pmid": "33080214"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        }
    ]
}
