{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://pharm.ucsf.edu/degrado"}],"function":[{"operation":[{"term":"Search","uri":"http://edamontology.org/operation_2421"}]}],"labels":{"language":["Python"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Molecular modelling","uri":"http://edamontology.org/topic_2275"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/suns-protein-structural-search-engine.html"}],"publication":[{"abstract":"Protein designers use a wide variety of software tools for de novo design, yet their repertoire still lacks a fast and interactive all-atom search engine. To solve this, we have built the Suns program: a real-time, atomic search engine integrated into the PyMOL molecular visualization system. Users build atomic-level structural search queries within PyMOL and receive a stream of search results aligned to their query within a few seconds. This instant feedback cycle enables a new \"designability\"-inspired approach to protein design where the designer searches for and interactively incorporates native-like fragments from proven protein structures. We demonstrate the use of Suns to interactively build protein motifs, tertiary interactions, and to identify scaffolds compatible with hot-spot residues. The official web site and installer are located at http://www.degradolab.org/suns/ and the source code is hosted at https://github.com/godotgildor/Suns (PyMOL plugin, BSD license), https://github.com/Gabriel439/suns-cmd (command line client, BSD license), and https://github.com/Gabriel439/sunssearch (search engine server, GPLv2 license).","authors":["Gonzalez G.","Hannigan B.","DeGrado W.F."],"cit_count":5,"doi":"10.1371/journal.pcbi.1003750","journal":"PLoS Computational Biology","title":"A Real-Time All-Atom Structural Search Engine for Proteins","type":"Primary","year":"2014-01-01"}],"summary":{"biotoolsCURIE":"biotools:suns","biotoolsID":"suns","description":"Suns provides the missing search engine for the Protein Data Bank complete with a PyMOL interface","homepage":"http://degradolab.org/suns/","name":"Suns"}}