{
    "additionDate": "2023-11-25T09:36:19.946685Z",
    "biotoolsCURIE": "biotools:rera",
    "biotoolsID": "rera",
    "credit": [
        {
            "email": "marco.masseroli@polimi.it",
            "name": "Marco Masseroli",
            "orcidid": "https://orcid.org/0000-0003-2574-1174",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "silvia.cascianelli@polimi.it",
            "name": "Silvia Cascianelli",
            "orcidid": "https://orcid.org/0000-0002-5628-9101",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "Arianna Galzerano",
            "typeEntity": "Person",
            "typeRole": [
                "Contributor"
            ]
        },
        {
            "name": "ELIXIR-ITA",
            "typeEntity": "Project",
            "url": "https://elixir-italy.org"
        },
        {
            "name": "ELIXIR-ITA-POLIMI",
            "typeEntity": "Project",
            "url": "https://www.deib.polimi.it/eng/elixir-iib"
        }
    ],
    "description": "ReRa is a relevance-redundancy feature selection approach that improves the performance of an expression-based predictive model in unbalanced classification.",
    "download": [
        {
            "note": "Jupyter notebooks",
            "type": "Source code",
            "url": "https://github.com/DEIB-GECO/ReRa"
        }
    ],
    "editPermission": {
        "type": "group"
    },
    "elixirNode": [
        "Italy"
    ],
    "elixirPlatform": [
        "Tools"
    ],
    "homepage": "https://github.com/DEIB-GECO/ReRa",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-11-28T21:36:18.355939Z",
    "name": "ReRa",
    "owner": "ELIXIR-ITA-POLIMI",
    "publication": [
        {
            "doi": "10.1016/j.jbi.2023.104457",
            "metadata": {
                "abstract": "Background and objective: Many classification tasks in translational bioinformatics and genomics are characterized by the high dimensionality of potential features and unbalanced sample distribution among classes. This can affect classifier robustness and increase the risk of overfitting, curse of dimensionality and generalization leaks; furthermore and most importantly, this can prevent obtaining adequate patient stratification required for precision medicine in facing complex diseases, like cancer. Setting up a feature selection strategy able to extract only proper predictive features by removing irrelevant, redundant, and noisy ones is crucial to achieving valuable results on the desired task. Methods: We propose a new feature selection approach, called ReRa, based on supervised Relevance-Redundancy assessments. ReRa consists of a customized step of relevance-based filtering, to identify a reduced subset of meaningful features, followed by a supervised similarity-based procedure to minimize redundancy. This latter step innovatively uses a combination of global and class-specific similarity assessments to remove redundant features while preserving those differentiated across classes, even when these classes are strongly unbalanced. Results: We compared ReRa with several existing feature selection methods to obtain feature spaces on which performing breast cancer patient subtyping using several classifiers: we considered two use cases based on gene or transcript isoform expression. In the vast majority of the assessed scenarios, when using ReRa-selected feature spaces, the performances were significantly increased compared to simple feature filtering, LASSO regularization, or even MRmr — another Relevance-Redundancy method. The two use cases represent an insightful example of translational application, taking advantage of ReRa capabilities to investigate and enhance a clinically-relevant patient stratification task, which could be easily applied also to other cancer types and diseases. Conclusions: ReRa approach has the potential to improve the performance of machine learning models used in an unbalanced classification scenario. Compared to another Relevance-Redundancy approach like MRmr, ReRa does not require tuning the number of preserved features, ensures efficiency and scalability over huge initial dimensionalities and allows re-evaluation of all previously selected features at each iteration of the redundancy assessment, to ultimately preserve only the most relevant and class-differentiated features.",
                "authors": [
                    {
                        "name": "Cascianelli S."
                    },
                    {
                        "name": "Galzerano A."
                    },
                    {
                        "name": "Masseroli M."
                    }
                ],
                "date": "2023-08-01T00:00:00Z",
                "journal": "Journal of Biomedical Informatics",
                "title": "Supervised Relevance-Redundancy assessments for feature selection in omics-based classification scenarios"
            }
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
