{
    "additionDate": "2025-05-22T17:46:59.585364Z",
    "biotoolsCURIE": "biotools:mainzelliste",
    "biotoolsID": "mainzelliste",
    "collectionID": [
        "EUCAIM",
        "Samply",
        "eucaim"
    ],
    "cost": "Free of charge",
    "description": "Mainzelliste is a web-based first-level pseudonymization service. It allows for the creation of personal identifiers (PID) from identifying attributes (IDAT), and thanks to the record linkage functionality, this is even possible with poor quality identifying data. The functions are available through a RESTful web interface.",
    "documentation": [
        {
            "type": [
                "Installation instructions"
            ],
            "url": "https://bitbucket.org/medicalinformatics/mainzelliste/src/be269ba9466d022d6c691f9a78bd6e45f0abca8c/doc/getting-started.md"
        }
    ],
    "editPermission": {
        "authors": [
            "tkussel"
        ],
        "type": "group"
    },
    "homepage": "https://bitbucket.org/medicalinformatics/mainzelliste/",
    "lastUpdate": "2025-05-23T07:01:19.349987Z",
    "license": "AGPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://bitbucket.org/medicalinformatics/mainzelliste"
        },
        {
            "type": [
                "Software catalogue"
            ],
            "url": "https://helmholtz.software/software/mainzelliste"
        }
    ],
    "maturity": "Mature",
    "name": "Mainzelliste",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "enola",
    "publication": [
        {
            "doi": "10.1186/s12911-014-0123-5",
            "metadata": {
                "abstract": "Background: Medical research networks rely on record linkage and pseudonymization to determine which records from different sources relate to the same patient. To establish informational separation of powers, the required identifying data are redirected to a trusted third party that has, in turn, no access to medical data. This pseudonymization service receives identifying data, compares them with a list of already reported patient records and replies with a (new or existing) pseudonym. We found existing solutions to be technically outdated, complex to implement or not suitable for internet-based research infrastructures. In this article, we propose a new RESTful pseudonymization interface tailored for use in web applications accessed by modern web browsers. Methods: The interface is modelled as a resource-oriented architecture, which is based on the representational state transfer (REST) architectural style. We translated typical use-cases into resources to be manipulated with well-known HTTP verbs. Patients can be re-identified in real-time by authorized users' web browsers using temporary identifiers. We encourage the use of PID strings for pseudonyms and the EpiLink algorithm for record linkage. As a proof of concept, we developed a Java Servlet as reference implementation. Results: The following resources have been identified: Sessions allow data associated with a client to be stored beyond a single request while still maintaining statelessness. Tokens authorize for a specified action and thus allow the delegation of authentication. Patients are identified by one or more pseudonyms and carry identifying fields. Relying on HTTP calls alone, the interface is firewall-friendly. The reference implementation has proven to be production stable. Conclusion: The RESTful pseudonymization interface fits the requirements of web-based scenarios and allows building applications that make pseudonymization transparent to the user using ordinary web technology. The open-source reference implementation implements the web interface as well as a scientifically grounded algorithm to generate non-speaking pseudonyms.",
                "authors": [
                    {
                        "name": "Borg A."
                    },
                    {
                        "name": "Lablans M."
                    },
                    {
                        "name": "Uckert F."
                    }
                ],
                "citationCount": 70,
                "date": "2015-02-07T00:00:00Z",
                "journal": "BMC Medical Informatics and Decision Making",
                "title": "A RESTful interface to pseudonymization services in modern web applications"
            },
            "pmcid": "PMC4350982",
            "pmid": "25656224",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web API"
    ],
    "topic": [
        {
            "term": "Data identity and mapping",
            "uri": "http://edamontology.org/topic_3345"
        },
        {
            "term": "Data protection",
            "uri": "http://edamontology.org/topic_4044"
        }
    ],
    "version": [
        "v1.13.0"
    ]
}
