{
    "additionDate": "2021-01-18T12:12:38Z",
    "biotoolsCURIE": "biotools:vtr",
    "biotoolsID": "vtr",
    "confidence_flag": "tool",
    "description": "Timely Reliability Analysis of Virtual Machines Considering Migration and Recovery in an Edge Server.\n\nVTR is a WebTool for contacts alignments between proteins and others macromolecules. an algorithm for identifying analogous contacts on protein structures and their complexes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Contact map calculation",
                    "uri": "http://edamontology.org/operation_0392"
                },
                {
                    "term": "Residue contact prediction",
                    "uri": "http://edamontology.org/operation_0272"
                },
                {
                    "term": "Salt bridge calculation",
                    "uri": "http://edamontology.org/operation_1839"
                },
                {
                    "term": "Structure alignment",
                    "uri": "http://edamontology.org/operation_0295"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.dcc.ufmg.br/vtr",
    "lastUpdate": "2021-03-14T10:33:51Z",
    "name": "VTR",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.21203/RS.3.RS-82599/V2"
        },
        {
            "doi": "10.3390/S21010093",
            "metadata": {
                "abstract": "© 2020 by the authors. Licensee MDPI, Basel, Switzerland.For the edge computing network, whether the end-to-end delay satisfies the delay constraint of the task is critical, especially for delay-sensitive tasks. Virtual machine (VM) migration improves the robustness of the network, whereas it also causes service downtime and increases the end-to-end delay. To study the influence of failure, migration, and recovery of VMs, we define three states for the VMs in an edge server and build a continuous-time Markov chain (CTMC). Then, we develop a matrix-geometric method and a first passage time method to obtain the VMs timely reliability (VTR) and the end-to-end timely reliability (ETR). The numerical results are verified by simulation based on OMNeT++. Results show that VTR is a monotonic function of the migration rate and the number of VMs. However, in some cases, the increase in task VMs (TVMs) may conversely decrease VTR, since more TVMs also brings about more failures in a given time. Moreover, we find that there is a trade-off between TVMs and backup VMs (BVMs) when the total number of VMs is limited. Our findings may shed light on understanding the impact of VM migration on end-to-end delay and designing a more reliable edge computing network for delay-sensitive applications.",
                "authors": [
                    {
                        "name": "Chen X."
                    },
                    {
                        "name": "Guo L."
                    },
                    {
                        "name": "Liu K."
                    },
                    {
                        "name": "Wang Y."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Sensors (Switzerland)",
                "title": "Timely reliability analysis of virtual machines considering migration and recovery in an edge server"
            },
            "pmid": "33375704"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
