{
    "additionDate": "2017-08-20T15:49:08Z",
    "biotoolsCURIE": "biotools:faststructure",
    "biotoolsID": "faststructure",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "email": "rajanil@stanford.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "fastStructure is an algorithm for inferring population structure from large SNP genotype data. It is based on a variational Bayesian framework for posterior inference and is written in Python2.x.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/rajanil/fastStructure/blob/master/README.md"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "homepage": "http://rajanil.github.io/fastStructure/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2019-09-04T08:38:04Z",
    "license": "MIT",
    "name": "fastSTRUCTURE",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1534/genetics.114.164350",
            "metadata": {
                "abstract": "Tools for estimating population structure from genetic data are now used in a wide variety of applications in population genetics. However, inferring population structure in large modern data sets imposes severe computational challenges. Here, we develop efficient algorithms for approximate inference of the model underlying the STRUCTURE program using a variational Bayesian framework. Variational methods pose the problem of computing relevant posterior distributions as an optimization problem, allowing us to build on recent advances in optimization theory to develop fast inference tools. In addition, we propose useful heuristic scores to identify the number of populations represented in a data set and a new hierarchical prior to detect weak population structure in the data. We test the variational algorithms on simulated data and illustrate using genotype data from the CEPH-Human Genome Diversity Panel. The variational algorithms are almost two orders of magnitude faster than STRUCTURE and achieve accuracies comparable to those of ADMIXTURE. Furthermore, our results show that the heuristic scores for choosing model complexity provide a reasonable range of values for the number of populations represented in the data, with minimal bias toward detecting structure when it is very weak. Our algorithm, fastSTRUCTURE, is freely available online at http://pritchardlab.stanford.edu/structure.html. © 2014 by the Genetics Society of America.",
                "authors": [
                    {
                        "name": "Raj A."
                    },
                    {
                        "name": "Stephens M."
                    },
                    {
                        "name": "Pritchard J.K."
                    }
                ],
                "citationCount": 263,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Genetics",
                "title": "FastSTRUCTURE: Variational inference of population structure in large SNP data sets"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        }
    ],
    "validated": 1
}