
{
    "credit": [
        {
            "email": "jmrouill@umich.edu",
            "name": "Jean-Marie Rouillard",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://berry.engin.umich.edu/gene2oligo/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Sequence assembly",
                "uri": "http://edamontology.org/topic_0196"
            },
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            },
            {
                "term": "Probes and primers",
                "uri": "http://edamontology.org/topic_0632"
            },
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            },
            {
                "term": "Nucleic acid structure analysis",
                "uri": "http://edamontology.org/topic_0097"
            }
        ]
    },
    "publication": [
        {
            "abstract": "There is substantial interest in implementing a bioinformatics tool that allows the design of oligonucleotides to support the development of in vitro gene synthesis. Current protocols to make long synthetic DNA molecules rely on the in vitro assembly of a set of short oligonucleotides, either by ligase chain reaction (LCR) or by assembly PCR. Ideally, such oligonucleotides should represent both strands of the final DNA molecule. They should be adjacent on the same strand and overlap the complementary oligonucleotides from the second strand to ensure good hybridization during assembly. This implies that the thermodynamic properties of each oligonucleotide have to be consistent across the set. Furthermore, any given oligonucleotide has to be totally specific to its target to avoid the creation of incorrectly assembled sequences. We have developed Gene2Oligo (http://berry.engin.umich.edu/gene2oligo/), a web-based tool that divides a long input DNA sequence into a set of adjacent oligonucleotides representing both DNA strands. The length of the oligonucleotides is dynamically optimized to ensure both the specificity and the uniform melting temperatures necessary for in vitro gene synthesis. We have successfully designed and used a set of oligonucleotides to synthesize the Saccharomyces cerevisiae cytochrome b5 by using both LCR and assembly PCR. © Oxford University Press 2004; all rights reserved.",
            "authors": [
                "Rouillard J.-M.",
                "Lee W.",
                "Truan G.",
                "Gao X.",
                "Zhou X.",
                "Gulari E."
            ],
            "cit_count": 79,
            "journal": "Nucleic Acids Research",
            "pmid": "15215375",
            "title": "Gene2Oligo: Oligonucleotide design for in vitro gene synthesis",
            "year": "2004-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:gene2oligo",
        "biotoolsID": "gene2oligo",
        "description": "Tool which divides both strands of an input DNA sequence into a set of contiguous oligonucleotides.  These oligos are designed with complimentary regions so that the complete set can be combined to synthesize the input DNA sequence in vitro (using oligonucleotide synthesis and assembly PCR).",
        "homepage": "http://berry.engin.umich.edu/gene2oligo/",
        "name": "Gene2Oligo"
    }
}