{
    "additionDate": "2017-08-03T18:51:20Z",
    "biotoolsCURIE": "biotools:methylviewer",
    "biotoolsID": "methylviewer",
    "credit": [
        {
            "email": "i.m.carr@leeds.ac.uk",
            "name": "Ian Carr.",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://dna.leeds.ac.uk/"
        }
    ],
    "description": "This tool was developed from CpGviewer such that the program can now analyse up to four different methylation sites such as CpG, GpC, CpNpG or any four user defined sites. If a non-native DNA methylase is used to modify chromatin-bound DNA, the methylation pattern can be used to identify the binding sites of DNA-binding proteins.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://dna.leeds.ac.uk/methylviewer/guide/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Methylation analysis",
                    "uri": "http://edamontology.org/operation_3204"
                }
            ]
        }
    ],
    "homepage": "http://dna.leeds.ac.uk/methylviewer/",
    "language": [
        "Visual Basic"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/methylviewer-20120328-interactive-data-analysis-bisulphite-dna-sequencing-map-chromatin-structure-dna-methyltransferases.html"
        }
    ],
    "name": "MethylViewer",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Bisulfite sequencing is a widely-used technique for examining cytosine DNA methylation at nucleotide resolution along single DNA strands. Probing with cytosine DNA methyltransferases followed by bisulfite sequencing (MAPit) is an effective technique for mapping protein-DNA interactions. Here, MAPit methylation footprinting with M.CviPI, a GC methyltransferase we previously cloned and characterized, was used to probe hMLH1 chromatin in HCT116 and RKO colorectal cancer cells. Because M.CviPI-probed samples contain both CG and GC methylation, we developed a versatile, visually-intuitive program, called MethylViewer, for evaluating the bisulfite sequencing results. Uniquely, MethylViewer can simultaneously query cytosine methylation status in bisulfite-converted sequences at as many as four different user-defined motifs, e.g. CG, GC, etc., including motifs with degenerate bases. Data can also be exported for statistical analysis and as publication-quality images. Analysis of hMLH1 MAPit data with MethylViewer showed that endogenous CG methylation and accessible GC sites were both mapped on single molecules at high resolution. Disruption of positioned nucleosomes on single molecules of the PHO5 promoter was detected in budding yeast using M.CviPII, increasing the number of enzymes available for probing protein-DNA interactions. MethylViewer provides an integrated solution for primer design and rapid, accurate and detailed analysis of bisulfite sequencing or MAPit datasets from virtually any biological or biochemical system. © 2010 The Author(s).",
                "authors": [
                    {
                        "name": "Pardo C.E."
                    },
                    {
                        "name": "Carr I.M."
                    },
                    {
                        "name": "Hoffman C.J."
                    },
                    {
                        "name": "Darst R.P."
                    },
                    {
                        "name": "Markham A.F."
                    },
                    {
                        "name": "Bonthron D.T."
                    },
                    {
                        "name": "Kladde M.P."
                    }
                ],
                "citationCount": 22,
                "date": "2011-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "MethylViewer: Computational analysis and editing for bisulfite sequencing and methyltransferase accessibility protocol for individual templates (MAPit) projects"
            },
            "pmid": "20959287"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "DNA structural variation",
            "uri": "http://edamontology.org/topic_3175"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Nucleic acid sites, features and motifs",
            "uri": "http://edamontology.org/topic_3511"
        },
        {
            "term": "DNA binding sites",
            "uri": "http://edamontology.org/topic_3125"
        }
    ],
    "validated": 1
}