{
    "additionDate": "2021-01-18T12:03:29Z",
    "biotoolsCURIE": "biotools:csd-ism",
    "biotoolsID": "csd-ism",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Jörg Enderlein",
            "typeEntity": "Person"
        }
    ],
    "description": "Software for taking care of all algorithmic complexities and numerical workload of the CSD-ISM, including hardware synchronization and image reconstruction.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Microscope image visualisation",
                    "uri": "http://edamontology.org/operation_3552"
                },
                {
                    "term": "Service management",
                    "uri": "http://edamontology.org/operation_3760"
                }
            ]
        }
    ],
    "homepage": "https://projects.gwdg.de/projects/csdism-2020",
    "language": [
        "Java"
    ],
    "lastUpdate": "2021-02-18T17:31:45Z",
    "license": "GPL-3.0",
    "name": "CSD-ISM",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1038/S41596-020-00408-X",
            "metadata": {
                "abstract": "© 2020, The Author(s), under exclusive licence to Springer Nature Limited.Fluorescence microscopy has become an indispensable tool for cell biology. Recently, super-resolution methods have been developed to overcome the diffraction limit of light and have shown living cells in unprecedented detail. Often, these methods come at a high cost and with complexity in terms of instrumentation and sample preparation, thus calling for the development of low-cost, more accessible methods. We previously developed image scanning microscopy (ISM), which uses structured illumination to double the resolution and quadruple the contrast of a confocal microscope. Implementing this technique into a confocal spinning-disk (CSD) microscope allows recording ISM images with up to ~1 frame per second, making it ideal for imaging dynamic biological processes. Here we present a step-by-step protocol describing how to convert any existing commercial CSD microscope into a CSD-ISM, with only moderate changes to the hardware and at low cost. Operation of the CSD-ISM is realized with a field programmable gate array using the software environment Micro-Manager, a popular open-source platform for microscopy. The provided software (https://projects.gwdg.de/projects/csdism-2020) takes care of all algorithmic complexities and numerical workload of the CSD-ISM, including hardware synchronization and image reconstruction. The hardware modifications described here result in a theoretical maximum increase in resolution of √2 ≈ 1.41, which can be further improved by deconvolution to obtain a theoretical maximum twofold increase. An existing CSD setup can be upgraded in ~3 d by anyone with basic knowledge in optics, electronics and microscopy software.",
                "authors": [
                    {
                        "name": "Enderlein J."
                    },
                    {
                        "name": "Gregor I."
                    },
                    {
                        "name": "Isbaner S."
                    },
                    {
                        "name": "Qin S."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Nature Protocols",
                "title": "Doubling the resolution of a confocal spinning-disk microscope using image scanning microscopy"
            },
            "pmid": "33247283"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ]
}
