{
    "accessibility": "Open access",
    "additionDate": "2022-06-15T13:24:21.630896Z",
    "biotoolsCURIE": "biotools:shinyoptik",
    "biotoolsID": "shinyoptik",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Devin Koestler",
            "orcidid": "https://orcid.org/0000-0002-0598-0146"
        },
        {
            "name": "Qing Xia",
            "orcidid": "https://orcid.org/0000-0002-0337-1742"
        }
    ],
    "description": "User-Friendly R Shiny Application for Visualizing Cancer Risk Factors and Mortality Across the University of Kansas Cancer Center Catchment Area.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://optik.shinyapps.io/OPTIK",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T20:08:25.209712Z",
    "license": "Not licensed",
    "name": "shinyOPTIK",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1200/cci.21.00118",
            "metadata": {
                "abstract": "PURPOSEThe University of Kansas Cancer Center (KU Cancer Center) recently developed a data warehouse to Organize and Prioritize Trends to Inform KU Cancer Center (OPTIK). The OPTIK database aggregates and standardizes data collected across the bistate catchment area served by the KU Cancer Center. To improve the usability of the OPTIK database, we developed shinyOPTIK, a user-friendly, interactive web application for visualizing cancer risk factor and mortality rate data across the KU Cancer Center Catchment area.METHODSData in the OPTIK database were first consolidated at the county level across the KU Cancer Center catchment area. Next, the shinyOPTIK development team met with the KU Cancer Center leadership to discuss the needs and priorities of the shinyOPTIK web application. shinyOPTIK was developed under the R Shiny framework and consists of a user interface (ui.R) and a web server (server.R). At present, shinyOPTIK can be used to generate county-level geographical heatmaps; bar plots of demographic, screening, and risk factors; and line plots to visualize temporal trends at different Rural-Urban Continuum Codes (RUCCs), rural-urban status, metropolitan, or county levels across the KU Cancer Center catchment area.RESULTSTwo examples, adult obesity prevalence and lung cancer mortality, are presented to illustrate how researchers can use shinyOPTIK. Each example is accompanied by post hoc visualizations to help explain key observations in terms of rural-urban disparities.CONCLUSIONAlthough shinyOPTIK was developed to improve understanding of spatial and temporal trends across the population served by the KU Cancer Center, our hope is that the description of the steps involved in the creation of this tool along with open-source code for our application provided herein will serve as a guide for other research centers in the development of similar tools.",
                "authors": [
                    {
                        "name": "Chen R."
                    },
                    {
                        "name": "Chollet-Hinton L."
                    },
                    {
                        "name": "Koestler D.C."
                    },
                    {
                        "name": "Krebill H."
                    },
                    {
                        "name": "Kuo H."
                    },
                    {
                        "name": "Mudaranthakam D.P."
                    },
                    {
                        "name": "Xia Q."
                    }
                ],
                "citationCount": 2,
                "date": "2022-01-01T00:00:00Z",
                "journal": "JCO Clinical Cancer Informatics",
                "title": "ShinyOPTIK, a User-Friendly R Shiny Application for Visualizing Cancer Risk Factors and Mortality Across the University of Kansas Cancer Center Catchment Area"
            },
            "pmcid": "PMC9848578",
            "pmid": "35015561"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ],
    "validated": 1
}
