{
    "accessibility": "Open access",
    "additionDate": "2021-10-15T07:28:24.996856Z",
    "biotoolsCURIE": "biotools:aparecium",
    "biotoolsID": "aparecium",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ago.rinken@ut.ee",
            "name": "Ago Rinken",
            "typeEntity": "Person"
        }
    ],
    "description": "Open source software tool for fast and light-weight data analysis and data conversion from platereaders and images to formats of more powerful analysis software such as MATLAB, GraphPad Prism and SBToolbox2 (IQMTools).",
    "download": [
        {
            "type": "Downloads page",
            "url": "https://github.com/laasfeld/Aparecium"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Sequence classification",
                    "uri": "http://edamontology.org/operation_2995"
                },
                {
                    "term": "Transmembrane protein prediction",
                    "uri": "http://edamontology.org/operation_0269"
                }
            ]
        }
    ],
    "homepage": "http://gpcr.ut.ee/aparecium.html",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2022-06-29T19:07:57.012989Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "http://www.gpcr.ut.ee/Aparecium"
        }
    ],
    "name": "Aparecium",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "laasfeld",
    "publication": [
        {
            "doi": "10.1007/978-1-0716-1221-7_8",
            "metadata": {
                "abstract": "© 2021, Springer Science+Business Media, LLC, part of Springer Nature.During the past decade, fluorescence methods have become valuable tools for characterizing ligand binding to G protein-coupled receptors (GPCRs). However, only a few of the assays enable studying wild-type receptors and monitor the ligand binding in real time. One of the approaches that is inherently suitable for this purpose is the fluorescence anisotropy (FA) assay. In the FA assay, the change of ligand’s rotational freedom connected with its binding to the receptor can be monitored with a conventional fluorescence plate reader equipped with suitable optical filters. To achieve the high receptor concentration required for the assay and the low autofluorescence levels essential for reliable results, budded baculoviruses that display GPCRs on their surfaces can be used. The monitoring process generates a substantial amount of kinetic data, which is usually stored as a proprietary file format limiting the flexibility of data analysis. To solve this problem, we propose the use of the data curation software Aparecium (http://gpcr.ut.ee/aparecium.html ), which integrates experimental data with metadata in a Minimum Information for Data Analysis in Systems Biology (MIDAS) format. Aparecium enables data export to different software packages for fitting to suitable kinetic or equilibrium models. A combination of the FA assay with the novel data analysis strategy is suitable for screening new active compounds, but also for modeling complex systems of ligand binding to GPCRs. We present the proposed approach using different fluorescent probes and assay types to characterize ligand binding to melanocortin 4 (MC4) receptor.",
                "authors": [
                    {
                        "name": "Kopanchuk S."
                    },
                    {
                        "name": "Laasfeld T."
                    },
                    {
                        "name": "Link R."
                    },
                    {
                        "name": "Rinken A."
                    },
                    {
                        "name": "Tahk M.-J."
                    },
                    {
                        "name": "Veiksina S."
                    }
                ],
                "citationCount": 1,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Methods in Molecular Biology",
                "title": "Fluorescence Anisotropy-Based Assay for Characterization of Ligand Binding Dynamics to GPCRs: The Case of Cy3B-Labeled Ligands Binding to MC4 Receptors in Budded Baculoviruses"
            },
            "pmid": "34085265"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Membrane and lipoproteins",
            "uri": "http://edamontology.org/topic_0820"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
