{
    "name": "GCView", 
    "description": "GCView facilitates the analysis of the genomic context of a query protein. It uses protein homology to assign corresponding genomic context.", 
    "homepage": "http://toolkit.tuebingen.mpg.de/gcview", 
    "biotoolsID": "gcview", 
    "biotoolsCURIE": "biotools:gcview", 
    "version": [], 
    "otherID": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0477", 
                    "term": "Protein modelling"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0320", 
                    "term": "Protein structure assignment"
                }, 
                {
                    "uri": "http://edamontology.org/operation_2479", 
                    "term": "Protein sequence analysis"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0224", 
                    "term": "Query and retrieval"
                }, 
                {
                    "uri": "http://edamontology.org/operation_2480", 
                    "term": "Structure analysis"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0078", 
            "term": "Proteins"
        }, 
        {
            "uri": "http://edamontology.org/topic_0622", 
            "term": "Genomics"
        }, 
        {
            "uri": "http://edamontology.org/topic_2275", 
            "term": "Molecular modelling"
        }
    ], 
    "operatingSystem": [], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [], 
    "publication": [
        {
            "doi": null, 
            "pmid": "16845021", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "The MPI Bioinformatics Toolkit for protein sequence analysis", 
                "abstract": "The MPI Bioinformatics Toolkit is an interactive web service which offers access to a great variety of public and in-house bioinformatics tools. They are grouped into different sections that support sequence searches, multiple alignment, secondary and tertiary structure prediction and classification. Several public tools are offered in customized versions that extend their functionality. For example, PSI-BLAST can be run against regularly updated standard databases, customized user databases or selectable sets of genomes. Another tool, Quick2D, integrates the results of various secondary structure, transmembrane and disorder prediction programs into one view. The Toolkit provides a friendly and intuitive user interface with an online help facility. As a key feature, various tools are interconnected so that the results of one tool can be forwarded to other tools. One could run PSI-BLAST, parse out a multiple alignment of selected hits and send the results to a cluster analysis tool. The Toolkit framework and the tools developed in-house will be packaged and freely available under the GNU Lesser General Public Licence (LGPL). The Toolkit can be accessed at http://toolkit.tuebingen.mpg.de. © The Author 2006. Published by Oxford University Press. All rigths reserved.", 
                "date": "2006-07-01T00:00:00Z", 
                "citationCount": 210, 
                "authors": [
                    {
                        "name": "Biegert A."
                    }, 
                    {
                        "name": "Mayer C."
                    }, 
                    {
                        "name": "Remmert M."
                    }, 
                    {
                        "name": "Soding J."
                    }, 
                    {
                        "name": "Lupas A.N."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }, 
        {
            "doi": null, 
            "pmid": "21609955", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "GCView: The genomic context viewer for protein homology searches", 
                "abstract": "Genomic neighborhood can provide important insights into evolution and function of a protein or gene. When looking at operons, changes in operon structure and composition can only be revealed by looking at the operon as a whole. To facilitate the analysis of the genomic context of a query in multiple organisms we have developed Genomic Context Viewer (GCView). GCView accepts results from one or multiple protein homology searches such as BLASTp as input. For each hit, the neighboring protein-coding genes are extracted, the regions of homology are labeled for each input and the results are presented as a clear, interactive graphical output. It is also possible to add more searches to iteratively refine the output. GCView groups outputs by the hits for different proteins. This allows for easy comparison of different operon compositions and structures. The tool is embedded in the framework of the Bioinformatics Toolkit of the Max-Planck Institute for Developmental Biology (MPI Toolkit). Job results from the homology search tools inside the MPI Toolkit can be forwarded to GCView and results can be subsequently analyzed by sequence analysis tools. Results are stored online, allowing for later reinspection. GCView is freely available at http://toolkit.tuebingen.mpg.de/gcview. © 2011 The Author(s).", 
                "date": "2011-07-01T00:00:00Z", 
                "citationCount": 10, 
                "authors": [
                    {
                        "name": "Grin I."
                    }, 
                    {
                        "name": "Linke D."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }
    ], 
    "credit": [], 
    "owner": "ELIXIR-EE", 
    "additionDate": "2017-02-14T09:35:49Z", 
    "lastUpdate": "2018-12-10T12:58:44Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0
}