{
    "additionDate": "2021-01-18T09:10:31Z",
    "biotoolsCURIE": "biotools:dtf",
    "biotoolsID": "dtf",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "pingzhao.hu@umanitoba.ca",
            "name": "Pingzhao Hu",
            "typeEntity": "Person"
        }
    ],
    "description": "DTF is a  deep tensor factorization for predicting anticancer drug synergy.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ZexuanSun/DTF-Drug-Synergy",
    "language": [
        "Python",
        "R",
        "MATLAB"
    ],
    "lastUpdate": "2021-03-03T20:27:47Z",
    "name": "DTF",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA287",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved.Motivation: Combination therapies have been widely used to treat cancers. However, it is cost and time consuming to experimentally screen synergistic drug pairs due to the enormous number of possible drug combinations. Thus, computational methods have become an important way to predict and prioritize synergistic drug pairs. Results: We proposed a Deep Tensor Factorization (DTF) model, which integrated a tensor factorization method and a deep neural network (DNN), to predict drug synergy. The former extracts latent features from drug synergy information while the latter constructs a binary classifier to predict the drug synergy status. Compared to the tensor-based method, the DTF model performed better in predicting drug synergy. The area under precision-recall curve (PR AUC) was 0.58 for DTF and 0.24 for the tensor method. We also compared the DTF model with DeepSynergy and logistic regression models, and found that the DTF outperformed the logistic regression model and achieved similar performance as DeepSynergy using several performance metrics for classification task. Applying the DTF model to predict missing entries in our drug-cell-line tensor, we identified novel synergistic drug combinations for 10 cell lines from the 5 cancer types. A literature survey showed that some of these predicted drug synergies have been identified in vivo or in vitro. Thus, the DTF model could be a valuable in silico tool for prioritizing novel synergistic drug combinations.",
                "authors": [
                    {
                        "name": "Sun Z."
                    },
                    {
                        "name": "Huang S."
                    },
                    {
                        "name": "Jiang P."
                    },
                    {
                        "name": "Hu P."
                    }
                ],
                "citationCount": 2,
                "date": "2020-08-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "DTF: Deep Tensor Factorization for predicting anticancer drug synergy"
            },
            "pmid": "32369563"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Safety sciences",
            "uri": "http://edamontology.org/topic_3377"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Phenomics",
            "uri": "http://edamontology.org/topic_3298"
        }
    ]
}