{
    "additionDate": "2016-05-17T10:18:51Z",
    "biotoolsCURIE": "biotools:matrixclust",
    "biotoolsID": "matrixclust",
    "collectionID": [
        "BIG N2N",
        "VIB",
        "Plant Systems Biology",
        "UGent"
    ],
    "credit": [
        {
            "name": "ugent.be",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "yves.vandepeer@psb.vib-ugent.be",
            "name": "Yves Van de Peer",
            "orcidid": "http://orcid.org/0000-0003-4327-3730",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A Matlab toolbox for fuzzy clustering of a symmetric matrix, typically the weighted adjacency matrix of an undirected network.",
    "documentation": [
        {
            "type": "General",
            "url": "http://bioinformatics.psb.ugent.be/software/details/MatrixClust"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Distance matrix",
                        "uri": "http://edamontology.org/data_2855"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Sequence cluster",
                        "uri": "http://edamontology.org/data_1235"
                    }
                }
            ]
        }
    ],
    "homepage": "http://bioinformatics.psb.ugent.be/software/details/MatrixClust",
    "lastUpdate": "2018-12-24T22:20:10Z",
    "name": "MatrixClust",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Katrijn.Vannerum@ugent.be",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btm562",
            "metadata": {
                "abstract": "Motivation: Over the last decade, a large variety of clustering algorithms have been developed to detect coregulatory relationships among genes from microarray gene expression data. Model-based clustering approaches have emerged as statistically well-grounded methods, but the properties of these algorithms when applied to large-scale data sets are not always well understood. An in-depth analysis can reveal important insights about the performance of the algorithm, the expected quality of the output clusters, and the possibilities for extracting more relevant information out of a particular data set. Results: We have extended an existing algorithm for model-based clustering of genes to simultaneously cluster genes and conditions, and used three large compendia of gene expression data for Saccharomyces cerevisiae to analyze its properties. The algorithm uses a Bayesian approach and a Gibbs sampling procedure to iteratively update the cluster assignment of each gene and condition. For large-scale data sets, the posterior distribution is strongly peaked on a limited number of equiprobable clusterings. A GO annotation analysis shows that these local maxima are all biologically equally significant, and that simultaneously clustering genes and conditions performs better than only clustering genes and assuming independent conditions. A collection of distinct equivalent clusterings can be summarized as a weighted graph on the set of genes, from which we extract fuzzy, overlapping clusters using a graph spectral method. The cores of these fuzzy clusters contain tight sets of strongly coexpressed genes, while the overlaps exhibit relations between genes showing only partial coexpression. © The Author 2007. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Joshi A."
                    },
                    {
                        "name": "Van de peer Y."
                    },
                    {
                        "name": "Michoel T."
                    }
                ],
                "citationCount": 45,
                "date": "2008-01-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Analysis of a Gibbs sampler method for model-based clustering of gene expression data"
            },
            "pmid": "18033794",
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}