{
    "additionDate": "2018-07-07T21:27:53Z",
    "biotoolsCURIE": "biotools:tracmit",
    "biotoolsID": "tracmit",
    "credit": [
        {
            "email": "pierre.goenczy@epfl.ch",
            "name": "Pierre Gönczy",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "An effective pipeline for tracking and analyzing cells on micropatterns through mitosis.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/lacan/TRACMIT/blob/master/TRACMIT%201.1%20User%20guide.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://github.com/lacan/TRACMIT",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "license": "BSD-3-Clause",
    "name": "TRACMIT",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0179752",
            "metadata": {
                "abstract": "© 2017 Burri et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited. The use of micropatterns has transformed investigations of dynamic biological processes by enabling the reproducible analysis of live cells using time-lapse fluorescence microscopy. With micropatterns, thousands of individual cells can be efficiently imaged in parallel, rendering the approach well suited for screening projects. Despite being powerful, such screens remain challenging in terms of data handling and analysis. Typically, only a fraction of micropatterns is occupied in a manner suitable to monitor a given phenotypic output. Moreover, the presence of dying or otherwise compromised cells complicates the analysis. Therefore, focusing strictly on relevant cells in such large time-lapse microscopy dataset poses interesting analysis challenges that are not readily met by existing software packages. This motivated us to develop an image analysis pipeline that handles all necessary image processing steps within one open-source platform to detect and analyze individual cells seeded on micropatterns through mitosis. We introduce a comprehensive image analysis pipeline running on Fiji termed TRACMIT (pipeline for TRACking and analyzing cells on micropatterns through MITosis). TRACMIT was developed to rapidly and accurately assess the orientation of the mitotic spindle during metaphase in time-lapse fluorescence microscopy of human cells expressing mCherry::histone 2B and plated on L-shaped micropatterns. This solution enables one to perform the entire analysis from the raw data, avoiding the need to save intermediate images, thereby decreasing data volume and thus reducing the data that needs to be processed. We first select micropatterns containing a single cell and then identify anaphase figures in the time-lapse recording. Next, TRACMIT tracks back in time until metaphase, when the angle of the mitotic spindle with respect to the micropattern is assessed. We designed the pipeline to allow for manual validation of selected cells with a simple user interface, and to enable analysis of cells plated on micropatterns of different shapes. For ease of use, the entire pipeline is provided as a series of Fiji/ImageJ macros, grouped into an ActionBar. In conclusion, the open source TRACMIT pipeline enables high-throughput analysis of single mitotic cells on micropatterns, thus accurately and efficiently allowing automatic determination of spindle positioning from time-lapse recordings.",
                "authors": [
                    {
                        "name": "Burri O."
                    },
                    {
                        "name": "Wolf B."
                    },
                    {
                        "name": "Seitz A."
                    },
                    {
                        "name": "Gonczy P."
                    }
                ],
                "citationCount": 2,
                "date": "2017-07-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "TRACMIT: An effective pipeline for tracking and analyzing cells on micropatterns through mitosis"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Plug-in"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        }
    ],
    "validated": 1
}