{
    "additionDate": "2020-01-09T17:59:45Z",
    "biotoolsCURIE": "biotools:AutoTuner",
    "biotoolsID": "AutoTuner",
    "confidence_flag": "tool",
    "description": "Autotuner is a used to identify proper parameters during metabolomics data processing.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peak detection",
                    "uri": "http://edamontology.org/operation_3215"
                }
            ]
        }
    ],
    "homepage": "https://github.com/crmclean/Autotuner",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-14T16:17:22Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://bioconductor.org/packages/devel/bioc/html/Autotuner.html"
        }
    ],
    "name": "AutoTuner",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/acs.analchem.9b04804",
            "metadata": {
                "abstract": "© 2020 American Chemical Society.Untargeted metabolomics experiments provide a snapshot of cellular metabolism but remain challenging to interpret due to the computational complexity involved in data processing and analysis. Prior to any interpretation, raw data must be processed to remove noise and to align mass-spectral peaks across samples. This step requires selection of dataset-specific parameters, as erroneous parameters can result in noise inflation. While several algorithms exist to automate parameter selection, each depends on gradient descent optimization functions. In contrast, our new parameter optimization algorithm, AutoTuner, obtains parameter estimates from raw data in a single step as opposed to many iterations. Here, we tested the accuracy and the run-time of AutoTuner in comparison to isotopologue parameter optimization (IPO), the most commonly used parameter selection tool, and compared the resulting parameters' influence on the properties of feature tables after processing. We performed a Monte Carlo experiment to test the robustness of AutoTuner parameter selection and found that AutoTuner generated similar parameter estimates from random subsets of samples. We conclude that AutoTuner is a desirable alternative to existing tools, because it is scalable, highly robust, and very fast (∼100-1000× speed improvement from other algorithms going from days to minutes). AutoTuner is freely available as an R package through BioConductor.",
                "authors": [
                    {
                        "name": "McLean C."
                    },
                    {
                        "name": "Kujawinski E.B."
                    }
                ],
                "citationCount": 7,
                "date": "2020-04-21T00:00:00Z",
                "journal": "Analytical Chemistry",
                "title": "AutoTuner: High Fidelity and Robust Parameter Selection for Metabolomics Data Processing"
            },
            "pmcid": "PMC7310949",
            "pmid": "32212641"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ],
    "validated": 1
}