{"credit":[{"email":"mai.hamdalla@uconn.edu","name":"Mai Hamdalla","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://dna.engr.uconn.edu/?page_id=386"}],"documentation":[{"type":"GENERAL","url":"http://opencommons.uconn.edu/cgi/viewcontent.cgi?article=6635&context=dissertations"}],"function":[{"operation":[{"term":"Prediction and recognition","uri":"http://edamontology.org/operation_2423"}]}],"labels":{"language":["Java"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Metabolomics","uri":"http://edamontology.org/topic_3172"},{"term":"Biochemistry","uri":"http://edamontology.org/topic_3292"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/biosmxpress-identification-of-unknown-biochemical-structures-in-metabolomics.html"}],"publication":[{"abstract":"© 2015 Hamdalla et al.; licensee BioMed Central Ltd. Metabolomics is the study of small molecules, called metabolites, of a cell, tissue or organism. It is of particular interest as endogenous metabolites represent the phenotype resulting from gene expression. A major challenge in metabolomics research is the structural identification of unknown biochemical compounds in complex biofluids. In this paper we present an efficient cheminformatics tool, BioSMXpress that uses known endogenous mammalian biochemicals and graph matching methods to identify endogenous mammalian biochemical structures in chemical structure space. The results of a comprehensive set of empirical experiments suggest that BioSMXpress identifies endogenous mammalian biochemical structures with high accuracy. BioSMXpress is 8 times faster than our previous work BioSM without compromising the accuracy of the predictions made. BioSMXpress is freely available at http://engr.uconn.edu/~rajasek/BioSMXpress.zip","authors":["Hamdalla M.A.","Ammar R.A.","Rajasekaran S."],"cit_count":2,"journal":"BMC Bioinformatics","pmid":"25859612","title":"A molecular structure matching approach to efficient identification of endogenous mammalian biochemical structures","year":"2015-03-18"}],"summary":{"biotoolsCURIE":"biotools:biosmxpress","biotoolsID":"biosmxpress","description":"BiDesigned and developed as an enhancement to BioSM. It is, on average, 8 times faster than BioSM without compromising the quality of the predictions made. This software will be an extremely useful tool in the timely identification of unknown biochemical structures in metabolomics.","homepage":"http://www.mybiosoftware.com/biosmxpress-identification-of-unknown-biochemical-structures-in-metabolomics.html","name":"BioSMXpress"}}