{
    "additionDate": "2021-01-18T10:56:14Z",
    "biotoolsCURIE": "biotools:crispr-cbei",
    "biotoolsID": "crispr-cbei",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "quanjiangji@shanghaitech.edu.cn",
            "name": "Quanjiang Ji",
            "orcidid": "https://orcid.org/0000-0002-2321-8462",
            "typeEntity": "Person"
        },
        {
            "email": "shihengt@nwsuaf.edu.cn",
            "name": "Shiheng Tao",
            "orcidid": "https://orcid.org/0000-0002-6076-6038",
            "typeEntity": "Person"
        }
    ],
    "description": "CRISPR-CBEI is a web-based designing tool for Cytosine Base Editor mediated gene Inactivation",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Coding region prediction",
                    "uri": "http://edamontology.org/operation_0436"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "https://taolab.nwafu.edu.cn/crisprcbei/",
    "language": [
        "JavaScript",
        "Python"
    ],
    "lastUpdate": "2021-02-18T15:24:21Z",
    "license": "Apache-2.0",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://atlasbioinfo.github.io/CRISPR-CBEI/"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/atlasbioinfo/CRISPR-CBEI/"
        }
    ],
    "name": "CRISPR-CBEI",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1128/MSYSTEMS.00350-20",
            "metadata": {
                "abstract": "Copyright © 2020 Yu et al. This is an open-access article distributed under the terms of the Creative Commons Attribution 4.0 International license.Base editing is a promising technique, allowing precise single-base mutagenesis in genomes without double-strand DNA breaks or donor templates. Cytosine base editors (CBEs) convert cytosine to thymidine. In particular, CBEs can transform four codons, CAA, CAG, CGA, and TGG, into stop codons, providing a new means to rapidly inactivate a gene of interest and enabling loss-of-function study in recombination-deficient species and the construction of gene-inactivation libraries. However, designing single guide RNAs (sgRNAs) for gene inactivation is more complicated and more restricted in applicability than using the lustered regularly interspaced short palindromic repeats (CRISPR)/CRISPR-associated (CRISPR/Cas9) system only, especially for researchers who do not specialize in the bioinformatics skills needed to design and evaluate sgRNAs. Here, we present a new user-friendly designing tool kit, namely, CRISPR-CBEI (cytosine base editor-mediated gene inactivation), including a Web tool and a command-line tool. The Web tool is dedicated to the design of sgRNAs for CBE-mediated gene inactivation and integrates various functions, including open reading frame (ORF) identification, CBE customization, sgRNA designing, summarizing, and front-end off-target searching against user-defined unlimited-file-size local genome files without the necessity of uploading to the server. The command-line version serves the same purpose but for a larger number of coding DNA sequences (CDSs), for instance, for designing a CBE-inactivation library in a target species which provides comprehensive evaluations of CBEs and target genomes. We envision that this tool would contribute to CBE-inactivation design. IMPORTANCE Life science has been in pursuit of precise and efficient genome editing in living cells since the very beginning of the first restriction cloning attempt. The introduction of RNA-guided CRISPR-associated (Cas) nucleases contributed to this ultimate goal through their ability to deliver a double-strand break (DSB) to a precise target location in various species, obsoleting the preceding editing tools, such as zinc-finger nucleases (ZFNs) and transcription activator-like effector nucleases (TALENs). The derivative technology, base editing, combines the catalytically inactivated Cas nuclease and nucleotide deaminase and mediates the genetic modifications at single-nucleotide precision without introducing a DSB. Moreover, the cytosine base editors (CBEs) are able to transform multiple codons into stop codons, rapidly inactivating a gene of interest and enabling loss-of-function study in some recombination-deficient species. Here, we present the CRISPR-CBEI tool kit to assist the design of sgRNAs for CBE-mediated gene inactivation.",
                "authors": [
                    {
                        "name": "Yu H."
                    },
                    {
                        "name": "Wu Z."
                    },
                    {
                        "name": "Chen X."
                    },
                    {
                        "name": "Ji Q."
                    },
                    {
                        "name": "Tao S."
                    }
                ],
                "date": "2020-10-01T00:00:00Z",
                "journal": "mSystems",
                "title": "CRISPR-CBEI: A designing and analyzing tool kit for cytosine base editor-mediated gene inactivation"
            },
            "pmcid": "PMC7511213",
            "pmid": "32963098"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Genetic engineering",
            "uri": "http://edamontology.org/topic_3912"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}