{
    "additionDate": "2021-03-19T09:10:23Z",
    "biotoolsCURIE": "biotools:self-path",
    "biotoolsID": "self-path",
    "confidence_flag": "tool",
    "description": "Self-supervision for Classification of Pathology Images with Limited Annotations.\n\nWhile high-resolution pathology images lend themselves well to 'data hungry' deep learning algorithms, obtaining exhaustive annotations on these images for learning is a major challenge. In this paper, we propose a self-supervised convolutional neural network (CNN) frame-work to leverage unlabeled data for learning generalizable and domain invariant representations in pathology images. Our proposed framework, termed as Self-Path, employs multi-task learning where the main task is tissue classification and pretext tasks are a variety of self-supervised tasks with labels inherent to the input images. We introduce novel pathology-specific self-supervision tasks that leverage contextual, multi-resolution and semantic features in pathology images for semi-supervised learning and domain adaptation. We investigate the effectiveness of Self-Path on 3 different pathology datasets\n\n||| HOMEPAGE MISSING!",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image annotation",
                    "uri": "http://edamontology.org/operation_3553"
                }
            ]
        }
    ],
    "homepage": "https://warwick.ac.uk/fac/cross_fac/tia/software/selfpath/",
    "lastUpdate": "2021-04-08T11:48:56Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/navidstuv/self_path/tree/upload"
        }
    ],
    "name": "Self-Path",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1109/TMI.2021.3056023",
            "metadata": {
                "abstract": "IEEEWhile high-resolution pathology images lend themselves well to &#x2018;data hungry&#x2019; deep learning algorithms, obtaining exhaustive annotations on these images for learning is a major challenge. In this paper, we propose a self-supervised convolutional neural network (CNN) frame-work to leverage unlabeled data for learning generalizable and domain invariant representations in pathology images. Our proposed framework, termed as Self-Path, employs multi-task learning where the main task is tissue classification and pretext tasks are a variety of self-supervised tasks with labels inherent to the input images.We introduce novel pathology-specific self-supervision tasks that leverage contextual, multi-resolution and semantic features in pathology images for semi-supervised learning and domain adaptation. We investigate the effectiveness of Self-Path on 3 different pathology datasets. Our results show that Self-Path with the pathology-specific pretext tasks achieves state-of-the-art performance for semi-supervised learning when small amounts of labeled data are available. Further, we show that Self-Path improves domain adaptation for histopathology image classification when there is no labeled data available for the target domain. This approach can potentially be employed for other applications in computational pathology, where annotation budget is often limited or large amount of unlabeled image data is available.",
                "authors": [
                    {
                        "name": "Koohbanani N.A."
                    },
                    {
                        "name": "Unnikrishnan B."
                    },
                    {
                        "name": "Khurram S.A."
                    },
                    {
                        "name": "Krishnaswamy P."
                    },
                    {
                        "name": "Rajpoot N."
                    }
                ],
                "citationCount": 2,
                "date": "2021-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Medical Imaging",
                "title": "Self-Path: Self-supervision for Classification of Pathology Images with Limited Annotations"
            },
            "pmid": "33523807"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}