{
    "additionDate": "2017-08-03T19:00:28Z",
    "biotoolsCURIE": "biotools:sqn",
    "biotoolsID": "sqn",
    "credit": [
        {
            "email": "zwu@stat.brown.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.stat.brown.edu/ZWU/homepage.aspx"
        }
    ],
    "description": "The tool normalizes based on the distribution of non-specific control features, without restriction on the behavior of specific signals.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.stat.brown.edu/ZWU/research.aspx"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://www.stat.brown.edu/ZWU/research.aspx",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:49Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/sqn-1-0-normalizes-based-subset-negative-control-probes.html"
        }
    ],
    "name": "SQN",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Normalization has been recognized as a necessary preprocessing step in a variety of high-throughput biotechnologies. A number of normalization methods have been developed specifically for microarrays, some general and others tailored for certain experimental designs. All methods rely on assumptions about data characteristics that are expected to stay constant across samples, although some make it more explicit than others. Most methods make assumptions that certain quantities related to the biological signal of interest stay the same; this is reasonable for many experiments but usually not verifiable. Recently, several platforms have begun to include a large number of negative control probes that nonetheless cover nearly the entire range of the measured signal intensity. Using these probes as a normalization basis makes it possible to normalize without making assumptions about the behavior of the biological signal. We present a subset quantile normalization (SQN) procedure that normalizes based on the distribution of non-specific control features, without restriction on the behavior of specific signals. We illustrate the performance of this method using three different platforms and experimental settings. Compared to two other leading nonlinear normalization procedures, the SQN method preserves more biological variation after normalization while reducing the noise observed on control features. Although the illustration datasets are from microarray experiments, this method is general for all high throughput technologies that include a large set of control features that have constant expectations across samples. It does not require an equal number of features in all samples and tolerates missing data. Supplementary Material is available online at www.liebertonline.com. © Mary Ann Liebert, Inc.",
                "authors": [
                    {
                        "name": "Wu Z."
                    },
                    {
                        "name": "Aryee M.J."
                    }
                ],
                "citationCount": 26,
                "date": "2010-10-01T00:00:00Z",
                "journal": "Journal of Computational Biology",
                "title": "Subset quantile normalization using negative control features"
            },
            "pmid": "20976876"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        },
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Applied mathematics",
            "uri": "http://edamontology.org/topic_3569"
        }
    ],
    "validated": 1
}