{
    "additionDate": "2021-03-19T08:47:32Z",
    "biotoolsCURIE": "biotools:raytracing",
    "biotoolsID": "raytracing",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Cote@crulrg.ulaval.ca",
            "name": "Daniel C. Côté",
            "orcidid": "https://orcid.org/0000-0001-6440-6948",
            "typeEntity": "Person"
        }
    ],
    "description": "Tools and tutorial on practical ray tracing for microscopy.\n\nThis code aims to provide a simple ray tracing module for calculating various properties of optical paths (object, image, aperture stops, field stops). It makes use of ABCD matrices and does not consider aberrations (spherical or chromatic). Since it uses the ABCD formalism (or Ray matrices, or Gauss matrices) it can perform tracing of rays and gaussian laser beams.",
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/DCC-Lab/RayTracing/tree/master/examples"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Backbone modelling",
                    "uri": "http://edamontology.org/operation_0479"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/DCC-Lab/RayTracing",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-31T13:02:06Z",
    "license": "MIT",
    "name": "raytracing",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1117/1.NPH.8.1.010801",
            "metadata": {
                "abstract": "© The Authors. Published by SPIE under a Creative Commons Attribution 4.0 Unported License. Distribution or reproduction of this work in whole or in part requires full attribution of the original publication, including its DOI.Significance: An advanced understanding of optical design is necessary to create optimal systems but this is rarely taught as part of general curriculum. Compounded by the fact that professional optical design software tools have a prohibitive learning curve, this means that neither knowledge nor tools are easily accessible. Aim: In this tutorial, we introduce a raytracing module for Python, originally developed for teaching optics with ray matrices, to simplify the design and optimization of optical systems. Approach: This module is developed for ray matrix calculations in Python. Many important concepts of optical design that are often poorly understood such as apertures, aperture stops, and field stops are illustrated. Results: The module is explained with examples in real systems with collection efficiency, vignetting, and intensity profiles. Also, the optical invariant, an important benchmark property for optical systems, is used to characterize an optical system. Conclusions: This raytracing Python module will help improve the reader's understanding of optics and also help them design optimal systems.",
                "authors": [
                    {
                        "name": "Begin L."
                    },
                    {
                        "name": "Cote D.C."
                    },
                    {
                        "name": "Genest G."
                    },
                    {
                        "name": "Masoumi S."
                    },
                    {
                        "name": "Parham E."
                    },
                    {
                        "name": "Pineau Noel V."
                    },
                    {
                        "name": "Vigneault M.-A."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Neurophotonics",
                "title": "Tools and tutorial on practical ray tracing for microscopy"
            },
            "pmcid": "PMC7818000"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        }
    ]
}
