{
    "additionDate": "2017-08-03T18:58:22Z",
    "biotoolsCURIE": "biotools:ragout",
    "biotoolsID": "ragout",
    "credit": [
        {
            "email": "fenderglass@gmail.com",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Tool for assisted assembly using multiple references. It takes a short read assembly (a set of contigs), a set of related references and a corresponding phylogenetic tree and then assembles the contigs into scaffolds.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://fenderglass.github.io/Ragout/usage.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                }
            ]
        }
    ],
    "homepage": "http://fenderglass.github.io/Ragout/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/ragout-0-2-beta-a-tool-for-reference-assisted-assembly.html"
        }
    ],
    "name": "Ragout",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Bacterial genomes are simpler than mammalian ones, and yet assembling the former from the data currently generated by high-throughput short-read sequencing machines still results in hundreds of contigs. To improve assembly quality, recent studies have utilized longer Pacific Biosciences (PacBio) reads or jumping libraries to connect contigs into larger scaffolds or help assemblers resolve ambiguities in repetitive regions of the genome. However, their popularity in contemporary genomic research is still limited by high cost and error rates. In this work, we explore the possibility of improving assemblies by using complete genomes from closely related species/strains. We present Ragout, a genome rearrangement approach, to address this problem. In contrast with most reference-guided algorithms, where only one reference genome is used, Ragout uses multiple references along with the evolutionary relationship among these references in order to determine the correct order of the contigs. Additionally, Ragout uses the assembly graph and multi-scale synteny blocks to reduce assembly gaps caused by small contigs from the input assembly. In simulations as well as real datasets, we believe that for common bacterial species, where many complete genome sequences from related strains have been available, the current high-throughput short-read sequencing paradigm is sufficient to obtain a single high-quality scaffold for each chromosome. © 2014 The Author. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Kolmogorov M."
                    },
                    {
                        "name": "Paten B."
                    },
                    {
                        "name": "Pham S."
                    },
                    {
                        "name": "Raney B."
                    }
                ],
                "citationCount": 88,
                "date": "2014-06-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Ragout - A reference-assisted assembly tool for bacterial genomes"
            },
            "pmid": "24931998"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ],
    "validated": 1
}
