{
    "additionDate": "2022-02-14T09:44:49.712013Z",
    "biotoolsCURIE": "biotools:ccmdr",
    "biotoolsID": "ccmdr",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mail.pingzhang@gmail.com",
            "name": "Ping Zhang",
            "orcidid": "https://orcid.org/0000-0002-4601-0779",
            "typeEntity": "Person"
        }
    ],
    "description": "CCMDR, Clinical connectivity map drug repurposing. Drug repositioning framework to discover the new indications of existing drugs from electronic clinical information",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Small molecule design",
                    "uri": "http://edamontology.org/operation_4009"
                }
            ]
        }
    ],
    "homepage": "https://github.com/HoytWen/CCMDR",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-02-14T09:44:49.714609Z",
    "name": "CCMDR",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/S12911-021-01617-4",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Drug repurposing, the process of identifying additional therapeutic uses for existing drugs, has attracted increasing attention from both the pharmaceutical industry and the research community. Many existing computational drug repurposing methods rely on preclinical data (e.g., chemical structures, drug targets), resulting in translational problems for clinical trials. Results: In this study, we propose a novel framework based on clinical connectivity mapping for drug repurposing to analyze therapeutic effects of drugs on diseases. We firstly establish clinical drug effect vectors (i.e., drug-laboratory results associations) by applying a continuous self-controlled case series model on a longitudinal electronic health record data, then establish clinical disease sign vectors (i.e., disease-laboratory results associations) by applying a Wilcoxon rank sum test on a large-scale national survey data. Eventually, a repurposing possibility score for each drug-disease pair is computed by applying a dot product-based scoring function on clinical disease sign vectors and clinical drug effect vectors. During the experiment, we comprehensively evaluate 392 drugs for 6 important chronic diseases (include asthma, coronary heart disease, congestive heart failure, heart attack, type 2 diabetes, and stroke). The experiment results not only reflect known associations between diseases and drugs, but also include some hidden drug-disease associations. The code for this paper is available at: https://github.com/HoytWen/CCMDR Conclusions: The proposed clinical connectivity map framework uses laboratory results found from electronic clinical information to bridge drugs and diseases, which make their relations explainable and has better translational power than existing computational methods. Experimental results demonstrate the effectiveness of our proposed framework, further case analysis also proves our method can be used to repurposing existing drugs opportunities.",
                "authors": [
                    {
                        "name": "Liu R."
                    },
                    {
                        "name": "Wen Q."
                    },
                    {
                        "name": "Zhang P."
                    }
                ],
                "date": "2021-09-01T00:00:00Z",
                "journal": "BMC Medical Informatics and Decision Making",
                "title": "Clinical connectivity map for drug repurposing: using laboratory results to bridge drugs and diseases"
            },
            "pmcid": "PMC8461864",
            "pmid": "34560862"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Cardiology",
            "uri": "http://edamontology.org/topic_3335"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Nutritional science",
            "uri": "http://edamontology.org/topic_3390"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ]
}
