{
    "additionDate": "2022-02-16T07:13:39.425315Z",
    "biotoolsCURIE": "biotools:deepdds",
    "biotoolsID": "deepdds",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hliu@njtech.edu.cn",
            "name": "Hui Liu"
        }
    ],
    "description": "DeepDDS (Deep Learning for Drug–Drug Synergy prediction) A deep graph neural network with attention mechanism to predict synergistic drug combinations.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Sinwang404/DeepDDS/tree/master",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-02-16T07:13:39.427860Z",
    "name": "DeepDDS",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAB390",
            "metadata": {
                "abstract": "© The Author(s) 2021. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.MOTIVATION: Drug combination therapy has become an increasingly promising method in the treatment of cancer. However, the number of possible drug combinations is so huge that it is hard to screen synergistic drug combinations through wet-lab experiments. Therefore, computational screening has become an important way to prioritize drug combinations. Graph neural network has recently shown remarkable performance in the prediction of compound-protein interactions, but it has not been applied to the screening of drug combinations. RESULTS: In this paper, we proposed a deep learning model based on graph neural network and attention mechanism to identify drug combinations that can effectively inhibit the viability of specific cancer cells. The feature embeddings of drug molecule structure and gene expression profiles were taken as input to multilayer feedforward neural network to identify the synergistic drug combinations. We compared DeepDDS (Deep Learning for Drug-Drug Synergy prediction) with classical machine learning methods and other deep learning-based methods on benchmark data set, and the leave-one-out experimental results showed that DeepDDS achieved better performance than competitive methods. Also, on an independent test set released by well-known pharmaceutical enterprise AstraZeneca, DeepDDS was superior to competitive methods by more than 16% predictive precision. Furthermore, we explored the interpretability of the graph attention network and found the correlation matrix of atomic features revealed important chemical substructures of drugs. We believed that DeepDDS is an effective tool that prioritized synergistic drug combinations for further wet-lab experiment validation. AVAILABILITY AND IMPLEMENTATION: Source code and data are available at https://github.com/Sinwang404/DeepDDS/tree/master.",
                "authors": [
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Shen S."
                    },
                    {
                        "name": "Deng L."
                    },
                    {
                        "name": "Liu H."
                    }
                ],
                "citationCount": 2,
                "date": "2022-01-17T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "DeepDDS: deep graph neural network with attention mechanism to predict synergistic drug combinations"
            },
            "pmid": "34571537"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}