{
    "accessibility": "Open access",
    "additionDate": "2023-10-15T18:02:30.343430Z",
    "biotoolsCURIE": "biotools:parett",
    "biotoolsID": "parett",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "leclercq.l.s@gmail.com",
            "name": "Louis-Stéphane Le Clercq",
            "orcidid": "https://orcid.org/0000-0002-8713-8920",
            "typeEntity": "Person"
        }
    ],
    "description": "A Python package for the automated retrieval and management of divergence time data from the timeTree resource for downstream analyses.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Tree dating",
                    "uri": "http://edamontology.org/operation_3942"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/LSLeClercq/PAReTT",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:37:55.187602Z",
    "license": "Apache-2.0",
    "name": "PAReTT",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/s00239-023-10106-3",
            "metadata": {
                "abstract": "Evolutionary processes happen gradually over time and are, thus, considered time dependent. In addition, several evolutionary processes are either adaptations to local habitats or changing habitats, otherwise restricted thereby. Since evolutionary processes driving speciation take place within the landscape of environmental and temporal bounds, several published studies have aimed at providing accurate, fossil-calibrated, estimates of the divergence times of both extant and extinct species. Correct calibration is critical towards attributing evolutionary adaptations and speciation both to the time and paleogeography that contributed to it. Data from more than 4000 studies and nearly 1,50,000 species are available from a central TimeTree resource and provide opportunities of retrieving divergence times, evolutionary timelines, and time trees in various formats for most vertebrates. These data greatly enhance the ability of researchers to investigate evolution. However, there is limited functionality when studying lists of species that require batch retrieval. To overcome this, a PYTHON package termed Python-Automated Retrieval of TimeTree data (PAReTT) was created to facilitate a biologist-friendly interaction with the TimeTree resource. Here, we illustrate the use of the package through three examples that includes the use of timeline data, time tree data, and divergence time data. Furthermore, PAReTT was previously used in a meta-analysis of candidate genes to illustrate the relationship between divergence times and candidate genes of migration. The PAReTT package is available for download from GitHub or as a pre-compiled Windows executable, with extensive documentation on the package available on GitHub wiki pages regarding dependencies, installation, and implementation of the various functions.",
                "authors": [
                    {
                        "name": "Dalton D.L."
                    },
                    {
                        "name": "Grobler J.P."
                    },
                    {
                        "name": "Kotze A."
                    },
                    {
                        "name": "Le Clercq L.-S."
                    }
                ],
                "citationCount": 1,
                "date": "2023-08-01T00:00:00Z",
                "journal": "Journal of Molecular Evolution",
                "title": "PAReTT: A Python Package for the Automated Retrieval and Management of Divergence Time Data from the TimeTree Resource for Downstream Analyses"
            },
            "pmcid": "PMC10277261",
            "pmid": "37079046",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Molecular evolution",
            "uri": "http://edamontology.org/topic_3945"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}
