{
    "additionDate": "2021-01-18T11:46:31Z",
    "biotoolsCURIE": "biotools:mrqy",
    "biotoolsID": "mrqy",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "sev21@case.edu",
            "name": "Satish E Viswanath",
            "typeEntity": "Person"
        }
    ],
    "description": "An open-source tool for quality control of MR imaging data.\n\nThis tool takes MRI datasets in the file formats (.dcm, .nii, .nii.gz or .mha) as the input.\n\nTwo Python scripts (QC.py and QCF.py) are used to generate several tags and noise/information measurements for quality assessment. These scripts save the calculated measures in a .tsv file as well as generate .png thumbnails for all images in a subject volume. These are then fed to .js scripts to create the user interface (index.html) output. A schematic illustrating the framework of the tool is as follows.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://github.com/ccipd/MRQy",
    "language": [
        "JavaScript",
        "Python"
    ],
    "lastUpdate": "2021-03-01T09:42:52Z",
    "license": "BSD-3-Clause-Clear",
    "name": "MRQy",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1002/MP.14593",
            "metadata": {
                "abstract": "© 2020 American Association of Physicists in MedicinePurpose: There is an increasing availability of large imaging cohorts [such as through The Cancer Imaging Archive (TCIA)] for computational model development and imaging research. To ensure development of generalizable computerized models, there is a need to quickly determine relative quality differences in these cohorts, especially when considering MRI datasets which can exhibit wide variations in image appearance. The purpose of this study is to present a quantitative quality control tool, MRQy, to help interrogate MR imaging datasets for: (a) site- or scanner-specific variations in image resolution or image contrast, and (b) imaging artifacts such as noise or inhomogeneity; which need correction prior to model development. Methods: Unlike existing imaging quality control tools, MRQy has been generalized to work with images from any body region to efficiently extract a series of quality measures (e.g., noise ratios, variation metrics) and MR image metadata (e.g., voxel resolution and image dimensions). MRQy also offers a specialized HTML5-based front-end designed for real-time filtering and trend visualization of quality measures. Results: MRQy was used to evaluate (a) n = 133 brain MRIs from TCIA (7 sites) and (b) n = 104 rectal MRIs (3 local sites). MRQy measures revealed significant site-specific variations in both cohorts, indicating potential batch effects. Before processing, MRQy measures could be used to identify each of the seven sites within the TCIA cohort with 87.5%, 86.4%, 90%, 93%, 90%, 60%, and 92.9% accuracy and the three sites within the rectal cohort with 91%, 82.8%, and 88.9% accuracy using unsupervised clustering. After processing, none of the sites could be distinctively clustered via MRQy measures in either cohort; suggesting that batch effects had been largely accounted for. Marked differences in specific MRQy measures were also able to identify outlier MRI datasets that needed to be corrected for common acquisition artifacts. Conclusions: MRQy is designed to be a standalone, unsupervised tool that can be efficiently run on a standard desktop computer. It has been made freely accessible and open-source at http://github.com/ccipd/MRQy for community use and feedback.",
                "authors": [
                    {
                        "name": "Sadri A.R."
                    },
                    {
                        "name": "Janowczyk A."
                    },
                    {
                        "name": "Zhou R."
                    },
                    {
                        "name": "Verma R."
                    },
                    {
                        "name": "Beig N."
                    },
                    {
                        "name": "Antunes J."
                    },
                    {
                        "name": "Madabhushi A."
                    },
                    {
                        "name": "Tiwari P."
                    },
                    {
                        "name": "Viswanath S.E."
                    }
                ],
                "citationCount": 1,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Medical Physics",
                "title": "Technical Note: MRQy — An open-source tool for quality control of MR imaging data"
            },
            "pmid": "33176026"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Bioimaging",
            "uri": "http://edamontology.org/topic_3383"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        },
        {
            "term": "Echography",
            "uri": "http://edamontology.org/topic_3954"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}