{
    "additionDate": "2019-11-14T20:02:54Z",
    "biotoolsCURIE": "biotools:timeseriesNEM",
    "biotoolsID": "timeseriesNEM",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "niko.beerenwinkel@bsse.ethz.ch",
            "name": "Niko Beerenwinkel",
            "typeEntity": "Person"
        }
    ],
    "description": "Inferring signalling dynamics by integrating interventional with observational data | Please make sure that you have the package devtools installed. Then run: devtools::install_github(\"cbg-ethz/timeseriesNEM\") | A method for mapping a non-interventional time series onto a static nested effects model, as inferred using the Bioconductor package nem | In order to install the vignette, add the option build_vignettes = TRUE to the above command. If the vignette is still not created, the following command should do the trick: remotes::install_github(\"cbg-ethz/timeseriesNEM\", build_opts = c(\"--no-resave-data\", \"--no-manual\"), force = TRUE)",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/cbg-ethz/timeseriesNEM",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-28T16:06:58Z",
    "license": "GPL-3.0",
    "name": "timeseriesNEM",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ325",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Motivation: In order to infer a cell signalling network, we generally need interventional data from perturbation experiments. If the perturbation experiments are time-resolved, then signal progression through the network can be inferred. However, such designs are infeasible for large signalling networks, where it is more common to have steady-state perturbation data on the one hand, and a non-interventional time series on the other. Such was the design in a recent experiment investigating the coordination of epithelial-mesenchymal transition (EMT) in murine mammary gland cells. We aimed to infer the underlying signalling network of transcription factors and microRNAs coordinating EMT, as well as the signal progression during EMT. Results: In the context of nested effects models, we developed a method for integrating perturbation data with a non-interventional time series. We applied the model to RNA sequencing data obtained from an EMT experiment. Part of the network inferred from RNA interference was validated experimentally using luciferase reporter assays. Our model extension is formulated as an integer linear programme, which can be solved efficiently using heuristic algorithms. This extension allowed us to infer the signal progression through the network during an EMT time course, and thereby assess when each regulator is necessary for EMT to advance.",
                "authors": [
                    {
                        "name": "Cardner M."
                    },
                    {
                        "name": "Meyer-Schaller N."
                    },
                    {
                        "name": "Christofori G."
                    },
                    {
                        "name": "Beerenwinkel N."
                    }
                ],
                "citationCount": 2,
                "date": "2019-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Inferring signalling dynamics by integrating interventional with observational data"
            },
            "pmcid": "PMC6612850",
            "pmid": "31510686"
        }
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}