{
    "accessibility": "Open access",
    "additionDate": "2023-02-08T09:53:43.824324Z",
    "biotoolsCURIE": "biotools:meta-disc",
    "biotoolsID": "meta-disc",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "nieves.plana@salud.madrid.org",
            "name": "Maria N. Plana",
            "orcidid": "https://orcid.org/0000-0003-0921-7954",
            "typeEntity": "Person"
        },
        {
            "name": "Ingrid Arevalo-Rodriguez"
        },
        {
            "name": "Javier Zamora"
        },
        {
            "name": "Marta Roqué"
        }
    ],
    "description": "A web application for meta-analysis of diagnostic test accuracy data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Statistical modelling",
                    "uri": "http://edamontology.org/operation_3664"
                }
            ]
        }
    ],
    "homepage": "http://www.metadisc.es",
    "language": [
        "R",
        "SAS"
    ],
    "lastUpdate": "2023-02-08T09:53:43.826901Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://metadisc.sourceforge.io"
        }
    ],
    "name": "Meta-DiSc",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S12874-022-01788-2",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: Diagnostic evidence of the accuracy of a test for identifying a target condition of interest can be estimated using systematic approaches following standardized methodologies. Statistical methods for the meta-analysis of diagnostic test accuracy (DTA) studies are relatively complex, presenting a challenge for reviewers without extensive statistical expertise. In 2006, we developed Meta-DiSc, a free user-friendly software to perform test accuracy meta-analysis. This statistical program is now widely used for performing DTA meta-analyses. We aimed to build a new version of the Meta-DiSc software to include statistical methods based on hierarchical models and an enhanced web-based interface to improve user experience. Results: In this article, we present the updated version, Meta-DiSc 2.0, a web-based application developed using the R Shiny package. This new version implements recommended state-of-the-art statistical models to overcome the limitations of the statistical approaches included in the previous version. Meta-DiSc 2.0 performs statistical analyses of DTA reviews using a bivariate random effects model. The application offers a thorough analysis of heterogeneity, calculating logit variance estimates of sensitivity and specificity, the bivariate I-squared, the area of the 95% prediction ellipse, and the median odds ratios for sensitivity and specificity, and facilitating subgroup and meta-regression analyses. Furthermore, univariate random effects models can be applied to meta-analyses with few studies or with non-convergent bivariate models. The application interface has an intuitive design set out in four main menus: file upload; graphical description (forest and ROC plane plots); meta-analysis (pooling of sensitivity and specificity, estimation of likelihood ratios and diagnostic odds ratio, sROC curve); and summary of findings (impact of test through downstream consequences in a hypothetical population with a given prevalence). All computational algorithms have been validated in several real datasets by comparing results obtained with STATA/SAS and MetaDTA packages. Conclusion: We have developed and validated an updated version of the Meta-DiSc software that is more accessible and statistically sound. The web application is freely available at www.metadisc.es.",
                "authors": [
                    {
                        "name": "Arevalo-Rodriguez I."
                    },
                    {
                        "name": "Fabregate M."
                    },
                    {
                        "name": "Fernandez-Garcia S."
                    },
                    {
                        "name": "Perez T."
                    },
                    {
                        "name": "Plana M.N."
                    },
                    {
                        "name": "Roque M."
                    },
                    {
                        "name": "Soto J."
                    },
                    {
                        "name": "Zamora J."
                    }
                ],
                "citationCount": 1,
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Medical Research Methodology",
                "title": "Meta-DiSc 2.0: a web application for meta-analysis of diagnostic test accuracy data"
            },
            "pmcid": "PMC9707040",
            "pmid": "36443653"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Allergy, clinical immunology and immunotherapeutics",
            "uri": "http://edamontology.org/topic_3400"
        },
        {
            "term": "Experimental design and studies",
            "uri": "http://edamontology.org/topic_3678"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
