{"credit":[{"name":"Edinburgh University","typeEntity":"Institute","typeRoles":["Provider"]},{"name":"DRCAT","typeEntity":"Project","typeRoles":["Documentor"]},{"email":"emap@emouseatlas.org","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://www.emouseatlas.org/emap/about/what_is_emap.html"}],"function":[{"input":[{"data":{"term":"EMAGE ID","uri":"http://edamontology.org/data_1149"}}],"operation":[{"term":"Query and retrieval","uri":"http://edamontology.org/operation_0224"}],"output":[{"data":{"term":"Fate map","uri":"http://edamontology.org/data_1713"},"format":[{"term":"HTML","uri":"http://edamontology.org/format_2331"}]}]}],"labels":{"collectionID":["DRCAT"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Database portal"],"topic":[{"term":"Model organisms","uri":"http://edamontology.org/topic_0621"},{"term":"Anatomy","uri":"http://edamontology.org/topic_3067"}]},"publication":[{"abstract":"EMAGE (http://www.emouseatlas.org/emage/) is a freely available database of in situ gene expression patterns that allows users to perform online queries of mouse developmental gene expression. EMAGE is unique in providing both text-based descriptions of gene expression plus spatial maps of gene expression patterns. This mapping allows spatial queries to be accomplished alongside more traditional text-based queries. Here, we describe our recent progress in spatial mapping and data integration. EMAGE has developed a method of spatially mapping 3D embryo images captured using optical projection tomography, and through the use of an IIP3D viewer allows users to view arbitrary sections of raw and mapped 3D image data in the context of a web browser. EMAGE now includes enhancer data, and we have spatially mapped images from a comprehensive screen of transgenic reporter mice that detail the expression of mouse non-coding genomic DNA fragments with enhancer activity. We have integrated the eMouseAtlas anatomical atlas and the EMAGE database so that a user of the atlas can query the EMAGE database easily. In addition, we have extended the atlas framework to enable EMAGE to spatially cross-index EMBRYS whole mount in situ hybridization data. We additionally report on recent developments to the EMAGE web interface, including new query and analysis capabilities. © 2013 The Author(s). Published by Oxford University Press.","authors":["Richardson L.","Venkataraman S.","Stevenson P.","Yang Y.","Moss J.","Graham L.","Burton N.","Hill B.","Rao J.","Baldock R.A.","Armit C."],"cit_count":53,"doi":"10.1093/nar/gkt1155","journal":"Nucleic Acids Research","title":"EMAGE mouse embryo spatial gene expression database: 2014 update","type":"Primary","year":"2014-01-01"}],"summary":{"biotoolsCURIE":"biotools:emap","biotoolsID":"emap","description":"A digital atlas of mouse embryonic development consisting of a database of the anatomical structures that are found at different stages of mouse embryo development, and a set of 3D volumetric digital embryo models at different stages of mouse development. It creates interactive three-dimensional computer models of mouse embryos at successive stages of development with defined anatomical domains linked to a stage-by-stage ontology of anatomical names.","homepage":"http://www.emouseatlas.org/emap/home.html","name":"Edinburgh Mouse Atlas EMAP"}}