{
    "name": "Local Clustering", 
    "description": "New algorithm for local clustering to find timeshifted and/or inverted relationships in gene expression data.", 
    "homepage": "http://bioinfo.mbb.yale.edu/expression/cluster/", 
    "biotoolsID": "local_clustering", 
    "biotoolsCURIE": "biotools:local_clustering", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0315", 
                    "term": "Gene expression comparison"
                }, 
                {
                    "uri": "http://edamontology.org/operation_3432", 
                    "term": "Clustering"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0203", 
            "term": "Gene expression"
        }, 
        {
            "uri": "http://edamontology.org/topic_3053", 
            "term": "Genetics"
        }
    ], 
    "operatingSystem": [
        "Linux"
    ], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/local-clustering-find-timeshifted-andor-inverted-relationships-gene-expression-data.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://bioinfo.mbb.yale.edu/expression/cluster/", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "11743722", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Beyond synexpression relationships: Local clustering of time-shifted and inverted gene expression profiles identifies new, biologically relevant interactions", 
                "abstract": "The complexity of biological systems provides for a great diversity of relationships between genes. The current analysis of whole-genome expression data focuses on relationships based on global correlation over a whole time-course, identifying clusters of genes whose expression levels simultaneously rise and fall. There are, of course, other potential relationships between genes, which are missed by such global clustering. These include activation, where one expects a time-delay between related expression profiles, and inhibition, where one expects an inverted relationship. Here, we propose a new method, which we call local clustering, for identifying these time-delayed and inverted relationships. It is related to conventional gene-expression clustering in a fashion analogous to the way local sequence alignment (the Smith-Waterman algorithm) is derived from global alignment (Needleman-Wunsch). An integral part of our method is the use of random score distributions to assess the statistical significance of each cluster. We applied our method to the yeast cell-cycle expression dataset and were able to detect a considerable number of additional biological relationships between genes, beyond those resulting from conventional correlation. We related these new relationships between genes to their similarity in function (as determined from the MIPS scheme) or their having known protein-protein interactions (as determined from the large-scale two-hybrid experiment); we found that genes strongly related by local clustering were considerably more likely than random to have a known interaction or a similar cellular role. This suggests that local clustering may be useful in functional annotation of uncharacterized genes. We examined many of the new relationships in detail. Some of them were already well-documented examples of inhibition or activation, which provide corroboration for our results. For instance, we found an inverted expression profile relationship between genes YME1 and YNT20, where the latter has been experimentally documented as a bypass suppressor of the former. We also found new relationships involving uncharacterized yeast genes and were able to suggest functions for many of them. In particular, we found a time-delayed expression relationship between J0544 (which has not yet been functionally characterized) and four genes associated with the mitochondria. This suggests that J0544 may be involved in the control or activation of mitochondrial genes. We have also looked at other, less extensive datasets than the yeast cell-cycle and found further interesting relationships. Our clustering program and a detailed website of clustering results is available at http://www.bioinfo.mbb.yale.edu/expression/cluster (or http://www.genecensus.org/expression/cluster). © 2001 Academic Press.", 
                "date": "2001-12-14T00:00:00Z", 
                "citationCount": 132, 
                "authors": [
                    {
                        "name": "Qian J."
                    }, 
                    {
                        "name": "Dolled-Filhart M."
                    }, 
                    {
                        "name": "Lin J."
                    }, 
                    {
                        "name": "Yu H."
                    }, 
                    {
                        "name": "Gerstein M."
                    }
                ], 
                "journal": "Journal of Molecular Biology"
            }
        }
    ], 
    "credit": [
        {
            "name": "Mark Gerstein", 
            "email": "Mark.Gerstein@yale.edu", 
            "url": "http://www.gersteinlab.org/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T18:48:32Z", 
    "lastUpdate": "2018-12-10T12:58:45Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}