{
    "additionDate": "2024-02-09T10:40:54.497809Z",
    "biotoolsCURIE": "biotools:gerdh",
    "biotoolsID": "gerdh",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "wlk@njau.edu.cn",
            "name": "Likai Wang",
            "orcidid": "https://orcid.org/0000-0001-8858-794X"
        }
    ],
    "description": "Interactive multi-omics database for cross-species data mining in horticultural crops.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Phylogenetic analysis",
                    "uri": "http://edamontology.org/operation_0324"
                }
            ]
        }
    ],
    "homepage": "https://dphdatabase.com",
    "lastUpdate": "2024-11-24T14:16:58.941580Z",
    "name": "GERDH",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1111/tpj.16350",
            "metadata": {
                "abstract": "Horticultural plants contribute immensely to the quality of human's life. The rapid development of omics studies on horticultural plants has resulted in large volumes of valuable growth- and development-related data. Genes that are essential for growth and development are highly conserved in evolution. Cross-species data mining reduces the impact of species heterogeneity and has been extensively used for conserved gene identification. Owing to the lack of a comprehensive database for cross-species data mining using multi-omics data from all horticultural plant species, the current resources in this field are far from satisfactory. Here, we introduce GERDH (https://dphdatabase.com), a database platform for cross-species data mining among horticultural plants, based on 12 961 uniformly processed publicly available omics libraries from more than 150 horticultural plant accessions, including fruits, vegetables and ornamental plants. Important and conserved genes that are essential for a specific biological process can be obtained by cross-species analysis module with interactive web-based data analysis and visualization. Moreover, GERDH is equipped with seven online analysis tools, including gene expression, in-species analysis, epigenetic regulation, gene co-expression, enrichment/pathway and phylogenetic analysis. By interactive cross-species analysis, we identified key genes contributing to postharvest storage. By gene expression analysis, we explored new functions of CmEIN3 in flower development, which was validated by transgenic chrysanthemum analysis. We believe that GERDH will be a useful resource for key gene identification and will allow for omics big data to be more available and accessible to horticultural plant community members.",
                "authors": [
                    {
                        "name": "Chen F."
                    },
                    {
                        "name": "Chen S."
                    },
                    {
                        "name": "Cheng H."
                    },
                    {
                        "name": "Jiang J."
                    },
                    {
                        "name": "Song J."
                    },
                    {
                        "name": "Wang L."
                    },
                    {
                        "name": "Zhang H."
                    }
                ],
                "citationCount": 4,
                "date": "2023-11-01T00:00:00Z",
                "journal": "Plant Journal",
                "title": "GERDH: an interactive multi-omics database for cross-species data mining in horticultural crops"
            },
            "pmid": "37310261"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ]
}
