{
    "additionDate": "2021-01-18T10:24:27Z",
    "biotoolsCURIE": "biotools:phewas-neuroimaging",
    "biotoolsID": "phewas-neuroimaging",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Arthur W. Toga",
            "typeEntity": "Person"
        }
    ],
    "description": "A Free Cloud-Computing Platform for Big-Data, Brain-Wide Imaging Association Studies.\n\nNeuroimaging based phenome-wide association study.\n\nNeuroimaging based phenome-wide association studies (PheWAS) is a big data discovery approach to systematically explore relationships between behavioral, environmental, or genetic factors of interest and a wide variety of neuroimaging markers (phenotypes) using a unified factor-to-phenotype strategy.\n\nA free cloud computing platform for implementing big-data neuroimaging association studies.\n\nThe recent emergence of neuroimaging genomic databases of large healthy and diseased cohorts enables new approaches for scientific discovery, known as discovery science, to perform broad surveys examining true system-level gene-brain associations.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Anonymisation",
                    "uri": "http://edamontology.org/operation_3283"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://phewas.loni.usc.edu/phewas",
    "lastUpdate": "2021-01-23T14:49:42Z",
    "link": [
        {
            "type": [
                "Helpdesk"
            ],
            "url": "http://phewas.loni.usc.edu/phewas/contact.php"
        }
    ],
    "name": "PheWAS",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1007/S12021-020-09486-4",
            "metadata": {
                "abstract": "© 2020, Springer Science+Business Media, LLC, part of Springer Nature.Large-scale, case-control genome-wide association studies (GWASs) have revealed genetic variations associated with diverse neurological and psychiatric disorders. Recent advances in neuroimaging and genomic databases of large healthy and diseased cohorts have empowered studies to characterize effects of the discovered genetic factors on brain structure and function, implicating neural pathways and genetic mechanisms in the underlying biology. However, the unprecedented scale and complexity of the imaging and genomic data requires new advanced biomedical data science tools to manage, process and analyze the data. In this work, we introduce Neuroimaging PheWAS (phenome-wide association study): a web-based system for searching over a wide variety of brain-wide imaging phenotypes to discover true system-level gene-brain relationships using a unified genotype-to-phenotype strategy. This design features a user-friendly graphical user interface (GUI) for anonymous data uploading, study definition and management, and interactive result visualizations as well as a cloud-based computational infrastructure and multiple state-of-art methods for statistical association analysis and multiple comparison correction. We demonstrated the potential of Neuroimaging PheWAS with a case study analyzing the influences of the apolipoprotein E (APOE) gene on various brain morphological properties across the brain in the Alzheimer’s Disease Neuroimaging Initiative (ADNI) cohort. Benchmark tests were performed to evaluate the system’s performance using data from UK Biobank. The Neuroimaging PheWAS system is freely available. It simplifies the execution of PheWAS on neuroimaging data and provides an opportunity for imaging genetics studies to elucidate routes at play for specific genetic variants on diseases in the context of detailed imaging phenotypic data.",
                "authors": [
                    {
                        "name": "Batta I."
                    },
                    {
                        "name": "Hobel S."
                    },
                    {
                        "name": "Matloff W."
                    },
                    {
                        "name": "O'Driscoll C."
                    },
                    {
                        "name": "Toga A.W."
                    },
                    {
                        "name": "Zhao L."
                    }
                ],
                "date": "2021-04-01T00:00:00Z",
                "journal": "Neuroinformatics",
                "title": "Neuroimaging PheWAS (Phenome-Wide Association Study): A Free Cloud-Computing Platform for Big-Data, Brain-Wide Imaging Association Studies"
            },
            "pmid": "32822005"
        }
    ],
    "topic": [
        {
            "term": "Computer science",
            "uri": "http://edamontology.org/topic_3316"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        }
    ]
}
