{
    "additionDate": "2017-12-18T00:13:16Z",
    "biotoolsCURIE": "biotools:structator",
    "biotoolsID": "structator",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.zbh.uni-hamburg.de/forschung/anwendungsorientierte-bioinformatik.html"
        }
    ],
    "description": "A complete and robust open-source software solution for index-based search of RNA sequence-structure patterns.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://www.zbh.uni-hamburg.de/en/research/application-oriented-bioinformatics/software/structator.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://www.zbh.uni-hamburg.de/?id=271",
    "language": [
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:54Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/structator-1-1-fast-index-based-search-for-rna-sequence-structure-patterns.html"
        }
    ],
    "name": "Structator",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-12-214",
            "metadata": {
                "abstract": "Background: The secondary structure of RNA molecules is intimately related to their function and often more conserved than the sequence. Hence, the important task of searching databases for RNAs requires to match sequence-structure patterns. Unfortunately, current tools for this task have, in the best case, a running time that is only linear in the size of sequence databases. Furthermore, established index data structures for fast sequence matching, like suffix trees or arrays, cannot benefit from the complementarity constraints introduced by the secondary structure of RNAs.Results: We present a novel method and readily applicable software for time efficient matching of RNA sequence-structure patterns in sequence databases. Our approach is based on affix arrays, a recently introduced index data structure, preprocessed from the target database. Affix arrays support bidirectional pattern search, which is required for efficiently handling the structural constraints of the pattern. Structural patterns like stem-loops can be matched inside out, such that the loop region is matched first and then the pairing bases on the boundaries are matched consecutively. This allows to exploit base pairing information for search space reduction and leads to an expected running time that is sublinear in the size of the sequence database. The incorporation of a new chaining approach in the search of RNA sequence-structure patterns enables the description of molecules folding into complex secondary structures with multiple ordered patterns. The chaining approach removes spurious matches from the set of intermediate results, in particular of patterns with little specificity. In benchmark experiments on the Rfam database, our method runs up to two orders of magnitude faster than previous methods.Conclusions: The presented method's sublinear expected running time makes it well suited for RNA sequence-structure pattern matching in large sequence databases. RNA molecules containing several stem-loop substructures can be described by multiple sequence-structure patterns and their matches are efficiently handled by a novel chaining method. Beyond our algorithmic contributions, we provide with Structator a complete and robust open-source software solution for index-based search of RNA sequence-structure patterns. The Structator software is available at http://www.zbh.uni-hamburg.de/Structator. © 2011 Meyer et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Backofen R."
                    },
                    {
                        "name": "Beckstette M."
                    },
                    {
                        "name": "Kurtz S."
                    },
                    {
                        "name": "Meyer F."
                    },
                    {
                        "name": "Will S."
                    }
                ],
                "citationCount": 24,
                "date": "2011-05-27T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Structator: Fast index-based search for RNA sequence-structure patterns"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1,
    "version": [
        "1.1"
    ]
}
