{
    "name": "SULISO", 
    "description": "The SULISO suite consists of four programs for the calculation of vibrational frequencies and isotope effects. CAMVIB is a broad vibrational characterization code developed for analysis of calculated harmonic frequencies and of normal modes in terms of internal coordinates. LIPFR calculates isotopic partition function ratios for pairs of isotopically substituted whole molecules, corresponding to conventional methodology, whereas UJISO is designed to perform similar calculations on subsets of atoms from very large systems. CUTOFF is a utility which truncates a force-constant matrix for a large system to obtain a smaller matrix appropriate for a specified subset of atoms.", 
    "homepage": "https://github.com/ElsevierSoftwareX/SOFTX-D-16-00074", 
    "biotoolsID": "suliso", 
    "biotoolsCURIE": "biotools:suliso", 
    "version": [
        "2.0"
    ], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3632", 
                    "term": "Isotopic distributions calculation"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Suite"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0176", 
            "term": "Molecular dynamics"
        }
    ], 
    "operatingSystem": [
        "Linux"
    ], 
    "language": [
        "Fortran"
    ], 
    "license": "MIT", 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "https://github.com/pbw20/SULISO_manuals", 
            "type": "Manual", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1016/j.softx.2016.11.001", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "SULISO: The Bath suite of vibrational characterization and isotope effect calculation software", 
                "abstract": "© 2016 Isotope effects are subtle but powerful probes of chemical reaction mechanisms and environmental conditions, with applications across chemical, biological and earth sciences. Their meaningful interpretation often relies on calculations based upon fundamental theories for their origin. The SULISO suite consists of four programs for the calculation of vibrational frequencies and isotope effects. CAMVIB is a broad vibrational characterization code developed for analysis of calculated harmonic frequencies and of normal modes in terms of internal coordinates. LIPFR calculates isotopic partition function ratios for pairs of isotopically substituted whole molecules, corresponding to conventional methodology, whereas UJISO is designed to perform similar calculations on subsets of atoms from very large systems. CUTOFF is a utility which truncates a force-constant matrix for a large system to obtain a smaller matrix appropriate for a specified subset of atoms.", 
                "date": "2017-01-01T00:00:00Z", 
                "citationCount": 5, 
                "authors": [
                    {
                        "name": "Williams I.H."
                    }, 
                    {
                        "name": "Wilson P.B."
                    }
                ], 
                "journal": "SoftwareX"
            }
        }
    ], 
    "credit": [
        {
            "name": "Philippe B. Wilson", 
            "email": "Philippe.B.Wilson@bath.edu", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "daniel_stefan", 
    "additionDate": "2018-08-23T12:47:24Z", 
    "lastUpdate": "2018-12-10T12:59:01Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}