{"credit":[{"email":"usman@cs.njit.edu","name":"Usman Roshan","typeEntity":"Person","typeRoles":["Primary contact"]}],"function":[{"operation":[{"term":"Multiple sequence alignment","uri":"http://edamontology.org/operation_0492"},{"term":"Sequence alignment","uri":"http://edamontology.org/operation_0292"}]}],"labels":{"toolType":["Web application"],"topic":[{"term":"Imaging","uri":"http://edamontology.org/topic_3382"},{"term":"Statistics and probability","uri":"http://edamontology.org/topic_2269"},{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"}]},"publication":[{"abstract":"Motivation: The maximum expected accuracy optimization criterion for multiple sequence alignment uses pairwise posterior probabilities of residues to align sequences. The partition function methodology is one way of estimating these probabilities. Here, we combine these two ideas for the first time to construct maximal expected accuracy sequence alignments. Results: We bridge the two techniques within the program Probalign. Our results indicate that Probalign alignments are generally more accurate than other leading multiple sequence alignment methods (i.e. Probcons, MAFFT and MUSCLE) on the BAliBASE 3.0 protein alignment benchmark. Similarly, Probalign also outperforms these methods on the HOMSTRAD and OXBENCH benchmarks. Probalign ranks statistically highest (P-value < 0.005) on all three benchmarks. Deeper scrutiny of the technique indicates that the improvements are largest on datasets containing N/C-terminal extensions and on datasets containing long and heterogeneous length proteins. These points are demonstrated on both real and simulated data. Finally, our method also produces accurate alignments on long and heterogeneous length datasets containing protein repeats. Here, alignment accuracy scores are at least 10% and 15% higher than the other three methods when standard deviation of length is >300 and 400, respectively. © 2006 Oxford University Press.","authors":["Roshan U.","Livesay D.R."],"cit_count":146,"journal":"Bioinformatics","pmid":"16954142","title":"Probalign: Multiple sequence alignment using partition function posterior probabilities","year":"2006-11-15"},{"abstract":"Probalign computes maximal expected accuracy multiple sequence alignments from partition function posterior probabilities. To date, Probalign is among the very best scoring methods on the BAliBASE, HOMSTRAD and OXBENCH benchmarks. Here, we introduce eProbalign, which is an online implementation of the approach. Moreover, the eProbalign web server doubles as an online platform for post-alignment analysis. The heartand-soul of the post-alignment functionality is the Probalign Alignment Viewer applet, which provides users a convenient means to manipulate the alignments by posterior probabilities. The viewer can also be used to produce graphical and text versions of the output. The eProbalign web server and underlying Probalign source code is freely accessible at http://probalign.njit.edu. © 2007 The Author(s).","authors":["Chikkagoudar S.","Roshan U.","Livesay D."],"cit_count":6,"journal":"Nucleic Acids Research","pmid":"17485479","title":"EProbalign: Generation and manipulation of multiple sequence alignments using partition function posterior probabilities","year":"2007-07-01"}],"summary":{"biotoolsCURIE":"biotools:eprobalign","biotoolsID":"eprobalign","description":"eProbalign computes maximal expected accuracy multiple sequence alignments from partition function posterior probabilities. eProbalign also provides a platform to visualize the alignment, generate images, and manipulate the output.","homepage":"http://probalign.njit.edu/probalign/login","name":"eProbalign"}}