{
    "additionDate": "2019-11-14T18:00:19Z",
    "biotoolsCURIE": "biotools:PepVis",
    "biotoolsID": "PepVis",
    "confidence_flag": "tool",
    "description": "PepVis tool is a python based GUI pipeline which can be used to model and prepare large-scale peptide structure from the sequence and also to perform large-scale peptide virtual screening. PepVis integrates ModPep and Gromacs for modelling and structure optimization of the peptides, while it integrates AutoDock Vina,ZDOCK, AutoDock CrankPep(ADCP) for performing peptide virtual screening. \nThe protein-peptide complexes can be rescored using ZRANK2 and the flexible refinement of the large protein-peptide complexes can also be performed using FlexPepDock. The parallel job execution has been implemented using GNU parallel and the user can provide inputs using GUI which will produce the bash script based on the customized input provided by the user and can be run in terminal.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein signal peptide detection",
                    "uri": "http://edamontology.org/operation_0418"
                },
                {
                    "term": "Protein-protein docking",
                    "uri": "http://edamontology.org/operation_3899"
                },
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                }
            ]
        }
    ],
    "homepage": "https://github.com/inpacdb/PepVis",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-09T12:19:39Z",
    "license": "GPL-3.0",
    "name": "PepVis",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1111/CBDD.13607",
            "metadata": {
                "abstract": "© 2019 John Wiley & Sons A/S.Peptide therapeutics is proven to be highly potential in the treatment of various diseases due to its specificity, biological safety, and cost-effectiveness. Many of the FDA-approved peptides are currently available for therapeutic applications. In the current postgenomic era, high-throughput computational screening of drugs and peptides are highly exploited in peptide therapeutics for cost-effective and robustness. However, there is a paucity of efficient pipelines that automate virtual screening process of peptides through integration of open-source tools that are optimal to perform ensemble and flexible docking protocols. Hence, in this study, we developed a GUI-based pipeline named PepVis for automated script generation for large-scale peptide modeling and virtual screening. PepVis integrates Modpep and Gromacs for peptide structure modeling and optimization; AutoDock Vina, ZDOCK, and AutoDock CrankPep for virtual screening of peptides; ZRANK2 for rescoring of protein–peptide complexes, and FlexPepDock for flexible refinement of protein–peptide complexes. Benchmarking of ensemble docking through PepVis infers that ModPep + Vina to outperform ModPep + ZDock in terms of detecting near-natives from LEADS-PEP dataset. PepVis is built modular to incorporate many other docking algorithms in the future. This pipeline is distributed freely under the GNU GPL license and can be downloaded at https://github.com/inpacdb/PepVis.",
                "authors": [
                    {
                        "name": "Ansar S."
                    },
                    {
                        "name": "Vetrivel U."
                    }
                ],
                "citationCount": 8,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Chemical Biology and Drug Design",
                "title": "PepVis: An integrated peptide virtual screening pipeline for ensemble and flexible docking protocols"
            },
            "pmid": "31441995"
        }
    ],
    "topic": [
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}