
{
    "credit": [
        {
            "email": "johannes.waage@gmail.com",
            "name": "Johannes Waage",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "k.vitting.seerup@gmail.com",
            "name": "Kristoffer Vitting-Seerup",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "http://bioconductor.org/packages/release/bioc/html/spliceR.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/spliceR_1.16.0.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence classification",
                    "uri": "http://edamontology.org/operation_2995"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "language": [
            "R"
        ],
        "license": "GPL-2.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "RNA-Seq",
                "uri": "http://edamontology.org/topic_3170"
            },
            {
                "term": "RNA splicing",
                "uri": "http://edamontology.org/topic_3320"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Background: RNA-seq data is currently underutilized, in part because it is difficult to predict the functional impact of alternate transcription events. Recent software improvements in full-length transcript deconvolution prompted us to develop spliceR, an R package for classification of alternative splicing and prediction of coding potential.Results: spliceR uses the full-length transcript output from RNA-seq assemblers to detect single or multiple exon skipping, alternative donor and acceptor sites, intron retention, alternative first or last exon usage, and mutually exclusive exon events. For each of these events spliceR also annotates the genomic coordinates of the differentially spliced elements, facilitating downstream sequence analysis. For each transcript isoform fraction values are calculated to identify transcript switching between conditions. Lastly, spliceR predicts the coding potential, as well as the potential nonsense mediated decay (NMD) sensitivity of each transcript.Conclusions: spliceR is an easy-to-use tool that extends the usability of RNA-seq and assembly technologies by allowing greater depth of annotation of RNA-seq data. spliceR is implemented as an R package and is freely available from the Bioconductor repository (http://www.bioconductor.org/packages/2.13/bioc/html/spliceR.html). © 2014 Vitting-Seerup et al.; licensee BioMed Central Ltd.",
            "authors": [
                "Vitting-Seerup K.",
                "Porse B.T.",
                "Sandelin A.",
                "Waage J."
            ],
            "cit_count": 35,
            "doi": "10.1186/1471-2105-15-81",
            "journal": "BMC Bioinformatics",
            "title": "SpliceR: An R package for classification of alternative splicing and prediction of coding potential from RNA-seq data",
            "type": "Primary",
            "year": "2014-03-23"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:splicer",
        "biotoolsID": "splicer",
        "description": "An R package for classification of alternative splicing and prediction of coding potential from RNA-seq data.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/spliceR.html",
        "name": "spliceR",
        "version": [
            "1.16.0"
        ]
    }
}