{
    "additionDate": "2017-08-03T18:52:47Z",
    "biotoolsCURIE": "biotools:network_archaeology",
    "biotoolsID": "network_archaeology",
    "credit": [
        {
            "email": "saket@cs.umd.edu",
            "name": "Saket Navlakha",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.cs.cmu.edu/~ckingsf/"
        }
    ],
    "description": "Framework to reconstruct a complete growth history of a present-day network given only a probabilistic model by which the network putatively evolved.",
    "documentation": [
        {
            "type": "General",
            "url": "http://cbcb.umd.edu/NetArch/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                }
            ]
        }
    ],
    "homepage": "http://cbcb.umd.edu/NetArch/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-11T19:26:18Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/network-archaeology-1-0-infer-evolutionary-history-network.html"
        }
    ],
    "name": "Network Archaeology",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "What proteins interacted in a long-extinct ancestor of yeast? How have different members of a protein complex assembled together over time? Our ability to answer such questions has been limited by the unavailability of ancestral protein-protein interaction (PPI) networks. To overcome this limitation, we propose several novel algorithms to reconstruct the growth history of a present-day network. Our likelihood-based method finds a probable previous state of the graph by applying an assumed growth model backwards in time. This approach retains node identities so that the history of individual nodes can be tracked. Using this methodology, we estimate protein ages in the yeast PPI network that are in good agreement with sequence-based estimates of age and with structural features of protein complexes. Further, by comparing the quality of the inferred histories for several different growth models (duplication-mutation with complementarity, forest fire, and preferential attachment), we provide additional evidence that a duplication-based model captures many features of PPI network growth better than models designed to mimic social network growth. From the reconstructed history, we model the arrival time of extant and ancestral interactions and predict that complexes have significantly re-wired over time and that new edges tend to form within existing complexes. We also hypothesize a distribution of per-protein duplication rates, track the change of the network's clustering coefficient, and predict paralogous relationships between extant proteins that are likely to be complementary to the relationships inferred using sequence alone. Finally, we infer plausible parameters for the model, thereby predicting the relative probability of various evolutionary events. The success of these algorithms indicates that parts of the history of the yeast PPI are encoded in its present-day form. © 2011 Navlakha, Kingsford.",
                "authors": [
                    {
                        "name": "Navlakha S."
                    },
                    {
                        "name": "Kingsford C."
                    }
                ],
                "citationCount": 41,
                "date": "2011-04-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Network archaeology: Uncovering ancient networks from present-day interactions"
            },
            "pmid": "21533211"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}