{
    "additionDate": "2021-03-19T08:43:45Z",
    "biotoolsCURIE": "biotools:mircoop",
    "biotoolsID": "mircoop",
    "confidence_flag": "tool",
    "description": "Identifying Cooperating miRNAs via Kernel Based Interaction Tests.\n\nAlthough miRNAs can cause widespread changes in expression programs, single miRNAs typically induce mild repression on their targets. Cooperativity among miRNAs is reported as one strategy to overcome this constraint. Expanding the catalog of synergistic miRNAs is critical for understanding gene regulation and for developing miRNA-based therapeutics. In this study, we develop miRCoop to identify synergistic miRNA pairs that have weak or no repression on the target mRNA individually, but when act together induce strong repression. miRCoop uses kernel-based statistical interaction tests, together with miRNA and mRNA target information. We apply our approach to patient data of two different cancer types. In kidney cancer, we identify 66 putative triplets",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/guldenolgun",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-04-11T09:25:49.501544Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/guldenolgun/miRCoop"
        }
    ],
    "name": "miRCoop",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1109/TCBB.2020.3047901",
            "metadata": {
                "abstract": "IEEEAlthough miRNAs can cause widespread changes in expression programs, single miRNAs typically induce mild repression on their targets. Cooperativity among miRNAs is reported as one strategy to overcome this constraint. Expanding the catalog of synergistic miRNAs is critical for understanding gene regulation and for developing miRNA-based therapeutics. In this study, we develop miRCoop to identify synergistic miRNA pairs that have weak or no repression on the target mRNA individually, but when act together induce strong repression. miRCoop uses kernel-based statistical interaction tests, together with miRNA and mRNA target information. We apply our approach to patient data of two different cancer types. In kidney cancer, we identify 66 putative triplets. For 64 of these triplets, there is at least one common transcription factor that potentially regulates all participating RNAs of the triplet, supporting a functional association among them. Furthermore, we find that identified triplets are enriched for certain biological processes that are relevant to kidney cancer. In applying the method on liver cancer, we find 3105 triplet interactions. We believe miRCoop can aid our understanding of the complex regulatory interactions in different health and disease states of the cell and can help in designing miRNA-based therapies. Code is available \\url{https://github.com/guldenolgun",
                "authors": [
                    {
                        "name": "Olgun G."
                    },
                    {
                        "name": "Tastan O."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
                "title": "miRCoop: Identifying Cooperating miRNAs via Kernel Based Interaction Tests"
            },
            "pmid": "33382660"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ]
}