{
    "additionDate": "2020-01-09T18:34:41Z",
    "biotoolsCURIE": "biotools:Malaria_Data_District",
    "biotoolsID": "Malaria_Data_District",
    "confidence_flag": "tool",
    "description": "An open-source web application for increasing access to malaria information.\n\nPreventable diseases still cause huge mortality in low- and middle-income countries. Research in spatial epidemiology and earth observation is helping academics to understand and prioritise how mortality could be reduced and generates spatial data that are used at a global and national level, to inform disease control policy. These data could also inform operational decision making at a more local level, for example to help officials target efforts at a local regional level. To be usable for local decision-making, data needs to be presented in a way that is relevant to and understandable by local decision makers. We demonstrate an approach and prototype web application to make spatial outputs from disease modelling more useful for local decision making.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://seantomlinson30.shinyapps.io/shiny-map-prize/",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-22T14:11:17Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/SeanTomlinson30/SHINY-map-prize"
        }
    ],
    "name": "Malaria Data District",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.12688/WELLCOMEOPENRES.15495.1",
            "metadata": {
                "abstract": "© 2019 Tomlinson S et al.Preventable diseases still cause huge mortality in low- and middle-income countries. Research in spatial epidemiology and earth observation is helping academics to understand and prioritise how mortality could be reduced and generates spatial data that are used at a global and national level, to inform disease control policy. These data could also inform operational decision making at a more local level, for example to help officials target efforts at a local/regional level. To be usable for local decision-making, data needs to be presented in a way that is relevant to and understandable by local decision makers. We demonstrate an approach and prototype web application to make spatial outputs from disease modelling more useful for local decision making. Key to our approach is: (1) we focus on a handful of important data layers to maintain simplicity; (2) data are summarised at scales relevant to decision making (administrative units); (3) the application has the ability to rank and compare administrative units; (4) open-source code that can be modified and re-used by others, to target specific user-needs. Our prototype application allows visualisation of a handful of key layers from the Malaria Atlas Project. Data can be summarised by administrative unit for any malaria endemic African country, ranked and compared; e.g. to answer questions such as, ‘does the district with the highest malaria prevalence also have the lowest coverage of insecticide treated nets?'. The application is developed in R and the code is open-source. It would be relatively easy for others to change the source code to incorporate different data layers, administrative boundaries or other data visualisations. We suggest such open-source web application development can facilitate the use of data for public health decision making in low resource settings.",
                "authors": [
                    {
                        "name": "Tomlinson S."
                    },
                    {
                        "name": "South A."
                    },
                    {
                        "name": "Longbottom J."
                    }
                ],
                "citationCount": 1,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Wellcome Open Research",
                "title": "Malaria data by district: An open-source web application for increasing access to malaria information"
            }
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        }
    ],
    "validated": 1
}