{
    "additionDate": "2020-01-14T09:07:47Z",
    "biotoolsCURIE": "biotools:TECH-VER",
    "biotoolsID": "TECH-VER",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "buyukkaramikli@imta.eur.nl",
            "name": "Nasuh C. Büyükkaramikli",
            "orcidid": "https://orcid.org/0000-0002-2021-9574",
            "typeEntity": "Person"
        }
    ],
    "description": "A Verification Checklist to Reduce Errors in Models and Improve Their Credibility.\n\nThis is the model verification repository.\n\nAn application example is uploaded on the repository. This example will be updated further and with other elaborated examples.\n\nThe TECH-VER checklist consists of five domains: (1) input calculations; (2) event-state (patient flow) calculations; (3) result calculations; (4) uncertainty analysis calculations; and (5) other overall checks (e.g. validity or interface).\n\nIn health economic literature, checklists or best practice recommendations on model validation credibility always declare verification of the programmed model as a fundamental step, such as ‘is the model implemented correctly and does the implementation accurately represent the conceptual model?’ However, to date, little operational guidance for the model verification process has been given",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Literature search",
                    "uri": "http://edamontology.org/operation_0305"
                }
            ]
        }
    ],
    "homepage": "https://www.imta.nl/techver",
    "lastUpdate": "2020-12-27T15:20:21Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/nasuhcagdas/TECHVER"
        }
    ],
    "name": "TECH-VER",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/S40273-019-00844-Y",
            "metadata": {
                "abstract": "© 2019, The Author(s).Background: In health economic literature, checklists or best practice recommendations on model validation/credibility always declare verification of the programmed model as a fundamental step, such as ‘is the model implemented correctly and does the implementation accurately represent the conceptual model?’ However, to date, little operational guidance for the model verification process has been given. In this study, we aimed to create an operational checklist for model users or reviewers to verify the technical implementation of health economic decision analytical models and document their verification efforts. Methods: Literature on model validation, verification, programming errors and credibility was reviewed systematically from scientific databases. An initial beta version of the checklist was developed based on the checklists/tests identified from the literature and from authors’ previous modeling/appraisal experience. Next, the first draft checklist was presented to a number of health economists on several occasions and was tested on different models (built in different software, developed by different stakeholders, including drug manufacturers, consultancies or academia), each time leading to an update of the checklist and culminating in the final version of the TECHnical VERification (TECH-VER) checklist, introduced in this paper. Results: The TECH-VER necessitates a model reviewer (preferably independent), an executable and transparent model, its input sources, and detailed documentation (e.g. technical report/scientific paper) in which the conceptual model, its implementation, programmed model inputs, and results are reported. The TECH-VER checklist consists of five domains: (1) input calculations; (2) event-state (patient flow) calculations; (3) result calculations; (4) uncertainty analysis calculations; and (5) other overall checks (e.g. validity or interface). The first four domains reflect the verification of the components of a typical health economic model. For these domains, as a prerequisite of verification tests, the reviewer should identify the relevant calculations in the electronic model and assess the provided justifications for the methods used in the identified calculations. For this purpose, we recommend completeness/consistency checks. Afterwards, the verification tests can be conducted for the calculations in each of these stages by checking the correctness of the implementation of these calculations. For this purpose, the following type of tests are recommended in consecutive order: (i) black-box tests, i.e. checking if model calculations are in line with a priori expectations; (ii) white-box testing, i.e. going through the program code details line by line, or cell by cell (recommended for some crucial calculations and if there are some unexpected results from the black-box tests); and (iii) model replication/parallel programming (recommended only in certain situations, and if the issues related to the identified unexpected results from black-box tests could not be resolved through white-box testing). To reduce the time burden of model verification, we suggest a hierarchical order in tests i–iii, where going to the next step is necessary when the previous step fails. Conclusions: The TECH-VER checklist is a comprehensive checklist for the technical verification of decision analytical models, aiming to help identify model implementation errors and their root causes while improving the transparency and efficiency of the verification efforts. In addition to external reviews, we consider that the TECH-VER can be used as an internal training and quality control tool for new health economists, while developing their initial models. It is the authors’ aim that the TECH-VER checklist transforms itself to an open-source living document, with possible future versions, or ‘bolt-on’ extensions for specific applications with additional ‘fit-for-purpose’ tests, as well as ‘tips and tricks’ and some demonstrative error examples. For this reason, the TECH-VER checklist and the list of black-box tests created in this paper and a few model verification examples is uploaded to an open access, online platform (github and the website of the institute), where other users will also be able to upload their original verification efforts and tests.",
                "authors": [
                    {
                        "name": "Buyukkaramikli N.C."
                    },
                    {
                        "name": "Rutten-van Molken M.P.M.H."
                    },
                    {
                        "name": "Severens J.L."
                    },
                    {
                        "name": "Al M."
                    }
                ],
                "citationCount": 6,
                "date": "2019-11-01T00:00:00Z",
                "journal": "PharmacoEconomics",
                "title": "TECH-VER: A Verification Checklist to Reduce Errors in Models and Improve Their Credibility"
            },
            "pmcid": "PMC6860463",
            "pmid": "31705406"
        }
    ],
    "topic": [
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}