{
    "additionDate": "2018-05-01T18:28:45Z",
    "biotoolsCURIE": "biotools:compphy",
    "biotoolsID": "compphy",
    "credit": [
        {
            "name": "Contact form",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.atgc-montpellier.fr/compphy/?p=contact"
        }
    ],
    "description": "Web-based collaborative platform for comparing phylogenies.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.atgc-montpellier.fr/compphy/?p=userguide"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree comparison",
                    "uri": "http://edamontology.org/operation_0325"
                }
            ]
        }
    ],
    "homepage": "http://www.atgc-montpellier.fr/compphy/",
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "CompPhy",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/S12862-014-0253-5",
            "metadata": {
                "abstract": "© 2014 Fiorini et al.; licensee BioMed Central Ltd.Background: Collaborative tools are of great help in conducting projects involving distant workers. Recent web technologies have helped to build such tools for jointly editing office documents and scientific data, yet none are available for handling phylogenies. Though a large number of studies and projects in evolutionary biology and systematics involve collaborations between scientists of different institutes, current tree comparison visualization software and websites are directed toward single-user access. Moreover, tree comparison functionalities are dispersed between different software that mainly focus on high level single tree visualization but to the detriment of basic tree comparison features. Results: The web platform presented here, named CompPhy, intends to fill this gap by allowing collaborative work on phylogenies and by gathering simple advanced tools dedicated to tree comparison. It offers functionalities for tree edition, tree comparison, supertree inference and data management in a collaborative environment. The latter aspect is a specific feature of the platform, allowing people located in different places to work together at the same time on a common project. CompPhy thus proposes shared tree visualization, both synchronous and asynchronous tree manipulation, data exchange/storage, as well as facilities to keep track of the progress of analyses in working sessions. Specific advanced comparison tools are also available, such as consensus and supertree inference, or automated branch swaps of compared trees. As projects can be readily created and shared, CompPhy is also a tool that can be used easily to interact with students in a educational setting, either in the classroom or for assignments. Conclusions: CompPhy is the first web platform devoted to the comparison of phylogenetic trees allowing real-time distant collaboration on a phylogenetic/phylogenomic project. This application can be accessed freely with a recent browser at the following page of the ATGC bioinformatics platform: http://www.atgc-montpellier.fr/compphy/.",
                "authors": [
                    {
                        "name": "Fiorini N."
                    },
                    {
                        "name": "Lefort V."
                    },
                    {
                        "name": "Chevenet F."
                    },
                    {
                        "name": "Berry V."
                    },
                    {
                        "name": "Chifolleau A.-M.A."
                    }
                ],
                "citationCount": 6,
                "date": "2014-01-01T00:00:00Z",
                "journal": "BMC Evolutionary Biology",
                "title": "CompPhy: A web-based collaborative platform for comparing phylogenies"
            },
            "pmcid": "PMC4271409",
            "pmid": "25496383"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Comparative genomics",
            "uri": "http://edamontology.org/topic_0797"
        },
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        }
    ],
    "validated": 1
}