{
    "additionDate": "2020-01-09T17:54:25Z",
    "biotoolsCURIE": "biotools:GEREDB",
    "biotoolsID": "GEREDB",
    "confidence_flag": "tool",
    "description": "Gene expression regulation database curated by mining abstracts from literature.\n\nGene Expression Regulation Database.\n\nGene Expression Regulation Database (GREDB) has been developed to facilitate systems-level analyses that will provide insights into the question of how genes are regulated that governing a specific biological response. GREDB is a publicly available, manually curated biological database depositing the human gene expression regulation relationships (Links). To date, more than 39,000 Links have been contextual-ly annotated through the review of 53,000 plus abstracts. GREDB has the ability to analyze user-supplied gene expression data using the GEREA bioinformatics tool in a causal analysis oriented manner.\n\nThe database can be searched use NCBI official gene symbol (eg. CDC42).\n\nThe new version of GereDB is online for testing, please visit the following link: Run New GereDB online.\n\nHuang, Tinghua & Huang, Xiali & Shi, Bomei & Yao, Min. (2019)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "homepage": "http://www.thua45.cn/geredb",
    "lastUpdate": "2020-12-03T09:00:50Z",
    "name": "GEREDB",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1142/S0219720019500240",
            "metadata": {
                "abstract": "© 2019 World Scientific Publishing Europe Ltd.Understanding how genes are expressed and regulated in different biological processes are fundamental and challenging issues. Considerable progress has been made in studying the relationship between the expression and regulation of human genes. However, it is difficult to use these resources productively to analyze gene expression data. GEREDB (www.thua45.cn/geredb) has been developed to facilitate analyses that will provide insights into the regulation of genes that govern specific biological responses. GEREDB is a publicly available, manually curated biological database that stores the data regarding relationships between expression and regulation of human genes. To date, more than 39,000 Links have been contextually annotated by reviewing more than 53,000 abstracts. GEREDB can be searched using the official NCBI gene symbol as a query, and it can be downloaded along with the GEREA software package. GEREDB has the ability to analyze user-supplied gene expression data in a causal analysis oriented manner using the GEREA bioinformatics tool.",
                "authors": [
                    {
                        "name": "Huang T."
                    },
                    {
                        "name": "Huang X."
                    },
                    {
                        "name": "Shi B."
                    },
                    {
                        "name": "Yao M."
                    }
                ],
                "citationCount": 2,
                "date": "2019-08-01T00:00:00Z",
                "journal": "Journal of Bioinformatics and Computational Biology",
                "title": "GEREDB: Gene expression regulation database curated by mining abstracts from literature"
            },
            "pmid": "31617460"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Data submission, annotation and curation",
            "uri": "http://edamontology.org/topic_0219"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        }
    ],
    "validated": 1
}
