{
    "additionDate": "2015-09-11T22:57:36Z",
    "biotoolsCURIE": "biotools:cuticledb",
    "biotoolsID": "cuticledb",
    "collectionID": [
        "DRCAT"
    ],
    "credit": [
        {
            "email": "biodb@biol.uoa.gr",
            "name": "Biophysics and Bioinformatics Laboratory,  University of Athens",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "DRCAT",
            "typeEntity": "Project",
            "typeRole": [
                "Documentor"
            ]
        },
        {
            "name": "University of Athens",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "name": "University of Georgia",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        }
    ],
    "description": "A relational database containing all structural proteins of Arthropod cuticle identified to date. Many come from direct sequencing of proteins isolated from cuticle and from sequences from cDNAs that share common features with these authentic cuticular proteins. It also includes proteins from the Drosophila melanogaster and the Anopheles gambiae genomes, that have been predicted to be cuticular proteins, based on a Pfam motif responsible for chitin binding in Arthropod cuticle.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://biophysics.biol.uoa.gr/cuticleDB/manual/user_manual.htm"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein ID (CuticleDB)",
                        "uri": "http://edamontology.org/data_2715"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Protein report",
                        "uri": "http://edamontology.org/data_0896"
                    },
                    "format": [
                        {
                            "term": "HTML",
                            "uri": "http://edamontology.org/format_2331"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://biophysics.biol.uoa.gr/cuticleDB/",
    "language": [
        "SQL"
    ],
    "lastUpdate": "2018-12-16T13:44:35Z",
    "name": "CuticleDB",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "DRCAT",
    "publication": [
        {
            "doi": "10.1186/1471-2105-5-138",
            "metadata": {
                "abstract": "Background: The insect exoskeleton or cuticle is a bi-partite composite of proteins and chitin that provides protective, skeletal and structural functions. Little information is available about the molecular structure of this important complex that exhibits a helicoidal architecture. Scores of sequences of cuticular proteins have been obtained from direct protein sequencing, from cDNAs, and from genomic analyses. Most of these cuticular protein sequences contain motifs found only in arthropod proteins. Description: cuticleDB is a relational database containing all structural proteins of Arthropod cuticle identified to date. Many come from direct sequencing of proteins isolated from cuticle and from sequences from cDNAs that share common features with these authentic cuticular proteins. It also includes proteins from the Drosophila melanogaster and the Anopheles gambiae genomes, that have been predicted to be cuticular proteins, based on a Pfam motif (PF00379) responsible for chitin binding in Arthropod cuticle. The total number of the database entries is 445: 370 derive from insects, 60 from Crustacea and 15 from Chelicerata. The database can be accessed from our web server at http://bioinformatics.biol.uoa.gr/cuticleDB. Conclusions: CuticleDB was primarily designed to contain correct and full annotation of cuticular protein data. The database will be of help to future genome annotators. Users will be able to test hypotheses for the existence of known and also of yet unknown motifs in cuticular proteins. An analysis of motifs may contribute to understanding how proteins contribute to the physical properties of cuticle as well as to the precise nature of their interaction with chitin. © 2004 Magkrioti et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Hamodrakas S.J."
                    },
                    {
                        "name": "Iconomidou V.A."
                    },
                    {
                        "name": "Magkrioti C.K."
                    },
                    {
                        "name": "Spyropoulos I.C."
                    },
                    {
                        "name": "Willis J.H."
                    }
                ],
                "citationCount": 48,
                "date": "2004-09-28T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "cuticleDB: A relational database of Arthropod cuticular proteins"
            },
            "pmcid": "PMC522807",
            "pmid": "15453918",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        }
    ],
    "validated": 1
}
