{
    "additionDate": "2019-11-14T18:11:10Z",
    "biotoolsCURIE": "biotools:GEM-NET",
    "biotoolsID": "GEM-NET",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "alanna.schepartz@yale.edu",
            "name": "Alanna Schepartz",
            "typeEntity": "Person"
        },
        {
            "email": "jeffrey.townsend@yale.edu",
            "name": "Jeffrey P. Townsend",
            "typeEntity": "Person"
        }
    ],
    "description": "Lessons in Multi-Institution Teamwork Using Collaboration Software | Dashboard to view/download files from segregated Google Shared Drives | Center for Genetically Encoded Materials (C-GEM) | GEM-NET is the home of the Center for Genetically Encoded Materials (C-GEM), an NSF CCI (Center for Chemical Innovation) | Center for Genetically Encoded Materials | C-GEM seeks to establish a fundamentally new way to program chemical matter and transform the way we produce materials and medicines",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://gem-net.net",
    "lastUpdate": "2020-12-02T20:16:17Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/gem-net"
        }
    ],
    "name": "GEM-NET",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/ACSCENTSCI.9B00111",
            "metadata": {
                "abstract": "Copyright © 2019 American Chemical Society.The Center for Genetically Encoded Materials (C-GEM) is an NSF Phase I Center for Chemical Innovation that comprises six laboratories spread across three university campuses. Our success as a multi-institution research team demanded the development of a software infrastructure, GEM-NET, that allows all C-GEM members to work together seamlessly - as though everyone was in the same room. GEM-NET was designed to support both science and communication by integrating task management, scheduling, data sharing, and collaborative document and code editing with frictionless internal and public communication; it also maintains security over data and internal communications. In this Article, we document the design and implementation of GEM-NET: our objectives and motivating goals, how each component contributes to these goals, and the lessons learned throughout development. We also share open source code for several custom applications and document how GEM-NET can benefit users in multiple fields and teams that are both small and large. We anticipate that this knowledge will guide other multi-institution teams, regardless of discipline, to plan their software infrastructure and utilize it as swiftly and smoothly as possible.",
                "authors": [
                    {
                        "name": "Gaffney S.G."
                    },
                    {
                        "name": "Ad O."
                    },
                    {
                        "name": "Smaga S."
                    },
                    {
                        "name": "Schepartz A."
                    },
                    {
                        "name": "Townsend J.P."
                    }
                ],
                "date": "2019-07-24T00:00:00Z",
                "journal": "ACS Central Science",
                "title": "GEM-NET: Lessons in Multi-Institution Teamwork Using Collaboration Software"
            },
            "pmcid": "PMC6661976",
            "pmid": "31404233"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        }
    ],
    "validated": 1
}