
{
    "credit": [
        {
            "email": "a.m.j.j.bonvin@uu.nl",
            "name": "Bonvin Lab",
            "typeEntity": "Division",
            "typeRoles": [
                "Provider",
                "Maintainer",
                "Developer",
                "Primary contact"
            ],
            "url": "http://www.bonvinlab.org"
        },
        {
            "name": "Utrecht University",
            "typeRoles": [
            ],
            "url": "https://www.uu.nl"
        },
        {
            "name": "Netherlands Organization for Scientific Research (NWO), VICI grant no. 700.96.442",
            "typeRoles": [
            ]
        },
        {
            "name": "European H2020 e-Infrastructure grant, EOSC-Hub, grant no.777536",
            "typeRoles": [
            ]
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "https://github.com/haddocking/whiscy"
        }
    ],
    "download": [
        {
            "type": "Downloads page",
            "url": "https://github.com/haddocking/whiscy/releases",
            "version": "1.0"
        }
    ],
    "labels": {
        "collectionID": [
            "BioExcel",
            "WeNMR",
            "INSTRUCT",
            "EGI"
        ],
        "elixirNode": [
            "Netherlands"
        ],
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Protein interactions",
                "uri": "http://edamontology.org/topic_0128"
            },
            {
                "term": "Protein binding sites",
                "uri": "http://edamontology.org/topic_3534"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Protein-protein interactions play a key role in biological processes. Identifying the interacting residues is a first step toward understanding these interactions at a structural level. In this study, the interface prediction program WHISCY is presented. It combines surface conservation and structural information to predict protein-protein interfaces. The accuracy of the predictions is more than three times higher than a random prediction. These predictions have been combined with another interface prediction program, ProMate [Neuvirth et al. J Mol Biol 2004;338:181-199], resulting in an even more accurate predictor. The usefulness of the predictions was tested using the data-driven docking program HADDOCK [Dominguez et al. J Am Chem Soc 2003;125:1731-1737] in an unbound docking experiment, with the goal of generating as many near-native structures as possible. Unrefined rigid body docking solutions within 10 Å ligand RMSD from the true structure were generated for 22 out of 25 docked complexes. For 18 complexes, more than 100 of the 8000 generated models were correct. Our results demonstrates the potential of using interface predictions to drive protein-protein docking. © 2006 Wiley-Liss, Inc.",
            "authors": [
                "De Vries S.J.",
                "Van Dijk A.D.J.",
                "Bonvin A.M.J.J."
            ],
            "cit_count": 110,
            "doi": "10.1002/prot.20842",
            "journal": "Proteins: Structure, Function and Genetics",
            "title": "WHISCY: What information does surface conservation yield? Application to data-driven docking",
            "type": "Primary",
            "year": "2006-05-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:WHISCY",
        "biotoolsID": "WHISCY",
        "description": "WHISCY is a program to predict protein-protein interfaces. It is primarily based on conservation, but it also takes into account structural information. A sequence alignment is used to calculate a prediction score for each surface residue of your protein.",
        "homepage": "https://bianca.science.uu.nl/whiscy/",
        "name": "WHISCY",
        "version": [
            "1.0"
        ]
    }
}