{
    "additionDate": "2021-01-18T08:13:25Z",
    "biotoolsCURIE": "biotools:suddengains",
    "biotoolsID": "suddengains",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "milan.wiedemann@gmail.com",
            "name": "Milan Wiedemann",
            "orcidid": "https://orcid.org/0000-0003-1991-282X",
            "typeEntity": "Person"
        }
    ],
    "description": "An R package to identify sudden gains in longitudinal data.\n\nSudden gains are large and stable improvements in an outcome variable between consecutive measurements, for example during a psychological intervention with multiple assessments. Researching these occurrences could help understand individual change processes in longitudinal data. Three criteria are generally used to identify sudden gains in psychological interventions. However, applying these criteria can be time consuming and prone to errors if not fully automated. Adaptations to these criteria and methodological decisions such as how multiple gains are handled vary across studies and are reported with different levels of detail. These problems limit the comparability of individual studies and make it hard to understand or replicate the exact methods used. The R package suddengains provides a set of tools to facilitate sudden gains research",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://milanwiedemann.shinyapps.io/shinygains/",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-24T12:18:50Z",
    "name": "suddengains",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0230276",
            "metadata": {
                "abstract": "© 2020 Wiedemann et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Sudden gains are large and stable improvements in an outcome variable between consecutive measurements, for example during a psychological intervention with multiple assessments. Researching these occurrences could help understand individual change processes in longitudinal data. Three criteria are generally used to identify sudden gains in psychological interventions. However, applying these criteria can be time consuming and prone to errors if not fully automated. Adaptations to these criteria and methodological decisions such as how multiple gains are handled vary across studies and are reported with different levels of detail. These problems limit the comparability of individual studies and make it hard to understand or replicate the exact methods used. The R package suddengains provides a set of tools to facilitate sudden gains research. This article illustrates how to use the package to identify sudden gains or sudden losses and how to extract descriptive statistics as well as exportable data files for further analysis. It also outlines how these analyses can be customised to apply adaptations of the standard criteria. The suddengains package therefore offers significant scope to improve the efficiency, reporting, and reproducibility of sudden gains research.",
                "authors": [
                    {
                        "name": "Wiedemann M."
                    },
                    {
                        "name": "Thew G.R."
                    },
                    {
                        "name": "Stott R."
                    },
                    {
                        "name": "Ehlers A."
                    }
                ],
                "citationCount": 2,
                "date": "2020-01-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Suddengains: An R package to identify sudden gains in longitudinal data"
            },
            "pmcid": "PMC7062272",
            "pmid": "32150589"
        }
    ],
    "topic": [
        {
            "term": "Psychiatry",
            "uri": "http://edamontology.org/topic_3419"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        }
    ]
}