{
    "additionDate": "2017-08-03T18:44:45Z",
    "biotoolsCURIE": "biotools:gs-align",
    "biotoolsID": "gs-align",
    "credit": [
        {
            "email": "vakser@ku.edu",
            "name": "Ilya Vakser",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://im.compbio.ku.edu/"
        },
        {
            "email": "vajda@bu.edu",
            "name": "Sandor Vajda",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://im.compbio.ku.edu/"
        }
    ],
    "description": "GS-align is a novel computational method for glycan structure alignment and similarity measurement. GS-align generates possible alignments between two glycan structures through iterative maximum clique search and fragment superposition, and the optimal alignment is determined by the maximum structural similarity score, GS-score whose significance is size-independent.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.glycanstructure.org/gsalign"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Structure comparison",
                    "uri": "http://edamontology.org/operation_2483"
                },
                {
                    "term": "Structure alignment",
                    "uri": "http://edamontology.org/operation_0295"
                }
            ]
        }
    ],
    "homepage": "http://www.glycanstructure.org/gsalign",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:55Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/gs-align-glycan-structure-alignment-and-similarity-measurement.html"
        }
    ],
    "name": "GS-align",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2015 The Author 2015. Published by Oxford University Press. All rights reserved. Motivation: Glycans play critical roles in many biological processes, and their structural diversity is key for specific protein-glycan recognition. Comparative structural studies of biological molecules provide useful insight into their biological relationships. However, most computational tools are designed for protein structure, and despite their importance, there is no currently available tool for comparing glycan structures in a sequence order- and size-independent manner. Results: A novel method, GS-align, is developed for glycan structure alignment and similarity measurement. GS-align generates possible alignments between two glycan structures through iterative maximum clique search and fragment superposition. The optimal alignment is then determined by the maximum structural similarity score, GS-score, which is size-independent. Benchmark tests against the Protein Data Bank (PDB) N-linked glycan library and PDB homologous/non-homologous N-glycoprotein sets indicate that GS-align is a robust computational tool to align glycan structures and quantify their structural similarity. GS-align is also applied to template-based glycan structure prediction and monosaccharide substitution matrix generation to illustrate its utility. Availability and implementation: http://www.glycanstructure.org/gsalign.",
                "authors": [
                    {
                        "name": "Lee H.S."
                    },
                    {
                        "name": "Jo S."
                    },
                    {
                        "name": "Mukherjee S."
                    },
                    {
                        "name": "Park S.-J."
                    },
                    {
                        "name": "Skolnick J."
                    },
                    {
                        "name": "Lee J."
                    },
                    {
                        "name": "Im W."
                    }
                ],
                "citationCount": 4,
                "date": "2015-01-19T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "GS-align for glycan structure alignment and similarity measurement"
            },
            "pmid": "25857669"
        },
        {
            "metadata": {
                "abstract": "© 2015 Elsevier Inc. We announce the release of Reconstruct Ancestral State in Phylogenies (RASP), a user-friendly software package for inferring historical biogeography through reconstructing ancestral geographic distributions on phylogenetic trees. RASP utilizes the widely used Statistical-Dispersal Vicariance Analysis (S-DIVA), the Dispersal-Extinction-Cladogenesis (DEC) model (Lagrange), a Statistical DEC model (S-DEC) and BayArea. It provides a graphical user interface (GUI) to specify a phylogenetic tree or set of trees and geographic distribution constraints, draws pie charts on the nodes of a phylogenetic tree to indicate levels of uncertainty, and generates high-quality exportable graphical results. RASP can run on both Windows and Mac OS X platforms. All documentation and source code for RASP is freely available at http://mnh.scu.edu.cn/soft/blog/RASP.",
                "authors": [
                    {
                        "name": "Yu Y."
                    },
                    {
                        "name": "Harris A.J."
                    },
                    {
                        "name": "Blair C."
                    },
                    {
                        "name": "He X."
                    }
                ],
                "citationCount": 365,
                "date": "2015-06-01T00:00:00Z",
                "journal": "Molecular Phylogenetics and Evolution",
                "title": "RASP (Reconstruct Ancestral State in Phylogenies): A tool for historical biogeography"
            },
            "pmid": "25819445"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Carbohydrates",
            "uri": "http://edamontology.org/topic_0152"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        }
    ],
    "validated": 1
}