{
    "accessibility": "Open access",
    "additionDate": "2022-06-10T14:53:33.564914Z",
    "biotoolsCURIE": "biotools:coder",
    "biotoolsID": "coder",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "description": "CODER embeddings excellently reflect semantic similarity and relatedness of medical concepts. One can use CODER for embedding-based medical term normalization or to provide features for machine learning. Similar to other pretrained language models, CODER can also be fine-tuned for specific tasks.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/GanjinZero/CODER",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-06-10T14:53:33.567505Z",
    "name": "CODER",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.JBI.2021.103983",
            "metadata": {
                "abstract": "© 2022 Elsevier Inc.Objective: This paper aims to propose knowledge-aware embedding, a critical tool for medical term normalization. Methods: We develop CODER (Cross-lingual knowledge-infused medical term embedding) via contrastive learning based on a medical knowledge graph (KG) named the Unified Medical Language System, and similarities are calculated utilizing both terms and relation triplets from the KG. Training with relations injects medical knowledge into embeddings and can potentially improve their performance as machine learning features. Results: We evaluate CODER based on zero-shot term normalization, semantic similarity, and relation classification benchmarks, and the results show that CODER outperforms various state-of-the-art biomedical word embeddings, concept embeddings, and contextual embeddings. Conclusion: CODER embeddings excellently reflect semantic similarity and relatedness of medical concepts. One can use CODER for embedding-based medical term normalization or to provide features for machine learning. Similar to other pretrained language models, CODER can also be fine-tuned for specific tasks. Codes and models are available at https://github.com/GanjinZero/CODER.",
                "authors": [
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Sun H."
                    },
                    {
                        "name": "Wang F."
                    },
                    {
                        "name": "Yu S."
                    },
                    {
                        "name": "Yuan Z."
                    },
                    {
                        "name": "Zhao Z."
                    }
                ],
                "date": "2022-02-01T00:00:00Z",
                "journal": "Journal of Biomedical Informatics",
                "title": "CODER: Knowledge-infused cross-lingual medical term embedding for term normalization"
            },
            "pmid": "34990838"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        }
    ],
    "validated": 1
}
