
{
    "credit": [
        {
            "email": "zlfpeak@iastate.edu",
            "name": "Lifeng Zhang",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://metnetweb.gdcb.iastate.edu/MetNet_PathBinder.htm"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Plant biology",
                "uri": "http://edamontology.org/topic_0780"
            },
            {
                "term": "Endocrinology and metabolism",
                "uri": "http://edamontology.org/topic_3407"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/pathbinder-1-0-explore-literature-annotate-metabolic-regulatory-interactions-biomolecules.html"
        }
    ],
    "publication": [
        {
            "abstract": "Motivation: The increasingly large amount of free, online biological text makes automatic interaction extraction correspondingly attractive. Machine learning is one strategy that works by uncovering and using useful properties that are implicit in the text. However these properties are usually not reported in the literature explicitly. By investigating specific properties of biological text passages in this paper, we aim to facilitate an alternative strategy, the use of text empirics, to support mining of biomedical texts for biomolecular interactions. We report on our application of this approach, and also report some empirical findings about an important class of passages. These may be useful to others who may also wish to use the empirical properties we describe. Results: We manually analyzed syntactic and semantic properties of sentences likely to describe interactions between biomolecules. The resulting empirical data were used to design an algorithm for the PathBinder system to extract biomolecular interactions from texts. PathBinder searches PubMed for sentences describing interactions between two given biomolecules. PathBinder then uses probabilistic methods to combine evidence from multiple relevant sentences in PubMed to assess the relative likelihood of interaction between two arbitrary biomolecules. A biomolecular interaction network was constructed based on those likelihoods. Conclusion: The text empirics approach used here supports computationally friendly, performance competitive, automatic extraction of biomolecular interactions from texts. Availability: http://www.metnetdb.org/pathbinder. © 2009 Zhang et al; licensee BioMed Central Ltd.",
            "authors": [
                "Zhang L.",
                "Berleant D.",
                "Ding J.",
                "Cao T.",
                "Syrkin Wurtele E."
            ],
            "cit_count": 10,
            "journal": "BMC Bioinformatics",
            "pmid": "19811683",
            "title": "PathBinder - Text empirics and automatic extraction of biomolecular interactions",
            "year": "2009-10-08"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:pathbinder",
        "biotoolsID": "pathbinder",
        "description": "Unique, plant-based tool to explore literature, and to annotate metabolic and regulatory interactions and biomolecules.",
        "homepage": "http://www.metnetdb.org/MetNet_PathBinder.htm",
        "name": "PathBinder"
    }
}