{
    "additionDate": "2018-02-03T11:28:05Z",
    "biotoolsCURIE": "biotools:scrwl",
    "biotoolsID": "scrwl",
    "collectionID": [
        "BioExcel"
    ],
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://dunbrack.fccc.edu/Roland.php"
        }
    ],
    "description": "SCWRL4.0 is the most recent version of the SCWRL program for prediction of protein side-chain conformations. SCWRL4.0 is based on an algorithm based on graph theory that solves the combinatorial problem in side-chain prediction more rapidly than many other available program.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://dunbrack.fccc.edu/scwrl4/index.php#usage"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein structure",
                        "uri": "http://edamontology.org/data_1460"
                    },
                    "format": [
                        {
                            "term": "PDB",
                            "uri": "http://edamontology.org/format_1476"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Protein modelling (side chains)",
                    "uri": "http://edamontology.org/operation_0480"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Protein structure",
                        "uri": "http://edamontology.org/data_1460"
                    },
                    "format": [
                        {
                            "term": "PDB",
                            "uri": "http://edamontology.org/format_1476"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://dunbrack.fccc.edu/scwrl4/SCWRL4.php",
    "language": [
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:49Z",
    "license": "Proprietary",
    "maturity": "Mature",
    "name": "SCRWL",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "gelpi@ub.edu",
    "publication": [
        {
            "doi": "10.1002/prot.22488",
            "metadata": {
                "abstract": "Determination of side-chain conformations is an important step in protein structure prediction and protein design. Many such methods have been presented, although only a small number are in widespread use. SCWRL is one such method, and the SCWRL3 program (2003) has remained popular because of its speed, accuracy, and ease-of-use for the purpose of homology modeling. However, higher accuracy at comparable speed is desirable. This has been achieved in a new program SCWRL4 through: (1) a new backbone-dependent rotamer library based on kernel density estimates; (2) averaging over samples of conformations about the positions in the rotamer library; (3) a fast anisotropic hydrogen bonding function; (4) a short-range, soft van der Waals atom-atom interaction potential; (5) fast collision detection using k-discrete oriented polytopes; (6) a tree decomposition algorithm to solve the combinatorial problem; and (7) optimization of all parameters by determining the interaction graph within the crystal environment using symmetry operators of the crystallographic space group. Accuracies as a function of electron density of the side chains demonstrate that side chains with higher electron density are easier to predict than those with low-electron density and presumed conformational disorder. For a testing set of 379 proteins, 86% of χ 1 angles and 75% of χ 1+2 angles are predicted correctly within 408 of the X-ray positions. Among side chains with higher electron density (25-100th percentile), these numbers rise to 89 and 80%. The new program maintains its simple command-line interface, designed for homology modeling, and is now available as a dynamic-linked library for incorporation into other software programs. © 2009 Wiley-Liss, Inc.",
                "authors": [
                    {
                        "name": "Dunbrack Jr. R.L."
                    },
                    {
                        "name": "Krivov G.G."
                    },
                    {
                        "name": "Shapovalov M.V."
                    }
                ],
                "citationCount": 815,
                "date": "2009-11-25T00:00:00Z",
                "journal": "Proteins: Structure, Function and Bioinformatics",
                "title": "Improved prediction of protein side-chain conformations with SCWRL4"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        }
    ],
    "validated": 1,
    "version": [
        "4.0"
    ]
}
