{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"https://www.ebi.ac.uk/support/ebi-search"}],"documentation":[{"type":"GENERAL","url":"https://www.ebi.ac.uk/ebisearch/documentation.ebi"},{"type":"API_DOCUMENTATION","url":"https://www.ebi.ac.uk/ebisearch/apidoc.ebi"},{"type":"CITATION_INSTRUCTIONS","url":"https://www.ebi.ac.uk/ebisearch/overview.ebi/about#how-to-cite"}],"function":[{"operation":[{"term":"Data retrieval","uri":"http://edamontology.org/operation_2422"},{"term":"Literature search","uri":"http://edamontology.org/operation_0305"},{"term":"Genome annotation","uri":"http://edamontology.org/operation_0362"}]}],"labels":{"accessibility":["Open access"],"collectionID":["EBI Tools"],"cost":"Free of charge","maturity":"Mature","operatingSystem":["Linux","Windows","Mac"],"toolType":["Web service"],"topic":[{"term":"Literature and language","uri":"http://edamontology.org/topic_3068"},{"term":"Genomics","uri":"http://edamontology.org/topic_0622"},{"term":"Comparative genomics","uri":"http://edamontology.org/topic_0797"},{"term":"Functional genomics","uri":"http://edamontology.org/topic_0085"},{"term":"Structural genomics","uri":"http://edamontology.org/topic_0122"},{"term":"Microarray experiment","uri":"http://edamontology.org/topic_3518"},{"term":"Ontology and terminology","uri":"http://edamontology.org/topic_0089"},{"term":"Proteomics","uri":"http://edamontology.org/topic_0121"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"},{"term":"Protein interactions","uri":"http://edamontology.org/topic_0128"},{"term":"Systems biology","uri":"http://edamontology.org/topic_2259"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"https://www.biocatalogue.org/services/3763"}],"publication":[{"abstract":"© 2017 The Author(s).We present an update of the EBI Search engine, an easy-to-use fast text search and indexing system with powerful data navigation and retrieval capabilities. The interconnectivity that exists between data resources at EMBL-EBI provides easy, quick and precise navigation and a better understanding of the relationship between different data types that include nucleotide and protein sequences, genes, gene products, proteins, protein domains, protein families, enzymes and macromolecular structures, as well as the life science literature. EBI Search provides a powerful RESTful API that enables its integration into thirdparty portals, thus providing 'Search as a Service' capabilities, which are the main topic of this article.","authors":["Park Y.M.","Squizzato S.","Buso N.","Gur T.","Lopez R."],"cit_count":12,"journal":"Nucleic Acids Research","pmid":"28472374","title":"The EBI search engine: EBI search as a service - Making biological data accessible for all","type":"Other","year":"2017-07-03"},{"abstract":"© The Author(s) 2015.The European Bioinformatics Institute (EMBLEBI-https://www.ebi.ac.uk) provides free and unrestricted access to data across all major areas of biology and biomedicine. Searching and extracting knowledge across these domains requires a fast and scalable solution that addresses the requirements of domain experts as well as casual users. We present the EBI Search engine, referred to here as 'EBI Search', an easy-to-use fast text search and indexing system with powerful data navigation and retrieval capabilities. API integration provides access to analytical tools, allowing users to further investigate the results of their search. The interconnectivity that exists between data resources at EMBL-EBI provides easy, quick and precise navigation and a better understanding of the relationship between different data types including sequences, genes, gene products, proteins, protein domains, protein families, enzymes andmacromolecular structures, together with relevant life science literature.","authors":["Squizzato S.","Park Y.M.","Buso N.","Gur T.","Cowley A.","Li W.","Uludag M.","Pundir S.","Cham J.A.","McWilliam H.","Lopez R."],"cit_count":20,"journal":"Nucleic Acids Research","pmid":"25855807","title":"The EBI Search engine: Providing search and retrieval functionality for biological data from EMBL-EBI","type":"Other","year":"2015-01-01"},{"abstract":"The EB-eye is a fast and efficient search engine that provides easy and uniform access to the biological data resources hosted at the EMBL-EBI. Currently, users can access information from more than 62 distinct datasets covering some 400 million entries. The data resources represented in the EB-eye include: nucleotide and protein sequences at both the genomic and proteomic levels, structures ranging from chemicals to macro-molecular complexes, gene-expression experiments, binary level molecular interactions as well as reaction maps and pathway models, functional classifications, biological ontologies, and comprehensive literature libraries covering the biomedical sciences and related intellectual property. The EB-eye can be accessed over the web or programmatically using a SOAP Web Services interface. This allows its search and retrieval capabilities to be exploited in workflows and analytical pipe-lines. The EB-eye is a novel alternative to existing biological search and retrieval engines. In this article we describe in detail how to exploit its powerful capabilities. © The Author 2010. Published by Oxford University Press.","authors":["Valentin F.","Squizzato S.","Goujon M.","McWilliam H.","Paern J.","Lopez R."],"cit_count":31,"journal":"Briefings in Bioinformatics","pmid":"20150321","title":"Fast and efficient searching of biological data resources-using EB-eye","type":"Other","year":"2010-02-11"},{"abstract":"© The Author(s) 2019. Published by Oxford University Press on behalf of Nucleic Acids Research.The EMBL-EBI provides free access to popular bioinformatics sequence analysis applications as well as to a full-featured text search engine with powerful cross-referencing and data retrieval capabilities. Access to these services is provided via user-friendly web interfaces and via established RESTful and SOAP Web Services APIs (https://www.ebi.ac.uk/seqdb/confluence/display/JDSAT/EMBL-EBI+Web+Services+APIs+-+Data+Retrieval). Both systems have been developed with the same core principles that allow them to integrate an ever-increasing volume of biological data, making them an integral part of many popular data resources provided at the EMBL-EBI. Here, we describe the latest improvements made to the frameworks which enhance the interconnectivity between public EMBL-EBI resources and ultimately enhance biological data discoverability, accessibility, interoperability and reusability.","authors":["Madeira F.","Park Y.M.","Lee J.","Buso N.","Gur T.","Madhusoodanan N.","Basutkar P.","Tivey A.R.N.","Potter S.C.","Finn R.D.","Lopez R."],"cit_count":50,"journal":"Nucleic acids research","pmid":"30976793","title":"The EMBL-EBI search and sequence analysis tools APIs in 2019","type":"Primary","year":"2019-07-02"}],"summary":{"biotoolsCURIE":"biotools:ebi_search","biotoolsID":"ebi_search","description":"High-performance, full-featured text searches across all EMBL-EBI databases or in selected databases available from EMBL-EBI.","homepage":"https://www.ebi.ac.uk/ebisearch","name":"EBI Search"}}