{
    "additionDate": "2021-01-18T10:22:08Z",
    "biotoolsCURIE": "biotools:interferenzy",
    "biotoolsID": "interferenzy",
    "confidence_flag": "tool",
    "description": "A Web-Based Tool for Enzymatic Assay Validation and Standardized Kinetic Analysis.\n\nDownload the spreadsheet dataset template.\n\nFill in as indicated (see the included notations for reference).\n\ninterferENZY Copyright ©2019-2020 Maria Filipa Pinto, Pedro M. Martins.\n\nWhen using interferENZY, the user-provided dataset is only kept as long as interferENZY analysis by GNU Octave takes place; once the output page is presented the submitted dataset has been eliminated to ensure user data confidentiality.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "https://interferenzy.i3s.up.pt",
    "lastUpdate": "2021-02-05T07:28:30Z",
    "name": "interferENZY",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/J.JMB.2020.07.025",
            "metadata": {
                "abstract": "© 2020 Elsevier LtdEnzymatic assays are widely employed to characterize important allosteric and enzyme modulation effects. The high sensitivity of these assays can represent a serious problem if the occurrence of experimental errors surreptitiously affects the reliability of enzyme kinetics results. We have addressed this problem and found that hidden assay interferences can be unveiled by the graphical representation of progress curves in modified reaction coordinates. To render this analysis accessible to users across all levels of expertise, we have developed a webserver, interferENZY, that allows (i) an unprecedented tight quality control of experimental data, (ii) the automated identification of small and major assay interferences, and (iii) the estimation of bias-free kinetic parameters. By eliminating the subjectivity factor in kinetic data reporting, interferENZY will contribute to solving the “reproducibility crisis” that currently challenges experimental molecular biology. The interferENZY webserver is freely available (no login required) at https://interferenzy.i3s.up.pt.",
                "authors": [
                    {
                        "name": "Pinto M.F."
                    },
                    {
                        "name": "Baici A."
                    },
                    {
                        "name": "Pereira P.J.B."
                    },
                    {
                        "name": "Macedo-Ribeiro S."
                    },
                    {
                        "name": "Pastore A."
                    },
                    {
                        "name": "Rocha F."
                    },
                    {
                        "name": "Martins P.M."
                    }
                ],
                "citationCount": 1,
                "date": "2021-05-28T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "interferENZY: A Web-Based Tool for Enzymatic Assay Validation and Standardized Kinetic Analysis"
            },
            "pmid": "32768452"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        }
    ]
}