{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.bioinf.uni-freiburg.de/"}],"documentation":[{"url":"http://www.bioinf.uni-freiburg.de/Software/LatPack/manual-LatSeF.pdf"},{"url":"http://www.bioinf.uni-freiburg.de/Software/LatPack/manual-LatFold.pdf"},{"url":"http://www.bioinf.uni-freiburg.de/Software/LatPack/manual-LatFit.pdf"}],"function":[{"operation":[{"term":"Protein sequence analysis","uri":"http://edamontology.org/operation_2479"}]}],"labels":{"language":["C++"],"operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"Studies","uri":"http://edamontology.org/topic_3678"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/latpack-1-9-0-folding-studies-arbitrary-lattice-protein-models.html"}],"publication":[{"abstract":"Knowledge of a protein's three-dimensional native structure is vital in determining its chemical properties and functionality. However, experimental methods to determine structure are very costly and time-consuming. Computational approaches such as folding simulations and structure prediction algorithms are quicker and cheaper but lack consistent accuracy. This currently restricts extensive computational studies to abstract protein models. It is thus essential that simplifications induced by the models do not negate scientific value. Key to this is the use of thoroughly defined proteinlike sequences. In such cases abstract models can allow for the investigation of important biological questions. Here, we present a procedure to generate and classify proteinlike sequence data sets. Our LatPack tools and the approach in general are applicable to arbitrary lattice protein models. Identification is based on thermodynamic kinetic features and incorporates the sequential assembly of proteins by addressing cotranslational folding. We demonstrate the approach in the widely used unrestricted 3D-cubic HP-model. The resulting sequence set is the first large data set for this model exhibiting the proteinlike properties required. Our data tools are freely available and can be used to investigate protein-related problems. © HFSP Publishing.","authors":["Mann M.","Maticzka D.","Saunders R.","Backofen R."],"cit_count":10,"doi":"10.2976/1.3027681","journal":"HFSP Journal","title":"Classifying proteinlike sequences in arbitrary lattice protein models using LatPack","type":"Primary","year":"2008-12-01"}],"summary":{"biotoolsCURIE":"biotools:latpack","biotoolsID":"latpack","description":"LatPack is a collection of tools related to the folding simulations of lattice-protein models with arbitrary energy function.","homepage":"http://www.bioinf.uni-freiburg.de/Software/LatPack/","name":"LatPack","version":["1.9.0"]}}