{
    "additionDate": "2021-01-18T09:27:22Z",
    "biotoolsCURIE": "biotools:meta-ipvp",
    "biotoolsID": "meta-ipvp",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Watshara Shoombuatong",
            "typeEntity": "Person"
        }
    ],
    "description": "A sequence-based meta-predictor for improving the prediction of phage virion proteins using effective feature representation.\n\nPVPred-SCM: Improved Prediction and Analysis of Phage Virion Proteins Using Scoring Card Method.\n\nIn this work, we developed a novel PVP predictor named PVPred-SCM which is an efficient and interpretable method for predicting and analyzing PVPs.",
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/Shoombuatong2527/Benchmark-datasets/tree/master/PVP"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                },
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                },
                {
                    "term": "Simulation analysis",
                    "uri": "http://edamontology.org/operation_0244"
                }
            ]
        }
    ],
    "homepage": "http://camt.pythonanywhere.com/Meta-iPVP",
    "lastUpdate": "2021-02-22T07:20:17Z",
    "name": "Meta-iPVP",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1007/S10822-020-00323-Z",
            "metadata": {
                "abstract": "© 2020, Springer Nature Switzerland AG.Phage virion protein (PVP) perforate the host cell membrane and eventually culminates in cell rupture thereby releasing replicated phages. The accurate identification of PVP is thus a crucial step towards improving our understanding of the biological function and mechanisms of PVPs. Therefore, it is desirable to develop a computational method that is capable of fast and accurate identification of PVPs. To address this, we propose a novel sequence-based meta-predictor employing probabilistic information (referred herein as the Meta-iPVP) for the accurate identification of PVPs. Particularly, efficient feature representation approach was used to generate discriminative probabilistic features from four machine learning (ML) algorithms making use of seven feature encodings. To the best of our knowledge, the Meta-iPVP is the first meta-based approach that has been developed for PVP prediction. Independent test results indicated that the Meta-iPVP could discern important characteristics between PVPs and non-PVPs as well as achieving the best accuracy and MCC of 0.817 and 0.642, respectively, which corresponds to 6–10% and 14–21% improvements over existing PVP predictors. As such, this demonstrates that the proposed Meta-iPVP is a more efficient, robust and promising for the identification of PVPs. The predictive model is deployed as a publicly accessible Meta-iPVP webserver freely available online at http://camt.pythonanywhere.com/Meta-iPVP.",
                "authors": [
                    {
                        "name": "Charoenkwan P."
                    },
                    {
                        "name": "Nantasenamat C."
                    },
                    {
                        "name": "Hasan M.M."
                    },
                    {
                        "name": "Shoombuatong W."
                    }
                ],
                "citationCount": 8,
                "date": "2020-10-01T00:00:00Z",
                "journal": "Journal of Computer-Aided Molecular Design",
                "title": "Meta-iPVP: a sequence-based meta-predictor for improving the prediction of phage virion proteins using effective feature representation"
            },
            "pmid": "32557165"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        }
    ]
}