
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.math-evry.cnrs.fr/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Regression",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Studies",
                "uri": "http://edamontology.org/topic_3678"
            },
            {
                "term": "SNP",
                "uri": "http://edamontology.org/topic_2885"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Linkage",
                "uri": "http://edamontology.org/topic_0102"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/bald-blockwise-approach-using-linkage-disequilibrium.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2015 Dehman et al.; licensee BioMed Central. Background: Genome-wide association studies (GWAS) aim at finding genetic markers that are significantly associated with a phenotype of interest. Single nucleotide polymorphism (SNP) data from the entire genome are collected for many thousands of SNP markers, leading to high-dimensional regression problems where the number of predictors greatly exceeds the number of observations. Moreover, these predictors are statistically dependent, in particular due to linkage disequilibrium (LD). We propose a three-step approach that explicitly takes advantage of the grouping structure induced by LD in order to identify common variants which may have been missed by single marker analyses (SMA). In the first step, we perform a hierarchical clustering of SNPs with an adjacency constraint using LD as a similarity measure. In the second step, we apply a model selection approach to the obtained hierarchy in order to define LD blocks. Finally, we perform Group Lasso regression on the inferred LD blocks. We investigate the efficiency of this approach compared to state-of-the art regression methods: haplotype association tests, SMA, and Lasso and Elastic-Net regressions. Results: Our results on simulated data show that the proposed method performs better than state-of-the-art approaches as soon as the number of causal SNPs within an LD block exceeds 2. Our results on semi-simulated data and a previously published HIV data set illustrate the relevance of the proposed method and its robustness to a real LD structure. The method is implemented in the R package BALD (Blockwise Approach using Linkage Disequilibrium), available from http://www.math-evry.cnrs.fr/publications/logiciels . Conclusions: Our results show that the proposed method is efficient not only at the level of LD blocks by inferring well the underlying block structure but also at the level of individual SNPs. Thus, this study demonstrates the importance of tailored integration of biological knowledge in high-dimensional genomic studies such as GWAS.",
            "authors": [
                "Dehman A.",
                "Ambroise C.",
                "Neuvial P."
            ],
            "cit_count": 8,
            "doi": "10.1186/s12859-015-0556-6",
            "journal": "BMC Bioinformatics",
            "title": "Performance of a blockwise approach in variable selection using linkage disequilibrium information",
            "type": "Primary",
            "year": "2015-12-12"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:bald",
        "biotoolsID": "bald",
        "description": "BALD is the R package BALD implements/combines functions for Genome-Wide Association Studies including simulation of SNPs data, constrained hierarchical clustering using Linkage Disequilibrium (LD) measures, the Gap statistic to find the optimal number of clusters, and statistical regression models for SNP selection (Univariate, Lasso, Group Lasso, Elastic-Net).",
        "homepage": "http://www.math-evry.cnrs.fr/publications/logiciels",
        "name": "BALD",
        "version": [
            "0.1.1"
        ]
    }
}