{
    "name": "MTR", 
    "description": "Metagenomics software for clustering at multiple ranks.", 
    "homepage": "http://cs.ru.nl/~gori/#MTRRef", 
    "biotoolsID": "mtr", 
    "biotoolsCURIE": "biotools:mtr", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3460", 
                    "term": "Taxonomic classification"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Workflow"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3174", 
            "term": "Metagenomics"
        }
    ], 
    "operatingSystem": [], 
    "language": [
        "MATLAB", 
        "C++"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [], 
    "publication": [
        {
            "doi": null, 
            "pmid": "21127032", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "MTR: Taxonomic annotation of short metagenomic reads using clustering at multiple taxonomic ranks", 
                "abstract": "Motivation: Metagenomics is a recent field of biology that studies microbial communities by analyzing their genomic content directly sequenced from the environment. A metagenomic dataset consists of many short DNA or RNA fragments called reads. One interesting problem in metagenomic data analysis is the discovery of the taxonomic composition of a given dataset. A simple method for this task, called the Lowest Common Ancestor (LCA), is employed in state-of-the-art computational tools for metagenomic data analysis of very short reads (about 100 bp). However LCA has two main drawbacks: it possibly assigns many reads to high taxonomic ranks and it discards a high number of reads. Results: We present MTR, a new method for tackling these drawbacks using clustering at Multiple Taxonomic Ranks. Unlike LCA, which processes the reads one-by-one, MTR exploits information shared by reads. Specifically, MTR consists of two main phases. First, for each taxonomic rank, a collection of potential clusters of reads is generated, and each potential cluster is associated to a taxon at that rank. Next, a small number of clusters is selected at each rank using a combinatorial optimization algorithm. The effectiveness of the resulting method is tested on a large number of simulated and real-life metagenomes. Results of experiments show that MTR improves on LCA by discarding a significantly smaller number of reads and by assigning much more reads at lower taxonomic ranks. Moreover, MTR provides a more faithful taxonomic characterization of the metagenome population distribution. © The Author(s) 2010. Published by Oxford University Press.", 
                "date": "2011-01-01T00:00:00Z", 
                "citationCount": 37, 
                "authors": [
                    {
                        "name": "Gori F."
                    }, 
                    {
                        "name": "Folino G."
                    }, 
                    {
                        "name": "Jetten M.S.M."
                    }, 
                    {
                        "name": "Marchiori E."
                    }
                ], 
                "journal": "Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": "Fabio Gori", 
            "email": "gori@science.ru.nl", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "seqwiki_import", 
    "additionDate": "2017-01-13T13:15:33Z", 
    "lastUpdate": "2018-12-10T12:58:56Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}