{
    "additionDate": "2017-03-24T09:33:57Z",
    "biotoolsCURIE": "biotools:ilm",
    "biotoolsID": "ilm",
    "description": "Server which provides iterated loop matching and maximum weighted matching algorithms for pseudoknot containing RNA secondary structure prediction. Algorithms can apply thermodynamic and comparative information, and thus can be used for either aligned or individual sequences.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA secondary structure alignment",
                    "uri": "http://edamontology.org/operation_0502"
                },
                {
                    "term": "RNA secondary structure analysis",
                    "uri": "http://edamontology.org/operation_2439"
                },
                {
                    "term": "RNA secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0278"
                },
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                }
            ]
        }
    ],
    "homepage": "http://cic.cs.wustl.edu/RNA/",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:40Z",
    "name": "ILM",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: Pseudoknots have generally been excluded from the prediction of RNA secondary structures due to its difficulty in modeling. Although, several dynamic programming algorithms exist for the prediction of pseudoknots using thermodynamic approaches, they are neither reliable nor efficient. On the other hand, comparative methods are more reliable, but are often done in an ad hoc manner and require expert intervention. Maximum weighted matching, an algorithm for pseudoknot prediction with comparative analysis, suffers from low-prediction accuracy in many cases. Results: Here we present an algorithm, iterated loop matching, for reliably and efficiently predicting RNA secondary structures including pseudoknots. The method can utilize either thermodynamic or comparative information or both, thus is able to predict pseudoknots for both aligned and individual sequences. We have tested the algorithm on a number of RNA families. Using 8-12 homologous sequences, the algorithm correctly identifies more than 90% of base-pairs for short sequences and 80% overall. It correctly predicts nearly all pseudoknots and produces very few spurious base-pairs for sequences without pseudoknots. Comparisons show that our algorithm is both more sensitive and more specific than the maximum weighted matching method. In addition, our algorithm has high-prediction accuracy on individual sequences, comparable with the PKNOTS algorithm, while using much less computational resources.",
                "authors": [
                    {
                        "name": "Ruan J."
                    },
                    {
                        "name": "Stormo G.D."
                    },
                    {
                        "name": "Zhang W."
                    }
                ],
                "citationCount": 178,
                "date": "2004-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "An Iterated loop matching approach to the prediction of RNA secondary structures with pseudoknots"
            },
            "pmid": "14693809"
        },
        {
            "metadata": {
                "abstract": "Motivation: Recently, we described a Maximum Weighted Matching (MWM) method for RNA structure prediction. The MWM method is capable of detecting pseudoknots and other tertiary base-pairing interactions in a computationally efficient manner. Here we report on the results of our efforts to improve the MWM method's predictive accuracy and show how the method can be extended to detect base interactions formerly inaccessible to automated RNA modeling techniques. Results: Improved performance in MWM structure prediction was achieved in two ways. First, new ways of calculating base pair likelihoods have been developed. These allow experimental data and combined statistical and thermodynamic information to be used by the program. Second accuracy was improved by developing techniques for filtering out spurious base pairs predicted by the MWM program. We also demonstrate here a means by which the MWM folding method may be used to detect the presence of base triples in RNAs. Availability: http://www.cshl.org/mzhanglab/tabaska/jax-page.html. Contact: tabaska@@@cshl.org.",
                "authors": [
                    {
                        "name": "Cary R.B."
                    },
                    {
                        "name": "Gabow H.N."
                    },
                    {
                        "name": "Stormo G.D."
                    },
                    {
                        "name": "Tabaska J.E."
                    }
                ],
                "citationCount": 121,
                "date": "1998-11-17T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "An RNA folding method capable of identifying pseudoknots and base triples"
            },
            "pmid": "9789095"
        },
        {
            "metadata": {
                "abstract": "The ILM web server provides a web interface to two algorithms, iterated loop matching and maximum weighted matching, for efficiently predicting RNA secondary structures with pseudoknots. The algorithms can utilize either thermodynamic or comparative information or both, and thus can work on both aligned and individual sequences. Predicted secondary structures are presented in several formats compatible with a variety of existing visualization tools. The service can be accessed at http://cic.cs.wustl.edu/RNA/. © Oxford University Press 2004; all rights reserved.",
                "authors": [
                    {
                        "name": "Ruan J."
                    },
                    {
                        "name": "Stormo G.D."
                    },
                    {
                        "name": "Zhang W."
                    }
                ],
                "citationCount": 23,
                "date": "2004-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "ILM: A web server for predicting RNA secondary structures with pseudoknots"
            },
            "pmid": "15215368"
        },
        {
            "metadata": {
                "abstract": "We have examined the utility of a graph-theoretic algorithm for building comparative RNA models. The method uses a maximum weighted matching algorithm to find the optimal set of basepairs given the mutual information for all pairs of alignment positions. In all cases examined, the technique generated models similar to those based on conventional comparative analysis. Any set of pairwise interactions can be suggested including pseudoknots. Here we describe the details of the method and demonstrate its implementation on tRNA where many secondary and tertiary base-pairs are accurately predicted. We also examine the usefulness of the method for the identification of shared structural features in families of RNAs isolated by artificial selection methods such as SELEX.",
                "authors": [
                    {
                        "name": "Cary R.B."
                    },
                    {
                        "name": "Stormo G.D."
                    }
                ],
                "citationCount": 37,
                "date": "1995-01-01T00:00:00Z",
                "journal": "Proceedings / ... International Conference on Intelligent Systems for Molecular Biology ; ISMB. International Conference on Intelligent Systems for Molecular Biology",
                "title": "Graph-theoretic approach to RNA modeling using comparative data."
            },
            "pmid": "7584469"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "Protein secondary structure",
            "uri": "http://edamontology.org/topic_3542"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}
