{
    "additionDate": "2021-12-06T12:14:15.776233Z",
    "biotoolsCURIE": "biotools:spatstat",
    "biotoolsID": "spatstat",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "arnmayer@uni-mainz.de",
            "name": "Arnulf Mayer",
            "orcidid": "https://orcid.org/0000-0002-3101-9180",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Spatstat is an R package for spatial statistics with a strong focus on analysing spatial point patterns in 2D (with some support for 3D and very basic support for space-time).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "homepage": "http://spatstat.org/",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-12-06T12:14:15.778647Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://apps.math.aau.dk/spatstat/"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/spatstat/spatstat"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/spatstat/spatstat/issues"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://cran.r-project.org/package=spatstat"
        }
    ],
    "name": "Spatstat",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3390/CANCERS13081924",
            "metadata": {
                "abstract": "© 2021 by the authors. Licensee MDPI, Basel, Switzerland.(1) Background: The immune system has physiological antitumor activity, which is partially mediated by cytotoxic T lymphocytes (CTL). Tumor hypoxia, which is highly prevalent in cancers of the head and neck region, has been hypothesized to inhibit the infiltration of tumors by CTL. In situ data validating this concept have so far been based solely upon the visual assessment of the distribution of CTL. Here, we have established a set of spatial statistical tools to address this problem mathematically and tested their performance. (2) Patients and Methods: We have analyzed regions of interest (ROI) of 22 specimens of cancers of the head and neck region after 4-plex immunofluorescence staining and whole-slide scanning. Single cell-based segmentation was carried out in QuPath. Specimens were analyzed with the endpoints clustering and interactions between CTL, normoxic, and hypoxic tumor areas, both visually and using spatial statistical tools implemented in the R package Spatstat. (3) Results: Visual assessment suggested clustering of CTL in all instances. The visual analysis also suggested an inhibitory effect between hypoxic tumor areas and CTL in a minority of the whole-slide scans (9 of 22, 41%). Conversely, the objective mathematical analysis in Spatstat demonstrated statistically significant inhibitory interactions between hypoxia and CTL accumulation in a substantially higher number of specimens (16 of 22, 73%). It showed a similar trend in all but one of the remaining samples. (4) Conclusion: Our findings provide non-obvious but statistically rigorous evidence of inhibition of CTL infiltration into hypoxic tumor subregions of cancers of the head and neck. Importantly, these shielded sites may be the origin of tumor recurrences. We provide the methodology for the transfer of our statistical approach to similar questions. We discuss why versions of the Kcross and pcf.cross functions may be the methods of choice among the repertoire of statistical tests in Spatstat for this type of analysis.",
                "authors": [
                    {
                        "name": "Kaufmann J."
                    },
                    {
                        "name": "Biscio C.A.N."
                    },
                    {
                        "name": "Bankhead P."
                    },
                    {
                        "name": "Zimmer S."
                    },
                    {
                        "name": "Schmidberger H."
                    },
                    {
                        "name": "Rubak E."
                    },
                    {
                        "name": "Mayer A."
                    }
                ],
                "date": "2021-04-02T00:00:00Z",
                "journal": "Cancers",
                "title": "Using the r package spatstat to assess inhibitory effects of microregional hypoxia on the infiltration of cancers of the head and neck region by cytotoxic t lymphocytes"
            },
            "pmcid": "PMC8072547",
            "pmid": "33923522",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        }
    ]
}