{
    "additionDate": "2022-10-11T07:26:03.122122Z",
    "biotoolsCURIE": "biotools:gamacomet",
    "biotoolsID": "gamacomet",
    "confidence_flag": "tool",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "smulyana@ugm.ac.id",
            "name": "Sri Mulyana"
        },
        {
            "email": "afia@ugm.ac.id",
            "name": "Afiahayati",
            "orcidid": "https://orcid.org/0000-0003-4647-5493",
            "typeEntity": "Person"
        },
        {
            "name": "Sri Mulyana"
        }
    ],
    "description": "GamaComet is a web-based buccal mucosa comet assay detection and classification tool, which purpose is to measure the amount of damage contained within the DNA.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://bioinformatics.mipa.ugm.ac.id/gamacomet/",
    "lastUpdate": "2022-10-11T07:26:03.124789Z",
    "license": "Not licensed",
    "name": "GamaComet",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3390/DIAGNOSTICS12082002",
            "metadata": {
                "abstract": "© 2022 by the authors.Comet assay is a simple and precise method to analyze DNA damage. Nowadays, many research studies have demonstrated the effectiveness of buccal mucosa cells usage in comet assays. However, several software tools do not perform well for detecting and classifying comets from a comet assay image of buccal mucosa cells because the cell has a lot more noise. Therefore, a specific software tool is required for fully automated comet detection and classification from buccal mucosa cell swabs. This research proposes a deep learning-based fully automated framework using Faster R-CNN to detect and classify comets in a comet assay image taken from buccal mucosa swab. To train the Faster R-CNN model, buccal mucosa samples were collected from 24 patients in Indonesia. We acquired 275 comet assay images containing 519 comets. Furthermore, two strategies were used to overcome the lack of dataset problems during the model training, namely transfer learning and data augmentation. We implemented the proposed Faster R-CNN model as a web-based tool, GamaComet, that can be accessed freely for academic purposes. To test the GamaComet, buccal mucosa samples were collected from seven patients in Indonesia. We acquired 43 comet assay images containing 73 comets. GamaComet can give an accuracy of 81.34% for the detection task and an accuracy of 66.67% for the classification task. Furthermore, we also compared the performance of GamaComet with an existing free software tool for comet detection, OpenComet. The experiment results showed that GamaComet performed significantly better than OpenComet that could only give an accuracy of 11.5% for the comet detection task. Downstream analysis can be well conducted based on the detection and classification results from GamaComet. The analysis showed that patients owning comet assay images containing comets with class 3 and class 4 had a smoking habit, meaning they had more cells with a high level of DNA damage. Although GamaComet had a good performance, the performance for the classification task could still be improved. Therefore, it will be one of the future works for the research development of GamaComet.",
                "authors": [
                    {
                        "name": "Afiahayati"
                    },
                    {
                        "name": "Anarossi E."
                    },
                    {
                        "name": "Mulyana S."
                    },
                    {
                        "name": "Yanuaryska R.D."
                    }
                ],
                "date": "2022-08-01T00:00:00Z",
                "journal": "Diagnostics",
                "title": "GamaComet: A Deep Learning-Based Tool for the Detection and Classification of DNA Damage from Buccal Mucosa Comet Assay Images"
            },
            "pmcid": "PMC9407097",
            "pmid": "36010352"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
