{"credit":[{"email":"gcyuan@jimmy.harvard.edu","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://bcb.dfci.harvard.edu/~gcyuan/"}],"documentation":[{"type":"GENERAL","url":"https://github.com/lucapinello/mim"}],"function":[{"operation":[{"term":"Sequence motif analysis","uri":"http://edamontology.org/operation_2404"}]}],"labels":{"language":["Python"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"DNA","uri":"http://edamontology.org/topic_0654"},{"term":"Nucleic acid sites, features and motifs","uri":"http://edamontology.org/topic_3511"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/mim-motif-independent-metric.html"}],"publication":[{"abstract":"Background: Genome-wide mapping of protein-DNA interactions has been widely used to investigate biological functions of the genome. An important question is to what extent such interactions are regulated at the DNA sequence level. However, current investigation is hampered by the lack of computational methods for systematic evaluating sequence specificity.Results: We present a simple, unbiased quantitative measure for DNA sequence specificity called the Motif Independent Measure (MIM). By analyzing both simulated and real experimental data, we found that the MIM measure can be used to detect sequence specificity independent of presence of transcription factor (TF) binding motifs. We also found that the level of specificity associated with H3K4me1 target sequences is highly cell-type specific and highest in embryonic stem (ES) cells. We predicted H3K4me1 target sequences by using the N- score model and found that the prediction accuracy is indeed high in ES cells.The software to compute the MIM is freely available at: https://github.com/lucapinello/mim. . Conclusions: Our method provides a unified framework for quantifying DNA sequence specificity and serves as a guide for development of sequence-based prediction models. © 2011 Pinello et al; licensee BioMed Central Ltd.","authors":["Pinello L.","Lo Bosco G.","Hanlon B.","Yuan G.-C."],"cit_count":13,"journal":"BMC Bioinformatics","pmid":"22017798","title":"A motif-independent metric for DNA sequence specificity","year":"2011-10-21"}],"summary":{"biotoolsCURIE":"biotools:mim","biotoolsID":"mim","description":"Calculates a measure of sequence specificity called Motif Independent Metric.","homepage":"http://bcb.dfci.harvard.edu/~gcyuan/software.html","name":"MIM"}}