{
    "additionDate": "2020-01-09T18:17:50Z",
    "biotoolsCURIE": "biotools:MRIcron",
    "biotoolsID": "MRIcron",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "atprabhakar@gmail.com",
            "name": "Appaswamy Thirumal Prabhakar",
            "orcidid": "https://orcid.org/0000-0003-2008-1808",
            "typeEntity": "Person",
            "url": "http://orcid.org/0000-0003-2008-1808"
        }
    ],
    "description": "Neural Correlates of Urinary Retention in Lateral Medullary Infarction.\n\nMRIcron is a cross-platform NIfTI format image viewer. It can load multiple layers of images, generate volume renderings and draw volumes of interest. It also provides dcm2nii for converting DICOM images to NIfTI format and NPM for statistics. MRIcron is a mature and useful tool, however you may want to consider the more recent MRIcroGL as an alternative.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'micturition', 'micturition dysfunction', 'dysfunction', 'LMI'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://www.nitrc.org/projects/mricron",
    "lastUpdate": "2020-01-09T18:17:50Z",
    "name": "MRIcron",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.5213/INJ.1836256.128",
            "metadata": {
                "abstract": "© 2019 Korean Continence SocietyPurpose: The brainstem plays an important role in the control of micturition, and brainstem strokes are known to present with micturition dysfunction. Micturition dysfunction in cases of lateral medullary infarction (LMI) is uncommon, but often manifests as urinary retention. In this study, we investigated the neuro-anatomical correlates of urinary retention in patients with LMI. Methods: This was a hospital-based retrospective study conducted in the neurology unit of a quaternary-level teaching hospital. Inpatient records from January 2008 to May 2018 were searched using a computerized database. Cases of isolated LMI were identified and those with micturition dysfunction were reviewed. MRI brain images of all patients were viewed, and individual lesions were mapped onto the Montreal Neurological Institute (MNI) space manually using MRIcron. Nonparametric mapping toolbox software was used for voxel-based lesion-symptom analysis. The Liebermeister test was used for statistical analysis, and the resultant statistical map was displayed on the MNI template using MRIcron. Results: During the study period, 31 patients with isolated LMI were identified. Their mean age was 48 years and 28 (90%) were male. Six of these patients (19%) developed micturition dysfunction. All 6 patients had urinary retention and 1 patient each had urge incontinence and overflow incontinence. In patients with LMI, the lateral tegmentum of the medulla showed a significant association with urinary retention. Conclusions: In patients with isolated LMI, we postulate that disruption of the descending pathway from the pontine micturition centre to the sacral spinal cord at the level of the lateral tegmentum results in urinary retention.",
                "authors": [
                    {
                        "name": "Prabhakar A.T."
                    },
                    {
                        "name": "Ahmed A.S.I."
                    },
                    {
                        "name": "Nair A.V."
                    },
                    {
                        "name": "Mathew V."
                    },
                    {
                        "name": "Aaron S."
                    },
                    {
                        "name": "Sivadasan A."
                    },
                    {
                        "name": "Alexander M."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "International Neurourology Journal",
                "title": "Neural correlates of urinary retention in lateral medullary infarction"
            },
            "pmcid": "PMC6790816",
            "pmid": "31607099"
        }
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Urology and nephrology",
            "uri": "http://edamontology.org/topic_3422"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ]
}