{
    "accessibility": "Restricted access",
    "additionDate": "2019-05-27T15:01:34Z",
    "biotoolsCURIE": "biotools:TOPAS",
    "biotoolsID": "TOPAS",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "perl@topasmc.org",
            "name": "Joseph Perl",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Proton Monte Carlo platform for research and clinical applications.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://topas.readthedocs.io/en/latest/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                }
            ]
        }
    ],
    "homepage": "http://www.topasmc.org/home",
    "language": [
        "C++"
    ],
    "lastUpdate": "2020-06-16T10:55:22Z",
    "license": "Proprietary",
    "maturity": "Mature",
    "name": "TOPAS",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1118/1.4758060",
            "metadata": {
                "abstract": "Purpose: While Monte Carlo particle transport has proven useful in many areas (treatment head design, dose calculation, shielding design, and imaging studies) and has been particularly important for proton therapy (due to the conformal dose distributions and a finite beam range in the patient), the available general purpose Monte Carlo codes in proton therapy have been overly complex for most clinical medical physicists. The learning process has large costs not only in time but also in reliability. To address this issue, we developed an innovative proton Monte Carlo platform and tested the tool in a variety of proton therapy applications. Methods: Our approach was to take one of the already-established general purpose Monte Carlo codes and wrap and extend it to create a specialized user-friendly tool for proton therapy. The resulting tool, TOol for PArticle Simulation (TOPAS), should make Monte Carlo simulation more readily available for research and clinical physicists. TOPAS can model a passive scattering or scanning beam treatment head, model a patient geometry based on computed tomography (CT) images, score dose, fluence, etc., save and restart a phase space, provides advanced graphics, and is fully four-dimensional (4D) to handle variations in beam delivery and patient geometry during treatment. A custom-designed TOPAS parameter control system was placed at the heart of the code to meet requirements for ease of use, reliability, and repeatability without sacrificing flexibility. Results: We built and tested the TOPAS code. We have shown that the TOPAS parameter system provides easy yet flexible control over all key simulation areas such as geometry setup, particle source setup, scoring setup, etc. Through design consistency, we have insured that user experience gained in configuring one component, scorer or filter applies equally well to configuring any other component, scorer or filter. We have incorporated key lessons from safety management, proactively removing possible sources of user error such as line-ordering mistakes. We have modeled proton therapy treatment examples including the UCSF eye treatment head, the MGH stereotactic alignment in radiosurgery treatment head and the MGH gantry treatment heads in passive scattering and scanning modes, and we have demonstrated dose calculation based on patient-specific CT data. Initial validation results show agreement with measured data and demonstrate the capabilities of TOPAS in simulating beam delivery in 3D and 4D. Conclusions: We have demonstrated TOPAS accuracy and usability in a variety of proton therapy setups. As we are preparing to make this tool freely available for researchers in medical physics, we anticipate widespread use of this tool in the growing proton therapy community. © 2012 American Association of Physicists in Medicine.",
                "authors": [
                    {
                        "name": "Perl J."
                    },
                    {
                        "name": "Shin J."
                    },
                    {
                        "name": "Schumann J."
                    },
                    {
                        "name": "Faddegon B."
                    },
                    {
                        "name": "Paganetti H."
                    }
                ],
                "citationCount": 284,
                "date": "2012-01-01T00:00:00Z",
                "journal": "Medical Physics",
                "title": "TOPAS: An innovative proton Monte Carlo platform for research and clinical applications"
            },
            "pmcid": "PMC3493036",
            "pmid": "23127075",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        }
    ]
}