{
    "accessibility": "Open access",
    "additionDate": "2024-05-06T09:35:22.591259Z",
    "biotoolsCURIE": "biotools:idppub",
    "biotoolsID": "idppub",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "bing.zhang@bcm.edu",
            "name": "Bing Zhang",
            "typeEntity": "Person"
        },
        {
            "name": "Sara R Savage",
            "typeEntity": "Person"
        }
    ],
    "description": "Illuminating the Dark Phosphoproteome Through PubMed Mining.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "homepage": "http://idppub.ptmax.org",
    "lastUpdate": "2024-11-24T14:01:29.029360Z",
    "name": "IDPpub",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/j.mcpro.2023.100682",
            "metadata": {
                "abstract": "Global phosphoproteomics experiments quantify tens of thousands of phosphorylation sites. However, data interpretation is hampered by our limited knowledge on functions, biological contexts, or precipitating enzymes of the phosphosites. This study establishes a repository of phosphosites with associated evidence in biomedical abstracts, using deep learning–based natural language processing techniques. Our model for illuminating the dark phosphoproteome through PubMed mining (IDPpub) was generated by fine-tuning BioBERT, a deep learning tool for biomedical text mining. Trained using sentences containing protein substrates and phosphorylation site positions from 3000 abstracts, the IDPpub model was then used to extract phosphorylation sites from all MEDLINE abstracts. The extracted proteins were normalized to gene symbols using the National Center for Biotechnology Information gene query, and sites were mapped to human UniProt sequences using ProtMapper and mouse UniProt sequences by direct match. Precision and recall were calculated using 150 curated abstracts, and utility was assessed by analyzing the CPTAC (Clinical Proteomics Tumor Analysis Consortium) pan-cancer phosphoproteomics datasets and the PhosphoSitePlus database. Using 10-fold cross validation, pairs of correct substrates and phosphosite positions were extracted with an average precision of 0.93 and recall of 0.94. After entity normalization and site mapping to human reference sequences, an independent validation achieved a precision of 0.91 and recall of 0.77. The IDPpub repository contains 18,458 unique human phosphorylation sites with evidence sentences from 58,227 abstracts and 5918 mouse sites in 14,610 abstracts. This included evidence sentences for 1803 sites identified in CPTAC studies that are not covered by manually curated functional information in PhosphoSitePlus. Evaluation results demonstrate the potential of IDPpub as an effective biomedical text mining tool for collecting phosphosites. Moreover, the repository (http://idppub.ptmax.org), which can be automatically updated, can serve as a powerful complement to existing resources.",
                "authors": [
                    {
                        "name": "Jaehnig E.J."
                    },
                    {
                        "name": "Liao Y."
                    },
                    {
                        "name": "Pham H.A."
                    },
                    {
                        "name": "Savage S.R."
                    },
                    {
                        "name": "Shi Z."
                    },
                    {
                        "name": "Xu H."
                    },
                    {
                        "name": "Zhang B."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "date": "2024-01-01T00:00:00Z",
                "journal": "Molecular and Cellular Proteomics",
                "title": "IDPpub: Illuminating the Dark Phosphoproteome Through PubMed Mining"
            },
            "pmcid": "PMC10716774",
            "pmid": "37993103"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        }
    ]
}
