{
    "additionDate": "2021-01-18T11:52:46Z",
    "biotoolsCURIE": "biotools:ngs-integrator",
    "biotoolsID": "ngs-integrator",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "knepperm@nhlbi.nih.gov",
            "name": "Mark A. Knepper",
            "orcidid": "https://orcid.org/0000-0002-2276-8091",
            "typeEntity": "Person"
        }
    ],
    "description": "An efficient tool for combining multiple NGS data tracks using minimum Bayes' factors.\n\nNGS Integrator Tool (NGS-Integrator) is a Java-based tool that integrates multiple genome-wide NGS data via the minimum Bayes' Factor from density of sequence reads mapped on the genome. To integrate multiple NGS data, homogeneous replicates or heterogeneous NGS data can be integrated into the single data track based on the complements of the minimum Bayes factor (cMBF) (range: 0-1) calculated from signal-to-background noise ratios as a function of genomic position.\n\nNGS-Integrator is a Java-based commandline tool that integrates multiple genome-wide NGS data via the minimum Bayes' Factor from density of sequence reads mapped on the genome.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                },
                {
                    "term": "Transcriptional regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0438"
                },
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                }
            ]
        }
    ],
    "homepage": "https://hpcwebapps.cit.nih.gov/ESBL/NGS-Integrator/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2021-03-08T13:59:40Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/ESBL/NGS-Integrator"
        }
    ],
    "name": "NGS-Integrator",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12864-020-07220-7",
            "metadata": {
                "abstract": "© 2020, The Author(s).Background: Next-generation sequencing (NGS) is widely used for genome-wide identification and quantification of DNA elements involved in the regulation of gene transcription. Studies that generate multiple high-throughput NGS datasets require data integration methods for two general tasks: 1) generation of genome-wide data tracks representing an aggregate of multiple replicates of the same experiment; and 2) combination of tracks from different experimental types that provide complementary information regarding the location of genomic features such as enhancers. Results: NGS-Integrator is a Java-based command line application, facilitating efficient integration of multiple genome-wide NGS datasets. NGS-Integrator first transforms all input data tracks using the complement of the minimum Bayes’ factor so that all values are expressed in the range [0,1] representing the probability of a true signal given the background noise. Then, NGS-Integrator calculates the joint probability for every genomic position to create an integrated track. We provide examples using real NGS data generated in our laboratory and from the mouse ENCODE database. Conclusions: Our results show that NGS-Integrator is both time- and memory-efficient. Our examples show that NGS-Integrator can integrate information to facilitate downstream analyses that identify functional regulatory domains along the genome.",
                "authors": [
                    {
                        "name": "Wen B."
                    },
                    {
                        "name": "Jung H.J."
                    },
                    {
                        "name": "Chen L."
                    },
                    {
                        "name": "Saeed F."
                    },
                    {
                        "name": "Knepper M.A."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "NGS-Integrator: An efficient tool for combining multiple NGS data tracks using minimum Bayes’ factors"
            },
            "pmcid": "PMC7678096",
            "pmid": "33213365"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ]
}