{
    "accessibility": [],
    "additionDate": "2017-12-18T00:14:36Z",
    "biotoolsCURIE": "biotools:cbspredict",
    "biotoolsID": "cbspredict",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": null,
            "gridid": null,
            "name": null,
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://doxey.uwaterloo.ca/"
        }
    ],
    "description": "Given a protein structure (PDB file), cbsPredict will identify potential carbohydrate-binding sites based on detection of coplanar, aromatic residues located on the protein surface.",
    "documentation": [],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ],
            "output": []
        },
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Detection",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://doxey.uwaterloo.ca/cgi-bin/cbsPredict.cgi",
    "homepage_status": 0,
    "language": [],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "license": null,
    "link": [
        {
            "note": null,
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/cbspredict-detect-potential-carbohydrate-binding-sites-in-protein-3d-structures.html"
        }
    ],
    "maturity": null,
    "name": "cbsPredict",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1472-6807-10-23",
            "metadata": {
                "abstract": "Background. Aromatic amino acids play a critical role in protein-glycan interactions. Clusters of surface aromatic residues and their features may therefore be useful in distinguishing glycan-binding sites as well as predicting novel glycan-binding proteins. In this work, a structural bioinformatics approach was used to screen the Protein Data Bank (PDB) for coplanar aromatic motifs similar to those found in known glycan-binding proteins. Results. The proteins identified in the screen were significantly associated with carbohydrate-related functions according to gene ontology (GO) enrichment analysis, and predicted motifs were found frequently within novel folds and glycan-binding sites not included in the training set. In addition to numerous binding sites predicted in structural genomics proteins of unknown function, one novel prediction was a surface motif (W34/W36/W192) in the tobacco pathogenesis-related protein, PR-5d. Phylogenetic analysis revealed that the surface motif is exclusive to a subfamily of PR-5 proteins from the Solanaceae family of plants, and is absent completely in more distant homologs. To confirm PR-5d's insoluble-polysaccharide binding activity, a cellulose-pulldown assay of tobacco proteins was performed and PR-5d was identified in the cellulose-binding fraction by mass spectrometry. Conclusions. Based on the combined results, we propose that the putative binding site in PR-5d may be an evolutionary adaptation of Solanaceae plants including potato, tomato, and tobacco, towards defense against cellulose-containing pathogens such as species of the deadly oomycete genus, Phytophthora. More generally, the results demonstrate that coplanar aromatic clusters on protein surfaces are a structural signature of glycan-binding proteins, and can be used to computationally predict novel glycan-binding proteins from 3 D structure. © 2010 Doxey et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Doxey A.C."
                    },
                    {
                        "name": "Cheng Z."
                    },
                    {
                        "name": "Moffatt B.A."
                    },
                    {
                        "name": "McConkey B.J."
                    }
                ],
                "citationCount": 12,
                "date": "2010-08-06T00:00:00Z",
                "journal": "BMC Structural Biology",
                "title": "Structural motif screening reveals a novel, conserved carbohydrate-binding surface in the pathogenesis-related protein PR-5d"
            },
            "note": null,
            "pmcid": null,
            "pmid": null,
            "type": "Primary",
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Protein structure",
            "uri": "http://edamontology.org/topic_2814"
        }
    ],
    "validated": 1,
    "version": []
}