{
    "accessibility": "Open access",
    "additionDate": "2023-03-23T00:02:08.049281Z",
    "biotoolsCURIE": "biotools:psuc-edbam",
    "biotoolsID": "psuc-edbam",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Genqiang Wu"
        },
        {
            "name": "Jianhua Jia"
        },
        {
            "name": "Meifang Li"
        },
        {
            "name": "Wangren Qiu"
        }
    ],
    "description": "Predicting lysine succinylation sites in proteins based on ensemble dense blocks and an attention module.",
    "editPermission": {
        "authors": [
            "guoqq"
        ],
        "type": "group"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence",
                        "uri": "http://edamontology.org/data_2044"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.wugenqiang.top/pSuc-EDBAM/",
    "lastUpdate": "2023-09-14T13:05:24.561974Z",
    "name": "pSuc-EDBAM",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/s12859-022-05001-5",
            "metadata": {
                "abstract": "Background: Lysine succinylation is a newly discovered protein post-translational modifications. Predicting succinylation sites helps investigate the metabolic disease treatments. However, the biological experimental approaches are costly and inefficient, it is necessary to develop efficient computational approaches. Results: In this paper, we proposed a novel predictor based on ensemble dense blocks and an attention module, called as pSuc-EDBAM, which adopted one hot encoding to derive the feature maps of protein sequences, and generated the low-level feature maps through 1-D CNN. Afterward, the ensemble dense blocks were used to capture feature information at different levels in the process of feature learning. We also introduced an attention module to evaluate the importance degrees of different features. The experimental results show that Acc reaches 74.25%, and MCC reaches 0.2927 on the testing dataset, which suggest that the pSuc-EDBAM outperforms the existing predictors. Conclusions: The experimental results of ten-fold cross-validation on the training dataset and independent test on the testing dataset showed that pSuc-EDBAM outperforms the existing succinylation site predictors and can predict potential succinylation sites effectively. The pSuc-EDBAM is feasible and obtains the credible predictive results, which may also provide valuable references for other related research. To make the convenience of the experimental scientists, a user-friendly web server has been established (http://bioinfo.wugenqiang.top/pSuc-EDBAM/), by which the desired results can be easily obtained.",
                "authors": [
                    {
                        "name": "Jia J."
                    },
                    {
                        "name": "Li M."
                    },
                    {
                        "name": "Qiu W."
                    },
                    {
                        "name": "Wu G."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "pSuc-EDBAM: Predicting lysine succinylation sites in proteins based on ensemble dense blocks and an attention module"
            },
            "pmcid": "PMC9620660",
            "pmid": "36316638"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        }
    ]
}
