{
    "additionDate": "2020-01-14T19:33:31Z",
    "biotoolsCURIE": "biotools:DeepEP",
    "biotoolsID": "DeepEP",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "limin@mail.csu.edu.cn",
            "name": "Min Li",
            "typeEntity": "Person"
        }
    ],
    "description": "a deep learning framework for identifying essential proteins.\n\nDeepEP is a deep learning framework to automatically predict essential proteins using PPI network and gene expression data",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://github.com/CSUBioGroup/DeepEP",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-01-14T19:33:31Z",
    "license": "MIT",
    "name": "DeepEP",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3076-Y",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Essential proteins are crucial for cellular life and thus, identification of essential proteins is an important topic and a challenging problem for researchers. Recently lots of computational approaches have been proposed to handle this problem. However, traditional centrality methods cannot fully represent the topological features of biological networks. In addition, identifying essential proteins is an imbalanced learning problem; but few current shallow machine learning-based methods are designed to handle the imbalanced characteristics. Results: We develop DeepEP based on a deep learning framework that uses the node2vec technique, multi-scale convolutional neural networks and a sampling technique to identify essential proteins. In DeepEP, the node2vec technique is applied to automatically learn topological and semantic features for each protein in protein-protein interaction (PPI) network. Gene expression profiles are treated as images and multi-scale convolutional neural networks are applied to extract their patterns. In addition, DeepEP uses a sampling method to alleviate the imbalanced characteristics. The sampling method samples the same number of the majority and minority samples in a training epoch, which is not biased to any class in training process. The experimental results show that DeepEP outperforms traditional centrality methods. Moreover, DeepEP is better than shallow machine learning-based methods. Detailed analyses show that the dense vectors which are generated by node2vec technique contribute a lot to the improved performance. It is clear that the node2vec technique effectively captures the topological and semantic properties of PPI network. The sampling method also improves the performance of identifying essential proteins. Conclusion: We demonstrate that DeepEP improves the prediction performance by integrating multiple deep learning techniques and a sampling method. DeepEP is more effective than existing methods.",
                "authors": [
                    {
                        "name": "Zeng M."
                    },
                    {
                        "name": "Li M."
                    },
                    {
                        "name": "Wu F.-X."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Pan Y."
                    }
                ],
                "citationCount": 2,
                "date": "2019-12-02T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "DeepEP: A deep learning framework for identifying essential proteins"
            },
            "pmcid": "PMC6886168",
            "pmid": "31787076"
        }
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}