{
    "additionDate": "2019-11-14T20:03:46Z",
    "biotoolsCURIE": "biotools:TMB",
    "biotoolsID": "TMB",
    "confidence_flag": "low",
    "description": "> LOW CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'iBIOMES', 'Lite', 'iBIOMES Lite', 'nucleosome' | TMB Library of Nucleosome Simulations | Nucleosomes are the fundamental building blocks of chromatin, the biomaterial that houses the genome in all higher organisms. A nucleosome consists of 145-147 base pairs of DNA wrapped 1.7 times around eight histones. Given a four-letter code (A, C, G, T), there are approximately 4147 or 1088 oligonucleotides that can form a nucleosome. Comparative, rather than comprehensive, studies are required. Here we introduce the TMB Library of nucleosome simulations and present a meta-analysis of over 20 μs of all atom molecular dynamics simulations representing 518 different realizations of the nucleosome. The TMB Library serves as a reference for future comparative, on-demand simulations of nucleosomes and a demonstration of iBIOMES Lite as a tool for managing a laboratory's simulation library",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Simulation analysis",
                    "uri": "http://edamontology.org/operation_0244"
                },
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                }
            ]
        }
    ],
    "homepage": "http://dna.engr.latech.edu/~tmbshare/",
    "language": [
        "C"
    ],
    "lastUpdate": "2019-11-14T20:03:46Z",
    "name": "TMB",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.9B00252",
            "metadata": {
                "abstract": "© 2019 American Chemical Society.Nucleosomes are the fundamental building blocks of chromatin, the biomaterial that houses the genome in all higher organisms. A nucleosome consists of 145-147 base pairs of DNA wrapped 1.7 times around eight histones. Given a four-letter code (A, C, G, T), there are approximately 4147 or 1088 oligonucleotides that can form a nucleosome. Comparative, rather than comprehensive, studies are required. Here we introduce the TMB Library of nucleosome simulations and present a meta-analysis of over 20 μs of all atom molecular dynamics simulations representing 518 different realizations of the nucleosome. The TMB Library serves as a reference for future comparative, on-demand simulations of nucleosomes and a demonstration of iBIOMES Lite as a tool for managing a laboratory's simulation library. For every simulation, dewatered trajectories, RMSD, and DNA helical parameter data are provided through iBIOMES Lite in a Web browser and a file browser format. A novel view of nucleosomal DNA emerges from our meta-analysis of the TMB Library. DNA conformation is restricted to a specific left-handed superhelix, but the range of conformations observed for individual bases and base pairs is not more restricted nor more highly deformed than DNA free in solution. With the exception of Roll, mean DNA helical parameter values obtained from simulations of nucleosomes are largely within the range of thermal motion of DNA free in solution. The library provides evidence of DNA kinking in the nucleosome and clearly demonstrates the effects of DNA sequence on the gross structure and dynamics of nucleosomes. These effects and mispositioning of the 601 super strong nucleosome positioning sequence can be detected in short simulations (10 ns). Collectively, the results provide a basis for comparative simulation studies of nucleosomes and extend our understanding of the binding of proteins and drugs to nucleosomal DNA. The TMB Library can be found at http://dna.engr.latech.edu/~tmbshare/.",
                "authors": [
                    {
                        "name": "Sun R."
                    },
                    {
                        "name": "Li Z."
                    },
                    {
                        "name": "Bishop T.C."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "TMB Library of Nucleosome Simulations"
            },
            "pmid": "31490686"
        }
    ],
    "topic": [
        {
            "term": "DNA packaging",
            "uri": "http://edamontology.org/topic_3176"
        },
        {
            "term": "Biomaterials",
            "uri": "http://edamontology.org/topic_3368"
        },
        {
            "term": "DNA binding sites",
            "uri": "http://edamontology.org/topic_3125"
        }
    ]
}