{
    "additionDate": "2017-08-03T18:38:09Z",
    "biotoolsCURIE": "biotools:caviar",
    "biotoolsID": "caviar",
    "credit": [
        {
            "email": "fhormoz@cs.ucla.edu",
            "name": "Farhad Hormozdiari",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Statistical framework that quantifies the probability of each variant to be causal while allowing with arbitrary number of causal variants.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://genetics.cs.ucla.edu/caviar/manual.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "homepage": "http://genetics.cs.ucla.edu/caviar/",
    "lastUpdate": "2018-12-10T12:58:43Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/caviar-causal-variants-identication-in-associated-regions.html"
        }
    ],
    "name": "CAVIAR",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2014 by the Genetics Society of America All rights reserved.Although genome-wide association studies have successfully identified thousands of risk loci for complex traits, only a handful of the biologically causal variants, responsible for association at these loci, have been successfully identified. Current statistical methods for identifying causal variants at risk loci either use the strength of the association signal in an iterative conditioning framework or estimate probabilities for variants to be causal. A main drawback of existing methods is that they rely on the simplifying assumption of a single causal variant at each risk locus, which is typically invalid at many risk loci. In this work, we propose a new statistical framework that allows for the possibility of an arbitrary number of causal variants when estimating the posterior probability of a variant being causal. A direct benefit of our approach is that we predict a set of variants for each locus that under reasonable assumptions will contain all of the true causal variants with a high confidence level (e.g., 95%) even when the locus contains multiple causal variants. We use simulations to show that our approach provides 20–50% improvement in our ability to identify the causal variants compared to the existing methods at loci harboring multiple causal variants. We validate our approach using empirical data from an expression QTL study of CHI3L2 to identify new causal variants that affect gene expression at this locus.",
                "authors": [
                    {
                        "name": "Hormozdiari F."
                    },
                    {
                        "name": "Kostem E."
                    },
                    {
                        "name": "Kang E.Y."
                    },
                    {
                        "name": "Pasaniuc B."
                    },
                    {
                        "name": "Eskin E."
                    }
                ],
                "citationCount": 162,
                "date": "2014-10-01T00:00:00Z",
                "journal": "Genetics",
                "title": "Identifying causal variants at loci with multiple signals of association"
            },
            "pmid": "25104515"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ],
    "validated": 1
}