{
    "additionDate": "2020-01-14T20:09:14Z",
    "biotoolsCURIE": "biotools:LOTS-IM",
    "biotoolsID": "LOTS-IM",
    "confidence_flag": "medium",
    "description": "Limited One-time Sampling Irregularity Map (LOTS-IM) for Automatic Unsupervised Assessment of White Matter Hyperintensities and Multiple Sclerosis Lesions in Structural Brain Magnetic Resonance Images.\n\nWe present the application of limited one-time sampling irregularity map (LOTS-IM): a fully automatic unsupervised approach to extract brain tissue irregularities in magnetic resonance images (MRI), for quantitatively assessing white matter hyperintensities (WMH) of presumed vascular origin, and multiple sclerosis (MS) lesions and their progression. LOTS-IM generates an irregularity map (IM) that represents all voxels as irregularity values with respect to the ones considered \"normal\". Unlike probability values, IM represents both regular and irregular regions in the brain based on the original MRI's texture information.\n\n||| HOMEPAGE MISSING!",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31846826",
    "lastUpdate": "2020-01-14T20:09:14Z",
    "name": "LOTS-IM",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.COMPMEDIMAG.2019.101685",
            "metadata": {
                "abstract": "© 2019 Elsevier LtdWe present the application of limited one-time sampling irregularity map (LOTS-IM): a fully automatic unsupervised approach to extract brain tissue irregularities in magnetic resonance images (MRI), for quantitatively assessing white matter hyperintensities (WMH) of presumed vascular origin, and multiple sclerosis (MS) lesions and their progression. LOTS-IM generates an irregularity map (IM) that represents all voxels as irregularity values with respect to the ones considered ”normal”. Unlike probability values, IM represents both regular and irregular regions in the brain based on the original MRI's texture information. We evaluated and compared the use of IM for WMH and MS lesions segmentation on T2-FLAIR MRI with the state-of-the-art unsupervised lesions’ segmentation method, Lesion Growth Algorithm from the public toolbox Lesion Segmentation Toolbox (LST-LGA), with several well established conventional supervised machine learning schemes and with state-of-the-art supervised deep learning methods for WMH segmentation. In our experiments, LOTS-IM outperformed unsupervised method LST-LGA on WMH segmentation, both in performance and processing speed, thanks to the limited one-time sampling scheme and its implementation on GPU. Our method also outperformed supervised conventional machine learning algorithms (i.e., support vector machine (SVM) and random forest (RF)) and deep learning algorithms (i.e., deep Boltzmann machine (DBM) and convolutional encoder network (CEN)), while yielding comparable results to the convolutional neural network schemes that rank top of the algorithms developed up to date for this purpose (i.e., UResNet and UNet). LOTS-IM also performed well on MS lesions segmentation, performing similar to LST-LGA. On the other hand, the high sensitivity of IM on depicting signal change deems suitable for assessing MS progression, although care must be taken with signal changes not reflective of a true pathology.",
                "authors": [
                    {
                        "name": "Rachmadi M.F."
                    },
                    {
                        "name": "Valdes-Hernandez M.D.C."
                    },
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "Guerrero R."
                    },
                    {
                        "name": "Meijboom R."
                    },
                    {
                        "name": "Wiseman S."
                    },
                    {
                        "name": "Waldman A."
                    },
                    {
                        "name": "Zhang J."
                    },
                    {
                        "name": "Rueckert D."
                    },
                    {
                        "name": "Wardlaw J."
                    },
                    {
                        "name": "Komura T."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Computerized Medical Imaging and Graphics",
                "title": "Limited One-time Sampling Irregularity Map (LOTS-IM) for Automatic Unsupervised Assessment of White Matter Hyperintensities and Multiple Sclerosis Lesions in Structural Brain Magnetic Resonance Images"
            },
            "pmid": "31846826"
        }
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}