{
    "additionDate": "2021-10-04T05:55:14.585255Z",
    "biotoolsCURIE": "biotools:irg",
    "biotoolsID": "irg",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "amymc@illinois.edu",
            "name": "Amy Marshall-Colon",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "irg is an R Package for Granger-Causal Analysis of irregularly sampled signals.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://smac-group.github.io/irg/articles/vignette.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Nucleic acids-binding site prediction",
                    "uri": "http://edamontology.org/operation_0420"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/SMAC-Group/irg",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T20:18:36.062299Z",
    "license": "AGPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/SMAC-Group/irg/issues"
        }
    ],
    "name": "irg",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btab126",
            "metadata": {
                "abstract": "Motivation: Identification of system-wide causal relationships can contribute to our understanding of long-distance, intercellular signalling in biological organisms. Dynamic transcriptome analysis holds great potential to uncover coordinated biological processes between organs. However, many existing dynamic transcriptome studies are characterized by sparse and often unevenly spaced time points that make the identification of causal relationships across organs analytically challenging. Application of existing statistical models, designed for regular time series with abundant time points, to sparse data may fail to reveal biologically significant, causal relationships. With increasing research interest in biological time series data, there is a need for new statistical methods that are able to determine causality within and between time series data sets. Here, a statistical framework was developed to identify (Granger) causal gene-gene relationships of unevenly spaced, multivariate time series data from two different tissues of Arabidopsis thaliana in response to a nitrogen signal. Results: This work delivers a statistical approach for modelling irregularly sampled bivariate signals which embeds functions from the domain of engineering that allow to adapt the model's dependence structure to the specific sampling time. Using maximum-likelihood to estimate the parameters of this model for each bivariate time series, it is then possible to use bootstrap procedures for small samples (or asymptotics for large samples) in order to test for Granger-Causality. When applied to the A.thaliana data, the proposed approach produced 3078 significant interactions, in which 2012 interactions have root causal genes and 1066 interactions have shoot causal genes. Many of the predicted causal and target genes are known players in local and long-distance nitrogen signalling, including genes encoding transcription factors, hormones and signalling peptides. Of the 1007 total causal genes (either organ), 384 are either known or predicted mobile transcripts, suggesting that the identified causal genes may be directly involved in long-distance nitrogen signalling through intercellular interactions. The model predictions and subsequent network analysis identified nitrogen-responsive genes that can be further tested for their specific roles in long-distance nitrogen signalling.",
                "authors": [
                    {
                        "name": "Guerrier S."
                    },
                    {
                        "name": "Heerah S."
                    },
                    {
                        "name": "Marshall-Colon A."
                    },
                    {
                        "name": "Molinari R."
                    }
                ],
                "citationCount": 8,
                "date": "2021-08-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Granger-causal testing for irregularly sampled time series with application to nitrogen signalling in Arabidopsis"
            },
            "pmcid": "PMC8388030",
            "pmid": "33693548",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
