{
    "additionDate": "2021-01-18T09:51:01Z",
    "biotoolsCURIE": "biotools:autocloner",
    "biotoolsID": "autocloner",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "acoulton.re@gmail.com",
            "name": "Alexander Coulton",
            "orcidid": "https://orcid.org/0000-0002-0826-5009",
            "typeEntity": "Person"
        }
    ],
    "description": "AutoCloner is a custom pipeline that designs homeologue-specific primers for polyploids. It achieves this by extracting SNP locations unique to your gene of interest, and placing the 3` ends of primers at these SNPs.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                },
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                },
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                },
                {
                    "term": "Sequence similarity search",
                    "uri": "http://edamontology.org/operation_0346"
                },
                {
                    "term": "Primer removal",
                    "uri": "http://edamontology.org/operation_3237"
                }
            ]
        }
    ],
    "homepage": "http://www.autocloner.com",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-29T18:31:59Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/alexcoulton/autocloner"
        }
    ],
    "name": "AutoCloner",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03601-7",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Polyploid organisms such as wheat complicate even the simplest of procedures in molecular biology. Whilst knowledge of genomic sequences in crops is increasing rapidly, the scientific community is still a long way from producing a full pan-genome for every species. Polymerase chain reaction and Sanger sequencing therefore remain widely used as methods for characterizing gene sequences in many varieties of crops. High sequence similarity between genomes in polyploids means that if primers are not homeologue-specific via the incorporation of a SNP at the 3' tail, sequences other than the target sequence will also be amplified. Current consensus for gene cloning in wheat is to manually perform many steps in a long bioinformatics pipeline. Results: Here we present AutoCloner (www.autocloner.com), a fully automated pipeline for crop gene cloning that includes a free-to-use web interface for users. AutoCloner takes a sequence of interest from the user and performs a basic local alignment search tool (BLAST) search against the genome assembly for their particular polyploid crop. Homologous sequences are then compiled with the input sequence into a multiple sequence alignment which is mined for single-nucleotide polymorphisms (SNPs). Various combinations of potential primers that cover the entire gene of interest are then created and evaluated by Primer3; the set of primers with the highest score, as well as all possible primers at every SNP location, are then returned to the user for polymerase chain reaction (PCR). We have successfully used AutoCloner to clone various genes of interest in the Apogee wheat variety, which has no current genome sequence. In addition, we have successfully run the pipeline on ~ 80,000 high-confidence gene models from a wheat genome assembly. Conclusion: AutoCloner is the first tool to fully-automate primer design for gene cloning in polyploids, where previously the consensus within the wheat community was to perform this process manually. The web interface for AutoCloner provides a simple and effective polyploid primer-design method for gene cloning, with no need for researchers to download software or input any other details other than their sequence of interest.",
                "authors": [
                    {
                        "name": "Coulton A."
                    },
                    {
                        "name": "Edwards K.J."
                    }
                ],
                "date": "2020-07-16T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "AutoCloner: automatic homologue-specific primer design for full-gene cloning in polyploids"
            },
            "pmcid": "PMC7364506",
            "pmid": "32677889"
        }
    ],
    "toolType": [
        "Web application",
        "Command-line tool",
        "Workflow"
    ],
    "topic": [
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "PCR experiment",
            "uri": "http://edamontology.org/topic_3519"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ]
}