{"credit":[{"email":"brudno@cs.toronto.edu","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://github.com/compbio-UofT/FSDA/blob/master/README.md"}],"function":[{"operation":[{"term":"Nucleic acid sequence analysis","uri":"http://edamontology.org/operation_2478"}]}],"labels":{"language":["Python"],"operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"Genetics","uri":"http://edamontology.org/topic_3053"},{"term":"DNA","uri":"http://edamontology.org/topic_0654"},{"term":"Nucleic acids","uri":"http://edamontology.org/topic_0077"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/fsda-fragment-size-distribution-analysis-for-non-invasive-prenatal-cnv-prediction.html"}],"publication":[{"abstract":"© 2016 The Author 2016. Published by Oxford University Press. All rights reserved.Background: Non-invasive detection of aneuploidies in a fetal genome through analysis of cell-free DNA circulating in the maternal plasma is becoming a routine clinical test. Such tests, which rely on analyzing the read coverage or the allelic ratios at single-nucleotide polymorphism (SNP) loci, are not sensitive enough for smaller sub-chromosomal abnormalities due to sequencing biases and paucity of SNPs in a genome. Results: We have developed an alternative framework for identifying sub-chromosomal copy number variations in a fetal genome. This framework relies on the size distribution of fragments in a sample, as fetal-origin fragments tend to be smaller than those of maternal origin. By analyzing the local distribution of the cell-free DNA fragment sizes in each region, our method allows for the identification of sub-megabase CNVs, even in the absence of SNP positions. To evaluate the accuracy of our method, we used a plasma sample with the fetal fraction of 13%, down-sampled it to samples with coverage of 10X-40X and simulated samples with CNVs based on it. Our method had a perfect accuracy (both specificity and sensitivity) for detecting 5 Mb CNVs, and after reducing the fetal fraction (to 11%, 9% and 7%), it could correctly identify 98.82-100% of the 5 Mb CNVs and had a true-negative rate of 95.29-99.76%. Availability and implementation: Our source code is available on GitHub at https://github.com/compbio-UofT/FSDA.","authors":["Arbabi A.","Rampasek L.","Brudno M."],"cit_count":4,"journal":"Bioinformatics","pmid":"27153615","title":"Cell-free DNA fragment-size distribution analysis for non-invasive prenatal CNV prediction","year":"2016-06-01"}],"summary":{"biotoolsCURIE":"biotools:fsda","biotoolsID":"fsda","description":"Alternative framework for identifying sub-chromosomal copy number variations in a fetal genome.","homepage":"https://github.com/compbio-UofT/FSDA","name":"FSDA"}}