{
    "additionDate": "2019-11-14T19:32:24Z",
    "biotoolsCURIE": "biotools:Sibe",
    "biotoolsID": "Sibe",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "wkyu@dgist.ac.kr",
            "name": "Wookyung Yu",
            "orcidid": "https://orcid.org/0000-0001-9835-930X",
            "typeEntity": "Person"
        }
    ],
    "description": "a computation tool to apply protein sequence statistics to predict folding and design in silico | We love Sibe and the work Sibe does. We work closely with our | Sibe is an analytical and computational framework, and it aims to provide a powerful tool for biological science, such as sequence data analysis, in silico protein folding and design. Though much of the software suite is oriented toward basic research on protein sequence analysis, folding and design, Sibe is also designed for extracting meaningful information hidden behind `big data' based on machine learning. With the help of statistical analysis methods, Sibe can infer co-evolutionary information encoded in protein amino acids sequences for protein folding and design. Now, Sibe includes seven easy-interfaced modules, several physical- & chemical-principles and statistical analysis methods, as well as different optimization solvers",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein folding analysis",
                    "uri": "http://edamontology.org/operation_2415"
                },
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ]
        }
    ],
    "homepage": "http://wyu.dgist.ac.kr/sibe",
    "language": [
        "C++"
    ],
    "lastUpdate": "2019-11-14T19:32:24Z",
    "name": "Sibe",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-2984-1",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Evolutionary information contained in the amino acid sequences of proteins specifies the biological function and fold, but exactly what information contained in the protein sequence drives both of these processes? Considerable progress has been made to answer this fundamental question, but it remains challenging to explore the potential space of cooperative interactions between amino acids. Statistical analysis plays a significant role in studying such interactions and its use has expanded in recent years to studies ranging from coevolution-guided rational protein design to protein folding in silico. Results: Here we describe a computational tool named Sibe for use in studies of protein sequence, folding, and design using evolutionary coupling between amino acids as a driving factor. In this study, Sibe is used to identify positionally conserved couplings between pairwise amino acids and aid rational protein design. In this process, pairwise couplings are filtered according to the relative entropy computed from the positional conservations and grouped into several '7blocks', which could contribute to driving protein folding and design. A human β 2-adrenergic receptor (β 2AR) was used to demonstrate that those 'blocks' contribute the rational design for specifying functional residues. Sibe also provides folding modules based on both the positionally conserved couplings and well-established statistical potentials for simulating protein folding in silico and predicting tertiary structure. Our results show that statistically inferences of basic evolutionary principles, such as conservations and coupled-mutations, can be used to rapidly design a diverse set of proteins and study protein folding. Conclusions: The developed software Sibe provides a computational tool for systematical analysis from protein primary to its tertiary structure using the evolutionary couplings as a driving factor. Sibe, written in C++, accounts for compatibility with the 'big data' era in biological science, and it primarily focuses on protein sequence analysis, but it is also applicable to extend to other modeling and predictions of experimental measurements.",
                "authors": [
                    {
                        "name": "Cheung N.J."
                    },
                    {
                        "name": "Yu W."
                    }
                ],
                "date": "2019-09-06T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Sibe: A computation tool to apply protein sequence statistics to predict folding and design in silico"
            },
            "pmcid": "PMC6728967",
            "pmid": "31492097"
        }
    ],
    "topic": [
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ]
}