{
    "additionDate": "2017-12-18T00:05:09Z",
    "biotoolsCURIE": "biotools:chemchains",
    "biotoolsID": "chemchains",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://mathbio.unomaha.edu/"
        }
    ],
    "description": "A logical network simulation and analysis suite. The driving force behind the development of this tool was to be able to study and visualize the complex dynamics of biological signal transduction networks. It considers the approach of using Boolean modeling technique. The most prominent feature of that is that it allows users to interact with the model in a continuous manner.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://www.bioinformatics.org/chemchains/wiki/Main/Tutorial"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network simulation",
                    "uri": "http://edamontology.org/operation_3562"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "http://www.bioinformatics.org/chemchains/wiki/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/chemchains-1-22-simulation-analysis-logical-models.html"
        }
    ],
    "name": "ChemChains",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1752-0509-3-58",
            "metadata": {
                "abstract": "Background: New mathematical models of complex biological structures and computer simulation software allow modelers to simulate and analyze biochemical systems in silico and form mathematical predictions. Due to this potential predictive ability, the use of these models and software has the possibility to compliment laboratory investigations and help refine, or even develop, new hypotheses. However, the existing mathematical modeling techniques and simulation tools are often difficult to use by laboratory biologists without training in high-level mathematics, limiting their use to trained modelers. Results: We have developed a Boolean network-based simulation and analysis software tool, ChemChains, which combines the advantages of the parameter-free nature of logical models while providing the ability for users to interact with their models in a continuous manner, similar to the way laboratory biologists interact with laboratory data. ChemChains allows users to simulate models in an automatic fashion under tens of thousands of different external environments, as well as perform various mutational studies. Conclusion: ChemChains combines the advantages of logical and continuous modeling and provides a way for laboratory biologists to perform in silico experiments on mathematical models easily, a necessary component of laboratory research in the systems biology era. © 2009 Helikar and Rogers; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Helikar T."
                    },
                    {
                        "name": "Rogers J.A."
                    }
                ],
                "citationCount": 37,
                "date": "2009-07-20T00:00:00Z",
                "journal": "BMC Systems Biology",
                "title": "ChemChains: A platform for simulation and analysis of biochemical networks aimed to laboratory scientists"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1,
    "version": [
        "1.22"
    ]
}