{
    "additionDate": "2021-01-18T11:57:41Z",
    "biotoolsCURIE": "biotools:mcic",
    "biotoolsID": "mcic",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "kkavousi@ut.ac.ir",
            "name": "Kaveh Kavousi",
            "typeEntity": "Person"
        },
        {
            "email": "h_salekdeh@abrii.ac.ir",
            "name": "Ghasem Hosseini Salekdeh",
            "typeEntity": "Person"
        }
    ],
    "description": "Automated Identification of Cellulases From Metagenomic Data and Characterization Based on Temperature and pH Dependence.\n\nUsing a sequence similarity-based annotation and an ensemble of a support vector classifier and a multi-layer perceptron, MCIC (metagenome cellulase identification and classification) aims to identify and classify cellulolytic enzymes from a given metagenomic data as well as any other amino-acid sequence on the basis of optimum temperature and pH.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                }
            ]
        }
    ],
    "homepage": "https://cbb.ut.ac.ir/MCIC",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-20T17:31:07Z",
    "name": "MCIC",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.3389/FMICB.2020.567863",
            "metadata": {
                "abstract": "© Copyright © 2020 Foroozandeh Shahraki, Ariaeenejad, Fallah Atanaki, Zolfaghari, Koshiba, Kavousi and Salekdeh.As the availability of high-throughput metagenomic data is increasing, agile and accurate tools are required to analyze and exploit this valuable and plentiful resource. Cellulose-degrading enzymes have various applications, and finding appropriate cellulases for different purposes is becoming increasingly challenging. An in silico screening method for high-throughput data can be of great assistance when combined with the characterization of thermal and pH dependence. By this means, various metagenomic sources with high cellulolytic potentials can be explored. Using a sequence similarity-based annotation and an ensemble of supervised learning algorithms, this study aims to identify and characterize cellulolytic enzymes from a given high-throughput metagenomic data based on optimum temperature and pH. The prediction performance of MCIC (metagenome cellulase identification and characterization) was evaluated through multiple iterations of sixfold cross-validation tests. This tool was also implemented for a comparative analysis of four metagenomic sources to estimate their cellulolytic profile and capabilities. For experimental validation of MCIC’s screening and prediction abilities, two identified enzymes from cattle rumen were subjected to cloning, expression, and characterization. To the best of our knowledge, this is the first time that a sequence-similarity based method is used alongside an ensemble machine learning model to identify and characterize cellulase enzymes from extensive metagenomic data. This study highlights the strength of machine learning techniques to predict enzymatic properties solely based on their sequence. MCIC is freely available as a python package and standalone toolkit for Windows and Linux-based operating systems with several functions to facilitate the screening and thermal and pH dependence prediction of cellulases.",
                "authors": [
                    {
                        "name": "Foroozandeh Shahraki M."
                    },
                    {
                        "name": "Ariaeenejad S."
                    },
                    {
                        "name": "Fallah Atanaki F."
                    },
                    {
                        "name": "Zolfaghari B."
                    },
                    {
                        "name": "Koshiba T."
                    },
                    {
                        "name": "Kavousi K."
                    },
                    {
                        "name": "Salekdeh G.H."
                    }
                ],
                "citationCount": 2,
                "date": "2020-10-23T00:00:00Z",
                "journal": "Frontiers in Microbiology",
                "title": "MCIC: Automated Identification of Cellulases From Metagenomic Data and Characterization Based on Temperature and pH Dependence"
            },
            "pmcid": "PMC7645119",
            "pmid": "33193158"
        }
    ],
    "toolType": [
        "Desktop application",
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Biophysics",
            "uri": "http://edamontology.org/topic_3306"
        }
    ]
}