{
    "additionDate": "2021-01-18T09:15:52Z",
    "biotoolsCURIE": "biotools:deep4mcpred",
    "biotoolsID": "deep4mcpred",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "liao@xmu.edu.cn",
            "name": "Minghong Liao",
            "typeEntity": "Person"
        }
    ],
    "description": "Deep4mcPred is a webserver for predicting 4mC sites.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                }
            ]
        }
    ],
    "homepage": "http://server.malab.cn/Deep4mcPred",
    "lastUpdate": "2021-02-24T15:03:02Z",
    "name": "Deep4mcPred",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3389/FBIOE.2020.00274",
            "metadata": {
                "abstract": "© Copyright © 2020 Zeng and Liao.DNA N4-methylcytosine modification (4mC) plays an essential role in a variety of biological processes. Therefore, accurate identification the 4mC distribution in genome-scale is important for systematically understanding its biological functions. In this study, we present Deep4mcPred, a multi-layer deep learning based predictive model to identify DNA N4-methylcytosine modifications. In this predictor, we for the first time integrate residual network and recurrent neural network to build a multi-layer deep learning predictive system. As compared to existing predictors using traditional machine learning, our proposed method has two advantages. First, our deep learning framework does not need to specify the features when training the predictive model. It can automatically learn the high-level features and capture the characteristic specificity of 4mC sites, benefiting to distinguish true 4mC sites from non-4mC sites. On the other hand, our deep learning method outperforms the traditional machine learning predictors in performance by benchmarking comparison, demonstrating that the proposed Deep4mcPred is more effective in the DNA 4mC site prediction. Moreover, via experimental comparison, we found that attention mechanism introduced into the deep learning framework is useful to capture the critical features. Additionally, we develop a webserver implementing the proposed method for the academic use of research community, which is now available at http://server.malab.cn/Deep4mcPred.",
                "authors": [
                    {
                        "name": "Zeng R."
                    },
                    {
                        "name": "Liao M."
                    }
                ],
                "citationCount": 2,
                "date": "2020-04-21T00:00:00Z",
                "journal": "Frontiers in Bioengineering and Biotechnology",
                "title": "Developing a Multi-Layer Deep Learning Based Predictive Model to Identify DNA N4-Methylcytosine Modifications"
            },
            "pmcid": "PMC7186498",
            "pmid": "32373597"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        }
    ]
}