{
    "additionDate": "2021-01-18T08:40:47Z",
    "biotoolsCURIE": "biotools:hydra_bnpy",
    "biotoolsID": "hydra_bnpy",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jpfeil@ucsc.edu",
            "name": "Jacob Pfeil",
            "orcidid": "https://orcid.org/0000-0002-8773-8520",
            "typeEntity": "Person"
        }
    ],
    "description": "A mixture modeling framework for subtyping pediatric cancer cohorts using multimodal gene expression signatures.\n\nThere is a need for more flexible gene expression analyses for precision oncology applications. We developed an unsupervised clustering approach for identifying clinically relevant expression patterns. The hydra analysis framework uses state-of-the-art Bayesian non-parametric statistics to learn which genes are differentially expressed without the need for matched normal expression data. This is very useful in the pediatric oncology setting where matched normal tissue is usually not available.\n\n||| NAME (hydra) SIMILAR TO (PUB. DIFFERENT) bio.tools/hydra (HyDRA), bio.tools/hydra_sv (Hydra)",
    "download": [
        {
            "type": "Container file",
            "url": "https://hub.docker.com/r/jpfeil/hydra"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Expression profile clustering",
                    "uri": "http://edamontology.org/operation_0313"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                }
            ]
        }
    ],
    "homepage": "http://www.github.com/jpfeil/hydra",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-01T09:06:22Z",
    "name": "hydra_bnpy",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1007753",
            "metadata": {
                "abstract": "© 2020 Pfeil et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Precision oncology has primarily relied on coding mutations as biomarkers of response to therapies. While transcriptome analysis can provide valuable information, incorporation into workflows has been difficult. For example, the relative rather than absolute gene expression level needs to be considered, requiring differential expression analysis across samples. However, expression programs related to the cell-of-origin and tumor microenvironment effects confound the search for cancer-specific expression changes. To address these challenges, we developed an unsupervised clustering approach for discovering differential pathway expression within cancer cohorts using gene expression measurements. The hydra approach uses a Dirichlet process mixture model to automatically detect multimodally distributed genes and expression signatures without the need for matched normal tissue. We demonstrate that the hydra approach is more sensitive than widely-used gene set enrichment approaches for detecting multimodal expression signatures. Application of the hydra analysis framework to small blue round cell tumors (including rhabdomyosarcoma, synovial sarcoma, neuroblastoma, Ewing sarcoma, and osteosarcoma) identified expression signatures associated with changes in the tumor microenvironment. The hydra approach also identified an association between ATRX deletions and elevated immune marker expression in high-risk neuroblastoma. Notably, hydra analysis of all small blue round cell tumors revealed similar subtypes, characterized by changes to infiltrating immune and stromal expression signatures.",
                "authors": [
                    {
                        "name": "Alejandro Sweet-Cordero E."
                    },
                    {
                        "name": "Anastopoulos I."
                    },
                    {
                        "name": "Beale H.C."
                    },
                    {
                        "name": "Bjork I."
                    },
                    {
                        "name": "Blair A."
                    },
                    {
                        "name": "Breese M.R."
                    },
                    {
                        "name": "Dinh P.T."
                    },
                    {
                        "name": "Geoffrey Lyle A."
                    },
                    {
                        "name": "Haussler D."
                    },
                    {
                        "name": "Lee A."
                    },
                    {
                        "name": "Leung S.G."
                    },
                    {
                        "name": "Patrick Devine W."
                    },
                    {
                        "name": "Pfeil J."
                    },
                    {
                        "name": "Salama S.R."
                    },
                    {
                        "name": "Sanders L.M."
                    },
                    {
                        "name": "Shah A.T."
                    },
                    {
                        "name": "Vaske O.M."
                    },
                    {
                        "name": "Weinstein A.S."
                    },
                    {
                        "name": "Xue Y."
                    }
                ],
                "date": "2020-04-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Hydra: A mixture modeling framework for subtyping pediatric cancer cohorts using multimodal gene expression signatures"
            },
            "pmcid": "PMC7176284",
            "pmid": "32275708"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Immunogenetics",
            "uri": "http://edamontology.org/topic_3930"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}
