{
    "additionDate": "2020-01-14T09:02:06Z",
    "biotoolsCURIE": "biotools:TS-GOEA",
    "biotoolsID": "TS-GOEA",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "shang@nwpu.edu.cn",
            "name": "Xuequn Shang",
            "typeEntity": "Person"
        }
    ],
    "description": "a web tool for tissue-specific gene set enrichment analysis based on gene ontology.\n\nBACKGROUND:The Gene Ontology (GO) knowledgebase is the world's largest source of information on the functions of genes. Since the beginning of GO project, various tools have been developed to perform GO enrichment analysis experiments. GO enrichment analysis has become a commonly used method of gene function analysis. Existing GO enrichment analysis tools do not consider tissue-specific information, although this information is very important to current research. RESULTS:In this paper, we built an easy-to-use web tool called TS-GOEA that allows users to easily perform experiments based on tissue-specific GO enrichment analysis. TS-GOEA uses strict threshold statistical method for GO enrichment analysis, and provides statistical tests to improve the reliability of the analysis results.\n\n||| HOMEPAGE MISSING!",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Gene functional annotation",
                    "uri": "http://edamontology.org/operation_3672"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31760951",
    "lastUpdate": "2020-01-14T09:02:06Z",
    "name": "TS-GOEA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3125-6",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: The Gene Ontology (GO) knowledgebase is the world's largest source of information on the functions of genes. Since the beginning of GO project, various tools have been developed to perform GO enrichment analysis experiments. GO enrichment analysis has become a commonly used method of gene function analysis. Existing GO enrichment analysis tools do not consider tissue-specific information, although this information is very important to current research. Results: In this paper, we built an easy-to-use web tool called T S-G O E A that allows users to easily perform experiments based on tissue-specific GO enrichment analysis. T S-G O E A uses strict threshold statistical method for GO enrichment analysis, and provides statistical tests to improve the reliability of the analysis results. Meanwhile, T S-G O E A provides tools to compare different experimental results, which is convenient for users to compare the experimental results. To evaluate its performance, we tested the genes associated with platelet disease with T S-G O E A. Conclusions: T S-G O E A is an effective GO analysis tool with unique features. The experimental results show that our method has better performance and provides a useful supplement for the existing GO enrichment analysis tools. T S-G O E A is available at http://120.77.47.2:5678.",
                "authors": [
                    {
                        "name": "Peng J."
                    },
                    {
                        "name": "Lu G."
                    },
                    {
                        "name": "Xue H."
                    },
                    {
                        "name": "Wang T."
                    },
                    {
                        "name": "Shang X."
                    }
                ],
                "date": "2019-11-25T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "TS-GOEA: A web tool for tissue-specific gene set enrichment analysis based on gene ontology"
            },
            "pmcid": "PMC6876092",
            "pmid": "31760951"
        }
    ],
    "topic": [
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ]
}