
{
    "credit": [
        {
            "name": "ELIXIR-ITA-BOLOGNA",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "savojard@biocomp.unibo.it",
            "name": "Castrense Savojardo",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://biocomp.unibo.it/savojard/"
        }
    ],
    "documentation": [
        {
            "type": "Citation instructions",
            "url": "http://bioinformatics.oxfordjournals.org/content/29/4/504.abstract"
        },
        {
            "type": "General",
            "url": "http://betaware.biocomp.unibo.it/BetAware/default/software"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://betaware.biocomp.unibo.it/BetAware/default/software"
        },
        {
            "type": "Binaries",
            "url": "http://betaware.biocomp.unibo.it/BetAware/default/software"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein sequence (raw)",
                        "uri": "http://edamontology.org/data_2974"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Structural profile",
                        "uri": "http://edamontology.org/data_0889"
                    }
                }
            ],
            "note": "Prediction",
            "operation": [
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Transmembrane protein prediction",
                    "uri": "http://edamontology.org/operation_0269"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Report",
                        "uri": "http://edamontology.org/data_2048"
                    },
                    "format": [
                        {
                            "term": "HTML",
                            "uri": "http://edamontology.org/format_2331"
                        },
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        }
                    ]
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Bologna Biocomputing group"
        ],
        "language": [
            "Python"
        ],
        "license": "GPL-3.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Web application"
        ],
        "topic": [
            {
                "term": "Structure prediction",
                "uri": "http://edamontology.org/topic_0082"
            },
            {
                "term": "Protein secondary structure",
                "uri": "http://edamontology.org/topic_3542"
            }
        ]
    },
    "publication": [
        {
            "abstract": "The annotation of membrane proteins in proteomes is an important problem of Computational Biology, especially after the development of high-throughput techniques that allow fast and efficient genome sequencing. Among membrane proteins, transmembrane β-barrels (TMBBs) are poorly represented in the database of protein structures (PDB) and difficult to identify with experimental approaches. They are, however, extremely important, playing key roles in several cell functions and bacterial pathogenicity. TMBBs are included in the lipid bilayer with a β-barrel structure and are presently found in the outer membranes of Gram-negative bacteria, mitochondria and chloroplasts. Recently, we developed two top-performing methods based on machine-learning approaches to tackle both the detection of TMBBs in sets of proteins and the prediction of their topology. Here, we present our BETAWARE program that includes both approaches and can run as a standalone program on a linux-based computer to easily address in-home massive protein annotation or filtering.Availability and implementation: http://www.biocomp.unibo.it/ ∼savojard/betawarecl. © 2013 The Author.",
            "authors": [
                "Savojardo C.",
                "Fariselli P.",
                "Casadio R."
            ],
            "cit_count": 21,
            "doi": "10.1093/bioinformatics/bts728",
            "journal": "Bioinformatics",
            "title": "BETAWARE: A machine-learning tool to detect and predict transmembrane beta-barrel proteins in prokaryotes",
            "type": "Primary",
            "year": "2013-02-15"
        },
        {
            "abstract": "Motivation: Transmembrane β-barrels (TMBBs) are extremely important proteins that play key roles in several cell functions. They cross the lipid bilayer with β-barrel structures. TMBBs are presently found in the outer membranes of Gram-negative bacteria and of mitochondria and chloroplasts. Loop exposure outside the bacterial cell membranes makes TMBBs important targets for vaccine or drug therapies. In genomes, they are not highly represented and are difficult to identify with experimental approaches. Several computational methods have been developed to discriminate TMBBs from other types of proteins. However, the best performing approaches have a high fraction of false positive predictions.Results: In this article, we introduce a new machine learning approach for TMBB detection based on N-to-1 Extreme Learning Machines that significantly outperforms previous methods achieving a Matthews correlation coefficient of 0.82, a probability of correct prediction of 0.92 and a sensitivity of 0.73. © The Author 2011. Published by Oxford University Press. All rights reserved.",
            "authors": [
                "Savojardo C.",
                "Fariselli P.",
                "Casadio R."
            ],
            "cit_count": 13,
            "doi": "10.1093/bioinformatics/btr549",
            "journal": "Bioinformatics",
            "title": "Improving the detection of transmembrane β-barrel chains with N-to-1 extreme learning machines",
            "type": "Other",
            "year": "2011-11-01"
        },
        {
            "abstract": "Background: Discriminative models are designed to naturally address classification tasks. However, some applications require the inclusion of grammar rules, and in these cases generative models, such as Hidden Markov Models (HMMs) and Stochastic Grammars, are routinely applied. Results: We introduce Grammatical-Restrained Hidden Conditional Random Fields (GRHCRFs) as an extension of Hidden Conditional Random Fields (HCRFs). GRHCRFs while preserving the discriminative character of HCRFs, can assign labels in agreement with the production rules of a defined grammar. The main GRHCRF novelty is the possibility of including in HCRFs prior knowledge of the problem by means of a defined grammar. Our current implementation allows regular grammar rules. We test our GRHCRF on a typical biosequence labeling problem: the prediction of the topology of Prokaryotic outer-membrane proteins. Conclusion: We show that in a typical biosequence labeling problem the GRHCRF performs better than CRF models of the same complexity, indicating that GRHCRFs can be useful tools for biosequence analysis applications. Availability: GRHCRF software is available under GPLv3 licence at the website. http://www.biocomp.unibo.it/~savojard/biocrf-0.9.tar.gz. © 2009 Fariselli et al; licensee BioMed Central Ltd.",
            "authors": [
                "Fariselli P.",
                "Savojardo C.",
                "Martelli P.L.",
                "Casadio R."
            ],
            "cit_count": 12,
            "doi": "10.1186/1748-7188-4-13",
            "journal": "Algorithms for Molecular Biology",
            "title": "Grammatical-restrained hidden conditional random fields for bioinformatics applications",
            "type": "Other",
            "year": "2009-10-22"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:betaware",
        "biotoolsID": "betaware",
        "description": "A software package for the analysis of TransMembrane Î²-barrel proteins.",
        "homepage": "http://betaware.biocomp.unibo.it/BetAware/default/index",
        "name": "BetAware",
        "version": [
            "1.0"
        ]
    }
}