{
    "accessibility": "Open access",
    "additionDate": "2022-11-06T12:57:07.440155Z",
    "biotoolsCURIE": "biotools:permgwas",
    "biotoolsID": "permgwas",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "maura.john@hswt.de",
            "name": "Maura John",
            "typeEntity": "Person"
        },
        {
            "name": "Dominik G Grimm"
        }
    ],
    "description": "permGWAS is an open source software tool written in python to efficiently perform genome-wide association studies (GWAS) with permutation-based thresholds. permGWAS provides support for multiple CPUs as well as for GPUs.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/grimmlab/permGWAS",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:22:32.648493Z",
    "license": "MIT",
    "name": "permGWAS",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btac455",
            "metadata": {
                "abstract": "Motivation: Genome-wide association studies (GWAS) are an integral tool for studying the architecture of complex genotype and phenotype relationships. Linear mixed models (LMMs) are commonly used to detect associations between genetic markers and a trait of interest, while at the same time allowing to account for population structure and cryptic relatedness. Assumptions of LMMs include a normal distribution of the residuals and that the genetic markers are independent and identically distributed - both assumptions are often violated in real data. Permutation-based methods can help to overcome some of these limitations and provide more realistic thresholds for the discovery of true associations. Still, in practice, they are rarely implemented due to the high computational complexity. Results: We propose permGWAS, an efficient LMM reformulation based on 4D tensors that can provide permutation-based significance thresholds. We show that our method outperforms current state-of-the-art LMMs with respect to runtime and that permutation-based thresholds have lower false discovery rates for skewed phenotypes compared to the commonly used Bonferroni threshold. Furthermore, using permGWAS we re-analyzed more than 500 Arabidopsis thaliana phenotypes with 100 permutations each in less than 8 days on a single GPU. Our re-analyses suggest that applying a permutation-based threshold can improve and refine the interpretation of GWAS results.",
                "authors": [
                    {
                        "name": "Ankenbrand M.J."
                    },
                    {
                        "name": "Artmann C."
                    },
                    {
                        "name": "Freudenthal J.A."
                    },
                    {
                        "name": "Grimm D.G."
                    },
                    {
                        "name": "John M."
                    },
                    {
                        "name": "Korte A."
                    }
                ],
                "citationCount": 14,
                "date": "2022-09-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Efficient permutation-based genome-wide association studies for normal and skewed phenotypic distributions"
            },
            "pmcid": "PMC9486594",
            "pmid": "36124808"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ],
    "validated": 1
}
