{
    "additionDate": "2017-08-03T18:56:13Z",
    "biotoolsCURIE": "biotools:predhydroxy",
    "biotoolsID": "predhydroxy",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://bioinfo.ncu.edu.cn/"
        }
    ],
    "description": "Web service which is constructed to predict the proline and lysine hydroxylation sites based on position weight amino acids composition, 8 high-quality amino acid indices and support vector machine.",
    "documentation": [
        {
            "type": "General",
            "url": "http://bioinfo.ncu.edu.cn/PredHydroxy.aspx"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Post-translation modification site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.ncu.edu.cn/PredHydroxy.aspx",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:55Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/predhydroxy-prediction-of-protein-hydroxylation-site.html"
        }
    ],
    "name": "PredHydroxy",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© The Royal Society of Chemistry.Compared to well-known and extensively studied protein phosphorylation, protein hydroxylation attracts much less attention and the molecular mechanism of the hydroxylation is still incompletely understood. And yet annotation of hydroxylation in proteomes is a first-critical step toward decoding protein function and understanding their physiological roles that have been implicated in the pathological processes and providing useful information for the drug designs of various diseases related with hydroxylation. In this work, we present a novel method called PredHydroxy to automate the prediction of the proline and lysine hydroxylation sites based on position weight amino acids composition, 8 high-quality amino acid indices and support vector machines. The PredHydroxy achieved a promising performance with an area under the receiver operating characteristic curve (AUC) of 82.72% and a Matthew's correlation coefficient (MCC) of 69.03% for hydroxyproline as well as an AUC of 87.41% and a MCC of 66.68% for hydroxylysine in jackknife cross-validation. The results obtained from both the cross validation and independent tests suggest that the PredHydroxy might be a powerful and complementary tool for further experimental investigation of protein hydroxylation. Feature analyses demonstrate that hydroxylation and non-hydroxylation have distinct location-specific differences; alpha and turn propensity is of importance for the hydroxylation of proline and lysine residues. A user-friendly server is freely available on the web at: http://bioinfo.ncu.edu.cn/PredHydroxy.aspx.",
                "authors": [
                    {
                        "name": "Shi S.-P."
                    },
                    {
                        "name": "Chen X."
                    },
                    {
                        "name": "Xu H.-D."
                    },
                    {
                        "name": "Qiu J.-D."
                    }
                ],
                "citationCount": 8,
                "date": "2015-03-01T00:00:00Z",
                "journal": "Molecular BioSystems",
                "title": "PredHydroxy: Computational prediction of protein hydroxylation site locations based on the primary structure"
            },
            "pmid": "25534958"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein sites, features and motifs",
            "uri": "http://edamontology.org/topic_3510"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        }
    ],
    "validated": 1
}