{
    "additionDate": "2021-01-18T12:22:05Z",
    "biotoolsCURIE": "biotools:idhs-dasts",
    "biotoolsID": "idhs-dasts",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "shengli0201@163.com",
            "name": "Shengli Zhang",
            "typeEntity": "Person"
        }
    ],
    "description": "identifying DNase I hypersensitive sites based on LASSO and stacking learning.\n\nEnter the query DNA sequences in FASTA format (Example):.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                }
            ]
        }
    ],
    "homepage": "http://www.xdu-duan.cn/",
    "lastUpdate": "2021-02-02T07:51:48Z",
    "name": "iDHS-DASTS",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1039/D0MO00115E",
            "metadata": {
                "abstract": "© The Royal Society of Chemistry 2020.The DNase I hypersensitivity site is an important marker of the DNA regulatory region, and its identification in the DNA sequence is of great significance for biomedical research. However, traditional identification methods are extremely time-consuming and can not obtain an accurate result. In this paper, we proposed a predictor called iDHS-DASTS to identify the DHS based on benchmark datasets. First, we adopt a feature extraction method called PseDNC which can incorporate the original DNA properties and spatial information of the DNA sequence. Then we use a method called LASSO to reduce the dimensions of the original data. Finally, we utilize stacking learning as a classifier, which includes Adaboost, random forest, gradient boosting, extra trees and SVM. Before we train the classifier, we use SMOTE-Tomek to overcome the imbalance of the datasets. In the experiment, our iDHS-DASTS achieves remarkable performance on three benchmark datasets. We achieve state-of-the-art results with over 92.06%, 91.06% and 90.72% accuracy for datasets S1, S2and S3, respectively. To verify the validation and transferability of our model, we establish another independent dataset S4, for which the accuracy can reach 90.31%. Furthermore, we used the proposed model to construct a user friendly web server called iDHS-DASTS, which is available at http://www.xdu-duan.cn/",
                "authors": [
                    {
                        "name": "Zhang S."
                    },
                    {
                        "name": "Duan Z."
                    },
                    {
                        "name": "Yang W."
                    },
                    {
                        "name": "Qian C."
                    },
                    {
                        "name": "You Y."
                    }
                ],
                "citationCount": 1,
                "date": "2021-02-01T00:00:00Z",
                "journal": "Molecular Omics",
                "title": "iDHS-DASTS: identifying DNase I hypersensitive sites based on LASSO and stacking learning"
            },
            "pmid": "33295914"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        }
    ]
}