{
    "additionDate": "2021-01-18T07:09:38Z",
    "biotoolsCURIE": "biotools:circexplorer3",
    "biotoolsID": "circexplorer3",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "liyang@picb.ac.cn",
            "name": "Li Yang",
            "typeEntity": "Person"
        }
    ],
    "description": "CIRCexplorer3 is a CLEAR Pipeline for Direct Comparison of Circular and Linear RNA Expression. It is a computational pipeline for Circular and Linear RNA Expression Analysis from Ribosomal-RNA depleted (Ribo–) RNA-seq.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Exonic splicing enhancer prediction",
                    "uri": "http://edamontology.org/operation_0446"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "RNA-Seq quantification",
                    "uri": "http://edamontology.org/operation_3800"
                }
            ]
        }
    ],
    "homepage": "https://github.com/YangLab/CLEAR",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-11T18:48:48Z",
    "name": "CIRCexplorer3",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.GPB.2019.11.004",
            "metadata": {
                "abstract": "© 2019 The AuthorsSequences of circular RNAs (circRNAs) produced from back-splicing of exon(s) completely overlap with those from cognate linear RNAs transcribed from the same gene loci with the exception of their back-splicing junction (BSJ) sites. Therefore, examination of global circRNA expression from RNA-seq datasets generally relies on the detection of RNA-seq fragments spanning BSJ sites, which is different from the quantification of linear RNA expression by normalized RNA-seq fragments mapped to whole gene bodies. Thus, direct comparison of circular and linear RNA expression from the same gene loci in a genome-wide manner has remained challenging. Here, we update the previously-reported CIRCexplorer pipeline to version 3 for circular and linear RNA expression analysis from ribosomal-RNA depleted RNA-seq (CIRCexplorer3-CLEAR). A new quantitation parameter, fragments per billion mapped bases (FPB), is applied to evaluate circular and linear RNA expression individually by fragments mapped to circRNA-specific BSJ sites or to linear RNA-specific splicing junction (SJ) sites. Comparison of circular and linear RNA expression levels is directly achieved by dividing FPBcirc by FPBlinear to generate a CIRCscore, which indicates the relative circRNA expression level using linear RNA expression level as the background. Highly-expressed circRNAs with low cognate linear RNA expression background can be readily identified by CIRCexplorer3-CLEAR for further investigation. CIRCexplorer3-CLEAR is publically available at https://github.com/YangLab/CLEAR.",
                "authors": [
                    {
                        "name": "Carmichael G.G."
                    },
                    {
                        "name": "Chen L.-L."
                    },
                    {
                        "name": "Dong R."
                    },
                    {
                        "name": "Liu C.-X."
                    },
                    {
                        "name": "Ma X.-K."
                    },
                    {
                        "name": "Wang M.-R."
                    },
                    {
                        "name": "Yang L."
                    }
                ],
                "citationCount": 11,
                "date": "2019-10-01T00:00:00Z",
                "journal": "Genomics, Proteomics and Bioinformatics",
                "title": "CIRCexplorer3: A CLEAR Pipeline for Direct Comparison of Circular and Linear RNA Expression"
            },
            "pmcid": "PMC7056929",
            "pmid": "31904419"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Workflow"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
