{"credit":[],"labels":{"topic":[{"term":"Physics","uri":"http://edamontology.org/topic_3318"},{"term":"Environmental science","uri":"http://edamontology.org/topic_3855"}]},"publication":[{"abstract":"© 2019 IEEE.In the development of a new product, the design team must describe the expected effects of the final products to potential users and stakeholders. However, existing prototyping tools can only present a product imperfectly, due to limitations at different levels. Specifically, the physical product model, which may be the product of 3D printing, could lack a visual interface; the presentation of the product through modeling software such as Rhinoceros 3D does not provide good realistic tactile perception; or the interface platforms, such as Axure RP, used to display the interactive effects differ from those to be used in the actual operation. Thus, we present the VPModel, a high-fidelity prototyping tool, able to integrate multiple prototyping methods simultaneously. It combines a touchable 3D-printed product model (3DPM) and a corresponding visualized virtual model, and the interactive interfaces are rendered synchronously in a mixed-reality device. Through the tangible, visual, and interactive demonstration, designers and normal users can each obtain a similar experience to the experience of the finished product. Furthermore, the VPModel also enhances design practices by enabling comparisons between modular models. However, the implementation of this system is a challenging task, which subsumes several fundamental problems as sub-tasks: object detection, real-time matching, hand-gesture detection and action recognition. To achieve the expected goals of the VPModel, this system uses physical hardware (a Microsoft MR HoloLens headset, a Leap Motion Controller, and a 3D printer) and existing machine learning algorithms. To evaluate our VPModel, we report the user experience of 16 participants, evaluated using a closed-ended questionnaire survey, a quantitative analysis of task performance, and a qualitative analysis of open-ended interviews. The results show a significant improvement in realism and enjoyment using the VPModel over the two traditional camera prototype approaches. In summary, the VPModel can be used to support design strategy and to convey design concepts fully and efficiently, which indicates a potential use for the VPModel in shortening product development cycles and reducing communication costs.","authors":["Min X.","Zhang W.","Sun S.","Zhao N.","Tang S.","Zhuang Y."],"cit_count":0,"doi":"10.1109/TVCG.2019.2932276","journal":"IEEE Transactions on Visualization and Computer Graphics","pmid":"31403424","title":"VPModel: High-Fidelity Product Simulation in a Virtual-Physical Environment","year":"2019-11-01"}],"summary":{"biotoolsCURIE":"biotools:VPModel","biotoolsID":"VPModel","description":"> HOMEPAGE MISSING! | High-Fidelity Product Simulation in a Virtual-Physical Environment | In the development of a new product, the design team must describe the expected effects of the final products to potential users and stakeholders. However, existing prototyping tools can only present a product imperfectly, due to limitations at different levels. Specifically, the physical product model, which may be the product of 3D printing, could lack a visual interface; the presentation of the product through modeling software such as Rhinoceros 3D does not provide good realistic tactile perception; or the interface platforms, such as Axure RP, used to display the interactive effects differ from those to be used in the actual operation. Thus, we present the VPModel, a high-fidelity prototyping tool, able to integrate multiple prototyping methods simultaneously","homepage":"https://www.ncbi.nlm.nih.gov/pubmed/?term=31403424","name":"VPModel"}}