{
    "name": "NRPS-PKS", 
    "description": "NRPS-PKS is an tool comprising four integrated databases for the analysis of large multi-enzymatic multi-domain megasynthases.  The user can submit a query sequence to search for domains or view the properties of the products.", 
    "homepage": "http://nrps.igs.umaryland.edu/", 
    "biotoolsID": "nrps-pks", 
    "biotoolsCURIE": "biotools:nrps-pks", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0349", 
                    "term": "Sequence database search (by property)"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0346", 
                    "term": "Sequence similarity search"
                }, 
                {
                    "uri": "http://edamontology.org/operation_2421", 
                    "term": "Database search"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0224", 
                    "term": "Query and retrieval"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0080", 
            "term": "Sequence analysis"
        }, 
        {
            "uri": "http://edamontology.org/topic_3168", 
            "term": "Sequencing"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "http://nrps.igs.umaryland.edu/tutorial.html", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "15215420", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "NRPS-PKS: A knowledge-based resource for analysis of NRPS-PKS megasynthases", 
                "abstract": "NRPS-PKS is web-based software for analysing large multi-enzymatic, multi-domain megasynthases that are involved in the biosynthesis of pharmaceutically important natural products such as cyclosporin, rifamycin and erythromycin. NRPS-PKS has been developed based on a comprehensive analysis of the sequence and structural features of several experimentally characterized biosynthetic gene clusters. The results of these analyses have been organized as four integrated searchable databases for elucidating domain organization and substrate specificity of nonribosomal peptide synthetases and three types of polyketide synthases. These databases work as the backend of NRPS-PKS and provide the knowledge base for predicting domain organization and substrate specificity of uncharacterized NRPS/PKS clusters. Benchmarking on a large set of biosynthetic gene clusters has demonstrated that, apart from correct identification of NRPS and PKS domains, NRPS-PKS can also predict specificities of adenylation and acyltransferase domains with reasonably high accuracy. These features of NRPS-PKS make it a valuable resource for identification of natural products biosynthesized by NRPS/PKS gene clusters found in newly sequenced genomes. The training and test sets of gene clusters included in NRPS-PKS correlate information on 307 open reading frames, 2223 functional protein domains, 68 starter/extender precursors and their specific recognition motifs, and also the chemical structure of 101 natural products from four different families. NRPS-PKS is a unique resource which provides a user-friendly interface for correlating chemical structures of natural products with the domains and modules in the corresponding nonribosomal peptide synthetases or polyketide synthases. It also provides guidelines for domain/module swapping as well as site-directed mutagenesis experiments to engineer biosynthesis of novel natural products. NRPS-PKS can be accessed at http://www.nii.res.in/nrps-pks.html. © Oxford University Press 2004; all rights reserved.", 
                "date": "2004-07-01T00:00:00Z", 
                "citationCount": 196, 
                "authors": [
                    {
                        "name": "Ansari M.Z."
                    }, 
                    {
                        "name": "Yadav G."
                    }, 
                    {
                        "name": "Gokhale R.S."
                    }, 
                    {
                        "name": "Mohanty D."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }
    ], 
    "credit": [
        {
            "name": "Jacques Ravel", 
            "email": "jravel@som.umaryland.edu", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "ELIXIR-EE", 
    "additionDate": "2017-02-10T11:35:13Z", 
    "lastUpdate": "2018-12-10T12:58:56Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}