{
    "additionDate": "2023-03-09T14:03:38.047223Z",
    "biotoolsCURIE": "biotools:causnet",
    "biotoolsID": "causnet",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "nandsh11@gmail.com",
            "name": "Nand Sharma",
            "typeEntity": "Person"
        }
    ],
    "description": "Tool for generational orderings based search for optimal Bayesian networks via dynamic programming with parent set constraints.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/nand1155/CausNet",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T14:55:38.890665Z",
    "license": "Not licensed",
    "name": "CausNet",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/s12859-023-05159-6",
            "metadata": {
                "abstract": "Background: Finding a globally optimal Bayesian Network using exhaustive search is a problem with super-exponential complexity, which severely restricts the number of variables that can feasibly be included. We implement a dynamic programming based algorithm with built-in dimensionality reduction and parent set identification. This reduces the search space substantially and can be applied to large-dimensional data. We use what we call ‘generational orderings’ based search for optimal networks, which is a novel way to efficiently search the space of possible networks given the possible parent sets. The algorithm supports both continuous and categorical data, as well as continuous, binary and survival outcomes. Results: We demonstrate the efficacy of our algorithm on both synthetic and real data. In simulations, our algorithm performs better than three state-of-art algorithms that are currently used extensively. We then apply it to an Ovarian Cancer gene expression dataset with 513 genes and a survival outcome. Our algorithm is able to find an optimal network describing the disease pathway consisting of 6 genes leading to the outcome node in just 3.4 min on a personal computer with a 2.3 GHz Intel Core i9 processor with 16 GB RAM. Conclusions: Our generational orderings based search for optimal networks is both an efficient and highly scalable approach for finding optimal Bayesian Networks and can be applied to 1000 s of variables. Using specifiable parameters—correlation, FDR cutoffs, and in-degree—one can increase or decrease the number of nodes and density of the networks. Availability of two scoring option—BIC and Bge—and implementation for survival outcomes and mixed data types makes our algorithm very suitable for many types of high dimensional data in a variety of fields.",
                "authors": [
                    {
                        "name": "Millstein J."
                    },
                    {
                        "name": "Sharma N."
                    }
                ],
                "citationCount": 2,
                "date": "2023-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "CausNet: generational orderings based search for optimal Bayesian networks via dynamic programming with parent set constraints"
            },
            "pmcid": "PMC9926787",
            "pmid": "36788490"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}
