{
    "additionDate": "2017-12-18T00:11:13Z",
    "biotoolsCURIE": "biotools:probealign",
    "biotoolsID": "probealign",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://genome.ucf.edu/"
        }
    ],
    "description": "ProbeAlign is a program for annotating ncRNA structures by incorporating high-throughput sequencing based structure probing information.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://genome.ucf.edu/ProbeAlign/",
    "lastUpdate": "2024-11-25T14:48:05.468757Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/probealign-ncrna-homology-search.html"
        }
    ],
    "name": "ProbeAlign",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-15-s9-s15",
            "metadata": {
                "abstract": "Background: Recent advances in RNA structure probing technologies, including the ones based on high-throughput sequencing, have improved the accuracy of thermodynamic folding with quantitative nucleotide-resolution structural information. Results: In this paper, we present a novel approach, ProbeAlign, to incorporate the reactivities from high-throughput RNA structure probing into ncRNA homology search for functional annotation. To reduce the overhead of structure alignment on large-scale data, the specific pairing patterns in the query sequences are ignored. On the other hand, the partial structural information of the target sequences embedded in probing data is retrieved to guide the alignment. Thus the structure alignment problem is transformed into a sequence alignment problem with additional reactivity information. The benchmark results show that the prediction accuracy of ProbeAlign outperforms filter-based CMsearch with high computational efficiency. The application of ProbeAlign to the FragSeq data, which is based on genome-wide structure probing, has demonstrated its capability to search ncRNAs in a large-scale dataset from high-throughput sequencing. Conclusions: By incorporating high-throughput sequencing-based structure probing information, ProbeAlign can improve the accuracy and efficiency of ncRNA homology search. It is a promising tool for ncRNA functional annotation on genome-wide datasets. Availability: The source code of ProbeAlign is available at http://genome.ucf.edu/ProbeAlign.",
                "authors": [
                    {
                        "name": "Ge P."
                    },
                    {
                        "name": "Zhang S."
                    },
                    {
                        "name": "Zhong C."
                    }
                ],
                "citationCount": 3,
                "date": "2014-09-10T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "ProbeAlign: Incorporating high-throughput sequencing-based structure probing information into ncRNA homology search"
            },
            "pmcid": "PMC4168714",
            "pmid": "25253206"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "High-throughput sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "ncRNA",
            "uri": "http://edamontology.org/topic_0659"
        }
    ],
    "validated": 1,
    "version": [
        "0.3"
    ]
}
