{
    "additionDate": "2023-01-27T17:17:43.449911Z",
    "biotoolsCURIE": "biotools:dbcan-seq",
    "biotoolsID": "dbcan-seq",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "yyin@unl.edu",
            "name": "Yanbin Yin",
            "orcidid": "https://orcid.org/0000-0001-7667-881X",
            "typeEntity": "Person"
        }
    ],
    "description": "A online database dbCAN-seq to provide pre-computed carbohydrate-active enzyme (CAZymes) sequence and annotation data for 5,349 bacterial genomes.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "https://bcb.unl.edu/dbCAN_seq",
    "lastUpdate": "2024-11-24T15:07:59.114958Z",
    "license": "Other",
    "name": "dbCAN-seq",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/nar/gkac1068",
            "metadata": {
                "abstract": "Carbohydrate Active EnZymes (CAZymes) are significantly important for microbial communities to thrive in carbohydrate rich environments such as animal guts, agricultural soils, forest floors, and ocean sediments. Since 2017, microbiome sequencing and assembly have produced numerous metagenome assembled genomes (MAGs). We have updated our dbCAN-seq database (https://bcb.unl.edu/dbCAN_seq) to include the following new data and features: (i) ∼498 000 CAZymes and ∼169 000 CAZyme gene clusters (CGCs) from 9421 MAGs of four ecological (human gut, human oral, cow rumen, and marine) environments; (ii) Glycan substrates for 41 447 (24.54%) CGCs inferred by two novel approaches (dbCAN-PUL homology search and eCAMI subfamily majority voting) (the two approaches agreed on 4183 CGCs for substrate assignments); (iii) A redesigned CGC page to include the graphical display of CGC gene compositions, the alignment of query CGC and subject PUL (polysaccharide utilization loci) of dbCAN-PUL, and the eCAMI subfamily table to support the predicted substrates; (iv) A statistics page to organize all the data for easy CGC access according to substrates and taxonomic phyla; and (v) A batch download page. In summary, this updated dbCAN-seq database highlights glycan substrates predicted for CGCs from microbiomes. Future work will implement the substrate prediction function in our dbCAN2 web server.",
                "authors": [
                    {
                        "name": "Akresi J."
                    },
                    {
                        "name": "Ge Q."
                    },
                    {
                        "name": "Hu B."
                    },
                    {
                        "name": "Huang L."
                    },
                    {
                        "name": "Piyush V."
                    },
                    {
                        "name": "Yan Y."
                    },
                    {
                        "name": "Yin Y."
                    },
                    {
                        "name": "Zhang X."
                    },
                    {
                        "name": "Zheng J."
                    }
                ],
                "citationCount": 26,
                "date": "2023-01-06T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "dbCAN-seq update: CAZyme gene clusters and substrates in microbiomes"
            },
            "pmcid": "PMC9825555",
            "pmid": "36399503"
        },
        {
            "doi": "10.1093/nar/gkx894",
            "metadata": {
                "abstract": "Carbohydrate-active enzyme (CAZymes) are not only the most important enzymes for bioenergy and agricultural industries, but also very important for human health, in that human gut microbiota encode hundreds of CAZyme genes in their genomes for degrading various dietary and host carbohydrates. We have built an online database dbCAN-seq (http://cys.bios.niu.edu/dbCAN-seq) to provide pre-computed CAZyme sequence and annotation data for 5,349 bacterial genomes. Compared to the other CAZyme resources, dbCAN-seq has the following new features: (i) a convenient download page to allow batch download of all the sequence and annotation data; (ii) an annotation page for every CAZyme to provide the most comprehensive annotation data; (iii) a metadata page to organize the bacterial genomes according to species metadata such as disease, habitat, oxygen requirement, temperature, metabolism; (iv) a very fast tool to identify physically linked CAZyme gene clusters (CGCs) and (v) a powerful search function to allow fast and efficient data query. With these unique utilities, dbCAN-seq will become a valuable web resource for CAZyme research, with a focus complementary to dbCAN (automated CAZyme annotation server) and CAZy (CAZyme family classification and reference database).",
                "authors": [
                    {
                        "name": "Entwistle S."
                    },
                    {
                        "name": "Huang L."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Wu P."
                    },
                    {
                        "name": "Yang Z."
                    },
                    {
                        "name": "Yi H."
                    },
                    {
                        "name": "Yin Y."
                    },
                    {
                        "name": "Yohe T."
                    },
                    {
                        "name": "Zhang H."
                    }
                ],
                "citationCount": 191,
                "date": "2018-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "DbCAN-seq: A database of carbohydrate-active enzyme (CAZyme) sequence and annotation"
            },
            "pmcid": "PMC5753378",
            "pmid": "30053267"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Carbohydrates",
            "uri": "http://edamontology.org/topic_0152"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ]
}
