{
    "accessibility": "Restricted access",
    "additionDate": "2021-01-18T08:42:25Z",
    "biotoolsCURIE": "biotools:bifap",
    "biotoolsID": "bifap",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mmacia@aemps.es",
            "name": "Miguel‐Angel Maciá‐Martínez",
            "typeEntity": "Person"
        }
    ],
    "description": "Base de Datos para la Investigación Farmacoepidemiológica en Atención Primaria (BIFAP) is a population based database administered by the AEMPS (Spanish Agency for Medicines) of longitudinal electronic medical records (EMR) of patients attended in primary care. Its main purpose is to serve as source of information for independent studies on drug safety and support of medicines regulation activities.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "http://bifap.aemps.es",
    "lastUpdate": "2021-02-03T19:22:59Z",
    "name": "BIFAP",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1002/PDS.5006",
            "metadata": {
                "abstract": "© 2020 John Wiley & Sons LtdPurpose: Base de Datos para la Investigación Farmacoepidemiológica en Atención Primaria (BIFAP) is a population based database administered by the AEMPS (Spanish Agency for Medicines) of longitudinal electronic medical records (EMR) of patients attended in primary care. Its main purpose is to serve as source of information for independent studies on drug safety and support of medicines regulation activities. This article aim is to describe the characteristics of BIFAP, how to access the database and a summary of its potential for research. Methods: Health problems are registered by primary care physicians as episodes of care and include socio-demographic data, results of diagnostic procedures, lifestyle data, general data, and interventions. A proportion of data on hospitalizations and specialist care are currently available through linkage with other data sources. EMRs of the Spanish healthcare system are provided by the regional administrations. Specific data extraction and standardization processes are performed. Results: BIFAP includes data from 12 million patients starting in 2001 and updated annually. Validation of drug and diagnosis definitions has been ascertained. Participation in international collaborative projects and a number of articles in peer reviewed journals reflect its contribution to the knowledge of the risks associated with medicines and drug utilization patterns. Conclusions: BIFAP is a useful tool for generating scientific evidence on medicines related issues, helping regulatory decision making in Europe. The main strengths of BIFAP are related to large sample size, population-based, longitudinal nature and annual update of data. BIFAP shares common challenges with similar data sources including accurate and efficient identification of health outcomes and of treatment exposure.",
                "authors": [
                    {
                        "name": "Alvarez A."
                    },
                    {
                        "name": "Bryant V."
                    },
                    {
                        "name": "Gil M."
                    },
                    {
                        "name": "Huerta C."
                    },
                    {
                        "name": "Macia-Martinez M.-A."
                    },
                    {
                        "name": "Martin-Merino E."
                    },
                    {
                        "name": "Montero D."
                    }
                ],
                "citationCount": 10,
                "date": "2020-10-01T00:00:00Z",
                "journal": "Pharmacoepidemiology and Drug Safety",
                "title": "Base de Datos para la Investigación Farmacoepidemiológica en Atención Primaria (BIFAP): A data resource for pharmacoepidemiology in Spain"
            },
            "pmid": "32337840"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Pharmacovigilance",
            "uri": "http://edamontology.org/topic_3378"
        },
        {
            "term": "Psychiatry",
            "uri": "http://edamontology.org/topic_3419"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ]
}
