{
    "additionDate": "2023-03-09T14:19:17.072698Z",
    "biotoolsCURIE": "biotools:clam",
    "biotoolsID": "clam",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhuyunping@ncpsb.org.cn",
            "name": "Yunping Zhu",
            "typeEntity": "Person"
        }
    ],
    "description": "CLAM is an analytical framework for detecting co-regulated gene modules by integrating multi-omics data and known molecular interactions.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Weighted correlation network analysis",
                    "uri": "http://edamontology.org/operation_3766"
                }
            ]
        }
    ],
    "homepage": "https://github.com/free1234hm/CLAM",
    "language": [
        "Java"
    ],
    "lastUpdate": "2023-03-09T14:19:17.079511Z",
    "license": "GPL-3.0",
    "name": "CLAM",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3389/FGENE.2023.1082032",
            "metadata": {
                "abstract": "Multi-omics data integration has emerged as a promising approach to identify patient subgroups. However, in terms of grouping genes (or gene products) into co-expression modules, data integration methods suffer from two main drawbacks. First, most existing methods only consider genes or samples measured in all different datasets. Second, known molecular interactions (e.g., transcriptional regulatory interactions, protein–protein interactions and biological pathways) cannot be utilized to assist in module detection. Herein, we present a novel data integration framework, Correlation-based Local Approximation of Membership (CLAM), which provides two methodological innovations to address these limitations: 1) constructing a trans-omics neighborhood matrix by integrating multi-omics datasets and known molecular interactions, and 2) using a local approximation procedure to define gene modules from the matrix. Applying Correlation-based Local Approximation of Membership to human colorectal cancer (CRC) and mouse B-cell differentiation multi-omics data obtained from The Cancer Genome Atlas (TCGA), Clinical Proteomics Tumor Analysis Consortium (CPTAC), Gene Expression Omnibus (GEO) and ProteomeXchange database, we demonstrated its superior ability to recover biologically relevant modules and gene ontology (GO) terms. Further investigation of the colorectal cancer modules revealed numerous transcription factors and KEGG pathways that played crucial roles in colorectal cancer progression. Module-based survival analysis constructed four survival-related networks in which pairwise gene correlations were significantly correlated with colorectal cancer patient survival. Overall, the series of evaluations demonstrated the great potential of Correlation-based Local Approximation of Membership for identifying modular biomarkers for complex diseases. We implemented Correlation-based Local Approximation of Membership as a user-friendly application available at https://github.com/free1234hm/CLAM.",
                "authors": [
                    {
                        "name": "Chen X."
                    },
                    {
                        "name": "Han M."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Zhang J."
                    },
                    {
                        "name": "Zhu Y."
                    }
                ],
                "date": "2023-01-24T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "Identification of functional gene modules by integrating multi-omics data and known molecular interactions"
            },
            "pmcid": "PMC9902936",
            "pmid": "36760999"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
