{
    "additionDate": "2021-01-18T08:06:01Z",
    "biotoolsCURIE": "biotools:panisa",
    "biotoolsID": "panisa",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ccouchoud@chu-besancon.fr",
            "name": "Charlotte Couchoud",
            "orcidid": "https://orcid.org/0000-0002-3241-0915",
            "typeEntity": "Person"
        }
    ],
    "description": "Deciphering the role of insertion sequences in the evolution of bacterial epidemic pathogens with panISa software.\n\npanISa is a software identifying insertion sequence (IS) on resequencing data (bam file) in bacterial genomes.\n\nThe panISa software searches for Insertion Sequences on NGS data ab initio (i.e. with a database-free approach) in bacterial genomes from short read data. Briefly, the software identifies a signature of insertion in the alignment by counting clipped reads on the start and end positions of the potential IS. These clipped reads overlap the direct repeats due to IS insertion. Finally, using a reconstruction of the beginning of both sides of the IS (IRL and IRR), panISa validates the IS by searching for inverted repeat regions.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                },
                {
                    "term": "Indel detection",
                    "uri": "http://edamontology.org/operation_0452"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bvalot/panISa",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-22T17:13:11Z",
    "license": "GPL-3.0",
    "name": "panISa",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1099/MGEN.0.000356",
            "metadata": {
                "abstract": "© 2020 The Authors.Next-generation sequencing (NGS) is now widely used in microbiology to explore genome evolution and the structure of pathogen outbreaks. Bioinformatics pipelines readily detect single-nucleotide polymorphisms or short indels. However, bacterial genomes also evolve through the action of small transposable elements called insertion sequences (ISs), which are difficult to detect due to their short length and multiple repetitions throughout the genome. We designed panISa software for the ab initio detection of IS insertions in the genomes of prokaryotes. PanISa has been released as open source software (GPL3) available from https://​github.​com/​bvalot/​panISa. In this study, we assessed the utility of this software for evolutionary studies, by reanalysing five published datasets for outbreaks of human major pathogens in which ISs had not been specifically investigated. We reanalysed the raw data from each study, by aligning the reads against reference genomes and running panISa on the alignments. Each hit was automatically curated and IS-related events were validated on the basis of nucleotide sequence similarity, by comparison with the ISFinder database. In Acinetobacter baumannii, the panISa pipeline identified ISAba1 or ISAba125 upstream from the ampC gene, which encodes a cephalosporinase in all third-generation cephalosporin-resistant isolates. In the genomes of Vibrio cholerae isolates, we found that early Haitian isolates had the same ISs as Nepalese isolates, confirming the inferred history of the contamination of this island. In Enterococcus faecalis, panISa identified regions of high plasticity, including a pathogenicity island enriched in IS-related events. The overall distribution of ISs deduced with panISa was consistent with SNP-based phylogenic trees, for all species considered. The role of ISs in pathogen evolution has probably been underestimated due to difficulties detecting these transposable elements. We show here that panISa is a useful addition to the bioinformatics toolbox for analyses of the evolution of bacterial genomes. PanISa will facilitate explorations of the functional impact of ISs and improve our understanding of prokaryote evolution.",
                "authors": [
                    {
                        "name": "Couchoud C."
                    },
                    {
                        "name": "Bertrand X."
                    },
                    {
                        "name": "Valot B."
                    },
                    {
                        "name": "Hocquet D."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Microbial Genomics",
                "title": "Deciphering the role of insertion sequences in the evolution of bacterial epidemic pathogens with panisa software"
            },
            "pmcid": "PMC7371109",
            "pmid": "32213253"
        }
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "RNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3794"
        },
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        }
    ],
    "validated": 1
}