
{
    "credit": [
        {
            "email": "atsirigo@us.ibm.com",
            "name": "A. Tsirigo",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://github.com/tsirigos/ibm-cbc-genomic-tools/blob/master/README"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Genome comparison",
                    "uri": "http://edamontology.org/operation_3209"
                },
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                },
                {
                    "term": "Heat map generation",
                    "uri": "http://edamontology.org/operation_0531"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++",
            "C"
        ],
        "license": "GPL-2.0",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Suite"
        ],
        "topic": [
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "ChIP-seq",
                "uri": "http://edamontology.org/topic_3169"
            },
            {
                "term": "RNA-Seq",
                "uri": "http://edamontology.org/topic_3170"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Motivation: Recent advances in sequencing technology have resulted in the dramatic increase of sequencing data, which, in turn, requires efficient management of computational resources, such as computing time, memory requirements as well as prototyping of computational pipelines. Results: We present GenomicTools, a flexible computational platform, comprising both a command-line set of tools and a C++ API, for the analysis and manipulation of high-throughput sequencing data such as DNA-seq, RNA-seq, ChIP-seq and MethylC-seq. GenomicTools implements a variety of mathematical operations between sets of genomic regions thereby enabling the prototyping of computational pipelines that can address a wide spectrum of tasks ranging from pre-processing and quality control to meta-analyses. Additionally, the GenomicTools platform is designed to analyze large datasets of any size by minimizing memory requirements. In practical applications, where comparable, GenomicTools outperforms existing tools in terms of both time and memory usage. Availability: The GenomicTools platform (version 2.0.0) was implemented in C++. © The Author 2011. Published by Oxford University Press. All rights reserved.",
            "authors": [
                "Tsirigos A.",
                "Haiminen N.",
                "Bilal E.",
                "Utro F."
            ],
            "cit_count": 24,
            "journal": "Bioinformatics",
            "pmid": "22113082",
            "title": "Genomictools: A computational platform for developing high-throughput analytics in genomics",
            "year": "2012-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:genomictools",
        "biotoolsID": "genomictools",
        "description": "GenomicTools is a platform for the analysis and manipulation of high-throughput sequencing data such as RNA-seq and ChIP-seq.",
        "homepage": "http://code.google.com/p/ibm-cbc-genomic-tools/",
        "name": "GenomicTools"
    }
}