{
    "additionDate": "2021-01-18T07:10:58Z",
    "biotoolsCURIE": "biotools:checkcif",
    "biotoolsID": "checkcif",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "a.l.spek@uu.nl",
            "name": "Anthony L. Spek",
            "typeEntity": "Person"
        }
    ],
    "description": "checkCIF reports on the consistency and integrity of crystal structure determinations reported in CIF format.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "https://checkcif.iucr.org",
    "lastUpdate": "2021-02-10T21:49:09Z",
    "name": "checkCIF",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1107/S2056989019016244",
            "metadata": {
                "abstract": "© 2020 International Union of Crystallography. All rights reserved.Authors of a paper that includes a new crystal-structure determination are expected to not only report the structural results of interest and their interpretation, but are also expected to archive in computer-readable CIF format the experimental data on which the crystal-structure analysis is based. Additionally, an IUCr/checkCIF validation report will be required for the review of a submitted paper. Such a validation report, automatically created from the deposited CIF file, lists as ALERTS not only potential errors or unusual findings, but also suggestions for improvement along with interesting information on the structure at hand. Major ALERTS for issues are expected to have been acted on already before the submission for publication or discussed in the associated paper and/or commented on in the CIF file. In addition, referees, readers and users of the data should be able to make their own judgment and interpretation of the underlying experimental data or perform their own calculations with the archived data. All the above is consistent with the FAIR (findable, accessible, interoperable, and reusable) initiative [Helliwell (2019). Struct. Dyn. 6, 05430]. Validation can also be helpful for less experienced authors in pointing to and avoiding of crystal-structure determination and interpretation pitfalls. The IUCr web-based checkCIF server provides such a validation report, based on data uploaded in CIF format. Alternatively, a locally installable checkCIF version is available to be used iteratively during the structure-determination process. ALERTS come mostly as short single-line messages. There is also a short explanation of the ALERTS available through the IUCr web server or with the locally installed PLATON/checkCIF version. This paper provides additional background information on the checkCIF procedure and additional details for a number of ALERTS along with options for how to act on them.",
                "authors": [
                    {
                        "name": "Spek A.L."
                    }
                ],
                "citationCount": 283,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Acta Crystallographica Section E: Crystallographic Communications",
                "title": "CheckCIF validation ALERTS: What they mean and how to respond"
            },
            "pmcid": "PMC6944088",
            "pmid": "31921444"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "X-ray diffraction",
            "uri": "http://edamontology.org/topic_2828"
        }
    ]
}
