{
    "additionDate": "2021-03-19T08:35:47Z",
    "biotoolsCURIE": "biotools:screqtl",
    "biotoolsID": "screqtl",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "horvatha@gwu.edu",
            "name": "Anelia Horvath",
            "orcidid": "https://orcid.org/0000-0003-4117-013X",
            "typeEntity": "Person"
        }
    ],
    "description": "ScReQTL is an application to assess the correlation between gene expression and expression of biallelic SNV loci (Variant Allele Fraction, VAFRNA) located within transcribed genomic regions from scRNA-seq data. This tool is an approach to correlate SNVs to gene expression from individual scRNA-seq datasets.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://github.com/HorvathLab/NGS/tree/master/scReQTL",
    "lastUpdate": "2021-04-08T11:18:05Z",
    "name": "scReQTL",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12864-020-07334-Y",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Recently, pioneering expression quantitative trait loci (eQTL) studies on single cell RNA sequencing (scRNA-seq) data have revealed new and cell-specific regulatory single nucleotide variants (SNVs). Here, we present an alternative QTL-related approach applicable to transcribed SNV loci from scRNA-seq data: scReQTL. ScReQTL uses Variant Allele Fraction (VAFRNA) at expressed biallelic loci, and corelates it to gene expression from the corresponding cell. Results: Our approach employs the advantage that, when estimated from multiple cells, VAFRNA can be used to assess effects of SNVs in a single sample or individual. In this setting scReQTL operates in the context of identical genotypes, where it is likely to capture RNA-mediated genetic interactions with cell-specific and transient effects. Applying scReQTL on scRNA-seq data generated on the 10 × Genomics Chromium platform using 26,640 mesenchymal cells derived from adipose tissue obtained from three healthy female donors, we identified 1272 unique scReQTLs. ScReQTLs common between individuals or cell types were consistent in terms of the directionality of the relationship and the effect size. Comparative assessment with eQTLs from bulk sequencing data showed that scReQTL analysis identifies a distinct set of SNV-gene correlations, that are substantially enriched in known gene-gene interactions and significant genome-wide association studies (GWAS) loci. Conclusion: ScReQTL is relevant to the rapidly growing source of scRNA-seq data and can be applied to outline SNVs potentially contributing to cell type-specific and/or dynamic genetic interactions from an individual scRNA-seq dataset. Availability:https://github.com/HorvathLab/NGS/tree/master/scReQTL",
                "authors": [
                    {
                        "name": "Alomran N."
                    },
                    {
                        "name": "Bousounis P."
                    },
                    {
                        "name": "Horvath A."
                    },
                    {
                        "name": "Ibeawuchi H."
                    },
                    {
                        "name": "Liu H."
                    },
                    {
                        "name": "Prashant N.M."
                    },
                    {
                        "name": "Sein J."
                    },
                    {
                        "name": "Slowinski P."
                    },
                    {
                        "name": "Spurr L.F."
                    },
                    {
                        "name": "Tsaneva-Atanasova K."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "scReQTL: an approach to correlate SNVs to gene expression from individual scRNA-seq datasets"
            },
            "pmcid": "PMC7791999",
            "pmid": "33419390"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library",
        "Workflow"
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
