{
    "additionDate": "2020-01-14T19:45:45Z",
    "biotoolsCURIE": "biotools:flowEMMi",
    "biotoolsID": "flowEMMi",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "choener@bioinf.uni-leipzig.de",
            "name": "Christian Höner zu Siederdissen",
            "orcidid": "https://orcid.org/0000-0001-9517-5839",
            "typeEntity": "Person"
        }
    ],
    "description": "An automated model-based clustering tool for microbial cytometric data.",
    "documentation": [
        {
            "type": [
                "Quick start guide"
            ],
            "url": "http://www.bioinf.uni-leipzig.de/Software/flowEMMi/manual_flowEmmi.pdf"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "http://www.bioinf.uni-leipzig.de/Software/flowEMMi/",
    "language": [
        "C++",
        "R"
    ],
    "lastUpdate": "2020-12-29T09:40:30Z",
    "license": "GPL-3.0",
    "name": "flowEMMi",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3152-3",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Flow cytometry (FCM) is a powerful single-cell based measurement method to ascertain multidimensional optical properties of millions of cells. FCM is widely used in medical diagnostics and health research. There is also a broad range of applications in the analysis of complex microbial communities. The main concern in microbial community analyses is to track the dynamics of microbial subcommunities. So far, this can be achieved with the help of time-consuming manual clustering procedures that require extensive user-dependent input. In addition, several tools have recently been developed by using different approaches which, however, focus mainly on the clustering of medical FCM data or of microbial samples with a well-known background, while much less work has been done on high-throughput, online algorithms for two-channel FCM. Results: We bridge this gap with flowEMMi, a model-based clustering tool based on multivariate Gaussian mixture models with subsampling and foreground/background separation. These extensions provide a fast and accurate identification of cell clusters in FCM data, in particular for microbial community FCM data that are often affected by irrelevant information like technical noise, beads or cell debris. flowEMMi outperforms other available tools with regard to running time and information content of the clustering results and provides near-online results and optional heuristics to reduce the running-time further. Conclusions: flowEMMi is a useful tool for the automated cluster analysis of microbial FCM data. It overcomes the user-dependent and time-consuming manual clustering procedure and provides consistent results with ancillary information and statistical proof.",
                "authors": [
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Ludwig J."
                    },
                    {
                        "name": "Muller S."
                    },
                    {
                        "name": "Stadler P.F."
                    },
                    {
                        "name": "Zu Siederdissen C.H."
                    }
                ],
                "citationCount": 5,
                "date": "2019-12-09T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "FlowEMMi: An automated model-based clustering tool for microbial cytometric data"
            },
            "pmcid": "PMC6902487",
            "pmid": "31815609"
        }
    ],
    "toolType": [
        "Library",
        "Workflow"
    ],
    "topic": [
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        }
    ],
    "validated": 1
}
