{
    "additionDate": "2020-01-14T09:01:17Z",
    "biotoolsCURIE": "biotools:ProAffiMuSeq",
    "biotoolsID": "ProAffiMuSeq",
    "confidence_flag": "tool",
    "description": "Sequence-based method to predict the binding free energy change of protein-protein complexes upon mutation using functional classification.\n\nThis server predicts protein-protein binding affinity change upon mutation using sequence-based features and functional class. ProAffiMuSeq shows a correlation of 0.73 and a mean absolute error (MAE) of 0.86 kcal/mol in cross-validation. In the test dataset, the performance remains consistent with a correlation of 0.75 with MAE of 0.94 kcal/mol. In a blind dataset of 473 mutations (Geng et al. 2019, Proteins 87, 110-119) it showed a correlation and MAE of 0.27 and 1.06 kcal/mol, respectively, comparable to structure-based methods. Further, our method showed a MAE of 1.21 kcal/mol, when tested with a set of 552 additional non-redundant interface mutations in 80 complexes deposited in SKEMPI 2.0 (Jankauskaitė et al. 2019, Bioinformatics 35, 462-469)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Protein-protein binding site prediction",
                    "uri": "http://edamontology.org/operation_2464"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                }
            ]
        }
    ],
    "homepage": "https://web.iitm.ac.in/bioinfo2/proaffimuseq/",
    "lastUpdate": "2020-12-06T10:38:12.077753Z",
    "name": "ProAffiMuSeq",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ829",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: Protein-protein interactions are essential for the cell and mediate various functions. However, mutations can disrupt these interactions and may cause diseases. Currently available computational methods require a complex structure as input for predicting the change in binding affinity. Further, they have not included the functional class information for the protein-protein complex. To address this, we have developed a method, ProAffiMuSeq, which predicts the change in binding free energy using sequence-based features and functional class. Results: Our method shows an average correlation between predicted and experimentally determined ΔΔG of 0.73 and mean absolute error (MAE) of 0.86 kcal/mol in 10-fold cross-validation and correlation of 0.75 with MAE of 0.94 kcal/mol in the test dataset. ProAffiMuSeq was also tested on an external validation set and showed results comparable to structure-based methods. Our method can be used for large-scale analysis of disease-causing mutations in protein-protein complexes without structural information.",
                "authors": [
                    {
                        "name": "Jemimah S."
                    },
                    {
                        "name": "Sekijima M."
                    },
                    {
                        "name": "Gromiha M.M."
                    }
                ],
                "citationCount": 2,
                "date": "2020-03-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "ProAffiMuSeq: Sequence-based method to predict the binding free energy change of protein-protein complexes upon mutation using functional classification"
            },
            "pmid": "31713585"
        }
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}