{"credit":[{"email":"calfitter@sci.muni.cz","typeEntity":"Person","typeRoles":["Primary contact"]},{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://loschmidt.chemi.muni.cz/"}],"documentation":[{"type":"GENERAL","url":"https://loschmidt.chemi.muni.cz/calfitter/?action=help&"},{"type":"TRAINING_MATERIAL","url":"https://loschmidt.chemi.muni.cz/calfitter/?action=example&"}],"function":[{"operation":[{"term":"Protein folding analysis","uri":"http://edamontology.org/operation_2415"},{"term":"Protein structure prediction","uri":"http://edamontology.org/operation_0474"}]}],"labels":{"toolType":["Web application"],"topic":[{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"},{"term":"Nucleic acid structure analysis","uri":"http://edamontology.org/topic_0097"},{"term":"NMR","uri":"http://edamontology.org/topic_0593"}]},"publication":[{"abstract":"© The Author(s) 2018. Published by Oxford University Press on behalf of Nucleic Acids Research. Despite significant advances in the understanding of protein structure-function relationships, revealing protein folding pathways still poses a challenge due to a limited number of relevant experimental tools. Widely-used experimental techniques, such as calorimetry or spectroscopy, critically depend on a proper data analysis. Currently, there are only separate data analysis tools available for each type of experiment with a limited model selection. To address this problem, we have developed the CalFitter web server to be a unified platform for comprehensive data fitting and analysis of protein thermal denaturation data. The server allows simultaneous global data fitting using any combination of input data types and offers 12 protein unfolding pathway models for selection, including irreversible transitions often missing from other tools. The data fitting produces optimal parameter values, their confidence intervals, and statistical information to define unfolding pathways. The server provides an interactive and easy-to-use interface that allows users to directly analyse input datasets and simulate modelled output based on the model parameters. CalFitter web server is available free at https://loschmidt.chemi.muni.cz/calfitter/.","authors":["Mazurenko S.","Stourac J.","Kunka A.","Nedeljkovic S.","Bednar D.","Prokop Z.","Damborsky J."],"cit_count":0,"doi":"10.1093/nar/gky358","journal":"Nucleic Acids Research","title":"CalFitter: A web server for analysis of protein thermal denaturation data","year":"2018-07-02"}],"summary":{"biotoolsCURIE":"biotools:calfitter","biotoolsID":"calfitter","description":"Unified platform for comprehensive data fitting and analysis of protein thermal denaturation data. Allows simultaneous global data fitting using any combination of input data types and offers 12 protein unfolding pathway models for selection, including irreversible transitions often missing from other tools. The data fitting produces optimal parameter values, their confidence intervals, and statistical information to define unfolding pathways.","homepage":"https://loschmidt.chemi.muni.cz/calfitter/","name":"CalFitter","version":["1.2"]}}