{
    "additionDate": "2017-03-30T21:27:42Z",
    "biotoolsCURIE": "biotools:hla_bind",
    "biotoolsID": "hla_bind",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "email": "kenneth.parker@childrens.harvard.edu",
            "name": "Kenneth Parker",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Function: Rank potential 8-mer, 9-mer, or 10-mer peptides based on a predicted half-time of dissociation to HLA class I molecules. The analysis is based on coefficient tables deduced from the published literature.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://www-bimas.cit.nih.gov/molbio/hla_bind/hla_motif_search_info.html"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peptide immunogenicity prediction",
                    "uri": "http://edamontology.org/operation_0252"
                },
                {
                    "term": "Protein-nucleic acid binding prediction",
                    "uri": "http://edamontology.org/operation_0420"
                },
                {
                    "term": "Protein binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                },
                {
                    "term": "siRNA binding specificity prediction",
                    "uri": "http://edamontology.org/operation_0465"
                }
            ]
        }
    ],
    "homepage": "http://www-bimas.cit.nih.gov/molbio/hla_bind/",
    "lastUpdate": "2019-03-26T08:18:26Z",
    "name": "Bimas HLA Peptide Binding Predictions",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "A method to predict the relative binding strengths of all possible nonapeptides to the MHC class I molecule HLA-A2 has been developed based on experimental peptide binding data. These data indicate that, for most peptides, each side-chain of the peptide contributes a certain amount to the stability of the HLA-A2 complex that is independent of the sequence of the peptide. To quantify these contributions, the binding data from a set of 154 peptides were combined together to generate a table containing 180 coefficients (20 amino acids x 9 positions), each of which represents the contribution of one particular amino acid residue at a specified position within the peptide to binding to HLA-A2. Eighty peptides formed stable HLA- A2 complexes, as assessed by measuring the rate of dissociation of β2m. The remaining 74 peptides formed complexes that had a half-life of β2m dissociation of less than 5 min at 37°C, or did not bind to HLA-A2, and were included because they could be used to constrain the values of some of the coefficients. The 'theoretical' binding stability (calculated by multiplying together the corresponding coefficients) matched the experimental binding stability to within a factor of 5. The coefficients were then used to calculate the theoretical binding stability for all the previously identified self or antigenic nonamer peptides known to bind to HLA-A2. The binding stability for all other nonamer peptides that could be generated from the proteins from which these peptides were derived was also predicted. In every case, the previously described HLA-A2 binding peptides were ranked in the top 2% of all possible nonamers for each source protein. Therefore, most biologically relevant nonamer peptides should be identifiable using the table of coefficients. We conclude that the side-chains of most nonamer peptides to the first approximation bind independently of one another to the HLA-A2 molecule.",
                "authors": [
                    {
                        "name": "Parker K.C."
                    },
                    {
                        "name": "Bednarek M.A."
                    },
                    {
                        "name": "Coligan J.E."
                    }
                ],
                "citationCount": 1232,
                "date": "1994-01-01T00:00:00Z",
                "journal": "Journal of Immunology",
                "title": "Scheme for ranking potential HLA-A2 binding peptides based on independent binding of individual peptide side-chains"
            },
            "pmid": "8254189"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Immunoproteins, genes and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "DNA binding sites",
            "uri": "http://edamontology.org/topic_3125"
        }
    ],
    "validated": 1
}