{
    "accessibility": "Open access",
    "additionDate": "2017-03-24T11:45:07Z",
    "biotoolsCURIE": "biotools:rnaz",
    "biotoolsID": "rnaz",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "rna@tbi.univie.ac.at",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Detects functional RNA secondary structures in multiple sequence alignments based on thermodynamic stability and structural conservation.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://rna.tbi.univie.ac.at/cgi-bin/RNAz/RNAz.cgi?PAGE=1&TYPE=H"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "RNA secondary structure alignment",
                    "uri": "http://edamontology.org/operation_0502"
                },
                {
                    "term": "RNA secondary structure analysis",
                    "uri": "http://edamontology.org/operation_2439"
                },
                {
                    "term": "RNA secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0278"
                }
            ]
        }
    ],
    "homepage": "http://rna.tbi.univie.ac.at/cgi-bin/RNAz/RNAz.cgi",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2024-11-24T21:04:04.938162Z",
    "license": "Unlicense",
    "link": [
        {
            "note": "RNAz program",
            "type": [
                "Other"
            ],
            "url": "https://www.tbi.univie.ac.at/software/RNAz/"
        }
    ],
    "maturity": "Mature",
    "name": "RNAz",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": "10.1073/pnas.0409169102",
            "metadata": {
                "abstract": "We report an efficient method for detecting functional RNAs. The approach, which combines comparative sequence analysis and structure prediction, already has yielded excellent results for a small number of aligned sequences and is suitable for large-scale genomic screens. It consists of two basic components: (i) a measure for RNA secondary structure conservation based on computing a consensus secondary structure, and (ii) a measure for thermodynamic stability, which, in the spirit of a z score, is normalized with respect to both sequence length and base composition but can be calculated without sampling from shuffled sequences. Functional RNA secondary structures can be identified in multiple sequence alignments with high sensitivity and high specificity. We demonstrate that this approach is not only much more accurate than previous methods but also significantly faster. The method is implemented in the program RNAZ, which can be downloaded from www.tbi.univie.ac.at/~wash/RNAz. We screened all alignments of length n ≥ 50 in the Comparative Regulatory Genomics database, which compiles conserved noncoding elements in upstream regions of orthologous genes from human, mouse, rat, Fugu, and zebrafish. We recovered all of the known noncoding RNAs and cis-acting elements with high significance and found compelling evidence for many other conserved RNA secondary structures not described so far to our knowledge.",
                "authors": [
                    {
                        "name": "Hofacker I.L."
                    },
                    {
                        "name": "Stadler P.F."
                    },
                    {
                        "name": "Washietl S."
                    }
                ],
                "citationCount": 534,
                "date": "2005-02-15T00:00:00Z",
                "journal": "Proceedings of the National Academy of Sciences of the United States of America",
                "title": "Fast and reliable prediction of noncoding RNAs"
            },
            "pmcid": "PMC548974",
            "pmid": "15665081"
        },
        {
            "doi": "10.1093/nar/gkm222",
            "metadata": {
                "abstract": "Many non-coding RNA genes and cis-acting regulatory elements of mRNAs contain RNA secondary structures that are critical for their function. Such functional RNAs can be predicted on the basis of thermodynamic stability and evolutionary conservation. We present a web server that uses the RNAz algorithm to detect functional RNA structures in multiple alignments of nucleotide sequences. The server provides access to a complete and fully automatic analysis pipeline that allows not only to analyze single alignments in a variety of formats, but also to conduct complex screens of large genomic regions. Results are presented on a website that is illustrated by various structure representations and can be downloaded for local view. The web server is available at: rna.tbi.univie.ac.at/RNAz. © 2007 The Author(s).",
                "authors": [
                    {
                        "name": "Gruber A.R."
                    },
                    {
                        "name": "Hofacker I.L."
                    },
                    {
                        "name": "Neubock R."
                    },
                    {
                        "name": "Washietl S."
                    }
                ],
                "citationCount": 83,
                "date": "2007-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "The RNAz web server: Prediction of thermodynamically stable and evolutionarily conserved RNA structures"
            },
            "pmcid": "PMC1933143",
            "pmid": "17452347"
        },
        {
            "doi": "10.1016/s0022-2836(02)00308-x",
            "metadata": {
                "abstract": "Most functional RNA molecules have characteristic secondary structures that are highly conserved in evolution. Here we present a method for computing the consensus structure of a set aligned RNA sequences taking into account both thermodynamic stability and sequence covariation. Comparison with phylogenetic structures of rRNAs shows that a reliability of prediction of more than 80% is achieved for only five related sequences. As an application we show that the Early Noduline mRNA contains significant secondary structure that is supported by sequence covariation. © 2002 Elsevier Science Ltd. All rights reserved.",
                "authors": [
                    {
                        "name": "Fekete M."
                    },
                    {
                        "name": "Hofacker I.L."
                    },
                    {
                        "name": "Stadler P.F."
                    }
                ],
                "citationCount": 522,
                "date": "2002-01-01T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "Secondary structure prediction for aligned RNA sequences"
            },
            "pmid": "12079347"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}
