{
    "additionDate": "2020-01-14T09:16:19Z",
    "biotoolsCURIE": "biotools:ECMarker",
    "biotoolsID": "ECMarker",
    "confidence_flag": "tool",
    "description": "Interpretable machine learning model identifies gene expression biomarkers predicting clinical outcomes and reveals molecular mechanisms of human disease in early stages.\n\nAbstract Gene expression and regulation, a key molecular mechanism driving human disease development, remains elusive, especially at early stages. The increasing amount of genomics data gathered from patients allows for better understanding of gene regulatory mechanisms that occur during disease development at a system level. However, integrating such a large amount of population data is still a challenging task. To address this, we developed an interpretable machine learning model, ECMarker, to predict gene expression biomarkers and regulatory networks specific for disease stages such as early cancer. In particular, ECMarker was built on the semi-restricted Boltzmann machine, a machine learning model with multiple hierarchical layers.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                }
            ]
        }
    ],
    "homepage": "https://github.com/daifengwanglab/ECMarker",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-25T11:47:27Z",
    "name": "ECMarker",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/825414"
        },
        {
            "doi": "10.1093/bioinformatics/btaa935",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press.Motivation: Gene expression and regulation, a key molecular mechanism driving human disease development, remains elusive, especially at early stages. Integrating the increasing amount of population-level genomic data and understanding gene regulatory mechanisms in disease development are still challenging. Machine learning has emerged to solve this, but many machine learning methods were typically limited to building an accurate prediction model as a 'black box', barely providing biological and clinical interpretability from the box. Results: To address these challenges, we developed an interpretable and scalable machine learning model, ECMarker, to predict gene expression biomarkers for disease phenotypes and simultaneously reveal underlying regulatory mechanisms. Particularly, ECMarker is built on the integration of semi- and discriminative-restricted Boltzmann machines, a neural network model for classification allowing lateral connections at the input gene layer. This interpretable model is scalable without needing any prior feature selection and enables directly modeling and prioritizing genes and revealing potential gene networks (from lateral connections) for the phenotypes. With application to the gene expression data of non-small-cell lung cancer patients, we found that ECMarker not only achieved a relatively high accuracy for predicting cancer stages but also identified the biomarker genes and gene networks implying the regulatory mechanisms in the lung cancer development. In addition, ECMarker demonstrates clinical interpretability as its prioritized biomarker genes can predict survival rates of early lung cancer patients (P-value < 0.005). Finally, we identified a number of drugs currently in clinical use for late stages or other cancers with effects on these early lung cancer biomarkers, suggesting potential novel candidates on early cancer medicine. Availabilityand implementation: ECMarker is open source as a general-purpose tool at https://github.com/daifengwanglab/ECMarker.",
                "authors": [
                    {
                        "name": "Jin T."
                    },
                    {
                        "name": "Nguyen N.D."
                    },
                    {
                        "name": "Talos F."
                    },
                    {
                        "name": "Wang D."
                    }
                ],
                "date": "2021-04-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "ECMarker: Interpretable machine learning model identifies gene expression biomarkers predicting clinical outcomes and reveals molecular mechanisms of human disease in early stages"
            },
            "pmid": "33305308"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}
