{
    "additionDate": "2021-03-19T08:33:22Z",
    "biotoolsCURIE": "biotools:epimut",
    "biotoolsID": "epimut",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "gemovic@vin.bg.ac.rs",
            "name": "Branislava Gemović",
            "orcidid": "https://orcid.org/0000-0002-8987-020X",
            "typeEntity": "Person"
        }
    ],
    "description": "EpiMut is software for functional annotation of amino acid substitutions (AASs) in epigenetic factors that is independent from sequence alignments and homology search. It is based on the biochemical and physicochemical characteristics of amino acids and digital signal processing approach in protein sequence analysis.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://www.vin.bg.ac.rs/180/tools/epimut/download_file.php?id=2"
        }
    ],
    "download": [
        {
            "type": "Software package",
            "url": "https://www.vin.bg.ac.rs/180/tools/epimut/download_file.php?id=1"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                },
                {
                    "term": "Variant effect prediction",
                    "uri": "http://edamontology.org/operation_0331"
                }
            ]
        }
    ],
    "homepage": "https://www.vin.bg.ac.rs/180/tools/epimut.php",
    "lastUpdate": "2021-05-05T12:52:01Z",
    "name": "EpiMut",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0244948",
            "metadata": {
                "abstract": "© 2021 Gemovic et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.For the last couple of decades, there has been a significant growth in sequencing data, leading to an extraordinary increase in the number of gene variants. This places a challenge on the bioinformatics research community to develop and improve computational tools for functional annotation of new variants. Genes coding for epigenetic regulators have important roles in cancer pathogenesis and mutations in these genes show great potential as clinical biomarkers, especially in hematologic malignancies. Therefore, we developed a model that specifically focuses on these genes, with an assumption that it would outperform general models in predicting the functional effects of amino acid substitutions. EpiMut is a standalone software that implements a sequence based alignment-free method. We applied a two-step approach for generating sequence based features, relying on the biophysical and biochemical indices of amino acids and the Fourier Transform as a sequence transformation method. For each gene in the dataset, the machine learning algorithm–Naïve Bayes was used for building a model for prediction of the neutral or disease-related status of variants. EpiMut outperformed state-of-the-art tools used for comparison, PolyPhen-2, SIFT and SNAP2. Additionally, EpiMut showed the highest performance on the subset of variants positioned outside conserved functional domains of analysed proteins, which represents an important group of cancer-related variants. These results imply that EpiMut can be applied as a first choice tool in research of the impact of gene variants in epigenetic regulators, especially in the light of the biomarker role in hematologic malignancies. EpiMut is freely available at https://www.vin.bg.ac.rs/180/tools/epimut.php.",
                "authors": [
                    {
                        "name": "Gemovic B."
                    },
                    {
                        "name": "Perovic V."
                    },
                    {
                        "name": "Davidovic R."
                    },
                    {
                        "name": "Drljaca T."
                    },
                    {
                        "name": "Veljkovic N."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Alignment-free method for functional annotation of amino acid substitutions: Application on epigenetic factors involved in hematologic malignancies"
            },
            "pmcid": "PMC7781373",
            "pmid": "33395407"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}