{
    "additionDate": "2017-12-18T00:15:15Z",
    "biotoolsCURIE": "biotools:mirplant",
    "biotoolsID": "mirplant",
    "credit": [
        {
            "email": "j.an@qut.edu.au",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.mdc-berlin.de/1151037/en/research/research_teams/systems_biology_of_gene_regulatory_elements"
        }
    ],
    "description": "It extends miRDeep to various plant species by adopting suitable strategies to identify hairpin excision regions and hairpin structure filtering for plants.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.australianprostatecentre.org/SoftwareAttachments/copy2_of_manual_miRPlant.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                }
            ]
        }
    ],
    "homepage": "http://www.australianprostatecentre.org/research/software/mirplant",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/mirplant-v3-an-integrated-tool-for-identification-of-plant-mirna-from-rna-sequencing-data.html"
        }
    ],
    "name": "miRPlant",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-15-275",
            "metadata": {
                "abstract": "© 2014 An et al.; licensee BioMed Central Ltd.Background: Small RNA sequencing is commonly used to identify novel miRNAs and to determine their expression levels in plants. There are several miRNA identification tools for animals such as miRDeep, miRDeep2 and miRDeep*. miRDeep-P was developed to identify plant miRNA using miRDeep's probabilistic model of miRNA biogenesis, but it depends on several third party tools and lacks a user-friendly interface. The objective of our miRPlant program is to predict novel plant miRNA, while providing a user-friendly interface with improved accuracy of prediction.Result: We have developed a user-friendly plant miRNA prediction tool called miRPlant. We show using 16 plant miRNA datasets from four different plant species that miRPlant has at least a 10% improvement in accuracy compared to miRDeep-P, which is the most popular plant miRNA prediction tool. Furthermore, miRPlant uses a Graphical User Interface for data input and output, and identified miRNA are shown with all RNAseq reads in a hairpin diagram.Conclusions: We have developed miRPlant which extends miRDeep* to various plant species by adopting suitable strategies to identify hairpin excision regions and hairpin structure filtering for plants. miRPlant does not require any third party tools such as mapping or RNA secondary structure prediction tools. miRPlant is also the first plant miRNA prediction tool that dynamically plots miRNA hairpin structure with small reads for identified novel miRNAs. This feature will enable biologists to visualize novel pre-miRNA structure and the location of small RNA reads relative to the hairpin. Moreover, miRPlant can be easily used by biologists with limited bioinformatics skills.miRPlant and its manual are freely available at http://www.australianprostatecentre.org/research/software/mirplant or http://sourceforge.net/projects/mirplant/.",
                "authors": [
                    {
                        "name": "An J."
                    },
                    {
                        "name": "Lai J."
                    },
                    {
                        "name": "Sajjanhar A."
                    },
                    {
                        "name": "Lehman M.L."
                    },
                    {
                        "name": "Nelson C.C."
                    }
                ],
                "citationCount": 52,
                "date": "2014-08-12T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "MiRPlant: An integrated tool for identification of plant miRNA from RNA sequencing data"
            },
            "pmcid": "PMC4141084",
            "pmid": "25117656",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1,
    "version": [
        "v4"
    ]
}