{
    "additionDate": "2017-08-03T18:53:58Z",
    "biotoolsCURIE": "biotools:pfmpred",
    "biotoolsID": "pfmpred",
    "credit": [
        {
            "email": "raghava@imtech.res.in",
            "name": "Dr.G.P.S.Raghava",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.imtech.res.in/raghava/pfmpred/team.html"
        }
    ],
    "description": "Developed for predicting mitochondrial proteins of malaria parasite Plasmodium falciparum . All models were trained and tested on 175 proteins (40 mitochondrial & 135 non-mitochondrial proteins) and evaluated using five-fold cross validation.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://crdd.osdd.net/raghava/pfmpred/home.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "homepage": "http://www.imtech.res.in/raghava/pfmpred/",
    "lastUpdate": "2018-12-10T12:58:45Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/pfmpred-predicting-mitochondrial-proteins-of-p-falciparum.html"
        }
    ],
    "name": "PFMpred",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "The rate of human death due to malaria is increasing day-by-day. Thus the malaria causing parasite Plasmodium falciparum (PF) remains the cause of concern. With the wealth of data now available, it is imperative to understand protein localization in order to gain deeper insight into their functional roles. In this manuscript, an attempt has been made to develop prediction method for the localization of mitochondrial proteins. In this study, we describe a method for predicting mitochondrial proteins of malaria parasite using machine-learning technique. All models were trained and tested on 175 proteins (40 mitochondrial and 135 non-mitochondrial proteins) and evaluated using five-fold cross validation. We developed a Support Vector Machine (SVM) model for predicting mitochondrial proteins of P. falciparum, using amino acids and dipeptides composition and achieved maximum MCC 0.38 and 0.51, respectively. In this study, split amino acid composition (SAAC) is used where composition of N-termini, C-termini, and rest of protein is computed separately. The performance of SVM model improved significantly from MCC 0.38 to 0.73 when SAAC instead of simple amino acid composition was used as input. In addition, SVM model has been developed using composition of PSSM profile with MCC 0.75 and accuracy 91.38%. We achieved maximum MCC 0.81 with accuracy 92% using a hybrid model, which combines PSSM profile and SAAC. When evaluated on an independent dataset our method performs better than existing methods. A web server PFMpred has been developed for predicting mitochondrial proteins of malaria parasites ( http://www.imtech.res.in/raghava/pfmpred/ ). © 2009 Springer-Verlag.",
                "authors": [
                    {
                        "name": "Verma R."
                    },
                    {
                        "name": "Varshney G.C."
                    },
                    {
                        "name": "Raghava G.P.S."
                    }
                ],
                "citationCount": 44,
                "date": "2010-06-01T00:00:00Z",
                "journal": "Amino Acids",
                "title": "Prediction of mitochondrial proteins of malaria parasite using split amino acid composition and PSSM profile"
            },
            "pmid": "19908123"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}