{
    "additionDate": "2022-11-03T08:26:10.953318Z",
    "biotoolsCURIE": "biotools:ganseg",
    "biotoolsID": "ganseg",
    "confidence_flag": "high",
    "credit": [
        {
            "name": "Aaron Y. Lee"
        },
        {
            "name": "Yue Wu"
        }
    ],
    "description": "Training deep learning models to work on multiple devices by cross domain learning with no additional annotations.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/uw-biomedical-ml/ganseg",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:23:55.163006Z",
    "license": "BSD-2-Clause",
    "name": "GANSeg",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/j.ophtha.2022.09.014",
            "metadata": {
                "abstract": "Purpose: To create an unsupervised cross-domain segmentation algorithm for segmenting intraretinal fluid and retinal layers on normal and pathologic macular OCT images from different manufacturers and camera devices. Design: We sought to use generative adversarial networks (GANs) to generalize a segmentation model trained on one OCT device to segment B-scans obtained from a different OCT device manufacturer in a fully unsupervised approach without labeled data from the latter manufacturer. Participants: A total of 732 OCT B-scans from 4 different OCT devices (Heidelberg Spectralis, Topcon 1000, Maestro2, and Zeiss Plex Elite 9000). Methods: We developed an unsupervised GAN model, GANSeg, to segment 7 retinal layers and intraretinal fluid in Topcon 1000 OCT images (domain B) that had access only to labeled data on Heidelberg Spectralis images (domain A). GANSeg was unsupervised because it had access only to 110 Heidelberg labeled OCTs and 556 raw and unlabeled Topcon 1000 OCTs. To validate GANSeg segmentations, 3 masked graders manually segmented 60 OCTs from an external Topcon 1000 test dataset independently. To test the limits of GANSeg, graders also manually segmented 3 OCTs from Zeiss Plex Elite 9000 and Topcon Maestro2. A U-Net was trained on the same labeled Heidelberg images as baseline. The GANSeg repository with labeled annotations is at https://github.com/uw-biomedical-ml/ganseg. Main Outcome Measures: Dice scores comparing segmentation results from GANSeg and the U-Net model with the manual segmented images. Results: Although GANSeg and U-Net achieved comparable Dice scores performance as human experts on the labeled Heidelberg test dataset, only GANSeg achieved comparable Dice scores with the best performance for the ganglion cell layer plus inner plexiform layer (90%; 95% confidence interval [CI], 68%–96%) and the worst performance for intraretinal fluid (58%; 95% CI, 18%–89%), which was statistically similar to human graders (79%; 95% CI, 43%–94%). GANSeg significantly outperformed the U-Net model. Moreover, GANSeg generalized to both Zeiss and Topcon Maestro2 swept-source OCT domains, which it had never encountered before. Conclusions: GANSeg enables the transfer of supervised deep learning algorithms across OCT devices without labeled data, thereby greatly expanding the applicability of deep learning algorithms.",
                "authors": [
                    {
                        "name": "Blazes M."
                    },
                    {
                        "name": "Egan C."
                    },
                    {
                        "name": "Grimaldi G."
                    },
                    {
                        "name": "Kung T.-P.H."
                    },
                    {
                        "name": "Lee A.Y."
                    },
                    {
                        "name": "Lee C.S."
                    },
                    {
                        "name": "Leung I."
                    },
                    {
                        "name": "Lu R."
                    },
                    {
                        "name": "Mishra A.V."
                    },
                    {
                        "name": "Nussinovitch H."
                    },
                    {
                        "name": "Olvera-Barrios A."
                    },
                    {
                        "name": "Tufail A."
                    },
                    {
                        "name": "Wu Y."
                    },
                    {
                        "name": "Yanagihara R."
                    }
                ],
                "citationCount": 8,
                "date": "2023-02-01T00:00:00Z",
                "journal": "Ophthalmology",
                "title": "Training Deep Learning Models to Work on Multiple Devices by Cross-Domain Learning with No Additional Annotations"
            },
            "pmcid": "PMC9868052",
            "pmid": "36154868"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ],
    "validated": 1
}
