{
    "additionDate": "2019-11-14T19:28:35Z",
    "biotoolsCURIE": "biotools:VAPPER",
    "biotoolsID": "VAPPER",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "ssilvapereira@medicina.ulisboa.pt",
            "name": "Sara Silva Pereira",
            "orcidid": "https://orcid.org/0000-0002-6590-6626",
            "typeEntity": "Person"
        },
        {
            "email": "a.p.jackson@liverpool.ac.uk",
            "name": "Andrew P Jackson",
            "orcidid": "https://orcid.org/0000-0002-5704-8596",
            "typeEntity": "Person"
        }
    ],
    "description": "High-throughput variant antigen profiling in African trypanosomes of livestock | Variant Antigen Profiling for Trypanosoma congolense and Trypanosoma vivax | Trypanosomes are important human and veterinary parasites that cause potentially lethal blood infections and a chronic wasting disease (African trypanosomiasis). These organisms use antigenic variation to evade the host immune response, for which their genomes contain many hundreds of variable antigen genes. Making sense of this hypervariable repertoire is a major challenge in genome analysis and a bottleneck in vaccine development | the VAPPER code for the first time, please type:",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://github.com/PGB-LIV/VAPPER",
    "language": [
        "Perl",
        "Python"
    ],
    "lastUpdate": "2019-11-14T19:28:35Z",
    "name": "VAPPER",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/GIGASCIENCE/GIZ091",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Background: Analysing variant antigen gene families on a population scale is a difficult challenge for conventional methods of read mapping and variant calling due to the great variability in sequence, copy number, and genomic loci. In African trypanosomes, hemoparasites of humans and animals, this is complicated by variant antigen repertoires containing hundreds of genes subject to various degrees of sequence recombination. Findings: We introduce Variant Antigen Profiler (VAPPER), a tool that allows automated analysis of the variant surface glycoprotein repertoires of the most prevalent livestock African trypanosomes. VAPPER produces variant antigen profiles for any isolate of the veterinary pathogens Trypanosoma congolense and Trypanosoma vivax from genomic and transcriptomic sequencing data and delivers publication-ready figures that show how the queried isolate compares with a database of existing strains. VAPPER is implemented in Python. It can be installed to a local Galaxy instance from the ToolShed (https://toolshed.g2.bx.psu.edu/) or locally on a Linux platform via the command line (https://github.com/PGB-LIV/VAPPER). The documentation, requirements, examples, and test data are provided in the Github repository. Conclusion: By establishing two different, yet comparable methodologies, our approach is the first to allow large-scale analysis of African trypanosome variant antigens, large multi-copy gene families that are otherwise refractory to high-throughput analysis.",
                "authors": [
                    {
                        "name": "Silva Pereira S."
                    },
                    {
                        "name": "Heap J."
                    },
                    {
                        "name": "Jones A.R."
                    },
                    {
                        "name": "Jackson A.P."
                    }
                ],
                "date": "2019-09-18T00:00:00Z",
                "journal": "GigaScience",
                "title": "VAPPER: High-throughput variant antigen profiling in African trypanosomes of livestock"
            },
            "pmcid": "PMC6735694",
            "pmid": "31494667"
        }
    ],
    "topic": [
        {
            "term": "Immunoproteins, genes and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}