{"credit":[{"email":"failmezger@mpipz.mpg.de","name":"Henrik Failmezger","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"Yinyin.Yuan@cancer.org.uk","name":"Yinyin Yuan","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"url":"http://bioconductor.org/packages/release/bioc/html/CRImage.html"}],"download":[{"type":"Source code","url":"http://bioconductor/packages/release/bioc/src/contrib/CRImage_1.22.0.tar.gz"}],"function":[{"operation":[{"term":"Image analysis","uri":"http://edamontology.org/operation_3443"}]}],"labels":{"collectionID":["BioConductor"],"language":["R"],"license":"Artistic-2.0","operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool","Library"],"topic":[{"term":"Imaging","uri":"http://edamontology.org/topic_3382"},{"term":"Cell biology","uri":"http://edamontology.org/topic_2229"},{"term":"Oncology","uri":"http://edamontology.org/topic_2640"}]},"publication":[{"abstract":"Solid tumors are heterogeneous tissues composed of a mixture of cancer and normal cells, which complicates the interpretation of their molecular profiles. Furthermore, tissue architecture is generally not reflected in molecular assays, rendering this rich information underused. To address these challenges, we developed a computational approach based on standard hematoxylin and eosin-stained tissue sections and demonstrated its power in a discovery and validation cohort of 323 and 241 breast tumors, respectively. To deconvolute cellular heterogeneity and detect subtle genomic aberrations, we introduced an algorithm based on tumor cellularity to increase the comparability of copy number profiles between samples. We next devised a predictor for survival in estrogen receptor-negative breast cancer that integrated both image-based and gene expression analyses and significantly outperformed classifiers that use single data types, such as microarray expression signatures. Image processing also allowed us to describe and validate an independent prognostic factor based on quantitative analysis of spatial patterns between stromal cells, which are not detectable by molecular assays. Our quantitative, imagebased method could benefit any large-scale cancer study by refining and complementing molecular assays of tumor samples.","authors":["Yuan Y.","Failmezger H.","Rueda O.M.","Raza Ali H.","Graf S.","Chin S.-F.","Schwarz R.F.","Curtis C.","Dunning M.J.","Bardwell H.","Johnson N.","Doyle S.","Turashvili G.","Provenzano E.","Aparicio S.","Caldas C.","Markowetz F."],"cit_count":159,"doi":"10.1126/scitranslmed.3004330","journal":"Science Translational Medicine","title":"Quantitative image analysis of cellular heterogeneity in breast tumors complements genomic profiling","type":"Other","year":"2012-10-24"}],"summary":{"biotoolsCURIE":"biotools:crimage","biotoolsID":"crimage","description":"This tool provides functionality to process and analyze images, in particular to classify cells in biological images. Furthermore, in the context of tumor images, it provides functionality to calculate tumour cellularity.","homepage":"http://bioconductor.org/packages/release/bioc/html/CRImage.html","name":"CRImage","version":["1.22.0"]}}