{
    "additionDate": "2017-03-24T10:46:33Z",
    "biotoolsCURIE": "biotools:pupasuite",
    "biotoolsID": "pupasuite",
    "description": "Program to calculate accurate MW and pI values from proteins considering the effects of post-translational modifications. Results are displayed as calculated values of pI and MW for each protein and are also plotted on two-dimensional (2D) gel images.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                },
                {
                    "term": "Protein modelling (mutation)",
                    "uri": "http://edamontology.org/operation_0331"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                }
            ]
        }
    ],
    "homepage": "http://pupasuite.bioinfo.cipf.es",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:40Z",
    "name": "PupaSuite",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "We have developed a web tool, PupaSNP Finder (PupaSNP for short), for high-throughput searching for single nucleotide polymorphisms (SNPs) with potential phenotypic effect. PupaSNP takes as its input lists of genes (or generates them from chromosomal coordinates) and retrieves SNPs that could affect the conserved regions that the cellular machinery uses for the correct processing of genes (intron/exon boundaries or exonic splicing enhancers), predicted transcription factor binding sites (TFBS) and changes in amino acids in the proteins. The program uses the mapping of SNPs in the genome provided by Ensembl. Additionally, user-defined SNPs (not yet mapped in the genome) can be easily provided to the program. Also, additional functional information from Gene Ontology, OMIM and homologies in other model organisms is provided. In contrast to other programs already available, which focus only on SNPs with possible effect in the protein, PupaSNP includes SNPs with possible transcriptional effect. PupaSNP will be of significant help in studies of multifactorial disorders, where the use of functional SNPs will increase the sensitivity of identification of the genes responsible for the disease. The PupaSNP web interface is accessible through http://pupasnp.bioinfo.cnio.es. © Oxford University Press 2004; all rights reserved.",
                "authors": [
                    {
                        "name": "Al-Shahrour F."
                    },
                    {
                        "name": "Conde L."
                    },
                    {
                        "name": "Dopazo J."
                    },
                    {
                        "name": "Robledo M."
                    },
                    {
                        "name": "Ruiz-Llorente S."
                    },
                    {
                        "name": "Santoyo J."
                    },
                    {
                        "name": "Vaquerizas J.M."
                    }
                ],
                "citationCount": 79,
                "date": "2004-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PupaSNP Finder: A web tool for finding SNPs with putative effect at transcriptional level"
            },
            "pmid": "15215388"
        },
        {
            "metadata": {
                "abstract": "We have developed a web tool, PupaSuite, for the selection of single nucleotide polymorphisms (SNPs) with potential phenotypic effect, specifically oriented to help in the design of large-scale genotyping projects. PupaSuite uses a collection of data on SNPs from heterogeneous sources and a large number of pre-calculated predictions to offer a flexible and intuitive interface for selecting an optimal set of SNPs. It improves the functionality of PupaSNP and PupasView programs and implements new facilities such as the analysis of user's data to derive haplotypes with functional information. A new estimator of putative effect of polymorphisms has been included that uses evolutionary information. Also SNPeffect database predictions have been included. The PupaSuite web interface is accessible through http://pupasuite.bioinfo.cipf.es and through http://www.pupasnp.org. © The Author 2006. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Arbiza L."
                    },
                    {
                        "name": "Conde L."
                    },
                    {
                        "name": "Dopazo H."
                    },
                    {
                        "name": "Dopazo J."
                    },
                    {
                        "name": "Reumers J."
                    },
                    {
                        "name": "Rousseau F."
                    },
                    {
                        "name": "Schymkowitz J."
                    },
                    {
                        "name": "Vaquerizas J.M."
                    }
                ],
                "citationCount": 186,
                "date": "2006-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PupaSuite: Finding functional single nucleotide polymorphisms for large-scale genotyping purposes"
            },
            "pmid": "16845085"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
