{"credit":[{"email":"emaldonado@ciimar.up.pt","name":"Emanuel Maldonado","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://impact-s.sourceforge.net/"},{"email":"aantunes@ciimar.up.pt","name":"Agostinho Antunes","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://impact-s.sourceforge.net/"}],"documentation":[{"url":"http://impact-s.sourceforge.net/IMPACT_S_Tutorial.pdf"}],"function":[{"operation":[{"term":"Structure analysis","uri":"http://edamontology.org/operation_2480"}]}],"labels":{"language":["Java"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Desktop application"],"topic":[{"term":"Molecular modelling","uri":"http://edamontology.org/topic_2275"},{"term":"Protein structure analysis","uri":"http://edamontology.org/topic_2814"},{"term":"Data management","uri":"http://edamontology.org/topic_3071"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/impact_s-integrated-multiprogram-platform-to-analyze-and-combine-tests-of-selection.html"}],"publication":[{"abstract":"© 2014 Maldonado et al. Among the major goals of research in evolutionary biology are the identification of genes targeted by natural selection and understanding how various regimes of evolution affect the fitness of an organism. In particular, adaptive evolution enables organisms to adapt to changing ecological factors such as diet, temperature, habitat, predatory pressures and prey abundance. An integrative approach is crucial for the identification of non-synonymous mutations that introduce radical changes in protein biochemistry and thus in turn influence the structure and function of proteins. Performing such analyses manually is often a time-consuming process, due to the large number of statistical files generated from multiple approaches, especially when assessing numerous taxa and/or large datasets. We present IMPACT-S, an easy-to-use Graphical User Interface (GUI) software, which rapidly and effectively integrates, filters and combines results from three widely used programs for assessing the influence of selection: Codeml (PAML package), Datamonkey and TreeSAAP. It enables the identification and tabulation of sites detected by these programs as evolving under the influence of positive, neutral and/or negative selection in protein-coding genes. IMPACT-S further facilitates the automatic mapping of these sites onto the three-dimensional structures of proteins. Other useful tools incorporated in IMPACT-S include Jmol, Archaeopteryx, Gnuplot, PhyML, a built-in Swiss-Model interface and a PDB downloader. The relevance and functionality of IMPACT-S is shown through a case study on the toxicoferan-reptilian Cysteine-rich Secretory Proteins (CRiSPs). IMPACT-S is a platform-independent software released under GPLv3 license, freely available online from http://impact-s.sourceforge.net. Copyright:","authors":["Maldonado E.","Sunagar K.","Almeida D.","Vasconcelos V.","Antunes A."],"cit_count":8,"journal":"PLoS ONE","pmid":"25329307","title":"IMPACT_S: Integrated Multiprogram Platform to Analyze and Combine Tests of Selection","year":"2014-10-20"}],"summary":{"biotoolsCURIE":"biotools:impact_s","biotoolsID":"impact_s","description":"Java swing based Graphical User Interface program for analyzing and/or combining several selection results from programs like, PAML (codeml), Datamonkey, TreeSAAP. Provides 3D homology modeling through Swiss Model and 3D mapping of selection results through Jmol.","homepage":"http://impact-s.sourceforge.net/","name":"IMPACT_S"}}