{
    "additionDate": "2018-06-30T16:18:03Z",
    "biotoolsCURIE": "biotools:scepath",
    "biotoolsID": "scepath",
    "credit": [
        {
            "email": "qnie@uci.edu",
            "name": "Qing Nie",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Energy landscape-based inference of transition probabilities and cellular trajectories from single-cell transcriptomic data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/sqjin/scEpath"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA-Seq analysis",
                    "uri": "http://edamontology.org/operation_3680"
                }
            ]
        }
    ],
    "homepage": "https://github.com/sqjin/scEpath",
    "language": [
        "R",
        "MATLAB"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "scEpath",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/bty058",
            "metadata": {
                "abstract": "© The Author(s) 2018.Motivation Single-cell RNA-sequencing (scRNA-seq) offers unprecedented resolution for studying cellular decision-making processes. Robust inference of cell state transition paths and probabilities is an important yet challenging step in the analysis of these data. Results Here we present scEpath, an algorithm that calculates energy landscapes and probabilistic directed graphs in order to reconstruct developmental trajectories. We quantify the energy landscape using single-cell energy' and distance-based measures, and find that the combination of these enables robust inference of the transition probabilities and lineage relationships between cell states. We also identify marker genes and gene expression patterns associated with cell state transitions. Our approach produces pseudotemporal orderings that are - in combination - more robust and accurate than current methods, and offers higher resolution dynamics of the cell state transitions, leading to new insight into key transition events during differentiation and development. Moreover, scEpath is robust to variation in the size of the input gene set, and is broadly unsupervised, requiring few parameters to be set by the user. Applications of scEpath led to the identification of a cell-cell communication network implicated in early human embryo development, and novel transcription factors important for myoblast differentiation. scEpath allows us to identify common and specific temporal dynamics and transcriptional factor programs along branched lineages, as well as the transition probabilities that control cell fates. Availability and implementation A MATLAB package of scEpath is available at https://github.com/sqjin/scEpath. Supplementary informationSupplementary dataare available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Jin S."
                    },
                    {
                        "name": "Maclean A.L."
                    },
                    {
                        "name": "Peng T."
                    },
                    {
                        "name": "Nie Q."
                    }
                ],
                "citationCount": 24,
                "date": "2018-06-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "ScEpath: Energy landscape-based inference of transition probabilities and cellular trajectories from single-cell transcriptomic data"
            }
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}