{
    "name": "G2D", 
    "description": "Scans a human genomic region for genes related to an inherited disease. The server also presents precomputed candidate genes for more than 600 genetically inherited diseases that have been mapped onto chromosomal regions without assignment of a particular gene.", 
    "homepage": "http://www.ogic.ca/projects/g2d_2/", 
    "biotoolsID": "g2d", 
    "biotoolsCURIE": "biotools:g2d", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3209", 
                    "term": "Genome comparison"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0487", 
                    "term": "Haplotype mapping"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0527", 
                    "term": "Sequence tag mapping"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0282", 
                    "term": "Genetic mapping"
                }, 
                {
                    "uri": "http://edamontology.org/operation_2429", 
                    "term": "Mapping"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0102", 
            "term": "Mapping"
        }, 
        {
            "uri": "http://edamontology.org/topic_0634", 
            "term": "Pathology"
        }, 
        {
            "uri": "http://edamontology.org/topic_3053", 
            "term": "Genetics"
        }, 
        {
            "uri": "http://edamontology.org/topic_2815", 
            "term": "Humans"
        }, 
        {
            "uri": "http://edamontology.org/topic_0654", 
            "term": "DNA"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "http://g2d2.ogic.ca/info/tutorial.html", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "16757574", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Computational disease gene identification: A concert of methods prioritizes type 2 diabetes and obesity candidate genes", 
                "abstract": "Genome-wide experimental methods to identify disease genes, such as linkage analysis and association studies, generate increasingly large candidate gene sets for which comprehensive empirical analysis is impractical. Computational methods employ data from a variety of sources to identify the most likely candidate disease genes from these gene sets. Here, we review seven independent computational disease gene prioritization methods, and then apply them in concert to the analysis of 9556 positional candidate genes for type 2 diabetes (T2D) and the related trait obesity. We generate and analyse a list of nine primary candidate genes for T2D genes and five for obesity. Two genes, LPL and BCKDHA, are common to these two sets. We also present a set of secondary candidates for T2D (94 genes) and for obesity (116 genes) with 58 genes in common to both diseases. © 2006 Oxford University Press.", 
                "date": "2006-10-17T00:00:00Z", 
                "citationCount": 112, 
                "authors": [
                    {
                        "name": "Tiffin N."
                    }, 
                    {
                        "name": "Adie E."
                    }, 
                    {
                        "name": "Turner F."
                    }, 
                    {
                        "name": "Brunner H.G."
                    }, 
                    {
                        "name": "van Driel M.A."
                    }, 
                    {
                        "name": "Oti M."
                    }, 
                    {
                        "name": "Lopez-Bigas N."
                    }, 
                    {
                        "name": "Ouzounis C."
                    }, 
                    {
                        "name": "Perez-Iratxeta C."
                    }, 
                    {
                        "name": "Andrade-Navarro M.A."
                    }, 
                    {
                        "name": "Adeyemo A."
                    }, 
                    {
                        "name": "Patti M.E."
                    }, 
                    {
                        "name": "Semple C.M."
                    }, 
                    {
                        "name": "Hide W."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }, 
        {
            "doi": null, 
            "pmid": "16115313", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "G2D: A tool for mining genes associated with disease", 
                "abstract": "Background: Human inherited diseases can be associated by genetic linkage with one or more genomic regions. The availability of the complete sequence of the human genome allows examining those locations for an associated gene. We previously developed an algorithm to prioritize genes on a chromosomal region according to their possible relation to an inherited disease using a combination of data mining on biomedical databases and gene sequence analysis. Results: We have implemented this method as a web application in our site G2D (Genes to Diseases). It allows users to inspect any region of the human genome to find candidate genes related to a genetic disease of their interest. In addition, the G2D server includes pre-computed analyses of candidate genes for 552 linked monogenic diseases without an associated gene, and the analysis of 18 asthma loci. Conclusion: G2D can be publicly accessed at http://www.ogic.ca/projects/ g2d_2/. © 2005 Perez-Iratxeta et al; licensee BioMed Central Ltd.", 
                "date": "2005-08-22T00:00:00Z", 
                "citationCount": 120, 
                "authors": [
                    {
                        "name": "Perez-Iratxeta C."
                    }, 
                    {
                        "name": "Wjst M."
                    }, 
                    {
                        "name": "Bork P."
                    }, 
                    {
                        "name": "Andrade M.A."
                    }
                ], 
                "journal": "BMC Genetics"
            }
        }, 
        {
            "doi": null, 
            "pmid": "12006977", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Association of genes to genetically inherited diseases using data mining", 
                "abstract": "Although approximately one-quarter of the roughly 4,000 genetically inherited diseases currently recorded in respective databases (LocusLink1, OMIM2) are already linked to a region of the human genome, about 450 have no known associated gene. Finding disease-related genes requires laborious examination of hundreds of possible candidate genes (sometimes, these are not even annotated; see, for example, refs 3,4). The public availability of the human genome5 draft sequence has fostered new strategies to map molecular functional features of gene products to complex phenotypic descriptions, such as those of genetically inherited diseases. Owing to recent progress in the systematic annotation of genes using controlled vocabularies6, we have developed a scoring system for the possible functional relationships of human genes to 455 genetically inherited diseases that have been mapped to chromosomal regions without assignment of a particular gene. In a benchmark of the system with 100 known disease-associated genes, the disease-associated gene was among the 8 best-scoring genes with a 25% chance, and among the best 30 genes with a 50% chance, showing that there is a relationship between the score of a gene and its likelihood of being associated with a particular disease. The scoring also indicates that for some diseases, the chance of identifying the underlying gene is higher.", 
                "date": "2002-07-01T00:00:00Z", 
                "citationCount": 261, 
                "authors": [
                    {
                        "name": "Perez-Iratxeta C."
                    }, 
                    {
                        "name": "Bork P."
                    }, 
                    {
                        "name": "Andrade M.A."
                    }
                ], 
                "journal": "Nature Genetics"
            }
        }, 
        {
            "doi": null, 
            "pmid": "17478516", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Update of the G2D tool for prioritization of gene candidates to inherited diseases", 
                "abstract": "G2D (genes to diseases) is a web resource for prioritizing genes as candidates for inherited diseases. It uses three algorithms based on different prioritization strategies. The input to the server is the genomic region where the user is looking for the disease-causing mutation, plus an additional piece of information depending on the algorithm used. This information can either be the disease phenotype (described as an online Mendelian inheritance in man (OMIM) identifier), one or several genes known or suspected to be associated with the disease (defined by their Entrez Gene identifiers), or a second genomic region that has been linked as well to the disease. In the latter case, the tool uses known or predicted interactions between genes in the two regions extracted from the STRING database. The output in every case is an ordered list of candidate genes in the region of interest. For the first two of the three methods, the candidate genes are first retrieved through sequence homology search, then scored accordingly to the corresponding method. This means that some of them will correspond to well-known characterized genes, and others will overlap with predicted genes, thus providing a wider analysis. G2D is publicly available at http://www.ogic.ca/projects/g2d-2/. © 2007 The Author(s).", 
                "date": "2007-07-01T00:00:00Z", 
                "citationCount": 52, 
                "authors": [
                    {
                        "name": "Perez-Iratxeta C."
                    }, 
                    {
                        "name": "Bork P."
                    }, 
                    {
                        "name": "Andrade-Navarro M.A."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }
    ], 
    "credit": [
        {
            "name": "Support", 
            "email": "cperez-iratxeta@ohri.ca", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "ELIXIR-EE", 
    "additionDate": "2017-02-10T14:15:28Z", 
    "lastUpdate": "2018-12-10T12:58:57Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}