{
    "additionDate": "2023-02-26T12:52:47.290095Z",
    "biotoolsCURIE": "biotools:acorn",
    "biotoolsID": "acorn",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "description": "Clinically Oriented antimicrobial Resistance surveillance Network (ACORN) as a lightweight but comprehensive platform, in which we combine clinical data collection with diagnostic stewardship, microbiological data collection and visualisation of the linked clinical-microbiology dataset.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Antimicrobial resistance prediction",
                    "uri": "http://edamontology.org/operation_3482"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://acornamr.net",
    "lastUpdate": "2024-11-24T14:57:41.334387Z",
    "license": "CC-BY-4.0",
    "name": "ACORN",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.12688/WELLCOMEOPENRES.18317.1",
            "metadata": {
                "abstract": "Background: Case-based surveillance of antimicrobial resistance (AMR) provides more actionable data than isolate- or sample-based surveillance. We developed A Clinically Oriented antimicrobial Resistance surveillance Network (ACORN) as a lightweight but comprehensive platform, in which we combine clinical data collection with diagnostic stewardship, microbiological data collection and visualisation of the linked clinical-microbiology dataset. Data are compatible with WHO GLASS surveillance and can be stratified by syndrome and other metadata. Summary metrics can be visualised and fed back directly for clinical decision-making and to inform local treatment guidelines and national policy. Methods: An ACORN pilot was implemented in three hospitals in Southeast Asia (1 paediatric, 2 general) to collect clinical and microbiological data from patients with community- or hospital-acquired pneumonia, sepsis, or meningitis. The implementation package included tools to capture site and laboratory capacity information, guidelines on diagnostic stewardship, and a web-based data visualisation and analysis platform. Results: Between December 2019 and October 2020, 2294 patients were enrolled with 2464 discrete infection episodes (1786 community-acquired, 518 healthcare-associated and 160 hospital-acquired). Overall, 28-day mortality was 8.7%. Third generation cephalosporin resistance was identified in 54.2% (39/72) of E. coli and 38.7% (12/31) of K. pneumoniae isolates. Almost a quarter of S. aureus isolates were methicillin resistant (23.0%, 14/61). 290/2464 episodes could be linked to a pathogen, highlighting the level of enrolment required to achieve an acceptable volume of isolate data. However, the combination with clinical metadata allowed for more nuanced interpretation and immediate feedback of results. Conclusions: ACORN was technically feasible to implement and acceptable at site level. With minor changes from lessons learned during the pilot ACORN is now being scaled up and implemented in 15 hospitals in 9 low- and middle-income countries to generate sufficient case-based data to determine incidence, outcomes, and susceptibility of target pathogens among patients with infectious syndromes.",
                "authors": [
                    {
                        "name": "Ashley E.A."
                    },
                    {
                        "name": "Celhay O."
                    },
                    {
                        "name": "Chansamouth V."
                    },
                    {
                        "name": "Chommanam D."
                    },
                    {
                        "name": "Dang V.D."
                    },
                    {
                        "name": "Do T.K.Y."
                    },
                    {
                        "name": "Dong P.K."
                    },
                    {
                        "name": "Douangnouvong A."
                    },
                    {
                        "name": "Hamers R.L."
                    },
                    {
                        "name": "Keoluangkhot V."
                    },
                    {
                        "name": "Kim N.H."
                    },
                    {
                        "name": "Lem M."
                    },
                    {
                        "name": "Ling C."
                    },
                    {
                        "name": "Miliya T."
                    },
                    {
                        "name": "Ngoun C."
                    },
                    {
                        "name": "Nguyen H.K."
                    },
                    {
                        "name": "Nguyen H.L."
                    },
                    {
                        "name": "Nguyen T.K.T."
                    },
                    {
                        "name": "Ninh T.N."
                    },
                    {
                        "name": "Pham N.T."
                    },
                    {
                        "name": "Prak S."
                    },
                    {
                        "name": "Rassavong K."
                    },
                    {
                        "name": "Roberts T."
                    },
                    {
                        "name": "Sayarath M."
                    },
                    {
                        "name": "Soputhy C."
                    },
                    {
                        "name": "Soumphonphakdy B."
                    },
                    {
                        "name": "Ta Thi Dieu N."
                    },
                    {
                        "name": "Thanadabouth K."
                    },
                    {
                        "name": "Tran V.B."
                    },
                    {
                        "name": "Turner P."
                    },
                    {
                        "name": "Van D.T."
                    },
                    {
                        "name": "Vongphachanh S."
                    },
                    {
                        "name": "Vongsouvath M."
                    },
                    {
                        "name": "Vu M.D."
                    },
                    {
                        "name": "Vu T.V.D."
                    },
                    {
                        "name": "Waithira N."
                    },
                    {
                        "name": "Wannapinij P."
                    },
                    {
                        "name": "van Doorn H.R."
                    }
                ],
                "citationCount": 2,
                "date": "2022-01-01T00:00:00Z",
                "journal": "Wellcome Open Research",
                "title": "A Clinically Oriented antimicrobial Resistance surveillance Network (ACORN): pilot implementation in three countries in Southeast Asia, 2019-2020"
            }
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        },
        {
            "term": "Paediatrics",
            "uri": "http://edamontology.org/topic_3418"
        }
    ]
}
