{
    "additionDate": "2021-01-18T10:47:00Z",
    "biotoolsCURIE": "biotools:cmnpd",
    "biotoolsID": "cmnpd",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "liangren@bjmu.edu.cn",
            "name": "Liangren Zhang",
            "typeEntity": "Person"
        },
        {
            "email": "zmliu@bjmu.edu.cn",
            "name": "Zhenming Liu",
            "typeEntity": "Person"
        }
    ],
    "description": "CMNPD is the comprehensive marine natural products database based on manually curated data. CMNPD currently contains more than 31 000 chemical entities with various physicochemical and pharmacokinetic properties, standardized biological activity data, systematic taxonomy and geographical distribution of source organisms, and detailed literature citations. It is an integrated platform for structure dereplication (assessment of novelty) of (marine) natural products, discovery of lead compounds, data mining of structure-activity relationships and investigation of chemical ecology.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Relation extraction",
                    "uri": "http://edamontology.org/operation_3625"
                },
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                }
            ]
        }
    ],
    "homepage": "https://www.cmnpd.org",
    "lastUpdate": "2024-11-24T20:43:50.398531Z",
    "name": "CMNPD",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/nar/gkaa763",
            "metadata": {
                "abstract": "Marine organisms are expected to be an important source of inspiration for drug discovery after terrestrial plants and microorganisms. Despite the remarkable progress in the field of marine natural products (MNPs) chemistry, there are only a few open access databases dedicated to MNPs research. To meet the growing demand for mining and sharing for MNPs-related data resources, we developed CMNPD, a comprehensive marine natural products database based on manually curated data. CMNPD currently contains more than 31 000 chemical entities with various physicochemical and pharmacokinetic properties, standardized biological activity data, systematic taxonomy and geographical distribution of source organisms, and detailed literature citations. It is an integrated platform for structure dereplication (assessment of novelty) of (marine) natural products, discovery of lead compounds, data mining of structure-activity relationships and investigation of chemical ecology. Access is available through a user-friendly web interface at https://www.cmnpd.org. We are committed to providing a free data sharing platform for not only professional MNPs researchers but also the broader scientific community to facilitate drug discovery from the ocean.",
                "authors": [
                    {
                        "name": "Chen T."
                    },
                    {
                        "name": "Liu N."
                    },
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Lyu C."
                    },
                    {
                        "name": "Qiang B."
                    },
                    {
                        "name": "Wang H."
                    },
                    {
                        "name": "Zhang L."
                    }
                ],
                "citationCount": 122,
                "date": "2021-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "CMNPD: A comprehensive marine natural products database towards facilitating drug discovery from the ocean"
            },
            "pmcid": "PMC7779072",
            "pmid": "32986829"
        }
    ],
    "topic": [
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        },
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ]
}
