
{
    "credit": [
        {
            "email": "cedric.notredame@europe.com",
            "name": "Cedric Notredame",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://tcoffee.crg.cat/apps/tcoffee/tutorial.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Pairwise sequence alignment",
                    "uri": "http://edamontology.org/operation_0491"
                },
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                },
                {
                    "term": "Pairwise structure alignment",
                    "uri": "http://edamontology.org/operation_0503"
                },
                {
                    "term": "RNA secondary structure alignment",
                    "uri": "http://edamontology.org/operation_0502"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Perl"
        ],
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Functional, regulatory and non-coding RNA",
                "uri": "http://edamontology.org/topic_0659"
            },
            {
                "term": "Nucleic acid structure analysis",
                "uri": "http://edamontology.org/topic_0097"
            },
            {
                "term": "Structure prediction",
                "uri": "http://edamontology.org/topic_0082"
            },
            {
                "term": "RNA",
                "uri": "http://edamontology.org/topic_0099"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            }
        ]
    },
    "publication": [
        {
            "abstract": "The R-Coffee web server produces highly accurate multiple alignments of noncoding RNA (ncRNA) sequences, taking into account predicted secondary structures. R-Coffee uses a novel algorithm recently incorporated in the T-Coffee package. R-Coffee works along the same lines as T-Coffee: it uses pairwise or multiple sequence alignment (MSA) methods to compute a primary library of input alignments. The program then computes an MSA highly consistent with both the alignments contained in the library and the secondary structures associated with the sequences. The secondary structures are predicted using RNAplfold. The server provides two modes. The slow/accurate mode is restricted to small datasets (less than 5 sequences less than 150 nucleotides) and combines R-Coffee with Consan, a very accurate pairwise RNA alignment method. For larger datasets a fast method can be used (RM-Coffee mode), that uses R-Coffee to combine the output of the three packages which combines the outputs from programs found to perform best on RNA (MUSCLE, MAFFT and ProbConsRNA). Our BRAliBase benchmarks indicate that the R-Coffee/Consan combination is one of the best ncRNA alignment methods for short sequences, while the RM-Coffee gives comparable results on longer sequences. The R-Coffee web server is available at http://www.tcoffee.org.",
            "authors": [
                "Moretti S.",
                "Wilm A.",
                "Higgins D.G.",
                "Xenarios I.",
                "Notredame C."
            ],
            "cit_count": 43,
            "journal": "Nucleic acids research",
            "pmid": "18483080",
            "title": "R-Coffee: a web server for accurately aligning noncoding RNA sequences.",
            "year": "2008-01-01"
        },
        {
            "abstract": "R-Coffee is a multiple RNA alignment package, derived from T-Coffee, designed to align RNA sequences while exploiting secondary structure information. R-Coffee uses an alignment-scoring scheme that incorporates secondary structure information within the alignment. It works particularly well as an alignment improver and can be combined with any existing sequence alignment method. In this work, we used R-Coffee to compute multiple sequence alignments combining the pairwise output of sequence aligners and structural aligners. We show that R-Coffee can improve the accuracy of all the sequence aligners. We also show that the consistency-based component of T-Coffee can improve the accuracy of several structural aligners. R-Coffee was tested on 388 BRAliBase reference datasets and on 11 longer Cmfinder datasets. Altogether our results suggest that the best protocol for aligning short sequences (less than 200 nt) is the combination of R-Coffee with the RNA pairwise structural aligner Consan. We also show that the simultaneous combination of the four best sequence alignment programs with R-Coffee produces alignments almost as accurate as those obtained with R-Coffee/ Consan. Finally, we show that R-Coffee can also be used to align longer datasets beyond the usual scope of structural aligners. R-Coffee is freely available for download, along with documentation, from the T-Coffee web site (www.tcoffee.org). © 2008 The Author(s).",
            "authors": [
                "Wilm A.",
                "Higgins D.G.",
                "Notredame C."
            ],
            "cit_count": 78,
            "journal": "Nucleic Acids Research",
            "pmid": "18420654",
            "title": "R-Coffee: A method for multiple alignment of non-coding RNA",
            "year": "2008-05-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:r-coffee",
        "biotoolsID": "r-coffee",
        "description": "The R-Coffee web server uses pairwise or multiple sequence alignment methods to produce multiple alignments of non-coding RNA sequences, incorporating predicted or known secondary structures.",
        "homepage": "http://tcoffee.crg.cat/apps/tcoffee/do:rcoffee",
        "name": "R-Coffee"
    }
}