{
    "accessibility": "Open access",
    "additionDate": "2022-02-15T21:19:08.800504Z",
    "biotoolsCURIE": "biotools:multimarker",
    "biotoolsID": "multimarker",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "silvia.dangelo@ucd.ie",
            "name": "Silvia D’Angelo",
            "orcidid": "https://orcid.org/0000-0003-3541-6797",
            "typeEntity": "Person"
        },
        {
            "name": "Aoife E. McNamara"
        },
        {
            "name": "Isobel Claire Gormley"
        },
        {
            "name": "Lorraine Brennan"
        }
    ],
    "description": "multiMarker is a web application that infers the relationship between biomarker and food quantity data from an intervention study, and allows prediction of food intake when only biomarker data are available. Additionally, multiMarker provides quantification of the uncertainty in intake predictions.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://adiet.shinyapps.io/multiMarker/",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-02-15T21:19:08.803079Z",
    "name": "multiMarker",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04394-Z",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Metabolomic biomarkers offer potential for objective and reliable food intake assessment, and there is growing interest in using biomarkers in place of or with traditional self-reported approaches. Ongoing research suggests that multiple biomarkers are associated with single foods, offering great sensitivity and specificity. However, currently there is a dearth of methods to model the relationship between multiple biomarkers and single food intake measurements. Results: Here, we introduce multiMarker, a web-based application based on the homonymous R package, that enables one to infer the relationship between food intake and two or more metabolomic biomarkers. Furthermore, multiMarker allows prediction of food intake from biomarker data alone. multiMarker differs from previous approaches by providing distributions of predicted intakes, directly accounting for uncertainty in food intake quantification. Usage of both the R package and the web application is demonstrated using real data concerning three biomarkers for orange intake. Further, example data is pre-loaded in the web application to enable users to examine multiMarker’s functionality. Conclusion: The proposed software advance the field of Food Intake Biomarkers providing researchers with a novel tool to perform continuous food intake quantification, and to assess its associated uncertainty, from multiple biomarkers. To facilitate widespread use of the framework, multiMarker has been implemented as an R package and a Shiny web application.",
                "authors": [
                    {
                        "name": "Brennan L."
                    },
                    {
                        "name": "D'Angelo S."
                    },
                    {
                        "name": "Gormley I.C."
                    },
                    {
                        "name": "McNamara A.E."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "multiMarker: software for modelling and prediction of continuous food intake using multiple biomarkers measurements"
            },
            "pmcid": "PMC8480054",
            "pmid": "34583648"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Nutritional science",
            "uri": "http://edamontology.org/topic_3390"
        }
    ]
}
