{
    "additionDate": "2022-11-03T08:17:54.508937Z",
    "biotoolsCURIE": "biotools:frtpred",
    "biotoolsID": "frtpred",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jlee@kias.re.kr",
            "name": "Jooyoung Lee"
        },
        {
            "email": "bala2022@skku.edu",
            "name": "Balachandran Manavalan",
            "orcidid": "https://orcid.org/0000-0003-0697-9419"
        }
    ],
    "description": "FRTpred, simultaneously predicts the logarithmic protein folding rate constant, ln(kf), and folding type from the provided sequence.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Protein folding analysis",
                    "uri": "http://edamontology.org/operation_2415"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "http://thegleelab.org/FRTpred",
    "lastUpdate": "2024-11-24T15:23:56.605368Z",
    "license": "Not licensed",
    "name": "FRTpred",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/j.compbiomed.2022.105911",
            "metadata": {
                "abstract": "Protein folding rate is an important property that is essential for understanding the protein folding process and is helpful for designing proteins. Predicting such properties from either sequence or structural information is a challenging task in bioinformatics. Although several computational methods have been developed in the past, only one sequence-based method is publicly available that shows limited accuracy when evaluated using a standardized independent dataset. This study proposes a novel approach, called FRTpred, that simultaneously predicts the logarithmic protein folding rate constant, ln(kf), and folding type from the provided sequence. First, 30 baseline models (regression models for ln(kf) and classification models for folding type) were constructed by integrating 10 representative feature extraction methods and three commonly used machine-learning algorithms. Subsequently, the predicted values of the 30 baseline models were combined and inputted into the random forest algorithm to construct the final prediction model. Cross-validation analysis showed that FRTpred achieved mean absolute deviations of 1.491, 2.016, and 1.954 for non-two-state, two-state, and combined models, respectively, when predicting ln(kf). Moreover, FRTpred predicts the folding type with an accuracy of 0.843. Performance comparisons based on independent tests against existing methods showed that FRTpred is more precise for both ln(kf) and folding type prediction. Thus, FRTpred is a powerful tool that may accelerate the characterization of the foldomics protein data and further inspire the development of next-generation predictors. The proposed model is available in the form of a web server that is freely accessible at http://thegleelab.org/FRTpred.",
                "authors": [
                    {
                        "name": "Lee J."
                    },
                    {
                        "name": "Manavalan B."
                    }
                ],
                "citationCount": 7,
                "date": "2022-10-01T00:00:00Z",
                "journal": "Computers in Biology and Medicine",
                "title": "FRTpred: A novel approach for accurate prediction of protein folding rate and type"
            },
            "pmid": "36096036"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}
