{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"https://groups.google.com/forum/#!forum/skat_slee"}],"documentation":[{"type":"GENERAL","url":"https://cran.r-project.org/web/packages/SKAT/SKAT.pdf"}],"function":[{"operation":[{"term":"Mapping","uri":"http://edamontology.org/operation_2429"}]}],"labels":{"collectionID":["Animal and Crop Genomics"],"language":["R"],"license":"GPL-3.0","operatingSystem":["Linux","Windows","Mac"],"toolType":["Plug-in"],"topic":[{"term":"GWAS study","uri":"http://edamontology.org/topic_3517"}]},"publication":[{"abstract":"Recent developments in sequencing technologies have made it possible to uncover both rare and common genetic variants. Genome-wide association studies (GWASs) can test for the effect of common variants, whereas sequence-based association studies can evaluate the cumulative effect of both rare and common variants on disease risk. Many groupwise association tests, including burden tests and variance-component tests, have been proposed for this purpose. Although such tests do not exclude common variants from their evaluation, they focus mostly on testing the effect of rare variants by upweighting rare-variant effects and downweighting common-variant effects and can therefore lose substantial power when both rare and common genetic variants in a region influence trait susceptibility. There is increasing evidence that the allelic spectrum of risk variants at a given locus might include novel, rare, low-frequency, and common genetic variants. Here, we introduce several sequence kernel association tests to evaluate the cumulative effect of rare and common variants. The proposed tests are computationally efficient and are applicable to both binary and continuous traits. Furthermore, they can readily combine GWAS and whole-exome-sequencing data on the same individuals, when available, and are also applicable to deep-resequencing data of GWAS loci. We evaluate these tests on data simulated under comprehensive scenarios and show that compared with the most commonly used tests, including the burden and variance-component tests, they can achieve substantial increases in power. We next show applications to sequencing studies for Crohn disease and autism spectrum disorders. The proposed tests have been incorporated into the software package SKAT. © 2013 The American Society of Human Genetics.","authors":["Ionita-Laza I.","Lee S.","Makarov V.","Buxbaum J.D.","Lin X."],"cit_count":171,"doi":"10.1016/j.ajhg.2013.04.015","journal":"American Journal of Human Genetics","title":"Sequence kernel association tests for the combined effect of rare and common variants","type":"Primary","year":"2013-06-06"}],"summary":{"biotoolsCURIE":"biotools:skat","biotoolsID":"skat","description":"A SNP-set (e.g., a gene or a region) level test for association between a set of rare (or common) variants and dichotomous or quantitative phenotypes, SKAT aggregates individual score test statistics of SNPs in a SNP set and computes SNP-set level p-values, e.g. a gene or a region level p-value, while adjusting for covariates, such as principal components to account for population stratification. SKAT also allows for power/sample size calculations for designing for sequence association studies.","homepage":"https://www.hsph.harvard.edu/skat/","name":"SKAT"}}