{
    "additionDate": "2021-03-19T08:27:09Z",
    "biotoolsCURIE": "biotools:fadu",
    "biotoolsID": "fadu",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jdhotopp@som.umaryland.edu",
            "name": "Julie C. Dunning Hotopp",
            "orcidid": "https://orcid.org/0000-0003-3862-986X",
            "typeEntity": "Person"
        }
    ],
    "description": "A Quantification Tool for Prokaryotic Transcriptomic Analyses.\n\nMost current available quantification tools for transcriptomics analyses have been designed using human data sets, in which full-length transcript sequences are available. \nIn most prokaryotic systems, full-length transcript sequences are unavailable, causing prokaryotic transcriptomics analyses being performed using coding sequences instead. In contrast to eukaryotes, prokaryotes contain polycistronic transcripts and when genes are quantified based on coding sequences instead of transcript sequences, this leads to an increased abundance of ambiguous multi-gene fragments, especially between genes in operons.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Labeled quantification",
                    "uri": "http://edamontology.org/operation_3635"
                },
                {
                    "term": "Operon drawing",
                    "uri": "http://edamontology.org/operation_0579"
                },
                {
                    "term": "Operon prediction",
                    "uri": "http://edamontology.org/operation_0435"
                },
                {
                    "term": "RNA-Seq quantification",
                    "uri": "http://edamontology.org/operation_3800"
                }
            ]
        }
    ],
    "homepage": "https://github.com/IGS/FADU",
    "language": [
        "Julia",
        "Shell"
    ],
    "lastUpdate": "2021-03-22T11:22:18Z",
    "license": "MIT",
    "name": "FADU",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1128/MSYSTEMS.00917-20",
            "metadata": {
                "abstract": "Copyright © 2021 Chung et al. This is an open-access article distributed under the terms of the Creative Commons Attribution 4.0 International license.Quantification tools for RNA sequencing (RNA-Seq) analyses are often designed and tested using human transcriptomics data sets, in which full-length transcript sequences are well annotated. For prokaryotic transcriptomics experiments, full-length transcript sequences are seldom known, and coding sequences must instead be used for quantification steps in RNA-Seq analyses. However, operons confound accurate quantification of coding sequences since a single transcript does not necessarily equate to a single gene. Here, we introduce FADU (Feature Aggregate Depth Utility), a quantification tool designed specifically for prokaryotic RNA-Seq analyses. FADU assigns partial count values proportional to the length of the fragment overlapping the target feature. To assess the ability of FADU to quantify genes in prokaryotic transcriptomics analyses, we compared its performance to those of eXpress, featureCounts, HTSeq, kallisto, and Salmon across three paired-end read data sets of (i) Ehrlichia chaffeensis, (ii) Escherichia coli, and (iii) the Wolbachia endosymbiont wBm. Across each of the three data sets, we find that FADU can more accurately quantify operonic genes by deriving proportional counts for multigene fragments within operons. FADU is available at https://github.com/IGS/FADU. IMPORTANCE Most currently available quantification tools for transcriptomics analyses have been designed for human data sets, in which full-length transcript sequences, including the untranslated regions, are well annotated. In most prokaryotic systems, full-length transcript sequences have yet to be characterized, leading to prokaryotic transcriptomics analyses being performed based on only the coding sequences. In contrast to eukaryotes, prokaryotes contain polycistronic transcripts, and when genes are quantified based on coding sequences instead of transcript sequences, this leads to an increased abundance of improperly assigned ambiguous multigene fragments, specifically those mapping to multiple genes in operons. Here, we describe FADU, a quantification tool for prokaryotic RNA-Seq analyses designed to assign proportional counts with the purpose of better quantifying operonic genes while minimizing the pitfalls associated with improperly assigning fragment counts from ambiguous transcripts.",
                "authors": [
                    {
                        "name": "Adkins R.S."
                    },
                    {
                        "name": "Bradwell K.R."
                    },
                    {
                        "name": "Chung M."
                    },
                    {
                        "name": "Dunning Hotopp J.C."
                    },
                    {
                        "name": "Fraser C.M."
                    },
                    {
                        "name": "Mahurkar A."
                    },
                    {
                        "name": "Mattick J.S.A."
                    },
                    {
                        "name": "Rasko D.A."
                    },
                    {
                        "name": "Sadzewicz L."
                    },
                    {
                        "name": "Shetty A.C."
                    },
                    {
                        "name": "Tallon L.J."
                    }
                ],
                "citationCount": 2,
                "date": "2021-01-12T00:00:00Z",
                "journal": "mSystems",
                "title": "FADU: A quantification tool for prokaryotic transcriptomic analyses"
            },
            "pmcid": "PMC7901478",
            "pmid": "33436511"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene structure",
            "uri": "http://edamontology.org/topic_0114"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
