{
    "additionDate": "2020-01-09T17:35:53Z",
    "biotoolsCURIE": "biotools:workflowr",
    "biotoolsID": "workflowr",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "jdblischak@gmail.com",
            "name": "John D. Blischak",
            "orcidid": "https://orcid.org/0000-0003-2634-9879",
            "typeEntity": "Person"
        }
    ],
    "description": "Creating and sharing reproducible research code the workflowr way.\n\nOrganize your project into a research website.\n\nworkflowr: organized + reproducible + shareable data science in R.\n\nThe workflowr R package helps researchers organize their analyses in a way that promotes effective project management, reproducibility, collaboration, and sharing of results. Workflowr combines literate programming (knitr and rmarkdown) and version control (Git, via git2r) to generate a website containing time-stamped, versioned, and documented results. Any R user can quickly and easily adopt workflowr.\n\nA Framework for Reproducible and Collaborative Data Science.\n\nProvides a workflow for your analysis projects by combining literate programming ('knitr' and 'rmarkdown') and version control ('Git', via 'git2r') to generate a website containing time-stamped, versioned, and documented results",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jdblischak/workflowr",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-01-09T17:35:53Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://cran.r-project.org/package=workflowr"
        }
    ],
    "name": "workflowr",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.12688/F1000RESEARCH.20843.1",
            "metadata": {
                "abstract": "© 2019 Blischak JD et al.Making scientific analyses reproducible, well documented, and easily shareable is crucial to maximizing their impact and ensuring that others can build on them. However, accomplishing these goals is not easy, requiring careful attention to organization, workflow, and familiarity with tools that are not a regular part of every scientist's toolbox. We have developed an R package, workflowr, to help all scientists, regardless of background, overcome these challenges. Workflowr aims to instill a particular “workflow”-a sequence of steps to be repeated and integrated into research practice-that helps make projects more reproducible and accessible.This workflow integrates four key elements: (1) version control (via Git); (2) literate programming (via R Markdown); (3) automatic checks and safeguards that improve code reproducibility; and (4) sharing code and results via a browsable website. These features exploit powerful existing tools, whose mastery would take considerable study. However, the workflowr interface is simple enough that novice users can quickly enjoy its many benefits. By simply following the workflowr “workflow”, R users can create projects whose results, figures, and development history are easily accessible on a static website-thereby conveniently shareable with collaborators by sending them a URL-and accompanied by source code and reproducibility safeguards. The workflowr R package is open source and available on CRAN, with full documentation and source code available at https://github.com/jdblischak/workflowr.",
                "authors": [
                    {
                        "name": "Blischak J.D."
                    },
                    {
                        "name": "Carbonetto P."
                    },
                    {
                        "name": "Stephens M."
                    }
                ],
                "citationCount": 1,
                "date": "2019-10-14T00:00:00Z",
                "journal": "F1000Research",
                "title": "Creating and sharing reproducible research code the workflow way [version 1; peer review: 3 approved]"
            },
            "pmcid": "PMC6833990",
            "pmid": "31723427"
        }
    ],
    "topic": [
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}