
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://140.113.239.45/GeNOSA/#Contact"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://140.113.239.45/GeNOSA/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Systems biology",
                "uri": "http://edamontology.org/topic_2259"
            },
            {
                "term": "Gene regulation",
                "uri": "http://edamontology.org/topic_0204"
            },
            {
                "term": "Microarray experiment",
                "uri": "http://edamontology.org/topic_3518"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/genosa-1-2-13-integrated-platform-for-gene-regulatory-networks.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2015 The Author 2015. Published by Oxford University Press. All rights reserved. Motivation: The establishment of quantitative gene regulatory networks (qGRNs) through existing network component analysis (NCA) approaches suffers from shortcomings such as usage limitations of problem constraints and the instability of inferred qGRNs. The proposed GeNOSA framework uses a global optimization algorithm (OptNCA) to cope with the stringent limitations of NCA approaches in large-scale qGRNs. Results: OptNCA performs well against existing NCA-derived algorithms in terms of utilization of connectivity information and reconstruction accuracy of inferred GRNs using synthetic and real Escherichia coli datasets. For comparisons with other non-NCA-derived algorithms, OptNCA without using known qualitative regulations is also evaluated in terms of qualitative assessments using a synthetic Saccharomyces cerevisiae dataset of the DREAM3 challenges. We successfully demonstrate GeNOSA in several applications including deducing condition-dependent regulations, establishing high-consensus qGRNs and validating a sub-network experimentally for dose-response and time-course microarray data, and discovering and experimentally confirming a novel regulation of CRP on AscG. Availability and implementation: All datasets and the GeNOSA framework are freely available from http://e045.life.nctu.edu.tw/GeNOSA.",
            "authors": [
                "Chen Y.-H.",
                "Yang C.-D.",
                "Tseng C.-P.",
                "Huang H.-D.",
                "Ho S.-Y."
            ],
            "cit_count": 3,
            "journal": "Bioinformatics",
            "pmid": "25717191",
            "title": "GeNOSA: Inferring and experimentally supporting quantitative gene regulatory networks in prokaryotes",
            "year": "2015-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:genosa",
        "biotoolsID": "genosa",
        "description": "Several tools to perform reconstruction of gene regulatory networks from microarray data and connectivity information.",
        "homepage": "http://140.113.239.45/GeNOSA/",
        "name": "GeNOSA"
    }
}