{
    "additionDate": "2021-03-19T08:46:11Z",
    "biotoolsCURIE": "biotools:sinex",
    "biotoolsID": "sinex",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "dsholmes2000@yahoo.com",
            "name": "D S Holmes",
            "orcidid": "https://orcid.org/0000-0001-9555-138X",
            "typeEntity": "Person"
        }
    ],
    "description": "database for eukaryotic single-exon coding sequences.\n\nSingle-exon coding sequences (CDSs), also known as 'single-exon genes' (SEGs), are defined as nuclear, protein-coding genes that lack introns in their CDSs. They have been studied not only to determine their origin and evolution but also because their expression has been linked to several types of human cancers and neurological developmental disorders, and many exhibit tissue-specific transcription.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Homology-based gene prediction",
                    "uri": "http://edamontology.org/operation_3663"
                },
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "https://v2.sinex.cl/",
    "language": [
        "SQL"
    ],
    "lastUpdate": "2021-04-09T10:14:41.165333Z",
    "name": "SinEx",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAAB002",
            "metadata": {
                "abstract": "© The Author(s) 2021. Published by Oxford University Press.Single-exon coding sequences (CDSs), also known as 'single-exon genes' (SEGs), are defined as nuclear, protein-coding genes that lack introns in their CDSs. They have been studied not only to determine their origin and evolution but also because their expression has been linked to several types of human cancers and neurological/developmental disorders, and many exhibit tissue-specific transcription. We developed SinEx DB that houses DNA and protein sequence information of SEGs from 10 mammalian genomes including human. SinEx DB includes their functional predictions (KOG (euKaryotic Orthologous Groups)) and the relative distribution of these functions within species. Here, we report SinEx 2.0, a major update of SinEx DB that includes information of the occurrence, distribution and functional prediction of SEGs from 60 completely sequenced eukaryotic genomes, representing animals, fungi, protists and plants. The information is stored in a relational database built with MySQL Server 5.7, and the complete dataset of SEG sequences and their GO (Gene Ontology) functional assignations are available for downloading. SinEx DB 2.0 was built with a novel pipeline that helps disambiguate single-exon isoforms from SEGs. SinEx DB 2.0 is the largest available database for SEGs and provides a rich source of information for advancing our understanding of the evolution, function of SEGs and their associations with disorders including cancers and neurological and developmental diseases. Database URL: http://v2.sinex.cl/.",
                "authors": [
                    {
                        "name": "Jorquera R."
                    },
                    {
                        "name": "Gonzalez C."
                    },
                    {
                        "name": "Clausen P.T.L.C."
                    },
                    {
                        "name": "Petersen B."
                    },
                    {
                        "name": "Holmes D.S."
                    }
                ],
                "date": "2021-01-28T00:00:00Z",
                "journal": "Database : the journal of biological databases and curation",
                "title": "SinEx DB 2.0 update 2020: database for eukaryotic single-exon coding sequences"
            },
            "pmcid": "PMC7904048",
            "pmid": "33507271"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}