{
    "accessibility": "Open access",
    "additionDate": "2023-02-04T01:56:20.706779Z",
    "biotoolsCURIE": "biotools:mosaics_software",
    "biotoolsID": "mosaics_software",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jose.faraldo@nih.gov",
            "name": "José D. Faraldo-Gómez"
        },
        {
            "email": "nathan.bernhardt@nih.gov",
            "name": "Nathan Bernhardt"
        }
    ],
    "description": "A software suite for analysis of membrane structure and dynamics in simulated trajectories.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Simulation analysis",
                    "uri": "http://edamontology.org/operation_0244"
                }
            ]
        }
    ],
    "homepage": "https://github.com/MOSAICS-NIH/MOSAICS",
    "language": [
        "C++"
    ],
    "lastUpdate": "2023-02-04T01:56:20.709247Z",
    "license": "BSD-3-Clause",
    "name": "MOSAICS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.BPJ.2022.11.005",
            "metadata": {
                "abstract": "© 2022Molecular dynamics (MD) simulations have become the predominant computational analysis method in membrane biophysics, as this technique is uniquely suited for investigations of complex molecular systems through the relevant physical principles. Owing to continued improvements in scope and performance, the trajectories generated through this approach contain ever-increasing amounts of information, which must be synthesized and simplified in post-analysis using tools that are not only mechanistically insightful but also computationally efficient and highly scalable. Here, we introduce MOSAICS, a self-contained high-performance suite of C++ software tools designed for advanced analyses of lipid bilayer structure and dynamics from MD trajectories. MOSAICS is to our knowledge the most comprehensive software suite of this kind, enabling analysis of a wide array of morphological and kinetic properties, for both simple and complex membranes, irrespective of system size or resolution. Importantly, MOSAICS is designed to provide spatial distributions of all computed quantities, with built-in masking tools, noise filtering, and statistical significance metrics to facilitate quantitative interpretations of the trajectory data; it is also fully parallelized and can therefore leverage the capabilities of supercomputing facilities. Despite its technical sophistication, MOSAICS is user-friendly and requires minimal computational expertise, making it accessible to researchers of all skill levels. This sofware suite can be freely downloaded at https://github.com/MOSAICS-NIH/.",
                "authors": [
                    {
                        "name": "Bernhardt N."
                    },
                    {
                        "name": "Faraldo-Gomez J.D."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Biophysical Journal",
                "title": "MOSAICS: A software suite for analysis of membrane structure and dynamics in simulated trajectories"
            },
            "pmid": "36333911"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Biophysics",
            "uri": "http://edamontology.org/topic_3306"
        },
        {
            "term": "Lipids",
            "uri": "http://edamontology.org/topic_0153"
        },
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        }
    ]
}
