{
    "additionDate": "2017-01-17T15:01:56Z",
    "biotoolsCURIE": "biotools:bgx",
    "biotoolsID": "bgx",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "ernest.turro@imperial.ac.uk",
            "name": "Ernest Turro",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www1.imperial.ac.uk/medicine/people/ernest.turro/"
        }
    ],
    "description": "Bioconductor package for the Bayesian integrated analysis of Affymetrix GeneChips.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/bgx.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/bgx_1.40.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Statistical inference",
                    "uri": "http://edamontology.org/operation_3658"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/bgx.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/bgx-1-18-0-bayesian-integrated-analysis-affymetrix-genechips.html"
        }
    ],
    "name": "bgx",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-8-439",
            "metadata": {
                "abstract": "Background: Affymetrix 3′ GeneChip microarrays are widely used to profile the expression of thousands of genes simultaneously. They differ from many other microarray types in that GeneChips are hybridised using a single labelled extract and because they contain multiple 'match' and 'mismatch' sequences for each transcript. Most algorithms extract the signal from GeneChip experiments in a sequence of separate steps, including background correction and normalisation, which inhibits the simultaneous use of all available information. They principally provide a point estimate of gene expression and, in contrast to BGX, do not fully integrate the uncertainty arising from potentially heterogeneous responses of the probes. Results: BGX is a new Bioconductor R package that implements an integrated Bayesian approach to the analysis of 3′ GeneChip data. The software takes into account additive and multiplicative error, non-specific hybridisation and replicate summarisation in the spirit of the model outlined in 1. It also provides a posterior distribution for the expression of each gene. Moreover, BGX can take into account probe affinity effects from probe sequence information where available. The package employs a novel adaptive Markov chain Monte Carlo (MCMC) algorithm that raises considerably the efficiency with which the posterior distributions are sampled from. Finally, BGX incorporates various ways to analyse the results, such as ranking genes by expression level as well as statistically based methods for estimating the amount of up and down regulated genes between two conditions. Conclusion: BGX performs well relative to other widely used methods at estimating expression levels and fold changes. It has the advantage that it provides a statistically sound measure of uncertainty for its estimates. BGX includes various analysis functions to visualise and exploit the rich output that is produced by the Bayesian model. © 2007 Turro et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Bochkina N."
                    },
                    {
                        "name": "Hein A.-M.K."
                    },
                    {
                        "name": "Richardson S."
                    },
                    {
                        "name": "Turro E."
                    }
                ],
                "citationCount": 19,
                "date": "2007-11-12T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "BGX: A bioconductor package for the Bayesian integrated analysis of Affymetrix GeneChips"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1,
    "version": [
        "1.40.0"
    ]
}
