{
    "additionDate": "2017-02-10T11:34:24Z",
    "biotoolsCURIE": "biotools:mdscan",
    "biotoolsID": "mdscan",
    "credit": [
        {
            "email": "xsliu@jimmy.harvard.edu",
            "name": "Xiaole Shirley Liu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Server designed to pinpoint protein-DNA interaction sites at the base pair level.  Uses ChIP-array data, word enumeration and position-specific weight matrix updating  to search for motifs representing these interaction sites.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://robotics.stanford.edu/~xsliu/MDscan/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence motif recognition",
                    "uri": "http://edamontology.org/operation_0239"
                }
            ]
        }
    ],
    "homepage": "http://robotics.stanford.edu/~xsliu/MDscan/",
    "language": [
        "R",
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "name": "MDscan",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "The identification of regulatory motifs is important for the study of gene expression. Here we present a suite of programs that we have developed to search for regulatory sequence motifs: (i) BioProspector, a Gibbs-sampling-based program for predicting regulatory motifs from co-regulated genes in prokaryotes or lower eukaryotes; (ii) CompareProspector, an extension to BioProspector which incorporates comparative genomics features to be used for higher eukaryotes; (iii) MDscan, a program for finding protein-DNA interaction sites from ChIP-on-chip targets. All three programs examine a group of sequences that may share common regulatory motifs and output a list of putative motifs as position-specific probability matrices, the individual sites used to construct the motifs and the location of each site on the input sequences. The web servers and executables can be accessed at http://seqmotifs.stanford.edu. © Oxford University Press 2004; all rights reserved.",
                "authors": [
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Wei L."
                    },
                    {
                        "name": "Batzoglou S."
                    },
                    {
                        "name": "Brutlag D.L."
                    },
                    {
                        "name": "Liu J.S."
                    },
                    {
                        "name": "Liu X.S."
                    }
                ],
                "citationCount": 31,
                "date": "2004-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "A suite of web-based programs to search for transcriptional regulatory motifs"
            },
            "pmid": "15215381"
        },
        {
            "metadata": {
                "abstract": "Chromatin immunoprecipitation followed by cDNA microarray hybridization (ChIP-array) has become a popular procedure for studying genome-wide protein-DNA interactions and transcription regulation. However, it can only map the probable protein-DNA interaction loci within 1-2 kilobases resolution. To pinpoint interaction sites down to the base-pair level, we introduce a computational method, Motif Discovery scan (MDscan), that examines the ChIP-array-selected sequences and searches for DNA sequence motifs representing the protein-DNA interaction sites. MDscan combines the advantages of two widely adopted motif search strategies, word enumeration1-4 and position-specific weight matrix updating5-9, and incorporates the ChIP-array ranking information to accelerate searches and enhance their success rates. MDscan correctly identified all the experimentally verified motifs from published ChIP-array experiments in yeast10-13 (STE12, GAL4, RAP1, SCB, MCB, MCM1, SFF, and SWI5), and predicted two motif patterns for the differential binding of Rap1 protein in telomere regions. In our studies, the method was faster and more accurate than several established motif-finding algorithms5, 8, 9. MDscan can be used to find DNA motifs not only in ChIP-array experiments but also in other experiments in which a subgroup of the sequences can be inferred to contain relatively abundant motif sites.",
                "authors": [
                    {
                        "name": "Shirley Liu X."
                    },
                    {
                        "name": "Brutlag D.L."
                    },
                    {
                        "name": "Liu J.S."
                    }
                ],
                "citationCount": 504,
                "date": "2002-01-01T00:00:00Z",
                "journal": "Nature Biotechnology",
                "title": "An algorithm for finding protein-DNA binding sites with applications to chromatin-immunoprecipitation microarray experiments"
            },
            "pmid": "12101404"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}