{
    "additionDate": "2020-01-14T19:33:13Z",
    "biotoolsCURIE": "biotools:gencore",
    "biotoolsID": "gencore",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "chen@haplox.com",
            "name": "Shifu Chen",
            "orcidid": "https://orcid.org/0000-0001-5799-653X",
            "typeEntity": "Person"
        }
    ],
    "description": "an efficient tool to generate consensus reads for error suppressing and duplicate removing of NGS data.\n\nGenerate consensus reads to reduce sequencing noises and remove duplications.\n\nA fast tool to remove sequencing duplications and eliminate sequencing errors by generating consensus reads.\n\ngencore is a tool for fast and powerful deduplication for paired-end next-generation sequencing (NGS) data. It is much faster and uses much less memory than Picard and other tools. It generates very informative reports in both HTML and JSON formats. It's based on an algorithm for generating consensus reads, and that's why it's named gencore",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Sequence merging",
                    "uri": "http://edamontology.org/operation_0232"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "homepage": "https://github.com/OpenGene/gencore",
    "language": [
        "C++"
    ],
    "lastUpdate": "2020-12-03T07:30:09Z",
    "license": "MIT",
    "name": "gencore",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3280-9",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Removing duplicates might be considered as a well-resolved problem in next-generation sequencing (NGS) data processing domain. However, as NGS technology gains more recognition in clinical application, researchers start to pay more attention to its sequencing errors, and prefer to remove these errors while performing deduplication operations. Recently, a new technology called unique molecular identifier (UMI) has been developed to better identify sequencing reads derived from different DNA fragments. Most existing duplicate removing tools cannot handle the UMI-integrated data. Some modern tools can work with UMIs, but are usually slow and use too much memory. Furthermore, existing tools rarely report rich statistical results, which are very important for quality control and downstream analysis. These unmet requirements drove us to develop an ultra-fast, simple, little-weighted but powerful tool for duplicate removing and sequence error suppressing, with features of handling UMIs and reporting informative results. Results: This paper presents an efficient tool gencore for duplicate removing and sequence error suppressing of NGS data. This tool clusters the mapped sequencing reads and merges reads in each cluster to generate one single consensus read. While the consensus read is generated, the random errors introduced by library construction and sequencing can be removed. This error-suppressing feature makes gencore very suitable for the application of detecting ultra-low frequency mutations from deep sequencing data. When unique molecular identifier (UMI) technology is applied, gencore can use them to identify the reads derived from same original DNA fragment. Gencore reports statistical results in both HTML and JSON formats. The HTML format report contains many interactive figures plotting statistical coverage and duplication information. The JSON format report contains all the statistical results, and is interpretable for downstream programs. Conclusions: Comparing to the conventional tools like Picard and SAMtools, gencore greatly reduces the output data's mapping mismatches, which are mostly caused by errors. Comparing to some new tools like UMI-Reducer and UMI-tools, gencore runs much faster, uses less memory, generates better consensus reads and provides simpler interfaces. To our best knowledge, gencore is the only duplicate removing tool that generates both informative HTML and JSON reports. This tool is available at: https://github.com/OpenGene/gencore.",
                "authors": [
                    {
                        "name": "Chen S."
                    },
                    {
                        "name": "Zhou Y."
                    },
                    {
                        "name": "Chen Y."
                    },
                    {
                        "name": "Huang T."
                    },
                    {
                        "name": "Liao W."
                    },
                    {
                        "name": "Xu Y."
                    },
                    {
                        "name": "Li Z."
                    },
                    {
                        "name": "Gu J."
                    }
                ],
                "citationCount": 9,
                "date": "2019-12-27T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Gencore: An efficient tool to generate consensus reads for error suppressing and duplicate removing of NGS data"
            },
            "pmcid": "PMC6933617",
            "pmid": "31881822"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ],
    "validated": 1
}