{
    "additionDate": "2021-01-20T10:57:56Z",
    "biotoolsCURIE": "biotools:varwatch",
    "biotoolsID": "varwatch",
    "collectionID": [
        "Rare Disease"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "m.hoeppner@ikmb.uni-kiel.de",
            "name": "Marc P. Hoeppner",
            "orcidid": "https://orcid.org/0000-0002-0279-2270",
            "typeEntity": "Person"
        }
    ],
    "description": "Stand-alone software tool for variant matching.\n\nVarWatch is a tool for professional human geneticists, genetic counselors and researchers working with genetic data from patients. High-throughput sequencing is uncovering an increasing number of genomic variants with a suspected link to an observed clinical phenotype. However, substantiating the clinical relevance of these variants-of-unknown-significance (VUS) typically requires one or more independent observations. VarWatch offers a non-commercial platform where such VUS can be registered to be continuously monitored for similar findings in external databases or the VarWatch register itself. Potential matches to other case descriptions will be forwarded to the variant owners to aid in the finding of a diagnosis for the affected patient(s).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                }
            ]
        }
    ],
    "homepage": "https://github.com/broderF/varwatch",
    "language": [
        "Java"
    ],
    "lastUpdate": "2021-05-21T06:47:40.301374Z",
    "name": "VarWatch",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0215618",
            "metadata": {
                "abstract": "© 2019 Fredrich et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Massively parallel DNA sequencing of clinical samples holds great promise for the gene-based diagnosis of human inherited diseases because it allows rapid detection of putatively causative mutations at genome-wide level. Without additional evidence complementing their initial bioinformatics evaluation, however, the clinical relevance of such candidate genetic variants often remains unclear. In consequence, dedicated ‘matching’ services have been established in recent years that aim at the discovery of other, comparable case reports to facilitate individual diagnoses. However, legal concerns have been raised about the global sharing of genetic data, particularly in Europe where the recently enacted General Data Protection Regulation EU-2016/679 classifies genetic data as highly sensitive. Hence, unrestricted sharing of genetic data from clinical cases on platforms outside the national jurisdiction increasingly may be perceived as problematic. To allow collaborative data producers, particularly large consortia of diagnostic laboratories, to acknowledge these concerns while still practicing efficient case matching internally, novel tools are required. To this end, we developed VarWatch, an easy-to-deploy and highly scalable case matching software that provides users with comprehensive programmatic tools and a user-friendly interface to fulfil said purpose.",
                "authors": [
                    {
                        "name": "Fredrich B."
                    },
                    {
                        "name": "Schmohl M."
                    },
                    {
                        "name": "Junge O."
                    },
                    {
                        "name": "Gundlach S."
                    },
                    {
                        "name": "Ellinghaus D."
                    },
                    {
                        "name": "Pfeufer A."
                    },
                    {
                        "name": "Bettecken T."
                    },
                    {
                        "name": "Siddiqui R."
                    },
                    {
                        "name": "Franke A."
                    },
                    {
                        "name": "Wienker T.F."
                    },
                    {
                        "name": "Hoeppner M.P."
                    },
                    {
                        "name": "Krawczak M."
                    }
                ],
                "date": "2019-04-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "VarWatch—A stand-alone software tool for variant matching"
            },
            "pmcid": "PMC6483337",
            "pmid": "31022234"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        }
    ]
}