{
    "additionDate": "2021-01-18T08:03:13Z",
    "biotoolsCURIE": "biotools:reaver",
    "biotoolsID": "reaver",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "bac7wj@virginia.edu",
            "name": "Bruce A. Corliss",
            "orcidid": "https://orcid.org/0000-0003-2962-7344",
            "typeEntity": "Person"
        }
    ],
    "description": "A program for improved analysis of high-resolution vascular network images.\n\nRapid Editable Analysis of Vessel Elements Routine.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/uva-peirce-cottler-lab/public_REAVER",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-02-04T15:33:36Z",
    "license": "BSD-3-Clause",
    "name": "REAVER",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1111/MICC.12618",
            "metadata": {
                "abstract": "© 2020 The Authors. Microcirculation published by John Wiley & Sons LtdAlterations in vascular networks, including angiogenesis and capillary regression, play key roles in disease, wound healing, and development. The spatial structures of blood vessels can be captured through imaging, but effective characterization of network architecture requires both metrics for quantification and software to carry out the analysis in a high-throughput and unbiased fashion. We present Rapid Editable Analysis of Vessel Elements Routine (REAVER), an open-source tool that researchers can use to analyze high-resolution 2D fluorescent images of blood vessel networks, and assess its performance compared to alternative image analysis programs. Using a dataset of manually analyzed images from a variety of murine tissues as a ground-truth, REAVER exhibited high accuracy and precision for all vessel architecture metrics quantified, including vessel length density, vessel area fraction, mean vessel diameter, and branchpoint count, along with the highest pixel-by-pixel accuracy for the segmentation of the blood vessel network. In instances where REAVER's automated segmentation is inaccurate, we show that combining manual curation with automated analysis improves the accuracy of vessel architecture metrics. REAVER can be used to quantify differences in blood vessel architectures, making it useful in experiments designed to evaluate the effects of different external perturbations (eg, drugs or disease states).",
                "authors": [
                    {
                        "name": "Corliss B.A."
                    },
                    {
                        "name": "Doty R.W."
                    },
                    {
                        "name": "Mathews C."
                    },
                    {
                        "name": "Yates P.A."
                    },
                    {
                        "name": "Zhang T."
                    },
                    {
                        "name": "Peirce S.M."
                    }
                ],
                "citationCount": 3,
                "date": "2020-07-01T00:00:00Z",
                "journal": "Microcirculation",
                "title": "REAVER: A program for improved analysis of high-resolution vascular network images"
            },
            "pmcid": "PMC7507177",
            "pmid": "32173962"
        }
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ]
}