{
    "additionDate": "2020-09-03T19:18:48Z",
    "biotoolsCURIE": "biotools:rigapollo",
    "biotoolsID": "rigapollo",
    "collectionID": [
        "IBSquare",
        "VIB"
    ],
    "credit": [
        {
            "email": "wim.vranken@vub.be",
            "name": "Wim F Vranken",
            "typeEntity": "Person"
        }
    ],
    "description": "an application to protein pairwise alignments.\n\nMethods able to provide reliable protein alignments are crucial for many bioinformatics applications. In the last years many different algorithms have been developed and various kinds of information, from sequence conservation to secondary structure, have been used to improve the alignment performances. This is especially relevant for proteins with highly divergent sequences. However, recent works suggest that different features may have different importance in diverse protein classes and it would be an advantage to have more customizable approaches, capable to deal with different alignment definitions",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Pairwise sequence alignment",
                    "uri": "http://edamontology.org/operation_0491"
                },
                {
                    "term": "Structure alignment",
                    "uri": "http://edamontology.org/operation_0295"
                }
            ]
        }
    ],
    "homepage": "http://www.ibsquare.be/rigapollo",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-09-08T14:42:24Z",
    "name": "Rigapollo",
    "owner": "bits@vib.be",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTX391",
            "metadata": {
                "abstract": "© The Author 2017. Published by Oxford University Press. All rights reserved.Motivation: Methods able to provide reliable protein alignments are crucial for many bioinformatics applications. In the last years many different algorithms have been developed and various kinds of information, from sequence conservation to secondary structure, have been used to improve the alignment performances. This is especially relevant for proteins with highly divergent sequences. However, recent works suggest that different features may have different importance in diverse protein classes and it would be an advantage to have more customizable approaches, capable to deal with different alignment definitions. Results: Here we present Rigapollo, a highly flexible pairwise alignment method based on a pairwise HMM-SVM that can use any type of information to build alignments. Rigapollo lets the user decide the optimal features to align their protein class of interest. It outperforms current state of the art methods on two well-known benchmark datasets when aligning highly divergent sequences.",
                "authors": [
                    {
                        "name": "Khan T."
                    },
                    {
                        "name": "Lenaerts T."
                    },
                    {
                        "name": "Orlando G."
                    },
                    {
                        "name": "Raimondi D."
                    },
                    {
                        "name": "Vranken W.F."
                    }
                ],
                "citationCount": 4,
                "date": "2017-12-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "SVM-dependent pairwise HMM: An application to protein pairwise alignments"
            },
            "pmid": "28666322"
        }
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        }
    ],
    "validated": 1
}
