{
    "additionDate": "2021-03-19T08:49:02Z",
    "biotoolsCURIE": "biotools:galaxy-dl",
    "biotoolsID": "galaxy-dl",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "kumara@informatik.uni-freiburg.de",
            "name": "Anup Kumar",
            "orcidid": "https://orcid.org/0000-0002-2068-4695",
            "typeEntity": "Person"
        }
    ],
    "description": "Tool recommender system in Galaxy using deep learning (Gated recurrent units neural network).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/anuprulez/galaxy_tool_recommendation",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-22T12:18:40Z",
    "license": "MIT",
    "name": "Galaxy-dl",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/GIGASCIENCE/GIAA152",
            "metadata": {
                "abstract": "© 2021 The Author(s) 2021. Published by Oxford University Press GigaScience.Background: Galaxy is a web-based and open-source scientific data-processing platform. Researchers compose pipelines in Galaxy to analyse scientific data. These pipelines, also known as workflows, can be complex and difficult to create from thousands of tools, especially for researchers new to Galaxy. To help researchers with creating workflows, a system is developed to recommend tools that can facilitate further data analysis. Findings: A model is developed to recommend tools using a deep learning approach by analysing workflows composed by researchers on the European Galaxy server. The higher-order dependencies in workflows, represented as directed acyclic graphs, are learned by training a gated recurrent units neural network, a variant of a recurrent neural network. In the neural network training, the weights of tools used are derived from their usage frequencies over time and the sequences of tools are uniformly sampled from training data. Hyperparameters of the neural network are optimized using Bayesian optimization. Mean accuracy of 98% in recommending tools is achieved for the top-1 metric. Conclusions: The model is accessed by a Galaxy API to provide researchers with recommended tools in an interactive manner using multiple user interface integrations on the European Galaxy server. High-quality and highly used tools are shown at the top of the recommendations. The scripts and data to create the recommendation system are available under MIT license at https://github.com/anuprulez/galaxy_tool_recommendation.",
                "authors": [
                    {
                        "name": "Backofen R."
                    },
                    {
                        "name": "Gruning B."
                    },
                    {
                        "name": "Kumar A."
                    },
                    {
                        "name": "Rasche H."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "GigaScience",
                "title": "Tool recommender system in Galaxy using deep learning"
            },
            "pmcid": "PMC7786169",
            "pmid": "33404053"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
