{
    "additionDate": "2020-01-14T19:44:02Z",
    "biotoolsCURIE": "biotools:coil",
    "biotoolsID": "coil",
    "confidence_flag": "tool",
    "description": "an R package for cytochrome C oxidase I (COI) DNA barcode data cleaning, translation, and error evaluation.\n\nContextualization and Evaluation of COI-5P Barcode Data.\n\nDesigned for the cleaning, contextualization and assessment of cytochrome c oxidase I DNA barcode data (COI-5P, or the five prime portion of COI). It contains functions for placing COI-5P barcode sequences into a common reading frame, translating DNA sequences to amino acids and for assessing the likelihood that a given barcode sequence includes an insertion or deletion error. The error assessment relies on the comparison of input sequences against nucleotide and amino acid profile hidden Markov models (for details see Durbin et al. 1998, ISBN: 9780521629713) trained on a taxonomically diverse set of reference sequences. The functions are provided as a complete pipeline and are also available individually for efficient and targeted analysis of barcode data",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein super-secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0268"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Community profiling",
                    "uri": "http://edamontology.org/operation_3200"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/coil/index.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-16T16:30:29Z",
    "license": "GPL-3.0",
    "name": "coil",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/2019.12.12.865014"
        },
        {
            "doi": "10.1139/gen-2019-0206",
            "metadata": {
                "abstract": "© 2020, Canadian Science Publishing. All rights reserved.Biological conclusions based on DNA barcoding and metabarcoding analyses can be strongly influenced by the methods utilized for data generation and curation, leading to varying levels of success in the separation of biological variation from experimental error. The 5′ region of cytochrome c oxidase subunit I (COI-5P) is the most common barcode gene for animals, with conserved structure and function that allows for biologically informed error identification. Here, we present coil (https://CRAN.R-project.org/package=coil), an R package for the preprocessing and frameshift error assessment of COI-5P animal barcode and metabarcode sequence data. The package contains functions for placement of barcodes into a common reading frame, accurate translation of sequences to amino acids, and highlighting insertion and deletion errors. The analysis of 10 000 barcode sequences of varying quality demonstrated how coil can place barcode sequences in reading frame and distinguish sequences containing indel errors from error-free sequences with greater than 97.5% accuracy. Package limitations were tested through the analysis of COI-5P sequences from the plant and fungal kingdoms as well as the analysis of potential contaminants: Nuclear mitochondrial pseudogenes and Wolbachia COI-5P sequences. Results demonstrated that coil is a strong technical error identification method but is not reliable for detecting all biological contaminants.",
                "authors": [
                    {
                        "name": "Nugent C.M."
                    },
                    {
                        "name": "Elliott T.A."
                    },
                    {
                        "name": "Ratnasingham S."
                    },
                    {
                        "name": "Adamowicz S.J."
                    }
                ],
                "citationCount": 3,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Genome",
                "title": "Coil: An R package for cytochrome c oxidase I (COI) DNA barcode data cleaning, translation, and error evaluation"
            },
            "pmid": "32406757"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        }
    ],
    "validated": 1
}