{
    "additionDate": "2023-08-01T22:37:32.801912Z",
    "biotoolsCURIE": "biotools:horde",
    "biotoolsID": "horde",
    "collectionID": [
        "gpcr"
    ],
    "description": "HORDE (The Human Olfactory Data Explorer) is a database of human Olfactory Receptors (ORs), the largest multigene family in vertabrates. ORs are G-Coupled Protein Receptors with a 7-transmembrane structure. The ORs are responsible for triggering the olfactory signal transduction pathway. You will find here information on the entire human OR repertoire, including a rich annotation on genomic variations, classification, orthologs and other features. Also available are OR repertoires of other mammalian species.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://genome.weizmann.ac.il/horde/",
    "lastUpdate": "2024-11-24T14:16:32.640759Z",
    "name": "The Human Olfactory Data Explorer (HORDE)",
    "owner": "laasfeld",
    "publication": [
        {
            "doi": "10.1007/978-1-62703-377-0_2",
            "metadata": {
                "abstract": "Olfactory receptors (ORs) constitute the largest gene family in the mammalian genome. The existence of these proteins underlies the nature of, and variability in, odorant perception. The Human Olfactory Receptor Data Explorer (HORDE, http://genome.weizmann.ac.il/horde/ ) is a free online resource, which presents a complete compendium of all OR genes and pseudogenes in the genome of human and four other vertebrates. HORDE includes three parts: (1) an automated pipeline, which mines OR gene and pseudogene sequences out of complete genomes, and generates gene symbols based on sequence similarity; (2) a card generator that obtains and displays annotative information on individual ORs retrieved from external databases and relevant studies; and (3) a search engine that allows user retrieval of OR information. For human ORs, HORDE specifically addresses the universe of interindividual variation, as obtained from several sources, including whole genome sequences made possible by next-generation sequencing. This encompasses single nucleotide polymorphisms (SNP) and copy number variation (CNV), including deleterious mutational events. HORDE also hosts a number of tools designed specifically to assist in the study of OR evolution and function. In this chapter, we describe the status of HORDE (build #43). We also discuss plans for future enhancements and a road map for HORDE to become a better community-based bioinformatics tool. We highlight HORDE's role as a major research tool in the study of an expanding cohort of OR repertoires.© Springer Science+Business Media, LLC 2013.",
                "authors": [
                    {
                        "name": "Lancet D."
                    },
                    {
                        "name": "Nativ N."
                    },
                    {
                        "name": "Olender T."
                    }
                ],
                "citationCount": 41,
                "date": "2013-01-01T00:00:00Z",
                "journal": "Methods in Molecular Biology",
                "title": "HORDE: Comprehensive resource for olfactory receptor genomics"
            },
            "pmid": "23585031"
        }
    ],
    "topic": [
        {
            "term": "Biochemistry",
            "uri": "http://edamontology.org/topic_3292"
        },
        {
            "term": "Computer science",
            "uri": "http://edamontology.org/topic_3316"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        }
    ]
}
