{
    "accessibility": "Open access",
    "additionDate": "2023-02-15T02:08:05.041866Z",
    "biotoolsCURIE": "biotools:r-sim",
    "biotoolsID": "r-sim",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Arijit Roy"
        },
        {
            "name": "M. Michael Gromiha"
        },
        {
            "name": "Sowmya Ramaswamy Krishnan"
        }
    ],
    "description": "A Database of Binding Affinities for RNA-small Molecule Interactions.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://web.iitm.ac.in/bioinfo2/R_SIM/index.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2023-02-15T02:08:05.045143Z",
    "name": "R-SIM",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.JMB.2022.167914",
            "metadata": {
                "abstract": "© 2022 Elsevier LtdRibonucleic acids (RNAs) are involved in a multitude of crucial cellular functions by acting as a central conduit for information transfer. Due to their essential and versatile functional roles in the cell, RNAs have also been implicated in multiple disease conditions of therapeutic relevance including cancers, bacterial and viral infections and neurodegenerative disorders. Recently, several approaches have emerged to tap into the potentially unexplored regions of the druggable genome, which refers to the genes and gene products that are focused during drug development. For example, considering RNAs as viable alternative therapeutic targets for drug development can potentially expand the range of therapeutic targets. Consequently, the availability of adequate binding affinity measurements for RNA-small molecule interactions is essential to understand target selectivity and design more potent RNA-targeting drug-like molecules. To facilitate this growing need, we have curated a database of experimentally validated RNA-small molecule interactions, called RNA-Small molecule Interaction Miner (R-SIM). Each entry in R-SIM provides comprehensive information on sequence, structure and classification of the RNA target, various physicochemical properties of the small molecule, binding affinity value and corresponding experimental conditions, three-dimensional structure (experimental or modelled) of the RNA-small molecule complex, and the literature source for the data. It also provides a user-friendly web interface with several options for search, display, sorting, visualization, download and upload of the data. R-SIM is freely available at: https://web.iitm.ac.in/bioinfo2/R_SIM/index.html. We envisage that R-SIM has several potential applications in understanding and accelerating the development of novel RNA-targeted small molecule therapeutics.",
                "authors": [
                    {
                        "name": "Michael Gromiha M."
                    },
                    {
                        "name": "Ramaswamy Krishnan S."
                    },
                    {
                        "name": "Roy A."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "R-SIM: A Database of Binding Affinities for RNA-small Molecule Interactions"
            },
            "pmid": "36495921"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Biotechnology",
            "uri": "http://edamontology.org/topic_3297"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
