{
    "additionDate": "2017-08-03T18:58:56Z",
    "biotoolsCURIE": "biotools:safeec",
    "biotoolsID": "safeec",
    "credit": [
        {
            "email": "delphi@g.clemson.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://compbio.clemson.edu/"
        }
    ],
    "description": "A web applicatin for calculating folding free energy changes caused by missense mutations in proteins.",
    "documentation": [
        {
            "type": "General",
            "url": "http://compbio.clemson.edu/SAAFEC/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein property calculation",
                    "uri": "http://edamontology.org/operation_0250"
                }
            ]
        }
    ],
    "homepage": "http://compbio.clemson.edu/SAAFEC/",
    "lastUpdate": "2018-12-10T12:58:44Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/safeec-calculating-folding-free-energy-changes-in-proteins-caused-by-missense-mutations.html"
        }
    ],
    "name": "SAFEEC",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2016 by the authors; licensee MDPI, Basel, Switzerland.Folding free energy is an important biophysical characteristic of proteins that reflects the overall stability of the 3D structure of macromolecules. Changes in the amino acid sequence, naturally occurring or made in vitro, may affect the stability of the corresponding protein and thus could be associated with disease. Several approaches that predict the changes of the folding free energy caused by mutations have been proposed, but there is no method that is clearly superior to the others. The optimal goal is not only to accurately predict the folding free energy changes, but also to characterize the structural changes induced by mutations and the physical nature of the predicted folding free energy changes. Here we report a new method to predict the Single Amino Acid Folding free Energy Changes (SAAFEC) based on a knowledge-modified Molecular Mechanics Poisson-Boltzmann (MM/PBSA) approach. The method is comprised of two main components: a MM/PBSA component and a set of knowledge based terms delivered from a statistical study of the biophysical characteristics of proteins. The predictor utilizes a multiple linear regression model with weighted coefficients of various terms optimized against a set of experimental data. The aforementioned approach yields a correlation coefficient of 0.65 when benchmarked against 983 cases from 42 proteins in the ProTherm database. Availability: the webserver can be accessed via http://compbio.clemson.edu/SAAFEC/.",
                "authors": [
                    {
                        "name": "Getov I."
                    },
                    {
                        "name": "Petukh M."
                    },
                    {
                        "name": "Alexov E."
                    }
                ],
                "citationCount": 18,
                "date": "2016-04-07T00:00:00Z",
                "journal": "International Journal of Molecular Sciences",
                "title": "SAAFEC: Predicting the effect of single point mutations on protein folding free energy using a knowledge-modified MM/PBSA approach"
            },
            "pmid": "27070572"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA mutation",
            "uri": "http://edamontology.org/topic_2533"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ],
    "validated": 1
}