{
    "accessibility": "Open access",
    "additionDate": "2023-11-07T10:44:33.886322Z",
    "biotoolsCURIE": "biotools:fastcontext",
    "biotoolsID": "fastcontext",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "V Fishman",
            "typeEntity": "Person"
        },
        {
            "name": "Е Viesná",
            "typeEntity": "Person"
        }
    ],
    "description": "A tool for identification of adapters and other sequence patterns in next generation sequencing (NGS) data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA barcoding",
                    "uri": "http://edamontology.org/operation_3200"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Reverse complement",
                    "uri": "http://edamontology.org/operation_0363"
                }
            ]
        }
    ],
    "homepage": "https://pypi.org/project/FastContext",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2023-11-07T10:44:33.889043Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/regnveig/FastContext"
        }
    ],
    "name": "FastContext",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.18699/VJGB-22-97",
            "metadata": {
                "abstract": "The development of next generation sequencing (NGS) methods has created the need for detailed analysis and control of each protocol step. NGS library preparation protocols may include steps with incorporation of various service sequences, such as sequencing adapters, primers, sample-, cell-, and molecule-specific barcodes. Despite a fairly high level of current knowledge, during the protocol development process researches often have to deal with various kinds of unexpected experiment outcomes, which result either from lack of information, lack of knowledge, or defects in reagent manufacturing. Detection and analysis of service sequences, their distribution and linkage may provide important information for protocol optimization. Here we introduce FastContext, a tool designed to analyze NGS read structure, based on sequence features found in reads, and their relative position in the read. The algorithm is able to create human readable read structures with user-specified patterns, to calculate counts and percentage of every read structure. Despite the simplicity of the algorithm, FastContext may be useful in read structure analysis and, as a result, can help better understand molecular processes that take place at different stages of NGS library preparation. The project is open-source software, distributed under GNU GPL v3, entirely written in the programming language Python, and based on well-maintained packages and commonly used data formats. Thus, it is cross-platform, may be patched or upgraded by the user if necessary. The FastContext package is available at the Python Package Index (https://pypi.org/project/FastContext), the source code is available at GitHub (https://github.com/regnveig/FastContext).",
                "authors": [
                    {
                        "name": "Fishman V."
                    },
                    {
                        "name": "Viesna E."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Vavilovskii Zhurnal Genetiki i Selektsii",
                "title": "FastContext: A tool for identification of adapters and other sequence patterns in next generation sequencing (NGS) data FastContext: инструмент для контекстного анализа последовательностей в данных секвенирования нового поколения (NGS)"
            },
            "pmcid": "PMC9837158",
            "pmid": "36694721"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
