{
    "additionDate": "2017-08-03T18:35:43Z",
    "biotoolsCURIE": "biotools:amass",
    "biotoolsID": "amass",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "email": "jocelyne@ucsd.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://bix.ucsd.edu/"
        }
    ],
    "description": "Series of tools written in C++ that allows you to segment your mass spectrometry imaging dataset into regions with similar molecular signatures. The software allows for user input at each step of the process and returns the regions as well as the associated molecular signatures. It is composed of two dynamic libraries and a series of executables using the libraries as a base.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bix.ucsd.edu/AMASS/usage.html#usage"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Spectral analysis",
                    "uri": "http://edamontology.org/operation_3214"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Protein structure analysis",
                    "uri": "http://edamontology.org/operation_2406"
                }
            ]
        }
    ],
    "homepage": "http://bix.ucsd.edu/AMASS/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2019-03-26T08:10:39Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/amass-msi-analysis-semi-supervised-segmentation.html"
        }
    ],
    "name": "AMASS",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Mass Spectrometric Imaging (MSI) is a molecular imaging technique that allows the generation of 2D ion density maps for a large complement of the active molecules present in cells and sectioned tissues. Automatic segmentation of such maps according to patterns of co-expression of individual molecules can be used for discovery of novel molecular signatures (molecules that are specifically expressed in particular spatial regions). However, current segmentation techniques are biased toward the discovery of higher abundance molecules and large segments; they allow limited opportunity for user interaction, and validation is usually performed by similarity to known anatomical features. We describe here a novel method, AMASS (Algorithm for MSI Analysis by Semi-supervised Segmentation). AMASS relies on the discriminating power of a molecular signal instead of its intensity as a key feature, uses an internal consistency measure for validation, and allows significant user interaction and supervision as options. An automated segmentation of entire leech embryo data images resulted in segmentation domains congruent with many known organs, including heart, CNS ganglia, nephridia, nephridiopores, and lateral and ventral regions, each with a distinct molecular signature. Likewise, segmentation of a rat brain MSI slice data set yielded known brain features and provided interesting examples of co-expression between distinct brain regions. AMASS represents a new approach for the discovery of peptide masses with distinct spatial features of expression. Software source code and installation and usage guide are available at http://bix.ucsd.edu/AMASS/. © 2011 American Chemical Society.",
                "authors": [
                    {
                        "name": "Bruand J."
                    },
                    {
                        "name": "Alexandrov T."
                    },
                    {
                        "name": "Sistla S."
                    },
                    {
                        "name": "Wisztorski M."
                    },
                    {
                        "name": "Meriaux C."
                    },
                    {
                        "name": "Becker M."
                    },
                    {
                        "name": "Salzet M."
                    },
                    {
                        "name": "Fournier I."
                    },
                    {
                        "name": "MacAgno E."
                    },
                    {
                        "name": "Bafna V."
                    }
                ],
                "citationCount": 18,
                "date": "2011-10-07T00:00:00Z",
                "journal": "Journal of Proteome Research",
                "title": "AMASS: Algorithm for MSI analysis by semi-supervised segmentation"
            },
            "pmid": "21800894"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ]
}