{
    "accessibility": "Open access",
    "additionDate": "2023-03-19T08:33:01.454607Z",
    "biotoolsCURIE": "biotools:dsac",
    "biotoolsID": "dsac",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "yubin@qust.edu.cn",
            "name": "Fa Zhang",
            "typeEntity": "Person"
        },
        {
            "email": "zhangfa@bit.edu.cn",
            "name": "Bin Yu",
            "typeEntity": "Person"
        }
    ],
    "description": "Cooperation of local features and global representations by a dual-branch network for transcription factor binding sites prediction.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Transcription factor binding site prediction",
                    "uri": "http://edamontology.org/operation_0445"
                }
            ]
        }
    ],
    "homepage": "https://github.com/YuBinLab-QUST/DSAC/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:53:23.369519Z",
    "license": "Not licensed",
    "name": "DSAC",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/bib/bbad036",
            "metadata": {
                "abstract": "Interactions between DNA and transcription factors (TFs) play an essential role in understanding transcriptional regulation mechanisms and gene expression. Due to the large accumulation of training data and low expense, deep learning methods have shown huge potential in determining the specificity of TFs-DNA interactions. Convolutional network-based and self-attention network-based methods have been proposed for transcription factor binding sites (TFBSs) prediction. Convolutional operations are efficient to extract local features but easy to ignore global information, while self-attention mechanisms are expert in capturing long-distance dependencies but difficult to pay attention to local feature details. To discover comprehensive features for a given sequence as far as possible, we propose a Dual-branch model combining Self-Attention and Convolution, dubbed as DSAC, which fuses local features and global representations in an interactive way. In terms of features, convolution and self-attention contribute to feature extraction collaboratively, enhancing the representation learning. In terms of structure, a lightweight but efficient architecture of network is designed for the prediction, in particular, the dual-branch structure makes the convolution and the self-attention mechanism can be fully utilized to improve the predictive ability of our model. The experiment results on 165 ChIP-seq datasets show that DSAC obviously outperforms other five deep learning based methods and demonstrate that our model can effectively predict TFBSs based on sequence feature alone. The source code of DSAC is available at https://github.com/YuBinLab-QUST/DSAC/.",
                "authors": [
                    {
                        "name": "Ding P."
                    },
                    {
                        "name": "Gao H."
                    },
                    {
                        "name": "Liu G."
                    },
                    {
                        "name": "Yu B."
                    },
                    {
                        "name": "Yu Y."
                    },
                    {
                        "name": "Zhang F."
                    }
                ],
                "citationCount": 7,
                "date": "2023-03-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "Cooperation of local features and global representations by a dual-branch network for transcription factor binding sites prediction"
            },
            "pmid": "36748992"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
