{
    "additionDate": "2021-01-18T11:20:53Z",
    "biotoolsCURIE": "biotools:dnamoredb",
    "biotoolsID": "dnamoredb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "aponces@genesilico.pl",
            "name": "Almudena Ponce-Salvatierra",
            "typeEntity": "Person"
        },
        {
            "email": "iamb@genesilico.pl",
            "name": "Janusz M Bujnicki",
            "typeEntity": "Person"
        }
    ],
    "description": "DNAmoreDB is a database of DNAzymes. Deoxyribozymes, DNA enzymes or simply DNAzymes are single-stranded oligo-deoxyribonucleotide molecules that, like proteins and ribozymes, possess the ability to perform catalysis. Although DNAzymes have not yet been found in living organisms, they have been isolated in the laboratory through in vitro selection. The selected DNAzyme sequences have the ability to catalyze a broad range of chemical reactions, utilizing DNA, RNA, peptides or small organic compounds as substrates.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "In vitro selection",
                    "uri": "http://edamontology.org/operation_3795"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://www.genesilico.pl/DNAmoreDB/",
    "lastUpdate": "2021-03-01T19:07:53Z",
    "name": "DNAmoreDB",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA867",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research. This is an Open Access article distributed under the terms of the Creative Commons Attribution License (http://creativecommons.org/licenses/by/4.0/), which permits unrestricted reuse, distribution, and reproduction in any medium, provided the original work is properly cited.Deoxyribozymes, DNA enzymes or simply DNAzymes are single-stranded oligodeoxyribonucleotide molecules that, like proteins and ribozymes, possess the ability to perform catalysis. Although DNAzymes have not yet been found in living organisms, they have been isolated in the laboratory through in vitro selection. The selected DNAzyme sequences have the ability to catalyze a broad range of chemical reactions, utilizing DNA, RNA, peptides or small organic compounds as substrates. DNAmoreDB is a comprehensive database resource for DNAzymes that collects and organizes the following types of information: sequences, conditions of the selection procedure, catalyzed reactions, kinetic parameters, substrates, cofactors, structural information whenever available, and literature references. Currently, DNAmoreDB contains information about DNAzymes that catalyze 20 different reactions. We included a submission form for new data, a REST-based API system that allows users to retrieve the database contents in a machine-readable format, and keyword and BLASTN search features. The database is publicly available at https://www.genesilico.pl/DNAmoreDB/.",
                "authors": [
                    {
                        "name": "Boccaletto P."
                    },
                    {
                        "name": "Bujnicki J.M."
                    },
                    {
                        "name": "Ponce-Salvatierra A."
                    }
                ],
                "citationCount": 2,
                "date": "2021-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "DNAmoreDB, a database of DNAzymes"
            },
            "pmid": "33053178"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
