{
    "additionDate": "2020-01-09T18:37:17Z",
    "biotoolsCURIE": "biotools:symmetric",
    "biotoolsID": "symmetric",
    "confidence_flag": "tool",
    "description": "Computer-assisted craniometric evaluation for diagnosis and follow-up of craniofacial asymmetries.\n\nThe current assessment of patients with craniofacial asymmetries is accomplished by physical examination, anamnesis and radiological imaging. We propose a semi-automated, computer-assisted craniofacial evaluation (SymMetric v 1.0) based on orthogonal photography of the patient's head in 3 positions. The system is simple, low-cost, no-radiation or special resources needed. Although it does not substitute CT in cases of doubt between craniosynostosis and positional plagiocephaly, multiple numeric evaluations indicate regional deformities and severity of the asymmetry, which can help in the clinical decision of indicating or not the orthosis in positional deformities, determining treatment duration or evaluating surgical outcomes after correction.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/ealho/SymMetric_v1.0",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-01-16T14:41:16Z",
    "name": "SymMetric",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1101/19007054"
        },
        {
            "doi": "10.1007/s00381-019-04451-2",
            "metadata": {
                "abstract": "© 2019, Springer-Verlag GmbH Germany, part of Springer Nature.Purpose: The current assessment of patients with craniofacial asymmetries is accomplished by physical examination, anamnesis and radiological imaging. We propose a semi-automated, computer-assisted craniofacial evaluation (SymMetric v 1.0) based on orthogonal photography of the patient’s head in 3 positions. The system is simple, low-cost, no-radiation or special resources needed. Although it does not substitute CT in cases of doubt between craniosynostosis and positional plagiocephaly, multiple numeric evaluations indicate regional deformities and severity of the asymmetry, which can help in the clinical decision of indicating or not the orthosis in positional deformities, determining treatment duration or evaluating surgical outcomes after correction. Methods: A Matlab-based tool was developed for digital processing of photographs taken in 3 positions (anterior, superior and lateral). The software guides the user to select visible and reproducible landmarks in each photograph acquisition and calculates multiple indexes and metrics, generating a set of comprehensive plots to offer the user an overview of head and facial symmetry across the orthogonal views. For purposes of demonstration, we evaluated 2 patients (one control and one with non-sinostotic deformity). Results: The results show a clear differentiation of the control and plagiocephalic patient metrics mainly in the superior view, showing potential for diagnosis of the condition, and also detected the clinical improvement during helmet treatment in the follow-up, 3 and 5 months after orthosis’ use. Conclusion: We presented a proof-of-concept for a low cost, no radiation evaluation system for craniofacial asymmetries, that can be useful in a clinical context for diagnosis and follow-up of patients.",
                "authors": [
                    {
                        "name": "Lopes Alho E.J."
                    },
                    {
                        "name": "Rondinoni C."
                    },
                    {
                        "name": "Furokawa F.O."
                    },
                    {
                        "name": "Monaco B.A."
                    }
                ],
                "date": "2020-06-01T00:00:00Z",
                "journal": "Child's Nervous System",
                "title": "Computer-assisted craniometric evaluation for diagnosis and follow-up of craniofacial asymmetries: SymMetric v. 1.0"
            },
            "pmid": "31820081"
        }
    ],
    "topic": [
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}