{
    "additionDate": "2021-03-19T08:58:32Z",
    "biotoolsCURIE": "biotools:isotv",
    "biotoolsID": "isotv",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mayer@molgen.mpg.de",
            "name": "Andreas Mayer",
            "typeEntity": "Person"
        }
    ],
    "description": "Processing and visualizing functional features of translated transcript isoforms.\n\n\nIsoTV is Snakemake pipeline to analyze and visualize functional features of translated transcript isoforms. IsoTV incorporates various tools to predict protein domains, secondary structure, disordered regions, and post-translational modification sites. The visualization facilitates comparison of the set of transcript isoforms expressed across conditions and explored the functional consequences of isoform differences. IsoTV supports a range of transcriptome sequencing technologies, including short-reads, Oxford Nanopore (ONT) long-reads, Pacific Bio-sciences (PacBio) long-reads. It also supports other inputs, including single or multiple gene sequences.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://isotv.readthedocs.io/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Base-calling",
                    "uri": "http://edamontology.org/operation_3185"
                },
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.molgen.mpg.de/MayerGroup/IsoTV",
    "lastUpdate": "2024-11-24T20:37:44.396491Z",
    "name": "IsoTV",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btab103",
            "metadata": {
                "abstract": "Summary: Despite the continuous discovery of new transcript isoforms, fueled by the recent increase in accessibility and accuracy of long-read RNA sequencing data, functional differences between isoforms originating from the same gene often remain obscure. To address this issue and enable researchers to assess potential functional consequences of transcript isoform variation on the proteome, we developed IsoTV. IsoTV is a versatile pipeline to process, predict and visualize the functional features of translated transcript isoforms. Attributes such as gene and isoform expression, transcript composition and functional features are summarized in an easy-to-interpret visualization. IsoTV is able to analyze a variety of data types from all eukaryotic organisms, including short- and long-read RNA-seq data. Using Oxford Nanopore long read data, we demonstrate that IsoTV facilitates the understanding of potential protein isoform function in different cancer cell types.",
                "authors": [
                    {
                        "name": "Annaldasula S."
                    },
                    {
                        "name": "Gajos M."
                    },
                    {
                        "name": "Mayer A."
                    }
                ],
                "citationCount": 4,
                "date": "2021-09-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "IsoTV: processing and visualizing functional features of translated transcript isoforms"
            },
            "pmcid": "PMC8479675",
            "pmid": "33585928"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
