
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.ibi.vu.nl/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://www.ibi.vu.nl/programs/spuncwww/static/spunc_method.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Structure prediction",
                    "uri": "http://edamontology.org/operation_0271"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "RNA structure prediction",
                    "uri": "http://edamontology.org/operation_2441"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Prediction",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "RNA structure",
                "uri": "http://edamontology.org/topic_0097"
            },
            {
                "term": "Structure prediction",
                "uri": "http://edamontology.org/topic_0082"
            },
            {
                "term": "RNA",
                "uri": "http://edamontology.org/topic_0099"
            },
            {
                "term": "RNA structure prediction",
                "uri": "http://edamontology.org/topic_0082"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/spunc-rna-structure-prediction-nucleotide-composition.html"
        }
    ],
    "publication": [
        {
            "abstract": "Structural elements in RNA molecules have a distinct nucleotide composition, which changes gradually over evolutionary time. We discovered certain features of these compositional patterns that are shared between all RNA families. Based on this information, we developed a structure prediction method that evaluates candidate structures for a set of homologous RNAs on their ability to reproduce the patterns exhibited by biological structures. The method is named SPuNC for 'Structure Prediction using Nucleotide Composition'. In a performance test on a diverse set of RNA families we demonstrate that the SPuNC algorithm succeeds in selecting the most realistic structures in an ensemble. The average accuracy of top-scoring structures is significantly higher than the average accuracy of all ensemble members (improvements of more than 20% observed). In addition, a consensus structure that includes the most reliable base pairs gleaned from a set of top-scoring structures is generally more accurate than a consensus derived from the full structural ensemble. Our method achieves better accuracy than existing methods on several RNA families, including novel riboswitches and ribozymes. The results clearly show that nucleotide composition can be used to reveal the quality of RNA structures and thus the presented technique should be added to the set of prediction tools. © 2009 The Author(s).",
            "authors": [
                "Smit S.",
                "Knight R.",
                "Heringa J."
            ],
            "cit_count": 12,
            "doi": "10.1093/nar/gkn987",
            "journal": "Nucleic Acids Research",
            "title": "RNA structure prediction from evolutionary patterns of nucleotide composition",
            "type": "Primary",
            "year": "2009-04-02"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:spunc",
        "biotoolsID": "spunc",
        "description": "Method for RNA structure prediction using evolutionary patterns of nucleotide composition.",
        "homepage": "http://www.ibi.vu.nl/programs/spuncwww/",
        "name": "SPuNC"
    }
}