{"credit":[],"function":[{"operation":[{"term":"Deposition","uri":"http://edamontology.org/operation_3431"},{"term":"Fold recognition","uri":"http://edamontology.org/operation_0303"},{"term":"Protein interaction prediction","uri":"http://edamontology.org/operation_2492"},{"term":"Query and retrieval","uri":"http://edamontology.org/operation_0224"}]}],"labels":{"topic":[{"term":"Membrane and lipoproteins","uri":"http://edamontology.org/topic_0820"},{"term":"Protein folds and structural domains","uri":"http://edamontology.org/topic_0736"},{"term":"Model organisms","uri":"http://edamontology.org/topic_0621"},{"term":"Lipids","uri":"http://edamontology.org/topic_0153"},{"term":"Literature and language","uri":"http://edamontology.org/topic_3068"}]},"publication":[{"abstract":"© 2019 Elsevier B.V.The majority of all proteins in cells interact with membranes either permanently or temporarily. Peripheral membrane proteins form transient complexes with membrane proteins and/or lipids, via non-covalent interactions and are of outmost importance, due to numerous cellular functions in which they participate. In an effort to collect data regarding this heterogeneous group of proteins we designed and constructed a database, called PerMemDB. PerMemDB is currently the most complete and comprehensive repository of data for eukaryotic peripheral membrane proteins deposited in UniProt or predicted with the use of MBPpred – a computational method that specializes in the detection of proteins that interact non-covalently with membrane lipids, via membrane binding domains. The first version of the database contains 231,770 peripheral membrane proteins from 1009 organisms. All entries have cross-references to other databases, literature references and annotation regarding their interactions with other proteins. Moreover, additional sequence annotation of the characteristic domains that allow these proteins to interact with membranes is available, due to the application of MBPpred. Through the web interface of PerMemDB, users can browse the contents of the database, submit advanced text searches and BLAST queries against the protein sequences deposited in PerMemDB. We expect this repository to serve as a source of information that will allow the scientific community to gain a deeper understanding of the evolution and function of peripheral membrane proteins via the enhancement of proteome-wide analyses. The database is available at: http://bioinformatics.biol.uoa.gr/db=permemdb.","authors":["Nastou K.C.","Tsaousis G.N.","Iconomidou V.A."],"cit_count":0,"doi":"10.1016/J.BBAMEM.2019.183076","journal":"Biochimica et Biophysica Acta - Biomembranes","pmid":"31629694","title":"PerMemDB: A database for eukaryotic peripheral membrane proteins","year":"2020-02-01"}],"summary":{"biotoolsCURIE":"biotools:PerMemDB","biotoolsID":"PerMemDB","description":"A database for eukaryotic peripheral membrane proteins.\n\nThe majority of all proteins in cells interact with membranes either permanently or temporarily. Peripheral membrane proteins form transient complexes with membrane proteins and or lipids, via non-covalent interactions and are of outmost importance, due to numerous cellular functions in which they participate. In an effort to collect data regarding this heterogeneous group of proteins we designed and constructed a database, called PerMemDB. PerMemDB is currently the most complete and comprehensive repository of data for eukaryotic peripheral membrane proteins deposited in UniProt or predicted with the use of MBPpred - a computational method that specializes in the detection of proteins that interact non-covalently with membrane lipids, via membrane binding domains. The first version of the database contains 231,770 peripheral membrane proteins from 1009 organisms.\n\n||| HOMEPAGE BROKEN!","homepage":"http://bioinformatics.biol.uoa.gr/db=permemdb","name":"PerMemDB"}}