{
    "additionDate": "2017-08-03T18:56:04Z",
    "biotoolsCURIE": "biotools:popgev",
    "biotoolsID": "popgev",
    "credit": [
        {
            "email": "yuanxh@iga.ac.cn",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Web-based browser that can conveniently show the results of population analysis.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.soyomics.com/popgev/help.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical inference",
                    "uri": "http://edamontology.org/operation_3658"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                }
            ]
        }
    ],
    "homepage": "http://www.soyomics.com/popgev/",
    "lastUpdate": "2018-12-10T12:58:43Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/popgev-web-based-large-scale-population-genome-browser.html"
        }
    ],
    "name": "PopGeV",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2015 The Author. Motivation: The development of high-throughput sequencing technology has made it possible for more and more researchers to use population sequencing data to mine genes associated with specific traits. However, the massive amounts of sequencing data have also brought new challenges to the researchers. The question of how to browse population genomic data in an easy and intuitive manner must be addressed. Web-based genome browsers allow user to conveniently view the results of genomic analyses, but heavy usage can reduce the response speed of the webpage, which limits its usefulness in the display of large-scale genome data. IndexedDB technology is a good solution to this problem; it supports web browsers and so creates local databases. In this way, data can be read from the local storage, achieving a smooth display of population genomic data. Results: PopGeV has the following characteristics. First, it uses a new encoding method for compression of population SNP and INDEL data. IndexedDB technology is used to download the results to local storage so that users can browse the results smoothly even when the network traffic is heavy. Second, PopGeV identify similar genomic regions between two individuals based on SNP data. Population diversity indexes are calculated when comparing two populations. Third, user defined annotation information can be integrated for user-friendly mining of gene functions. Simulation shows that PopGeV can smoothly display analysis results of population genome containing over 500 individuals with 2 millions SNP data.",
                "authors": [
                    {
                        "name": "Shi X."
                    },
                    {
                        "name": "Peng J."
                    },
                    {
                        "name": "Yu X."
                    },
                    {
                        "name": "Zhang X."
                    },
                    {
                        "name": "Li D."
                    },
                    {
                        "name": "Liu B."
                    },
                    {
                        "name": "Kong F."
                    },
                    {
                        "name": "Yuan X."
                    }
                ],
                "citationCount": 3,
                "date": "2015-07-31T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "PopGeV: A web-based large-scale population genome browser"
            },
            "pmid": "26002882"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        }
    ],
    "validated": 1
}