{
    "additionDate": "2019-11-14T18:20:37Z",
    "biotoolsCURIE": "biotools:U-PASS",
    "biotoolsID": "U-PASS",
    "confidence_flag": "tool",
    "description": "> CORRECT NAME OF TOOL COULD ALSO BE 'IMPLEMENTATION:U-PASS' | unified power analysis and forensics for qualitative traits in genetic association studies | GWAS power calculator / generic power calculations for large scale association tests. Built with R Shiny | U-PASS: a Unified Power Analysis of Association Studies",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Pill-GZ/U-PASS",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-31T13:46:10Z",
    "license": "MIT",
    "name": "U-PASS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ637",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press. All rights reserved.Despite the availability of existing calculators for statistical power analysis in genetic association studies, there has not been a model-invariant and test-independent tool that allows for both planning of prospective studies and systematic review of reported findings. In this work, we develop a web-based application U-PASS (Unified Power analysis of ASsociation Studies), implementing a unified framework for the analysis of common association tests for binary qualitative traits. The application quantifies the shared asymptotic power limits of the common association tests, and visualizes the fundamental statistical trade-off between risk allele frequency and odds ratio. The application also addresses the applicability of asymptotics-based power calculations in finite samples, and provides guidelines for single-SNP-based association tests. In addition to designing prospective studies, U-PASS enables researchers to retrospectively assess the statistical validity of previously reported associations.",
                "authors": [
                    {
                        "name": "Gao Z."
                    },
                    {
                        "name": "Stoev S."
                    },
                    {
                        "name": "Terhorst J."
                    },
                    {
                        "name": "Van Hout C.V."
                    }
                ],
                "citationCount": 1,
                "date": "2020-02-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "U-PASS: Unified power analysis and forensics for qualitative traits in genetic association studies"
            },
            "pmid": "31400194"
        }
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
