{
    "additionDate": "2019-11-14T18:43:18Z",
    "biotoolsCURIE": "biotools:LongTerm",
    "biotoolsID": "LongTerm",
    "confidence_flag": "low",
    "credit": [
        {
            "email": "vostinar@grinnell.edu",
            "name": "Anya E. Vostinar",
            "orcidid": "https://orcid.org/0000-0001-7216-5283",
            "typeEntity": "Person"
        }
    ],
    "description": "> LOW CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'Suicidal selection', 'PCD', 'kin', 'kin nonkin' | Programmed cell death can evolve in unicellular organisms due solely to kin selection | SuicidalAltruismDissertation",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://github.com/anyaevostinar/SuicidalAltruismDissertation/tree/master/LongTerm",
    "lastUpdate": "2019-11-14T18:43:18Z",
    "name": "LongTerm",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/ECE3.5460",
            "metadata": {
                "abstract": "© 2019 The Authors. Ecology and Evolution published by John Wiley & Sons Ltd.Abstract: Unicellular organisms can engage in a process by which a cell purposefully destroys itself, termed programmed cell death (PCD). While it is clear that the death of specific cells within a multicellular organism could increase inclusive fitness (e.g., during development), the origin of PCD in unicellular organisms is less obvious. Kin selection has been shown to help maintain instances of PCD in existing populations of unicellular organisms; however, competing hypotheses exist about whether additional factors are necessary to explain its origin. Those factors could include an environmental shift that causes latent PCD to be expressed, PCD hitchhiking on a large beneficial mutation, and PCD being simply a common pathology. Here, we present results using an artificial life model to demonstrate that kin selection can, in fact, be sufficient to give rise to PCD in unicellular organisms. Furthermore, when benefits to kin are direct—that is, resources provided to nearby kin—PCD is more beneficial than when benefits are indirect—that is, nonkin are injured, thus increasing the relative amount of resources for kin. Finally, when considering how strict organisms are in determining kin or nonkin (in terms of mutations), direct benefits are viable in a narrower range than indirect benefits. Open Research Badges: This article has been awarded Open Data and Open Materials Badges. All materials and data are publicly accessible via the Open Science Framework at https://github.com/anyaevostinar/SuicidalAltruismDissertation/tree/master/LongTerm.",
                "authors": [
                    {
                        "name": "Vostinar A.E."
                    },
                    {
                        "name": "Goldsby H.J."
                    },
                    {
                        "name": "Ofria C."
                    }
                ],
                "citationCount": 1,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Ecology and Evolution",
                "title": "Suicidal selection: Programmed cell death can evolve in unicellular organisms due solely to kin selection"
            },
            "pmcid": "PMC6706235",
            "pmid": "31463010"
        }
    ],
    "topic": [
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}