{
    "additionDate": "2020-01-09T17:35:39Z",
    "biotoolsCURIE": "biotools:DRUDIT",
    "biotoolsID": "DRUDIT",
    "confidence_flag": "tool",
    "description": "DRUDIT, Web-Based DRUgs DIscovery Tools to Design Small Molecules as Modulators of Biological Targets.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.drudit.com/DRUDIT_user_manual.pdf"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Service discovery",
                    "uri": "http://edamontology.org/operation_3761"
                }
            ]
        }
    ],
    "homepage": "http://www.drudit.com",
    "lastUpdate": "2020-12-22T12:24:34Z",
    "name": "DRUDIT",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ783",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press.Motivation: New in silico tools to predict biological affinities for input structures are presented. The tools are implemented in the DRUDIT (DRUgs DIscovery Tools) web service. The DRUDIT biological finder module is based on molecular descriptors that are calculated by the MOLDESTO (MOLecular DEScriptors TOol) software module developed by the same authors, which is able to calculate more than one thousand molecular descriptors. At this stage, DRUDIT includes 250 biological targets, but new external targets can be added. This feature extends the application scope of DRUDIT to several fields. Moreover, two more functions are implemented: the multi- and on/off-target tasks. These tools applied to input structures allow for predicting the polypharmacology and evaluating the collateral effects. Results: The applications described in the article show that DRUDIT is able to predict a single biological target, to identify similarities among biological targets, and to discriminate different target isoforms. The main advantages of DRUDIT for the scientific community lie in its ease of use by worldwide scientists and the possibility to be used also without specific, and often expensive, hardware and software. In fact, it is fully accessible through the WWW from any device to perform calculations. Just a click or a tap can start tasks to predict biological properties for new compounds or repurpose drugs, lead compounds, or unsuccessful compounds. To date, DRUDIT is supported by four servers each able to execute 8 jobs simultaneously.",
                "authors": [
                    {
                        "name": "Lauria A."
                    },
                    {
                        "name": "Mannino S."
                    },
                    {
                        "name": "Gentile C."
                    },
                    {
                        "name": "Mannino G."
                    },
                    {
                        "name": "Martorana A."
                    },
                    {
                        "name": "Peri D."
                    }
                ],
                "citationCount": 10,
                "date": "2020-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "DRUDIT: Web-based DRUgs DIscovery Tools to design small molecules as modulators of biological targets"
            },
            "pmid": "31605102"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}