{
    "additionDate": "2019-11-14T18:41:20Z",
    "biotoolsCURIE": "biotools:RNSCLC",
    "biotoolsID": "RNSCLC",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mahaitao7403@163.com",
            "name": "Haitao Ma",
            "orcidid": "https://orcid.org/0000-0002-2913-8033",
            "typeEntity": "Person"
        }
    ],
    "description": "RNSCLC-PRSP software to predict the prognostic risk and survival in patients with resected T1-3N0-2 M0 non-small cell lung cancer | Background:The clinical outcomes of patients with resected T1-3N0-2M0 non-small cell lung cancer (NSCLC) with the same tumor-node-metastasis (TNM) stage are diverse. Although other prognostic factors and prognostic prediction tools have been reported in many published studies, a convenient, accurate and specific prognostic prediction software for clinicians has not been developed. The purpose of our research was to develop this type of software that can analyze subdivided T and N staging and additional factors to predict prognostic risk and the corresponding mean and median survival time and 1-5-year survival rates of patients with resected T1-3N0-2M0 NSCLC. Results:Using a Cox proportional hazard regression model, we determined the independent prognostic factors and obtained a prognostic index (PI) eq",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://www.rnsclcpps.com",
    "lastUpdate": "2020-12-14T08:35:29Z",
    "name": "RNSCLC-PRSP software",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S13040-019-0205-0",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: The clinical outcomes of patients with resected T1-3N0-2M0 non-small cell lung cancer (NSCLC) with the same tumor-node-metastasis (TNM) stage are diverse. Although other prognostic factors and prognostic prediction tools have been reported in many published studies, a convenient, accurate and specific prognostic prediction software for clinicians has not been developed. The purpose of our research was to develop this type of software that can analyze subdivided T and N staging and additional factors to predict prognostic risk and the corresponding mean and median survival time and 1-5-year survival rates of patients with resected T1-3N0-2M0 NSCLC. Results: Using a Cox proportional hazard regression model, we determined the independent prognostic factors and obtained a prognostic index (PI) eq. PI = ∑βixi. =0.379X1-0.403X2-0.267X51-0.167X61-0.298X62 + 0.460X71 + 0.617X72-0.344X81-0.105X91-0.243X92 + 0.305X101 + 0.508X102 + 0.754X103 + 0.143X111 + 0.170X112 + 0.434X113-0.327X122-0.247X123 + 0.517X133 + 0.340X134 + 0.457X143 + 0.419X144 + 0.407X145. Using the PI equation, we determined the PI value of every patient. According to the quantile of the PI value, patients were divided into three risk groups: low-, intermediate-, and high-risk groups with significantly different survival rates. Meanwhile, we obtained the mean and median survival times and 1-5-year survival rates of the three groups. We developed the RNSCLC-PRSP software which is freely available on the web at http://www.rnsclcpps.com with all major browsers supported to determine the prognostic risk and associated survival of patients with resected T1-3N0-2 M0 non-small cell lung cancer. Conclusions: After prognostic factor analysis, prognostic risk grouping and corresponding survival assessment, we developed a novel software program. It is practical and convenient for clinicians to evaluate the prognostic risk and corresponding survival of patients with resected T1-3N0-2M0 NSCLC. Additionally, it has guiding significance for clinicians to make decisions about complementary treatment for patients.",
                "authors": [
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Ma H."
                    },
                    {
                        "name": "Zhang R."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "BioData Mining",
                "title": "RNSCLC-PRSP software to predict the prognostic risk and survival in patients with resected T1-3N0-2 M0 non-small cell lung cancer"
            },
            "pmcid": "PMC6708148",
            "pmid": "31462928"
        }
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        }
    ],
    "validated": 1
}
