{
    "accessibility": "Open access",
    "additionDate": "2022-10-05T22:59:19.913794Z",
    "biotoolsCURIE": "biotools:socialh",
    "biotoolsID": "socialh",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "juliadepaulasoaresvalente@gmail.com",
            "name": "Júlia de Paula Soares Valente",
            "orcidid": "https://orcid.org/0000-0001-8589-6747",
            "typeEntity": "Person"
        },
        {
            "name": "Maria Eugênia Zerlotti Mercadante"
        },
        {
            "name": "Matheus Deniz"
        },
        {
            "name": "Karolini Tenffen de Sousa",
            "orcidid": "https://orcid.org/0000-0003-4743-8547"
        },
        {
            "name": "Laila Talarico Dias",
            "orcidid": "https://orcid.org/0000-0002-8888-8993"
        }
    ],
    "description": "An R package for determining the social hierarchy of animals using data from individual electronic bins.",
    "documentation": [
        {
            "type": [
                "General",
                "User manual"
            ],
            "url": "https://cran.r-project.org/web/packages/socialh/socialh.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://cran.r-project.org/web/packages/socialh/index.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-10-05T22:59:19.916255Z",
    "license": "GPL-3.0",
    "name": "socialh",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0271337",
            "metadata": {
                "abstract": "© 2022 Valente et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Cattle have a complex social organization, with negative (agonistic) and positive (affiliative) interactions that affect access to environmental resources. Thus, the social behaviour has a major impact on animal production, and it is an important factor to improve the farm animal welfare. The use of data from electronic bins to determine social competition has already been validated; however, the studies used non-free software or did not make the code available. With data from electronic bins is possible to identify when one animal takes the place of another animal, i.e. a replacement occurs, at the feeders or drinkers. However, there is no package for the R environment to detect competitive replacements from electronic bins data. Our general approach consisted in creating a user-friendly R package for social behaviour analysis. The workflow of the socialh package comprises several steps that can be used sequentially or separately, allowing data input from electronic systems, or obtained from the animals' observation. We provide an overview of all functions of the socialh package and demonstrate how this package can be applied using data from electronic feed bins of beef cattle. The socialh package provides support for researchers to determine the social hierarchy of gregarious animals through the synthesis of agonistic interactions (or replacement) in a friendly, versatile, and open-access system, thus contributing to scientific research.",
                "authors": [
                    {
                        "name": "Deniz M."
                    },
                    {
                        "name": "Dias L.T."
                    },
                    {
                        "name": "Mercadante M.E.Z."
                    },
                    {
                        "name": "de Paula Soares Valente J."
                    },
                    {
                        "name": "de Sousa K.T."
                    }
                ],
                "date": "2022-08-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "socialh: An R package for determining the social hierarchy of animals using data from individual electronic bins"
            },
            "pmcid": "PMC9348686",
            "pmid": "35921355"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Ear, nose and throat medicine",
            "uri": "http://edamontology.org/topic_3406"
        },
        {
            "term": "Laboratory animal science",
            "uri": "http://edamontology.org/topic_3386"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ],
    "validated": 1
}
