
{
    "credit": [
        {
            "name": "Drug Design Group",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.ddg-pharmfac.net/ddg/index.html"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://www.ddg-pharmfac.net/AllerTOP/method.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Function analysis",
                "uri": "http://edamontology.org/topic_1775"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/allertop-2-allergenicity-prediction.html"
        }
    ],
    "publication": [
        {
            "abstract": "Allergy is an overreaction by the immune system to a previously encountered, ordinarily harmless substance - typically proteins - resulting in skin rash, swelling of mucous membranes, sneezing or wheezing, or other abnormal conditions. The use of modified proteins is increasingly widespread: their presence in food, commercial products, such as washing powder, and medical therapeutics and diagnostics, makes predicting and identifying potential allergens a crucial societal issue. The prediction of allergens has been explored widely using bioinformatics, with many tools being developed in the last decade; many of these are freely available online. Here, we report a set of novel models for allergen prediction utilizing amino acid E-descriptors, auto- and cross-covariance transformation, and several machine learning methods for classification, including logistic regression (LR), decision tree (DT), naïve Bayes (NB), random forest (RF), multilayer perceptron (MLP) and k nearest neighbours (kNN). The best performing method was kNN with 85.3% accuracy at 5-fold cross-validation. The resulting model has been implemented in a revised version of the AllerTOP server (http://www.ddg-pharmfac.net/AllerTOP). © Springer-Verlag 2014.",
            "authors": [
                "Dimitrov I.",
                "Bangov I.",
                "Flower D.R.",
                "Doytchinova I."
            ],
            "cit_count": 20,
            "journal": "Journal of Molecular Modeling",
            "pmid": "24878803",
            "title": "AllerTOP v.2 - A server for in silico prediction of allergens",
            "year": "2014-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:allertop",
        "biotoolsID": "allertop",
        "description": "Server for in silico prediction of allergens based on the main physicochemical properties of proteins.",
        "homepage": "http://www.ddg-pharmfac.net/AllerTOP/",
        "name": "AllerTOP"
    }
}