{
    "additionDate": "2017-07-27T22:08:11Z",
    "biotoolsCURIE": "biotools:metagen",
    "biotoolsID": "metagen",
    "credit": [
        {
            "email": "pbagos@compgen.org",
            "name": "Pantelis Bagos",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.compgen.org/people/pbagos"
        }
    ],
    "description": "metagen performs meta-analysis using fixed- and random-effects logistic regression models, treating the multiple genotypes as independent variables",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.compgen.org/tools/metagen"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "http://www.compgen.org/tools/metagen",
    "lastUpdate": "2018-12-10T12:58:53Z",
    "name": "METAGEN",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "itamposis",
    "publication": [
        {
            "metadata": {
                "abstract": "© The Author 2017. Motivation: In the context of genome-wide association studies (GWAS), there is a variety of statistical techniques in order to conduct the analysis, but, in most cases, the underlying genetic model is usually unknown. Under these circumstances, the classical Cochran-Armitage trend test (CATT) is suboptimal. Robust procedures that maximize the power and preserve the nominal type I error rate are preferable. Moreover, performing a meta-analysis using robust procedures is of great interest and has never been addressed in the past. The primary goal of this work is to implement several robust methods for analysis and meta-analysis in the statistical package Stata and subsequently to make the software available to the scientific community. Results: The CATT under a recessive, additive and dominant model of inheritance as well as robust methods based on the Maximum Efficiency Robust Test statistic, the MAX statistic and the MIN2 were implemented in Stata. Concerning MAX and MIN2, we calculated their asymptotic null distributions relying on numerical integration resulting in a great gain in computational time without losing accuracy. All the aforementioned approaches were employed in a fixed or a random effects meta-analysis setting using summary data with weights equal to the reciprocal of the combined cases and controls. Overall, this is the first complete effort to implement procedures for analysis and meta-analysis in GWAS using Stata. Availability and Implementation: A Stata program and a web-server are freely available for academic users at http://www.compgen.org/tools/GWAR .",
                "authors": [
                    {
                        "name": "Dimou N.L."
                    },
                    {
                        "name": "Tsirigos K.D."
                    },
                    {
                        "name": "Elofsson A."
                    },
                    {
                        "name": "Bagos P.G."
                    }
                ],
                "citationCount": 3,
                "date": "2017-05-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "GWAR: Robust analysis and meta-analysis of genome-wide association studies"
            },
            "pmid": "28108451"
        }
    ],
    "toolType": [
        "Script",
        "Command-line tool",
        "Plug-in"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}