{
    "additionDate": "2020-01-09T17:57:56Z",
    "biotoolsCURIE": "biotools:ZikaPLAN",
    "biotoolsID": "ZikaPLAN",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "anneliesws@gmail.com",
            "name": "Annelies Wilder-Smith",
            "orcidid": "https://orcid.org/0000-0003-0362-5375",
            "typeEntity": "Person"
        }
    ],
    "description": "addressing the knowledge gaps and working towards a research preparedness network in the Americas.\n\nFrom urgent response to long-term capacity.\n\nA global initiative to address research challenges posed by the Zika outbreak and build a sustainable response capacity in Latin America.\n\nResearch on track and productive exchanges with Colombian partners at the annual ZikaPLAN consortium meeting.\n\nOctober 28, 2019 - The Universidad del Valle hosted the annual ZikaPLAN meeting October 21-22, convening over 60 consortium members in Cali, Colombia. Read more.\n\nWe use cookies to track visits to our website, and we don't store any of your personal details. Find out more.\n\nThe Global Health Network The Global Health Network.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'REDe'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                }
            ]
        }
    ],
    "homepage": "https://zikaplan.tghn.org/",
    "lastUpdate": "2020-01-09T17:57:56Z",
    "name": "ZikaPLAN",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1080/16549716.2019.1666566",
            "metadata": {
                "abstract": "© 2019, © 2019 The Author(s). Published by Informa UK Limited, trading as Taylor & Francis Group.Zika Preparedness Latin American Network (ZikaPLAN) is a research consortium funded by the European Commission to address the research gaps in combating Zika and to establish a sustainable network with research capacity building in the Americas. Here we present a report on ZikaPLAN`s mid-term achievements since its initiation in October 2016 to June 2019, illustrating the research objectives of the 15 work packages ranging from virology, diagnostics, entomology and vector control, modelling to clinical cohort studies in pregnant women and neonates, as well as studies on the neurological complications of Zika infections in adolescents and adults. For example, the Neuroviruses Emerging in the Americas Study (NEAS) has set up more than 10 clinical sites in Colombia. Through the Butantan Phase 3 dengue vaccine trial, we have access to samples of 17,000 subjects in 14 different geographic locations in Brazil. To address the lack of access to clinical samples for diagnostic evaluation, ZikaPLAN set up a network of quality sites with access to well-characterized clinical specimens and capacity for independent evaluations. The International Committee for Congenital Anomaly Surveillance Tools was formed with global representation from regional networks conducting birth defects surveillance. We have collated a comprehensive inventory of resources and tools for birth defects surveillance, and developed an App for low resource regions facilitating the coding and description of all major externally visible congenital anomalies including congenital Zika syndrome. Research Capacity Network (REDe) is a shared and open resource centre where researchers and health workers can access tools, resources and support, enabling better and more research in the region. Addressing the gap in research capacity in LMICs is pivotal in ensuring broad-based systems to be prepared for the next outbreak. Our shared and open research space through REDe will be used to maximize the transfer of research into practice by summarizing the research output and by hosting the tools, resources, guidance and recommendations generated by these studies. Leveraging on the research from this consortium, we are working towards a research preparedness network.",
                "authors": [
                    {
                        "name": "Wilder-Smith A."
                    },
                    {
                        "name": "Preet R."
                    },
                    {
                        "name": "Brickley E.B."
                    },
                    {
                        "name": "Ximenes R.A.D.A."
                    },
                    {
                        "name": "Miranda-Filho D.D.B."
                    },
                    {
                        "name": "Turchi Martelli C.M."
                    },
                    {
                        "name": "Araujo T.V.B.D."
                    },
                    {
                        "name": "Montarroyos U.R."
                    },
                    {
                        "name": "Moreira M.E."
                    },
                    {
                        "name": "Turchi M.D."
                    },
                    {
                        "name": "Solomon T."
                    },
                    {
                        "name": "Jacobs B.C."
                    },
                    {
                        "name": "Villamizar C.P."
                    },
                    {
                        "name": "Osorio L."
                    },
                    {
                        "name": "de Filipps A.M.B."
                    },
                    {
                        "name": "Neyts J."
                    },
                    {
                        "name": "Kaptein S."
                    },
                    {
                        "name": "Huits R."
                    },
                    {
                        "name": "Arien K.K."
                    },
                    {
                        "name": "Willison H.J."
                    },
                    {
                        "name": "Edgar J.M."
                    },
                    {
                        "name": "Barnett S.C."
                    },
                    {
                        "name": "Peeling R."
                    },
                    {
                        "name": "Boeras D."
                    },
                    {
                        "name": "Guzman M.G."
                    },
                    {
                        "name": "de Silva A.M."
                    },
                    {
                        "name": "Falconar A.K."
                    },
                    {
                        "name": "Romero-Vivas C."
                    },
                    {
                        "name": "Gaunt M.W."
                    },
                    {
                        "name": "Sette A."
                    },
                    {
                        "name": "Weiskopf D."
                    },
                    {
                        "name": "Lambrechts L."
                    },
                    {
                        "name": "Dolk H."
                    },
                    {
                        "name": "Morris J.K."
                    },
                    {
                        "name": "Orioli I.M."
                    },
                    {
                        "name": "O'Reilly K.M."
                    },
                    {
                        "name": "Yakob L."
                    },
                    {
                        "name": "Rocklov J."
                    },
                    {
                        "name": "Soares C."
                    },
                    {
                        "name": "Ferreira M.L.B."
                    },
                    {
                        "name": "Franca R.F.D.O."
                    },
                    {
                        "name": "Precioso A.R."
                    },
                    {
                        "name": "Logan J."
                    },
                    {
                        "name": "Lang T."
                    },
                    {
                        "name": "Jamieson N."
                    },
                    {
                        "name": "Massad E."
                    }
                ],
                "citationCount": 2,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Global Health Action",
                "title": "ZikaPLAN: addressing the knowledge gaps and working towards a research preparedness network in the Americas"
            },
            "pmcid": "PMC6818126",
            "pmid": "31640505"
        }
    ],
    "topic": [
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Virology",
            "uri": "http://edamontology.org/topic_0781"
        },
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Allergy, clinical immunology and immunotherapeutics",
            "uri": "http://edamontology.org/topic_3400"
        }
    ]
}