{
    "additionDate": "2021-01-18T09:10:49Z",
    "biotoolsCURIE": "biotools:mgms2",
    "biotoolsID": "mgms2",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "soyoungr@unr.edu",
            "name": "So Young Ryu",
            "typeEntity": "Person"
        }
    ],
    "description": "Membrane glycolipid mass spectrum simulator for polymicrobial samples.\n\n'MGMS2' for Polymicrobial Samples.\n\nA glycolipid mass spectrometry technology has the potential to accurately identify individual bacterial species from polymicrobial samples.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Mass spectrum visualisation",
                    "uri": "http://edamontology.org/operation_3694"
                },
                {
                    "term": "Peak detection",
                    "uri": "http://edamontology.org/operation_3215"
                },
                {
                    "term": "Spectral library search",
                    "uri": "http://edamontology.org/operation_3801"
                },
                {
                    "term": "Spectrum calculation",
                    "uri": "http://edamontology.org/operation_3860"
                }
            ]
        }
    ],
    "homepage": "https://CRAN.R-project.org/package=MGMS2",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-22T08:44:50Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/soyoungryu/Interactive_MGMS2"
        }
    ],
    "name": "MGMS2",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1002/RCM.8824",
            "metadata": {
                "abstract": "© 2020 John Wiley & Sons, Ltd.Rationale: Polymicrobial samples present unique challenges for mass spectrometric identification. A recently developed glycolipid technology has the potential to accurately identify individual bacterial species from polymicrobial samples. In order to develop and validate bacterial identification algorithms (e.g. machine learning) using this glycolipid technology, generating a large number of various polymicrobial samples can be beneficial, but it is costly and labor-intensive. Here, we propose an alternative cost-effective approach that generates realistic in silico polymicrobial glycolipid mass spectra. Methods: We introduce MGMS2 (membrane glycolipid mass spectrum simulator) as a simulation software package that generates in silico polymicrobial membrane glycolipid matrix-assisted laser desorption/ionization time-of-flight mass spectra. Unlike currently available simulation algorithms for polymicrobial mass spectra, the proposed algorithm considers errors in m/z values and variances of intensity values, occasions of missing signature ions, and noise peaks. To our knowledge, this is the first stand-alone bacterial membrane glycolipid mass spectral simulator. MGMS2 software and its manual are freely available as an R package. An interactive MGSM2 app that helps users explore various simulation parameter options is also available. Results: We demonstrated the performance of MGSM2 using six microbes. The software generated in silico glycolipid mass spectra that are similar to real polymicrobial glycolipid mass spectra. The maximum correlation between in silico mass spectra generated by MGMS2 and the real polymicrobial mass spectrum was about 87%. Conclusions: We anticipate that MGMS2, which considers spectrum-to-spectrum variation, will advance the bacterial algorithm development for polymicrobial samples.",
                "authors": [
                    {
                        "name": "Ernst R.K."
                    },
                    {
                        "name": "Goodlett D.R."
                    },
                    {
                        "name": "Ryu S.Y."
                    },
                    {
                        "name": "Wendt G.A."
                    }
                ],
                "date": "2020-08-30T00:00:00Z",
                "journal": "Rapid Communications in Mass Spectrometry",
                "title": "MGMS2: Membrane glycolipid mass spectrum simulator for polymicrobial samples"
            },
            "pmcid": "PMC7466374",
            "pmid": "32384576"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Sample collections",
            "uri": "http://edamontology.org/topic_3277"
        }
    ]
}
