{
    "additionDate": "2021-01-18T12:17:34Z",
    "biotoolsCURIE": "biotools:multi-scattering",
    "biotoolsID": "multi-scattering",
    "confidence_flag": "tool",
    "description": "Online accelerated Monte Carlo simulation of light transport through scattering media.\n\nSimulating light propagation in turbid media.\n\nWelcome to \"Multi-Scattering\" a freely accessible online software for the modeling of light propagation in scattering and absorbing media. Possible applications of the model are the prediction of photon transport in tissues, blood samples, clouds, smoke, fog, turbid liquids, spray systems, etc. As the simulations are run from a computer server at the Department of Physics at Lund University, any researcher can log in and use it freely without any programming skills or requirements for any software/hardware installations.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "https://multi-scattering.com/",
    "lastUpdate": "2021-03-02T08:14:30Z",
    "name": "Multi-Scattering",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1364/OE.404005",
            "metadata": {
                "abstract": "© 2020 Optical Society of America.In this article we present and describe an online freely accessible software called Multi-Scattering for the modeling of light propagation in scattering and absorbing media. Part II of this article series focuses on the validation of the model by rigorously comparing the simulated results with experimental data. The model is based on the use of the Monte Carlo method, where billions of photon packets are being tracked through simulated cubic volumes. Simulations are accelerated by the use of general-purpose computing on graphics processing units, reducing the computation time by a factor up to 200x in comparison with a single central processing unit thread. By using four graphic cards on a single computer, the simulation speed increases by a factor of 800x. For an anisotropy factor g = 0.86, this enables the transport path of one billion photons to be computed in 10 seconds for optical depth OD= 10 and in 20 minutes for OD= 500. Another feature of Multi-Scattering is the integration and implementation of the Lorenz-Mie theory in the software to generate the scattering phase functions from spherical particles. The simulations are run from a computer server at Lund University, allowing researchers to log in and use it freely without any prior need for programming skills or specific software/hardware installations. There are countless types of scattering media in which this model can be used to predict light transport, including medical tissues, blood samples, clouds, smoke, fog, turbid liquids, spray systems, etc. An example of simulation results is given here for photon propagation through a piece of human head. The software also includes features for modeling image formation by inserting a virtual collecting lens and a detection matrix which simulate a camera objective and a sensor array respectively. The user interface for setting-up simulations and for displaying the corresponding results is found at: https://multi-scattering.com/.",
                "authors": [
                    {
                        "name": "Jonsson J."
                    },
                    {
                        "name": "Berrocal E."
                    }
                ],
                "citationCount": 1,
                "date": "2020-12-07T00:00:00Z",
                "journal": "Optics Express",
                "title": "Multi-Scattering software: Part I: Online accelerated Monte Carlo simulation of light transport through scattering media"
            },
            "pmid": "33379594"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        }
    ]
}