{
    "additionDate": "2020-01-14T09:18:58Z",
    "biotoolsCURIE": "biotools:CaPTk",
    "biotoolsID": "CaPTk",
    "confidence_flag": "tool",
    "description": "NIMG-70. QUANTITATIVE IMAGE ANALYSIS AND MACHINE LEARNING TECHNIQUES FOR DISTINGUISHING TRUE PROGRESSION FROM PSEUDOPROGRESSION IN PATIENTS WITH GLIOBLASTOMA.\n\nPerelman School of Medicine at the University of Pennsylvania.\n\nThe Center for Biomedical Image Computing and Analytics (CBICA) was established in 2013, and focuses on the development and application of advanced computational and analytical techniques that quantify morphology and function from biomedical images, as well as on relating imaging phenotypes to genetic and molecular characterizations, and finally on integrating this information into diagnostic and predictive tools in an era of personalized medicine.\n\nCenter for Biomedical Image Computing & Analytics.\n\nCancer Imaging Phenomics Toolkit (CaPTk).\n\nCaPTk is a software platform for analysis of radiographic cancer images, currently focusing on brain, breast, and lung cancer",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "http://www.cbica.upenn.edu/captk",
    "lastUpdate": "2021-02-07T13:20:58Z",
    "name": "CaPTk",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1200/CCI.19.00121",
            "metadata": {
                "abstract": "© 2020 by American Society of Clinical OncologyPURPOSE To construct a multi-institutional radiomic model that supports upfront prediction of progression-free survival (PFS) and recurrence pattern (RP) in patients diagnosed with glioblastoma multiforme (GBM) at the time of initial diagnosis. PATIENTS AND METHODS We retrospectively identified data for patients with newly diagnosed GBM from two institutions (institution 1, n = 65; institution 2, n = 15) who underwent gross total resection followed by standard adjuvant chemoradiation therapy, with pathologically confirmed recurrence, sufficient follow-up magnetic resonance imaging (MRI) scans to reliably determine PFS, and available presurgical multiparametric MRI (MP-MRI). The advanced software suite Cancer Imaging Phenomics Toolkit (CaPTk) was leveraged to analyze standard clinical brain MP-MRI scans. A rich set of imaging features was extracted from the MP-MRI scans acquired before the initial resection and was integrated into two distinct imaging signatures for predicting mean shorter or longer PFS and near or distant RP. The predictive signatures for PFS and RP were evaluated on the basis of different classification schemes: single-institutional analysis, multi-institutional analysis with random partitioning of the data into discovery and replication cohorts, and multi-institutional assessment with data from institution 1 as the discovery cohort and data from institution 2 as the replication cohort. RESULTS These predictors achieved cross-validated classification performance (ie, area under the receiver operating characteristic curve) of 0.88 (single-institution analysis) and 0.82 to 0.83 (multi-institution analysis) for prediction of PFS and 0.88 (single-institution analysis) and 0.56 to 0.71 (multi-institution analysis) for prediction of RP. CONCLUSION Imaging signatures of presurgical MP-MRI scans reveal relatively high predictability of time and location of GBM recurrence, subject to the patients receiving standard first-line chemoradiation therapy. Through its graphical user interface, CaPTk offers easy accessibility to advanced computational algorithms for deriving imaging signatures predictive of clinical outcome and could similarly be used for a variety of radiomic and radiogenomic analyses.",
                "authors": [
                    {
                        "name": "Akbari H."
                    },
                    {
                        "name": "Badve C."
                    },
                    {
                        "name": "Bagley S.J."
                    },
                    {
                        "name": "Bakas S."
                    },
                    {
                        "name": "Barnholtz-Sloan J.S."
                    },
                    {
                        "name": "Bergman M."
                    },
                    {
                        "name": "Bilello M."
                    },
                    {
                        "name": "Davatzikos C."
                    },
                    {
                        "name": "Ha S.M."
                    },
                    {
                        "name": "Kazerooni A.F."
                    },
                    {
                        "name": "Kontos D."
                    },
                    {
                        "name": "Lustig R.A."
                    },
                    {
                        "name": "Mohan S."
                    },
                    {
                        "name": "Nasrallah M."
                    },
                    {
                        "name": "O'Rourke D.M."
                    },
                    {
                        "name": "Pati S."
                    },
                    {
                        "name": "Rathore S."
                    },
                    {
                        "name": "Rudie J.D."
                    },
                    {
                        "name": "Sako C."
                    },
                    {
                        "name": "Shukla G."
                    },
                    {
                        "name": "Singh A."
                    },
                    {
                        "name": "Sloan A.E."
                    }
                ],
                "citationCount": 11,
                "date": "2019-01-01T00:00:00Z",
                "journal": "JCO Clinical Cancer Informatics",
                "title": "Cancer Imaging Phenomics via CaPTk: Multi-Institutional Prediction of Progression-Free Survival and Pattern of Recurrence in Glioblastoma"
            },
            "pmcid": "PMC7113126",
            "pmid": "32191542"
        },
        {
            "doi": "10.1093/NEUONC/NOY148.794",
            "pmcid": "PMC6216519"
        }
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Phenomics",
            "uri": "http://edamontology.org/topic_3298"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        }
    ],
    "validated": 1
}
