{
    "accessibility": "Open access",
    "additionDate": "2024-02-25T14:24:16.153524Z",
    "biotoolsCURIE": "biotools:deep-avpiden",
    "biotoolsID": "deep-avpiden",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "sks.cse@iitbhu.ac.in",
            "name": "Sanjay Kumar Singh",
            "typeEntity": "Person"
        },
        {
            "email": "vishakhasingh.rs.cse20@iitbhu.ac.in",
            "name": "Vishakha Singh",
            "typeEntity": "Person"
        }
    ],
    "description": "A separable temporal convolutional networks based deep learning technique for discovering antiviral medicines.\nThe model behind this app is based on Temporal Convolutional Network (TCN). It uses the amino acid sequences of a given peptide as input and predicts whether the peptide is antifungal or not. The model consists of a word embedding layer, a spatial dropout layer, two TCN blocks, a global average pooling layer, a dense layer, and a dropout layer.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein sequence",
                        "uri": "http://edamontology.org/data_2976"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                }
            ]
        }
    ],
    "homepage": "https://deep-avpiden.anvil.app",
    "lastUpdate": "2024-11-24T14:13:18.129973Z",
    "license": "CC-BY-4.0",
    "name": "Deep-AVPiden",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1038/s41598-023-40922-y",
            "metadata": {
                "abstract": "An alarming number of fatalities caused by the COVID-19 pandemic has forced the scientific community to accelerate the process of therapeutic drug discovery. In this regard, the collaboration between biomedical scientists and experts in artificial intelligence (AI) has led to a number of in silico tools being developed for the initial screening of therapeutic molecules. All living organisms produce antiviral peptides (AVPs) as a part of their first line of defense against invading viruses. The Deep-AVPiden model proposed in this paper and its corresponding web app, deployed at https://deep-avpiden.anvil.app , is an effort toward discovering novel AVPs in proteomes of living organisms. Apart from Deep-AVPiden, a computationally efficient model called Deep-AVPiden (DS) has also been developed using the same underlying network but with point-wise separable convolutions. The Deep-AVPiden and Deep-AVPiden (DS) models show an accuracy of 90% and 88%, respectively, and both have a precision of 90%. Also, the proposed models were statistically compared using the Student’s t-test. On comparing the proposed models with the state-of-the-art classifiers, it was found that they are much better than them. To test the proposed model, we identified some AVPs in the natural defense proteins of plants, mammals, and fishes and found them to have appreciable sequence similarity with some experimentally validated antimicrobial peptides. These AVPs can be chemically synthesized and tested for their antiviral activity.",
                "authors": [
                    {
                        "name": "Singh S.K."
                    },
                    {
                        "name": "Singh V."
                    }
                ],
                "citationCount": 4,
                "date": "2023-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "A separable temporal convolutional networks based deep learning technique for discovering antiviral medicines"
            },
            "pmcid": "PMC10444765",
            "pmid": "37608092"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
