{
    "additionDate": "2017-08-03T18:45:55Z",
    "biotoolsCURIE": "biotools:hh-suite",
    "biotoolsID": "hh-suite",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "soeding@mpibpc.mpg.de",
            "name": "Johannes Söding",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.mpibpc.mpg.de/soeding"
        }
    ],
    "description": "Open-source software package for sensitive protein sequence searching based on the pairwise alignment of hidden Markov models (HMMs).",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/soedinglab/hh-suite/wiki"
        }
    ],
    "download": [
        {
            "type": "Software package",
            "url": "https://github.com/soedinglab/hh-suite/releases/download/v3.3.0/hhsuite-3.3.0-AVX2-Linux.tar.gz",
            "version": "Linux AVX2 v3.3"
        },
        {
            "type": "Software package",
            "url": "https://github.com/soedinglab/hh-suite/releases/download/v3.3.0/hhsuite-3.3.0-SSE2-Linux.tar.gz",
            "version": "Linux SSE2 v3.3"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pairwise sequence alignment",
                    "uri": "http://edamontology.org/operation_0491"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "homepage": "https://github.com/soedinglab/hh-suite",
    "language": [
        "C",
        "C++"
    ],
    "lastUpdate": "2020-09-03T23:37:28Z",
    "license": "GPL-3.0",
    "link": [
        {
            "note": "MPI Toolkit offering access to HH-suite tools over the web",
            "type": [
                "Other"
            ],
            "url": "https://toolkit.tuebingen.mpg.de/"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/soedinglab/hh-suite/issues"
        }
    ],
    "maturity": "Mature",
    "name": "HH-suite",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "milot-mirdita",
    "publication": [
        {
            "doi": "10.1038/nmeth.1818",
            "metadata": {
                "abstract": "Sequence-based protein function and structure prediction depends crucially on sequence-search sensitivity and accuracy of the resulting sequence alignments. We present an open-source, general-purpose tool that represents both query and database sequences by profile hidden Markov models (HMMs): 'HMM-HMM-based lightning-fast iterative sequence search' (HHblits; http://toolkit.genzentrum.lmu.de/hhblits/). Compared to the sequence-search tool PSI-BLAST, HHblits is faster owing to its discretized-profile prefilter, has 50-100% higher sensitivity and generates more accurate alignments. © 2012 Nature America, Inc. All rights reserved.",
                "authors": [
                    {
                        "name": "Biegert A."
                    },
                    {
                        "name": "Hauser A."
                    },
                    {
                        "name": "Remmert M."
                    },
                    {
                        "name": "Soding J."
                    }
                ],
                "citationCount": 1028,
                "date": "2012-02-01T00:00:00Z",
                "journal": "Nature Methods",
                "title": "HHblits: Lightning-fast iterative protein sequence searching by HMM-HMM alignment"
            },
            "type": [
                "Other"
            ]
        },
        {
            "doi": "10.1093/bioinformatics/bti125",
            "metadata": {
                "abstract": "Motivation: Protein homology detection and sequence alignment are at the basis of protein structure prediction, function prediction and evolution. Results: We have generalized the alignment of protein sequences with a profile hidden Markov model (HMM) to the case of pairwise alignment of profile HMMs. We present a method for detecting distant homologous relationships between proteins based on this approach. The method (HHsearch) is benchmarked together with BLAST, PSI-BLAST, HMMER and the profile-profile comparison tools PROF_SIM and COMPASS, in an all-against-all comparison of a database of 3691 protein domains from SCOP 1.63 with pairwise sequence identities below 20%. Sensitivity: When the predicted secondary structure is included in the HMMs, HHsearch is able to detect between 2.7 and 4.2 times more homologs than PSI-BLAST or HMMER and between 1.44 and 1.9 times more than COMPASS or PROF_SIM for a rate of false positives of 10%. Approximately half of the improvement over the profile-profile comparison methods is attributable to the use of profile HMMs in place of simple profiles. Alignment quality: Higher sensitivity is mirrored by an increased alignment quality. HHsearch produced 1.2, 1.7 and 3.3 times more good alignments ('balanced' score > 0.3) than the next best method (COMPASS), and 1.6, 2.9 and 9.4 times more than PSI-BLAST, at the family, superfamily and fold level, respectively. Speed: HHsearch scans a query of 200 residues against 3691 domains in 33 s on an AMD64 2GHz PC. This is 10 times faster than PROF_SIM and 17 times faster than COMPASS. © The Author 2004. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Soding J."
                    }
                ],
                "citationCount": 1694,
                "date": "2005-04-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Protein homology detection by HMM-HMM comparison"
            },
            "type": [
                "Other"
            ]
        },
        {
            "doi": "10.1093/bioinformatics/bts622",
            "metadata": {
                "abstract": "Motivation: Protein sequence searching and alignment are fundamental tools of modern biology. Alignments are assessed using their similarity scores, essentially the sum of substitution matrix scores over all pairs of aligned amino acids. We previously proposed a generative probabilistic method that yields scores that take the sequence context around each aligned residue into account. This method showed drastically improved sensitivity and alignment quality compared with standard substitution matrix-based alignment.Results: Here, we develop an alternative discriminative approach to predict sequence context-specific substitution scores. We applied our approach to compute context-specific sequence profiles for Basic Local Alignment Search Tool (BLAST) and compared the new tool (CS-BLASTdis) to BLAST and the previous context-specific version (CS-BLASTgen). On a dataset filtered to 20% maximum sequence identity, CS-BLASTdisis was 51% more sensitive than BLAST and 17% more sensitive than CS-BLASTgenin, detecting remote homologues at 10% false discovery rate. At 30% maximum sequence identity, its alignments contain 21 and 12% more correct residue pairs than those of BLAST and CS-BLASTgen, respectively. Clear improvements are also seen when the approach is combined with PSI-BLAST and HHblits. We believe the context-specific approach should replace substitution matrices wherever sensitivity and alignment quality are critical.Availability: Source code (GNU General Public License, version 3) and benchmark data are available at ftp://toolkit.genzentrum.lmu.de/pub/csblast/. © 2012 The Author.",
                "authors": [
                    {
                        "name": "Angermuller C."
                    },
                    {
                        "name": "Biegert A."
                    },
                    {
                        "name": "Soding J."
                    }
                ],
                "citationCount": 38,
                "date": "2012-12-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Discriminative modelling of context-specific amino acid substitution probabilities"
            },
            "type": [
                "Other"
            ]
        },
        {
            "doi": "10.1093/nar/gkw1081",
            "metadata": {
                "abstract": "© The Author(s) 2016.We present three clustered protein sequence databases, Uniclust90, Uniclust50, Uniclust30 and three databases of multiple sequence alignments (MSAs), Uniboost10, Uniboost20 and Uniboost30, as a resource for protein sequence analysis, function prediction and sequence searches. The Uniclust databases cluster UniProtKB sequences at the level of 90%, 50% and 30% pairwise sequence identity. Uniclust90 and Uniclust50 clusters showed better consistency of functional annotation than those of UniRef90 and UniRef50, owing to an optimised clustering pipeline that runs with our MMseqs2 software for fast and sensitive protein sequence searching and clustering. Uniclust sequences are annotated with matches to Pfam, SCOP domains, and proteins in the PDB, using our HHblits homology detection tool. Due to its high sensitivity, Uniclust contains 17% more Pfam domain annotations than UniProt. Uniboost MSAs of three diversities are built by enriching the Uniclust30 MSAs with local sequence matches from MMseqs2 profile searches through Uniclust30. All databases can be downloaded from the Uniclust server at uniclust.mmseqs.com. Users can search clusters by keywords and explore their MSAs, taxonomic representation, and annotations. Uniclust is updated every two months with the new UniProt release.",
                "authors": [
                    {
                        "name": "Galiez C."
                    },
                    {
                        "name": "Martin M.J."
                    },
                    {
                        "name": "Mirdita M."
                    },
                    {
                        "name": "Soding J."
                    },
                    {
                        "name": "Steinegger M."
                    },
                    {
                        "name": "Von Den Driesch L."
                    }
                ],
                "citationCount": 94,
                "date": "2017-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Uniclust databases of clustered and deeply annotated protein sequences and alignments"
            },
            "type": [
                "Other"
            ]
        },
        {
            "doi": "10.1186/s12859-019-3019-7",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: HH-suite is a widely used open source software suite for sensitive sequence similarity searches and protein fold recognition. It is based on pairwise alignment of profile Hidden Markov models (HMMs), which represent multiple sequence alignments of homologous proteins. Results: We developed a single-instruction multiple-data (SIMD) vectorized implementation of the Viterbi algorithm for profile HMM alignment and introduced various other speed-ups. These accelerated the search methods HHsearch by a factor 4 and HHblits by a factor 2 over the previous version 2.0.16. HHblits3 is 10× faster than PSI-BLAST and 20× faster than HMMER3. Jobs to perform HHsearch and HHblits searches with many query profile HMMs can be parallelized over cores and over cluster servers using OpenMP and message passing interface (MPI). The free, open-source, GPLv3-licensed software is available at https://github.com/soedinglab/hh-suite. Conclusion: The added functionalities and increased speed of HHsearch and HHblits should facilitate their use in large-scale protein structure and function prediction, e.g. in metagenomics and genomics projects.",
                "authors": [
                    {
                        "name": "Haunsberger S.J."
                    },
                    {
                        "name": "Meier M."
                    },
                    {
                        "name": "Mirdita M."
                    },
                    {
                        "name": "Soding J."
                    },
                    {
                        "name": "Steinegger M."
                    },
                    {
                        "name": "Vohringer H."
                    }
                ],
                "citationCount": 91,
                "date": "2019-09-14T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "HH-suite3 for fast remote homology detection and deep protein annotation"
            },
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1101/560029",
            "type": [
                "Other"
            ]
        },
        {
            "metadata": {
                "abstract": "© 2015 Meier, Söding.Homology modeling predicts the 3D structure of a query protein based on the sequence alignment with one or more template proteins of known structure. Its great importance for biological research is owed to its speed, simplicity, reliability and wide applicability, covering more than half of the residues in protein sequence space. Although multiple templates have been shown to generally increase model quality over single templates, the information from multiple templates has so far been combined using empirically motivated, heuristic approaches. We present here a rigorous statistical framework for multi-template homology modeling. First, we find that the query proteins’ atomic distance restraints can be accurately described by two-component Gaussian mixtures. This insight allowed us to apply the standard laws of probability theory to combine restraints from multiple templates. Second, we derive theoretically optimal weights to correct for the redundancy among related templates. Third, a heuristic template selection strategy is proposed. We improve the average GDT-ha model quality score by 11% over single template modeling and by 6.5% over a conventional multi-template approach on a set of 1000 query proteins. Robustness with respect to wrong constraints is likewise improved. We have integrated our multi-template modeling approach with the popular MODELLER homology modeling software in our free HHpred server http://toolkit.tuebingen.mpg.de/hhpred and also offer open source software for running MODELLER with the new restraints at https://bitbucket.org/soedinglab/hh-suite.",
                "authors": [
                    {
                        "name": "Meier A."
                    },
                    {
                        "name": "Soding J."
                    }
                ],
                "citationCount": 63,
                "date": "2015-01-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Automatic Prediction of Protein 3D Structures by Probabilistic Multi-template Homology Modeling"
            },
            "pmid": "26496371",
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Suite"
    ],
    "topic": [
        {
            "term": "Protein sites, features and motifs",
            "uri": "http://edamontology.org/topic_3510"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        }
    ],
    "validated": 1
}
