
{
    "credit": [
        {
            "email": "bezer@upatras.gr",
            "name": "Prof. Anastasios Bezerianos",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://biosignal.med.upatras.gr/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://biosignal.med.upatras.gr/wordpress/olympus"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "MATLAB"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "Microbiology",
                "uri": "http://edamontology.org/topic_3301"
            },
            {
                "term": "Infectious disease",
                "uri": "http://edamontology.org/topic_3324"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/olympus-hybrid-clustering-method-in-time-series-gene-expression.html"
        }
    ],
    "publication": [
        {
            "abstract": "The increasing flow of short time series microarray experiments for the study of dynamic cellular processes poses the need for efficient clustering tools. These tools must deal with three primary issues: first, to consider the multi-functionality of genes; second, to evaluate the similarity of the relative change of amplitude in the time domain rather than the absolute values; third, to cope with the constraints of conventional clustering algorithms such as the assignment of the appropriate cluster number. To address these, we propose OLYMPUS, a novel unsupervised clustering algorithm that integrates Differential Evolution (DE) method into Fuzzy Short Time Series (FSTS) algorithm with the scope to utilize efficiently the information of population of the first and enhance the performance of the latter. Our hybrid approach provides sets of genes that enable the deciphering of distinct phases in dynamic cellular processes.We proved the efficiency of OLYMPUS on synthetic as well as on experimental data. The discriminative power of OLYMPUS provided clusters, which refined the so far perspective of the dynamics of host response mechanisms to Influenza A (H1N1). Our kinetic model sets a timeline for several pathways and cell populations, implicated to participate in host response; yet no timeline was assigned to them (e.g. cell cycle, homeostasis). Regarding the activity of B cells, our approach revealed that some antibody-related mechanisms remain activated until day 60 post infection.The Matlab codes for implementing OLYMPUS, as well as example datasets, are freely accessible via the Web (http://biosignal.med.upatras.gr/wordpress/biosignal/). © 2013 Elsevier Ireland Ltd.",
            "authors": [
                "Dimitrakopoulou K.",
                "Vrahatis A.G.",
                "Wilk E.",
                "Tsakalidis A.K.",
                "Bezerianos A."
            ],
            "cit_count": 4,
            "journal": "Computer Methods and Programs in Biomedicine",
            "pmid": "23796450",
            "title": "OLYMPUS: An automated hybrid clustering method in time series gene expression. Case study: Host response after Influenza A (H1N1) infection",
            "year": "2013-09-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:olympus",
        "biotoolsID": "olympus",
        "description": "Automated hybrid clustering method in the field of time series gene expression analysis.",
        "homepage": "http://biosignal.med.upatras.gr/wordpress/?page_id=173",
        "name": "OLYMPUS"
    }
}