{
    "additionDate": "2018-07-31T15:10:45Z",
    "biotoolsCURIE": "biotools:ramp",
    "biotoolsID": "ramp",
    "credit": [
        {
            "email": "Ewy.Mathe@osumc.edu",
            "name": "Ewy A. Mathé",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A Comprehensive Relational Database of Metabolomics Pathways for Pathway Enrichment Analysis of Genes and Metabolites.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/Mathelab/RaMP-DB"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Mathelab/RaMP-DB",
    "language": [
        "R",
        "SQL"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "RaMP",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.3390/metabo8010016",
            "metadata": {
                "abstract": "© 2018 by the authors. Licensee MDPI, Basel, Switzerland.The value of metabolomics in translational research is undeniable, and metabolomics data are increasingly generated in large cohorts. The functional interpretation of disease-associated metabolites though is difficult, and the biological mechanisms that underlie cell type or disease-specific metabolomics profiles are oftentimes unknown. To help fully exploit metabolomics data and to aid in its interpretation, analysis of metabolomics data with other complementary omics data, including transcriptomics, is helpful. To facilitate such analyses at a pathway level, we have developed RaMP (Relational database of Metabolomics Pathways), which combines biological pathways from the Kyoto Encyclopedia of Genes and Genomes (KEGG), Reactome, WikiPathways, and the Human Metabolome DataBase (HMDB). To the best of our knowledge, an off-the-shelf, public database that maps genes and metabolites to biochemical/disease pathways and can readily be integrated into other existing software is currently lacking. For consistent and comprehensive analysis, RaMP enables batch and complex queries (e.g., list all metabolites involved in glycolysis and lung cancer), can readily be integrated into pathway analysis tools, and supports pathway overrepresentation analysis given a list of genes and/or metabolites of interest. For usability, we have developed a RaMP R package (https://github.com/Mathelab/RaMP-DB), including a user-friendly RShiny web application, that supports basic simple and batch queries, pathway overrepresentation analysis given a list of genes or metabolites of interest, and network visualization of gene-metabolite relationships. The package also includes the raw database file (mysql dump), thereby providing a stand-alone downloadable framework for public use and integration with other tools. In addition, the Python code needed to recreate the database on another system is also publicly available (https://github.com/Mathelab/RaMP-BackEnd). Updates for databases in RaMP will be checked multiple times a year and RaMP will be updated accordingly.",
                "authors": [
                    {
                        "name": "Zhang B."
                    },
                    {
                        "name": "Hu S."
                    },
                    {
                        "name": "Baskin E."
                    },
                    {
                        "name": "Patt A."
                    },
                    {
                        "name": "Siddiqui J.K."
                    },
                    {
                        "name": "Mathe E.A."
                    }
                ],
                "citationCount": 9,
                "date": "2018-03-01T00:00:00Z",
                "journal": "Metabolites",
                "title": "RaMP: A comprehensive relational database of metabolomics pathways for pathway enrichment analysis of genes and metabolites"
            },
            "pmcid": "PMC5876005",
            "pmid": "29470400"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Data management",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Metabolic pathways",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}