
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "labels": {
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Humans",
                "uri": "http://edamontology.org/topic_2815"
            },
            {
                "term": "Mapping",
                "uri": "http://edamontology.org/topic_0102"
            },
            {
                "term": "Genetic variation",
                "uri": "http://edamontology.org/topic_0199"
            },
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "DNA polymorphism",
                "uri": "http://edamontology.org/topic_2885"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Although large-scale genetic association studies involving hundreds to thousands of SNPs have become feasible, the associated cost is substantial. Even with the increased efficiency introduced by the use of tagSNPs, researchers are often seeking ways to maximize resource utilization given a set of SNPbased gene-mapping goals. We have developed a web server named QuickSNP in order to provide cost-effective selection of SNPs, and to fill in some of the gaps in existing SNP selection tools. One useful feature of QuickSNP is the option to select only gene-centric SNPs from a chromosomal region in an automated fashion. Other useful features include automated selection of coding nonsynonymous SNPs, SNP filtering based on inter-SNP distances and information regarding the availability of genotyping assays for SNPs and whether they are present on whole genome chips. The program produces user-friendly summary tables and results, and a link to a UCSC Genome Browser track illustrating the position of the selected tagSNPs in relation to genes and other genomic features. We hope the unique combination of features of this server will be useful for researchers aiming to select markers for their genotyping studies. The server is freely available and can be accessed at the URL http://bioinformoodics. jhmi.edu/quickSNP.pl. © 2007 The Author(s).",
            "authors": [
                "Grover D.",
                "Woodfield A.S.",
                "Verma R.",
                "Zandi P.P.",
                "Levinson D.F.",
                "Potash J.B."
            ],
            "cit_count": 19,
            "journal": "Nucleic Acids Research",
            "pmid": "17517769",
            "title": "QuickSNP: An automated web server for selection of tagSNPs",
            "year": "2007-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:quicksnp",
        "biotoolsID": "quicksnp",
        "description": "Resource for the selection of tagSNPs in the human genome that includes a gene-centric selection module.",
        "homepage": "http://bioinformoodics.jhmi.edu/quickSNP.pl",
        "name": "QuickSNP"
    }
}