
{
    "credit": [
        {
            "email": "cczhong@eecs.ucf.edu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://genome.ucf.edu/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://genome.ucf.edu/RNAMotifScanX/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence motif recognition",
                    "uri": "http://edamontology.org/operation_0239"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "RNA",
                "uri": "http://edamontology.org/topic_0099"
            },
            {
                "term": "Nucleic acid sites, features and motifs",
                "uri": "http://edamontology.org/topic_3511"
            },
            {
                "term": "Nucleic acid structure analysis",
                "uri": "http://edamontology.org/topic_0097"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/rnamotifscanx-graph-alignment-approach-for-rna-structural-motif-identification.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2015 Zhong and ZhangRNA structural motifs are recurrent three-dimensional (3D) components found in the RNA architecture. These RNA structural motifs play important structural or functional roles and usually exhibit highly conserved 3D geometries and base-interaction patterns. Analysis of the RNA 3D structures and elucidation of their molecular functions heavily rely on efficient and accurate identification of these motifs. However, efficient RNA structural motif search tools are lacking due to the high complexity of these motifs. In this work, we present RNAMotifScanX, a motif search tool based on a base-interaction graph alignment algorithm. This novel algorithm enables automatic identification of both partially and fully matched motif instances. RNAMotifScanX considers noncanonical base-pairing interactions, base-stacking interactions, and sequence conservation of the motifs, which leads to significantly improved sensitivity and specificity as compared with other state-of-the-art search tools. RNAMotifScanX also adopts a carefully designed branch-and-bound technique, which enables ultra-fast search of large kink-turn motifs against a 23S rRNA. The software package RNAMotifScanX is implemented using GNU C++, and is freely available from http://genome.ucf.edu/RNAMotifScanX.",
            "authors": [
                "Zhong C.",
                "Zhang S."
            ],
            "cit_count": 1,
            "journal": "RNA",
            "pmid": "25595715",
            "title": "RNAMotifScanX: A graph alignment approach for RNA structural motif identification",
            "year": "2015-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:rnamotifscanx",
        "biotoolsID": "rnamotifscanx",
        "description": "RNAMotifScanX is a motif search tool based on a base-interaction graph alignment algorithm.",
        "homepage": "http://genome.ucf.edu/RNAMotifScanX/",
        "name": "RNAMotifScanX"
    }
}