
{
    "credit": [
        {
            "email": "sartorma@umich.edu",
            "name": "Maureen A. Sartor",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://sartorlab.ccmb.med.umich.edu/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://sartorlab.ccmb.med.umich.edu/node/6"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "ChIP-seq",
                "uri": "http://edamontology.org/topic_3169"
            },
            {
                "term": "DNA binding sites",
                "uri": "http://edamontology.org/topic_3125"
            },
            {
                "term": "Nucleic acid sites, features and motifs",
                "uri": "http://edamontology.org/topic_3511"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/pepr-peak-prioritization-pipeline.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2014 The Author. Motivation: ChIP-Seq is the standard method to identify genomewide DNA-binding sites for transcription factors (TFs) and histone modifications. There is a growing need to analyze experiments with biological replicates, especially for epigenomic experiments where variation among biological samples can be substantial. However, tools that can perform group comparisons are currently lacking. Results: We present a peak-calling prioritization pipeline (PePr) for identifying consistent or differential binding sites in ChIP-Seq experiments with biological replicates. PePr models read counts across the genome among biological samples with a negative binomial distribution and uses a local variance estimation method, ranking consistent or differential binding sites more favorably than sites with greater variability. We compared PePr with commonly used and recently proposed approaches on eight TF datasets and show that PePr uniquely identifies consistent regions with enriched read counts, high motif occurrence rate and known characteristics of TF binding based on visual inspection. For histone modification data with broadly enriched regions, PePr identified differential regions that are consistent within groups and outperformed other methods in scaling False Discovery Rate (FDR) analysis.",
            "authors": [
                "Zhang Y.",
                "Lin Y.-H.",
                "Johnson T.D.",
                "Rozek L.S.",
                "Sartor M.A."
            ],
            "cit_count": 33,
            "journal": "Bioinformatics",
            "pmid": "24894502",
            "title": "PePr: A peak-calling prioritization pipeline to identify consistent or differential peaks from replicated ChIP-Seq data",
            "year": "2014-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:pepr",
        "biotoolsID": "pepr",
        "description": "Analysis pipeline for ChIP-Seq experiments with biological replicates, written and available as python scripts.",
        "homepage": "http://sartorlab.ccmb.med.umich.edu/node/6",
        "name": "PePr"
    }
}