{
    "name": "TLINKAGE", 
    "description": "The programs described here are an extension of the general LINKAGE programs for genetic linkage analysis. The extension consists of allowing for a disease phenotype to be under the control of two loci.", 
    "homepage": "http://www.jurgott.org/linkage/tlinkage.htm", 
    "biotoolsID": "tlinkage", 
    "biotoolsCURIE": "biotools:tlinkage", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0283", 
                    "term": "Linkage analysis"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0102", 
            "term": "Mapping"
        }, 
        {
            "uri": "http://edamontology.org/topic_0634", 
            "term": "Pathology"
        }, 
        {
            "uri": "http://edamontology.org/topic_3053", 
            "term": "Genetics"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows"
    ], 
    "language": [
        "Pascal"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/tlinkage-20-two-locus-linkage-analysis.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://www.jurgott.org/linkage/tlinkage.htm", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "8213836", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Two-trait-locus linkage analysis: A powerful strategy for mapping complex genetic traits", 
                "abstract": "Recent advances in molecular biology have provided geneticists with ever- increasing numbers of highly polymorphic genetic markers that have made possible linkage mapping of loci responsible for many human diseases. However, nearly all diseases mapped to date follow clear Mendelian, single- locus segregation patterns. In contrast, many common familial diseases such as diabetes, psoriasis, several forms of cancer, and schizophrenia are familial and appear to have a genetic component but do not exhibit simple Mendelian transmission. More complex models are required to explain the genetics of these important diseases. In this paper, we explore two-trait- locus, two-marker-locus linkage analysis in which two trait loci are mapped simultaneously to separate genetic markers. We compare the utility of this approach to standard one-trait-locus, one-marker-locus linkage analysis with and without allowance for heterogeneity. We also compare the utility of the two-trait-locus, two-marker-locus analysis to two-trait-locus, one-marker- locus linkage analysis. For common diseases, pedigrees are often bilineal, with disease genes entering via two or more unrelated pedigree members. Since such pedigrees often are avoided in linkage studies, we also investigate the relative information content of unilineal and bilineal pedigrees. For the dominant-or-recessive and threshold models that we consider, we find that two-trait-locus, two-marker-locus linkage analysis can provide substantially more linkage information, as measured by expected maximum lod score, than standard one-trait-locus, one-marker-locus methods, even allowing for heterogeneity, while, for a dominant-or-dominant generating model, one-locus models that allow for heterogeneity extract essentially as much information as the two-trait-locus methods. For these three models, we also find that bilineal pedigrees provide sufficient linkage information to warrant their inclusion in such studies. We also discuss strategies for assessing the significance of the two linkages assumed in two-trait-locus, two-marker- locus models.", 
                "date": "1993-01-01T00:00:00Z", 
                "citationCount": 134, 
                "authors": [
                    {
                        "name": "Schork N.J."
                    }, 
                    {
                        "name": "Boehnke M."
                    }, 
                    {
                        "name": "Terwilliger J.D."
                    }, 
                    {
                        "name": "Ott J."
                    }
                ], 
                "journal": "American Journal of Human Genetics"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": "ott@rockefeller.edu", 
            "url": "http://www.jurgott.org/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T19:02:50Z", 
    "lastUpdate": "2018-12-10T12:58:51Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}