{
    "additionDate": "2020-09-03T18:58:28Z",
    "biotoolsCURIE": "biotools:shiftcrypt",
    "biotoolsID": "shiftcrypt",
    "collectionID": [
        "VIB",
        "VUB",
        "IBSquare"
    ],
    "credit": [
        {
            "email": "wim.vranken@vub.be",
            "name": "Wim F Vranken",
            "orcidid": "https://orcid.org/0000-0001-7470-4324",
            "typeEntity": "Person"
        }
    ],
    "description": "a web server to understand and biophysically align proteins through their NMR chemical shift values.\n\nShiftCrypt: Auto-encoding NMR chemical shifts from their native vector space to a residue-level biophysical index.\n\nThese are the oxidised thioredoxins shown in the ShiftCrypt paper, the first one is bmr6318 (A. thaliana), the second one bmr25703 (S. cervisiae). You can then upload and align these proteins.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bio2byte.be:5003/shiftcrypt/documentation#Sec2"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pairwise sequence alignment",
                    "uri": "http://edamontology.org/operation_0491"
                },
                {
                    "term": "Spectral analysis",
                    "uri": "http://edamontology.org/operation_3214"
                }
            ]
        }
    ],
    "homepage": "http://www.bio2byte.be/shiftcrypt",
    "lastUpdate": "2020-09-05T08:45:45Z",
    "name": "ShiftCrypt",
    "owner": "bits@vib.be",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA391",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.Nuclear magnetic resonance (NMR) spectroscopy data provides valuable information on the behaviour of proteins in solution. The primary data to determine when studying proteins are the per-atom NMR chemical shifts, which reflect the local environment of atoms and provide insights into amino acid residue dynamics and conformation. Within an amino acid residue, chemical shifts present multi-dimensional and complexly cross-correlated information, making them difficult to analyse. The ShiftCrypt method, based on neural network auto-encoder architecture, compresses the per-amino acid chemical shift information in a single, interpretable, amino acid-type independent value that reflects the biophysical state of a residue. We here present the ShiftCrypt web server, which makes the method readily available. The server accepts chemical shifts input files in the NMR Exchange Format (NEF) or NMR-STAR format, executes ShiftCrypt and visualises the results, which are also accessible via an API. It also enables the \"biophysically-based\" pairwise alignment of two proteins based on their ShiftCrypt values. This approach uses Dynamic Time Warping and can optionally include their amino acid code information, and has applications in, for example, the alignment of disordered regions. The server uses a token-based system to ensure the anonymity of the users and results. The web server is available at www.bio2byte.be/shiftcrypt.",
                "authors": [
                    {
                        "name": "Orlando G."
                    },
                    {
                        "name": "Raimondi D."
                    },
                    {
                        "name": "Kagami L.P."
                    },
                    {
                        "name": "Vranken W.F."
                    }
                ],
                "date": "2020-07-02T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "ShiftCrypt: a web server to understand and biophysically align proteins through their NMR chemical shift values"
            },
            "pmcid": "PMC7319548",
            "pmid": "32459331"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Biophysics",
            "uri": "http://edamontology.org/topic_3306"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}