{
    "additionDate": "2019-11-14T19:33:32Z",
    "biotoolsCURIE": "biotools:PRISM-methylation",
    "biotoolsID": "PRISM-methylation",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "sunkim.bioinfo@snu.ac.kr",
            "name": "Sun Kim",
            "typeEntity": "Person"
        }
    ],
    "description": "> NAME EQUAL TO (PUB. DIFFERENT) bio.tools/prism-ppi | > NAME (PRISM) SIMILAR TO (PUB. DIFFERENT) bio.tools/prism_3 (PRISM 3), bio.tools/prism-primer (PriSM), bio.tools/prism (PrISM) | methylation pattern-based, reference-free inference of subclonal makeup | Methylation Pattern-based, Reference-free Inference of Subclonal Makeup. (v1.0.1) | PRISM requires the mapping result of Bismark, a bisulfite read mapping tool. Also note that PRISM only applies to RRBS data, and unfortunately, the feasibility of PRISM to the data from other methylation profiling techniques such as whole genome bisulfite sequencing (WGBS), methylated DNA immunoprecipitation sequencing (MeDIP-Seq), or methyl-CpG binding domain-based capture sequencing (MBDCap-Seq) has not been verified | BAM file of RRBS reads, aligned by Bismark",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Bisulfite mapping",
                    "uri": "http://edamontology.org/operation_3186"
                },
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Whole genome methylation analysis",
                    "uri": "http://edamontology.org/operation_3206"
                }
            ]
        }
    ],
    "homepage": "https://github.com/dohlee/prism",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-06T10:37:16Z",
    "license": "MIT",
    "name": "PRISM",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ327",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Motivation: Characterizing cancer subclones is crucial for the ultimate conquest of cancer. Thus, a number of bioinformatic tools have been developed to infer heterogeneous tumor populations based on genomic signatures such as mutations and copy number variations. Despite accumulating evidence for the significance of global DNA methylation reprogramming in certain cancer types including myeloid malignancies, none of the bioinformatic tools are designed to exploit subclonally reprogrammed methylation patterns to reveal constituent populations of a tumor. In accordance with the notion of global methylation reprogramming, our preliminary observations on acute myeloid leukemia (AML) samples implied the existence of subclonally occurring focal methylation aberrance throughout the genome. Results: We present PRISM, a tool for inferring the composition of epigenetically distinct subclones of a tumor solely from methylation patterns obtained by reduced representation bisulfite sequencing. PRISM adopts DNA methyltransferase 1-like hidden Markov model-based in silico proofreading for the correction of erroneous methylation patterns. With error-corrected methylation patterns, PRISM focuses on a short individual genomic region harboring dichotomous patterns that can be split into fully methylated and unmethylated patterns. Frequencies of such two patterns form a sufficient statistic for subclonal abundance. A set of statistics collected from each genomic region is modeled with a beta-binomial mixture. Fitting the mixture with expectation-maximization algorithm finally provides inferred composition of subclones. Applying PRISM for two AML samples, we demonstrate that PRISM could infer the evolutionary history of malignant samples from an epigenetic point of view.",
                "authors": [
                    {
                        "name": "Kim S."
                    },
                    {
                        "name": "Lee D."
                    },
                    {
                        "name": "Lee S."
                    }
                ],
                "date": "2019-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "PRISM: Methylation pattern-based, reference-free inference of subclonal makeup"
            },
            "pmcid": "PMC6612819",
            "pmid": "31510697"
        }
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Methylated DNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3674"
        }
    ],
    "validated": 1
}
