{
    "additionDate": "2021-01-18T11:13:37Z",
    "biotoolsCURIE": "biotools:rnasnap2",
    "biotoolsID": "rnasnap2",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jaswinder.singh3@griffithuni.edu.au",
            "name": "Jaswinder Singh",
            "typeEntity": "Person"
        },
        {
            "email": "yaoqi.zhou@griffith.edu.au",
            "name": "Yaoqi Zhou",
            "typeEntity": "Person"
        }
    ],
    "description": "Single-sequence and profile-based prediction of RNA solvent accessibility using dilated convolutional neural network.\n\n\nRNA solvent accessibility, similar to protein solvent accessibility, reflects the structural regions that are accessible to solvents or other functional biomolecules, and plays an important role for structural and functional characterization. Unlike protein solvent accessibility, only a few tools are available for predicting RNA solvent accessibility despite the fact that millions of RNA transcripts have unknown structures and functions. Also, these tools have limited accuracy. Here, we have developed RNAsnap2 that employs a dilated convolutional neural network (Figure 1) with a new feature, based on predicted base-pairing probabilities from LinearPartition[4].",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA structure prediction",
                    "uri": "http://edamontology.org/operation_2441"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "RNA secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0278"
                },
                {
                    "term": "Sequence profile alignment",
                    "uri": "http://edamontology.org/operation_0300"
                }
            ]
        }
    ],
    "homepage": "https://sparks-lab.org/server/rnasnap2",
    "language": [
        "Perl",
        "Python",
        "Shell"
    ],
    "lastUpdate": "2021-02-07T12:45:53Z",
    "license": "MPL-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/jaswindersingh2/RNAsnap2"
        }
    ],
    "name": "RNAsnap2",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA652",
            "metadata": {
                "abstract": "© 2020 Oxford University Press. All rights reserved.Motivation: RNA solvent accessibility, similar to protein solvent accessibility, reflects the structural regions that are accessible to solvents or other functional biomolecules, and plays an important role for structural and functional characterization. Unlike protein solvent accessibility, only a few tools are available for predicting RNA solvent accessibility despite the fact that millions of RNA transcripts have unknown structures and functions. Also, these tools have limited accuracy. Here, we have developed RNAsnap2 that uses a dilated convolutional neural network with a new feature, based on predicted base-pairing probabilities from LinearPartition. Results: Using the same training set from the recent predictor RNAsol, RNAsnap2 provides an 11% improvement in median Pearson Correlation Coefficient (PCC) and 9% improvement in mean absolute errors for the same test set of 45 RNA chains. A larger improvement (22% in median PCC) is observed for 31 newly deposited RNA chains that are non-redundant and independent from the training and the test sets. A single-sequence version of RNAsnap2 (i.e. without using sequence profiles generated from homology search by Infernal) has achieved comparable performance to the profile-based RNAsol. In addition, RNAsnap2 has achieved comparable performance for protein-bound and protein-free RNAs. Both RNAsnap2 and RNAsnap2 (SingleSeq) are expected to be useful for searching structural signatures and locating functional regions of non-coding RNAs. Availability and implementation: Standalone-versions of RNAsnap2 and RNAsnap2 (SingleSeq) are available at https://github.com/jaswindersingh2/RNAsnap2. Direct prediction can also be made at https://sparks-lab.org/server/ rnasnap2. The datasets used in this research can also be downloaded from the GITHUB and the webserver mentioned above.",
                "authors": [
                    {
                        "name": "Hanumanthappa A.K."
                    },
                    {
                        "name": "Singh J."
                    },
                    {
                        "name": "Paliwal K."
                    },
                    {
                        "name": "Singh J."
                    },
                    {
                        "name": "Zhou Y."
                    }
                ],
                "citationCount": 2,
                "date": "2020-11-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Single-sequence and profile-based prediction of RNA solvent accessibility using dilated convolutional neural network"
            },
            "pmid": "33106872"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ]
}