{
    "additionDate": "2020-01-14T20:04:53Z",
    "biotoolsCURIE": "biotools:VGE",
    "biotoolsID": "VGE",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "sito@hgc.jp",
            "name": "Satoshi Ito",
            "typeEntity": "Person"
        }
    ],
    "description": "a simulated grid engine environment for large-scale supercomputers.\n\nVirtual Grid Engine (VGE) is a kind of middleware for running bioinformatics software pipelines on large-scale supercomputers which do not support any grid engine survices. VGE employs master-worker model. It first reserves processors and/or cores by running the job which is parallelized by MPI, then asign divided small tasks onto its worker processes. VGE is written in python.\n\nCopyright (c) 2017 Satoshi ITO, Masaaki YADOME, and Satoru MIYANO.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'Virtual Grid Engine'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "https://github.com/SatoshiITO/VGE",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-01-14T20:04:53Z",
    "name": "VGE",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3085-X",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Supercomputers have become indispensable infrastructures in science and industries. In particular, most state-of-the-art scientific results utilize massively parallel supercomputers ranked in TOP500. However, their use is still limited in the bioinformatics field due to the fundamental fact that the asynchronous parallel processing service of Grid Engine is not provided on them. To encourage the use of massively parallel supercomputers in bioinformatics, we developed middleware called Virtual Grid Engine, which enables software pipelines to automatically perform their tasks as MPI programs. Result: We conducted basic tests to check the time required to assign jobs to workers by VGE. The results showed that the overhead of the employed algorithm was 246 microseconds and our software can manage thousands of jobs smoothly on the K computer. We also tried a practical test in the bioinformatics field. This test included two tasks, the split and BWA alignment of input FASTQ data. 25,055 nodes (2,000,440 cores) were used for this calculation and accomplished it in three hours. Conclusion: We considered that there were four important requirements for this kind of software, non-privilege server program, multiple job handling, dependency control, and usability. We carefully designed and checked all requirements. And this software fulfilled all the requirements and achieved good performance in a large scale analysis.",
                "authors": [
                    {
                        "name": "Ito S."
                    },
                    {
                        "name": "Yadome M."
                    },
                    {
                        "name": "Nishiki T."
                    },
                    {
                        "name": "Ishiduki S."
                    },
                    {
                        "name": "Inoue H."
                    },
                    {
                        "name": "Yamaguchi R."
                    },
                    {
                        "name": "Miyano S."
                    }
                ],
                "date": "2019-12-02T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Virtual Grid Engine: A simulated grid engine environment for large-scale supercomputers"
            },
            "pmcid": "PMC6886159",
            "pmid": "31787090"
        }
    ],
    "topic": [
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        },
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}