{
    "additionDate": "2020-01-09T17:47:17Z",
    "biotoolsCURIE": "biotools:BLUES",
    "biotoolsID": "BLUES",
    "confidence_flag": "tool",
    "description": "Rapid Decorrelation of Ligand Binding Modes Using Nonequilibrium Candidate Monte Carlo.\n\nApplications of nonequilibrium candidate Monte Carlo (NCMC) to ligand binding mode sampling.\n\nBLUES: Binding modes of Ligands Using Enhanced Sampling.\n\nGill, S; Lim, N. M.; Grinaway, P.; Rustenburg, A. S.; Fass, J.; Ross, G.; Chodera, J. D.; Mobley, D. L. “Binding Modes of Ligands Using Enhanced Sampling (BLUES): Rapid Decorrelation of Ligand Binding Modes Using Nonequilibrium Candidate Monte Carlo” - Journal of Physical Chemistry B. February 27, 2018",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                },
                {
                    "term": "Protein-protein docking",
                    "uri": "http://edamontology.org/operation_3899"
                }
            ]
        }
    ],
    "homepage": "http://github.com/MobleyLab/blues",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T20:47:13.913881Z",
    "license": "MIT",
    "name": "BLUES",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/acs.jpcb.7b11820",
            "metadata": {
                "abstract": "Accurately predicting protein-ligand binding affinities and binding modes is a major goal in computational chemistry, but even the prediction of ligand binding modes in proteins poses major challenges. Here, we focus on solving the binding mode prediction problem for rigid fragments. That is, we focus on computing the dominant placement, conformation, and orientations of a relatively rigid, fragment-like ligand in a receptor, and the populations of the multiple binding modes which may be relevant. This problem is important in its own right, but is even more timely given the recent success of alchemical free energy calculations. Alchemical calculations are increasingly used to predict binding free energies of ligands to receptors. However, the accuracy of these calculations is dependent on proper sampling of the relevant ligand binding modes. Unfortunately, ligand binding modes may often be uncertain, hard to predict, and/or slow to interconvert on simulation time scales, so proper sampling with current techniques can require prohibitively long simulations. We need new methods which dramatically improve sampling of ligand binding modes. Here, we develop and apply a nonequilibrium candidate Monte Carlo (NCMC) method to improve sampling of ligand binding modes. In this technique, the ligand is rotated and subsequently allowed to relax in its new position through alchemical perturbation before accepting or rejecting the rotation and relaxation as a nonequilibrium Monte Carlo move. When applied to a T4 lysozyme model binding system, this NCMC method shows over 2 orders of magnitude improvement in binding mode sampling efficiency compared to a brute force molecular dynamics simulation. This is a first step toward applying this methodology to pharmaceutically relevant binding of fragments and, eventually, drug-like molecules. We are making this approach available via our new Binding modes of ligands using enhanced sampling (BLUES) package which is freely available on GitHub.",
                "authors": [
                    {
                        "name": "Chodera J.D."
                    },
                    {
                        "name": "Fass J."
                    },
                    {
                        "name": "Gill S.C."
                    },
                    {
                        "name": "Grinaway P.B."
                    },
                    {
                        "name": "Lim N.M."
                    },
                    {
                        "name": "Mobley D.L."
                    },
                    {
                        "name": "Ross G.A."
                    },
                    {
                        "name": "Rustenburg A.S."
                    }
                ],
                "citationCount": 51,
                "date": "2018-05-31T00:00:00Z",
                "journal": "Journal of Physical Chemistry B",
                "title": "Binding Modes of Ligands Using Enhanced Sampling (BLUES): Rapid Decorrelation of Ligand Binding Modes via Nonequilibrium Candidate Monte Carlo"
            },
            "pmcid": "PMC5980761",
            "pmid": "29486559",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.26434/CHEMRXIV.5406907.V2",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.26434/CHEMRXIV.5406907.V3",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.26434/CHEMRXIV.5406907.V4",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.26434/CHEMRXIV.5406907.V5",
            "type": [
                "Primary"
            ]
        }
    ],
    "topic": [
        {
            "term": "Biophysics",
            "uri": "http://edamontology.org/topic_3306"
        },
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ],
    "validated": 1
}
