{
    "accessibility": "Open access",
    "additionDate": "2022-02-02T23:45:02.205933Z",
    "biotoolsCURIE": "biotools:same-ecos",
    "biotoolsID": "same-ecos",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "lhwsci@gmail.com",
            "name": "Hanwen Liu",
            "orcidid": "https://orcid.org/0000-0002-5052-1424"
        },
        {
            "name": "Cornelia Laule",
            "orcidid": "https://orcid.org/0000-0002-9785-6918"
        },
        {
            "name": "Piotr Kozlowski",
            "orcidid": "https://orcid.org/0000-0002-6462-2891"
        },
        {
            "name": "Tigris S. Joseph"
        }
    ],
    "description": "Spectrum analysis for multiple exponentials via experimental condition oriented simulation (SAME-ECOS).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Spectral analysis",
                    "uri": "http://edamontology.org/operation_3214"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "https://github.com/hanwencat/SAME-ECOS",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-02-02T23:45:02.208562Z",
    "license": "Not licensed",
    "name": "SAME-ECOS",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1002/MRM.29000",
            "metadata": {
                "abstract": "© 2021 International Society for Magnetic Resonance in MedicinePurpose: The decomposition of multi-exponential decay data into a T2 spectrum poses substantial challenges for conventional fitting algorithms, including non-negative least squares (NNLS). Based on a combination of the resolution limit constraint and machine learning neural network algorithm, a data-driven and highly tailorable analysis method named spectrum analysis for multiple exponentials via experimental condition oriented simulation (SAME-ECOS) was proposed. Theory and Methods: The theory of SAME-ECOS was derived. Then, a paradigm was presented to demonstrate the SAME-ECOS workflow, consisting of a series of calculation, simulation, and model training operations. The performance of the trained SAME-ECOS model was evaluated using simulations and six in vivo brain datasets. The code is available at https://github.com/hanwencat/SAME-ECOS. Results: Using NNLS as the baseline, SAME-ECOS achieved over 15% higher overall cosine similarity scores in producing the T2 spectrum, and more than 10% lower mean absolute error in calculating the myelin water fraction (MWF), as well as demonstrated better robustness to noise in the simulation tests. Applying to in vivo data, MWF from SAME-ECOS and NNLS was highly correlated among all study participants. However, a distinct separation of the myelin water peak and the intra/extra-cellular water peak was only observed in the mean T2 spectra determined using SAME-ECOS. In terms of data processing speed, SAME-ECOS is approximately 30 times faster than NNLS, achieving a whole-brain analysis in 3 min. Conclusion: Compared with NNLS, the SAME-ECOS method yields much more reliable T2 spectra in a dramatically shorter time, increasing the feasibility of multi-component T2 decay analysis in clinical settings.",
                "authors": [
                    {
                        "name": "Liu H."
                    },
                    {
                        "name": "Joseph T.S."
                    },
                    {
                        "name": "Xiang Q.-S."
                    },
                    {
                        "name": "Tam R."
                    },
                    {
                        "name": "Kozlowski P."
                    },
                    {
                        "name": "Li D.K.B."
                    },
                    {
                        "name": "MacKay A.L."
                    },
                    {
                        "name": "Kramer J.L.K."
                    },
                    {
                        "name": "Laule C."
                    }
                ],
                "date": "2022-02-01T00:00:00Z",
                "journal": "Magnetic Resonance in Medicine",
                "title": "A data-driven T2 relaxation analysis approach for myelin water imaging: Spectrum analysis for multiple exponentials via experimental condition oriented simulation (SAME-ECOS)"
            },
            "pmid": "34490909"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}