{
    "accessibility": "Open access",
    "additionDate": "2020-01-14T09:43:04Z",
    "biotoolsCURIE": "biotools:Conservation_Archive",
    "biotoolsID": "Conservation_Archive",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "molly.grace@zoo.ox.ac.uk",
            "name": "Molly Grace",
            "orcidid": "https://orcid.org/0000-0002-1978-615X",
            "typeEntity": "Person"
        }
    ],
    "description": "A database portal containing esources that can be used to infer baseline species conditions.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://conservationarchive.shinyapps.io/ConservationArchive/",
    "lastUpdate": "2021-01-11T12:31:49Z",
    "name": "Conservation Archive",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1098/RSTB.2019.0297",
            "metadata": {
                "abstract": "© 2019 The Author(s) Published by the Royal Society. All rights reserved.Historical data are a valuable resource for addressing present-day conservation issues, for example by informing the establishment of appropriate recovery targets. However, while the recovery of threatened species is the end goal of many conservation programmes, data made available through the efforts of palaeoecologists and historical ecologists are rarely consulted. The proposal of a 'Green List of Species' by the International Union for Conservation of Nature (IUCN) will soon change this. The Green List of Species measures recovery against historical baselines; in particular, the method requires estimates of species range and abundance in previous centuries. In this paper, we present the case for why setting species recovery against a historical baseline is necessary to produce ambitious conservation targets, and we highlight examples from palaeoecology and historical ecology where fossil and archival data have been used to establish historical species baselines. Finally, we introduce Conservation Archive (https://conservationarchive.shinyapps.io/ConservationArchive/), a database of resources that can be used to infer baseline species conditions, and invite contributions to this database. This article is part of a discussion meeting issue 'The past is a foreign country: how much can the fossil record actually inform conservation?'.",
                "authors": [
                    {
                        "name": "Grace M."
                    },
                    {
                        "name": "Resit Akcakaya H."
                    },
                    {
                        "name": "Bennett E."
                    },
                    {
                        "name": "Hilton-Taylor C."
                    },
                    {
                        "name": "Long B."
                    },
                    {
                        "name": "Milner-Gulland E.J."
                    },
                    {
                        "name": "Young R."
                    },
                    {
                        "name": "Hoffmann M."
                    }
                ],
                "citationCount": 13,
                "date": "2019-12-23T00:00:00Z",
                "journal": "Philosophical Transactions of the Royal Society B: Biological Sciences",
                "title": "Using historical and palaeoecological data to inform ambitious species recovery targets"
            },
            "pmcid": "PMC6863500",
            "pmid": "31679497"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        }
    ],
    "validated": 1
}