
{
    "credit": [
        {
            "email": "johnq@tigr.org",
            "name": "johnq@tigr.org",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://compbio.dfci.harvard.edu/tgi/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "EST assembly",
                    "uri": "http://edamontology.org/operation_0526"
                },
                {
                    "term": "Sequence tag mapping",
                    "uri": "http://edamontology.org/operation_0527"
                },
                {
                    "term": "Gene functional annotation",
                    "uri": "http://edamontology.org/operation_3672"
                },
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Gene transcripts",
                "uri": "http://edamontology.org/topic_3512"
            },
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "Mapping",
                "uri": "http://edamontology.org/topic_0102"
            },
            {
                "term": "Model organisms",
                "uri": "http://edamontology.org/topic_0621"
            },
            {
                "term": "Sequence assembly",
                "uri": "http://edamontology.org/topic_0196"
            }
        ]
    },
    "publication": [
        {
            "abstract": "While genome sequencing projects are advancing rapidly, EST sequencing and analysis remains a primary research tool for the identification and categorization of gene sequences in a wide variety of species and an important resource for annotation of genomic sequence. The TIGR Gene Indices (http:// www.tigr.org/tdb/tgi.shtml) are a collection of species-specific databases that use a highly refined protocol to analyze EST sequences in an attempt to identify the genes represented by that data and to provide additional information regarding those genes. Gene Indices are constructed by first clustering, then assembling EST and annotated gene sequences from GenBank for the targeted species. This process produces a set of unique, high-fidelity virtual transcripts, or Tentative Consensus (TC) sequences. The TC sequences can be used to provide putative genes with functional annotation, to link the transcripts to mapping and genomic sequence data, to provide links between orthologous and paralogous genes and as a resource for comparative sequence analysis.",
            "authors": [
                "Quackenbush J.",
                "Cho J.",
                "Lee D.",
                "Liang F.",
                "Holt I.",
                "Karamycheva S.",
                "Parvizi B.",
                "Pertea G.",
                "Sultana R.",
                "White J."
            ],
            "cit_count": 372,
            "journal": "Nucleic Acids Research",
            "pmid": "11125077",
            "title": "The TIGR Gene Indices: Analysis of gene transcipt sequences in highly sampled eukaryotic species",
            "year": "2001-01-01"
        },
        {
            "abstract": "Expressed sequence tags (ESTs) have provided a first glimpse of the collection of transcribed sequences in a variety of organisms. However, a careful analysis of this sequence data can provide significant additional functional, structural and evolutionary information. Our analysis of the public EST sequences, available through the TIGR Gene Indices (TGI; http://www.tigr.org/tdb/tdb.html), is an attempt to identify the genes represented by that data and to provide additional information regarding those genes. Gene Indices are constructed for selected organisms by first clustering, then assembling EST and annotated gene sequences from GenBank. This process produces a set of unique, high-fidelity virtual transcripts, or tentative consensus (TC) sequences. The TC sequences can be used to provide putative genes with functional annotation, to link the transcripts to mapping and genomic sequence data, and to provide links between orthologous and paralogous genes.",
            "authors": [
                "Quackenbush J.",
                "Liang F.",
                "Holt I.",
                "Pertea G.",
                "Upton J."
            ],
            "cit_count": 271,
            "journal": "Nucleic Acids Research",
            "pmid": "10592205",
            "title": "The TIGR Gene Indices: Reconstruction and representation of expressed gene sequences",
            "year": "2000-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:tigr_gene_indices",
        "biotoolsID": "tigr_gene_indices",
        "description": "An analysis of a set of unique, highly accurate virtual transcripts that are represented in the worlds public EST data; can perform a BLAST search against the TIGR unique Gene Indices.",
        "homepage": "http://compbio.dfci.harvard.edu/tgi/",
        "name": "TIGR Gene Indices"
    }
}