{
    "additionDate": "2019-11-19T23:25:50Z",
    "biotoolsCURIE": "biotools:Telescope",
    "biotoolsID": "Telescope",
    "description": "Telescope is an open-source web application that tracks the progress of jobs submitted to remote servers using Sun Grid Engine (SGE) on-demand scheduling system. It allows remote scheduling of pre-defined pipelines, as well as re-scheduling queued jobs. Moreover, output files are rendered in HTML in real time, allowing the use of markdown and rich-text features. Telescope does not assume anything from the remote server, except for SSH connection. The connection is established using SSH key pairs that are stored after encrypted.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Mangul-Lab-USC/telescope",
    "lastUpdate": "2024-11-24T15:19:46.204861Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/Mangul-Lab-USC/telescope"
        }
    ],
    "name": "Telescope",
    "owner": "jaquejbrito",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/bts399",
            "metadata": {
                "abstract": "Motivation: With advances in sequencing technology, it has become faster and cheaper to obtain short-read data from which to assemble genomes. Although there has been considerable progress in the field of genome assembly, producing high-quality de novo assemblies from short-reads remains challenging, primarily because of the complex repeat structures found in the genomes of most higher organisms. The telomeric regions of many genomes are particularly difficult to assemble, though much could be gained from the study of these regions, as their evolution has not been fully characterized and they have been linked to aging. Results: In this article, we tackle the problem of assembling highly repetitive regions by developing a novel algorithm that iteratively extends long paths through a series of read-overlap graphs and evaluates them based on a statistical framework. Our algorithm, Telescoper, uses short- and long-insert libraries in an integrated way throughout the assembly process. Results on real and simulated data demonstrate that our approach can effectively resolve much of the complex repeat structures found in the telomeres of yeast genomes, especially when longer long-insert libraries are used. © The Author(s) 2012. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Bresler M."
                    },
                    {
                        "name": "Chan A.H."
                    },
                    {
                        "name": "Sheehan S."
                    },
                    {
                        "name": "Song Y.S."
                    }
                ],
                "citationCount": 21,
                "date": "2012-09-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Telescoper: De novo assembly of highly repetitive regions"
            },
            "pmcid": "PMC3436826",
            "pmid": "22962446"
        }
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
