{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2021-05-05T10:54:21Z",
    "biotoolsCURIE": "biotools:volumetric3",
    "biotoolsID": "volumetric3",
    "collectionID": [
        "File Exchange",
        "MATLAB"
    ],
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "otoole@utdallas.edu",
            "name": "Alice J. O'Toole",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "James Ryland",
            "typeEntity": "Person",
            "typeRole": [
                "Contributor"
            ],
            "url": "https://www.mathworks.com/matlabcentral/profile/8755338-james-ryland"
        }
    ],
    "description": "3D Volumetric fMRI visualization",
    "download": [
        {
            "type": "Screenshot",
            "url": "https://www.mathworks.com//matlabcentral/mlc-downloads/downloads/044426c0-5be2-496f-8453-dc5ca12e14d4/1945764a-bc46-43b2-b722-9416fc24bfad/images/screenshot.png"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://www.mathworks.com/matlabcentral/fileexchange/59161-volumetric-3",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2024-11-24T20:25:16.309799Z",
    "name": "Volumetric 3",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/j.neuroimage.2014.01.038",
            "metadata": {
                "abstract": "The neural organization of person processing relies on brain regions functionally selective for faces or bodies, with a subset of these regions preferring moving stimuli. Although the response properties of the individual areas are well established, less is known about the neural response to a whole person in a natural environment. Targeting an area of cortex that spans multiple functionally-selective face and body regions, we examined the relationship among neural activity patterns elicited in response to faces, bodies, and people in static and moving displays. When both stimuli were static or moving, pattern classification analyses indicated highly discriminable responses to faces, bodies, and whole people. Neural discrimination transferred in both directions between representations created from moving or static stimuli. It transferred also to stimuli experienced across static and dynamic presentations (one static and the other dynamic). In both transfer cases, however, discrimination accuracy decreased relative to the case where the representations were both created and tested with static or moving forms. Next, we examined the relative contribution of activity pattern and response magnitude to discrimination by comparing classifiers that operated with magnitude-normalized scans with classifiers that retained pattern and magnitude information. When both stimuli were moving or static, response magnitude contributed to classification, but the spatially distributed activity pattern accounted for most of the discrimination. Across static and moving presentations, activity pattern accounted completely for the discriminability of neural responses to faces, bodies, and people, with no contribution from response magnitude. Combined, the results indicate redundant and flexible access to person-based shape codes from moving and static presentations. The transfer of shape information across presentation types that preferentially access dorsal and ventral visual processing streams indicates that a common shape code may ground functional divisions in the processing of face and body information. © 2014 Elsevier Inc.",
                "authors": [
                    {
                        "name": "An X."
                    },
                    {
                        "name": "Natu V."
                    },
                    {
                        "name": "O'Toole A.J."
                    },
                    {
                        "name": "Phillips P.J."
                    },
                    {
                        "name": "Rice A."
                    },
                    {
                        "name": "Ryland J."
                    }
                ],
                "citationCount": 11,
                "date": "2014-05-01T00:00:00Z",
                "journal": "NeuroImage",
                "title": "The neural representation of faces and bodies in motion and at rest"
            },
            "pmid": "24486831",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biology",
            "uri": "http://edamontology.org/topic_3070"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ],
    "version": [
        "1.0.05"
    ]
}
