{
    "additionDate": "2021-01-18T08:56:42Z",
    "biotoolsCURIE": "biotools:ascall",
    "biotoolsID": "ascall",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "k.blag@yandex.ru",
            "name": "Konstantin Blagodatskikh",
            "typeEntity": "Person"
        }
    ],
    "description": "AScall is a web tool providing automatic processing of allele specific real-time PCR experiments: variation conducted real-time whereis each allele is detected by independent reaction separated into individual wells. The positive outcome of the reaction for a particular allele is judged by the increase in the fluorescent signal.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://shtest.evrogen.net/AScall",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-28T20:06:51Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/kablag/AScall"
        }
    ],
    "name": "AScall",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3389/FBIOE.2020.00353",
            "metadata": {
                "abstract": "© Copyright © 2020 Blagodatskikh, Romaniuk and Malko.Minor histocompatibility antigens (MiHA) are critical elements for the immune response after allogeneic hematopoietic stem cell transplantation. They may cause both beneficial and detrimental effects in forms of graft-versus-tumor and graft-versus-host accordingly. MiHAs originate from donor-recipient discrepancies in single nucleotide polymorphisms, insertions, and deletions. To determine the genetic mismatches between a donor and a recipient, we have implemented a real-time PCR method in conjunction with allele-specific primers (AS-qPCR). The new approach allows for multiplexing up to 480 reactions per 96 well plate and differs from common qPCR based genotyping methods. Earlier, we have confirmed and published the AS-qPCR method, but standard software for qPCR analysis does not suit AS-qPCR data. Here we fill this gap and describe AScall – the interactive web application for the proposed genotyping method. With a convenient interface mimicking a regular qPCR machine interface, our tool allows batch qPCR data import via universal RDML format, amplification curves preprocessing, quality control, sample genotype calling, detailed results visualization, and report generation. We show the use of AScall for SNP and indel genotyping for the MiHA study, but anyone can use the application for an accordingly designed AS-qPCR experiment of their own. Genotyping was done manually and with AScall for 96 genomic DNA samples. AScall processed 4,800 qPCRs in 1.5 min, with only two genotype mismatches compared to manual analysis. It took 3 h for an experienced researcher for manual analysis. Source code is freely available for download at https://github.com/kablag/AScall. The tool is freely available on the web at the AScall server http://shtest.evrogen.net/AScall.",
                "authors": [
                    {
                        "name": "Blagodatskikh K."
                    },
                    {
                        "name": "Malko D."
                    },
                    {
                        "name": "Romaniuk D."
                    }
                ],
                "date": "2020-04-22T00:00:00Z",
                "journal": "Frontiers in Bioengineering and Biotechnology",
                "title": "AScall – Automatic Allele-Specific qPCR Analysis"
            },
            "pmcid": "PMC7188954",
            "pmid": "32391349"
        }
    ],
    "toolType": [
        "Library",
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "PCR experiment",
            "uri": "http://edamontology.org/topic_3519"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        }
    ]
}
