{
    "additionDate": "2024-02-22T13:06:14.343149Z",
    "biotoolsCURIE": "biotools:imzapy",
    "biotoolsID": "imzapy",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "xueyun.zheng@pnnl.gov",
            "name": "Xueyun Zheng",
            "orcidid": "https://orcid.org/0000-0001-9782-4521"
        }
    ],
    "description": "An open-source Python library enabling efficient extraction and processing of ion mobility spectrometry-mass spectrometry data in the MZA file format.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peak detection",
                    "uri": "http://edamontology.org/operation_3215"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/PNNL-m-q/mzapy",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-02-22T13:06:14.345706Z",
    "license": "BSD-2-Clause",
    "name": "imzapy",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/ACS.ANALCHEM.3C01653",
            "metadata": {
                "abstract": "Analysis of ion mobility spectrometry (IMS) data has been challenging and limited the full utility of these measurements. Unlike liquid chromatography-mass spectrometry, where a plethora of tools with well-established algorithms exist, the incorporation of the additional IMS dimension requires upgrading existing computational pipelines and developing new algorithms to fully exploit the advantages of the technology. We have recently reported MZA, a new and simple mass spectrometry data structure based on the broadly supported HDF5 format and created to facilitate software development. While this format is inherently supportive of application development, the availability of core libraries in popular programming languages with standard mass spectrometry utilities will facilitate fast software development and broader adoption of the format. To this end, we present a Python package, mzapy, for efficient extraction and processing of mass spectrometry data in the MZA format, especially for complex data containing ion mobility spectrometry dimension. In addition to raw data extraction, mzapy contains supporting utilities enabling tasks including calibration, signal processing, peak finding, and generating plots. Being implemented in pure Python and having minimal and largely standardized dependencies makes mzapy uniquely suited to application development in the multiomics domain. The mzapy package is free and open-source, includes comprehensive documentation, and is structured to support future extension to meet the evolving needs of the MS community. The software source code is freely available at https://github.com/PNNL-m-q/mzapy.",
                "authors": [
                    {
                        "name": "Bilbao A."
                    },
                    {
                        "name": "Lee J.-Y."
                    },
                    {
                        "name": "Ross D."
                    },
                    {
                        "name": "Zheng X."
                    }
                ],
                "date": "2023-06-27T00:00:00Z",
                "journal": "Analytical Chemistry",
                "title": "mzapy: An Open-Source Python Library Enabling Efficient Extraction and Processing of Ion Mobility Spectrometry-Mass Spectrometry Data in the MZA File Format"
            },
            "pmid": "37307589"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
