
{
    "credit": [
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "license": "MIT",
        "topic": [
            {
                "term": "Chemistry",
                "uri": "http://edamontology.org/topic_3314"
            },
            {
                "term": "Immunoproteins, genes and antigens",
                "uri": "http://edamontology.org/topic_2830"
            },
            {
                "term": "Transcription factors and regulatory sites",
                "uri": "http://edamontology.org/topic_0749"
            }
        ]
    },
    "link": [
        {
            "type": "Repository",
            "url": "https://github.com/CW-Wayne/Auto-CHO"
        }
    ],
    "publication": [
        {
            "abstract": "This article presents a general experimental protocol for programmable one-pot oligosaccharide synthesis and demonstrates how to use Auto-CHO software for generating potential synthetic solutions. The programmable one-pot oligosaccharide synthesis approach is designed to empower fast oligosaccharide synthesis of large amounts using thioglycoside building blocks (BBLs) with the appropriate sequential order of relative reactivity values (RRVs). Auto-CHO is a cross-platform software with a graphical user interface that provides possible synthetic solutions for programmable one-pot oligosaccharide synthesis by searching a BBL library (containing about 150 validated and >50,000 virtual BBLs) with accurately predicted RRVs by support vector regression. The algorithm for hierarchical one-pot synthesis has been implemented in Auto-CHO and uses fragments generated by one-pot reactions as new BBLs. In addition, Auto-CHO allows users to give feedback for virtual BBLs to keep valuable ones for further use. One-pot synthesis of stage-specific embryonic antigen 4 (SSEA-4), which is a pluripotent human embryonic stem cell marker, is demonstrated in this work.",
            "authors": [
                "Cheng C.-W.",
                "Zhou Y.",
                "Pan W.-H.",
                "Dey S.",
                "Wu C.-Y.",
                "Hsu W.-L.",
                "Wong C.-H."
            ],
            "cit_count": 0,
            "doi": "10.3791/59987",
            "journal": "Journal of visualized experiments : JoVE",
            "pmid": "31545316",
            "title": "Hierarchical and Programmable One-Pot Oligosaccharide Synthesis",
            "year": "2019-09-06"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:Auto-CHO",
        "biotoolsID": "Auto-CHO",
        "description": "Hierarchical and Programmable One-Pot Oligosaccharide Synthesis | Auto-CHO is a free-to-use software for providing glycan synthetic solutions by one-pot approach | Auto-CHO is an open source (MIT License) and free-to-use software developed by Academia Sinica for providing solutions of hierarchical one-pot glycan synthesis | Auto-CHO is an open source (MIT Licence) and free-to-use software developed by Academia Sinica for providing solutions of hierarchical one-pot glycan synthesis",
        "homepage": "https://sites.google.com/view/auto-cho/home",
        "name": "Auto-CHO"
    }
}