{
    "accessibility": "Open access",
    "additionDate": "2023-02-20T14:05:59.019745Z",
    "biotoolsCURIE": "biotools:nettcr-2.1",
    "biotoolsID": "nettcr-2.1",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "morni@dtu.dk",
            "name": "Morten Nielsen",
            "typeEntity": "Person"
        },
        {
            "name": "Alessandro Montemurro"
        },
        {
            "name": "Leon Eyrich Jessen"
        }
    ],
    "description": "NetTCR-2.1 predicts binding probability between a T-cell receptor (TCR) CDR loops and MHC-I peptides.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence",
                        "uri": "http://edamontology.org/data_2044"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Epitope mapping",
                    "uri": "http://edamontology.org/operation_0416"
                },
                {
                    "term": "Loop modelling",
                    "uri": "http://edamontology.org/operation_0481"
                },
                {
                    "term": "Peptide immunogenicity prediction",
                    "uri": "http://edamontology.org/operation_0252"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://services.healthtech.dtu.dk/service.php?NetTCR-2.1",
    "lastUpdate": "2023-02-20T14:05:59.022773Z",
    "name": "NetTCR-2.1",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/FIMMU.2022.1055151",
            "metadata": {
                "abstract": "Copyright © 2022 Montemurro, Jessen and Nielsen.T cell receptors (TCR) define the specificity of T cells and are responsible for their interaction with peptide antigen targets presented in complex with major histocompatibility complex (MHC) molecules. Understanding the rules underlying this interaction hence forms the foundation for our understanding of basic adaptive immunology. Over the last decade, efforts have been dedicated to developing assays for high throughput identification of peptide-specific TCRs. Based on such data, several computational methods have been proposed for predicting the TCR-pMHC interaction. The general conclusion from these studies is that the prediction of TCR interactions with MHC-peptide complexes remains highly challenging. Several reasons form the basis for this including scarcity and quality of data, and ill-defined modeling objectives imposed by the high redundancy of the available data. In this work, we propose a framework for dealing with this redundancy, allowing us to address essential questions related to the modeling of TCR specificity including the use of peptide- versus pan-specific models, how to best define negative data, and the performance impact of integrating of CDR1 and 2 loops. Further, we illustrate how and why it is strongly recommended to include simple similarity-based modeling approaches when validating an improved predictive power of machine learning models, and that such validation should include a performance evaluation as a function of “distance” to the training data, to quantify the potential for generalization of the proposed model. The conclusion of the work is that, given current data, TCR specificity is best modeled using peptide-specific approaches, integrating information from all 6 CDR loops, and with negative data constructed from a combination of true and mislabeled negatives. Comparing such machine learning models to similarity-based approaches demonstrated an increased performance gain of the former as the “distance” to the training data was increased; thus demonstrating an improved generalization ability of the machine learning-based approaches. We believe these results demonstrate that the outlined modeling framework and proposed evaluation strategy form a solid basis for investigating the modeling of TCR specificities and that adhering to such a framework will allow for faster progress within the field. The final devolved model, NetTCR-2.1, is available at https://services.healthtech.dtu.dk/service.php?NetTCR-2.1.",
                "authors": [
                    {
                        "name": "Jessen L.E."
                    },
                    {
                        "name": "Montemurro A."
                    },
                    {
                        "name": "Nielsen M."
                    }
                ],
                "date": "2022-12-06T00:00:00Z",
                "journal": "Frontiers in Immunology",
                "title": "NetTCR-2.1: Lessons and guidance on how to develop models for TCR specificity predictions"
            },
            "pmcid": "PMC9763291",
            "pmid": "36561755"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Immunogenetics",
            "uri": "http://edamontology.org/topic_3930"
        },
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
