{
    "additionDate": "2021-03-19T09:00:28Z",
    "biotoolsCURIE": "biotools:montage",
    "biotoolsID": "montage",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "glessner@email.chop.edu",
            "name": "Joseph T. Glessner",
            "orcidid": "https://orcid.org/0000-0001-5131-2811",
            "typeEntity": "Person"
        }
    ],
    "description": "A new tool for high-throughput detection of mosaic copy number variation.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Copy number variation detection",
                    "uri": "http://edamontology.org/operation_3961"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://github.com/CAG-CNV/MONTAGE",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2021-04-11T11:06:50.842278Z",
    "license": "GPL-3.0",
    "name": "Montage",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12864-021-07395-7",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Not all cells in a given individual are identical in their genomic makeup. Mosaicism describes such a phenomenon where a mixture of genotypic states in certain genomic segments exists within the same individual. Mosaicism is a prevalent and impactful class of non-integer state copy number variation (CNV). Mosaicism implies that certain cell types or subset of cells contain a CNV in a segment of the genome while other cells in the same individual do not. Several studies have investigated the impact of mosaicism in single patients or small cohorts but no comprehensive scan of mosaic CNVs has been undertaken to accurately detect such variants and interpret their impact on human health and disease. Results: We developed a tool called Montage to improve the accuracy of detection of mosaic copy number variants in a high throughput fashion. Montage directly interfaces with ParseCNV2 algorithm to establish disease phenotype genome-wide association and determine which genomic ranges had more or less than expected frequency of mosaic events. We screened for mosaic events in over 350,000 samples using 1% allele frequency as the detection limit. Additionally, we uncovered disease associations of multiple phenotypes with mosaic CNVs at several genomic loci. We additionally investigated the allele imbalance observations genome-wide to define non-diploid and non-integer copy number states. Conclusions: Our novel algorithm presents an efficient tool with fast computational runtime and high levels of accuracy of mosaic CNV detection. A curated mosaic CNV callset of 3716 events in 2269 samples is presented with comparability to previous reports and disease phenotype associations. The new algorithm can be freely accessed via: https://github.com/CAG-CNV/MONTAGE.",
                "authors": [
                    {
                        "name": "Glessner J.T."
                    },
                    {
                        "name": "Chang X."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Khan M."
                    },
                    {
                        "name": "Wei Z."
                    },
                    {
                        "name": "Sleiman P.M.A."
                    },
                    {
                        "name": "Hakonarson H."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "MONTAGE: a new tool for high-throughput detection of mosaic copy number variation"
            },
            "pmcid": "PMC7905641",
            "pmid": "33627065"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Copy number variation",
            "uri": "http://edamontology.org/topic_3958"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        }
    ]
}