{
    "additionDate": "2021-01-18T09:29:46Z",
    "biotoolsCURIE": "biotools:liposvm",
    "biotoolsID": "liposvm",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "chujixun@ustb.edu.cn",
            "name": "Jixun Chu",
            "typeEntity": "Person"
        }
    ],
    "description": "Prediction of Lysine Lipoylation in Proteins based on the Support Vector Machine.\n\nA Predictor based on Support Vector Machine for lysine lipoylation in Proteins.\n\nThe file named Algotithm contains python code for different classification algorithms: KNN, Decision Tree, Logistic Regression, Naive Bayes.\n\nThe file named Encoding schemes contains code for different encoding schemes: PSSM, BPB, AAindex, BLOSUM62, Binary.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "PTM localisation",
                    "uri": "http://edamontology.org/operation_3755"
                }
            ]
        }
    ],
    "homepage": "https://github.com/stars20180811/LipoSVM",
    "lastUpdate": "2021-02-17T07:00:17Z",
    "name": "LipoSVM",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.2174/1389202919666191014092843",
            "metadata": {
                "abstract": "© 2019 Bentham Science Publishers.Background: Lysine lipoylation which is a rare and highly conserved post-translational modification of proteins has been considered as one of the most important processes in the biological field. To obtain a comprehensive understanding of regulatory mechanism of lysine lipoylation, the key is to identify lysine lipoylated sites. The experimental methods are expensive and laborious. Due to the high cost and complexity of experimental methods, it is urgent to develop computational ways to predict lipoylation sites. Methodology: In this work, a predictor named LipoSVM is developed to accurately predict lipoylation sites. To overcome the problem of an unbalanced sample, synthetic minority over-sampling technique (SMOTE) is utilized to balance negative and positive samples. Furthermore, different ratios of positive and negative samples are chosen as training sets. Results: By comparing five different encoding schemes and five classification algorithms, LipoSVM is constructed finally by using a training set with positive and negative sample ratio of 1:1, combining with position-specific scoring matrix and support vector machine. The best performance achieves an accuracy of 99.98% and AUC 0.9996 in 10-fold cross-validation. The AUC of independent test set reaches 0.9997, which demonstrates the robustness of LipoSVM. The analysis between lysine lipoylation and non-lipoylation fragments shows significant statistical differences. Conclusion: A good predictor for lysine lipoylation is built based on position-specific scoring matrix and support vector machine. Meanwhile, an online webserver LipoSVM can be freely downloaded from https://github.com/stars20180811/LipoSVM.",
                "authors": [
                    {
                        "name": "Wu M."
                    },
                    {
                        "name": "Lu P."
                    },
                    {
                        "name": "Yang Y."
                    },
                    {
                        "name": "Liu L."
                    },
                    {
                        "name": "Wang H."
                    },
                    {
                        "name": "Xu Y."
                    },
                    {
                        "name": "Chu J."
                    }
                ],
                "citationCount": 1,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Current Genomics",
                "title": "Liposvm: Prediction of lysine lipoylation in proteins based on the support vector machine"
            },
            "pmcid": "PMC7235397",
            "pmid": "32476993"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Protein sites, features and motifs",
            "uri": "http://edamontology.org/topic_3510"
        },
        {
            "term": "Biochemistry",
            "uri": "http://edamontology.org/topic_3292"
        }
    ]
}