{
    "additionDate": "2022-09-30T14:19:46.216009Z",
    "biotoolsCURIE": "biotools:cnntrees",
    "biotoolsID": "cnntrees",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Nadia Tahiri"
        }
    ],
    "description": "A CNN approach for multiple tree classification. It returns a number of clusters of the input phylogenetic trees for different-size sets of trees.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Consensus tree construction",
                    "uri": "http://edamontology.org/operation_0555"
                },
                {
                    "term": "Gene tree construction",
                    "uri": "http://edamontology.org/operation_0553"
                },
                {
                    "term": "Phylogenetic sub/super tree construction",
                    "uri": "http://edamontology.org/operation_0556"
                },
                {
                    "term": "Phylogenetic tree editing",
                    "uri": "http://edamontology.org/operation_0326"
                }
            ]
        }
    ],
    "homepage": "https://tahirinadia.github.io/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:33:13.545733Z",
    "license": "Not licensed",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/TahiriNadia/CNNTrees"
        }
    ],
    "name": "CNNTrees",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1142/s0219720022500123",
            "metadata": {
                "abstract": "The evolutionary histories of genes are susceptible of differing greatly from each other which could be explained by evolutionary variations in horizontal gene transfers or biological recombinations. A phylogenetic tree would therefore represent the evolutionary history of each gene, which may present different patterns from the species tree that defines the main evolutionary patterns. In addition, phylogenetic trees of closely related species should be merged, thus minimizing the topological conflicts they present and obtaining consensus trees (in the case of homogeneous data) or supertrees (in the case of heterogeneous data). The traditional approaches are consensus tree inference (if the set of trees contains the same set of species) or supertrees (if the set of trees contains different, but overlapping sets of species). Consensus trees and supertrees are constructed to produce unique trees. However, these methods lose precision with respect to different evolutionary variability. Other approaches have been implemented to preserve this variability using the k-means algorithm or the k-medoids algorithm. Using a new method, we determine all possible consensus trees and supertrees that best represent the most significant evolutionary models in a set of phylogenetic trees, thereby increasing the precision of the results and decreasing the time required. Results: This paper presents in detail a new method for predicting the number of clusters in a Robinson and Foulds (RF) distance matrix using a convolutional neural network (CNN). We developed a new CNN approach (called CNNTrees) for multiple tree classification. This new strategy returns a number of clusters of the input phylogenetic trees for different-size sets of trees, which makes the new approach more stable and more robust. The paper provides an in-depth analysis of the relevant, but very difficult, problem of constructing alternative supertrees using phylogenies with different but overlapping sets of taxa. This new model will play an important role in the inference of Trees of Life (ToL). Availability and implementation: CNNTrees is available through a web server at https://tahirinadia.github.io/. The source code, data and information about installation procedures are also available at https://github.com/TahiriNadia/CNNTrees. Supplementary information: Supplementary data are available on GitHub platform. The evolutionary history of species is not unique, but is specific to sets of genes. Indeed, each gene has its own evolutionary history that differs considerably from one gene to another. For example, some individual genes or operons may be affected by specific horizontal gene transfer and recombination events. Thus, the evolutionary history of each gene must be represented by its own phylogenetic tree, which may exhibit different evolutionary patterns than the species tree that accounts for the major vertical descent patterns. The result of traditional consensus tree or supertree inference methods is a single consensus tree or supertree. In this paper, we present in detail a new method for predicting the number of clusters in a Robinson and Foulds (RF) distance matrix using a convolutional neural network (CNN). We developed a new CNN approach (CNNTrees) to construct multiple tree classification. This new strategy returns a number of clusters in the order of the input trees, which allows this new approach to be more stable and also more robust.",
                "authors": [
                    {
                        "name": "Koshkarov A."
                    },
                    {
                        "name": "Morozov B."
                    },
                    {
                        "name": "Tahiri N."
                    },
                    {
                        "name": "Veriga A."
                    }
                ],
                "citationCount": 2,
                "date": "2022-08-01T00:00:00Z",
                "journal": "Journal of Bioinformatics and Computational Biology",
                "title": "Invariant transformers of Robinson and Foulds distance matrices for Convolutional Neural Network"
            },
            "pmid": "35798684"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Gene structure",
            "uri": "http://edamontology.org/topic_0114"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Phylogenomics",
            "uri": "http://edamontology.org/topic_0194"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        }
    ],
    "validated": 1
}
