{
    "additionDate": "2017-12-18T00:11:59Z",
    "biotoolsCURIE": "biotools:rsss",
    "biotoolsID": "rsss",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/boboppie"
        }
    ],
    "description": "Comparative study of RNA-seq analysis strategies.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/boboppie/RSSS"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA-Seq analysis",
                    "uri": "http://edamontology.org/operation_3680"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "RNA-Seq analysis",
                    "uri": "http://edamontology.org/operation_3680"
                }
            ]
        }
    ],
    "homepage": "https://github.com/boboppie/RSSS",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/rsss-comparative-study-of-rna-seq-analysis-strategies.html"
        }
    ],
    "name": "RSSS",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1093/bib/bbv007",
            "metadata": {
                "abstract": "© The Author 2015. Published by Oxford University Press. Three principal approaches have been proposed for inferring the set of transcripts expressed in RNA samples using RNA- seq. The simplest approach uses curated annotations, which assumes the transcripts in a sample are a subset of the tran- scripts listed in a curated database. Amore ambitious method involves aligning reads to a reference genome and using the alignments to infer the transcript structures, possibly with the aid of a curated transcript database. Themost challenging approach is to assemble reads into putative transcripts de novo without the aid of reference data. We have systematically assessed the properties of these three approaches through a simulation study. We have found that the sensitivity of compu- tational transcript set estimation is severely limited. Computational approaches (both genome-guided and de novo assem- bly) produce a large number of artefacts, which are assigned large expression estimates and absorb a substantial proportion of the signal when performing expression analysis. The approach using curated annotations shows good expression correl- ation even when the annotations are incomplete. Furthermore, any incorrect transcripts present in a curated set do not ab- sorbmuch signal, so it is preferable to have a curation set with high sensitivity than high precision. Software to simulate transcript sets, expression values and sequence reads under a wider range of parameter values and to compare sensitivity, precision and signal-to-noise ratios of differentmethods is freely available online (https://github.com/boboppie/RSSS) and can be expanded by interested parties to includemethods other than the exemplars presented in this article.",
                "authors": [
                    {
                        "name": "Janes J."
                    },
                    {
                        "name": "Hu F."
                    },
                    {
                        "name": "Lewin A."
                    },
                    {
                        "name": "Turro E."
                    }
                ],
                "citationCount": 13,
                "date": "2015-02-06T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "A comparative study of RNA-seq analysis strategies"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        }
    ],
    "validated": 1
}