{
    "additionDate": "2021-01-18T07:37:42Z",
    "biotoolsCURIE": "biotools:annotatorj",
    "biotoolsID": "annotatorj",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "horvath.peter@brc.hu",
            "name": "Péter Horváth",
            "typeEntity": "Person"
        }
    ],
    "description": "An ImageJ plugin to ease hand-annotation of cellular compartments.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Image annotation",
                    "uri": "http://edamontology.org/operation_3553"
                }
            ]
        }
    ],
    "homepage": "https://github.com/spreka/annotatorj",
    "language": [
        "Java"
    ],
    "lastUpdate": "2021-01-23T16:19:07Z",
    "license": "GPL-3.0",
    "name": "AnnotatorJ",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1101/2020.02.27.968362"
        },
        {
            "doi": "10.1091/mbc.E20-02-0156",
            "metadata": {
                "abstract": "© 2020 Hollandi et al. This article is distributed by The American Society for Cell Biology under license from the author(s). Two months after publication it is available to the public under an Attribution-Noncommercial-Share Alike 3.0 Unported Creative Commons License (http://creativecommons.org/licenses/by-nc-sa/3.0).AnnotatorJ combines single-cell identification with deep learning (DL) and manual annotation. Cellular analysis quality depends on accurate and reliable detection and segmentation of cells so that the subsequent steps of analyses, for example, expression measurements, may be carried out precisely and without bias. DL has recently become a popular way of segmenting cells, performing unimaginably better than conventional methods. However, such DL applications may be trained on a large amount of annotated data to be able to match the highest expectations. High-quality annotations are unfortunately expensive as they require field experts to create them, and often cannot be shared outside the lab due to medical regulations. We propose AnnotatorJ, an ImageJ plugin for the semiautomatic annotation of cells (or generally, objects of interest) on (not only) microscopy images in 2D that helps find the true contour of individual objects by applying U-Net-based presegmentation. The manual labor of hand annotating cells can be significantly accelerated by using our tool. Thus, it enables users to create such datasets that could potentially increase the accuracy of state-of-the-art solutions, DL or otherwise, when used as training data.",
                "authors": [
                    {
                        "name": "Diosdi A."
                    },
                    {
                        "name": "Hollandi G."
                    },
                    {
                        "name": "Hollandi R."
                    },
                    {
                        "name": "Horvath P."
                    },
                    {
                        "name": "Moshkov N."
                    }
                ],
                "citationCount": 8,
                "date": "2020-09-01T00:00:00Z",
                "journal": "Molecular Biology of the Cell",
                "title": "Annotator J: An image J plugin to ease hand annotation of cellular compartments"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}
