{
    "additionDate": "2017-08-03T18:50:45Z",
    "biotoolsCURIE": "biotools:maturebayes",
    "biotoolsID": "maturebayes",
    "credit": [
        {
            "email": "poirazi@dendrites.gr",
            "name": "Panayiota Poirazi",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://dendrites.gr/"
        }
    ],
    "description": "Tool for finding mature miRNA within a miRNA precursor sequence using a Naive Bays classifier.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://mirna.imbb.forth.gr/MatureBayes.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                }
            ]
        }
    ],
    "homepage": "http://mirna.imbb.forth.gr/MatureBayes.html",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/maturebayes-web-based-tool-for-the-computational-identification-of-mature-mirnas.html"
        }
    ],
    "name": "MatureBayes",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: MicroRNAs (miRNAs) are small, single stranded RNAs with a key role in post-transcriptional regulation of thousands of genes across numerous species. While several computational methods are currently available for identifying miRNA genes, accurate prediction of the mature miRNA remains a challenge. Existing approaches fall short in predicting the location of mature miRNAs but also in finding the functional strand(s) of miRNA precursors. Methodology/Principal Findings: Here, we present a computational tool that incorporates a Naive Bayes classifier to identify mature miRNA candidates based on sequence and secondary structure information of their miRNA precursors. We take into account both positive (true mature miRNAs) and negative (same-size non-mature miRNA sequences) examples to optimize sensitivity as well as specificity. Our method can accurately predict the start position of experimentally verified mature miRNAs for both human and mouse, achieving a significantly larger (often double) performance accuracy compared with two existing methods. Moreover, the method exhibits a very high generalization performance on miRNAs from two other organisms. More importantly, our method provides direct evidence about the features of miRNA precursors which may determine the location of the mature miRNA. We find that the triplet of positions 7, 8 and 9 from the mature miRNA end towards the closest hairpin have the largest discriminatory power, are relatively conserved in terms of sequence composition (mostly contain a Uracil) and are located within or in very close proximity to the hairpin loop, suggesting the existence of a possible recognition site for Dicer and associated proteins. Conclusions: This work describes a novel algorithm for identifying the start position of mature miRNA(s) produced by miRNA precursors. Our tool has significantly better (often double) performance than two existing approaches and provides new insights about the potential use of specific sequence/structural information as recognition signals for Dicer processing. © 2010 Gkirtzou et al.",
                "authors": [
                    {
                        "name": "Gkirtzou K."
                    },
                    {
                        "name": "Poirazi P."
                    },
                    {
                        "name": "Tsakalides P."
                    },
                    {
                        "name": "Tsamardinos I."
                    }
                ],
                "citationCount": 79,
                "date": "2010-10-15T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "MatureBayes: A probabilistic algorithm for identifying the mature miRNA within novel precursors"
            },
            "pmid": "20700506"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        }
    ],
    "validated": 1
}
