{
    "additionDate": "2020-01-14T09:10:48Z",
    "biotoolsCURIE": "biotools:Mabellini",
    "biotoolsID": "Mabellini",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "tlb20@cam.ac.uk",
            "name": "Tom L Blundell",
            "typeEntity": "Person"
        }
    ],
    "description": "A genome-wide database for understanding the structural proteome and evaluating prospective antimicrobial targets of the emerging pathogen Mycobacterium abscessus.\n\nAn on-line source for Mycobacterium abscessus modeled structural proteome.\n\nMabeLLINI (Mycobacterium ABscessus modELLing INItiative) is a database available to anyone that wishes to know in detail the structural proteome of Mycobacterium abscessus. It contains thousands of models, generated with an unique domain-based methodology and thoroughly annotated with information from UniProt, CATH, SCOP and many more resources. These models are readily available for download, either individually or in bundles. To access them, simply use one of the many available queries or explore the data using our hierarchical interactive sunbursts",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                },
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://www.mabellinidb.science",
    "lastUpdate": "2020-12-22T13:47:09Z",
    "name": "Mabellini",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAZ113",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Mycobacterium abscessus, a rapid growing, multidrug resistant, nontuberculous mycobacteria, can cause a wide range of opportunistic infections, particularly in immunocompromised individuals. M. abscessus has emerged as a growing threat to patients with cystic fibrosis, where it causes accelerated inflammatory lung damage, is difficult and sometimes impossible to treat and can prevent safe transplantation. There is therefore an urgent unmet need to develop new therapeutic strategies. The elucidation of the M. abscessus genome in 2009 opened a wide range of research possibilities in the field of drug discovery that can be more effectively exploited upon the characterization of the structural proteome. Where there are no experimental structures, we have used the available amino acid sequences to create 3D models of the majority of the remaining proteins that constitute the M. abscessus proteome (3394 proteins and over 13 000 models) using a range of up-to-date computational tools, many developed by our own group. The models are freely available for download in an on-line database, together with quality data and functional annotation. Furthermore, we have developed an intuitive and user-friendly web interface (http://www.mabellinidb.science) that enables easy browsing, querying and retrieval of the proteins of interest. We believe that this resource will be of use in evaluating the prospective targets for design of antimicrobial agents and will serve as a cornerstone to support the development of new molecules to treat M. abscessus infections.",
                "authors": [
                    {
                        "name": "Bannerman B."
                    },
                    {
                        "name": "Blundell T.L."
                    },
                    {
                        "name": "Copoiu L."
                    },
                    {
                        "name": "Floto R.A."
                    },
                    {
                        "name": "Skwark M.J."
                    },
                    {
                        "name": "Torres P.H.M."
                    }
                ],
                "citationCount": 7,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Database",
                "title": "Mabellini: A genome-wide database for understanding the structural proteome and evaluating prospective antimicrobial targets of the emerging pathogen Mycobacterium abscessus"
            },
            "pmcid": "PMC6853642",
            "pmid": "31681953"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        }
    ],
    "validated": 1
}
