{
    "name": "GISMO", 
    "description": "Bayesian Markov chain Monte Carlo (MCMC) sampler for protein multiple sequence alignment (MSA).", 
    "homepage": "http://gismo.igs.umaryland.edu/", 
    "biotoolsID": "gismo", 
    "biotoolsCURIE": "biotools:gismo", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0492", 
                    "term": "Multiple sequence alignment"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0080", 
            "term": "Sequence analysis"
        }, 
        {
            "uri": "http://edamontology.org/topic_0078", 
            "term": "Proteins"
        }, 
        {
            "uri": "http://edamontology.org/topic_3071", 
            "term": "Data management"
        }
    ], 
    "operatingSystem": [
        "Linux"
    ], 
    "language": [
        "C++"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/gismo-gibbs-sampler-for-multi-alignment-optimization.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://gismo.igs.umaryland.edu/downloads/readme", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "27192614", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Bayesian Top-Down Protein Sequence Alignment with Inferred Position-Specific Gap Penalties", 
                "abstract": "© 2006 Public Library of Science. All rights reserved. We describe a Bayesian Markov chain Monte Carlo (MCMC) sampler for protein multiple sequence alignment (MSA) that, as implemented in the program GISMO and applied to large numbers of diverse sequences, is more accurate than the popular MSA programs MUSCLE, MAFFT, Clustal-Ω and Kalign. Features of GISMO central to its performance are: (i) It employs a “top-down” strategy with a favorable asymptotic time complexity that first identifies regions generally shared by all the input sequences, and then realigns closely related subgroups in tandem. (ii) It infers position-specific gap penalties that favor insertions or deletions (indels) within each sequence at alignment positions in which indels are invoked in other sequences. This favors the placement of insertions between conserved blocks, which can be understood as making up the proteins’ structural core. (iii) It uses a Bayesian statistical measure of alignment quality based on the minimum description length principle and on Dirichlet mixture priors. Consequently, GISMO aligns sequence regions only when statistically justified. This is unlike methods based on the ad hoc, but widely used, sum-of-the-pairs scoring system, which will align random sequences. (iv) It defines a system for exploring alignment space that provides natural avenues for further experimentation through the development of new sampling strategies for more efficiently escaping from suboptimal traps. GISMO’s superior performance is illustrated using 408 protein sets containing, on average, 235 sequences. These sets correspond to NCBI Conserved Domain Database alignments, which have been manually curated in the light of available crystal structures, and thus provide a means to assess alignment accuracy. GISMO fills a different niche than other MSA programs, namely identifying and aligning a conserved domain present within a large, diverse set of full length sequences. The GISMO program is available at http://gismo.igs.umaryland.edu/.", 
                "date": "2016-05-01T00:00:00Z", 
                "citationCount": 8, 
                "authors": [
                    {
                        "name": "Neuwald A.F."
                    }, 
                    {
                        "name": "Altschul S.F."
                    }
                ], 
                "journal": "PLoS Computational Biology"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": "aneuwald@som.umaryland.edu", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T18:44:23Z", 
    "lastUpdate": "2018-12-10T12:58:51Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}