{
    "accessibility": "Open access",
    "additionDate": "2020-01-14T09:15:07Z",
    "biotoolsCURIE": "biotools:InfoMating",
    "biotoolsID": "InfoMating",
    "confidence_flag": "tool",
    "description": "Multi-model inference of non-random mating from an information theoretic approach.\n\nNon-random mating and Information Theory.\n\nmate choice, assortative mating, jmating, sexual selection, akaike.\n\nRelying on the informational partition of the non-random mating effects, and by modeling mate choice and competition by the mutual propensity parameters, it is possible to identify the necessary and sufficient conditions of random mating and from here, develop and connect different kinds of models producing different effects. These models can be used to generate inferences on the parameters of interest. The software InfoMating implements the methodology to do so",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "http://acraaj.webs6.uvigo.es/InfoMating/Infomating.htm",
    "lastUpdate": "2020-12-14T12:28:02Z",
    "name": "InfoMating",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.TPB.2019.11.002",
            "metadata": {
                "abstract": "© 2019 Elsevier Inc.Non-random mating has a significant impact on the evolution of organisms. Here, I developed a modelling framework for discrete traits (with any number of phenotypes) to explore different models connecting the non-random mating causes (mate competition and/or mate choice) and their consequences (sexual selection and/or assortative mating). I derived the formulaefor the maximum likelihood estimates of each model and used information criteria to perform multi-model inference. Simulation results showed a good performance of both model selection and parameter estimation. The methodology was applied to ecotypes data of the marine gastropod Littorina saxatilis from Galicia (Spain), to show that the mating pattern is better described by models with two parameters that involve both mate choice and competition, generating positive assortative mating plus female sexual selection. As far as I know, this is the first standardized methodology for model selection and multi-model inference of mating parameters for discrete traits. The advantages of this framework include the ability of setting up models from which the parameters connect causes, as mate competition and mate choice, with their outcome in the form of data patterns of sexual selection and assortative mating. For some models, the parameters may have a double effect i.e. they produce sexual selection and assortative mating, while for others there are separated parameters for one kind of pattern or another. From an empirical point of view, it is much easier to study patterns than processes and, for this reason, the causal mechanisms of sexual selection are not so well known as the patterns they produce. The goal of the present work is to propose a new tool that helps to distinguish among different alternative processes behind the observed mating pattern. The full methodology was implemented in a software called InfoMating (available at http://acraaj.webs6.uvigo.es/InfoMating/Infomating.htm).",
                "authors": [
                    {
                        "name": "Carvajal-Rodriguez A."
                    }
                ],
                "citationCount": 5,
                "date": "2020-02-01T00:00:00Z",
                "journal": "Theoretical Population Biology",
                "title": "Multi-model inference of non-random mating from an information theoretic approach"
            },
            "pmid": "31756362"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ],
    "validated": 1
}