
{
    "credit": [
        {
            "name": "K.J. Dawson",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://idp.nature.com/login/natureuser?client_id=foxtrot&redirect_uri=https%3A%2F%2Fwww.nature.com%2Farticles%2Fhdy200929%2Femail%2Fcorrespondent%2Fc1%2Fnew"
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://www.genetix.univ-montp2.fr/partition/partition.html#notes"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Windows"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Statistics and probability",
                "uri": "http://edamontology.org/topic_2269"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Population genetics",
                "uri": "http://edamontology.org/topic_3056"
            },
            {
                "term": "Data visualisation",
                "uri": "http://edamontology.org/topic_0092"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/partition-2-0-partitionml-partitionview-maximum-likelihood-identifying-population-sub-division-assigning-individuals-to-populations.html"
        }
    ],
    "publication": [
        {
            "abstract": "Clustering problems (including the clustering of individuals into outcrossing populations, hybrid generations, full-sib families and selfing lines) have recently received much attention in population genetics. In these clustering problems, the parameter of interest is a partition of the set of sampled individuals the sample partition. In a fully Bayesian approach to clustering problems of this type, our knowledge about the sample partition is represented by a probability distribution on the space of possible sample partitions. As the number of possible partitions grows very rapidly with the sample size, we cannot visualize this probability distribution in its entirety, unless the sample is very small. As a solution to this visualization problem, we recommend using an agglomerative hierarchical clustering algorithm, which we call the exact linkage algorithm. This algorithm is a special case of the maximin clustering algorithm that we introduced previously. The exact linkage algorithm is now implemented in our software package PartitionView. The exact linkage algorithm takes the posterior co-assignment probabilities as input and yields as output a rooted binary tree, or more generally, a forest of such trees. Each node of this forest defines a set of individuals, and the node height is the posterior co-assignment probability of this set. This provides a useful visual representation of the uncertainty associated with the assignment of individuals to categories. It is also a useful starting point for a more detailed exploration of the posterior distribution in terms of the co-assignment probabilities.",
            "authors": [
                "Dawson K.J.",
                "Belkhir K."
            ],
            "cit_count": 6,
            "journal": "Heredity",
            "pmid": "19337306",
            "title": "An agglomerative hierarchical approach to visualization in Bayesian clustering problems",
            "year": "2009-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:partition",
        "biotoolsID": "partition",
        "description": "Model-based statistical software package for identifying population sub-division and assigning individuals to populations, on the basis of their genotypes at co-dominant marker loci. The underlying population genetic model is appropriate for out-crossing diploid organisms.",
        "homepage": "http://www.genetix.univ-montp2.fr/partition/partition.html",
        "name": "Partition"
    }
}