{
    "accessibility": "Open access",
    "additionDate": "2024-05-14T10:35:42.127354Z",
    "biotoolsCURIE": "biotools:cytoviewer",
    "biotoolsID": "cytoviewer",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "bernd.bodenmiller@uzh.ch",
            "name": "Bernd Bodenmiller",
            "typeEntity": "Person"
        }
    ],
    "description": "R/Bioconductor package for interactive visualization and exploration of highly multiplexed imaging data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://www.bioconductor.org/packages/release/bioc/html/cytoviewer.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T13:47:50.679253Z",
    "license": "GPL-3.0",
    "name": "cytoviewer",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/s12859-023-05546-z",
            "metadata": {
                "abstract": "Background: Highly multiplexed imaging enables single-cell-resolved detection of numerous biological molecules in their spatial tissue context. Interactive visualization of multiplexed imaging data is crucial at any step of data analysis to facilitate quality control and the spatial exploration of single cell features. However, tools for interactive visualization of multiplexed imaging data are not available in the statistical programming language R. Results: Here, we describe cytoviewer, an R/Bioconductor package for interactive visualization and exploration of multi-channel images and segmentation masks. The cytoviewer package supports flexible generation of image composites, allows side-by-side visualization of single channels, and facilitates the spatial visualization of single-cell data in the form of segmentation masks. As such, cytoviewer improves image and segmentation quality control, the visualization of cell phenotyping results and qualitative validation of hypothesis at any step of data analysis. The package operates on standard data classes of the Bioconductor project and therefore integrates with an extensive framework for single-cell and image analysis. The graphical user interface allows intuitive navigation and little coding experience is required to use the package. We showcase the functionality and biological application of cytoviewer by analysis of an imaging mass cytometry dataset acquired from cancer samples. Conclusions: The cytoviewer package offers a rich set of features for highly multiplexed imaging data visualization in R that seamlessly integrates with the workflow for image and single-cell data analysis. It can be installed from Bioconductor via https://www.bioconductor.org/packages/release/bioc/html/cytoviewer.html . The development version and further instructions can be found on GitHub at https://github.com/BodenmillerGroup/cytoviewer .",
                "authors": [
                    {
                        "name": "Bodenmiller B."
                    },
                    {
                        "name": "Eling N."
                    },
                    {
                        "name": "Meyer L."
                    }
                ],
                "citationCount": 1,
                "date": "2024-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "cytoviewer: an R/Bioconductor package for interactive visualization and exploration of highly multiplexed imaging data"
            },
            "pmcid": "PMC10765786",
            "pmid": "38172724"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Cytometry",
            "uri": "http://edamontology.org/topic_3934"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        }
    ]
}
