
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "topic": [
            {
                "term": "Machine learning",
                "uri": "http://edamontology.org/topic_3474"
            },
            {
                "term": "Sequence sites, features and motifs",
                "uri": "http://edamontology.org/topic_0160"
            },
            {
                "term": "Model organisms",
                "uri": "http://edamontology.org/topic_0621"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019 Elsevier LtdNeural models have been able to obtain state-of-the-art performances on several genome sequence-based prediction tasks. Such models take only nucleotide sequences as input and learn relevant features on their own. However, extracting the interpretable motifs from the model remains a challenge. This work explores various existing visualization techniques in their ability to infer relevant sequence information learnt by a recurrent neural network (RNN) on the task of splice junction identification. The visualization techniques have been modulated to suit the genome sequences as input. The visualizations inspect genomic regions at the level of a single nucleotide as well as a span of consecutive nucleotides. This inspection is performed based on the modification of input sequences (perturbation based) or the embedding space (back-propagation based). We infer features pertaining to both canonical and non-canonical splicing from a single neural model. Results indicate that the visualization techniques produce comparable performances for branchpoint detection. However, in the case of canonical donor and acceptor junction motifs, perturbation based visualizations perform better than back-propagation based visualizations, and vice-versa for non-canonical motifs. The source code of our stand-alone SpliceVisuL tool is available at https://github.com/aaiitggrp/SpliceVisuL.",
            "authors": [
                "Dutta A.",
                "Dalmia A.",
                "R A.",
                "Singh K.K.",
                "Anand A."
            ],
            "cit_count": 1,
            "doi": "10.1016/J.COMPBIOMED.2019.103558",
            "journal": "Computers in Biology and Medicine",
            "pmid": "31783254",
            "title": "Using the Chou's 5-steps rule to predict splice junctions with interpretable bidirectional long short-term memory networks",
            "year": "2020-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:SpliceVisuL",
        "biotoolsID": "SpliceVisuL",
        "description": "Using the Chou's 5-steps rule to predict splice junctions with interpretable bidirectional long short-term memory networks.\n\nSpliceVisuL: Visualization of Bidirectional Long Short-term Memory Networks for Splice Junction Prediction",
        "homepage": "https://github.com/aaiitggrp/SpliceVisuL",
        "name": "SpliceVisuL"
    }
}