{
    "additionDate": "2020-01-14T19:41:53Z",
    "biotoolsCURIE": "biotools:iACetyP",
    "biotoolsID": "iACetyP",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jdzxiaoxuan@163.com",
            "name": "Xuan Xiao",
            "typeEntity": "Person"
        }
    ],
    "description": "Identifying Acetylation Protein by Fusing Its PseAAC and Functional Domain Annotation.\n\niAcetyP : Identify acetylation protein via Chou's 5-steps rule and general pseudo components : Read Me : Supporting Information : Citation :.\n\nEnter the sequences of query proteins in FASTA format (Example), and select Submit button for identifying acetylation protein. The number of proteins is limited at 5 or less for each submission",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Post-translation modification site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "PTM localisation",
                    "uri": "http://edamontology.org/operation_3755"
                },
                {
                    "term": "Subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                }
            ]
        }
    ],
    "homepage": "http://www.jci-bioinfo.cn/iAcetyP",
    "lastUpdate": "2020-12-11T08:21:45Z",
    "name": "iACetyP",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FBIOE.2019.00311",
            "metadata": {
                "abstract": "© Copyright © 2019 Qiu, Xu, Xu, Zhang and Xiao.Acetylation is one of post-translational modification (PTM), which often reacts with acetic acid and brings an acetyl radical to an organic compound. It is helpful to identify acetylation protein correctly for understanding the mechanism of acetylation in biological systems. Although many acetylation sites have been identified by high throughput experimental studies via mass spectrometry, there still are lots of acetylation sites need to be discovered. Computational methods have showed their power for identifying acetylation sites with informatics techniques which usually reduce experiment cost and improve the effectiveness and efficiency. In fact, if there is an approach can distinguish the acetylated proteins from the non-acetylated ones, it is no doubt a very meaningful and effective method for this issue. Here, we proposed a novel computational method for identifying acetylation proteins by extracting features from the conservation information of sequence via gray system model and KNN scores based on the information of functional domain annotation and subcellular localization. The authors have performed the 5-fold cross-validation on three datasets along with much analysis of features and the Relief feature selection algorithm. The obtained accuracies are all satisfactory, as the mean performance, the accuracy is 77.10%, the Matthew's correlation coefficient is 0.5457, and the AUC value is 0.8389. These works might provide useful insights for the related experimental validation, and further studies of other PTM process. For the convenience of related researchers, the web-server named “iACetyP” was established and is accessible at http://www.jci-bioinfo.cn/iAcetyP.",
                "authors": [
                    {
                        "name": "Qiu W.-R."
                    },
                    {
                        "name": "Xu A."
                    },
                    {
                        "name": "Xu Z.-C."
                    },
                    {
                        "name": "Zhang C.-H."
                    },
                    {
                        "name": "Xiao X."
                    }
                ],
                "citationCount": 1,
                "date": "2019-12-06T00:00:00Z",
                "journal": "Frontiers in Bioengineering and Biotechnology",
                "title": "Identifying Acetylation Protein by Fusing Its PseAAC and Functional Domain Annotation"
            },
            "pmcid": "PMC6908504",
            "pmid": "31867311"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ],
    "validated": 1
}