{"collectionID": [], "accessibility": [], "topic": [{"term": "Structure prediction", "uri": "http://edamontology.org/topic_0082"}, {"term": "Molecular modelling", "uri": "http://edamontology.org/topic_2275"}, {"term": "Protein folding, stability and design", "uri": "http://edamontology.org/topic_0130"}], "owner": "mbs_import", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": null, "note": null, "version": null, "pmid": "27259540", "type": null, "pmcid": null, "metadata": {"title": "UniCon3D: De novo protein structure prediction using united-residue conformational search via stepwise, probabilistic sampling", "abstract": "© 2016 The Author. Published by Oxford University Press. All rights reserved. Motivation: Recent experimental studies have suggested that proteins fold via stepwise assembly of structural units named 'foldons' through the process of sequential stabilization. Alongside, latest developments on computational side based on probabilistic modeling have shown promising direction to perform de novo protein conformational sampling from continuous space. However, existing computational approaches for de novo protein structure prediction often randomly sample protein conformational space as opposed to experimentally suggested stepwise sampling. Results: Here, we develop a novel generative, probabilistic model that simultaneously captures local structural preferences of backbone and side chain conformational space of polypeptide chains in a united-residue representation and performs experimentally motivated conditional conformational sampling via stepwise synthesis and assembly of foldon units that minimizes a composite physics and knowledge-based energy function for de novo protein structure prediction. The proposed method, UniCon3D, has been found to (i) sample lower energy conformations with higher accuracy than traditional random sampling in a small benchmark of 6 proteins; (ii) perform comparably with the top five automated methods on 30 difficult target domains from the 11th Critical Assessment of Protein Structure Prediction (CASP) experiment and on 15 difficult target domains from the 10th CASP experiment; and (iii) outperform two state-of-the-art approaches and a baseline counterpart of UniCon3D that performs traditional random sampling for protein modeling aided by predicted residue-residue contacts on 45 targets from the 10th edition of CASP.", "citationCount": 7, "authors": [{"name": "Bhattacharya D."}, {"name": "Cao R."}, {"name": "Cheng J."}], "date": "2016-09-15T00:00:00Z", "journal": "Bioinformatics"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": null, "url": "http://bengal.missouri.edu/~chengji/", "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "chengji@missouri.edu"}], "biotoolsCURIE": "biotools:unicon3d", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "http://sysbio.rnet.missouri.edu/UniCon3D/", "function": [{"note": null, "input": [], "operation": [{"term": "Protein structure prediction", "uri": "http://edamontology.org/operation_0474"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:44Z", "otherID": [], "description": "Software for de novo protein structure prediction using united-residue conformational search via stepwise, probabilistic sampling.", "toolType": ["Command-line tool"], "editPermission": {"type": "private", "authors": []}, "language": [], "link": [{"url": "http://www.mybiosoftware.com/unicon3d-united-residue-protein-folding-via-stepwise-probabilistic-sampling.html", "note": null, "type": "Software catalogue"}], "biotoolsID": "unicon3d", "additionDate": "2017-08-03T19:03:49Z", "name": "UniCon3D", "license": null, "documentation": [{"url": "http://sysbio.rnet.missouri.edu/UniCon3D/", "note": null, "type": "General"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux"]}