{
    "additionDate": "2019-11-14T19:32:02Z",
    "biotoolsCURIE": "biotools:TMAT",
    "biotoolsID": "TMAT",
    "confidence_flag": "tool",
    "description": "Phylogenetic Tree-based Microbiome Association Test | Ecological patterns of the human microbiota exhibit high inter-subject variation, with few operational taxonomic units (OTUs) shared across individuals",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree comparison",
                    "uri": "http://edamontology.org/operation_0325"
                },
                {
                    "term": "Phylogenetic tree reconstruction",
                    "uri": "http://edamontology.org/operation_3478"
                },
                {
                    "term": "Tree-based sequence alignment",
                    "uri": "http://edamontology.org/operation_0499"
                }
            ]
        }
    ],
    "homepage": "http://healthstat.snu.ac.kr/software/tmat",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-28T16:17:56Z",
    "name": "TMAT",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ686",
            "metadata": {
                "abstract": "© 2020 Oxford University Press. All rights reserved.Motivation: Ecological patterns of the human microbiota exhibit high inter-subject variation, with few operational taxonomic units (OTUs) shared across individuals. To overcome these issues, non-parametric approaches, such as the Mann-Whitney U-test and Wilcoxon rank-sum test, have often been used to identify OTUs associated with host diseases. However, these approaches only use the ranks of observed relative abundances, leading to information loss, and are associated with high false-negative rates. In this study, we propose a phylogenetic tree-based microbiome association test (TMAT) to analyze the associations between microbiome OTU abundances and disease phenotypes. Phylogenetic trees illustrate patterns of similarity among different OTUs, and TMAT provides an efficient method for utilizing such information for association analyses. The proposed TMAT provides test statistics for each node, which are combined to identify mutations associated with host diseases. Results: Power estimates of TMAT were compared with existing methods using extensive simulations based on real absolute abundances. Simulation studies showed that TMAT preserves the nominal type-1 error rate, and estimates of its statistical power generally outperformed existing methods in the considered scenarios. Furthermore, TMAT can be used to detect phylogenetic mutations associated with host diseases, providing more in-depth insight into bacterial pathology.",
                "authors": [
                    {
                        "name": "Kim K.J."
                    },
                    {
                        "name": "Park J."
                    },
                    {
                        "name": "Park S.-C."
                    },
                    {
                        "name": "Won S."
                    }
                ],
                "citationCount": 2,
                "date": "2020-02-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Phylogenetic tree-based microbiome association test"
            },
            "pmid": "31504188"
        }
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        }
    ],
    "validated": 1
}
