{"credit":[{"email":"labs.net@gmail.com","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://sourceforge.net/p/biosunms/wiki/Home/"}],"download":[{"type":"Binaries","url":"https://sourceforge.net/projects/biosunms/files/latest/download"}],"function":[{"operation":[{"term":"Spectral analysis","uri":"http://edamontology.org/operation_3214"}]}],"labels":{"collectionID":["Proteomics"],"cost":"Free of charge","license":"GPL-1.0","toolType":["Plug-in"],"topic":[{"term":"Proteomics","uri":"http://edamontology.org/topic_0121"}]},"publication":[{"abstract":"Background. With wide applications of matrix-assisted laser desorption/ionization time-of-flight mass spectrometry (MALDI-TOF MS) and surface-enhanced laser desorption/ionization time-of-flight mass spectrometry (SELDI-TOF MS), statistical comparison of serum peptide profiles and management of patients information play an important role in clinical studies, such as early diagnosis, personalized medicine and biomarker discovery. However, current available software tools mainly focused on data analysis rather than providing a flexible platform for both the management of patients information and mass spectrometry (MS) data analysis. Results. Here we presented a plug-in-based software, BioSunMS, for both the management of patients information and serum peptide profiles-based statistical analysis. By integrating all functions into a user-friendly desktop application, BioSunMS provided a comprehensive solution for clinical researchers without any knowledge in programming, as well as a plug-in architecture platform with the possibility for developers to add or modify functions without need to recompile the entire application. Conclusion. BioSunMS provides a plug-in-based solution for managing, analyzing, and sharing high volumes of MALDI-TOF or SELDI-TOF MS data. The software is freely distributed under GNU General Public License (GPL) and can be downloaded from http://sourceforge.net/projects/biosunms/. © 2009 Cao et al; licensee BioMed Central Ltd.","authors":["Cao Y.","Wang N.","Ying X.","Li A.","Wang H.","Zhang X.","Li W."],"cit_count":5,"doi":"10.1186/1472-6947-9-13","journal":"BMC Medical Informatics and Decision Making","title":"BioSunMS: A plug-in-based software for the management of patients information and the analysis of peptide profiles from mass spectrometry","type":"Primary","year":"2009-03-18"}],"summary":{"biotoolsCURIE":"biotools:biosunms","biotoolsID":"biosunms","description":"Management of patients information and the analysis of peptide profiles from mass spectrometry.","homepage":"http://biosunms.sourceforge.net/","name":"BioSunMS"}}