{
    "accessibility": "Open access",
    "additionDate": "2022-10-26T09:26:03.637140Z",
    "biotoolsCURIE": "biotools:auto3d",
    "biotoolsID": "auto3d",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Olexandr Isayev",
            "orcidid": "https://orcid.org/0000-0001-7581-8497"
        },
        {
            "name": "Zhen Liu",
            "orcidid": "https://orcid.org/0000-0001-6025-5468"
        }
    ],
    "description": "Auto3D is a Python package for generating low-energy conformers from SMILES. It automatizes the stereoisomer enumeration and duplicate filtering process, 3D building process, fast geometry optimization and ranking process using ANI and AIMNet neural network atomistic potentials.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/isayevlab/Auto3D_pkg",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-10-26T09:26:03.639587Z",
    "license": "MIT",
    "name": "Auto3D",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.2C00817",
            "metadata": {
                "abstract": "© 2022 American Chemical Society.Computational programs accelerate the chemical discovery processes but often need proper three-dimensional molecular information as part of the input. Getting optimal molecular structures is challenging because it requires enumerating and optimizing a huge space of stereoisomers and conformers. We developed the Python-based Auto3D package for generating the low-energy 3D structures using SMILES as the input. Auto3D is based on state-of-the-art algorithms and can automatize the isomer enumeration and duplicate filtering process, 3D building process, geometry optimization, and ranking process. Tested on 50 molecules with multiple unspecified stereocenters, Auto3D is guaranteed to find the stereoconfiguration that yields the lowest-energy conformer. With Auto3D, we provide an extension of the ANI model. The new model, dubbed ANI-2xt, is trained on a tautomer-rich data set. ANI-2xt is benchmarked with DFT methods on geometry optimization and electronic and Gibbs free energy calculations. Compared with ANI-2x, ANI-2xt provides a 42% error reduction for tautomeric reaction energy calculations when using the gold-standard coupled-cluster calculation as the reference. ANI-2xt can accurately predict the energies and is several orders of magnitude faster than DFT methods.",
                "authors": [
                    {
                        "name": "Isayev O."
                    },
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Roitberg A."
                    },
                    {
                        "name": "Zubatiuk T."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "Auto3D: Automatic Generation of the Low-Energy 3D Structures with ANI Neural Network Potentials"
            },
            "pmid": "36112860"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        }
    ]
}
