{
    "name": "TEISER", 
    "description": "Robust and powerful framework for discovering post-transcriptional regulatory elemenets.", 
    "homepage": "https://tavazoielab.c2b2.columbia.edu/TEISER/", 
    "biotoolsID": "teiser", 
    "biotoolsCURIE": "biotools:teiser", 
    "version": [
        "1.0"
    ], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0438", 
                    "term": "Transcriptional regulatory element prediction"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0108", 
            "term": "Protein expression"
        }, 
        {
            "uri": "http://edamontology.org/topic_3512", 
            "term": "Gene transcripts"
        }, 
        {
            "uri": "http://edamontology.org/topic_0203", 
            "term": "Gene expression"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Mac"
    ], 
    "language": [
        "Perl"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/teiser-1-0-de-novo-motif-discovery-tool-finding-informative-structural-elements-rna.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "https://tavazoielab.c2b2.columbia.edu/TEISER/tutorial.html", 
            "type": "Manual", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1038/nature11013", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "Systematic discovery of structural elements governing stability of mammalian messenger RNAs", 
                "abstract": "Decoding post-transcriptional regulatory programs in RNA is a critical step towards the larger goal of developing predictive dynamical models of cellular behaviour. Despite recent efforts, the vast landscape of RNA regulatory elements remains largely uncharacterized. A long-standing obstacle is the contribution of local RNA secondary structure to the definition of interaction partners in a variety of regulatory contexts, including but not limited to transcript stability, alternative splicing and localization. There are many documented instances where the presence of a structural regulatory element dictates alternative splicing patterns (for example, human cardiac troponin T) or affects other aspects of RNA biology. Thus, a full characterization of post-transcriptional regulatory programs requires capturing information provided by both local secondary structures and the underlying sequence. Here we present a computational framework based on context-free grammars and mutual information that systematically explores the immense space of small structural elements and reveals motifs that are significantly informative of genome-wide measurements of RNA behaviour. By applying this framework to genome-wide human mRNA stability data, we reveal eight highly significant elements with substantial structural information, for the strongest of which we show a major role in global mRNA regulation. Through biochemistry, mass spectrometry and in vivo binding studies, we identified human HNRPA2B1 (heterogeneous nuclear ribonucleoprotein A2/B1, also known as HNRNPA2B1) as the key regulator that binds this element and stabilizes a large number of its target genes. We created a global post-transcriptional regulatory map based on the identity of the discovered linear and structural cis-regulatory elements, their regulatory interactions and their target pathways. This approach could also be used to reveal the structural elements that modulate other aspects of RNA behaviour. © 2012 Macmillan Publishers Limited.", 
                "date": "2012-05-09T00:00:00Z", 
                "citationCount": 89, 
                "authors": [
                    {
                        "name": "Goodarzi H."
                    }, 
                    {
                        "name": "Najafabadi H.S."
                    }, 
                    {
                        "name": "Oikonomou P."
                    }, 
                    {
                        "name": "Greco T.M."
                    }, 
                    {
                        "name": "Fish L."
                    }, 
                    {
                        "name": "Salavati R."
                    }, 
                    {
                        "name": "Cristea I.M."
                    }, 
                    {
                        "name": "Tavazoie S."
                    }
                ], 
                "journal": "Nature"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": null, 
            "url": "https://tavazoielab.c2b2.columbia.edu/lab/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-12-18T00:13:30Z", 
    "lastUpdate": "2018-12-10T12:58:52Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}