{"credit":[{"email":"fontaine@uni-mainz.de","name":"Jean Fred Fontaine","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://cbdm-01.zdv.uni-mainz.de/~jfontain/cms/?page_id=161"}],"function":[{"operation":[{"term":"Text mining","uri":"http://edamontology.org/operation_0306"}]}],"labels":{"language":["R","Perl"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Natural language processing","uri":"http://edamontology.org/topic_0218"}]},"publication":[{"abstract":"The biomedical literature is represented by millions of abstracts available in the Medline database. These abstracts can be queried with the PubMed interface, which provides a keyword-based Boolean search engine. This approach shows limitations in the retrieval of abstracts related to very specific topics, as it is difficult for a non-expert user to find all of the most relevant keywords related to a biomedical topic. Additionally, when searching for more general topics, the same approach may return hundreds of unranked references. To address these issues, text mining tools have been developed to help scientists focus on relevant abstracts. We have implemented the MedlineRanker webserver, which allows a flexible ranking of Medline for a topic of interest without expert knowledge. Given some abstracts related to a topic, the program deduces automatically the most discriminative words in comparison to a random selection. These words are used to score other abstracts, including those from not yet annotated recent publications, which can be then ranked by relevance. We show that our tool can be highly accurate and that it is able to process millions of abstracts in a practical amount of time. MedlineRanker is free for use and is available at http://cbdm.mdc-berlin.de/tools/medlineranker.","authors":["Fontaine J.-F.","Barbosa-Silva A.","Schaefer M.","Huska M.R.","Muro E.M.","Andrade-Navarro M.A."],"cit_count":50,"journal":"Nucleic Acids Research","pmid":"19429696","title":"MedlineRanker: Flexible ranking of biomedical literature","year":"2009-08-04"}],"summary":{"biotoolsCURIE":"biotools:medlineranker","biotoolsID":"medlineranker","description":"The MedlineRanker web server allows a flexible and fast ranking of Medline abstracts for a topic of interest without expert knowledge.","homepage":"http://cbdm-01.zdv.uni-mainz.de/~jfontain/cms/?page_id=4","name":"MedlineRanker"}}