{
    "additionDate": "2017-12-18T00:12:42Z",
    "biotoolsCURIE": "biotools:spell",
    "biotoolsID": "spell",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://reducio.princeton.edu/cm/"
        }
    ],
    "description": "Query-driven search engine for large gene expression microarray compendia. Given a small set of query genes, identifies which datasets are most informative for these genes, then within those datasets additional genes are identified with expression profiles most similar to the query set.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Microarray data analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Query",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://spell.princeton.edu/",
    "lastUpdate": "2018-12-10T12:58:58Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/spell-serial-pattern-of-expression-levels-locator.html"
        }
    ],
    "name": "SPELL",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btm403",
            "metadata": {
                "abstract": "Motivation: The increasing availability of gene expression microarray technology has resulted in the publication of thousands of microarray gene expression datasets investigating various biological conditions. This vast repository is still underutilized due to the lack of methods for fast, accurate exploration of the entire compendium. Results: We have collected Saccharomyces cerevisiae gene expression microarray data containing roughly 2400 experimental conditions. We analyzed the functional coverage of this collection and we designed a context-sensitive search algorithm for rapid exploration of the compendium. A researcher using our system provides a small set of query genes to establish a biological search context; based on this query, we weight each dataset's relevance to the context, and within these weighted datasets we identify additional genes that are co-expressed with the query set. Our method exhibits an average increase in accuracy of 273% compared to previous mega-clustering approaches when recapitulating known biology. Further, we find that our search paradigm identifies novel biological predictions that can be verified through further experimentation. Our methodology provides the ability for biological researchers to explore the totality of existing microarray data in a manner useful for drawing conclusions and formulating hypotheses, which we believe is invaluable for the research community. © The Author 2007. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Hess D.C."
                    },
                    {
                        "name": "Hibbs M.A."
                    },
                    {
                        "name": "Huttenhower C."
                    },
                    {
                        "name": "Li K."
                    },
                    {
                        "name": "Myers C.L."
                    },
                    {
                        "name": "Troyanskaya O.G."
                    }
                ],
                "citationCount": 191,
                "date": "2007-10-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Exploring the functional landscape of gene expression: Directed search of large microarray compendia"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1,
    "version": [
        "2.0.3"
    ]
}
