{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:11:45Z",
    "biotoolsCURIE": "biotools:MonkeyLogic",
    "biotoolsID": "MonkeyLogic",
    "cost": "Free of charge",
    "description": "Software tool for behavioral control and data acquisition.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://monkeylogic.nimh.nih.gov/docs.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://monkeylogic.nimh.nih.gov/",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2020-06-16T10:55:25Z",
    "license": "Unlicense",
    "maturity": "Mature",
    "name": "MonkeyLogic",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1016/J.JNEUMETH.2019.05.002",
            "metadata": {
                "abstract": "© 2019Background: Computerized control of behavioral paradigms is an essential element of neurobehavioral studies, especially physiological recording studies that require sub-millisecond precision. Few software solutions provide a simple, flexible environment to create and run these applications. MonkeyLogic, a MATLAB-based package, was developed to meet these needs, but faces a performance crisis and obsolescence due to changes in MATLAB itself. New method: Here we report a complete redesign and rewrite of MonkeyLogic, now NIMH MonkeyLogic, that natively supports the latest 64-bit MATLAB on the Windows platform. Major layers of the underlying real-time hardware control were removed and replaced by custom toolboxes: NIMH DAQ Toolbox and MonkeyLogic Graphics Library. The redesign resolves undesirable delays in data transfers and limitations in graphics capabilities. Results: NIMH MonkeyLogic is essentially a new product. It provides a powerful new scripting framework, has dramatic speed enhancements and provides major new graphics abilities. Comparison with existing method: NIMH MonkeyLogic is fully backward compatible with earlier task scripts, but with better temporal precision. It provides more input device options, superior graphics and a new real-time closed-loop programming model. Because NIMH MonkeyLogic requires no commercial toolbox and has a reduced hardware requirement, implementation costs are substantially reduced. Conclusion: NIMH MonkeyLogic is a versatile, powerful, up-to-date tool for controlling a wide range of experiments. It is freely available from https://monkeylogic.nimh.nih.gov/.",
                "authors": [
                    {
                        "name": "Hwang J."
                    },
                    {
                        "name": "Mitz A.R."
                    },
                    {
                        "name": "Murray E.A."
                    }
                ],
                "citationCount": 9,
                "date": "2019-07-15T00:00:00Z",
                "journal": "Journal of Neuroscience Methods",
                "title": "NIMH MonkeyLogic: Behavioral control and data acquisition in MATLAB"
            },
            "pmid": "31071345",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Data acquisition",
            "uri": "http://edamontology.org/topic_3077"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        }
    ],
    "validated": 1
}
