{
    "accessibility": "Open access",
    "additionDate": "2021-12-19T17:17:03.113226Z",
    "biotoolsCURIE": "biotools:costa",
    "biotoolsID": "costa",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "rmccord@utk.edu",
            "name": "Rachel Patton McCord",
            "orcidid": "https://orcid.org/0000-0003-0010-5323",
            "typeEntity": "Person"
        }
    ],
    "description": "CoSTA: Unsupervised convolutional neural network learning for spatial transcriptomics analysis.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Expression profile clustering",
                    "uri": "http://edamontology.org/operation_0313"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/rpmccordlab/CoSTA",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2021-12-19T17:17:03.115849Z",
    "license": "MIT",
    "name": "CoSTA",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04314-1",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: The rise of spatial transcriptomics technologies is leading to new insights about how gene regulation happens in a spatial context. Determining which genes are expressed in similar spatial patterns can reveal gene regulatory relationships across cell types in a tissue. However, many current analysis methods do not take full advantage of the spatial organization of the data, instead treating pixels as independent features. Here, we present CoSTA: a novel approach to learn spatial similarities between gene expression matrices via convolutional neural network (ConvNet) clustering. Results: By analyzing simulated and previously published spatial transcriptomics data, we demonstrate that CoSTA learns spatial relationships between genes in a way that emphasizes broader spatial patterns rather than pixel-level correlation. CoSTA provides a quantitative measure of expression pattern similarity between each pair of genes rather than only classifying genes into categories. We find that CoSTA identifies narrower, but biologically relevant, sets of significantly related genes as compared to other approaches. Conclusions: The deep learning CoSTA approach provides a different angle to spatial transcriptomics analysis by focusing on the shape of expression patterns, using more information about the positions of neighboring pixels than would an overlap or pixel correlation approach. CoSTA can be applied to any spatial transcriptomics data represented in matrix form and may have future applications to datasets such as histology in which images of different genes are from similar but not identical biological sections.",
                "authors": [
                    {
                        "name": "McCord R.P."
                    },
                    {
                        "name": "Xu Y."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "CoSTA: unsupervised convolutional neural network learning for spatial transcriptomics analysis"
            },
            "pmcid": "PMC8351440",
            "pmid": "34372758"
        }
    ],
    "topic": [
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
