{
    "additionDate": "2021-03-19T08:26:44Z",
    "biotoolsCURIE": "biotools:mixindependr",
    "biotoolsID": "mixindependr",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "BingSong@my.unthsc.edu",
            "name": "Bing Song",
            "orcidid": "https://orcid.org/0000-0002-9905-410X",
            "typeEntity": "Person"
        }
    ],
    "description": "A R package for statistical independence testing of loci in database of multi-locus genotypes.\n\nGenetics and Independence Testing of Mixed Genetic Panels.\n\nDeveloped to deal with multi-locus genotype data, this package is especially designed for those panel which include different type of markers. Basic genetic parameters like allele frequency, genotype frequency, heterozygosity and Hardy-Weinberg test of mixed genetic data can be obtained. In addition, a new test for mutual independence which is compatible for mixed genetic data is developed in this package.\n\nThe goal of mixIndependR is to test the mutual independence of mixed genetic markers.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA testing",
                    "uri": "http://edamontology.org/operation_3920"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Linkage disequilibrium calculation",
                    "uri": "http://edamontology.org/operation_0488"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/mixIndependR/index.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-05-06T07:26:31Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/ice4prince/mixIndependR.git"
        }
    ],
    "name": "mixIndependR",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03945-0",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Multi-locus genotype data are widely used in population genetics and disease studies. In evaluating the utility of multi-locus data, the independence of markers is commonly considered in many genomic assessments. Generally, pairwise non-random associations are tested by linkage disequilibrium; however, the dependence of one panel might be triplet, quartet, or other. Therefore, a compatible and user-friendly software is necessary for testing and assessing the global linkage disequilibrium among mixed genetic data. Results: This study describes a software package for testing the mutual independence of mixed genetic datasets. Mutual independence is defined as no non-random associations among all subsets of the tested panel. The new R package “mixIndependR” calculates basic genetic parameters like allele frequency, genotype frequency, heterozygosity, Hardy–Weinberg equilibrium, and linkage disequilibrium (LD) by mutual independence from population data, regardless of the type of markers, such as simple nucleotide polymorphisms, short tandem repeats, insertions and deletions, and any other genetic markers. A novel method of assessing the dependence of mixed genetic panels is developed in this study and functionally analyzed in the software package. By comparing the observed distribution of two common summary statistics (the number of heterozygous loci [K] and the number of share alleles [X]) with their expected distributions under the assumption of mutual independence, the overall independence is tested. Conclusion: The package “mixIndependR” is compatible to all categories of genetic markers and detects the overall non-random associations. Compared to pairwise disequilibrium, the approach described herein tends to have higher power, especially when number of markers is large. With this package, more multi-functional or stronger genetic panels can be developed, like mixed panels with different kinds of markers. In population genetics, the package “mixIndependR” makes it possible to discover more about admixture of populations, natural selection, genetic drift, and population demographics, as a more powerful method of detecting LD. Moreover, this new approach can optimize variants selection in disease studies and contribute to panel combination for treatments in multimorbidity. Application of this approach in real data is expected in the future, and this might bring a leap in the field of genetic technology. Availability: The R package mixIndependR, is available on the Comprehensive R Archive Network (CRAN) at: https://cran.r-project.org/web/packages/mixIndependR/index.html.",
                "authors": [
                    {
                        "name": "Planz J."
                    },
                    {
                        "name": "Song B."
                    },
                    {
                        "name": "Woerner A.E."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "mixIndependR: a R package for statistical independence testing of loci in database of multi-locus genotypes"
            },
            "pmcid": "PMC7788837",
            "pmid": "33407074"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
