{"credit":[{"email":"scooper@ccs.neu.edu","name":"Seth Cooper","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://fold.it/dist/external/standalone/quickstart.html"}],"function":[{"operation":[{"term":"Protein structure analysis","uri":"http://edamontology.org/operation_2406"}]}],"labels":{"language":["C++"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Desktop application"],"topic":[{"term":"Proteins","uri":"http://edamontology.org/topic_0078"},{"term":"Protein structure analysis","uri":"http://edamontology.org/topic_2814"},{"term":"Molecular modelling","uri":"http://edamontology.org/topic_2275"}]},"publication":[{"abstract":"© The Author(s) 2017. Published by Oxford University Press. Summary: Foldit Standalone is an interactive graphical interface to the Rosetta molecular modeling package. In contrast to most command-line or batch interactions with Rosetta, Foldit Standalone is designed to allow easy, real-time, direct manipulation of protein structures, while also giving access to the extensive power of Rosetta computations. Derived from the user interface of the scientific discovery game Foldit (itself based on Rosetta), Foldit Standalone has added more advanced features and removed the competitive game elements. Foldit Standalone was built from the ground up with a custom rendering and event engine, configurable visualizations and interactions driven by Rosetta. Foldit Standalone contains, among other features: electron density and contact map visualizations, multiple sequence alignment tools for template-based modeling, rigid body transformation controls, RosettaScripts support and an embedded Lua interpreter. Availability and Implementation: Foldit Standalone is available for download at https://fold.it/standalone , under the Rosetta license, which is free for academic and non-profit users. It is implemented in cross-platform C ++ and binary executables are available for Windows, macOS and Linux. Contact: scooper@ccs.neu.edu.","authors":["Kleffner R.","Flatten J.","Leaver-Fay A.","Baker D.","Siegel J.B.","Khatib F.","Cooper S."],"cit_count":6,"doi":"10.1093/bioinformatics/btx283","journal":"Bioinformatics (Oxford, England)","title":"Foldit Standalone: a video game-derived protein structure manipulation interface using Rosetta","year":"2017-09-01"}],"summary":{"biotoolsCURIE":"biotools:foldit_standalone","biotoolsID":"foldit_standalone","description":"Interactive graphical interface to the Rosetta molecular modeling package.","homepage":"https://fold.it/dist/external/standalone/quickstart.html","name":"Foldit Standalone"}}