{
    "additionDate": "2018-05-14T09:36:08Z",
    "biotoolsCURIE": "biotools:resicon",
    "biotoolsID": "resicon",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "email": "pawel@bioexploratorium.pl",
            "name": "Pawel Daniluk",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A method for the identification of dynamic domains, hinges and interfacial regions in proteins",
    "documentation": [
        {
            "type": "General",
            "url": "http://dworkowa.imdik.pan.pl/EP/page/ResiCon/help#structure"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein domain recognition",
                    "uri": "http://edamontology.org/operation_0246"
                }
            ]
        }
    ],
    "homepage": "http://dworkowa.imdik.pan.pl/EP/ResiCon/",
    "lastUpdate": "2019-03-26T08:37:40Z",
    "name": "ResiCon",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btv525",
            "metadata": {
                "abstract": "© 2015 The Author 2015. Published by Oxford University Press. All rights reserved. Motivation: Structure of most proteins is flexible. Identification and analysis of intramolecular motions is a complex problem. Breaking a structure into relatively rigid parts, the so-called dynamic domains, may help comprehend the complexity of protein's mobility. We propose a new approach called ResiCon (Residue Contacts analysis), which performs this task by applying a data-mining analysis of an ensemble of protein configurations and recognizes dynamic domains, hinges and interfacial regions, by considering contacts between residues. Results: Dynamic domains found by ResiCon are more compact than those identified by two other popular methods: PiSQRD and GeoStaS. The current analysis was carried out using a known reference set of 30 NMR protein structures, as well as molecular dynamics simulation data of flap opening events in HIV-1 protease. The more detailed analysis of HIV-1 protease dataset shows that ResiCon identified dynamic domains involved in structural changes of functional importance. Availability and implementation: The ResiCon server is available at URL: http://dworkowa.imdik.pan.pl/EP/ResiCon.",
                "authors": [
                    {
                        "name": "Dziubinski M."
                    },
                    {
                        "name": "Daniluk P."
                    },
                    {
                        "name": "Lesyng B."
                    }
                ],
                "citationCount": 5,
                "date": "2016-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "ResiCon: A method for the identification of dynamic domains, hinges and interfacial regions in proteins"
            },
            "pmid": "26342233"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        }
    ]
}