{
    "additionDate": "2015-08-03T09:37:07Z",
    "biotoolsCURIE": "biotools:massspecapi",
    "biotoolsID": "massspecapi",
    "credit": [
        {
            "name": "BioCatalogue",
            "typeEntity": "Project",
            "typeRole": [
                "Documentor"
            ],
            "url": "https://www.biocatalogue.org"
        },
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.chemspider.com/Help.aspx?"
        }
    ],
    "description": "Search by molecular mass or elemental composition within ChemSpider or within particular data source(s).",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.chemspider.com/MassSpecAPI.asmx"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "http://www.chemspider.com/MassSpecAPI.asmx",
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "https://www.biocatalogue.org/services/2040"
        }
    ],
    "name": "MassSpecAPI",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "BioCatalogue",
    "publication": [
        {
            "doi": "10.1007/s13361-011-0265-y",
            "metadata": {
                "abstract": "In many cases, an unknown to an investigator is actually known in the chemical literature, a reference database, or an internet resource. We refer to these types of compounds as \"known unknowns.\" ChemSpider is a very valuable internet database of known compounds useful in the identification of these types of compounds in commercial, environmental, forensic, and natural product samples. The database contains over 26 million entries from hundreds of data sources and is provided as a free resource to the community. Accurate mass mass spectrometry data is used to query the database by either elemental composition or a monoisotopic mass. Searching by elemental composition is the preferred approach. However, it is often difficult to determine a unique elemental composition for compounds with molecular weights greater than 600 Da. In these cases, searching by the monoisotopic mass is advantageous. In either case, the search results are refined by sorting the number of references associated with each compound in descending order. This raises the most useful candidates to the top of the list for further evaluation. These approaches were shown to be successful in identifying \"known unknowns\" noted in our laboratory and for compounds of interest to others. © 2011 American Society for Mass Spectrometry.",
                "authors": [
                    {
                        "name": "Little J.L."
                    },
                    {
                        "name": "Williams A.J."
                    },
                    {
                        "name": "Pshenichnov A."
                    },
                    {
                        "name": "Tkachenko V."
                    }
                ],
                "citationCount": 103,
                "date": "2012-01-01T00:00:00Z",
                "journal": "Journal of the American Society for Mass Spectrometry",
                "title": "Identification of \"known unknowns\" utilizing accurate mass data and chemspider"
            },
            "type": [
                "Review"
            ]
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}