{"credit":[{"email":"lenov@ebi.ac.uk","name":"Nicolas Le Novère","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.ebi.ac.uk/compneur-srv/"}],"documentation":[{"url":"http://www.ebi.ac.uk/biomodels/tools/melting/melting5-doc/melting.html"}],"function":[{"operation":[{"term":"Nucleic acid structure analysis","uri":"http://edamontology.org/operation_2481"}]}],"labels":{"language":["Java","Perl","C"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Desktop application"],"topic":[{"term":"Nucleic acid structure analysis","uri":"http://edamontology.org/topic_0097"},{"term":"Nucleic acids","uri":"http://edamontology.org/topic_0077"},{"term":"DNA","uri":"http://edamontology.org/topic_0654"},{"term":"RNA","uri":"http://edamontology.org/topic_0099"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/melting-5-0-3-compute-nucleic-acid-duplex-melting-temperature.html"}],"publication":[{"abstract":"Background: Computing accurate nucleic acid melting temperatures has become a crucial step for the efficiency and the optimisation of numerous molecular biology techniques such as in situ hybridization, PCR, antigene targeting, and microarrays. MELTING is a free open source software which computes the enthalpy, entropy and melting temperature of nucleic acids. MELTING 4.2 was able to handle several types of hybridization such as DNA/DNA, RNA/RNA, DNA/RNA and provided corrections to melting temperatures due to the presence of sodium. The program can use either an approximative approach or a more accurate Nearest-Neighbor approach.Results: Two new versions of the MELTING software have been released. MELTING 4.3 is a direct update of version 4.2, integrating newly available thermodynamic parameters for inosine, a modified adenine base with an universal base capacity, and incorporates a correction for magnesium. MELTING 5 is a complete reimplementation which allows much greater flexibility and extensibility. It incorporates all the thermodynamic parameters and corrections provided in MELTING 4.x and introduces a large set of thermodynamic formulae and parameters, to facilitate the calculation of melting temperatures for perfectly matching sequences, mismatches, bulge loops, CNG repeats, dangling ends, inosines, locked nucleic acids, 2-hydroxyadenines and azobenzenes. It also includes temperature corrections for monovalent ions (sodium, potassium, Tris), magnesium ions and commonly used denaturing agents such as formamide and DMSO.Conclusions: MELTING is a useful and very flexible tool for predicting melting temperatures using approximative formulae or Nearest-Neighbor approaches, where one can select different sets of Nearest-Neighbor parameters, corrections and formulae. Both versions are freely available at http://sourceforge.net/projects/melting/and at http://www.ebi.ac.uk/compneur-srv/melting/under the terms of the GPL license. © 2012 Le Novère et al.; licensee BioMed Central Ltd.","authors":["Dumousseau M.","Rodriguez N.","Juty N.","Novere N.L."],"cit_count":16,"journal":"BMC Bioinformatics","pmid":"22591039","title":"MELTING, a flexible platform to predict the melting temperatures of nucleic acids","year":"2012-05-16"}],"summary":{"biotoolsCURIE":"biotools:melting","biotoolsID":"melting","description":"Computes, for a nucleic acid duplex, the enthalpy, the entropy and the melting temperature of the helix-coil transitions. Three types of hybridisation are possible: DNA/DNA, DNA/RNA, and RNA/RNA.","homepage":"http://www.ebi.ac.uk/compneur-srv/melting/","name":"Melting"}}