{
    "additionDate": "2021-01-18T07:34:24Z",
    "biotoolsCURIE": "biotools:michelanglo",
    "biotoolsID": "michelanglo",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "matteo.ferla@well.ox.ac.uk",
            "name": "Matteo P Ferla",
            "orcidid": "https://orcid.org/0000-0002-5508-4673",
            "typeEntity": "Person"
        }
    ],
    "description": "Sculpting protein views on web pages without coding.\n\nMichelaɴɢʟo is a web app to convert a PyMOL PSE file or PDB file to a easy to implement NGL.js view that can be implemented easily on any site.\n\nConvert PyMOL files, upload PDB files or submit PDB codes and create a webpage to edit, share or implement standalone on your site.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                }
            ]
        }
    ],
    "homepage": "http://michelanglo.sgc.ox.ac.uk",
    "language": [
        "Python",
        "JavaScript",
        "PyMOL"
    ],
    "lastUpdate": "2021-02-22T09:00:06Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/thesgc/MichelaNGLo"
        }
    ],
    "name": "MichelaNglo",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA104",
            "metadata": {
                "abstract": "© 2020 The Author(s). Published by Oxford University Press. All rights reserved.Motivation: The sharing of macromolecular structural information online by scientists is predominantly performed via 2D static images, since the embedding of interactive 3D structures in webpages is non-trivial. Whilst the technologies to do so exist, they are often only implementable with significant web coding experience. Results: Michelao is an accessible and open-source web-based application that supports the generation, customization and sharing of interactive 3D macromolecular visualizations for digital media without requiring programming skills. A PyMOL file, PDB file, PDB identifier code or protein/gene name can be provided to form the basis of visualizations using the NGL JavaScript library. Hyperlinks that control the view can be added to text within the page. Protein-coding variants can be highlighted to support interpretation of their potential functional consequences. The resulting visualizations and text can be customized and shared, as well as embedded within existing websites by following instructions and using a self-contained download. Michelae o allows researchers to move away from static images and instead engage, describe and explain their protein to a wider audience in a more interactive fashion.",
                "authors": [
                    {
                        "name": "Ferla M.P."
                    },
                    {
                        "name": "Pagnamenta A.T."
                    },
                    {
                        "name": "Damerell D."
                    },
                    {
                        "name": "Taylor J.C."
                    },
                    {
                        "name": "Marsden B.D."
                    }
                ],
                "citationCount": 2,
                "date": "2020-05-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "MichelaNglo: Sculpting protein views on web pages without coding"
            },
            "pmcid": "PMC7214029",
            "pmid": "32061125"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ]
}