
{
    "credit": [
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "https://ppicurator.hupo.org.cn/help"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                }
            ]
        }
    ],
    "labels": {
        "accessibility": [
            "Open access"
        ],
        "cost": "Free of charge",
        "license": "Unlicense",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Protein interactions",
                "uri": "http://edamontology.org/topic_0128"
            },
            {
                "term": "Natural language processing",
                "uri": "http://edamontology.org/topic_0218"
            },
            {
                "term": "Proteomics",
                "uri": "http://edamontology.org/topic_0121"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2018 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim Protein–protein interaction extraction through biological literature curation is widely employed for proteome analysis. There is a strong need for a tool that can assist researchers in extracting comprehensive PPI information through literature curation, which is critical in research on protein, for example, construction of protein interaction network, identification of protein signaling pathway, and discovery of meaningful protein interaction. However, most of current tools can only extract PPI relations. None of them are capable of extracting other important PPI information, such as interaction directions, effects, and functional annotations. To address these issues, this paper proposes PPICurator, a novel tool for extracting comprehensive PPI information with a variety of logic and syntax features based on a new support vector machine classifier. PPICurator provides a friendly web-based user interface. It is a platform that automates the extraction of comprehensive PPI information through literature, including PPI relations, as well as their confidential scores, interaction directions, effects, and functional annotations. Thus, PPICurator is more comprehensive than state-of-the-art tools. Moreover, it outperforms state-of-the-art tools in the accuracy of PPI relation extraction measured by F-score and recall on the widely used open datasets. PPICurator is available at https://ppicurator.hupo.org.cn.",
            "authors": [
                "Li M.",
                "He Q.",
                "Ma J.",
                "He F.",
                "Zhu Y.",
                "Chang C.",
                "Chen T."
            ],
            "cit_count": 0,
            "doi": "10.1002/pmic.201800291",
            "journal": "Proteomics",
            "pmid": "30521143",
            "title": "PPICurator: A Tool for Extracting Comprehensive Protein–Protein Interaction Information",
            "type": "Primary",
            "year": "2019-02-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:PPICurator",
        "biotoolsID": "PPICurator",
        "description": "Tool for extracting comprehensive protein-protein interaction information.",
        "homepage": "https://ppicurator.hupo.org.cn/",
        "name": "PPICurator"
    }
}