{"credit":[{"email":"zhong@ams.jhu.edu","name":"Xiaogang Zhong","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"url":"http://bioconductor.org/packages/release/bioc/html/MergeMaid.html"}],"download":[{"type":"Source code","url":"http://bioconductor/packages/release/bioc/src/contrib/MergeMaid_2.46.0.tar.gz"}],"function":[{"operation":[{"term":"Formatting","uri":"http://edamontology.org/operation_0335"}]}],"labels":{"collectionID":["BioConductor"],"language":["R"],"license":"GPL-2.0","operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool","Library"],"topic":[{"term":"Gene expression","uri":"http://edamontology.org/topic_0203"},{"term":"Genetics","uri":"http://edamontology.org/topic_3053"},{"term":"Microarray experiment","uri":"http://edamontology.org/topic_3518"}]},"link":[{"type":"MIRROR","url":"http://astor.som.jhmi.edu/MergeMaid"}],"publication":[{"abstract":"Cross-study validation of gene expression investigations is critical in genomic analysis. We developed an R package and associated object definitions to merge and visualize multiple gene expression datasets. Our merging functions use arbitrary character IDs and generate objects that can efficiently support a variety of joint analyses. Visualization tools support exploration and cross-study validation of the data, without requiring normalization across platforms. Tools include \"integrative correlation\" plots that is, scatterplots of all pairwise correlations in one study against the corresponding pairwise correlations of another, both for individual genes and all genes combined. Gene-specific plots can be used to identify genes whose changes are reliably measured across studies. Visualizations also include scatterplots of gene-specific statistics quantifying relationships between expression and phenotypes of interest, using linear, logistic and Cox regression.","authors":["Cope L.","Zhong X.","Garrett E.","Parmigiani G."],"cit_count":18,"doi":"10.2202/1544-6115.1046","journal":"Statistical Applications in Genetics and Molecular Biology","title":"MergeMaid: R tools for merging and cross-study validation of gene expression data","type":"Primary","year":"2004-01-01"}],"summary":{"biotoolsCURIE":"biotools:mergemaid","biotoolsID":"mergemaid","description":"This R extension studies gene expression array data. Its main function is 'mergeExprs' which transforms the input objects into data in the merged format, such that common genes in different datasets can be easily found. And the function 'intcor' calculates the correlation coefficients. Other functions use the output from 'modelOutcome' to graphically display the results and cross-validate associations of gene expression data with survival.","homepage":"http://bioconductor.org/packages/release/bioc/html/MergeMaid.html","name":"MergeMaid","version":["2.46.0"]}}