{
    "accessibility": "Open access",
    "additionDate": "2023-02-15T02:12:13.431379Z",
    "biotoolsCURIE": "biotools:qvt",
    "biotoolsID": "qvt",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Eduard Montseny"
        },
        {
            "name": "Nelly Gordillo"
        },
        {
            "name": "Pilar Sobrevilla"
        }
    ],
    "description": "Automated hemodynamic assessment for cranial 4D flow MRI.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/uwmri/QVT",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2024-11-24T15:00:58.673572Z",
    "license": "BSD-2-Clause",
    "name": "QVT",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/j.mri.2022.12.016",
            "metadata": {
                "abstract": "Cranial 4D flow MRI post-processing typically involves manual user interaction which is time-consuming and associated with poor repeatability. The primary goal of this study is to develop a robust quantitative velocity tool (QVT) that utilizes threshold-based segmentation techniques to improve segmentation quality over prior approaches based on centerline processing schemes (CPS) that utilize k-means clustering segmentation. This tool also includes an interactive 3D display designed for simplified vessel selection and automated hemodynamic visualization and quantification. The performances of QVT and CPS were compared in vitro in a flow phantom and in vivo in 10 healthy participants. Vessel segmentations were compared with ground-truth computed tomography in vitro (29 locations) and manual segmentation in vivo (13 locations) using linear regression. Additionally, QVT and CPS MRI flow rates were compared to perivascular ultrasound flow in vitro using linear regression. To assess internal consistency of flow measures in vivo, conservation of flow was assessed at vessel junctions using linear regression and consistency of flow along vessel segments was analyzed by fitting a Gaussian distribution to a histogram of normalized flow values. Post-processing times were compared between the QVT and CPS using paired t-tests. Vessel areas segmented in vitro (CPS: slope = 0.71, r = 0.95 and QVT: slope = 1.03, r = 0.95) and in vivo (CPS: slope = 0.61, r = 0.96 and QVT: slope = 0.93, r = 0.96) were strongly correlated with ground-truth area measurements. However, CPS (using k-means segmentation) consistently underestimated vessel areas. Strong correlations were observed between QVT and ultrasound flow (slope = 0.98, r = 0.96) as well as flow at junctions (slope = 1.05, r = 0.98). Mean and standard deviation of flow along vessel segments was 9.33e-16 ± 3.05%. Additionally, the QVT demonstrated excellent interobserver agreement and significantly reduced post-processing by nearly 10 min (p < 0.001). By completely automating post-processing and providing an easy-to-use 3D visualization interface for interactive vessel selection and hemodynamic quantification, the QVT offers an efficient, robust, and repeatable means to analyze cranial 4D flow MRI. This software is freely available at: https://github.com/uwmri/QVT.",
                "authors": [
                    {
                        "name": "Berman S.E."
                    },
                    {
                        "name": "Eisenmenger L.B."
                    },
                    {
                        "name": "Hoffman C.A."
                    },
                    {
                        "name": "Rivera-Rivera L.A."
                    },
                    {
                        "name": "Roberts G.S."
                    },
                    {
                        "name": "Wieben O."
                    }
                ],
                "citationCount": 9,
                "date": "2023-04-01T00:00:00Z",
                "journal": "Magnetic Resonance Imaging",
                "title": "Automated hemodynamic assessment for cranial 4D flow MRI"
            },
            "pmid": "36581214"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ]
}
