{
    "additionDate": "2019-11-14T18:07:31Z",
    "biotoolsCURIE": "biotools:PeNGaRoo",
    "biotoolsID": "PeNGaRoo",
    "confidence_flag": "tool",
    "description": "Combined gradient boosting and ensemble learning framework for predicting non-classical secreted proteins | A toolkit for predicting non-classical secreted proteins by combining the gradient boosting machine in an ensemble learning framework | A combined gradient boosting and ensemble learning framework for predicting non-classical secreted proteins | In this work, we first constructed a high-quality dataset of experimentally verified “non-classical” secreted proteins, which we then used to create benchmark datasets | Gram-positive bacteria have developed secretion systems to transport proteins across their cell wall, a process that plays an important role during host infection",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Side chain modelling",
                    "uri": "http://edamontology.org/operation_0480"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                }
            ]
        }
    ],
    "homepage": "http://pengaroo.erc.monash.edu/",
    "lastUpdate": "2020-12-01T11:17:33.671081Z",
    "name": "PeNGaRoo",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ629",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press. All rights reserved.Motivation: Gram-positive bacteria have developed secretion systems to transport proteins across their cell wall, a process that plays an important role during host infection. These secretion mechanisms have also been harnessed for therapeutic purposes in many biotechnology applications. Accordingly, the identification of features that select a protein for efficient secretion from these microorganisms has become an important task. Among all the secreted proteins, 'non-classical' secreted proteins are difficult to identify as they lack discernable signal peptide sequences and can make use of diverse secretion pathways. Currently, several computational methods have been developed to facilitate the discovery of such non-classical secreted proteins; however, the existing methods are based on either simulated or limited experimental datasets. In addition, they often employ basic features to train the models in a simple and coarse-grained manner. The availability of more experimentally validated datasets, advanced feature engineering techniques and novel machine learning approaches creates new opportunities for the development of improved predictors of 'non-classical' secreted proteins from sequence data. Results: In this work, we first constructed a high-quality dataset of experimentally verified 'non-classical' secreted proteins, which we then used to create benchmark datasets. Using these benchmark datasets, we comprehensively analyzed a wide range of features and assessed their individual performance. Subsequently, we developed a two-layer Light Gradient Boosting Machine (LightGBM) ensemble model that integrates several single feature-based models into an overall prediction framework. At this stage, LightGBM, a gradient boosting machine, was used as a machine learning approach and the necessary parameter optimization was performed by a particle swarm optimization strategy. All single feature-based LightGBM models were then integrated into a unified ensemble model to further improve the predictive performance. Consequently, the final ensemble model achieved a superior performance with an accuracy of 0.900, an F-value of 0.903, Matthew's correlation coefficient of 0.803 and an area under the curve value of 0.963, and outperforming previous state-of-the-art predictors on the independent test. Based on our proposed optimal ensemble model, we further developed an accessible online predictor, PeNGaRoo, to serve users' demands. We believe this online web server, together with our proposed methodology, will expedite the discovery of non-classically secreted effector proteins in Gram-positive bacteria and further inspire the development of next-generation predictors.",
                "authors": [
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Yu S."
                    },
                    {
                        "name": "Xie R."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Leier A."
                    },
                    {
                        "name": "Marquez-Lago T.T."
                    },
                    {
                        "name": "Akutsu T."
                    },
                    {
                        "name": "Smith A.I."
                    },
                    {
                        "name": "Ge Z."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Lithgow T."
                    },
                    {
                        "name": "Song J."
                    }
                ],
                "citationCount": 5,
                "date": "2020-02-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "PeNGaRoo, a combined gradient boosting and ensemble learning framework for predicting non-classical secreted proteins"
            },
            "pmid": "31393553"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein sites, features and motifs",
            "uri": "http://edamontology.org/topic_3510"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ]
}