{
    "additionDate": "2023-08-30T07:09:33.335720Z",
    "biotoolsCURIE": "biotools:mols_2.0",
    "biotoolsID": "mols_2.0",
    "description": "MOLS 2.0 is a free and open-source software package for Peptide Modeling and Protein-Ligand Induced-Fit Docking developed in Prof. N. Gautham's Lab at the Centre of Advanced Study in Crystallography and Biophysics, University of Madras, Tamil Nadu, India.",
    "download": [
        {
            "type": "Downloads page",
            "url": "https://sourceforge.net/projects/mols2-0/files/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://sourceforge.net/projects/mols2-0/",
    "lastUpdate": "2023-08-30T07:15:47.695715Z",
    "name": "MOLS 2.0",
    "owner": "sampaul",
    "publication": [
        {
            "doi": "10.1007/s00894-016-3106-x",
            "metadata": {
                "abstract": "We previously developed an algorithm to perform conformational searches of proteins and peptides, and to perform the docking of ligands to protein receptors. In order to identify optimal conformations and docked poses, this algorithm uses mutually orthogonal Latin squares (MOLS) to rationally sample the vast conformational (or docking) space, and then analyzes this relatively small sample using a variant of mean field theory. The conformational search part of the algorithm was denoted MOLS 1.0. The docking portion of the algorithm, which allows only “flexible ligand/rigid receptor” docking, was denoted MOLSDOCK. Both are FORTRAN-based command-line-only molecular docking computer programs, though a GUI was developed later for MOLS 1.0. Both the conformational search and the rigid receptor docking parts of the algorithm have been extensively validated. We have now further enhanced the capabilities of the program by incorporating “induced fit” side-chain receptor flexibility for docking peptide ligands. Benchmarking and extensive testing is now being carried out for the flexible receptor portion of the docking. Additionally, to make both the peptide conformational search and docking algorithms (the latter including both flexible ligand/rigid receptor and flexible ligand/flexible receptor techniques) more accessible to the research community, we have developed MOLS 2.0, which incorporates a new Java-based graphical user interface (GUI). Here, we give a detailed description of MOLS 2.0. The source code and binary for MOLS 2.0 are distributed free (under a GNU Lesser General Public License) to the scientific community. They are freely available for download at https://sourceforge.net/projects/mols2-0/files/.",
                "authors": [
                    {
                        "name": "Gautham N."
                    },
                    {
                        "name": "Paul D.S."
                    }
                ],
                "citationCount": 17,
                "date": "2016-10-01T00:00:00Z",
                "journal": "Journal of Molecular Modeling",
                "title": "MOLS 2.0: software package for peptide modeling and protein–ligand docking"
            },
            "pmid": "27638416",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1007/s00894-022-05413-3",
            "metadata": {
                "abstract": "iMOLSDOCK is an induced-fit docking algorithm that uses the mutually orthogonal Latin squares (MOLS) sampling technique. Here, we describe the updates made to iMOLSDOCK in order to increase receptor flexibility, improve the scoring system, and speed up calculation. With a dataset of 35 peptide-protein complexes, the PepSet benchmark dataset of 80 peptide-protein complexes, and the Astex Diverse set, which uses nonpeptide small molecules as ligands, iMOLSDOCK has been benchmarked and validated. Flexible residues are now able to deviate from the starting position by a maximum of 3.0 Å due to the increased receptor flexibility. The ranking effectiveness of iMOLSDOCK has increased by 24% once the scoring system was improved. Additionally, iMOLSDOCK has been compared to Gold v5.2.1, HPEPDOCK, AutoDock CrankPep v1.0, AutoDock Vina, HADDOCK, PatchDock, and RosettaLigand. For induced-fit peptide-protein docking, iMOLSDOCK achieved success rates of 6%, 37%, and 89% at the top 1, 10, and 100 levels. At the top 1, 10, and 100 levels, iMOLSDOCK had success rates for small molecule-protein docking of 14%, 31%, and 49%. The computation time for peptide docking was lowered by two orders of magnitude, and for nonpeptide small molecule docking, it was roughly 14 times faster due to code optimization in the iMOLSDOCK docking tool. Source code and binary of iMOLSDOCK could be obtained from https://sourceforge.net/projects/mols2-0/files/.",
                "authors": [
                    {
                        "name": "Karthe P."
                    },
                    {
                        "name": "Paul D.S."
                    }
                ],
                "citationCount": 1,
                "date": "2023-01-01T00:00:00Z",
                "journal": "Journal of Molecular Modeling",
                "title": "Improved docking of peptides and small molecules in iMOLSDOCK"
            },
            "pmid": "36536252",
            "type": [
                "Benchmarking study"
            ]
        },
        {
            "doi": "10.1007/s10822-018-0152-8",
            "metadata": {
                "abstract": "We have earlier reported the iMOLSDOCK technique to perform ‘induced-fit’ peptide–protein docking. iMOLSDOCK uses the mutually orthogonal Latin squares (MOLSs) technique to sample the conformation and the docking pose of the small molecule ligand and also the flexible residues of the receptor protein, and arrive at the optimum pose and conformation. In this paper we report the extension carried out in iMOLSDOCK to dock nonpeptide small molecule ligands to receptor proteins. We have benchmarked and validated iMOLSDOCK with a dataset of 34 protein–ligand complexes as well as with Astex Diverse dataset, with nonpeptide small molecules as ligands. We have also compared iMOLSDOCK with other flexible receptor docking tools GOLD v5.2.1 and AutoDock Vina. The results obtained show that the method works better than these two algorithms, though it consumes more computer time. The source code and binary of MOLS 2.0 (under a GNU Lesser General Public License) are freely available for download at https://sourceforge.net/projects/mols2-0/files/.",
                "authors": [
                    {
                        "name": "Gautham N."
                    },
                    {
                        "name": "Sam Paul D."
                    }
                ],
                "citationCount": 3,
                "date": "2018-09-01T00:00:00Z",
                "journal": "Journal of Computer-Aided Molecular Design",
                "title": "Protein–small molecule docking with receptor flexibility in iMOLSDOCK"
            },
            "pmid": "30128925",
            "type": [
                "Benchmarking study"
            ]
        },
        {
            "doi": "10.1016/j.jmgm.2017.03.008",
            "metadata": {
                "abstract": "We have earlier reported the MOLSDOCK technique to perform rigid receptor/flexible ligand docking. The method uses the MOLS method, developed in our laboratory. In this paper we report iMOLSDOCK, the ‘flexible receptor’ extension we have carried out to the algorithm MOLSDOCK. iMOLSDOCK uses mutually orthogonal Latin squares (MOLS) to sample the conformation and the docking pose of the ligand and also the flexible residues of the receptor protein. The method then uses a variant of the mean field technique to analyze the sample to arrive at the optimum. We have benchmarked and validated iMOLSDOCK with a dataset of 44 peptide-protein complexes with peptides. We have also compared iMOLSDOCK with other flexible receptor docking tools GOLD v5.2.1 and AutoDock Vina. The results obtained show that the method works better than these two algorithms, though it consumes more computer time.",
                "authors": [
                    {
                        "name": "Gautham N."
                    },
                    {
                        "name": "Paul D.S."
                    }
                ],
                "citationCount": 5,
                "date": "2017-06-01T00:00:00Z",
                "journal": "Journal of Molecular Graphics and Modelling",
                "title": "iMOLSDOCK: Induced-fit docking using mutually orthogonal Latin squares (MOLS)"
            },
            "pmid": "28365533",
            "type": [
                "Method"
            ]
        }
    ]
}
