{
    "additionDate": "2019-11-14T19:54:43Z",
    "biotoolsCURIE": "biotools:cLoops",
    "biotoolsID": "cLoops",
    "confidence_flag": "tool",
    "description": "Accurate loop calling for 3D genomic data with cLoops | Accurate and flexible loops calling tool for 3D genomic data | cLoops: loop-calling for ChIA-PET, Hi-C, HiChIP and Trac-looping | Chromosome conformation capture (3C) derived high-throughput sequencing methods such as ChIA-PET,HiChIP and Hi-C provide genome-wide view of chromatin organization. Fine scale loops formed by interactions of regulatory elements spanning hundreds kilobases can be detected from these data. Here we introduce cLoops ('see loops'),a common loops calling tool for ChIA-PET, HiChIP and high-resolution Hi-C data. Paired-end tags (PETs) are first classified as self-ligation and inter-ligation clusters using an optimized unsupervisied clustering algorithm. The significances of the inter-ligation clusters are then estimated using permutated local background",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://yaqiangcao.github.io/cLoops/"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "homepage": "https://github.com/YaqiangCao/cLoops",
    "lastUpdate": "2020-12-16T15:01:56Z",
    "license": "MIT",
    "name": "cLoops",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ651",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: Sequencing-based 3D genome mapping technologies can identify loops formed by interactions between regulatory elements hundreds of kilobases apart. Existing loop-calling tools are mostly restricted to a single data type, with accuracy dependent on a predefined resolution contact matrix or called peaks, and can have prohibitive hardware costs. Results: Here, we introduce cLoops ('see loops') to address these limitations. cLoops is based on the clustering algorithm cDBSCAN that directly analyzes the paired-end tags (PETs) to find candidate loops and uses a permuted local background to estimate statistical significance. These two data-type-independent processes enable loops to be reliably identified for both sharp and broad peak data, including but not limited to ChIA-PET, Hi-C, HiChIP and Trac-looping data. Loops identified by cLoops showed much less distance-dependent bias and higher enrichment relative to local regions than existing tools. Altogether, cLoops improves accuracy of detecting of 3D-genomic loops from sequencing data, is versatile, flexible, efficient, and has modest hardware requirements.",
                "authors": [
                    {
                        "name": "Ai D."
                    },
                    {
                        "name": "Cao Y."
                    },
                    {
                        "name": "Chen G."
                    },
                    {
                        "name": "Chen X."
                    },
                    {
                        "name": "Chen Z."
                    },
                    {
                        "name": "Guo X."
                    },
                    {
                        "name": "Han J.-D.J."
                    },
                    {
                        "name": "Huang Y."
                    },
                    {
                        "name": "McDermott J."
                    }
                ],
                "citationCount": 11,
                "date": "2020-02-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Accurate loop calling for 3D genomic data with cLoops"
            },
            "pmid": "31504161"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
