{
    "accessibility": "Open access",
    "additionDate": "2024-03-22T16:24:37.911254Z",
    "biotoolsCURIE": "biotools:ms2quant",
    "biotoolsID": "ms2quant",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "anneli.kruve@su.se",
            "name": "Anneli Kruve",
            "orcidid": "https://orcid.org/0000-0001-9725-3351",
            "typeEntity": "Person"
        },
        {
            "name": "Xiaoming Zhong",
            "typeEntity": "Person"
        }
    ],
    "description": "MS2Quant for concentration estimations of chemicals detected with nontarget LC-HRMS from MS2 data.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Spectrum calculation",
                    "uri": "http://edamontology.org/operation_3860"
                }
            ]
        }
    ],
    "homepage": "https://github.com/kruvelab/MS2Quant",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T14:06:57.688857Z",
    "name": "MS2Quant",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/acs.analchem.3c01744",
            "metadata": {
                "abstract": "Nontarget analysis by liquid chromatography-high-resolution mass spectrometry (LC-HRMS) is now widely used to detect pollutants in the environment. Shifting away from targeted methods has led to detection of previously unseen chemicals, and assessing the risk posed by these newly detected chemicals is an important challenge. Assessing exposure and toxicity of chemicals detected with nontarget HRMS is highly dependent on the knowledge of the structure of the chemical. However, the majority of features detected in nontarget screening remain unidentified and therefore the risk assessment with conventional tools is hampered. Here, we developed MS2Quant, a machine learning model that enables prediction of concentration from fragmentation (MS2) spectra of detected, but unidentified chemicals. MS2Quant is an xgbTree algorithm-based regression model developed using ionization efficiency data for 1191 unique chemicals that spans 8 orders of magnitude. The ionization efficiency values are predicted from structural fingerprints that can be computed from the SMILES notation of the identified chemicals or from MS2 spectra of unidentified chemicals using SIRIUS+CSI:FingerID software. The root mean square errors of the training and test sets were 0.55 (3.5×) and 0.80 (6.3×) log-units, respectively. In comparison, ionization efficiency prediction approaches that depend on assigning an unequivocal structure typically yield errors from 2× to 6×. The MS2Quant quantification model was validated on a set of 39 environmental pollutants and resulted in a mean prediction error of 7.4×, a geometric mean of 4.5×, and a median of 4.0×. For comparison, a model based on PaDEL descriptors that depends on unequivocal structural assignment was developed using the same dataset. The latter approach yielded a comparable mean prediction error of 9.5×, a geometric mean of 5.6×, and a median of 5.2× on the validation set chemicals when the top structural assignment was used as input. This confirms that MS2Quant enables to extract exposure information for unidentified chemicals which, although detected, have thus far been disregarded due to lack of accurate tools for quantification. The MS2Quant model is available as an R-package in GitHub for improving discovery and monitoring of potentially hazardous environmental pollutants with nontarget screening.",
                "authors": [
                    {
                        "name": "Breitholtz M."
                    },
                    {
                        "name": "Kruve A."
                    },
                    {
                        "name": "MacLeod M."
                    },
                    {
                        "name": "Malm L."
                    },
                    {
                        "name": "Martin J."
                    },
                    {
                        "name": "Peets P."
                    },
                    {
                        "name": "Sepman H."
                    }
                ],
                "citationCount": 14,
                "date": "2023-08-22T00:00:00Z",
                "journal": "Analytical Chemistry",
                "title": "Bypassing the Identification: MS2Quant for Concentration Estimations of Chemicals Detected with Nontarget LC-HRMS from MS2 Data"
            },
            "pmcid": "PMC10448440",
            "pmid": "37548594"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
