{
    "name": "Gk arrays", 
    "description": "Gk-arrays are a data structure to index the k-mers in a collection of reads.", 
    "homepage": "http://www.atgc-montpellier.fr/gkarrays", 
    "biotoolsID": "gk_arrays", 
    "biotoolsCURIE": "biotools:gk_arrays", 
    "version": [], 
    "otherID": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3195", 
                    "term": "Sequencing error detection"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0310", 
                    "term": "Sequence assembly"
                }, 
                {
                    "uri": "http://edamontology.org/operation_3198", 
                    "term": "Read mapping"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Library"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0622", 
            "term": "Genomics"
        }, 
        {
            "uri": "http://edamontology.org/topic_3308", 
            "term": "Transcriptomics"
        }, 
        {
            "uri": "http://edamontology.org/topic_3174", 
            "term": "Metagenomics"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "C++"
    ], 
    "license": "CECILL-2.0", 
    "collectionID": [], 
    "maturity": "Mature", 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "http://www.atgc-montpellier.fr/gkarrays/usersguide.php", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "21682852", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Querying large read collections in main memory: A versatile data structure", 
                "abstract": "Background: High Throughput Sequencing (HTS) is now heavily exploited for genome (re-) sequencing, metagenomics, epigenomics, and transcriptomics and requires different, but computer intensive bioinformatic analyses. When a reference genome is available, mapping reads on it is the first step of this analysis. Read mapping programs owe their efficiency to the use of involved genome indexing data structures, like the Burrows-Wheeler transform. Recent solutions index both the genome, and the k-mers of the reads using hash-tables to further increase efficiency and accuracy. In various contexts (e.g. assembly or transcriptome analysis), read processing requires to determine the sub-collection of reads that are related to a given sequence, which is done by searching for some k-mers in the reads. Currently, many developments have focused on genome indexing structures for read mapping, but the question of read indexing remains broadly unexplored. However, the increase in sequence throughput urges for new algorithmic solutions to query large read collections efficiently.Results: Here, we present a solution, named Gk arrays, to index large collections of reads, an algorithm to build the structure, and procedures to query it. Once constructed, the index structure is kept in main memory and is repeatedly accessed to answer queries like \"given a k-mer, get the reads containing this k-mer (once/at least once)\". We compared our structure to other solutions that adapt uncompressed indexing structures designed for long texts and show that it processes queries fast, while requiring much less memory. Our structure can thus handle larger read collections. We provide examples where such queries are adapted to different types of read analysis (SNP detection, assembly, RNA-Seq).Conclusions: Gk arrays constitute a versatile data structure that enables fast and more accurate read analysis in various contexts. The Gk arrays provide a flexible brick to design innovative programs that mine efficiently genomics, epigenomics, metagenomics, or transcriptomics reads. The Gk arrays library is available under Cecill (GPL compliant) license from http://www.atgc-montpellier.fr/ngs/. © 2011 Philippe et al; licensee BioMed Central Ltd.", 
                "date": "2011-06-17T00:00:00Z", 
                "citationCount": 8, 
                "authors": [
                    {
                        "name": "Philippe N."
                    }, 
                    {
                        "name": "Salson M."
                    }, 
                    {
                        "name": "Lecroq T."
                    }, 
                    {
                        "name": "Leonard M."
                    }, 
                    {
                        "name": "Commes T."
                    }, 
                    {
                        "name": "Rivals E."
                    }
                ], 
                "journal": "BMC Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": "Vincent Lefort", 
            "email": "Vincent.Lefort@lirmm.fr", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "seqwiki_import", 
    "additionDate": "2017-01-13T13:14:55Z", 
    "lastUpdate": "2018-12-10T12:58:54Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0
}