{
    "additionDate": "2021-10-18T10:43:56.605054Z",
    "biotoolsCURIE": "biotools:arothron",
    "biotoolsID": "arothron",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "antonio.profico@york.ac.uk",
            "name": "Profico Antonio",
            "typeEntity": "Person"
        }
    ],
    "description": "An R package for geometric morphometric methods and virtual anthropology applications.",
    "download": [
        {
            "type": "Downloads page",
            "url": "https://zenodo.org/record/4114233"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=34117635",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-10-18T10:43:56.608041Z",
    "license": "CC-BY-4.0",
    "name": "Arothron",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1002/AJPA.24340",
            "metadata": {
                "abstract": "© 2021 The Authors. American Journal of Physical Anthropology published by Wiley Periodicals LLC.Objectives: The statistical analysis of fossil remains is essential to understand the evolution of the genus Homo. Unfortunately, the human fossil record is straight away scarce and plagued with severe loss of information caused by taphonomic processes. The recently developed field of Virtual Anthropology helps to ameliorate this situation by using digital techniques to restore damaged and incomplete fossils. Materials and methods: We present the package Arothron, an R software suite meant to process and analyze digital models of skeletal elements. Arothron includes tools to digitally extract virtual cavities such as cranial endocasts, to statistically align disarticulated or broken bony elements, and to visualize local variations between surface meshes and landmark configurations. Results: We describe the main functionalities of Arothron and illustrate their usage through reproducible case studies. We describe a tool for segmentation of skeletal cavities by showing its application on a malleus bone, a Neanderthal tooth, and a modern human cranium, reproducing their shape and calculating their volume. We illustrate how to digitally align a disarticulated model of a modern human cranium, and how to combine piecemeal shape information on individual specimens into one. In addition, we present useful visualization tools by comparing the morphological differences between the right hemisphere of the Neanderthal and the modern human brain. Conclusions: The Arothron R package is designed to study digital models of fossil specimens. By using Arothron, scientists can handle digital models with ease, investigate the inner morphology of 3D skeletal models, gain a full representation of the original shapes of damaged specimens, and compare shapes across specimens.",
                "authors": [
                    {
                        "name": "Buzi C."
                    },
                    {
                        "name": "Castiglione S."
                    },
                    {
                        "name": "Melchionna M."
                    },
                    {
                        "name": "Piras P."
                    },
                    {
                        "name": "Profico A."
                    },
                    {
                        "name": "Raia P."
                    },
                    {
                        "name": "Veneziano A."
                    }
                ],
                "citationCount": 4,
                "date": "2021-09-01T00:00:00Z",
                "journal": "American Journal of Physical Anthropology",
                "title": "Arothron: An R package for geometric morphometric methods and virtual anthropology applications"
            },
            "pmid": "34117635"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
