{
    "additionDate": "2017-02-14T09:34:56Z",
    "biotoolsCURIE": "biotools:nmr_constraints_analyser",
    "biotoolsID": "nmr_constraints_analyser",
    "credit": [
        {
            "email": "alejandro.giorgetti@univr.it",
            "name": "Alejandro Giorgetti",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "NMR Constraints Analyser is a web tool that provides an automatic graphical analysis of the NMR experimental constraints atom by atom.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://molsim.sci.univr.it/~davide/example/tutorial.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "http://molsim.sci.univr.it/bioinfo/tools/constraint/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "NMR Constraints Analyser",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Nuclear magnetic resonance (NMR) spectroscopy together with X-ray crystallography, are the main techniques used for the determination of highresolution 3D structures of biological molecules. The output of an NMR experiment includes a set of lower and upper limits for the distances (constraints) between pairs of atoms. If the number of constraints is high enough, there will be a finite number of possible conformations (models) of the macromolecule satisfying the data. Thus, the more constraints are measured, the better defined these structures will be. The availability of a user-friendly tool able to help in the analysis and interpretation of the number of experimental constraints per residue, is thus of valuable importance when assessing the levels of structure definition of NMR solved biological macromolecules, in particular, when high-quality structures are needed in techniques such as, computational biology approaches, site-directed mutagenesis experiments and/or drug design. Here, we present a free publicly available web-server, i.e. NMR Constraints Analyser, which is aimed at providing an automatic graphical analysis of the NMR experimental constraints atom by atom. The NMR Constraints Analyser server is available from the web-page http://molsim.sci.univr.it/constraint. © The Author(s) 2010. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Giorgetti A."
                    },
                    {
                        "name": "Heller D.M."
                    }
                ],
                "citationCount": 7,
                "date": "2010-05-31T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "NMR constraints analyser: A web-server for the graphical analysis of NMR experimental constraints"
            },
            "pmid": "20513646"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        }
    ],
    "validated": 1
}
