{"credit":[{"email":"m.barenco@ucl.ac.uk","name":"Martino Barenco","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"url":"http://bioconductor.org/packages/release/bioc/html/rHVDM.html"}],"download":[{"type":"Source code","url":"http://bioconductor/packages/release/bioc/src/contrib/rHVDM_1.40.0.tar.gz"}],"function":[{"operation":[{"term":"Gene expression analysis","uri":"http://edamontology.org/operation_2495"}]}],"labels":{"collectionID":["BioConductor"],"language":["R"],"license":"GPL-2.0","operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool","Library"],"topic":[{"term":"Transcription factors and regulatory sites","uri":"http://edamontology.org/topic_0749"},{"term":"Microarray experiment","uri":"http://edamontology.org/topic_3518"}]},"publication":[{"abstract":"Highly parallel genomic platforms like microarrays often present researchers with long lists of differentially expressed genes but contain little or no information on how these genes are regulated. rHVDM is a novel R package which uses gene expression time course data to predict the activity and targets of a transcription factor. In the first step, rHVDM uses a small number of known targets to derive the activity profile of a given transcription factor. Then, in a subsequent step, this activity profile is used to predict other putative targets of that transcription factor. A dynamic and mechanistic model of gene expression is at the heart of the technique. Measurement error is taken into account during the process, which allows an objective assessment of the robustness of fit and, therefore, the quality of the predictions. The package relies on efficient algorithms and vectorization to accomplish potentially time consuming tasks including optimization and differential equation integration. We demonstrate the efficiency and accuracy of rHVDM by examining the activity of the tumour-suppressing transcription factor, p53. © The Author 2008. Published by Oxford University Press. All rights reserved.","authors":["Barenco M.","Papouli E.","Shah S.","Brewer D.","Miller C.J.","Hubank M."],"cit_count":4,"doi":"10.1093/bioinformatics/btn639","journal":"Bioinformatics","title":"rHVDM: An R package to predict the activity and targets of a transcription factor","type":"Primary","year":"2009-02-11"}],"summary":{"biotoolsCURIE":"biotools:rhvdm","biotoolsID":"rhvdm","description":"An R implementation of HVDM (Hidden Variable Dynamic Modeling).","homepage":"http://bioconductor.org/packages/release/bioc/html/rHVDM.html","name":"rHVDM","version":["1.40.0"]}}