{
    "accessibility": "Open access",
    "additionDate": "2022-08-29T12:14:03.145184Z",
    "biotoolsCURIE": "biotools:dflpred",
    "biotoolsID": "dflpred",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "lkurgan@vcu.edu",
            "name": "Lukasz Kurgan"
        }
    ],
    "description": "DFLpred webserver is designed for the prediction of disordered flexible linker (DFL). The server generates numeric score for each residue in the input protein sequence that quantifies putative propensity to form a DFL.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://fanchi.github.io/DFLpred/"
        }
    ],
    "editPermission": {
        "authors": [
            "damiano.piovesan",
            "tlazar"
        ],
        "type": "group"
    },
    "homepage": "http://biomine.cs.vcu.edu/servers/DFLpred/",
    "language": [
        "C",
        "Java"
    ],
    "lastUpdate": "2022-08-29T12:21:19.041509Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/fanchi/DFLpred"
        }
    ],
    "name": "DFLpred",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "daniela.mereuta",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btw280",
            "metadata": {
                "abstract": "© 2016 The Author 2016. Published by Oxford University Press.Motivation: Disordered flexible linkers (DFLs) are disordered regions that serve as flexible linkers/spacers in multi-domain proteins or between structured constituents in domains. They are different from flexible linkers/residues because they are disordered and longer. Availability of experimentally annotated DFLs provides an opportunity to build high-throughput computational predictors of these regions from protein sequences. To date, there are no computational methods that directly predict DFLs and they can be found only indirectly by filtering predicted flexible residues with predictions of disorder. Results: We conceptualized, developed and empirically assessed a first-of-its-kind sequence-based predictor of DFLs, DFLpred. This method outputs propensity to form DFLs for each residue in the input sequence. DFLpred uses a small set of empirically selected features that quantify propensities to form certain secondary structures, disordered regions and structured regions, which are processed by a fast linear model. Our high-throughput predictor can be used on the whole-proteome scale; it needs <1 h to predict entire proteome on a single CPU. When assessed on an independent test dataset with low sequence-identity proteins, it secures area under the receiver operating characteristic curve equal 0.715 and outperforms existing alternatives that include methods for the prediction of flexible linkers, flexible residues, intrinsically disordered residues and various combinations of these methods. Prediction on the complete human proteome reveals that about 10% of proteins have a large content of over 30% DFL residues. We also estimate that about 6000 DFL regions are long with ≥30 consecutive residues.",
                "authors": [
                    {
                        "name": "Kurgan L."
                    },
                    {
                        "name": "Meng F."
                    }
                ],
                "citationCount": 40,
                "date": "2016-06-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "DFLpred: High-throughput prediction of disordered flexible linker regions in protein sequences"
            },
            "pmcid": "PMC4908364",
            "pmid": "2730763",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application"
    ]
}
