{
    "additionDate": "2021-10-04T11:55:15.595858Z",
    "biotoolsCURIE": "biotools:lipidsig",
    "biotoolsID": "lipidsig",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "cwc0702@gmail.com",
            "name": "Wei-Chung Cheng",
            "orcidid": "https://orcid.org/0000-0002-1229-4857",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "LipidSig is a web-based tool for lipidomic data analysis. LipidSig is the first web-based platform which integrates a comprehensive analysis for streamlined data mining of lipidomic datasets. The user-friendly interface provides five main functions, namely Profiling, Differential expression, Machine learning, Correlation and Network, for assessment of lipid effects on biological mechanisms. The five functions provide unique aspects to analyze the lipidome profiling data based on different characteristics including lipid class, chain length, unsaturation, hydroxyl group, and fatty acid composition.', In summary, LipidSig enables users to perform intensive lipid analysis and create interactive plots with downloadable images and corresponding tables.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "homepage": "http://chenglab.cmu.edu.tw/lipidsig",
    "lastUpdate": "2021-10-04T11:55:15.598127Z",
    "name": "LipidSig",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAB419",
            "metadata": {
                "abstract": "© 2021 The Author(s) 2021. Published by Oxford University Press on behalf of Nucleic Acids Research.With the continuing rise of lipidomic studies, there is an urgent need for a useful and comprehensive tool to facilitate lipidomic data analysis. The most important features making lipids different from general metabolites are their various characteristics, including their lipid classes, double bonds, chain lengths, etc. Based on these characteristics, lipid species can be classified into different categories and, more interestingly, exert specific biological functions in a group. In an effort to simplify lipidomic analysis workflows and enhance the exploration of lipid characteristics, we have developed a highly flexible and user-friendly web server called LipidSig. It consists of five sections, namely, Profiling, Differential Expression, Correlation, Network and Machine Learning, and evaluates lipid effects on cellular or disease phenotypes. One of the specialties of LipidSig is the conversion between lipid species and characteristics according to a user-defined characteristics table. This function allows for efficient data mining for both individual lipids and subgroups of characteristics. To expand the server's practical utility, we also provide analyses focusing on fatty acid properties and multiple characteristics. In summary, LipidSig is expected to help users identify significant lipid-related features and to advance the field of lipid biology. The LipidSig webserver is freely available at http://chenglab.cmu.edu.tw/lipidsig.",
                "authors": [
                    {
                        "name": "Chen F.-H."
                    },
                    {
                        "name": "Cheng W.-C."
                    },
                    {
                        "name": "Cho Y.-C."
                    },
                    {
                        "name": "Hsu M.-K."
                    },
                    {
                        "name": "Lin I.-C."
                    },
                    {
                        "name": "Lin W.-J."
                    },
                    {
                        "name": "Liu H.-C."
                    },
                    {
                        "name": "Ma W.-L."
                    },
                    {
                        "name": "Shen P.-C."
                    },
                    {
                        "name": "Yang J.-C."
                    }
                ],
                "date": "2021-07-02T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "LipidSig: A web-based tool for lipidomic data analysis"
            },
            "pmid": "34048582",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Lipids",
            "uri": "http://edamontology.org/topic_0153"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
