{
    "accessibility": "Open access",
    "additionDate": "2020-12-04T16:15:30.056708",
    "biotoolsCURIE": "biotools:methylclock",
    "biotoolsID": "methylclock",
    "cost": "Free of charge",
    "description": "Estimate chronological and gestational DNA methylation (DNAm) age as well as biological age using different methylation clocks",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/isglobal-brge/methylclock/tree/master/vignettes"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "elixirNode": [
        "Spain"
    ],
    "elixirPlatform": [
        "Tools"
    ],
    "homepage": "https://github.com/isglobal-brge/methylclock",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-04T16:15:30.058079Z",
    "license": "MIT",
    "maturity": "Mature",
    "name": "methylclock",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "brgelab",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2020, The Author(s).Background: Accurate protocols and methods to robustly detect the mosaic loss of chromosome Y (mLOY) are needed given its reported role in cancer, several age-related disorders and overall male mortality. Intensity SNP-array data have been used to infer mLOY status and to determine its prominent role in male disease. However, discrepancies of reported findings can be due to the uncertainty and variability of the methods used for mLOY detection and to the differences in the tissue-matrix used. Results: We created a publicly available software tool called MADloy (Mosaic Alteration Detection for LOY) that incorporates existing methods and includes a new robust approach, allowing efficient calling in large studies and comparisons between methods. MADloy optimizes mLOY calling by correctly modeling the underlying reference population with no-mLOY status and incorporating B-deviation information. We observed improvements in the calling accuracy to previous methods, using experimentally validated samples, and an increment in the statistical power to detect associations with disease and mortality, using simulation studies and real dataset analyses. To understand discrepancies in mLOY detection across different tissues, we applied MADloy to detect the increment of mLOY cellularity in blood on 18 individuals after 3 years and to confirm that its detection in saliva was sub-optimal (41%). We additionally applied MADloy to detect the down-regulation genes in the chromosome Y in kidney and bladder tumors with mLOY, and to perform pathway analyses for the detection of mLOY in blood. Conclusions: MADloy is a new software tool implemented in R for the easy and robust calling of mLOY status across different tissues aimed to facilitate its study in large epidemiological studies.",
                "authors": [
                    {
                        "name": "Gonzalez J.R."
                    },
                    {
                        "name": "Lopez-Sanchez M."
                    },
                    {
                        "name": "Caceres A."
                    },
                    {
                        "name": "Puig P."
                    },
                    {
                        "name": "Esko T."
                    },
                    {
                        "name": "Perez-Jurado L.A."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "MADloy: robust detection of mosaic loss of chromosome Y from genotype-array-intensity data"
            },
            "pmid": "33225898"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "version": [
        "V0.0.9"
    ]
}