{
    "additionDate": "2019-11-14T18:07:22Z",
    "biotoolsCURIE": "biotools:NBGLM-LBC",
    "biotoolsID": "NBGLM-LBC",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "shintaro.katayama@ki.se",
            "name": "Shintaro Katayama",
            "orcidid": "https://orcid.org/0000-0001-7581-5157",
            "typeEntity": "Person"
        }
    ],
    "description": "> COMMON LINK WITH (PUB. & NAME DIFFERENT) bio.tools/TRITEX (BITBUCKET.IO) | Guide for library design and bias correction for large-scale transcriptome studies using highly multiplexed RNAseq methods | Library bias correction for multiplex RNAseq | Library bias correction for multiplex RNAseq. GitHub Gist: instantly share code, notes, and snippets | Instantly share code, notes, and snippets | You can’t perform that action at this time | You signed in with another tab or window. Reload to refresh your session. You signed out in another tab or window. Reload to refresh your session",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Transcriptome assembly",
                    "uri": "http://edamontology.org/operation_3258"
                },
                {
                    "term": "Community profiling",
                    "uri": "http://edamontology.org/operation_3200"
                },
                {
                    "term": "Weighted correlation network analysis",
                    "uri": "http://edamontology.org/operation_3766"
                }
            ]
        }
    ],
    "homepage": "https://shka.github.io/NBGLM-LBC",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-11-14T18:07:22Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://shka.bitbucket.io/NBGLM-LBC"
        }
    ],
    "name": "NBGLM-LBC",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3017-9",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Standard RNAseq methods using bulk RNA and recent single-cell RNAseq methods use DNA barcodes to identify samples and cells, and the barcoded cDNAs are pooled into a library pool before high throughput sequencing. In cases of single-cell and low-input RNAseq methods, the library is further amplified by PCR after the pooling. Preparation of hundreds or more samples for a large study often requires multiple library pools. However, sometimes correlation between expression profiles among the libraries is low and batch effect biases make integration of data between library pools difficult. Results: We investigated 166 technical replicates in 14 RNAseq libraries made using the STRT method. The patterns of the library biases differed by genes, and uneven library yields were associated with library biases. The former bias was corrected using the NBGLM-LBC algorithm, which we present in the current study. The latter bias could not be corrected directly, but could be solved by omitting libraries with particularly low yields. A simulation experiment suggested that the library bias correction using NBGLM-LBC requires a consistent sample layout. The NBGLM-LBC correction method was applied to an expression profile for a cohort study of childhood acute respiratory illness, and the library biases were resolved. Conclusions: The R source code for the library bias correction named NBGLM-LBC is available at https://shka.github.io/NBGLM-LBC and https://shka.bitbucket.io/NBGLM-LBC. This method is applicable to correct the library biases in various studies that use highly multiplexed sequencing-based profiling methods with a consistent sample layout with samples to be compared (e.g., \"cases\" and \"controls\") equally distributed in each library.",
                "authors": [
                    {
                        "name": "Katayama S."
                    },
                    {
                        "name": "Skoog T."
                    },
                    {
                        "name": "Soderhall C."
                    },
                    {
                        "name": "Einarsdottir E."
                    },
                    {
                        "name": "Krjutskov K."
                    },
                    {
                        "name": "Kere J."
                    }
                ],
                "citationCount": 3,
                "date": "2019-08-13T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Guide for library design and bias correction for large-scale transcriptome studies using highly multiplexed RNAseq methods"
            },
            "pmcid": "PMC6693229",
            "pmid": "31409293"
        }
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ]
}