{
    "additionDate": "2021-03-19T08:44:31Z",
    "biotoolsCURIE": "biotools:overcovid",
    "biotoolsID": "overcovid",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "biobai@zju.edu.cn",
            "name": "Youhuang Bai",
            "typeEntity": "Person"
        },
        {
            "email": "mchen@zju.edu.cn",
            "name": "Ming Chen",
            "orcidid": "https://orcid.org/0000-0002-9677-1699",
            "typeEntity": "Person"
        }
    ],
    "description": "Bioinformatics resources facilitate understanding and harnessing clinical research of SARS-CoV-2.\n\nThe COVID-19 pandemic, caused by the coronavirus SARS-CoV-2, has created an unprecedented threat to public health. The pandemic has been sweeping the globe, impacting more than 200 countries, with more outbreaks still lurking on the horizon. To tide over COVID-19, the web portal OverCOVID is provided to share bioinformatics resources and information that may contribute to research advances.\n\nVarious layers of interactions among the viruses and human hosts.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://bis.zju.edu.cn/overcovid/",
    "lastUpdate": "2021-03-26T13:49:08Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://bis.zju.edu.cn/overcovid/phylogenies"
        },
        {
            "type": [
                "Other"
            ],
            "url": "http://bis.zju.edu.cn/overcovid/interactions"
        },
        {
            "type": [
                "Other"
            ],
            "url": "http://bis.zju.edu.cn/overcovid/network.html"
        }
    ],
    "name": "OverCOVID",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAA416",
            "metadata": {
                "abstract": "© 2021 The Author(s) 2021. Published by Oxford University Press. All rights reserved.The coronavirus disease 2019 (COVID-19) pandemic, caused by the coronavirus severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2), has created an unprecedented threat to public health. The pandemic has been sweeping the globe, impacting more than 200 countries, with more outbreaks still lurking on the horizon. At the time of the writing, no approved drugs or vaccines are available to treat COVID-19 patients, prompting an urgent need to decipher mechanisms underlying the pathogenesis and develop curative treatments. To fight COVID-19, researchers around the world have provided specific tools and molecular information for SARS-CoV-2. These pieces of information can be integrated to aid computational investigations and facilitate clinical research. This paper reviews current knowledge, the current status of drug development and various resources for key steps toward effective treatment of COVID-19, including the phylogenetic characteristics, genomic conservation and interaction data. The final goal of this paper is to provide information that may be utilized in bioinformatics approaches and aid target prioritization and drug repurposing. Several SARS-CoV-2-related tools/databases were reviewed, and a web-portal named OverCOVID (http://bis.zju.edu.cn/overcovid/) is constructed to provide a detailed interpretation of SARS-CoV-2 basics and share a collection of resources that may contribute to therapeutic advances. These information could improve researchers' understanding of SARS-CoV-2 and help to accelerate the development of new antiviral treatments.",
                "authors": [
                    {
                        "name": "Ahsan A."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Feng C."
                    },
                    {
                        "name": "Zhou Y."
                    },
                    {
                        "name": "Ma G."
                    },
                    {
                        "name": "Bai Y."
                    },
                    {
                        "name": "Chen M."
                    }
                ],
                "date": "2021-03-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "Bioinformatics resources facilitate understanding and harnessing clinical research of SARS-CoV-2"
            },
            "pmcid": "PMC7929412",
            "pmid": "33432321"
        }
    ],
    "toolType": [
        "Bioinformatics portal"
    ],
    "topic": [
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Data submission, annotation and curation",
            "uri": "http://edamontology.org/topic_0219"
        }
    ]
}