{
    "additionDate": "2020-01-14T20:17:41Z",
    "biotoolsCURIE": "biotools:NetworkAnalyst_autogenerated",
    "biotoolsID": "NetworkAnalyst_autogenerated",
    "confidence_flag": "very low",
    "credit": [
        {
            "email": "ery_kangxw@lzu.edu.cn",
            "name": "Xuewen Kang",
            "typeEntity": "Person"
        },
        {
            "email": "wang_jing@lzu.edu.cn",
            "name": "Jing Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "Slow skeletal muscle troponin T, titin and myosin light chain 3 are candidate prognostic biomarkers for Ewing's sarcoma.\n\n-- a visual analytics platform for comprehensive gene expression profiling & meta-analysis.\n\nGene List InputGene Expression TableMultiple Gene Expression TablesRaw RNA-seq DataNetwork File.\n\nStarting from a list of gene IDs with optional expression values.\n\nZhou, G., Soufan, O., Ewald, J., Hancock, REW, Basu, N. and Xia, J. (2019) \"NetworkAnalyst 3.0: a visual analytics platform for comprehensive gene expression profiling and meta-analysis\" Nucleic Acids Research (doi:10.1093/nar/gkz240).\n\n||| NAME EQUAL TO (PUB. DIFFERENT) bio.tools/networkanalyst.\n\n||| COMMON LINK WITH (PUB. & NAME DIFFERENT) bio.tools/networkanalys (NETWORKANALYST.CA), bio.tools/networkanalyst (NETWORKANALYST.CA).\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'GSEA' (bio.tools/gsea), 'DEGs', 'TTN', 'troponin'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Expression data visualisation",
                    "uri": "http://edamontology.org/operation_0571"
                },
                {
                    "term": "RNA-Seq quantification",
                    "uri": "http://edamontology.org/operation_3800"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                }
            ]
        }
    ],
    "homepage": "http://www.networkanalyst.ca",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-01-14T20:17:41Z",
    "name": "NetworkAnalyst_autogenerated",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3892/OL.2019.11044",
            "metadata": {
                "abstract": "© 2019 Spandidos Publications. All rights reserved.Ewing's sarcoma (ES) is a common malignant bone tumor in children and adolescents. Although great efforts have been made to understand the pathogenesis and development of ES, the underlying molecular mechanism remains unclear. The present study aimed to identify new key genes as potential biomarkers for the diagnosis, targeted therapy or prognosis of ES. mRNA expression profile chip data sets GSE17674, GSE17679 and GSE45544 were downloaded from the Gene Expression Omnibus database. Differentially expressed genes (DEGs) were screened using the R software limma package, and functional and pathway enrichment analyses were performed using the enrichplot package and GSEA software. The NetworkAnalyst online tool, as well as Cytoscape and its plug-ins cytoHubba and NetworkAnalyzer, were used to construct a protein-protein interaction network (PPI) and conduct module analysis to screen key (hub) genes. LABSO COX regression and overall survival (OS) analysis of the Hub genes were performed. A total of 211 DEGs were obtained by integrating and analyzing the three data sets. The functions and pathways of the DEGs were mainly associated with the regulation of small-molecule metabolic processes, cofactor-binding, amino acid, proteasome and ribosome biosynthesis in eukaryotes, as well as the Rac1, cell cycle and P53 signaling pathways. A total of one important module and 20 hub genes were screened from the PPI network using the Maximum Correlation Criteria algorithm of cytoHubba. LASSO COX regression results revealed that titin (TTN), fast skeletal muscle troponin T, skeletal muscle actin α-actin, nebulin, troponin C type 2 (fast), myosin light-chain 3 (MYL3), slow skeletal muscle troponin T (TNNT1), myosin-binding protein C1 slow-type, tropomyosin 3 and myosin heavy-chain 7 were associated with prognosis in patients with ES. The Kaplan-Meier curves demonstrated that high mRNA expression levels of TNNT1 (P<0.001), TTN (P=0.049), titin-cap (P=0.04), tropomodulin 1 (P=0.011), troponin I2 fast skeletal type (P=0.021) and MYL3 (P=0.017) were associated with poor OS in patients with ES. In conclusion, the DEGs identified in the present study may be key genes in the pathogenesis of ES, three of which, namely TNNT1, TTN and MYL3, may be potential prognostic biomarkers for ES.",
                "authors": [
                    {
                        "name": "Deng Y."
                    },
                    {
                        "name": "Xie Q."
                    },
                    {
                        "name": "Zhang G."
                    },
                    {
                        "name": "Li S."
                    },
                    {
                        "name": "Wu Z."
                    },
                    {
                        "name": "Ma Z."
                    },
                    {
                        "name": "He X."
                    },
                    {
                        "name": "Gao Y."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Kang X."
                    },
                    {
                        "name": "Wang J."
                    }
                ],
                "citationCount": 2,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Oncology Letters",
                "title": "Slow skeletal muscle troponin T, titin and myosin light chain 3 are candidate prognostic biomarkers for Ewing's sarcoma"
            },
            "pmcid": "PMC6876326",
            "pmid": "31807166"
        }
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ]
}