{
    "additionDate": "2018-07-08T13:10:51Z",
    "biotoolsCURIE": "biotools:drep",
    "biotoolsID": "drep",
    "credit": [
        {
            "name": "Matt Olm",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/MrOlm"
        }
    ],
    "description": "Fast and accurate genomic comparisons that enables improved genome recovery from metagenomes through de-replication.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/MrOlm/drep"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome comparison",
                    "uri": "http://edamontology.org/operation_3209"
                }
            ]
        }
    ],
    "homepage": "https://github.com/MrOlm/drep",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "dRep",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1038/ismej.2017.126",
            "metadata": {
                "abstract": "© 2017 International Society for Microbial Ecology All rights reserved.The number of microbial genomes sequenced each year is expanding rapidly, in part due to genome-resolved metagenomic studies that routinely recover hundreds of draft-quality genomes. Rapid algorithms have been developed to comprehensively compare large genome sets, but they are not accurate with draft-quality genomes. Here we present dRep, a program that reduces the computational time for pairwise genome comparisons by sequentially applying a fast, inaccurate estimation of genome distance, and a slow, accurate measure of average nucleotide identity. dRep achieves a 28 × increase in speed with perfect recall and precision when benchmarked against previously developed algorithms. We demonstrate the use of dRep for genome recovery from time-series datasets. Each metagenome was assembled separately, and dRep was used to identify groups of essentially identical genomes and select the best genome from each replicate set. This resulted in recovery of significantly more and higher-quality genomes compared to the set recovered using co-assembly.",
                "authors": [
                    {
                        "name": "Olm M.R."
                    },
                    {
                        "name": "Brown C.T."
                    },
                    {
                        "name": "Brooks B."
                    },
                    {
                        "name": "Banfield J.F."
                    }
                ],
                "citationCount": 15,
                "date": "2017-12-01T00:00:00Z",
                "journal": "ISME Journal",
                "title": "DRep: A tool for fast and accurate genomic comparisons that enables improved genome recovery from metagenomes through de-replication"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}