{"collectionID": ["BioConductor"], "accessibility": [], "topic": [{"term": "Cell biology", "uri": "http://edamontology.org/topic_2229"}], "owner": "bioconductor_import", "cost": null, "relation": [], "download": [{"url": "http://bioconductor/packages/release/bioc/src/contrib/flowMap_1.12.0.tar.gz", "note": null, "version": null, "type": "Source code"}], "validated": 1, "publication": [{"doi": "10.1002/cyto.a.22735", "note": null, "version": null, "pmid": null, "type": "Primary", "pmcid": null, "metadata": {"title": "Mapping cell populations in flow cytometry data for cross-sample comparison using the Friedman-Rafsky test statistic as a distance measure", "abstract": "© 2016 International Society for Advancement of Cytometry.Flow cytometry (FCM) is a fluorescence-based single-cell experimental technology that is routinely applied in biomedical research for identifying cellular biomarkers of normal physiological responses and abnormal disease states. While many computational methods have been developed that focus on identifying cell populations in individual FCM samples, very few have addressed how the identified cell populations can be matched across samples for comparative analysis. This article presents FlowMap-FR, a novel method for cell population mapping across FCM samples. FlowMap-FR is based on the Friedman-Rafsky nonparametric test statistic (FR statistic), which quantifies the equivalence of multivariate distributions. As applied to FCM data by FlowMap-FR, the FR statistic objectively quantifies the similarity between cell populations based on the shapes, sizes, and positions of fluorescence data distributions in the multidimensional feature space. To test and evaluate the performance of FlowMap-FR, we simulated the kinds of biological and technical sample variations that are commonly observed in FCM data. The results show that FlowMap-FR is able to effectively identify equivalent cell populations between samples under scenarios of proportion differences and modest position shifts. As a statistical test, FlowMap-FR can be used to determine whether the expression of a cellular marker is statistically different between two cell populations, suggesting candidates for new cellular phenotypes by providing an objective statistical measure. In addition, FlowMap-FR can indicate situations in which inappropriate splitting or merging of cell populations has occurred during gating procedures. We compared the FR statistic with the symmetric version of Kullback-Leibler divergence measure used in a previous population matching method with both simulated and real data. The FR statistic outperforms the symmetric version of KL-distance in distinguishing equivalent from nonequivalent cell populations. FlowMap-FR was also employed as a distance metric to match cell populations delineated by manual gating across 30 FCM samples from a benchmark FlowCAP data set. An F-measure of 0.88 was obtained, indicating high precision and recall of the FR-based population matching results. FlowMap-FR has been implemented as a standalone R/Bioconductor package so that it can be easily incorporated into current FCM data analytical workflows.", "citationCount": 5, "authors": [{"name": "Hsiao C."}, {"name": "Liu M."}, {"name": "Stanton R."}, {"name": "Mcgee M."}, {"name": "Qian Y."}, {"name": "Scheuermann R.H."}], "date": "2016-01-01T00:00:00Z", "journal": "Cytometry Part A"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": "Chiaowen Joyce Hsiao", "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "joyce.hsiao1@gmail.com"}], "biotoolsCURIE": "biotools:flowmap", "elixirPlatform": [], "elixirNode": [], "version": ["1.12.0"], "elixir_badge": 0, "homepage": "http://bioconductor.org/packages/release/bioc/html/flowMap.html", "function": [{"note": null, "input": [], "operation": [{"term": "Spectral analysis", "uri": "http://edamontology.org/operation_3214"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:53Z", "otherID": [], "description": "Quantifies the similarity of cell populations across multiple flow cytometry samples using a nonparametric multivariate statistical test. The method is able to map cell populations of different size, shape, and proportion across multiple flow cytometry samples. The algorithm can be incorporate in any flow cytometry work flow that requires accurat quantification of similarity between cell populations.", "toolType": ["Command-line tool", "Library"], "editPermission": {"type": "private", "authors": []}, "language": ["R"], "link": [], "biotoolsID": "flowmap", "additionDate": "2017-01-17T15:03:02Z", "name": "flowMap", "license": "GPL-2.0", "documentation": [{"url": "http://bioconductor.org/packages/release/bioc/html/flowMap.html", "note": null, "type": "User manual"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux", "Windows", "Mac"]}