{
    "additionDate": "2020-06-30T11:51:56Z",
    "biotoolsCURIE": "biotools:BiomineExplorer",
    "biotoolsID": "BiomineExplorer",
    "collectionID": [
        "ELIXIR-SI"
    ],
    "credit": [
        {
            "email": "vid.podpecan@ijs.si",
            "name": "Vid Podpečan",
            "typeEntity": "Person",
            "typeRole": [
                "Developer",
                "Documentor",
                "Maintainer",
                "Primary contact",
                "Support"
            ]
        },
        {
            "name": "National Institute of Biology, Department of Biotechnology and Systems Biology",
            "typeEntity": "Institute"
        },
        {
            "name": "Hannu Toivonen",
            "typeEntity": "Person",
            "typeRole": [
                "Contributor"
            ]
        },
        {
            "name": "Jožef Stefan Institute, Department of Knowledge Technologies",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "name": "Kristina Gruden",
            "typeEntity": "Person",
            "typeRole": [
                "Contributor"
            ]
        },
        {
            "name": "Nada Lavrač",
            "typeEntity": "Person",
            "typeRole": [
                "Contributor"
            ]
        },
        {
            "name": "Živa Ramšak",
            "typeEntity": "Person",
            "typeRole": [
                "Contributor"
            ]
        }
    ],
    "description": "Biomine Explorer is a web application that enables interactive exploration of selected publicly available biological knowledge. It is based on the results of the Biomine project that develops methods for the analysis of public biological data sources (annotated sequences, proteins, domains, and orthology groups, genes and gene expressions, gene and protein interactions, scientific articles, and ontologies). All information is handled as networks and Biomine provides probabilistic network search algorithms to automatically extract the most relevant subnetworks.\n\nThe most prominent feature of Biomine Explorer is interactive exploration of its large probabilistic networks by using an interactive network visualisation interface. Network editing features and private network repositories are also available as well as a repository of publicly available graphs. All links to Biomine graphs are permanent so they can be used in scientific publications or published on the web.",
    "documentation": [
        {
            "type": [
                "Quick start guide"
            ],
            "url": "https://biomine.ijs.si/"
        }
    ],
    "editPermission": {
        "authors": [
            "zagor"
        ],
        "type": "group"
    },
    "elixirNode": [
        "Slovenia"
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://biomine.ijs.si/",
    "lastUpdate": "2020-07-22T17:16:00Z",
    "link": [
        {
            "type": [
                "Service"
            ],
            "url": "https://biomine.ijs.si/"
        }
    ],
    "name": "Biomine Explorer",
    "owner": "elixir.si",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btz509",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press.Summary: Biomine Explorer is a web application that enables interactive exploration of large heterogeneous biological networks constructed from selected publicly available biological knowledge sources. It is built on top of Biomine, a system which integrates cross-references from several biological databases into a large heterogeneous probabilistic network. Biomine Explorer offers user-friendly interfaces for search, visualization, exploration and manipulation as well as public and private storage of discovered subnetworks with permanent links suitable for inclusion into scientific publications. A JSON-based web API for network search queries is also available for advanced users.",
                "authors": [
                    {
                        "name": "Gruden K."
                    },
                    {
                        "name": "Lavrac N."
                    },
                    {
                        "name": "Podpecan V."
                    },
                    {
                        "name": "Ramsak Z."
                    },
                    {
                        "name": "Toivonen H."
                    }
                ],
                "date": "2019-12-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Interactive exploration of heterogeneous biological networks with Biomine Explorer"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ]
}
