{
    "additionDate": "2021-03-19T09:11:44Z",
    "biotoolsCURIE": "biotools:capl",
    "biotoolsID": "capl",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mguerrero@cheo.on.ca",
            "name": "Michelle D. Guerrero",
            "orcidid": "https://orcid.org/0000-0001-8169-5040",
            "typeEntity": "Person"
        }
    ],
    "description": "capl is an R package for use with data collected using the Canadian Assessment of Physical Literacy. The package contains functions that will calculate CAPL scores and interpretations from raw data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://www.github.com/barnzilla/capl",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-21T11:07:04Z",
    "name": "capl",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0243841",
            "metadata": {
                "abstract": "© 2021 Barnes, Guerrero. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.The Canadian Assessment of Physical Literacy (CAPL) is the first comprehensive protocol designed to assess a child's level of physical literacy. Current approaches to analyzing CAPL-2 raw data are tedious, inefficient, and/or can lead to computation errors. In this paper we introduce the capl R package (open source), designed to compute and visualize CAPL-2 scores and interpretations from raw data. The capl package takes advantage of the R environment to provide users with a fast, efficient, and reliable approach to analyzing their CAPL-2 raw data and a “quiet” user experience, whereby “noisy” error messages are suppressed via validation. We begin by discussing several preparatory steps that are required prior to using the capl package. These steps include preparing, formatting, and importing CAPL-2 raw data. We then use demo data to show that computing the CAPL-2 scores and interpretations is as simple as executing one line of code. This one line of code uses the main function in the capl package (get_capl()) to compute 40 variables within a matter of seconds. Next, we showcase the helper functions that are called within the main function to compute individual variables and scores for each test element within the four domains as well as an overall physical literacy score. Finally, we show how to visualize CAPL-2 results using the ggplot2 R package.",
                "authors": [
                    {
                        "name": "Barnes J.D."
                    },
                    {
                        "name": "Guerrero M.D."
                    }
                ],
                "date": "2021-02-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "An R package for Computing Canadian Assessment of Physical Literacy (CAPL) scores and interpretations from raw data"
            },
            "pmcid": "PMC7899353",
            "pmid": "33617576"
        }
    ],
    "topic": [
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        },
        {
            "term": "Data acquisition",
            "uri": "http://edamontology.org/topic_3077"
        },
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        }
    ]
}