{
    "additionDate": "2022-06-28T18:22:38.938641Z",
    "biotoolsCURIE": "biotools:m3cs",
    "biotoolsID": "m3cs",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "waffa.rashed@57357.org",
            "name": "Wafaa M Rashed",
            "orcidid": "https://orcid.org/0000-0001-7531-2840"
        },
        {
            "name": "Ahmed H Abdel-Razek"
        }
    ],
    "description": "MicroRNA childhood Cancer Catalog (M3Cs) is a high-quality curated collection of published miRNA research studies on 16 pediatric cancer diseases.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "homepage": "https://m3cs.shinyapps.io/M3Cs/",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-06-28T18:22:38.941204Z",
    "name": "M3Cs",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAAC013",
            "metadata": {
                "abstract": "© 2022 The Author(s) 2022. Published by Oxford University Press.MicroRNA childhood Cancer Catalog (M3Cs) is a high-quality curated collection of published miRNA research studies on 16 pediatric cancer diseases. M3Cs scope was based on two approaches: data-driven clinical significance and data-driven human pediatric cell line models. Based on the translational bioinformatics spectrum, the main objective of this study is to bring miRNA research into clinical significance in both pediatric cancer patient care and drug discovery toward health informatics in childhood cancer. M3Cs development passed through three phases: 1. Literature Mining: It includes external database search and screening. 2. Data processing that includes three steps: (a) Data Extraction, (b) Data Curation and annotation, (c) Web Development. 3. Publishing: Shinyapps.io was used as a web interface for the deployment of M3Cs. M3Cs is now available online and can be accessed through https://m3cs.shinyapps.io/M3Cs/. For data-driven clinical significance approach, 538 miRNAs from 268 publications were reported in the clinical domain while 7 miRNAs from 5 publications were reported in the clinical & drug domain. For data-driven human pediatric cell line models approach, 538 miRNAs from 1268 publications were reported in the cell line domain while 211 miRNAs from 177 publications in the cell line & drug domain. M3Cs acted to fill the gap by applying translational bioinformatics general pathway to transfer data-driven research toward data-driven clinical care and/or hypothesis generation. Aggregated and well-curated data of M3Cs will enable stakeholders in health care to incorporate miRNA in the clinical policy. Database URL:https://m3cs.shinyapps.io/M3Cs/",
                "authors": [
                    {
                        "name": "Abdel-Razek A.H."
                    },
                    {
                        "name": "Adel F."
                    },
                    {
                        "name": "Basiouny L."
                    },
                    {
                        "name": "Rashed W.M."
                    },
                    {
                        "name": "Rezk A.A."
                    },
                    {
                        "name": "Rezk M.A."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Database",
                "title": "MicroRNA childhood cancer catalog (M3Cs): A resource for translational bioinformatics toward health informatics in pediatric cancer"
            },
            "pmid": "35303059"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        }
    ]
}
