{
    "additionDate": "2020-09-03T18:56:45Z",
    "biotoolsCURIE": "biotools:biomex",
    "biotoolsID": "biomex",
    "collectionID": [
        "KU Leuven",
        "VIB"
    ],
    "credit": [
        {
            "email": "peter.carmeliet@kuleuven.vib.be",
            "name": "Peter Carmeliet",
            "orcidid": "https://orcid.org/0000-0001-7961-1821",
            "typeEntity": "Person"
        }
    ],
    "description": "an interactive workflow for (single cell) omics data interpretation and visualization.\n\nBIOMEX BIOMEX is a data analysis platform to facilitate the Biological Interpretation Of Multi-omics EXperiments.\n\nBIOMEX is a data analysis platform to facilitate the Biological Interpretation Of Multi-omics EXperiments. The software aims to maximize the value of (single cell) -omics data by removing key bottlenecks in the processing, analysis and interpretation workflow. BIOMEX is free for everyone.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://www.youtube.com/playlist?list=PL4Sblnrr7pYYu2K8TV9_WKmTSj02wgp57"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://www.vibcancer.be/software-tools/biomex",
    "lastUpdate": "2020-09-05T08:33:35Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://bitbucket.org/ftaverna/biomex"
        }
    ],
    "name": "BIOMEX",
    "owner": "bits@vib.be",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA332",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.The amount of biological data, generated with (single cell) omics technologies, is rapidly increasing, thereby exacerbating bottlenecks in the data analysis and interpretation of omics experiments. Data mining platforms that facilitate non-bioinformatician experimental scientists to analyze a wide range of experimental designs and data types can alleviate such bottlenecks, aiding in the exploration of (newly generated or publicly available) omics datasets. Here, we present BIOMEX, a browser-based software, designed to facilitate the Biological Interpretation Of Multi-omics EXperiments by bench scientists. BIOMEX integrates state-of-the-art statistical tools and field-tested algorithms into a flexible but well-defined workflow that accommodates metabolomics, transcriptomics, proteomics, mass cytometry and single cell data from different platforms and organisms. The BIOMEX workflow is accompanied by a manual and video tutorials that provide the necessary background to navigate the interface and get acquainted with the employed methods. BIOMEX guides the user through omics-tailored analyses, such as data pretreatment and normalization, dimensionality reduction, differential and enrichment analysis, pathway mapping, clustering, marker analysis, trajectory inference, meta-analysis and others. BIOMEX is fully interactive, allowing users to easily change parameters and generate customized plots exportable as high-quality publication-ready figures. BIOMEX is open source and freely available at https: //www.vibcancer.be/software-tools/biomex.",
                "authors": [
                    {
                        "name": "Carmeliet P."
                    },
                    {
                        "name": "Dewerchin M."
                    },
                    {
                        "name": "Eelen G."
                    },
                    {
                        "name": "Goveia J."
                    },
                    {
                        "name": "Karakach T.K."
                    },
                    {
                        "name": "Khan S."
                    },
                    {
                        "name": "Rohlenova K."
                    },
                    {
                        "name": "Schoonjans L."
                    },
                    {
                        "name": "Subramanian A."
                    },
                    {
                        "name": "Taverna F."
                    },
                    {
                        "name": "Treps L."
                    }
                ],
                "citationCount": 8,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "BIOMEX: An interactive workflow for (single cell) omics data interpretation and visualization"
            },
            "pmcid": "PMC7319461",
            "pmid": "32392297"
        }
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
