{
    "additionDate": "2019-11-14T19:46:58Z",
    "biotoolsCURIE": "biotools:AGS_ACN",
    "biotoolsID": "AGS_ACN",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "epereira@mpi-bremen.de",
            "name": "Emiliano Pereira-Flores",
            "orcidid": "https://orcid.org/0000-0001-5830-3328",
            "typeEntity": "Person"
        },
        {
            "email": "afernand@mpi-bremen.de",
            "name": "Antonio Fernandez-Guerra",
            "typeEntity": "Person"
        }
    ],
    "description": "> CORRECT NAME OF TOOL COULD ALSO BE 'ags.sh acn.sh tools', 'AGS', 'ACN' | Fast and accurate average genome size and 16S rRNA gene average copy number computation in metagenomic data | Here, we present the ags.sh and acn.sh tools dedicated to the computation of the Average Genome Size (AGS) and 16S rRNA gene Average Copy Number (ACN), respectively. The ags.sh and acn.sh tools compute these metagenomic traits based on the (ultra-fast) annotation of 35 universally distributed single-copy genes in unassembled metagenomic data | Pereira-Flores, E., Glöckner F. O., and Fernandez-Guerra A. Fast and accurate average genome size and 16S rRNA gene average copy number computation in metagenomic data. BMC Bioinformatics. 2019;20(1):453. doi:10.1186/s12859-019-3031-y",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                }
            ]
        }
    ],
    "homepage": "https://github.com/pereiramemo/AGS-and-ACN-tools",
    "language": [
        "Shell"
    ],
    "lastUpdate": "2020-12-01T15:44:00Z",
    "license": "GPL-3.0",
    "name": "AGS ACN",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3031-Y",
            "metadata": {
                "abstract": "BACKGROUND: Metagenomics caused a quantum leap in microbial ecology. However, the inherent size and complexity of metagenomic data limit its interpretation. The quantification of metagenomic traits in metagenomic analysis workflows has the potential to improve the exploitation of metagenomic data. Metagenomic traits are organisms' characteristics linked to their performance. They are measured at the genomic level taking a random sample of individuals in a community. As such, these traits provide valuable information to uncover microorganisms' ecological patterns. The Average Genome Size (AGS) and the 16S rRNA gene Average Copy Number (ACN) are two highly informative metagenomic traits that reflect microorganisms' ecological strategies as well as the environmental conditions they inhabit. RESULTS: Here, we present the ags.sh and acn.sh tools, which analytically derive the AGS and ACN metagenomic traits. These tools represent an advance on previous approaches to compute the AGS and ACN traits. Benchmarking shows that ags.sh is up to 11 times faster than state-of-the-art tools dedicated to the estimation AGS. Both ags.sh and acn.sh show comparable or higher accuracy than existing tools used to estimate these traits. To exemplify the applicability of both tools, we analyzed the 139 prokaryotic metagenomes of TARA Oceans and revealed the ecological strategies associated with different water layers. CONCLUSION: We took advantage of recent advances in gene annotation to develop the ags.sh and acn.sh tools to combine easy tool usage with fast and accurate performance. Our tools compute the AGS and ACN metagenomic traits on unassembled metagenomes and allow researchers to improve their metagenomic data analysis to gain deeper insights into microorganisms' ecology. The ags.sh and acn.sh tools are publicly available using Docker container technology at https://github.com/pereiramemo/AGS-and-ACN-tools .",
                "authors": [
                    {
                        "name": "Pereira-Flores E."
                    },
                    {
                        "name": "Glockner F.O."
                    },
                    {
                        "name": "Fernandez-Guerra A."
                    }
                ],
                "citationCount": 1,
                "date": "2019-09-05T00:00:00Z",
                "journal": "BMC bioinformatics",
                "title": "Fast and accurate average genome size and 16S rRNA gene average copy number computation in metagenomic data"
            },
            "pmcid": "PMC6727555",
            "pmid": "31488068"
        }
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Geriatric medicine",
            "uri": "http://edamontology.org/topic_3399"
        }
    ],
    "validated": 1
}