{
    "additionDate": "2021-01-18T11:12:19Z",
    "biotoolsCURIE": "biotools:tsrbase",
    "biotoolsID": "tsrbase",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "yongpeng@scu.edu.cn",
            "name": "Yong Peng",
            "typeEntity": "Person"
        },
        {
            "email": "zhaoyun@scu.edu.cn",
            "name": "Yun Zhao",
            "typeEntity": "Person"
        }
    ],
    "description": "tsRBase: Comprehensive Database for tsRNA Expression and Function.\n\nThe tsRBase is a comprehensive database of tsRNA sequence, expression features and function for multiple species. It provides information of over 120,000 tsRNAs which collected from high-throughput sequencing data of 20 species, including bacteria and fungi, plant and animal. Furthermore, tsRBase explored and displayed proteins associated tsRNAs from CLIP/RIP data, as well as tsRNAs’ targets from CLASH and CLEAR-CLIP data, which might reveal the role of tsRNA in vivo.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "homepage": "http://www.tsrbase.org",
    "lastUpdate": "2024-11-24T20:40:20.269271Z",
    "name": "tsRBase",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/nar/gkaa888",
            "metadata": {
                "abstract": "tRNA-derived small RNAs (tsRNAs) are a class of novel small RNAs, ubiquitously present in prokaryotes and eukaryotes. It has been reported that tsRNAs exhibit spatiotemporal expression patterns and can function as regulatory molecules in many biological processes. Current tsRNA databases only cover limited organisms and ignore tsRNA functional characteristics. Thus, integrating more relevant tsRNA information is helpful for further exploration. Here, we present a tsRNA database, named tsRBase, which integrates the expression pattern and functional information of tsRNAs in multiple species. In tsRBase, we identified 121 942 tsRNAs by analyzing more than 14 000 publicly available small RNA-seq data covering 20 species. This database collects samples from different tissues/cell-lines, or under different treatments and genetic backgrounds, thus helps depict specific expression patterns of tsRNAs under different conditions. Importantly, to enrich our understanding of biological significance, we collected tsRNAs experimentally validated from published literatures, obtained protein-binding tsRNAs from CLIP/RIP-seq data, and identified targets of tsRNAs from CLASH and CLEAR-CLIP data. Taken together, tsRBase is the most comprehensive and systematic tsRNA repository, exhibiting all-inclusive information of tsRNAs from diverse data sources of multiple species. tsRBase is freely available at http://www.tsrbase.org.",
                "authors": [
                    {
                        "name": "Cheng J."
                    },
                    {
                        "name": "Fu X."
                    },
                    {
                        "name": "Guo Z."
                    },
                    {
                        "name": "Jin Y."
                    },
                    {
                        "name": "Liu W."
                    },
                    {
                        "name": "Peng Y."
                    },
                    {
                        "name": "Wu Q."
                    },
                    {
                        "name": "Zeng Z."
                    },
                    {
                        "name": "Zhang J."
                    },
                    {
                        "name": "Zhao Y."
                    },
                    {
                        "name": "Zhu L."
                    },
                    {
                        "name": "Zuo Y."
                    }
                ],
                "citationCount": 39,
                "date": "2021-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "TsRBase: A comprehensive database for expression and function of tsRNAs in multiple species"
            },
            "pmcid": "PMC7778983",
            "pmid": "33068436"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "RNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3794"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
