{
    "additionDate": "2021-01-18T09:06:26Z",
    "biotoolsCURIE": "biotools:combsecretomics",
    "biotoolsID": "combsecretomics",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "efthymia.chantzi@medsci.uu.se",
            "name": "Efthymia Chantzi",
            "orcidid": "https://orcid.org/0000-0002-8312-4572",
            "typeEntity": "Person"
        },
        {
            "email": "mats.gustafsson@medsci.uu.se",
            "name": "Mats G. Gustafsson",
            "typeEntity": "Person"
        }
    ],
    "description": "COMBSecretomics is a computational framework for secretome-related higher-order drug combination analysis. It offers the unique opportunity to study how multidrug treatments (i.e., more than 2 drugs) affect the protein release patterns of inactive/unprovoked and active/provoked cell populations. This molecular based evaluation approach of combination treatments opens for systematic studies associated with the secretome of complex diseases where there are still unmet diagnostic and therapeutic needs.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/EffieChantzi/COMBSecretomics",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-02-17T13:17:58Z",
    "license": "GPL-3.0",
    "name": "COMBSecretomics",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0232989",
            "metadata": {
                "abstract": "© 2020 Chantzi et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Multi drug treatments are increasingly used in the clinic to combat complex and co-occurring diseases. However, most drug combination discovery efforts today are mainly focused on anticancer therapy and rarely examine the potential of using more than two drugs simultaneously. Moreover, there is currently no reported methodology for performing second- and higher-order drug combination analysis of secretomic patterns, meaning protein concentration profiles released by the cells. Here, we introduce COMBSecretomics (https://github.com/EffieChantzi/COMBSecretomics.git), the first pragmatic methodological framework designed to search exhaustively for second- and higher-order mixtures of candidate treatments that can modify, or even reverse malfunctioning secretomic patterns of human cells. This framework comes with two novel model-free combination analysis methods; a tailor-made generalization of the highest single agent principle and a data mining approach based on top-down hierarchical clustering. Quality control procedures to eliminate outliers and non-parametric statistics to quantify uncertainty in the results obtained are also included. COMBSecretomics is based on a standardized reproducible format and could be employed with any experimental platform that provides the required protein release data. Its practical use and functionality are demonstrated by means of a proof-of-principle pharmacological study related to cartilage degradation. COMBSecretomics is the first methodological framework reported to enable secretome-related second- and higher-order drug combination analysis. It could be used in drug discovery and development projects, clinical practice, as well as basic biological understanding of the largely unexplored changes in cell-cell communication that occurs due to disease and/or associated pharmacological treatment conditions.",
                "authors": [
                    {
                        "name": "Chantzi E."
                    },
                    {
                        "name": "Neidlin M."
                    },
                    {
                        "name": "Macheras G.A."
                    },
                    {
                        "name": "Alexopoulos L.G."
                    },
                    {
                        "name": "Gustafsson M.G."
                    }
                ],
                "date": "2020-05-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Combsecretomics: A pragmatic methodological framework for higher-order drug combination analysis using secretomics"
            },
            "pmcid": "PMC7224510",
            "pmid": "32407402"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Drug development",
            "uri": "http://edamontology.org/topic_3373"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Experimental design and studies",
            "uri": "http://edamontology.org/topic_3678"
        }
    ]
}