{
    "additionDate": "2017-08-03T19:00:14Z",
    "biotoolsCURIE": "biotools:sodock",
    "biotoolsID": "sodock",
    "credit": [
        {
            "email": "syho@mail.nctu.edu.tw",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://140.113.239.45/"
        }
    ],
    "description": "An optimization algorithm based on particle swarm optimization (PSO) for solving flexible protein-ligand docking problems. PSO is a population-based search algorithm.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://140.113.239.45/sodock/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                }
            ]
        }
    ],
    "homepage": "http://140.113.239.45/sodock/",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:45Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/sodock-swarm-optimization-for-flexible-protein-ligand-docking.html"
        }
    ],
    "name": "SODOCK",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Protein-ligand docking can be formulated as a parameter optimization problem associated with an accurate scoring function, which aims to identify the translation, orientation, and conformation of a docked ligand with the lowest energy. The parameter optimization problem for highly flexible ligands with many rotatable bonds is more difficult than that for less flexible ligands using genetic algorithm (GA)-based approaches, due to the large numbers of parameters and high correlations among these parameters. This investigation presents a novel optimization algorithm SODOCK based on particle swarm optimization (PSO) for solving flexible protein-ligand docking problems. To improve efficiency and robustness of PSO, an efficient local search strategy is incorporated into SODOCK. The implementation of SODOCK adopts the environment and energy function of AutoDock 3.05. Computer simulation results reveal that SODOCK is superior to the Lamarckian genetic algorithm (LGA) of AutoDock, in terms of convergence performance, robustness, and obtained energy, especially for highly flexible ligands. The results also reveal that PSO is more suitable than the conventional GA in dealing with flexible docking problems with high correlations among parameters. This investigation also compared SODOCK with four state-of-the-art docking methods, namely GOLD 1.2, DOCK 4.0, FlexX 1.8, and LGA of AutoDock 3.05. SODOCK obtained the smallest RMSD in 19 of 37 cases. The average 2.29 Å of the 37 RMSD values of SODOCK was better than those of other docking programs, which were all above 3.0 Å. © 2006 Wiley Periodicals, Inc.",
                "authors": [
                    {
                        "name": "Chen H.-M."
                    },
                    {
                        "name": "Ho S.-Y."
                    },
                    {
                        "name": "Huang H.-L."
                    },
                    {
                        "name": "Hwang S.-F."
                    },
                    {
                        "name": "Liu B.-F."
                    }
                ],
                "citationCount": 88,
                "date": "2007-01-30T00:00:00Z",
                "journal": "Journal of Computational Chemistry",
                "title": "SODOCK: Swarm optimization for highly flexible protein-ligand docking"
            },
            "pmid": "17186483"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        },
        {
            "term": "Protein sites, features and motifs",
            "uri": "http://edamontology.org/topic_3510"
        },
        {
            "term": "Simulation experiment",
            "uri": "http://edamontology.org/topic_3524"
        }
    ],
    "validated": 1
}
