{
    "additionDate": "2019-11-14T19:33:55Z",
    "biotoolsCURIE": "biotools:BMEG",
    "biotoolsID": "BMEG",
    "confidence_flag": "tool",
    "description": "Exploring Integrative Analysis using the BioMedical Evidence Graph | A graph database for merging and analyzing connected data | Discover The BMEG is a graph database that collects data from over 20 different large scale resources and aggregates them into a single coherent resource. Sources include:",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "homepage": "http://bmeg.io",
    "language": [
        "JavaScript",
        "Python"
    ],
    "lastUpdate": "2020-12-09T14:48:05Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/bmeg/"
        }
    ],
    "name": "BMEG",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/773911"
        },
        {
            "doi": "10.1200/CCI.19.00110",
            "metadata": {
                "abstract": "© 2020 by American Society of Clinical OncologyPURPOSE The analysis of cancer biology data involves extremely heterogeneous data sets, including information from RNA sequencing, genome-wide copy number, DNA methylation data reporting on epigenetic regulation, somatic mutations from whole-exome or whole-genome analyses, pathology estimates from imaging sections or subtyping, drug response or other treatment outcomes, and various other clinical and phenotypic measurements. Bringing these different resources into a common framework, with a data model that allows for complex relationships as well as dense vectors of features, will unlock integrated data set analysis. METHODS We introduce the BioMedical Evidence Graph (BMEG), a graph database and query engine for discovery and analysis of cancer biology. The BMEG is unique from other biologic data graphs in that sample-level molecular and clinical information is connected to reference knowledge bases. It combines gene expression and mutation data with drug-response experiments, pathway information databases, and literature-derived associations. RESULTS The construction of the BMEG has resulted in a graph containing . 41 million vertices and 57 million edges. The BMEG system provides a graph query–based application programming interface to enable analysis, with client code available for Python, Javascript, and R, and a server online at bmeg.io. Using this system, we have demonstrated several forms of cross–data set analysis to show the utility of the system. CONCLUSION The BMEG is an evolving resource dedicated to enabling integrative analysis. We have demonstrated queries on the system that illustrate mutation significance analysis, drug-response machine learning, patient-level knowledge-base queries, and pathway level analysis. We have compared the resulting graph to other available integrated graph systems and demonstrated the former is unique in the scale of the graph and the type of data it makes available.",
                "authors": [
                    {
                        "name": "Struck A."
                    },
                    {
                        "name": "Walsh B."
                    },
                    {
                        "name": "Buchanan A."
                    },
                    {
                        "name": "Lee J.A."
                    },
                    {
                        "name": "Spangler R."
                    },
                    {
                        "name": "Stuart J.M."
                    },
                    {
                        "name": "Ellrott K."
                    }
                ],
                "citationCount": 2,
                "date": "2019-01-01T00:00:00Z",
                "journal": "JCO Clinical Cancer Informatics",
                "title": "Exploring Integrative Analysis Using the BioMedical Evidence Graph"
            },
            "pmcid": "PMC7049249",
            "pmid": "32097025"
        }
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}