{
    "additionDate": "2018-06-30T18:23:15Z",
    "biotoolsCURIE": "biotools:smrt",
    "biotoolsID": "smrt",
    "credit": [
        {
            "email": "cswangl@cityu.edu.hk",
            "name": "Lusheng Wang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Progressive Approach for SNP Calling and Haplotype Assembly Using SMRT Data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/guofeieileen/SMRT/wiki/Software"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                }
            ]
        }
    ],
    "homepage": "https://github.com/guofeieileen/SMRT/wiki/Software",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "SMRT",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/bty059",
            "metadata": {
                "abstract": "© The Author(s) 2018.Motivation Haplotype information is essential to the complete description and interpretation of genomes, genetic diversity and genetic ancestry. The new technologies can provide Single Molecular Sequencing (SMS) data that cover about 90% of positions over chromosomes. However, the SMS data has a higher error rate comparing to 1% error rate for short reads. Thus, it becomes very difficult for SNP calling and haplotype assembly using SMS reads. Most existing technologies do not work properly for the SMS data. Results In this paper, we develop a progressive approach for SNP calling and haplotype assembly that works very well for the SMS data. Our method can handle more than 200 million non-N bases on Chromosome 1 with millions of reads, more than 100 blocks, each of which contains more than 2 million bases and more than 3K SNP sites on average. Experiment results show that the false discovery rate and false negative rate for our method are 15.7 and 11.0% on NA12878, and 16.5 and 11.0% on NA24385. Moreover, the overall switch errors for our method are 7.26 and 5.21 with average 3378 and 5736 SNP sites per block on NA12878 and NA24385, respectively. Here, we demonstrate that SMS reads alone can generate a high quality solution for both SNP calling and haplotype assembly. Availability and implementation Source codes and results are available at https://github.com/guofeieileen/SMRT/wiki/Software.",
                "authors": [
                    {
                        "name": "Guo F."
                    },
                    {
                        "name": "Wang D."
                    },
                    {
                        "name": "Wang L."
                    }
                ],
                "citationCount": 13,
                "date": "2018-06-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Progressive approach for SNP calling and haplotype assembly using single molecular sequencing data"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1
}
