{
    "accessibility": "Open access",
    "additionDate": "2022-09-05T20:40:25.753727Z",
    "biotoolsCURIE": "biotools:neighbor2neighbor",
    "biotoolsID": "neighbor2neighbor",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Xu Jia"
        },
        {
            "name": "Huchuan Lu",
            "orcidid": "https://orcid.org/0000-0002-6668-9758"
        },
        {
            "name": "Jianzhuang Liu",
            "orcidid": "https://orcid.org/0000-0002-7960-9382"
        },
        {
            "name": "Songjiang Li",
            "orcidid": "https://orcid.org/0000-0001-6510-3383"
        },
        {
            "name": "Tao Huang",
            "orcidid": "https://orcid.org/0000-0002-1664-288X"
        }
    ],
    "description": "A Self-Supervised Framework for Deep Image Denoising.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://github.com/TaoHuang2018/Neighbor2Neighbor",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:42:09.385105Z",
    "license": "BSD-3-Clause",
    "name": "Neighbor2Neighbor",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1109/tip.2022.3176533",
            "metadata": {
                "abstract": "In recent years, image denoising has benefited a lot from deep neural networks. However, these models need large amounts of noisy-clean image pairs for supervision. Although there have been attempts in training denoising networks with only noisy images, existing self-supervised algorithms suffer from inefficient network training, heavy computational burden, or dependence on noise modeling. In this paper, we proposed a self-supervised framework named Neighbor2Neighbor for deep image denoising. We develop a theoretical motivation and prove that by designing specific samplers for training image pairs generation from only noisy images, we can train a self-supervised denoising network similar to the network trained with clean images supervision. Besides, we propose a regularizer in the perspective of optimization to narrow the optimization gap between the self-supervised denoiser and the supervised denoiser. We present a very simple yet effective self-supervised training scheme based on the theoretical understandings: training image pairs are generated by random neighbor sub-samplers, and denoising networks are trained with a regularized loss. Moreover, we propose a training strategy named BayerEnsemble to adapt the Neighbor2Neighbor framework in raw image denoising. The proposed Neighbor2Neighbor framework can enjoy the progress of state-of-the-art supervised denoising networks in network architecture design. It also avoids heavy dependence on the assumption of the noise distribution. We evaluate the Neighbor2Neighbor framework through extensive experiments, including synthetic experiments with different noise distributions and real-world experiments under various scenarios. The code is available online: https://github.com/TaoHuang2018/Neighbor2Neighbor.",
                "authors": [
                    {
                        "name": "Huang T."
                    },
                    {
                        "name": "Jia X."
                    },
                    {
                        "name": "Li S."
                    },
                    {
                        "name": "Liu J."
                    },
                    {
                        "name": "Lu H."
                    }
                ],
                "citationCount": 27,
                "date": "2022-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Image Processing",
                "title": "Neighbor2Neighbor: A Self-Supervised Framework for Deep Image Denoising"
            },
            "pmid": "35679376"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}
