{
    "additionDate": "2019-11-14T19:31:02Z",
    "biotoolsCURIE": "biotools:dnAQET",
    "biotoolsID": "dnAQET",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Wenming.Xiao@fda.hhs.gov",
            "name": "Wenming Xiao",
            "typeEntity": "Person"
        },
        {
            "email": "Huixiao.Hong@fda.hhs.gov",
            "name": "Huixiao Hong",
            "typeEntity": "Person",
            "typeRole": [
                "Support"
            ]
        }
    ],
    "description": "a framework to compute a consolidated metric for benchmarking quality of de novo assemblies | de novo Assembly Quality Evaluation Tool (dnAQET) | The de novo Assembly Quality Evaluation Tool is a framework designed to evaulate the contigs of a de novo assembly against a trusted reference genome. It generates a quality score for each contig based on the misassemblies observed in the alignments and the total alignment percentage of that contig | The de novo Assembly Quality Evaluation Tool (dnAQET) is a framework designed to evaluate a de novo assembly along with its scaffolds/contigs against a trusted reference genome. It first generates a quality score for each scaffold of an assembly based on its length, the misassemblies observed in the alignments and the total alignment percentage of a scaffold. Based on the quality scores assigned to the contigs/scaffolds, it computes an overall quality score for the whole assembly | An official website of the United States government | U S",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Sequence assembly validation",
                    "uri": "http://edamontology.org/operation_3180"
                },
                {
                    "term": "de Novo sequencing",
                    "uri": "http://edamontology.org/operation_3644"
                }
            ]
        }
    ],
    "homepage": "https://www.fda.gov/science-research/bioinformatics-tools/de-novo-assembly-quality-evaluation-tool-dnaqet",
    "language": [
        "Java"
    ],
    "lastUpdate": "2020-12-22T09:36:56Z",
    "name": "dnAQET",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12864-019-6070-X",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Accurate de novo genome assembly has become reality with the advancements in sequencing technology. With the ever-increasing number of de novo genome assembly tools, assessing the quality of assemblies has become of great importance in genome research. Although many quality metrics have been proposed and software tools for calculating those metrics have been developed, the existing tools do not produce a unified measure to reflect the overall quality of an assembly. Results: To address this issue, we developed the de novo Assembly Quality Evaluation Tool (dnAQET) that generates a unified metric for benchmarking the quality assessment of assemblies. Our framework first calculates individual quality scores for the scaffolds/contigs of an assembly by aligning them to a reference genome. Next, it computes a quality score for the assembly using its overall reference genome coverage, the quality score distribution of its scaffolds and the redundancy identified in it. Using synthetic assemblies randomly generated from the latest human genome build, various builds of the reference genomes for five organisms and six de novo assemblies for sample NA24385, we tested dnAQET to assess its capability for benchmarking quality evaluation of genome assemblies. For synthetic data, our quality score increased with decreasing number of misassemblies and redundancy and increasing average contig length and coverage, as expected. For genome builds, dnAQET quality score calculated for a more recent reference genome was better than the score for an older version. To compare with some of the most frequently used measures, 13 other quality measures were calculated. The quality score from dnAQET was found to be better than all other measures in terms of consistency with the known quality of the reference genomes, indicating that dnAQET is reliable for benchmarking quality assessment of de novo genome assemblies. Conclusions: The dnAQET is a scalable framework designed to evaluate a de novo genome assembly based on the aggregated quality of its scaffolds (or contigs). Our results demonstrated that dnAQET quality score is reliable for benchmarking quality assessment of genome assemblies. The dnQAET can help researchers to identify the most suitable assembly tools and to select high quality assemblies generated.",
                "authors": [
                    {
                        "name": "Hong H."
                    },
                    {
                        "name": "Xiao W."
                    },
                    {
                        "name": "Yavas G."
                    }
                ],
                "date": "2019-09-11T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "DnAQET: A framework to compute a consolidated metric for benchmarking quality of de novo assemblies"
            },
            "pmcid": "PMC6737619",
            "pmid": "31510940"
        }
    ],
    "topic": [
        {
            "term": "Computer science",
            "uri": "http://edamontology.org/topic_3316"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ],
    "validated": 1
}
