{
    "additionDate": "2019-11-14T18:21:41Z",
    "biotoolsCURIE": "biotools:pWGBSSimla",
    "biotoolsID": "pWGBSSimla",
    "confidence_flag": "tool",
    "description": "> HOMEPAGE MISSING! | > CORRECT NAME OF TOOL COULD ALSO BE 'omicssimla' | a profile-based whole-genome bisulfite sequencing data simulator incorporating methylation QTLs, allele-specific methylations and differentially methylated regions | MOTIVATION:DNA methylation plays an important role in regulating gene expression. DNA methylation is commonly analyzed using bisulfite sequencing (BS-seq)-based designs, such as whole-genome bisulfite sequencing (WGBS), reduced representation bisulfite sequencing (RRBS), and oxidative bisulfite sequencing (oxBS-seq). Furthermore, there has been growing interest in investigating the roles that genetic variants play in changing the methylation levels (i.e., methylation quantitative trait loci or meQTLs), how methylation regulates the imprinting of gene expression (i.e., allele-specific methylation or ASM), and the differentially methylated regions (DMRs) among different cell types",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Whole genome methylation analysis",
                    "uri": "http://edamontology.org/operation_3206"
                },
                {
                    "term": "Gene methylation analysis",
                    "uri": "http://edamontology.org/operation_3207"
                },
                {
                    "term": "Bisulfite mapping",
                    "uri": "http://edamontology.org/operation_3186"
                }
            ]
        }
    ],
    "homepage": "https://omicssimla.sourceforge.io/",
    "lastUpdate": "2020-12-10T12:47:52Z",
    "name": "pWGBSSimla",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ635",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press. All rights reserved.Motivation: DNA methylation plays an important role in regulating gene expression. DNA methylation is commonly analyzed using bisulfite sequencing (BS-seq)-based designs, such as whole-genome bisulfite sequencing (WGBS), reduced representation bisulfite sequencing (RRBS) and oxidative bisulfite sequencing (oxBS-seq). Furthermore, there has been growing interest in investigating the roles that genetic variants play in changing the methylation levels (i.e. methylation quantitative trait loci or meQTLs), how methylation regulates the imprinting of gene expression (i.e. allele-specific methylation or ASM) and the differentially methylated regions (DMRs) among different cell types. However, none of the current simulation tools can generate different BS-seq data types (e.g. WGBS, RRBS and oxBS-seq) while modeling meQTLs, ASM and DMRs. Results: We developed profile-based whole-genome bisulfite sequencing data simulator (pWGBSSimla), a profile-based bisulfite sequencing data simulator, which simulates WGBS, RRBS and oxBS-seq data for different cell types based on real data. meQTLs and ASM are modeled based on the block structures of the methylation status at CpGs, whereas the simulation of DMRs is based on observations of methylation rates in real data. We demonstrated that pWGBSSimla adequately simulates data and allows performance comparisons among different methylation analysis methods.",
                "authors": [
                    {
                        "name": "Chung R.-H."
                    },
                    {
                        "name": "Kang C.-Y."
                    }
                ],
                "citationCount": 2,
                "date": "2020-02-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "PWGBSSimla: A profile-based whole-genome bisulfite sequencing data simulator incorporating methylation QTLs, allele-specific methylations and differentially methylated regions"
            },
            "pmid": "31397839"
        }
    ],
    "topic": [
        {
            "term": "Methylated DNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3674"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ],
    "validated": 1
}