{
    "additionDate": "2021-01-18T10:53:34Z",
    "biotoolsCURIE": "biotools:pub2tools2020__seeds",
    "biotoolsID": "pub2tools2020__seeds",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "kschischo@rheinahrcampus.de",
            "typeEntity": "Person"
        },
        {
            "email": "sysbio_software@rheinahrcampus.de",
            "typeEntity": "Person"
        }
    ],
    "description": "Data driven inference of structural model errors and unknown inputs for dynamic systems biology.\n\nEstimate Hidden Inputs using the Dynamic Elastic Net.\n\nAlgorithms to calculate the hidden inputs of systems of differential equations. These hidden inputs can be interpreted as a control that tries to minimize the discrepancies between a given model and taken measurements. The idea is also called the Dynamic Elastic Net, as proposed in the paper \"Learning (from) the errors of a systems biology model\" (Engelhardt, Froelich, Kschischo 2016) <doi:10.1038/srep20772>. To use the experimental SBML import function, the 'rsbml' package is required. For installation I refer to the official 'rsbml' page: <https://bioconductor.org/packages/release/bioc/html/rsbml.html>.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/package=seeds",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-13T17:35:50Z",
    "license": "MIT",
    "name": "SEEDS",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA786",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2021. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Dynamic models formulated as ordinary differential equations can provide information about the mechanistic and causal interactions in biological systems to guide targeted interventions and to design further experiments. Inaccurate knowledge about the structure, functional form and parameters of interactions is a major obstacle to mechanistic modeling. A further challenge is the open nature of biological systems which receive unknown inputs from their environment. The R-package SEEDS implements two recently developed algorithms to infer structural model errors and unknown inputs from output measurements. This information can facilitate efficient model recalibration as well as experimental design in the case of misfits between the initial model and data.",
                "authors": [
                    {
                        "name": "Engelhardt B."
                    },
                    {
                        "name": "Frohlich H."
                    },
                    {
                        "name": "Kahl D."
                    },
                    {
                        "name": "Kschischo M."
                    },
                    {
                        "name": "Newmiwaka T."
                    },
                    {
                        "name": "Wendland P."
                    }
                ],
                "citationCount": 1,
                "date": "2021-05-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "SEEDS: Data driven inference of structural model errors and unknown inputs for dynamic systems biology"
            },
            "pmid": "32931565"
        }
    ],
    "topic": [
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        }
    ]
}
