{
    "additionDate": "2020-01-09T18:27:24Z",
    "biotoolsCURIE": "biotools:Additionally_analogous",
    "biotoolsID": "Additionally_analogous",
    "confidence_flag": "low",
    "description": "Development of New Methods Needs Proper Evaluation-Benchmarking Sets for Machine Learning Experiments for Class A GPCRs.\n\nMachine Learning meets Biochemistry.\n\nRequired python packages: numpy numba scipy tqdm scikit-learn rdkit openbabel mordred matplotlib.\n\nCreate three separate directories for storing ananas database, results of the experiments, and external data. Set the following environment variables as full paths to the newly created directories: CRISPER_DATA_PATH ANANAS_RESULTS_PATH BANANAS_EXTERNAL_DATA_PATH.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'gmum'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Transmembrane protein prediction",
                    "uri": "http://edamontology.org/operation_0269"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "homepage": "https://github.com/lesniak43/ananas",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-01-09T18:27:24Z",
    "name": "Additionally analogous",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.9B00689",
            "metadata": {
                "abstract": "© 2019 American Chemical Society.New computational approaches for virtual screening applications are constantly being developed. However, before a particular tool is used to search for new active compounds, its effectiveness in the type of task must be examined. In this study, we conducted a detailed analysis of various aspects of preparation of respective data sets for such an evaluation. We propose a protocol for fetching data from the ChEMBL database, examine various compound representations in terms of the possible bias resulting from the way they are generated, and define a new metric for comparing the structural similarity of compounds, which is in line with chemical intuition. The newly developed method is also used for the evaluation of various approaches for division of the data set into training and test set parts, which are also examined in detail in terms of being the source of possible results bias. Finally, machine learning methods are applied in cross-validation studies of data sets constructed within the paper, constituting benchmarks for the assessment of computational methods developed for virtual screening tasks. Additionally, analogous data sets for class A G protein-coupled receptors (100 targets with the highest number of records) were prepared. They are available at http://gmum.net/benchmarks/, together with script enabling reproduction of all results available at https://github.com/lesniak43/ananas.",
                "authors": [
                    {
                        "name": "Lesniak D."
                    },
                    {
                        "name": "Podlewska S."
                    },
                    {
                        "name": "Jastrzebski S."
                    },
                    {
                        "name": "Sieradzki I."
                    },
                    {
                        "name": "Bojarski A.J."
                    },
                    {
                        "name": "Tabor J."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "Development of New Methods Needs Proper Evaluation - Benchmarking Sets for Machine Learning Experiments for Class A GPCRs"
            },
            "pmid": "31604014"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Biochemistry",
            "uri": "http://edamontology.org/topic_3292"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        }
    ]
}