
{
    "credit": [
        {
            "email": "genomicus-web@ens.fr",
            "typeRoles": [
                "Support"
            ]
        },
        {
            "email": "hrc@ens.fr",
            "name": "Hugues Roest Crollius",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.ibens.ens.fr/?rubrique43"
        },
        {
            "email": "alouis@biologie.ens.fr",
            "name": "Alexandra Louis",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.ibens.ens.fr/spip.php?article182"
        }
    ],
    "download": [
        {
            "note": "Genomicus-plants ftp download site providing reconstructed ancestral genomes with AGORA",
            "type": "Biological data",
            "url": "ftp://ftp.biologie.ens.fr/pub/dyogen/genomicus-plants/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree visualisation",
                    "uri": "http://edamontology.org/operation_0567"
                },
                {
                    "term": "Genome visualisation",
                    "uri": "http://edamontology.org/operation_3208"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Dot plot plotting",
                    "uri": "http://edamontology.org/operation_0490"
                }
            ]
        }
    ],
    "labels": {
        "accessibility": [
            "Open access"
        ],
        "collectionID": [
            "elixir-fr-sdp-2019",
            "GENOMICUS"
        ],
        "cost": "Free of charge",
        "elixirNode": [
            "France"
        ],
        "maturity": "Mature",
        "toolType": [
            "Web application",
            "Database portal"
        ],
        "topic": [
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "Evolutionary biology",
                "uri": "http://edamontology.org/topic_3299"
            },
            {
                "term": "Comparative genomics",
                "uri": "http://edamontology.org/topic_0797"
            },
            {
                "term": "Model organisms",
                "uri": "http://edamontology.org/topic_0621"
            },
            {
                "term": "Gene and protein families",
                "uri": "http://edamontology.org/topic_0623"
            },
            {
                "term": "Paleogenomics",
                "uri": "http://edamontology.org/topic_3943"
            },
            {
                "term": "Plant biology",
                "uri": "http://edamontology.org/topic_0780"
            }
        ]
    },
    "link": [
        {
            "note": "Vertebrate instance of Genomicus",
            "type": "Service",
            "url": "https://www.genomicus.biologie.ens.fr/genomicus"
        },
        {
            "note": "Specific fungi instance of Genomicus",
            "type": "Service",
            "url": "https://www.genomicus.biologie.ens.fr/genomicus-fungi"
        },
        {
            "note": "Specific metazoa instance of Genomicus",
            "type": "Service",
            "url": "https://www.genomicus.biologie.ens.fr/genomicus-metazoa"
        },
        {
            "note": "Specific protists instance of Genomicus",
            "type": "Service",
            "url": "https://www.genomicus.biologie.ens.fr/genomicus-protists"
        }
    ],
    "publication": [
        {
            "abstract": "© 2017 The Author(s).Since 2010, the Genomicus web server is available online at http://genomicus.biologie.ens.fr/genomicus. This graphical browser provides access to comparative genomic analyses in four different phyla (Vertebrate, Plants, Fungi, and non vertebrate Metazoans). Users can analyse genomic information from extant species, as well as ancestral gene content and gene order for vertebrates and flowering plants, in an integrated evolutionary context. New analyses and visualization tools have recently been implemented in Genomicus Vertebrate. Karyotype structures from several genomes can now be compared along an evolutionary pathway (Multi-KaryotypeView), and synteny blocks can be computed and visualized between any two genomes (PhylDiagView).",
            "authors": [
                "Nguyen N.T.T.",
                "Vincens P.",
                "Crollius H.R.",
                "Louis A."
            ],
            "cit_count": 15,
            "doi": "10.1093/nar/gkx1003",
            "journal": "Nucleic Acids Research",
            "title": "Genomicus 2018: Karyotype evolutionary trees and on-the-fly synteny computing",
            "type": "Other",
            "year": "2018-01-01"
        },
        {
            "abstract": "© The Author(s) 2014.The Genomicus web server (http://www.genomicus. biologie.ens.fr/genomicus) is a visualization tool allowing comparative genomics in four different phyla (Vertebrate, Fungi, Metazoan and Plants). It provides access to genomic information from extant species, as well as ancestral gene content and gene order for vertebrates and flowering plants. Here we present the new features available for vertebrate genome with a focus on new graphical tools. The interface to enter the database has been improved, two pairwise genome comparison tools are now available (KaryoView and MatrixView) and the multiple genome comparison tools (PhyloView and Align-View) propose three new kinds of representation and a more intuitive menu. These new developments have been implemented for Genomicus portal dedicated to vertebrates. This allows the analysis of 68 extant animal genomes, as well as 58 ancestral reconstructed genomes. The Genomicus server also provides access to ancestral gene orders, to facilitate evolutionary and comparative genomics studies, as well as computationally predicted regulatory interactions, thanks to the representation of conserved noncoding elements with their putative gene targets.",
            "authors": [
                "Louis A.",
                "Nguyen N.T.T.",
                "Muffato M.",
                "Crollius H.R."
            ],
            "cit_count": 70,
            "doi": "10.1093/nar/gku1112",
            "journal": "Nucleic Acids Research",
            "title": "Genomicus update 2015: KaryoView and MatrixView provide a genome-wide perspective to multispecies comparative genomics",
            "type": "Other",
            "year": "2015-01-28"
        },
        {
            "abstract": "Genomicus (http://www.dyogen.ens.fr/genomicus/) is a database and an online tool that allows easy comparative genomic visualization in >150 eukaryote genomes. It provides a way to explore spatial information related to gene organization within and between genomes and temporal relationships related to gene and genome evolution. For the specific vertebrate phylum, it also provides access to ancestral gene order reconstructions and conserved non-coding elements information. We extended the Genomicus database originally dedicated to vertebrate to four new clades, including plants, non-vertebrate metazoa, protists and fungi. This visualization tool allows evolutionary phylogenomics analysis and exploration. Here, we describe the graphical modules of Genomicus and show how it is capable of revealing differential gene loss and gain, segmental or genome duplications and study the evolution of a locus through homology relationships. © The Author(s) 2012.",
            "authors": [
                "Louis A.",
                "Muffato M.",
                "Crollius H.R."
            ],
            "cit_count": 104,
            "doi": "10.1093/nar/gks1156",
            "journal": "Nucleic Acids Research",
            "title": "Genomicus: Five genome browsers for comparative genomics in eukaryota",
            "type": "Primary",
            "year": "2013-01-01"
        },
        {
            "abstract": "Summary: Comparative genomics remains a pivotal strategy to study the evolution of gene organization, and this primacy is reinforced by the growing number of full genome sequences available in public repositories. Despite this growth, bioinformatic tools available to visualize and compare genomes and to infer evolutionary events remain restricted to two or three genomes at a time, thus limiting the breadth and the nature of the question that can be investigated. Here we present Genomicus, a new synteny browser that can represent and compare unlimited numbers of genomes in a broad phylogenetic view. In addition, Genomicus includes reconstructed ancestral gene organization, thus greatly facilitating the interpretation of the data. Availability: Genomicus is freely available for online use at http://www.dyogen.ens.fr/genomicus while data can be downloaded at ftp://ftp.biologie.ens.fr/pub/dyogen/genomicus. Contact: hrc@biologie.ens.fr. © The Author(s) 2010. Published by Oxford University Press.",
            "authors": [
                "Muffato M.",
                "Louis A.",
                "Poisnel C.-E.",
                "Crollius H.R."
            ],
            "cit_count": 143,
            "doi": "10.1093/bioinformatics/btq079",
            "journal": "Bioinformatics",
            "title": "Genomicus: A database and a browser to study gene synteny in modern and ancestral genomes",
            "type": "Other",
            "year": "2010-02-24"
        },
        {
            "abstract": "© 2014 The Author.Comparative genomics combined with phylogenetic reconstructions are powerful approaches to study the evolution of genes and genomes. However, the current rapid expansion of the volume of genomic information makes it increasingly difficult to interrogate, integrate and synthesize comparative genome data while taking into account the maximum breadth of information available. GenomicusPlants (http://www.genomicus.biologie.ens.fr/genomicus-plants) is an extension of the Genomicus webserver that addresses this issue by allowing users to explore flowering plant genomes in an intuitive way, across the broadest evolutionary scales. Extant genomes of 26 flowering plants can be analyzed, as well as 23 ancestral reconstructed genomes. Ancestral gene order provides a long-term chronological view of gene order evolution, greatly facilitating comparative genomics and evolutionary studies. Four main interfaces ('views') are available where: (i) PhyloView combines phylogenetic trees with comparisons of genomic loci across any number of genomes; (ii) AlignView projects loci of interest against all other genomes to visualize its topological conservation; (iii) MatrixView compares two genomes in a classical dotplot representation; and (iv) Karyoview visualizes chromosome karyotypes 'painted' with colours of another genome of interest. All four views are interconnected and benefit from many customizable features.",
            "authors": [
                "Louis A.",
                "Murat F.",
                "Salse J.",
                "Crollius H.R."
            ],
            "cit_count": 8,
            "doi": "10.1093/pcp/pcu177",
            "journal": "Plant and Cell Physiology",
            "title": "Genomicus plants: A web resource to study genome evolution in flowering plants",
            "type": "Primary",
            "year": "2015-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:Genomicus-Plants",
        "biotoolsID": "Genomicus-Plants",
        "description": "Genomicus-Plants is a genome browser that enables users to navigate in plants genomes in several dimensions: linearly along chromosome axes, transversaly across different species, and chronologicaly along evolutionary time.",
        "homepage": "https://www.genomicus.biologie.ens.fr/genomicus-plants",
        "name": "Genomicus-plants"
    }
}