{
    "additionDate": "2021-03-19T08:40:19Z",
    "biotoolsCURIE": "biotools:grasp-py",
    "biotoolsID": "grasp-py",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "sabrina@ufv.br",
            "name": "Sabrina de A Silveira",
            "typeEntity": "Person"
        }
    ],
    "description": "A graph-based residue neighborhood strategy to predict binding sites.\n\nThe discovery of protein-ligand-binding sites is a major step for elucidating protein function and for investigating new functional roles. Detecting protein-ligand-binding sites experimentally is time-consuming and expensive.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Ligand-binding site prediction",
                    "uri": "http://edamontology.org/operation_3897"
                },
                {
                    "term": "Protein-protein binding site prediction",
                    "uri": "http://edamontology.org/operation_2464"
                },
                {
                    "term": "Protein property calculation",
                    "uri": "http://edamontology.org/operation_0250"
                }
            ]
        }
    ],
    "homepage": "https://github.com/charles-abreu/GRaSP",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-30T09:11:34Z",
    "name": "GRaSP-py",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA805",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.comMotivation: The discovery of protein-ligand-binding sites is a major step for elucidating protein function and for investigating new functional roles. Detecting protein-ligand-binding sites experimentally is time-consuming and expensive. Thus, a variety of in silico methods to detect and predict binding sites was proposed as they can be scalable, fast and present low cost. Results: We proposed Graph-based Residue neighborhood Strategy to Predict binding sites (GRaSP), a novel residue centric and scalable method to predict ligand-binding site residues. It is based on a supervised learning strategy that models the residue environment as a graph at the atomic level. Results show that GRaSP made compatible or superior predictions when compared with methods described in the literature. GRaSP outperformed six other residue-centric methods, including the one considered as state-of-the-art. Also, our method achieved better results than the method from CAMEO independent assessment. GRaSP ranked second when compared with five state-of-the-art pocket-centric methods, which we consider a significant result, as it was not devised to predict pockets. Finally, our method proved scalable as it took 10-20 s on average to predict the binding site for a protein complex whereas the state-of-the-art residue-centric method takes 2-5 h on average.",
                "authors": [
                    {
                        "name": "Santana C.A."
                    },
                    {
                        "name": "de Silveira S.A."
                    },
                    {
                        "name": "Moraes J.P.A."
                    },
                    {
                        "name": "Izidoro S.C."
                    },
                    {
                        "name": "de Melo-Minardi R.C."
                    },
                    {
                        "name": "Ribeiro A.J.M."
                    },
                    {
                        "name": "Tyzack J.D."
                    },
                    {
                        "name": "Borkakoti N."
                    },
                    {
                        "name": "Thornton J.M."
                    }
                ],
                "citationCount": 1,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "GRaSP: A graph-based residue neighborhood strategy to predict binding sites"
            },
            "pmid": "33381849"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        }
    ]
}