{
    "accessibility": "Open access",
    "additionDate": "2023-01-25T13:54:24.587002Z",
    "biotoolsCURIE": "biotools:ascept",
    "biotoolsID": "ascept",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "kimberly.glass@channing.harvard.edu",
            "name": "Kimberly Glass",
            "orcidid": "https://orcid.org/0000-0003-4394-5779",
            "typeEntity": "Person"
        }
    ],
    "description": "Automated Selection of Changepoints using Empirical P-values and Trimming (ASCEPT), to select an optimal set of changepoints in mobile health data",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/matthewquinn1/changepointSelect",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T15:09:55.903066Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/matthewquinn1/changepointSelect.<h4>Results</h4"
        }
    ],
    "name": "ASCEPT",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/jamiaopen/ooac090",
            "metadata": {
                "abstract": "Objectives: One challenge that arises when analyzing mobile health (mHealth) data is that updates to the proprietary algorithms that process these data can change apparent patterns. Since the timings of these updates are not publicized, an analytic approach is necessary to determine whether changes in mHealth data are due to lifestyle behaviors or algorithmic updates. Existing methods for identifying changepoints do not consider multiple types of changepoints, may require prespecifying the number of changepoints, and often involve nonintuitive parameters. We propose a novel approach, Automated Selection of Changepoints using Empirical P-values and Trimming (ASCEPT), to select an optimal set of changepoints in mHealth data. Materials and Methods: ASCEPT involves 2 stages: (1) identification of a statistically significant set of changepoints from sequential iterations of a changepoint detection algorithm; and (2) trimming changepoints within linear and seasonal trends. ASCEPT is available at https://github.com/matthewquinn1/changepointSelect. Results: We demonstrate ASCEPT's utility using real-world mHealth data collected through the Precision VISSTA study. We also demonstrate that ASCEPT outperforms a comparable method, circular binary segmentation, and illustrate the impact when adjusting for changepoints in downstream analysis. Discussion: ASCEPT offers a practical approach for identifying changepoints in mHealth data that result from algorithmic updates. ASCEPT's only required parameters are a significance level and goodness-of-fit threshold, offering a more intuitive option compared to other approaches. Conclusion: ASCEPT provides an intuitive and useful way to identify which changepoints in mHealth data are likely the result of updates to the underlying algorithms that process the data.",
                "authors": [
                    {
                        "name": "Chung A."
                    },
                    {
                        "name": "Glass K."
                    },
                    {
                        "name": "Quinn M."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "JAMIA Open",
                "title": "Automated selection of changepoints using empirical P-values and trimming"
            },
            "pmcid": "PMC9617685",
            "pmid": "36325307"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Bioengineering",
            "uri": "http://edamontology.org/topic_3398"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        }
    ],
    "validated": 1
}
