{
    "additionDate": "2022-10-07T04:55:37.836308Z",
    "biotoolsCURIE": "biotools:hmrbase",
    "biotoolsID": "hmrbase",
    "credit": [
        {
            "name": "Gajendra P.S. Raghava",
            "url": "https://webs.iiitd.edu.in/raghava/hmrbase/"
        }
    ],
    "description": "A database of hormones and their receptors",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/hmrbase/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "https://webs.iiitd.edu.in/raghava/hmrbase/",
    "lastUpdate": "2022-10-07T04:55:59.827843Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/hmrbase/"
        }
    ],
    "name": "hmrbase",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "raghavagps",
    "publication": [
        {
            "doi": "10.1186/1471-2164-10-307",
            "metadata": {
                "abstract": "BACKGROUND: Hormones are signaling molecules that play vital roles in various life processes, like growth and differentiation, physiology, and reproduction. These molecules are mostly secreted by endocrine glands, and transported to target organs through the bloodstream. Deficient, or excessive, levels of hormones are associated with several diseases such as cancer, osteoporosis, diabetes etc. Thus, it is important to collect and compile information about hormones and their receptors. DESCRIPTION: This manuscript describes a database called Hmrbase which has been developed for managing information about hormones and their receptors. It is a highly curated database for which information has been collected from the literature and the public databases. The current version of Hmrbase contains comprehensive information about approximately 2000 hormones, e.g., about their function, source organism, receptors, mature sequences, structures etc. Hmrbase also contains information about approximately 3000 hormone receptors, in terms of amino acid sequences, subcellular localizations, ligands, and post-translational modifications etc. One of the major features of this database is that it provides data about approximately 4100 hormone-receptor pairs. A number of online tools have been integrated into the database, to provide the facilities like keyword search, structure-based search, mapping of a given peptide(s) on the hormone/receptor sequence, sequence similarity search. This database also provides a number of external links to other resources/databases in order to help in the retrieving of further related information. CONCLUSION: Owing to the high impact of endocrine research in the biomedical sciences, the Hmrbase could become a leading data portal for researchers. The salient features of Hmrbase are hormone-receptor pair-related information, mapping of peptide stretches on the protein sequences of hormones and receptors, Pfam domain annotations, categorical browsing options, online data submission, DrugPedia linkage etc. Hmrbase is available online for public from http://crdd.osdd.net/raghava/hmrbase/.",
                "authors": [
                    {
                        "name": "Kumar M."
                    },
                    {
                        "name": "Raghava G.P."
                    },
                    {
                        "name": "Rashid M."
                    },
                    {
                        "name": "Sharma A."
                    },
                    {
                        "name": "Singla D."
                    }
                ],
                "citationCount": 23,
                "date": "2009-01-01T00:00:00Z",
                "journal": "BMC genomics",
                "title": "Hmrbase: a database of hormones and their receptors."
            },
            "pmcid": "PMC2720991",
            "pmid": "19589147"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ]
}
