{
    "additionDate": "2021-01-18T07:43:51Z",
    "biotoolsCURIE": "biotools:bacav",
    "biotoolsID": "bacav",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hallettm@ninds.nih.gov",
            "name": "Mark Hallett",
            "typeEntity": "Person"
        }
    ],
    "description": "An online platform for clinical back-averaging. The back-average technique is very useful to study the relation between the activity in the cortex and the muscles.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://electrophysiology.shinyapps.io/BacAv/",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-29T20:22:06Z",
    "name": "BacAv",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.CNP.2019.12.001",
            "metadata": {
                "abstract": "© 2020Objective: The back-average technique is very useful to study the relation between the activity in the cortex and the muscles. It has two main clinical applications, Bereitschaftspotential (BP) recording and myoclonus studies. The BP is a slow wave negativity originating in the supplementary motor cortex and premotor cortex that precedes voluntary movements. This wave also precedes involuntary movements in functional movement disorders (FMD), and it can be used as a helpful diagnostic tool. For the myoclonus studies, the back-average technique is very important to help localizing the source of the myoclonus. The hardware needed to do BP or myoclonus studies is standard and available in any electrophysiology lab, but there are not many software solutions to do the analysis. In this article together with describing the methodology that we use for recording clinical BPs and myoclonus, we present BacAv, an online free application that we developed for the purpose of doing back-average analysis. Methods: BacAv was developed in “R” language using Rstudio, a free integrated development environment. The recommended parameters for the data acquisition for BP recording and myoclonus studies are given in this section. Results: The platform was successfully developed, is able to read txt files, look for muscle bursts, segment the data, and plot the average. The parameters of the algorithm that look for the muscle bursts can be adapted according to the characteristics of the dataset. Conclusion: We have developed software for clinicians who do not have sophisticated equipment to do back-averaging. Significance: This tool will make this useful analysis method more available in a clinical environment.",
                "authors": [
                    {
                        "name": "Attaripour S."
                    },
                    {
                        "name": "Hallett M."
                    },
                    {
                        "name": "McGurrin P."
                    },
                    {
                        "name": "Vial F."
                    }
                ],
                "citationCount": 1,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Clinical Neurophysiology Practice",
                "title": "BacAv, a new free online platform for clinical back-averaging"
            },
            "pmcid": "PMC7033354",
            "pmid": "32095660"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Data acquisition",
            "uri": "http://edamontology.org/topic_3077"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ]
}
