{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2022-08-15T10:45:16.076568Z",
    "biotoolsCURIE": "biotools:datacleanr",
    "biotoolsID": "datacleanr",
    "confidence_flag": "tool",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "hurley@gfz-potsdam.de",
            "name": "Alexander G. Hurley",
            "orcidid": "https://orcid.org/0000-0002-9641-2805",
            "typeEntity": "Person"
        },
        {
            "name": "Ingo Heinrich"
        }
    ],
    "description": "datacleanr is a flexible and efficient tool for interactive data cleaning, and is inherently interoperable, as it seamlessly integrates into reproducible data analyses pipelines in R.",
    "documentation": [
        {
            "type": [
                "Code of conduct"
            ],
            "url": "https://github.com/the-Hull/datacleanr/blob/master/.github/CODE_OF_CONDUCT.md"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://www.github.com/the-hull/datacleanr",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-08-15T10:45:42.620429Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://cran.r-project.org/web/packages/datacleanr/index.html"
        }
    ],
    "name": "datacleanr",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0268426",
            "metadata": {
                "abstract": "Copyright: © 2022 Hurley et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Ecological research, just as all Earth System Sciences, is becoming increasingly data-rich. Tools for processing of “big data” are continuously developed to meet corresponding technical and logistical challenges. However, even at smaller scales, data sets may be challenging when best practices in data exploration, quality control and reproducibility are to be met. This can occur when conventional methods, such as generating and assessing diagnostic visualizations or tables, become unfeasible due to time and practicality constraints. Interactive processing can alleviate this issue, and is increasingly utilized to ensure that large data sets are diligently handled. However, recent interactive tools rarely enable data manipulation, may not generate reproducible outputs, or are typically data/domain-specific. We developed datacleanr, an interactive tool that facilitates best practices in data exploration, quality control (e.g., outlier assessment) and flexible processing for multiple tabular data types, including time series and georeferenced data. The package is open-source, and based on the R programming language. A key functionality of datacleanr is the “reproducible recipe”—a translation of all interactive actions into R code, which can be integrated into existing analyses pipelines. This enables researchers experienced with script-based workflows to utilize the strengths of interactive processing without sacrificing their usual work style or functionalities from other (R) packages. We demonstrate the package’s utility by addressing two common issues during data analyses, namely 1) identifying problematic structures and artefacts in hierarchically nested data, and 2) preventing excessive loss of data from ‘coarse,’ code-based filtering of time series. Ultimately, with datacleanr we aim to improve researchers’ workflows and increase confidence in and reproducibility of their results.",
                "authors": [
                    {
                        "name": "Heinrich I."
                    },
                    {
                        "name": "Hurley A.G."
                    },
                    {
                        "name": "Pappas C."
                    },
                    {
                        "name": "Peters R.L."
                    },
                    {
                        "name": "Steger D.N."
                    }
                ],
                "date": "2022-05-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Addressing the need for interactive, efficient, and reproducible data processing in ecology with the datacleanr R package"
            },
            "pmcid": "PMC9098071",
            "pmid": "35551557"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Data quality management",
            "uri": "http://edamontology.org/topic_3572"
        },
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
