{
    "additionDate": "2020-01-14T19:33:50Z",
    "biotoolsCURIE": "biotools:PAGE-Net",
    "biotoolsID": "PAGE-Net",
    "confidence_flag": "tool",
    "description": "Interpretable and Integrative Deep Learning for Survival Analysis Using Histopathological Images and Genomic Data.\n\nA biologically interpretable integrative deep learning model that integrates PAthological images and GEnomic data.\n\nPAGE_net_pretrain : code for pretraining and saving the pretrained model.\n\nIntegration of aggregated pathological images and genomic data",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "homepage": "https://github.com/DataX-JieHao/PAGE-Net",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-04T15:02:39Z",
    "name": "PAGE-Net",
    "owner": "Pub2Tools",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2019 The Authors.The integration of multi-modal data, such as histopathological images and genomic data, is essential for understanding cancer heterogeneity and complexity for personalized treatments, as well as for enhancing survival predictions in cancer study. Histopathology, as a clinical gold-standard tool for diagnosis and prognosis in cancers, allows clinicians to make precise decisions on therapies, whereas high-Throughput genomic data have been investigated to dissect the genetic mechanisms of cancers. We propose a biologically interpretable deep learning model (PAGE-Net) that integrates histopathological images and genomic data, not only to improve survival prediction, but also to identify genetic and histopathological patterns that cause different survival rates in patients. PAGE-Net consists of pathology/genome/demography-specific layers, each of which provides comprehensive biological interpretation. In particular, we propose a novel patch-wise texturebased convolutional neural network, with a patch aggregation strategy, to extract global survival-discriminative features, without manual annotation for the pathology-specific layers. We adapted the pathway-based sparse deep neural network, named Cox-PASNet, for the genome-specific layers. The proposed deep learning model was assessed with the histopathological images and the gene expression data of Glioblastoma Multiforme (GBM) at The Cancer Genome Atlas (TCGA) and The Cancer Imaging Archive (TCIA). PAGENet achieved a C-index of 0.702, which is higher than the results achieved with only histopathological images (0.509) and Cox-PASNet (0.640). More importantly, PAGE-Net can simultaneously identify histopathological and genomic prognostic factors associated with patients survivals. The source code of PAGE-Net is publicly available at https: //github.com/DataX-JieHao/PAGE-Net.",
                "authors": [
                    {
                        "name": "Hao J."
                    },
                    {
                        "name": "Kang M."
                    },
                    {
                        "name": "Kosaraju S.C."
                    },
                    {
                        "name": "Song D.H."
                    },
                    {
                        "name": "Tsaku N.Z."
                    }
                ],
                "citationCount": 4,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Pacific Symposium on Biocomputing",
                "title": "PAGE-Net: Interpretable and integrative deep learning for survival analysis using histopathological images and genomic data"
            },
            "pmid": "31797610"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}
