{
    "additionDate": "2017-08-03T18:55:37Z",
    "biotoolsCURIE": "biotools:phenofam",
    "biotoolsID": "phenofam",
    "credit": [
        {
            "email": "buchholz@mpi-cbg.de",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Perform gene set enrichment analysis by employing structural and functional information on families of protein domains as annotation terms. The tool is designed to analyse complete sets of results from quantitative high-throughput studies (gene expression microarrays, functional RNAi screens, etc.) without prior pre-filtering or hits-selection steps.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://sourceforge.net/p/phenofam/wiki/Home/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                }
            ]
        }
    ],
    "homepage": "http://sourceforge.net/projects/phenofam/",
    "language": [
        "Java",
        "SQL"
    ],
    "lastUpdate": "2018-12-10T12:58:55Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/phenofam-gene-set-enrichment-analysis-protein-domain-context.html"
        }
    ],
    "name": "PhenoFam",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: With the current technological advances in high-throughput biology, the necessity to develop tools that help to analyse the massive amount of data being generated is evident. A powerful method of inspecting large-scale data sets is gene set enrichment analysis (GSEA) and investigation of protein structural features can guide determining the function of individual genes. However, a convenient tool that combines these two features to aid in high-throughput data analysis has not been developed yet. In order to fill this niche, we developed the user-friendly, web-based application, PhenoFam.Results: PhenoFam performs gene set enrichment analysis by employing structural and functional information on families of protein domains as annotation terms. Our tool is designed to analyse complete sets of results from quantitative high-throughput studies (gene expression microarrays, functional RNAi screens, etc.) without prior pre-filtering or hits-selection steps. PhenoFam utilizes Ensembl databases to link a list of user-provided identifiers with protein features from the InterPro database, and assesses whether results associated with individual domains differ significantly from the overall population. To demonstrate the utility of PhenoFam we analysed a genome-wide RNA interference screen and discovered a novel function of plexins containing the cytoplasmic RasGAP domain. Furthermore, a PhenoFam analysis of breast cancer gene expression profiles revealed a link between breast carcinoma and altered expression of PX domain containing proteins.Conclusions: PhenoFam provides a user-friendly, easily accessible web interface to perform GSEA based on high-throughput data sets and structural-functional protein information, and therefore aids in functional annotation of genes. © 2010 Paszkowski-Rogacz et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Paszkowski-Rogacz M."
                    },
                    {
                        "name": "Slabicki M."
                    },
                    {
                        "name": "Pisabarro M.T."
                    },
                    {
                        "name": "Buchholz F."
                    }
                ],
                "citationCount": 3,
                "date": "2010-05-17T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "PhenoFam-gene set enrichment analysis through protein structural information"
            },
            "pmid": "20478033"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}