{
    "additionDate": "2018-06-20T16:00:07Z",
    "biotoolsCURIE": "biotools:cgmaptools",
    "biotoolsID": "cgmaptools",
    "credit": [
        {
            "email": "guoweilong@cau.edu.cn",
            "name": "Weilong Guo",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Precision of heterozygous SNV calls and supports allele-specific methylation detection and visualization in bisulfite-sequencing data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://cgmaptools.github.io/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://cgmaptools.github.io/",
    "lastUpdate": "2024-11-25T14:43:04.830864Z",
    "name": "CGmapTools",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btx595",
            "metadata": {
                "abstract": "Motivation DNA methylation is important for gene silencing and imprinting in both plants and animals. Recent advances in bisulfite sequencing allow detection of single nucleotide variations (SNVs) achieving high sensitivity, but accurately identifying heterozygous SNVs from partially C-To-T converted sequences remains challenging. Results We designed two methods, BayesWC and BinomWC, that substantially improved the precision of heterozygous SNV calls from â 1/480% to 99% while retaining comparable recalls. With these SNV calls, we provided functions for allele-specific DNA methylation (ASM) analysis and visualizing the methylation status on reads. Applying ASM analysis to a previous dataset, we found that an average of 1.5% of investigated regions showed allelic methylation, which were significantly enriched in transposon elements and likely to be shared by the same cell-Type. A dynamic fragment strategy was utilized for DMR analysis in low-coverage data and was able to find differentially methylated regions (DMRs) related to key genes involved in tumorigenesis using a public cancer dataset. Finally, we integrated 40 applications into the software package CGmapTools to analyze DNA methylomes. This package uses CGmap as the format interface, and designs binary formats to reduce the file size and support fast data retrieval, and can be applied for context-wise, gene-wise, bin-wise, region-wise and sample-wise analyses and visualizations.",
                "authors": [
                    {
                        "name": "Guo W."
                    },
                    {
                        "name": "Ni Z."
                    },
                    {
                        "name": "Pellegrini M."
                    },
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Zhang M.Q."
                    },
                    {
                        "name": "Zhu P."
                    }
                ],
                "citationCount": 113,
                "date": "2018-02-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "CGmapTools improves the precision of heterozygous SNV calls and supports allele-specific methylation detection and visualization in bisulfite-sequencing data"
            },
            "pmcid": "PMC6454434",
            "pmid": "28968643"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Methylated DNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3674"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1,
    "version": [
        "0.0.6"
    ]
}
