{
    "accessibility": "Open access",
    "additionDate": "2022-06-30T14:29:18.106948Z",
    "biotoolsCURIE": "biotools:sam_interaction_predictor",
    "biotoolsID": "sam_interaction_predictor",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "wajidarshad@ajku.edu.pk",
            "name": "Wajid Arshad Abbasi"
        },
        {
            "name": "Kinza Arshad"
        },
        {
            "name": "Syeda Adin Ajaz"
        }
    ],
    "description": "A computational prediction of S-Adenosyl methionine (SAM) interacting proteins and their interaction sites through primary structures.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Sequence feature detection",
                    "uri": "http://edamontology.org/operation_0253"
                }
            ]
        }
    ],
    "homepage": "https://sites.google.com/view/wajidarshad/software",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-06-30T14:29:18.109663Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/wajidarshad/SIP"
        }
    ],
    "name": "SIP",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.COMPBIOLCHEM.2022.107662",
            "metadata": {
                "abstract": "© 2022 Elsevier LtdS-Adenosyl methionine (SAM), a universal methyl group donor, plays a vital role in biosynthesis and acts as an inhibitor to many enzymes. Due to protein interaction-dependent biological role, SAM has become a favorite target in various therapeutical and clinical studies such as treating cancer, Alzheimer's, epilepsy, and neurological disorders. Therefore, the identification of the SAM interacting proteins and their interaction sites is a biologically significant problem. However, wet-lab techniques, though accurate, to identify SAM interactions and interaction sites are tedious and costly. Therefore, efficient and accurate computational methods for this purpose are vital to the design and assist such wet-lab experiments. In this study, we present machine learning-based models to predict SAM interacting proteins and their interaction sites by using only primary structures of proteins. Here we modeled SAM interaction prediction through whole protein sequence features along with different classifiers. Whereas, we modeled SAM interaction site prediction through overlapping sequence windows and ranking with multiple instance learning that allows handling imprecisely annotated SAM interaction sites. Through a series of simulation studies along with biological significant evaluation, we showed that our proposed models give a state-of-the-art performance for both SAM interaction and interaction site prediction. Through data mining in this study, we have also identified various characteristics of amino acid sub-sequences and their relative position to effectively locate interaction sites in a SAM interacting protein. Python code for training and evaluating our proposed models together with a webserver implementation as SIP (Sam Interaction Predictor) is available at the URL: https://sites.google.com/view/wajidarshad/software.",
                "authors": [
                    {
                        "name": "Abbas S.A."
                    },
                    {
                        "name": "Abbasi W.A."
                    },
                    {
                        "name": "Ajaz S.A."
                    },
                    {
                        "name": "Andleeb S."
                    },
                    {
                        "name": "Arshad K."
                    },
                    {
                        "name": "Bibi M."
                    },
                    {
                        "name": "Liaqat S."
                    }
                ],
                "date": "2022-06-01T00:00:00Z",
                "journal": "Computational Biology and Chemistry",
                "title": "SIP: A computational prediction of S-Adenosyl methionine (SAM) interacting proteins and their interaction sites through primary structures"
            },
            "pmid": "35288360"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
