{
    "additionDate": "2018-05-16T16:48:14Z",
    "biotoolsCURIE": "biotools:bitpai",
    "biotoolsID": "bitpai",
    "credit": [
        {
            "email": "jloving@bu.edu",
            "name": "Joshua Loving",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "yhernand@bu.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "gbenson@bu.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A bit-parallel algorithm for general, integer-scoring global alignment. Integer-scoring schemes assign integer weights for match, mismatch and insertion/deletion. This method uses structural properties in the relationship between adjacent scores in the scoring matrix to construct classes of efficient algorithms, each designed for a particular set of weights.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://lobstah.bu.edu/cgi-bin/BitPAl/help.py"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Global alignment",
                    "uri": "http://edamontology.org/operation_0496"
                }
            ]
        }
    ],
    "homepage": "http://lobstah.bu.edu/cgi-bin/BitPAl/index.cgi",
    "language": [
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "BitPAI",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btu507",
            "metadata": {
                "abstract": "© The Author 2014. Published by Oxford University Press.Motivation: Mapping of high-throughput sequencing data and other bulk sequence comparison applications have motivated a search for high-efficiency sequence alignment algorithms. The bit-parallel approach represents individual cells in an alignment scoring matrix as bits in computer words and emulates the calculation of scores by a series of logic operations composed of AND, OR, XOR, complement, shift and addition. Bit-parallelism has been successfully applied to the longest common subsequence (LCS) and edit-distance problems, producing fast algorithms in practice.Results: We have developed BitPAl, a bit-parallel algorithm for general, integer-scoring global alignment. Integer-scoring schemes assign integer weights for match, mismatch and insertion/deletion. The BitPAl method uses structural properties in the relationship between adjacent scores in the scoring matrix to construct classes of efficient algorithms, each designed for a particular set of weights. In timed tests, we show that BitPAl runs 7-25 times faster than a standard iterative algorithm.",
                "authors": [
                    {
                        "name": "Loving J."
                    },
                    {
                        "name": "Hernandez Y."
                    },
                    {
                        "name": "Benson G."
                    }
                ],
                "citationCount": 14,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "BitPAl: A bit-parallel, general integer-scoring sequence alignment algorithm"
            },
            "pmcid": "PMC4221118",
            "pmid": "25075119"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}