{
    "additionDate": "2017-08-03T18:50:27Z",
    "biotoolsCURIE": "biotools:my-closure",
    "biotoolsID": "my-closure",
    "credit": [
        {
            "email": "q.wu@uea.ac.uk",
            "name": "Qiong Wu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.uea.ac.uk/computing/the-uea-computational-biology-laboratory"
        }
    ],
    "description": "Java program for computing a phylogenetic network from a collection of phylogenetic trees.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.uea.ac.uk/documents/429378/432070/MY-CLOSURE+manual.pdf/dd1a2ead-4e94-4abb-bf8d-5190d96710c6"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree generation",
                    "uri": "http://edamontology.org/operation_0323"
                }
            ]
        }
    ],
    "homepage": "http://www.uea.ac.uk/computing/my-closure",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/my-closure-1-0-computing-phylogenetic-network-collection-phylogenetic-trees.html"
        }
    ],
    "name": "MY-CLOSURE",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "A contemporary and fundamental problem faced by many evolutionary biologists is how to puzzle together a collection P of partial trees (leaf-labeled trees whose leaves are bijectively labeled by species or, more generally, taxa, each supported by, e.g., a gene) into an overall parental structure that displays all trees in P. This already difficult problem is complicated by the fact that the trees in P regularly support conflicting phylogenetic relationships and are not on the same but only overlapping taxa sets. A desirable requirement on the sought after parental structure, therefore, is that it can accommodate the observed conflicts. Phylogenetic networks are a popular tool capable of doing precisely this. However, not much is known about how to construct such networks from partial trees, a notable exception being the Z-closure super-network approach, which is based on the Z-closure rule, and the Q-imputation approach. Although attractive approaches, they both suffer from the fact that the generated networks tend to be multidimensional making it necessary to apply some kind of filter to reduce their complexity. To avoid having to resort to a filter, we follow a different line of attack in this paper and develop closure rules for generating circular phylogenetic networks which have the attractive property that they can be represented in the plane. In particular, we introduce the novel Y-(closure) rule and show that this rule on its own or in combination with one of Meacham's closure rules (which we call the M-rule) has some very desirable theoretical properties. In addition, we present a case study based on Rivera et al. \"ring of life\" to explore the reconstructive power of the M- and Y-rule and also reanalyze an Arabidopsis thaliana data set. © 2008 Society for Mathematical Biology.",
                "authors": [
                    {
                        "name": "Grunewald S."
                    },
                    {
                        "name": "Huber K.T."
                    },
                    {
                        "name": "Wu Q."
                    }
                ],
                "citationCount": 3,
                "date": "2008-10-01T00:00:00Z",
                "journal": "Bulletin of Mathematical Biology",
                "title": "Two novel closure rules for constructing phylogenetic super-networks"
            },
            "pmid": "18665426"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        }
    ],
    "validated": 1
}