{
    "accessibility": "Open access",
    "additionDate": "2021-10-27T19:19:30.924029Z",
    "biotoolsCURIE": "biotools:pinir",
    "biotoolsID": "pinir",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ap.giri@ncl.res.in",
            "name": "Ashok P. Giri",
            "orcidid": "https://orcid.org/0000-0002-5309-259X",
            "typeEntity": "Person"
        },
        {
            "name": "Nikhilesh K. Yadav"
        },
        {
            "name": "Nidhi S. Saikhedkar"
        }
    ],
    "description": "A comprehensive information resource for Pin-II type protease inhibitors.",
    "download": [
        {
            "type": "Downloads page",
            "url": "https://pinir.ncl.res.in/Download"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Disulfide bond prediction",
                    "uri": "http://edamontology.org/operation_0471"
                },
                {
                    "term": "Protein cysteine and disulfide bond assignment",
                    "uri": "http://edamontology.org/operation_1850"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "https://pinir.ncl.res.in",
    "lastUpdate": "2021-10-27T19:21:54.994342Z",
    "name": "PINIR",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S12870-021-03027-0",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Serine protease inhibitors belonging to the Potato type-II Inhibitor family Protease Inhibitors (Pin-II type PIs) are essential plant defense molecules. They are characterized by multiple inhibitory repeat domains, conserved disulfide bond pattern, and a tripeptide reactive center loop. These features of Pin-II type PIs make them potential molecules for protein engineering and designing inhibitors for agricultural and therapeutic applications. However, the diversity in these PIs remains unexplored due to the lack of annotated protein sequences and their functional attributes in the available databases. Results: We have developed a database, PINIR (Pin-II type PIs Information Resource), by systematic collection and manual annotation of 415 Pin-II type PI protein sequences. For each PI, the number and position for signature sequences are specified: 695 domains, 75 linkers, 63 reactive center loops, and 10 disulfide bond patterns are identified and mapped. Database analysis revealed novel subcategories of PIs, species-correlated occurrence of inhibitory domains, reactive center loops, and disulfide bond patterns. By analyzing linker regions, we predict that alternative processing at linker regions could generate PI variants in the Solanaceae family. Conclusion: PINIR (https://pinir.ncl.res.in) provides a web interface for browsing and analyzing the protein sequences of Pin-II type PIs. Information about signature sequences, spatio-temporal expression, biochemical properties, gene sequences, and literature references are provided. Analysis of PINIR depicts conserved species-specific features of Pin-II type PI protein sequences. Diversity in the sequence of inhibitory domains and reactive loops directs potential applications to engineer Pin-II type PIs. The PINIR database will serve as a comprehensive information resource for further research into Pin-II type PIs.",
                "authors": [
                    {
                        "name": "Yadav N.K."
                    },
                    {
                        "name": "Saikhedkar N.S."
                    },
                    {
                        "name": "Giri A.P."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Plant Biology",
                "title": "PINIR: a comprehensive information resource for Pin-II type protease inhibitors"
            },
            "pmcid": "PMC8188708",
            "pmid": "34107869"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}