{"credit":[{"name":"Marko Vendelin","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://sysbio.ioc.ee/"}],"documentation":[{"type":"GENERAL","url":"https://sysbio.ioc.ee/download/software/iocbio/index.html"}],"function":[{"operation":[{"term":"Service management","uri":"http://edamontology.org/operation_3760"}]}],"labels":{"language":["Python"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Database portal"],"topic":[{"term":"Biology","uri":"http://edamontology.org/topic_3070"},{"term":"Systems biology","uri":"http://edamontology.org/topic_2259"},{"term":"Software engineering","uri":"http://edamontology.org/topic_3372"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/iocbio-1-2-2-open-source-software-laboratory-systems-biology.html"}],"publication":[{"abstract":"Although confocal microscopes have considerably smaller contribution of out-of-focus light than widefield microscopes, the confocal images can still be enhanced mathematically if the optical and data acquisition effects are accounted for. For that, several deconvolution algorithms have been proposed. As a practical solution, maximum-likelihood algorithms with regularization have been used. However, the choice of regularization parameters is often unknown although it has considerable effect on the result of deconvolution process. The aims of this work were: to find good estimates of deconvolution parameters; and to develop an open source software package that would allow testing different deconvolution algorithms and that would be easy to use in practice. Here, Richardson-Lucy algorithm has been implemented together with the total variation regularization in an open source software package IOCBio Microscope. The influence of total variation regularization on deconvolution process is determined by one parameter. We derived a formula to estimate this regularization parameter automatically from the images as the algorithm progresses. To assess the effectiveness of this algorithm, synthetic images were composed on the basis of confocal images of rat cardiomyocytes. From the analysis of deconvolved results, we have determined under which conditions our estimation of total variation regularization parameter gives good results. The estimated total variation regularization parameter can be monitored during deconvolution process and used as a stopping criterion. An inverse relation between the optimal regularization parameter and the peak signal-to-noise ratio of an image is shown. Finally, we demonstrate the use of the developed software by deconvolving images of rat cardiomyocytes with stained mitochondria and sarcolemma obtained by confocal and widefield microscopes. © 2011 The Authors, Journal of Microscopy © 2011 Royal Microscopical Society.","authors":["Laasmaa M.","Vendelin M.","Peterson P."],"cit_count":34,"journal":"Journal of Microscopy","pmid":"21323670","title":"Application of regularized Richardson-Lucy algorithm for deconvolution of confocal microscopy images","year":"2011-08-01"}],"summary":{"biotoolsCURIE":"biotools:iocbio","biotoolsID":"iocbio","description":"This project provides open-source software that is developed in Laboratory of Systems Biology at Institute of Cybernetics. The project is created to publish the software, this includes distributing the source codes, continuing software development, supporting users as well as attracting users to contribute to the software.","homepage":"https://github.com/pearu/iocbio","name":"IOCBio"}}