{"credit":[{"email":"alida.palmisano@gmail.com","name":"Alida Palmisano","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://copasi.org/Projects/JigCell_Run_Manager_2_0//"}],"function":[{"operation":[{"term":"Metabolic network modelling","uri":"http://edamontology.org/operation_3660"}]}],"labels":{"language":["Java"],"license":"Artistic-2.0","operatingSystem":["Linux","Windows","Mac"],"toolType":["Desktop application"],"topic":[{"term":"Biochemistry","uri":"http://edamontology.org/topic_3292"},{"term":"Systems biology","uri":"http://edamontology.org/topic_2259"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"}]},"publication":[{"abstract":"© 2015 Palmisano et al. Background: Most biomolecular reaction modeling tools allow users to build models with a single list of parameter values. However, a common scenario involves different parameterizations of the model to account for the results of related experiments, for example, to define the phenotypes for a variety of mutations (gene knockout, over expression, etc.) of a specific biochemical network. This scenario is not well supported by existing model editors, forcing the user to manually generate, store, and maintain many variations of the same model. Results: We developed an extension to our modeling editor called the JigCell Run Manager (JC-RM). JC-RM allows the modeler to define a hierarchy of parameter values, simulations, and plot settings, and to save them together with the initial model. JC-RM supports generation of simulation plots, as well as export to COPASI and SBML (L3V1) for further analysis. Conclusions: Developing a model with its initial list of parameter values is just the first step in modeling a biological system. Models are often parameterized in many different ways to account for mutations of the organism and/or for sets of related experiments performed on the organism. JC-RM offers two critical features: it supports the everyday management of a large model, complete with its parameterizations, and it facilitates sharing this information before and after publication. JC-RM allows the modeler to define a hierarchy of parameter values, simulation, and plot settings, and to maintain a relationship between this hierarchy and the initial model. JC-RM is implemented in Java and uses the COPASI API. JC-RM runs on all major operating systems, with minimal system requirements. Installers, source code, user manual, and examples can be found at the COPASI website (http://www.copasi.org/Projects).","authors":["Palmisano A.","Hoops S.","Watson L.T.","Jones T.C.","Tyson J.J.","Shaffer C.A."],"cit_count":2,"doi":"10.1186/s12918-015-0237-0","journal":"BMC Systems Biology","title":"JigCell Run Manager (JC-RM): A tool for managing large sets of biochemical model parametrizations","year":"2015-12-24"}],"summary":{"biotoolsCURIE":"biotools:jigcell_run_manager","biotoolsID":"jigcell_run_manager","description":"Tool for managing large sets of biochemical model parametrizations.","homepage":"http://copasi.org/Projects/JigCell_Run_Manager_2_0//","name":"JigCell Run Manager"}}