{"credit":[],"function":[{"operation":[{"term":"Quantification","uri":"http://edamontology.org/operation_3799"},{"term":"Image analysis","uri":"http://edamontology.org/operation_3443"},{"term":"Image annotation","uri":"http://edamontology.org/operation_3553"}]}],"labels":{"topic":[{"term":"Imaging","uri":"http://edamontology.org/topic_3382"},{"term":"Pathology","uri":"http://edamontology.org/topic_0634"},{"term":"Surgery","uri":"http://edamontology.org/topic_3421"},{"term":"Machine learning","uri":"http://edamontology.org/topic_3474"},{"term":"Biomarkers","uri":"http://edamontology.org/topic_3360"}]},"link":[{"type":"OTHER","url":"http://bioimlab.dei.unipd.it/Corneal%20Nerve%20Data%20Set.htm"}],"publication":[{"abstract":"© 2019, The Author(s).Aims/hypothesis: Corneal confocal microscopy is a rapid non-invasive ophthalmic imaging technique that identifies peripheral and central neurodegenerative disease. Quantification of corneal sub-basal nerve plexus morphology, however, requires either time-consuming manual annotation or a less-sensitive automated image analysis approach. We aimed to develop and validate an artificial intelligence-based, deep learning algorithm for the quantification of nerve fibre properties relevant to the diagnosis of diabetic neuropathy and to compare it with a validated automated analysis program, ACCMetrics. Methods: Our deep learning algorithm, which employs a convolutional neural network with data augmentation, was developed for the automated quantification of the corneal sub-basal nerve plexus for the diagnosis of diabetic neuropathy. The algorithm was trained using a high-end graphics processor unit on 1698 corneal confocal microscopy images; for external validation, it was further tested on 2137 images. The algorithm was developed to identify total nerve fibre length, branch points, tail points, number and length of nerve segments, and fractal numbers. Sensitivity analyses were undertaken to determine the AUC for ACCMetrics and our algorithm for the diagnosis of diabetic neuropathy. Results: The intraclass correlation coefficients for our algorithm were superior to those for ACCMetrics for total corneal nerve fibre length (0.933 vs 0.825), mean length per segment (0.656 vs 0.325), number of branch points (0.891 vs 0.570), number of tail points (0.623 vs 0.257), number of nerve segments (0.878 vs 0.504) and fractals (0.927 vs 0.758). In addition, our proposed algorithm achieved an AUC of 0.83, specificity of 0.87 and sensitivity of 0.68 for the classification of participants without (n = 90) and with (n = 132) neuropathy (defined by the Toronto criteria). Conclusions/interpretation: These results demonstrated that our deep learning algorithm provides rapid and excellent localisation performance for the quantification of corneal nerve biomarkers. This model has potential for adoption into clinical screening programmes for diabetic neuropathy. Data availability: The publicly shared cornea nerve dataset (dataset 1) is available at http://bioimlab.dei.unipd.it/Corneal%20Nerve%20Tortuosity%20Data%20Set.htm and http://bioimlab.dei.unipd.it/Corneal%20Nerve%20Data%20Set.htm.","authors":["Williams B.M.","Borroni D.","Liu R.","Zhao Y.","Zhang J.","Lim J.","Ma B.","Romano V.","Qi H.","Ferdousi M.","Petropoulos I.N.","Ponirakis G.","Kaye S.","Malik R.A.","Alam U.","Zheng Y."],"cit_count":0,"doi":"10.1007/S00125-019-05023-4","journal":"Diabetologia","pmid":"31720728","title":"An artificial intelligence-based deep learning algorithm for the diagnosis of diabetic neuropathy using corneal confocal microscopy: a development and validation study","year":"2019-01-01"}],"summary":{"biotoolsCURIE":"biotools:corneal","biotoolsID":"corneal","description":"An artificial intelligence-based deep learning algorithm for the diagnosis of diabetic neuropathy using corneal confocal microscopy.\n\nLaboratory of Biomedical Imaging.\n\nThe Laboratory of Biomedical Imaging (BioImLab) is part of the Department of Information Engineering (DEI) of the University of Padova, Italy. BioImLab is involved in the research of novel techniques for biomedical image processing and analysis and in the development of diagnostic tools related to this field.\n\nCorneal Nerve Tortuosity Data Set.\n\nCorneal Nerve Images [.zip] [size: 3.59MB].\n\nDepartment of Information Engineering , University of Padova - Italy.\n\nAcquisition instrument: Heidelberg Retina Tomograph II with Rostock Corneal Module (HRTII32-RCM) confocal laser microscope (Heidelberg Engineering GmbH, Heidelberg, Germany).\n\nF Scarpa, E.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'HYPOTHESIS:Corneal', 'ACCMetrics', 'corneal nerve', 'INTERPRETATION:These'","homepage":"http://bioimlab.dei.unipd.it/Corneal%20Nerve%20Tortuosity%20Data%20Set.htm","name":"corneal"}}