{
    "accessibility": "Open access",
    "additionDate": "2023-08-08T14:14:43.615721Z",
    "biotoolsCURIE": "biotools:dbgapcheckup",
    "biotoolsID": "dbgapcheckup",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "law145@pitt.edu",
            "name": "Lacey W. Heinsberg",
            "orcidid": "https://orcid.org/0000-0002-7690-5485",
            "typeEntity": "Person"
        },
        {
            "name": "Daniel E. Weeks",
            "orcidid": "https://orcid.org/0000-0001-9410-7228",
            "typeEntity": "Person"
        }
    ],
    "description": "Contains functions that check for formatting of the Subject Phenotype data set and data dictionary as specified by the National Center for Biotechnology Information (NCBI) Database of Genotypes and Phenotypes (dbGaP).",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://cran.r-project.org/web/packages/dbGaPCheckup/dbGaPCheckup.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/dbGaPCheckup/",
    "language": [
        "R"
    ],
    "lastUpdate": "2023-08-08T14:14:43.618475Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://lwheinsberg.github.io/dbGaPCheckup/index.html"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/lwheinsberg/dbGaPCheckup"
        }
    ],
    "name": "dbGaPCheckup",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-023-05200-8",
            "metadata": {
                "abstract": "Background: Data archiving and distribution are essential to scientific rigor and reproducibility of research. The National Center for Biotechnology Information’s Database of Genotypes and Phenotypes (dbGaP) is a public repository for scientific data sharing. To support curation of thousands of complex data sets, dbGaP has detailed submission instructions that investigators must follow when archiving their data. Results: We developed dbGaPCheckup, an R package which implements a series of check, awareness, reporting, and utility functions to support data integrity and proper formatting of the subject phenotype data set and data dictionary prior to dbGaP submission. For example, as a tool, dbGaPCheckup ensures that the data dictionary contains all fields required by dbGaP, and additional fields required by dbGaPCheckup; the number and names of variables match between the data set and data dictionary; there are no duplicated variable names or descriptions; observed data values are not more extreme than the logical minimum and maximum values stated in the data dictionary; and more. The package also includes functions that implement a series of minor/scalable fixes when errors are detected (e.g., a function to reorder the variables in the data dictionary to match the order listed in the data set). Finally, we also include reporting functions that produce graphical and textual descriptives of the data to further reduce the likelihood of data integrity issues. The dbGaPCheckup R package is available on CRAN (https://CRAN.R-project.org/package=dbGaPCheckup) and developed on GitHub (https://github.com/lwheinsberg/dbGaPCheckup). Conclusion: dbGaPCheckup is an innovative assistive and timesaving tool that fills an important gap for researchers by making dbGaP submission of large and complex data sets less error prone.",
                "authors": [
                    {
                        "name": "Heinsberg L.W."
                    },
                    {
                        "name": "Weeks D.E."
                    }
                ],
                "date": "2023-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "dbGaPCheckup: pre-submission checks of dbGaP-formatted subject phenotype files"
            },
            "pmcid": "PMC9985192",
            "pmid": "36869285"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biological databases",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Biotechnology",
            "uri": "http://edamontology.org/topic_3297"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ]
}
