{
    "accessibility": "Open access",
    "additionDate": "2022-03-28T07:02:13.794625Z",
    "biotoolsCURIE": "biotools:abcpred-inhibit",
    "biotoolsID": "abcpred-inhibit",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "chanin.nan@mahidol.edu",
            "name": "Chanin Nantasenamat",
            "orcidid": "https://orcid.org/0000-0003-1040-663X",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "ABCpred is a webserver for the discovery of acetyl- and butyryl-cholinesterase inhibitors.",
    "editPermission": {
        "authors": [
            "baile"
        ],
        "type": "group"
    },
    "homepage": "http://codes.bio/abcpred/",
    "lastUpdate": "2023-04-06T09:54:17.905213Z",
    "name": "ABCpred",
    "owner": "baile",
    "publication": [
        {
            "doi": "10.1007/S11030-021-10292-6",
            "metadata": {
                "abstract": "© 2021, The Author(s), under exclusive licence to Springer Nature Switzerland AG.Abstract: Alzheimer’s disease (AD) is one of the most common forms of dementia and is associated with a decline in cognitive function and language ability. The deficiency of the cholinergic neurotransmitter known as acetylcholine (ACh) is associated with AD. Acetylcholinesterase (AChE) hydrolyses ACh and inhibits the cholinergic transmission. Furthermore, both AChE and butyrylcholinesterase (BChE) plays important roles in early and late stages of AD. Therefore, the inhibition of either or both cholinesterase enzymes represent a promising therapeutic route for treating AD. In this study, a large-scale classification structure–activity relationship model was developed to predict cholinesterase inhibitory activities as well as revealing important substructures governing their activities. Herein, a non-redundant dataset constituting 985 and 1056 compounds for AChE and BChE, respectively, was obtained from the ChEMBL database. These inhibitors were described by 12 sets of molecular fingerprints and predictive models were developed using the random forest algorithm. Evaluation of the model performance by means of Matthews correlation coefficient and consideration of the model’s interpretability indicated that the SubstructureCount fingerprint was the most robust with five-fold cross-validated MCC of [0.76, 0.82] for AChE and BChE, respectively, and test MCC of [0.73, 0.97]. Feature interpretation revealed that the aromatic ring system, heterocyclic nitrogen containing compounds and amines are important for cholinesterase inhibition. Finally, the model was deployed as a publicly available webserver called the ABCpred at http://codes.bio/abcpred/. Graphic abstract: [Figure not available: see fulltext.].",
                "authors": [
                    {
                        "name": "Malik A.A."
                    },
                    {
                        "name": "Nantasenamat C."
                    },
                    {
                        "name": "Ojha S.C."
                    },
                    {
                        "name": "Schaduangrat N."
                    }
                ],
                "date": "2022-02-01T00:00:00Z",
                "journal": "Molecular Diversity",
                "title": "ABCpred: a webserver for the discovery of acetyl- and butyryl-cholinesterase inhibitors"
            },
            "pmid": "34609711",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
