{
    "additionDate": "2021-01-18T10:04:12Z",
    "biotoolsCURIE": "biotools:leafmachine",
    "biotoolsID": "leafmachine",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "willwe@umich.edu",
            "name": "William N. Weaver",
            "orcidid": "https://orcid.org/0000-0003-0633-5066",
            "typeEntity": "Person"
        }
    ],
    "description": "Using machine learning to automate leaf trait extraction from digitized herbarium specimens.\n\nLeafMachine is a GUI that autonomously extracts leaf trait data from herbarium vouchers using CNNs, SVMs, and CV algorithms. There are two GUIs: manual version for fine-scale analyses, batch version for local files or from a list of URLs.",
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/Gene-Weaver/LeafMachine/tree/V.2.0/Networks"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Gene-Weaver/LeafMachine",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-02-12T11:31:12Z",
    "name": "LeafMachine",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1002/APS3.11367",
            "metadata": {
                "abstract": "© 2020 The Authors. Applications in Plant Sciences is published by Wiley Periodicals, LLC on behalf of the Botanical Society of AmericaPremise: Obtaining phenotypic data from herbarium specimens can provide important insights into plant evolution and ecology but requires significant manual effort and time. Here, we present LeafMachine, an application designed to autonomously measure leaves from digitized herbarium specimens or leaf images using an ensemble of machine learning algorithms. Methods and Results: We trained LeafMachine on 2685 randomly sampled specimens from 138 herbaria and evaluated its performance on specimens spanning 20 diverse families and varying widely in resolution, quality, and layout. LeafMachine successfully extracted at least one leaf measurement from 82.0% and 60.8% of high- and low-resolution images, respectively. Of the unmeasured specimens, only 0.9% and 2.1% of high- and low-resolution images, respectively, were visually judged to have measurable leaves. Conclusions: This flexible autonomous tool has the potential to vastly increase available trait information from herbarium specimens, and inform a multitude of evolutionary and ecological studies.",
                "authors": [
                    {
                        "name": "Laport R.G."
                    },
                    {
                        "name": "Ng J."
                    },
                    {
                        "name": "Weaver W.N."
                    }
                ],
                "citationCount": 8,
                "date": "2020-06-01T00:00:00Z",
                "journal": "Applications in Plant Sciences",
                "title": "LeafMachine: Using machine learning to automate leaf trait extraction from digitized herbarium specimens"
            },
            "pmcid": "PMC7328653",
            "pmid": "32626609"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Sample collections",
            "uri": "http://edamontology.org/topic_3277"
        }
    ]
}
