{
    "additionDate": "2020-01-09T17:37:14Z",
    "biotoolsCURIE": "biotools:SCEptRe",
    "biotoolsID": "SCEptRe",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "swapnil@lji.org",
            "name": "Swapnil Mahajan",
            "orcidid": "https://orcid.org/0000-0003-2136-1801",
            "typeEntity": "Person"
        }
    ],
    "description": "SCEptRe provides weekly updated, non-redundant, user customized benchmark datasets with information on the immune receptor features for receptor-specific epitope predictions. This tool extracts weekly updated 3D complexes of antibody-antigen, TCR-pMHC and MHC-ligand from the Immune Epitope Database (IEDB) and clusters them based on antigens, receptors and epitopes to generate benchmark datasets. Users can customize structural quality and clustering parameters (e.g. resolution, R free factors, antigen or epitope sequence identity) to generate these datasets based on their need.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peptide immunogenicity prediction",
                    "uri": "http://edamontology.org/operation_0252"
                },
                {
                    "term": "Epitope mapping",
                    "uri": "http://edamontology.org/operation_0416"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "http://tools.iedb.org/sceptre",
    "lastUpdate": "2021-01-16T12:59:08Z",
    "name": "SCEptRe",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3109-6",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: The development of accurate epitope prediction tools is important in facilitating disease diagnostics, treatment and vaccine development. The advent of new approaches making use of antibody and TCR sequence information to predict receptor-specific epitopes have the potential to transform the epitope prediction field. Development and validation of these new generation of epitope prediction methods would benefit from regularly updated high-quality receptor-antigen complex datasets. Results: To address the need for high-quality datasets to benchmark performance of these new generation of receptor-specific epitope prediction tools, a webserver called SCEptRe (Structural Complexes of Epitope-Receptor) was created. SCEptRe extracts weekly updated 3D complexes of antibody-antigen, TCR-pMHC and MHC-ligand from the Immune Epitope Database and clusters them based on antigen, receptor and epitope features to generate benchmark datasets. SCEptRe also provides annotated information such as CDR sequences and VDJ genes on the receptors. Users can generate custom datasets based by selecting thresholds for structural quality and clustering parameters (e.g. resolution, R-free factor, antigen or epitope sequence identity) based on their need. Conclusions: SCEptRe provides weekly updated, user-customized comprehensive benchmark datasets of immune receptor-epitope structural complexes. These datasets can be used to develop and benchmark performance of receptor-specific epitope prediction tools in the future. SCEptRe is freely accessible at http://tools.iedb.org/sceptre.",
                "authors": [
                    {
                        "name": "Mahajan S."
                    },
                    {
                        "name": "Yan Z."
                    },
                    {
                        "name": "Jespersen M.C."
                    },
                    {
                        "name": "Jensen K.K."
                    },
                    {
                        "name": "Marcatili P."
                    },
                    {
                        "name": "Nielsen M."
                    },
                    {
                        "name": "Sette A."
                    },
                    {
                        "name": "Peters B."
                    }
                ],
                "citationCount": 2,
                "date": "2019-10-10T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Benchmark datasets of immune receptor-epitope structural complexes"
            },
            "pmcid": "PMC6785892",
            "pmid": "31601176"
        }
    ],
    "topic": [
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        }
    ],
    "validated": 1
}