{
    "additionDate": "2019-11-14T19:27:31Z",
    "biotoolsCURIE": "biotools:DENOPTIM",
    "biotoolsID": "DENOPTIM",
    "confidence_flag": "high",
    "cost": "Free of charge",
    "description": "Software for Computational de Novo Design of Organic and Inorganic Molecules | DENOPTIM is a software package for de novo design and virtual screening of functional molecules of any kind | DENOPTIM (De Novo OPTimization of In/organic Molecules) is a software meant for de novo design and virtual screening of functional compounds. In practice, DENOPTIM is meant for building chemical entities by assembling building blocks (i.e., fragments), processing each chemical entity as to produce its figure of merit (i.e., fitness), and designing new entities based on the properties of entities generated before.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Ab initio structure prediction",
                    "uri": "http://edamontology.org/operation_0476"
                }
            ]
        }
    ],
    "homepage": "https://github.com/denoptim-project/DENOPTIM",
    "language": [
        "Java"
    ],
    "lastUpdate": "2020-01-23T13:48:38Z",
    "license": "AGPL-3.0",
    "link": [
        {
            "type": "Repository",
            "url": "https://github.com/denoptim-project"
        }
    ],
    "name": "DENOPTIM",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "marcof",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.9B00516",
            "metadata": {
                "abstract": "© 2019 American Chemical Society.A general-purpose software package, termed DE Novo OPTimization of In/organic Molecules (DENOPTIM), for de novo design and virtual screening of functional molecules is described. Molecules of any element and kind, including metastable species and transition states, are handled as chemical objects that go beyond valence-rules representations. Synthetic accessibility of the generated molecules is ensured via detailed control of the kinds of bonds that are allowed to form in the automated molecular building process. DENOPTIM contains a combinatorial explorer for screening and a genetic algorithm for global optimization of user-defined properties. Estimates of these properties may be obtained to form the fitness function (figure of merit or scoring function) from external molecular modeling programs via shell scripts. Examples of a range of different fitness functions and DENOPTIM applications, including an easy-to-do test case, are described. DENOPTIM is available as Open Source from https://github.com/denoptim-project/DENOPTIM.",
                "authors": [
                    {
                        "name": "Foscato M."
                    },
                    {
                        "name": "Venkatraman V."
                    },
                    {
                        "name": "Jensen V.R."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "DENOPTIM: Software for Computational de Novo Design of Organic and Inorganic Molecules"
            },
            "pmid": "31479254"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Computational chemistry",
            "uri": "http://edamontology.org/topic_3332"
        },
        {
            "term": "Compound libraries and screening",
            "uri": "http://edamontology.org/topic_3343"
        },
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}