{
    "additionDate": "2021-01-18T09:53:16Z",
    "biotoolsCURIE": "biotools:imputeqc",
    "biotoolsID": "imputeqc",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "khvorykh@img.ras.ru",
            "name": "Gennady V. Khvorykh",
            "typeEntity": "Person"
        }
    ],
    "description": "An R package for assessing imputation quality of genotypes and optimizing imputation parameters.\n\nimputeqc is an R package and accompanied scripts to estimate the quality of imputation of genotypes that was made with fastPHASE and BEAGLE softwares. Any other tools that support *.inp fastPHASE or VCF files can be also considered. The package is based on masked data analysis.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                }
            ]
        }
    ],
    "homepage": "https://github.com/inzilico/imputeqc",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-04T07:53:25Z",
    "license": "MIT",
    "name": "imputeqc",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03589-0",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: The imputation of genotypes increases the power of genome-wide association studies. However, the imputation quality should be assessed in each particular case. Nevertheless, not all imputation softwares control the error of output, e.g., the last release of fastPHASE program (1.4.8) lacks such an option. In this particular software there is also an uncertainty in choosing the model parameters. fastPHASE is based on haplotype clusters, which size should be set a priori. The parameter influences the results of imputation and downstream analysis. Results: We present a software toolkit imputeqc to assess the imputation quality and/or to choose the model parameters for imputation. We demonstrate the efficacy of toolkit for evaluation of imputations made with both fastPHASE and BEAGLE software for HapMap and 1000 Genomes data. The discordance of genotypes received correlated well in both methods. Using imputeqc, we also shown how to choose the optimal number of haplotype clusters and expectation-maximization cycles for fastPHASE program. The found number of haplotype clusters of 25 was further applied for hapFLK testing that revealed signatures of selection at LCT region on chromosome 2. We also demonstrated how to decrease the computational time in the case of hapFLK testing from 3 days to 20 h. Conclusions: The toolkit is implemented as an R package imputeqc and command line scripts. The code is freely available at https://github.com/inzilico/imputeqc under the MIT license.",
                "authors": [
                    {
                        "name": "Khrunin A.V."
                    },
                    {
                        "name": "Khvorykh G.V."
                    }
                ],
                "date": "2020-07-24T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Imputeqc: An R package for assessing imputation quality of genotypes and optimizing imputation parameters"
            },
            "pmcid": "PMC7379353",
            "pmid": "32703240"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ]
}
