{
    "additionDate": "2018-05-09T15:40:48Z",
    "biotoolsCURIE": "biotools:vamps",
    "biotoolsID": "vamps",
    "credit": [
        {
            "name": "Contact form",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://vamps.mbl.edu/utils/contact.php"
        }
    ],
    "description": "A website for visualization and analysis of microbial population structures.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://vamps.mbl.edu/overview.php"
        },
        {
            "type": [
                "User manual"
            ],
            "url": "https://vamps.mbl.edu/resources/tutorial.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Community profiling",
                    "uri": "http://edamontology.org/operation_3200"
                }
            ]
        }
    ],
    "homepage": "https://vamps.mbl.edu/",
    "language": [
        "PHP",
        "JavaScript",
        "SQL"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "VAMPS",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/1471-2105-15-41",
            "metadata": {
                "abstract": "Background: The advent of next-generation DNA sequencing platforms has revolutionized molecular microbial ecology by making the detailed analysis of complex communities over time and space a tractable research pursuit for small research groups. However, the ability to generate 105-108 reads with relative ease brings with it many downstream complications. Beyond the computational resources and skills needed to process and analyze data, it is difficult to compare datasets in an intuitive and interactive manner that leads to hypothesis generation and testing.Results: We developed the free web service VAMPS (Visualization and Analysis of Microbial Population Structures, http://vamps.mbl.edu) to address these challenges and to facilitate research by individuals or collaborating groups working on projects with large-scale sequencing data. Users can upload marker gene sequences and associated metadata; reads are quality filtered and assigned to both taxonomic structures and to taxonomy-independent clusters. A simple point-and-click interface allows users to select for analysis any combination of their own or their collaborators' private data and data from public projects, filter these by their choice of taxonomic and/or abundance criteria, and then explore these data using a wide range of analytic methods and visualizations. Each result is extensively hyperlinked to other analysis and visualization options, promoting data exploration and leading to a greater understanding of data relationships.Conclusions: VAMPS allows researchers using marker gene sequence data to analyze the diversity of microbial communities and the relationships between communities, to explore these analyses in an intuitive visual context, and to download data, results, and images for publication. VAMPS obviates the need for individual research groups to make the considerable investment in computational infrastructure and bioinformatic support otherwise necessary to process, analyze, and interpret massive amounts of next-generation sequence data. Any web-capable device can be used to upload, process, explore, and extract data and results from VAMPS. VAMPS encourages researchers to share sequence and metadata, and fosters collaboration between researchers of disparate biomes who recognize common patterns in shared data. © 2014 Huse et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Huse S.M."
                    },
                    {
                        "name": "Mark Welch D.B."
                    },
                    {
                        "name": "Voorhis A."
                    },
                    {
                        "name": "Shipunova A."
                    },
                    {
                        "name": "Morrison H.G."
                    },
                    {
                        "name": "Eren A.M."
                    },
                    {
                        "name": "Sogin M.L."
                    }
                ],
                "citationCount": 109,
                "date": "2014-02-05T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "VAMPS: A website for visualization and analysis of microbial population structures"
            },
            "pmcid": "PMC3922339",
            "pmid": "24499292"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        },
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        }
    ],
    "validated": 1
}