{
    "additionDate": "2021-01-18T12:13:00Z",
    "biotoolsCURIE": "biotools:ped-draw",
    "biotoolsID": "ped-draw",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "matt.velinder@utah.edu",
            "name": "Matt Velinder",
            "orcidid": "https://orcid.org/0000-0003-3350-8647",
            "typeEntity": "Person"
        }
    ],
    "description": "pedigree drawing with ease.\n\nA simple python script to draw (complex and multi generation!) pedigrees with graphviz.\n\nped_draw reads in a ped file (from a specified file or from /dev/stdin) and generates a dot file (to stdout). The subsequent dot output can be piped directly to dot/graphviz to generate png, svg, pdf, ps, or any other image option available in the graphviz documentation.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Map drawing",
                    "uri": "http://edamontology.org/operation_0573"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                }
            ]
        }
    ],
    "homepage": "https://peddraw.github.io",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-23T07:49:09Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/mvelinder/ped_draw"
        }
    ],
    "name": "ped_draw",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03917-4",
            "metadata": {
                "abstract": "© 2020, The Author(s).Background: Pedigree files are ubiquitously used within bioinformatics and genetics studies to convey critical information about relatedness, sex and affected status of study samples. While the text based format of ped files is efficient for computational methods, it is not immediately intuitive to a bioinformatician or geneticist trying to understand family structures, many of which encode the affected status of individuals across multiple generations. The visualization of pedigrees into connected nodes with descriptive shapes and shading provides a far more interpretable format to recognize visual patterns and intuit family structures. Despite these advantages of a visual pedigree, it remains difficult to quickly and accurately visualize a pedigree given a pedigree text file. Results: Here we describe ped_draw a command line and web tool as a simple and easy solution to pedigree visualization. Ped_draw is capable of drawing complex multi-generational pedigrees and conforms to the accepted standards for depicting pedigrees visually. The command line tool can be used as a simple one liner command, utilizing graphviz to generate an image file. The web tool, https://peddraw.github.io, allows the user to either: paste a pedigree file, type to construct a pedigree file in the text box or upload a pedigree file. Users can save the generated image file in various formats. Conclusions: We believe ped_draw is a useful pedigree drawing tool that improves on current methods due to its ease of use and approachability. Ped_draw allows users with various levels of expertise to quickly and easily visualize pedigrees.",
                "authors": [
                    {
                        "name": "Velinder M."
                    },
                    {
                        "name": "Lee D."
                    },
                    {
                        "name": "Marth G."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "ped_draw: pedigree drawing with ease"
            },
            "pmcid": "PMC7727153",
            "pmid": "33297934"
        }
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        }
    ]
}