{
    "additionDate": "2017-02-07T13:52:12Z",
    "biotoolsCURIE": "biotools:gepas",
    "biotoolsID": "gepas",
    "description": "Collection of tools for the analysis of microarray data. It includes tools for data pre-processing, clustering, differential gene expression, predictors, array CGH and functional annotation. A new pipeline module allows for automation of sequential analysis steps.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression profile clustering",
                    "uri": "http://edamontology.org/operation_0313"
                },
                {
                    "term": "Gene expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://www.gepas.org",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:39Z",
    "name": "GEPAS",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Gene Expression Profile Analysis Suite (GEPAS) is one of the most complete and extensively used web-based packages for microarray data analysis. During its more than 5 years of activity it has continuously been updated to keep pace with the state-of-the-art in the changing microarray data analysis arena. GEPAS offers diverse analysis options that include well established as well as novel algorithms for normalization, gene selection, class prediction, clustering and functional profiling of the experiment. New options for time-course (or dose-response) experiments, microarray-based class prediction, new clustering methods and new tests for differential expression have been included. The new pipeliner module allows automating the execution of sequential analysis steps by means of a simple but powerful graphic interface. An extensive re-engineering of GEPAS has been carried out which includes the use of web services and Web 2.0 technology features, a new user interface with persistent sessions and a new extended database of gene identifiers. GEPAS is nowadays the most quoted web tool in its field and it is extensively used by researchers of many countries and its records indicate an average usage rate of 500 experiments per day. GEPAS, is available at http://www.gepas.org.",
                "authors": [
                    {
                        "name": "Tarraga J."
                    },
                    {
                        "name": "Medina I."
                    },
                    {
                        "name": "Carbonell J."
                    },
                    {
                        "name": "Huerta-Cepas J."
                    },
                    {
                        "name": "Minguez P."
                    },
                    {
                        "name": "Alloza E."
                    },
                    {
                        "name": "Al-Shahrour F."
                    },
                    {
                        "name": "Vegas-Azcarate S."
                    },
                    {
                        "name": "Goetz S."
                    },
                    {
                        "name": "Escobar P."
                    },
                    {
                        "name": "Garcia-Garcia F."
                    },
                    {
                        "name": "Conesa A."
                    },
                    {
                        "name": "Montaner D."
                    },
                    {
                        "name": "Dopazo J."
                    }
                ],
                "citationCount": 49,
                "date": "2008-01-01T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "GEPAS, a web-based tool for microarray data analysis and interpretation."
            },
            "pmid": "18508806"
        },
        {
            "metadata": {
                "abstract": "Since the first papers published in the late nineties, including, for the first time, a comprehensive analysis of microarray data, the number of questions that have been addressed through this technique have both increased and diversified. Initially, interest focussed on genes coexpressing across sets of experimental conditions, implying, essentially, the use of clustering techniques. Recently, however, interest has focussed more on finding genes differentially expressed among distinct classes of experiments, or correlated to diverse clinical outcomes, as well as in building predictors. In addition to this, the availability of accurate genomic data and the recent implementation of CGH arrays has made mapping expression and genomic data on the chromosomes possible. There is also a clear demand for methods that allow the automatic transfer of biological information to the results of microarray experiments. Different initiatives, such as the Gene Ontology (GO) consortium, pathways databases, protein functional motifs, etc., provide curated annotations for genes. Whereas many resources on the web focus mainly on clustering methods, GEPAS has evolved to cope with the aforementioned new challenges that have recently arisen in the field of microarray data analysis. The web-based pipeline for microarray gene expression data, GEPAS, is available at http://gepas.bioinfo.cnio.es. © Oxford University Press 2004; all rights reserved.",
                "authors": [
                    {
                        "name": "Herrero J."
                    },
                    {
                        "name": "Vaquerizas J.M."
                    },
                    {
                        "name": "Al-Shahrour F."
                    },
                    {
                        "name": "Conde L."
                    },
                    {
                        "name": "Mateos A."
                    },
                    {
                        "name": "Diaz-Uriarte J.S.R."
                    },
                    {
                        "name": "Dopazo J."
                    }
                ],
                "citationCount": 42,
                "date": "2004-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "New challenges in gene expression data analysis and the extended GEPAS"
            },
            "pmid": "15215434"
        },
        {
            "metadata": {
                "abstract": "The Gene Expression Profile Analysis Suite (GEPAS) has been running for more than four years. During this time it has evolved to keep pace with the new interests and trends in the still changing world of microarray data analysis. GEPAS has been designed to provide an intuitive although powerful web-based interface that offers diverse analysis options from the early step of preprocessing (normalization of Affymetrix and two-colour microarray experiments and other preprocessing options), to the final step of the functional annotation of the experiment (using Gene Ontology, pathways, PubMed abstracts etc.), and include different possibilities for clustering, gene selection, class prediction and array-comparative genomic hybridization management. GEPAS is extensively used by researchers of many countries and its records indicate an average usage rate of 400 experiments per day. The web-based pipeline for microarray gene expression data, GEPAS, is available at http://www.gepas.org. © The Author 2006. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Montaner D."
                    },
                    {
                        "name": "Tarraga J."
                    },
                    {
                        "name": "Huerta-Cepas J."
                    },
                    {
                        "name": "Burguet J."
                    },
                    {
                        "name": "Vaquerizas J.M."
                    },
                    {
                        "name": "Conde L."
                    },
                    {
                        "name": "Minguez P."
                    },
                    {
                        "name": "Vera J."
                    },
                    {
                        "name": "Mukherjee S."
                    },
                    {
                        "name": "Valls J."
                    },
                    {
                        "name": "Pujana M.A.G."
                    },
                    {
                        "name": "Alloza E."
                    },
                    {
                        "name": "Herrero J."
                    },
                    {
                        "name": "Al-Shahrour F."
                    },
                    {
                        "name": "Dopazo J."
                    }
                ],
                "citationCount": 95,
                "date": "2006-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Next station in microarray data analysis: GEPAS"
            },
            "pmid": "16845056"
        },
        {
            "metadata": {
                "abstract": "The Gene Expression Profile Analysis Suite, GEPAS, has been running for more than three years. With >76 000 experiments analysed during the last year and a daily average of almost 300 analyses, GEPAS can be considered a well-established and widely used platform for gene expression microarray data analysis. GEPAS is oriented to the analysis of whole series of experiments. Its design and development have been driven by the demands of the biomedical community, probably the most active collective in the field of microarray users. Although clustering methods have obviously been implemented in GEPAS, our interest has focused more on methods for finding genes differentially expressed among distinct classes of experiments or correlated to diverse clinical outcomes, as well as on building predictors. There is also a great interest in CGH-arrays which fostered the development of the corresponding tool in GEPAS: InSilicoCGH. Much effort has been invested in GEPAS for developing and implementing efficient methods for functional annotation of experiments in the proper statistical framework. Thus, the popular FatiGO has expanded to a suite of programs for functional annotation of experiments, including information on transcription factor binding sites, chromosomal location and tissues. The web-based pipeline for microarray gene expression data, GEPAS, is available at http://www.gepas.org. © 2005 Oxford University Press.",
                "authors": [
                    {
                        "name": "Vaquerizas J.M."
                    },
                    {
                        "name": "Conde L."
                    },
                    {
                        "name": "Yankilevich P."
                    },
                    {
                        "name": "Cabezon A."
                    },
                    {
                        "name": "Minguez P."
                    },
                    {
                        "name": "Diaz-Uriarte R."
                    },
                    {
                        "name": "Al-Shahrour F."
                    },
                    {
                        "name": "Herrero J."
                    },
                    {
                        "name": "Dopazo J."
                    }
                ],
                "citationCount": 79,
                "date": "2005-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "GEPAS, an experiment-oriented pipeline for the analysis of microarray gene expression data"
            },
            "pmid": "15980548"
        },
        {
            "metadata": {
                "abstract": "We present a web-based pipeline for microarray gene expression profile analysis, GEPAS, which stands for Gene Expression Profile Analysis Suite (http://gepas.bioinfo.cnio.es). GEPAS is composed of different interconnected modules which include tools for data pre-processing, two-conditions comparison, unsupervised and supervised clustering (which include some of the most popular methods as well as home made algorithms) and several tests for differential gene expression among different classes, continuous variables or survival analysis. A multiple purpose tool for data mining, based on Gene Ontology, is also linked to the tools, which constitutes a very convenient way of analysing clustering results. On-line tutorials are available from our main web server (http://bioinfo.cnio.es).",
                "authors": [
                    {
                        "name": "Herrero J."
                    },
                    {
                        "name": "Al-Shahrour F."
                    },
                    {
                        "name": "Diaz-Uriarte R."
                    },
                    {
                        "name": "Mateos A."
                    },
                    {
                        "name": "Vaquerizas J.M."
                    },
                    {
                        "name": "Santoyo J."
                    },
                    {
                        "name": "Dopazo J."
                    }
                ],
                "citationCount": 156,
                "date": "2003-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "GEPAS: A web-based resource for microarray gene expression data analysis"
            },
            "pmid": "12824345"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Function analysis",
            "uri": "http://edamontology.org/topic_1775"
        }
    ],
    "validated": 1
}