{
    "additionDate": "2017-08-03T19:02:08Z",
    "biotoolsCURIE": "biotools:stringgraph",
    "biotoolsID": "stringgraph",
    "credit": [
        {
            "email": "benny@cs.tau.ac.il",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.cs.tau.ac.il/~bchor/"
        }
    ],
    "description": "A novel, hash based method for constructing the string graph.",
    "documentation": [
        {
            "type": "General",
            "url": "http://www.cs.tau.ac.il/~bchor/StringGraph/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                }
            ]
        }
    ],
    "homepage": "http://www.cs.tau.ac.il/~bchor/StringGraph/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2019-02-28T09:12:25Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/stringgraph-beta-string-graph-construction-using-incremental-hashing.html"
        }
    ],
    "name": "StringGraph",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© The Author 2014. Published by Oxford University Press. All rights reserved.Motivation: New sequencing technologies generate larger amount of short reads data at decreasing cost. De novo sequence assembly is the problem of combining these reads back to the original genome sequence, without relying on a reference genome. This presents algorithmic and computational challenges, especially for long and repetitive genome sequences. Most existing approaches to the assembly problem operate in the framework of de Bruijn graphs. Yet, a number of recent works use the paradigm of string graph, using a variety of methods for storing and processing suffixes and prefixes, like suffix arrays, the Burrows-Wheeler transform or the FM index. Our work is motivated by a search for new approaches to constructing the string graph, using alternative yet simple data structures and algorithmic concepts. Results: We introduce a novel hash-based method for constructing the string graph. We use incremental hashing, and specifically a modification of the Karp-Rabin fingerprint, and Bloom filters. Using these probabilistic methods might create false-positive and false-negative edges during the algorithm's execution, but these are all detected and corrected. The advantages of the proposed approach over existing methods are its simplicity and the incorporation of established probabilistic techniques in the context of de novo genome sequencing. Our preliminary implementation is favorably comparable with the first string graph construction of Simpson and Durbin (2010) (but not with subsequent improvements). Further research and optimizations will hopefully enable the algorithm to be incorporated, with noticeable performance improvement, in state-of-the-art string graph-based assemblers.",
                "authors": [
                    {
                        "name": "Ben-Bassat I."
                    },
                    {
                        "name": "Chor B."
                    }
                ],
                "citationCount": 7,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "String graph construction using incremental hashing"
            },
            "pmid": "25183486"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1
}