{
    "accessibility": "Open access",
    "additionDate": "2023-02-12T15:30:14.330161Z",
    "biotoolsCURIE": "biotools:bmat",
    "biotoolsID": "bmat",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "colin.vandenbulcke@uclouvain.be",
            "name": "Colin Vanden Bulcke",
            "typeEntity": "Person"
        },
        {
            "email": "pietro.maggi@saintluc.uclouvain.be",
            "name": "Pietro Maggi",
            "typeEntity": "Person"
        }
    ],
    "description": "The BMAT software is a complete and easy-to-use local open-source neuroimaging analysis tool with a graphical user interface (GUI) that uses the BIDS format to organize and process brain MRI data for MS imaging research studies.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ColinVDB/BMAT",
    "lastUpdate": "2023-02-12T15:30:14.332883Z",
    "license": "GPL-3.0",
    "name": "BMAT",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.NICL.2022.103252",
            "metadata": {
                "abstract": "© 2022 The Author(s)Magnetic Resonance Imaging (MRI) is an established technique to study in vivo neurological disorders such as Multiple Sclerosis (MS). To avoid errors on MRI data organization and automated processing, a standard called Brain Imaging Data Structure (BIDS) has been recently proposed. The BIDS standard eases data sharing and processing within or between centers by providing guidelines for their description and organization. However, the transformation from the complex unstructured non-open file data formats coming directly from the MRI scanner to a correct BIDS structure can be cumbersome and time consuming. This hinders a wider adoption of the BIDS format across different study centers. To solve this problem and ease the day-to-day use of BIDS for the neuroimaging scientific community, we present the BIDS Managing and Analysis Tool (BMAT). The BMAT software is a complete and easy-to-use local open-source neuroimaging analysis tool with a graphical user interface (GUI) that uses the BIDS format to organize and process brain MRI data for MS imaging research studies. BMAT provides the possibility to translate data from MRI scanners to the BIDS structure, create and manage BIDS datasets as well as develop and run automated processing pipelines, and is faster than its competitor. BMAT software propose the possibility to download useful analysis apps, especially applied to MS research with lesion segmentation and processing of imaging contrasts for novel disease biomarkers such as the central vein sign and the paramagnetic rim lesions.",
                "authors": [
                    {
                        "name": "Absinta M."
                    },
                    {
                        "name": "Bach Cuadra M."
                    },
                    {
                        "name": "Detobel J."
                    },
                    {
                        "name": "Dricot L."
                    },
                    {
                        "name": "La Rosa F."
                    },
                    {
                        "name": "Macq B."
                    },
                    {
                        "name": "Maggi P."
                    },
                    {
                        "name": "Vanden Bulcke C."
                    },
                    {
                        "name": "Wynen M."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "NeuroImage: Clinical",
                "title": "BMAT: An open-source BIDS managing and analysis tool"
            },
            "pmcid": "PMC9723304",
            "pmid": "36451357"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
