{
    "additionDate": "2021-01-18T11:02:06Z",
    "biotoolsCURIE": "biotools:matchseq",
    "biotoolsID": "matchseq",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Isabelle Glocke",
            "typeEntity": "Person"
        }
    ],
    "description": "Reconstructing double-stranded DNA fragments on a single-molecule level reveals patterns of degradation in ancient samples.\n\nThis repository provides the following 3 perl scripts for reconstructing the structure of double-stranded DNA fragments from deeply sequenced single-stranded DNA libraries:.\n\nEach script includes a help menu with further instructions and available options (accessible by executing the scripts without specifying an input file).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://github.com/mpieva/matchseq",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2021-02-20T17:13:58Z",
    "license": "MIT",
    "name": "MatchSeq",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1101/GR.263863.120",
            "metadata": {
                "abstract": "© 2020 Bokelmann et al.Extensive manipulations involved in the preparation of DNA samples for sequencing have hitherto made it impossible to determine the precise structure of double-stranded DNA fragments being sequenced, such as the presence of blunt ends, single-stranded overhangs, or single-strand breaks. We here describe MatchSeq, a method that combines single-stranded DNA library preparation from diluted DNA samples with computational sequence matching, allowing the reconstruction of double-stranded DNA fragments on a single-molecule level. The application of MatchSeq to Neanderthal DNA, a particularly complex source of degraded DNA, reveals that 1- or 2-nt overhangs and blunt ends dominate the ends of ancient DNA molecules and that short gaps exist, which are predominantly caused by the loss of individual purines. We further show that deamination of cytosine to uracil occurs in both single- and double-stranded contexts close to the ends of molecules, and that single-stranded parts of DNA fragments are enriched in pyrimidines. MatchSeq provides unprecedented resolution for interrogating the structures of fragmented double-stranded DNA and can be applied to fragmented double-stranded DNA isolated from any biological source. The method relies on well-established laboratory techniques and can easily be integrated into routine data generation. This possibility is shown by the successful reconstruction of double-stranded DNA fragments from previously published single-stranded sequence data, allowing a more comprehensive characterization of the biochemical properties not only of ancient DNA but also of cell-free DNA from human blood plasma, a clinically relevant marker for the diagnosis and monitoring of disease.",
                "authors": [
                    {
                        "name": "Bokelmann L."
                    },
                    {
                        "name": "Glocke I."
                    },
                    {
                        "name": "Meyer M."
                    }
                ],
                "citationCount": 1,
                "date": "2020-10-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "Reconstructing double-stranded DNA fragments on a single-molecule level reveals patterns of degradation in ancient samples"
            },
            "pmcid": "PMC7605269",
            "pmid": "32963029"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ]
}