{
    "additionDate": "2021-01-18T11:31:59Z",
    "biotoolsCURIE": "biotools:ilbe",
    "biotoolsID": "ilbe",
    "confidence_flag": "tool",
    "description": "iLBE for Computational Identification of Linear B-cell Epitopes by Integrating Sequence and Evolutionary Features.\n\nIdentification of Linear B-Cell Epitopes.\n\nInput your epitope sequence here. The sequence should be in FASTA format. Example.\n\nPlease be patient after submitting and do not close this page.\n\nRetrieval Job IDInput your job id here (e.g. 20180602221946).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Epitope mapping",
                    "uri": "http://edamontology.org/operation_0416"
                },
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                }
            ]
        }
    ],
    "homepage": "http://kurata14.bio.kyutech.ac.jp/iLBE/",
    "lastUpdate": "2024-11-24T20:46:01.129347Z",
    "name": "iLBE",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/j.gpb.2019.04.004",
            "metadata": {
                "abstract": "Linear B-cell epitopes are critically important for immunological applications, such as vaccine design, immunodiagnostic test, and antibody production, as well as disease diagnosis and therapy. The accurate identification of linear B-cell epitopes remains challenging despite several decades of research. In this work, we have developed a novel predictor, Identification of Linear B-cell Epitope (iLBE), by integrating evolutionary and sequence-based features. The successive feature vectors were optimized by a Wilcoxon-rank sum test. Then the random forest (RF) algorithm using the optimal consecutive feature vectors was applied to predict linear B-cell epitopes. We combined the RF scores by the logistic regression to enhance the prediction accuracy. iLBE yielded an area under curve score of 0.809 on the training dataset and outperformed other prediction models on a comprehensive independent dataset. iLBE is a powerful computational tool to identify the linear B-cell epitopes and would help to develop penetrating diagnostic tests. A web application with curated datasets for iLBE is freely accessible at http://kurata14.bio.kyutech.ac.jp/iLBE/.",
                "authors": [
                    {
                        "name": "Hasan M.M."
                    },
                    {
                        "name": "Khatun M.S."
                    },
                    {
                        "name": "Kurata H."
                    }
                ],
                "citationCount": 33,
                "date": "2020-10-01T00:00:00Z",
                "journal": "Genomics, Proteomics and Bioinformatics",
                "title": "iLBE for Computational Identification of Linear B-cell Epitopes by Integrating Sequence and Evolutionary Features"
            },
            "pmcid": "PMC8377379",
            "pmid": "33099033"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Immunology",
            "uri": "http://edamontology.org/topic_0804"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
