{"credit":[{"name":"bils.se","typeEntity":"Institute","typeRoles":["Provider"]},{"email":"karin@sbc.su.se","typeEntity":"Person","typeRoles":["Primary contact"]}],"function":[{"input":[{"data":{"term":"Protein sequence","uri":"http://edamontology.org/data_2976"}}],"operation":[{"term":"Transmembrane protein analysis","uri":"http://edamontology.org/operation_0270"}],"output":[{"data":{"term":"Protein features","uri":"http://edamontology.org/data_1277"}}]}],"labels":{"toolType":["Web application"],"topic":[{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"}]},"publication":[{"abstract":"We have developed reliability scores for five widely used membrane protein topology prediction methods, and have applied them both on a test set of 92 bacterial plasma membrane proteins with experimentally determined topologies and on all predicted helix bundle membrane proteins in three fully sequenced genomes: Escherichia coli, Saccharomyces cerevisiae and Caenorhabditis elegans. We show that the reliability scores work well for the TMHMM and MEMSAT methods, and that they allow the probability that the predicted topology is correct to be estimated for any protein. We further show that the available test set is biased towards high-scoring proteins when compared to the genome-wide data sets, and provide estimates for the expected prediction accuracy of TMHMM across the three genomes. Finally, we show that the performance of TMHMM is considerably better when limited experimental information (such as the in/out location of a protein's C terminus) is available, and estimate that at least ten percentage points in overall accuracy in whole-genome predictions can be gained in this way. © 2003 Elsevier Science Ltd. All rights reserved.","authors":["Melen K.","Krogh A.","Von Heijne G."],"cit_count":165,"doi":"10.1016/S0022-2836(03)00182-7","journal":"Journal of Molecular Biology","title":"Reliability measures for membrane protein topology prediction algorithms","type":"Primary","year":"2003-03-28"}],"summary":{"biotoolsCURIE":"biotools:tmhmmfix","biotoolsID":"tmhmmfix","description":"Topology prediction of membrane proteins with optional fixing and reliability score calculation.","homepage":"http://www.sbc.su.se/%7Emelen/TMHMMfix/","name":"TMHMMfix","version":["1"]}}