{
    "additionDate": "2021-12-06T14:32:37.446555Z",
    "biotoolsCURIE": "biotools:taba-statistics",
    "biotoolsID": "taba-statistics",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mtabatabai@mmc.edu",
            "name": "Mohammad Tabatabai",
            "orcidid": "https://orcid.org/0000-0002-1631-5264",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Taba is a R package that calculates the robust Taba linear, Taba rank (monotonic), TabWil, and TabWil rank correlations. Test statistics as well as one sided or two sided p-values are provided for all correlations. Multiple correlations and p-values can be calculated simultaneously across multiple variables. In addition, users will have the option to use the partial, semipartial, and generalized partial correlations; where the partial and semipartial correlations use linear, logistic, or Poisson regression to modify the specified variable.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://cran.r-project.org/web/packages/Taba/Taba.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Principal component analysis",
                    "uri": "http://edamontology.org/operation_3960"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/Taba/index.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-12-06T14:32:37.449097Z",
    "license": "GPL-3.0",
    "name": "Taba",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04098-4",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: The most common measure of association between two continuous variables is the Pearson correlation (Maronna et al. in Safari an OMC. Robust statistics, 2019. https://login.proxy.bib.uottawa.ca/login?url=https://learning.oreilly.com/library/view/-/9781119214687/?ar&orpq&email=^u). When outliers are present, Pearson does not accurately measure association and robust measures are needed. This article introduces three new robust measures of correlation: Taba (T), TabWil (TW), and TabWil rank (TWR). The correlation estimators T and TW measure a linear association between two continuous or ordinal variables; whereas TWR measures a monotonic association. The robustness of these proposed measures in comparison with Pearson (P), Spearman (S), Quadrant (Q), Median (M), and Minimum Covariance Determinant (MCD) are examined through simulation. Taba distance is used to analyze genes, and statistical tests were used to identify those genes most significantly associated with Williams Syndrome (WS). Results: Based on the root mean square error (RMSE) and bias, the three proposed correlation measures are highly competitive when compared to classical measures such as P and S as well as robust measures such as Q, M, and MCD. Our findings indicate TBL2 was the most significant gene among patients diagnosed with WS and had the most significant reduction in gene expression level when compared with control (P value = 6.37E-05). Conclusions: Overall, when the distribution is bivariate Log-Normal or bivariate Weibull, TWR performs best in terms of bias and T performs best with respect to RMSE. Under the Normal distribution, MCD performs well with respect to bias and RMSE; but TW, TWR, T, S, and P correlations were in close proximity. The identification of TBL2 may serve as a diagnostic tool for WS patients. A Taba R package has been developed and is available for use to perform all necessary computations for the proposed methods.",
                "authors": [
                    {
                        "name": "Bailey S."
                    },
                    {
                        "name": "Bursac Z."
                    },
                    {
                        "name": "Singh K.P."
                    },
                    {
                        "name": "Tabatabai H."
                    },
                    {
                        "name": "Tabatabai M."
                    },
                    {
                        "name": "Wilus D."
                    }
                ],
                "citationCount": 3,
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "An introduction to new robust linear and monotonic correlation coefficients"
            },
            "pmcid": "PMC8011137",
            "pmid": "33789571",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        }
    ]
}
