{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://tagc.univ-mrs.fr/tagc/"}],"function":[{"operation":[{"term":"Microarray data analysis","uri":"http://edamontology.org/operation_2495"}]},{"operation":[{"term":"Quality control","uri":"http://edamontology.org/operation_2428"}]}],"labels":{"language":["Java"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Desktop application"],"topic":[{"term":"DNA microarrays","uri":"http://edamontology.org/topic_0203"},{"term":"Microarrays","uri":"http://edamontology.org/topic_3518"},{"term":"DNA","uri":"http://edamontology.org/topic_0654"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/bzscan-2-quantification-dna-microarrays-radioactive-labeling.html"}],"publication":[{"abstract":"Background: High-density DNA microarrays require automatic feature extraction methodologies and softwares. These can be a potential source of non-reproducibility of gene expression measurements. Variation in feature location or in signal integration methodology may be a significant contribution to the observed variance in gene expression levels. Results: We explore sources of variability in feature extraction from DNA microarrays on Nylon membrane with radioactive detection. We introduce a mathematical model of the signal emission and derive methods for correcting biases such as overshining, saturation or variation in probe amount. We also provide a quality metric which can be used qualitatively to flag weak or untrusted signals or quantitatively to modulate the weight of each experiment or gene in higher level analyses (clustering or discriminant analysis). Conclusions: Our novel feature extraction methodology, based on a mathematical model of the radioactive emission, reduces variability due to saturation, neighbourhood effects and variable probe amount. Furthermore, we provide a fully automatic feature extraction software, BZScan, which implements the algorithms described in this paper. © 2004 Lopez et al; licensee BioMed Central Ltd.","authors":["Lopez F.","Rougemont J.","Loriod B.","Bourgeois A.","Loi L.","Bertucci F.","Hingamp P.","Houlgatte R.","Granjeaud S."],"cit_count":38,"doi":"10.1186/1471-2164-5-38","journal":"BMC Genomics","title":"Feature extraction and signal processing for nylon DNA microarrays","type":"Primary","year":"2004-06-29"}],"summary":{"biotoolsCURIE":"biotools:bzscan","biotoolsID":"bzscan","description":"BZScan is a free java tool for automatic quantification of DNA microarrays with radioactive labeling. BZScan provides saturation, overshining, and background noise correction, it also gives quality control measures.","homepage":"http://tagc.univ-mrs.fr/welcome/spip.php?rubrique7","name":"BZScan","version":["2"]}}