{
    "additionDate": "2021-01-18T11:57:09Z",
    "biotoolsCURIE": "biotools:cgpe",
    "biotoolsID": "cgpe",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hw9@iupui.edu",
            "name": "Huanmei Wu",
            "typeEntity": "Person"
        }
    ],
    "description": "Cancer Gene and Pathway Explorer (CGPE) provides a highly integrated bioinformatics webserver for investigating, analyzing, and visualizing the TCGA and GEO gene expression data. CGPE provides key interactive and customizable analysis portal",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression profile pathway mapping",
                    "uri": "http://edamontology.org/operation_0533"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Pathway visualisation",
                    "uri": "http://edamontology.org/operation_3926"
                }
            ]
        }
    ],
    "homepage": "https://cgpe.soic.iupui.edu",
    "lastUpdate": "2024-11-24T20:44:35.673644Z",
    "name": "CGPE",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btaa952",
            "metadata": {
                "abstract": "Summary: Cancer Gene and Pathway Explorer (CGPE) is developed to guide biological and clinical researchers, especially those with limited informatics and programming skills, performing preliminary cancer-related biomedical research using transcriptional data and publications. CGPE enables three user-friendly online analytical and visualization modules without requiring any local deployment. The GenePub HotIndex applies natural language processing, statistics and association discovery to provide analytical results on gene-specific PubMed publications, including gene-specific research trends, cancer types correlations, top-related genes and the WordCloud of publication profiles. The OnlineGSEA enables Gene Set Enrichment Analysis (GSEA) and results visualizations through an easy-to-follow interface for public or in-house transcriptional datasets, integrating the GSEA algorithm and preprocessed public TCGA and GEO datasets. The preprocessed datasets ensure gene sets analysis with appropriate pathway alternation and gene signatures. The CellLine Search presents evidence-based guidance for cell line selections with combined information on cell line dependency, gene expressions and pathway activity maps, which are valuable knowledge to have before conducting gene-related experiments. In a nutshell, the CGPE webserver provides a user-friendly, visual, intuitive and informative bioinformatics tool that allows biomedical researchers to perform efficient analyses and preliminary studies on in-house and publicly available bioinformatics data.",
                "authors": [
                    {
                        "name": "Dong C."
                    },
                    {
                        "name": "Liu J."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Wu H."
                    }
                ],
                "citationCount": 5,
                "date": "2021-08-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "CGPE: an integrated online server for Cancer Gene and Pathway Exploration"
            },
            "pmcid": "PMC8496739",
            "pmid": "33185687"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}
