{
    "additionDate": "2021-03-19T08:49:48Z",
    "biotoolsCURIE": "biotools:pareto",
    "biotoolsID": "pareto",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "givanna.haryonoputri@sydney.edu.au",
            "name": "Givanna H Putri",
            "typeEntity": "Person"
        },
        {
            "email": "mark.read@sydney.edu.au",
            "name": "Mark N Read",
            "typeEntity": "Person"
        }
    ],
    "description": "Using single-cell cytometry to illustrate integrated multi-perspective evaluation of clustering algorithms using Pareto fronts.\n\nA framework for benchmarking clustering algorithms, using Pareto fronts to capture tradeoffs in clustering performance as quantified through complementary use of several supervised clustering performance metrics.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Scatter plot plotting",
                    "uri": "http://edamontology.org/operation_2940"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ghar1821/ParetoBench",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2021-03-26T14:57:16Z",
    "license": "GPL-3.0",
    "name": "Pareto",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAB038",
            "metadata": {
                "abstract": "© C The Author(s) 2021. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: Many 'automated gating' algorithms now exist to cluster cytometry and single-cell sequencing data into discrete populations. Comparative algorithm evaluations on benchmark datasets rely either on a single performance metric, or a few metrics considered independently of one another. However, single metrics emphasize different aspects of clustering performance and do not rank clustering solutions in the same order. This underlies the lack of consensus between comparative studies regarding optimal clustering algorithms and undermines the translatability of results onto other non-benchmark datasets. Results: We propose the Pareto fronts framework as an integrative evaluation protocol, wherein individual metrics are instead leveraged as complementary perspectives. Judged superior are algorithms that provide the best tradeoff between the multiple metrics considered simultaneously. This yields a more comprehensive and complete view of clustering performance. Moreover, by broadly and systematically sampling algorithm parameter values using the Latin Hypercube sampling method, our evaluation protocol minimizes (un)fortunate parameter value selections as confounding factors. Furthermore, it reveals how meticulously each algorithm must be tuned in order to obtain good results, vital knowledge for users with novel data. We exemplify the protocol by conducting a comparative study between three clustering algorithms (ChronoClust, FlowSOM and Phenograph) using four common performance metrics applied across four cytometry benchmark datasets. To our knowledge, this is the first time Pareto fronts have been used to evaluate the performance of clustering algorithms in any application domain. Availability and implementation: Implementation of our Pareto front methodology and all scripts and datasets to reproduce this article are available at https://github.com/ghar1821/ParetoBench.",
                "authors": [
                    {
                        "name": "Putri G.H."
                    },
                    {
                        "name": "Koprinska I."
                    },
                    {
                        "name": "Ashhurst T.M."
                    },
                    {
                        "name": "King N.J.C."
                    },
                    {
                        "name": "Read M.N."
                    }
                ],
                "date": "2021-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Using single-cell cytometry to illustrate integrated multiperspective evaluation of clustering algorithms using Pareto fronts"
            },
            "pmid": "33508103"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Cytometry",
            "uri": "http://edamontology.org/topic_3934"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}