{
    "additionDate": "2017-12-06T18:14:31Z",
    "biotoolsCURIE": "biotools:glys3",
    "biotoolsID": "glys3",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "name": "ExPASy helpdesk",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.expasy.org/support"
        }
    ],
    "description": "GlyS3 matches any substructure such as glycan determinants to a large collection of structures recorded in UniCarbKB, SugarBind or GlycomeDB.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://glycoproteome.expasy.org/substructuresearch/"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant pattern analysis",
                    "uri": "http://edamontology.org/operation_3504"
                }
            ]
        }
    ],
    "homepage": "http://glycoproteome.expasy.org/substructuresearch",
    "lastUpdate": "2024-11-25T14:04:45.336975Z",
    "name": "GlyS3",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0144578",
            "metadata": {
                "abstract": "Resource description framework (RDF) and Property Graph databases are emerging technologies that are used for storing graph-structured data.We compare these technologies through a molecular biology use case: glycan substructure search. Glycans are branched tree-like molecules composed of building blocks linked together by chemical bonds. The molecular structure of a glycan can be encoded into a direct acyclic graph where each node represents a building block and each edge serves as a chemical linkage between two building blocks. In this context, Graph databases are possible software solutions for storing glycan structures and Graph query languages, such as SPARQL and Cypher, can be used to perform a substructure search. Glycan substructure searching is an important feature for querying structure and experimental glycan databases and retrieving biologically meaningful data. This applies for example to identifying a region of the glycan recognised by a glycan binding protein (GBP). In this study, 19,404 glycan structures were selected from GlycomeDB (www.glycome-db.org) and modelled for being stored into a RDF triple store and a Property Graph.We then performed two different sets of searches and compared the query response times and the results from both technologies to assess performance and accuracy. The two implementations produced the same results, but interestingly we noted a difference in the query response times. Qualitative measures such as portability were also used to define further criteria for choosing the technology adapted to solving glycan substructure search and other comparable issues.",
                "authors": [
                    {
                        "name": "Alocci D."
                    },
                    {
                        "name": "Bolleman J.T."
                    },
                    {
                        "name": "Campbell M.P."
                    },
                    {
                        "name": "Horlacher O."
                    },
                    {
                        "name": "Lisacek F."
                    },
                    {
                        "name": "Mariethoz J."
                    }
                ],
                "citationCount": 50,
                "date": "2015-12-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Property Graph vs RDF triple store: A comparison on glycan substructure search"
            },
            "pmcid": "PMC4684231",
            "pmid": "26656740",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ],
    "validated": 1
}
