{"credit":[{"email":"sayers@ncbi.nlm.nih.gov","name":"Eric W. Sayers","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://www.ncbi.nlm.nih.gov/home/learn/"}],"function":[{"operation":[{"term":"Deposition","uri":"http://edamontology.org/operation_3431"},{"term":"Service discovery","uri":"http://edamontology.org/operation_3761"},{"term":"Query and retrieval","uri":"http://edamontology.org/operation_0224"},{"term":"PCR primer design","uri":"http://edamontology.org/operation_0308"}]}],"labels":{"accessibility":["Open access"],"collectionID":["Rare Disease"],"cost":"Free of charge","maturity":"Mature","operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application","Database portal"],"topic":[{"term":"Data integration and warehousing","uri":"http://edamontology.org/topic_3366"},{"term":"Database management","uri":"http://edamontology.org/topic_3489"},{"term":"Data mining","uri":"http://edamontology.org/topic_3473"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"}]},"publication":[{"abstract":"In addition to maintaining the GenBank nucleic acid sequence database, the National Center for Biotechnology Information (NCBI) provides analysis and retrieval resources for the data in GenBank and other biological data made available through the NCBI web site. NCBI resources include Entrez, the Entrez Programming Utilities, MyNCBI, PubMed, PubMed Central, Entrez Gene, the NCBI Taxonomy Browser, BLAST, BLAST Link (BLink), Electronic PCR, OrfFinder, Spidey, Splign, Reference Sequence, UniGene, HomoloGene, ProtEST, dbMHC, dbSNP, Cancer Chromosomes, Entrez Genomes and related tools, the Map Viewer, Model Maker, Evidence Viewer, Trace Archive, Sequence Read Archive, Retroviral Genotyping Tools, HIV-1/Human Protein Interaction Database, Gene Expression Omnibus, Entrez Probe, GENSAT, Online Mendelian Inheritance in Man, Online Mendelian Inheritance in Animals, the Molecular Modeling Database, the Conserved Domain Database, the Conserved Domain Architecture Retrieval Tool, Biosystems, Peptidome, Protein Clusters and the PubChem suite of small molecule databases. Augmenting many of the web applications are custom implementations of the BLAST program optimized to search specialized data sets. All these resources can be accessed through the NCBI home page at www.ncbi.nlm.nih.gov.","authors":["Sayers E.W.","Barrett T.","Benson D.A.","Bolton E.","Bryant S.H.","Canese K.","Chetvernin V.","Church D.M.","Dicuccio M.","Federhen S.","Feolo M.","Geer L.Y.","Helmberg W.","Kapustin Y.","Landsman D.","Lipman D.J.","Lu Z.","Madden T.L.","Madej T.","Maglott D.R.","Marchler-Bauer A.","Miller V.","Mizrachi I.","Ostell J.","Panchenko A.","Pruitt K.D.","Schuler G.D.","Sequeira E.","Sherry S.T.","Shumway M.","Sirotkin K.","Slotta D.","Souvorov A.","Starchenko G.","Tatusova T.A.","Wagner L.","Wang Y.","John Wilbur W.","Yaschenko E.","Ye J."],"cit_count":385,"journal":"Nucleic acids research","pmid":"19910364","title":"Database resources of the National Center for Biotechnology Information.","year":"2010-01-01"},{"abstract":"In addition to maintaining the GenBank® nucleic acid sequence database, the National Center for Biotechnology Information (NCBI) provides analysis and retrieval resources for the data in GenBank and other biological data made available through the NCBI Web site. NCBI resources include Entrez, the Entrez Programming Utilities, MyNCBI, PubMed, PubMed Central (PMC), Entrez Gene, the NCBI Taxonomy Browser, BLAST, BLAST Link (BLink), Primer-BLAST, COBALT, Electronic PCR, OrfFinder, Splign, ProSplign, RefSeq, UniGene, HomoloGene, ProtEST, dbMHC, dbSNP, dbVar, Epigenomics, Cancer Chromosomes, Entrez Genomes and related tools, the Map Viewer, Model Maker, Evidence Viewer, Trace Archive, Sequence Read Archive, Retroviral Genotyping Tools, HIV-1/Human Protein Interaction Database, Gene Expression Omnibus (GEO), Entrez Probe, GENSAT, Online Mendelian Inheritance in Man (OMIM), Online Mendelian Inheritance in Animals (OMIA), the Molecular Modeling Database (MMDB), the Conserved Domain Database (CDD), the Conserved Domain Architecture Retrieval Tool (CDART), IBIS, Biosystems, Peptidome, OMSSA, Protein Clusters and the PubChem suite of small molecule databases. Augmenting many of the Web applications are custom implementations of the BLAST program optimized to search specialized data sets. All of these resources can be accessed through the NCBI home page at www.ncbi.nlm .nih.gov. © The Author(s) 2010.","authors":["Sayers E.W.","Barrett T.","Benson D.A.","Bolton E.","Bryant S.H.","Canese K.","Chetvernin V.","Church D.M.","DiCuccio M.","Federhen S.","Feolo M.","Fingerman I.M.","Geer L.Y.","Helmberg W.","Kapustin Y.","Landsman D.","Lipman D.J.","Lu Z.","Madden T.L.","Madej T.","Maglott D.R.","Marchler-Bauer A.","Miller V.","Mizrachi I.","Ostell J.","Panchenko A.","Phan L.","Pruitt K.D.","Schuler G.D.","Sequeira E.","Sherry S.T.","Shumway M.","Sirotkin K.","Slotta D.","Souvorov A.","Starchenko G.","Tatusova T.A.","Wagner L.","Wang Y.","Wilbur W.J.","Yaschenko E.","Ye J."],"cit_count":440,"journal":"Nucleic Acids Research","pmid":"21097890","title":"Database resources of the national center for biotechnology information","year":"2011-01-01"},{"abstract":"In addition to maintaining the GenBank® nucleic acid sequence database, the National Center for Biotechnology Information (NCBI) provides analysis and retrieval resources for the data in GenBank and other biological data made available through the NCBI Website. NCBI resources include Entrez, the Entrez Programming Utilities, MyNCBI, PubMed, PubMed Central (PMC), Gene, the NCBI Taxonomy Browser, BLAST, BLAST Link (BLink), Primer-BLAST, COBALT, Splign, RefSeq, UniGene, HomoloGene, ProtEST, dbMHC, dbSNP, dbVar, Epigenomics, Genome and related tools, the Map Viewer, Model Maker, Evidence Viewer, Trace Archive, Sequence Read Archive, BioProject, BioSample, Retroviral Genotyping Tools, HIV-1/Human Protein Interaction Database, Gene Expression Omnibus (GEO), Probe, Online Mendelian Inheritance in Animals (OMIA), the Molecular Modeling Database (MMDB), the Conserved Domain Database (CDD), the Conserved Domain Architecture Retrieval Tool (CDART), Biosystems, Protein Clusters and the PubChem suite of small molecule databases. Augmenting many of the Web applications are custom implementations of the BLAST program optimized to search specialized data sets. All of these resources can be accessed through the NCBI home page at www.ncbi.nlm.nih.gov.","authors":["Sayers E.W.","Barrett T.","Benson D.A.","Bolton E.","Bryant S.H.","Canese K.","Chetvernin V.","Church D.M.","DiCuccio M.","Federhen S.","Feolo M.","Fingerman I.M.","Geer L.Y.","Helmberg W.","Kapustin Y.","Krasnov S.","Landsman D.","Lipman D.J.","Lu Z.","Madden T.L.","Madej T.","Maglott D.R.","Marchler-Bauer A.","Miller V.","Karsch-Mizrachi I.","Ostell J.","Panchenko A.","Phan L.","Pruitt K.D.","Schuler G.D.","Sequeira E.","Sherry S.T.","Shumway M.","Sirotkin K.","Slotta D.","Souvorov A.","Starchenko G.","Tatusova T.A.","Wagner L.","Wang Y.","Wilbur W.J.","Yaschenko E.","Ye J."],"cit_count":380,"journal":"Nucleic Acids Research","pmid":"22140104","title":"Database resources of the National Center for Biotechnology Information","year":"2012-01-01"}],"summary":{"biotoolsCURIE":"biotools:ncbi_resources","biotoolsID":"ncbi_resources","description":"The National Center for Biotechnology Information (NCBI) provides analysis and retrieval resources for the data in GenBank and other biological data made available through the NCBI web site.","homepage":"http://www.ncbi.nlm.nih.gov","name":"NCBI Resources"}}