{
    "additionDate": "2023-11-07T10:08:26.110740Z",
    "biotoolsCURIE": "biotools:igtcm",
    "biotoolsID": "igtcm",
    "confidence_flag": "high",
    "description": "An integrative genome database of traditional Chinese medicine plants.\n\nAn Integrative Genome Database of Traditional Chinese Medicines.\n\nIGTCM (An Integrative Genome Database of Traditional Chinese Medicines) is a comprehensive database of traditional Chinese medicine (TCM) genome and is also an integrative database of TCM with modern molecular biology. It contains six diverse components including herb, ingredient, gene, protein, rna and cds, which integrate TCM with modern molecular biology not only by internal molecular mechanism, also by enhanced understanding of secondary metabolic processes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://yeyn.group:96/",
    "lastUpdate": "2024-11-24T14:33:48.233812Z",
    "name": "IGTCM",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/tpg2.20317",
            "metadata": {
                "abstract": "Fully understanding traditional Chinese medicines (TCMs) is still challenging because of the extreme complexity of their chemical components and mechanisms of action. The TCM Plant Genome Project aimed to obtain genetic information, determine gene functions, discover regulatory networks of herbal species, and elucidate the molecular mechanisms involved in the disease prevention and treatment, thereby accelerating the modernization of TCMs. A comprehensive database that contains TCM-related information will provide a vital resource. Here, we present an integrative genome database of TCM plants (IGTCM) that contains 14,711,220 records of 83 annotated TCM-related herb genomes, including 3,610,350 genes, 3,534,314 proteins and corresponding coding sequences, and 4,032,242 RNAs, as well as 1033 non-redundant component records for 68 herbs, downloaded and integrated from the GenBank and RefSeq databases. For minimal interconnectivity, each gene, protein, and component was annotated using the eggNOG-mapper tool and Kyoto Encyclopedia of Genes and Genomes database to acquire pathway information and enzyme classifications. These features can be linked across several species and different components. The IGTCM database also provides visualization and sequence similarity search tools for data analyses. These annotated herb genome sequences in IGTCM database are a necessary resource for systematically exploring genes related to the biosynthesis of compounds that have significant medicinal activities and excellent agronomic traits that can be used to improve TCM-related varieties through molecular breeding. It also provides valuable data and tools for future research on drug discovery and the protection and rational use of TCM plant resources. The IGTCM database is freely available at http://yeyn.group:96/.",
                "authors": [
                    {
                        "name": "Jin S."
                    },
                    {
                        "name": "Liang D.-F."
                    },
                    {
                        "name": "Ye Y.-N."
                    },
                    {
                        "name": "Yi J.-H."
                    },
                    {
                        "name": "Zeng Z."
                    }
                ],
                "citationCount": 2,
                "date": "2023-06-01T00:00:00Z",
                "journal": "Plant Genome",
                "title": "IGTCM: An integrative genome database of traditional Chinese medicine plants"
            },
            "pmid": "36896476"
        }
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ]
}
