{
    "additionDate": "2019-11-14T20:06:50Z",
    "biotoolsCURIE": "biotools:MoRF",
    "biotoolsID": "MoRF",
    "confidence_flag": "tool",
    "description": "Identifying Molecular Recognition Features in Intrinsically Disordered Regions of Proteins by Transfer Learning | AVAILABILITY HTML server, please click here. RESTful web server, please click here. (Updated Apr. 10, 2018) Downloadable software, please click here. OVERVIEW A new computational approach for a fast and accurate prediction of MoRFs in protein sequences. MoRFchibi SYSTEM (Malhis et al 2016) includes three different predictors: MoRFCHiBi is most appropriate as a component predictor in other applications. […] | The University of British Columbia",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein disorder prediction",
                    "uri": "http://edamontology.org/operation_3904"
                },
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Sequence feature detection",
                    "uri": "http://edamontology.org/operation_0253"
                }
            ]
        }
    ],
    "homepage": "https://gsponerlab.msl.ubc.ca/software/morf_chibi/",
    "lastUpdate": "2020-12-29T10:10:41Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/roneshsharma/MoRFpred-plus"
        }
    ],
    "name": "MoRF",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ691",
            "metadata": {
                "abstract": "© 2020 Oxford University Press. All rights reserved.Motivation: Protein intrinsic disorder describes the tendency of sequence residues to not fold into a rigid three-dimensional shape by themselves. However, some of these disordered regions can transition from disorder to order when interacting with another molecule in segments known as molecular recognition features (MoRFs). Previous analysis has shown that these MoRF regions are indirectly encoded within the prediction of residue disorder as low-confidence predictions [i.e. in a semi-disordered state P(D)≈0.5]. Thus, what has been learned for disorder prediction may be transferable to MoRF prediction. Transferring the internal characterization of protein disorder for the prediction of MoRF residues would allow us to take advantage of the large training set available for disorder prediction, enabling the training of larger analytical models than is currently feasible on the small number of currently available annotated MoRF proteins. In this paper, we propose a new method for MoRF prediction by transfer learning from the SPOT-Disorder2 ensemble models built for disorder prediction. Results: We confirm that directly training on the MoRF set with a randomly initialized model yields substantially poorer performance on independent test sets than by using the transfer-learning-based method SPOT-MoRF, for both deep and simple networks. Its comparison to current state-of-the-art techniques reveals its superior performance in identifying MoRF binding regions in proteins across two independent testing sets, including our new dataset of >800 protein chains. These test chains share <30% sequence similarity to all training and validation proteins used in SPOT-Disorder2 and SPOT-MoRF, and provide a much-needed large-scale update on the performance of current MoRF predictors. The method is expected to be useful in locating functional disordered regions in proteins.",
                "authors": [
                    {
                        "name": "Hanson J."
                    },
                    {
                        "name": "Litfin T."
                    },
                    {
                        "name": "Paliwal K."
                    },
                    {
                        "name": "Zhou Y."
                    }
                ],
                "citationCount": 3,
                "date": "2020-02-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Identifying molecular recognition features in intrinsically disordered regions of proteins by transfer learning"
            },
            "pmid": "31504193"
        }
    ],
    "toolType": [
        "Web application",
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        },
        {
            "term": "Protein disordered structure",
            "uri": "http://edamontology.org/topic_3538"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}