{
    "additionDate": "2021-06-14T12:44:15Z",
    "biotoolsCURIE": "biotools:anne-o-tate",
    "biotoolsID": "anne-o-tate",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "neils@uic.edu",
            "name": "Neil R. Smalheiser",
            "orcidid": "https://orcid.org/0000-0003-1079-3406",
            "typeEntity": "Person"
        }
    ],
    "description": "Anne O’Tate is a value-added PubMed search engine for analysis and text mining.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                }
            ]
        }
    ],
    "homepage": "http://arrowsmith.psych.uic.edu/cgi-bin/arrowsmith_uic/AnneOTate.cgi",
    "lastUpdate": "2021-08-13T07:23:57Z",
    "name": "Anne O Tate",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0248335",
            "metadata": {
                "abstract": "© 2021 Smalheiser et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Over a decade ago, we introduced Anne O’Tate, a free, public web-based tool http://arrowsmith.psych.uic.edu/cgi-bin/arrowsmith_uic/AnneOTate.cgi to support user-driven summarization, drill-down and mining of search results from PubMed, the leading search engine for biomedical literature. A set of hotlinked buttons allows the user to sort and rank retrieved articles according to important words in titles and abstracts; topics; author names; affiliations; journal names; publication year; and clustered by topic. Any result can be further mined by choosing any other button, and small search results can be expanded to include related articles. It has been deployed continuously, serving a wide range of biomedical users and needs, and over time has also served as a platform to support the creation of new tools that address additional needs. Here we describe the current, greatly expanded implementation of Anne O’Tate, which has added additional buttons to provide new functionalities: We now allow users to sort and rank search results by important phrases contained in titles and abstracts; the number of authors listed on the article; and pairs of topics that co-occur significantly more than chance. We also display articles according to NLM-indexed publication types, as well as according to 50 different publication types and study designs as predicted by a novel machine learning-based model. Furthermore, users can import search results into two new tools: e) Mine the Gap!, which identifies pairs of topics that are underrepresented within set of the search results, and f) Citation Cloud, which for any given article, allows users to visualize the set of articles that cite it; that are cited by it; that are co-cited with it; and that are bibliographically coupled to it. We invite the scientific community to explore how Anne O’Tate can assist in analyzing biomedical literature, in a variety of use cases.",
                "authors": [
                    {
                        "name": "Smalheiser N.R."
                    },
                    {
                        "name": "Fragnito D.P."
                    },
                    {
                        "name": "Tirk E.E."
                    }
                ],
                "date": "2021-03-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Anne O’Tate: Value-added PubMed search engine for analysis and text mining"
            },
            "pmcid": "PMC7939269",
            "pmid": "33684153"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        }
    ]
}