
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://statgenpro.psychiatry.hku.hk/limx/homepage/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://grass.cgs.hku.hk/limx/igg/doc/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Genotyping",
                "uri": "http://edamontology.org/topic_0625"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Studies",
                "uri": "http://edamontology.org/topic_3678"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/igg-3-0-integrate-genotypes-genome-wide-genetic-studies.html"
        }
    ],
    "publication": [
        {
            "abstract": "Summary: There is an urgent and increasing demand for integrating large genotype datasets across genome-wide association studies and HapMap project for whole-genome imputation and individual-level meta-analysis. A new algorithm was developed to efficiently merge raw genotypes across large datasets and implemented in the latest version of IGG, IGG3. In addition, IGG3 can integrate the latest phased and unphased HapMap genotypes and can flexibly generate complete sets of input files for six popular genotype imputation tools. We demonstrated the efficiency of IGG3 by simulation tests, which could rapidly merge genotypes in tens of thousands of large genotype chips (e.g. Affymetrix Genome-Wide Human SNP Array 6.0 and Illumina Human1m-duo) and in HapMap III project on an ordinary desktop computer. © The Author 2009. Published by Oxford University Press. All rights reserved.",
            "authors": [
                "Li M.-X.",
                "Jiang L.",
                "Kao P.Y.-P.",
                "Sham P.-C.",
                "Song Y.-Q."
            ],
            "cit_count": 10,
            "doi": "10.1093/bioinformatics/btp183",
            "journal": "Bioinformatics",
            "title": "IGG3: A tool to rapidly integrate large genotype datasets for whole-genome imputation and individual-level meta-analysis",
            "type": "Primary",
            "year": "2009-06-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:igg",
        "biotoolsID": "igg",
        "description": "IGG (Integrate Genotypes for genome-wide Genetic studies) is an open-source Java package with graphic interface to efficiently and consistently integrate genotypes across high throughput genotyping platforms (e.g., Affymetrix and Illumina), the HapMap genotype repository (http://www.hapmap.org/), and even genotypes from the collaborators’ projects. It is equipped with a series of functions to control qualities of genotype integration and to flexibly export genotypes for genetic studies as well.",
        "homepage": "http://statgenpro.psychiatry.hku.hk/limx/igg/",
        "name": "IGG",
        "version": [
            "3.0"
        ]
    }
}