{
    "additionDate": "2021-01-18T12:03:47Z",
    "biotoolsCURIE": "biotools:cancergram",
    "biotoolsID": "cancergram",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "przemyslaw.gagat@uwr.edu.pl",
            "name": "Przemysław Gagat",
            "orcidid": "https://orcid.org/0000-0001-9077-439X",
            "typeEntity": "Person"
        }
    ],
    "description": "CancerGram identifies anticancer peptides using random forests and n-gram encoding.\nAntimicrobial peptides (AMPs) constitute a diverse group of bioactive molecules that provide multicellular organisms with protection against microorganisms, and microorganisms with weaponry for competition. Some AMPs can target cancer cells; thus, they are called anticancer peptides (ACPs). Due to their small size, positive charge, hydrophobicity and amphipathicity, AMPs and ACPs interact with negatively charged components of biological membranes. AMPs preferentially permeabilize microbial membranes, but ACPs additionally target mitochondrial and plasma membranes of cancer cells.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://biongram.biotech.uni.wroc.pl/CancerGram/",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-07T12:32:45Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/BioGenies/CancerGram-analysis"
        }
    ],
    "name": "CancerGram",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3390/PHARMACEUTICS12111045",
            "metadata": {
                "abstract": "© 2020 by the authors. Licensee MDPI, Basel, Switzerland.Antimicrobial peptides (AMPs) constitute a diverse group of bioactive molecules that provide multicellular organisms with protection against microorganisms, and microorganisms with weaponry for competition. Some AMPs can target cancer cells; thus, they are called anticancer peptides (ACPs). Due to their small size, positive charge, hydrophobicity and amphipathicity, AMPs and ACPs interact with negatively charged components of biological membranes. AMPs preferentially permeabilize microbial membranes, but ACPs additionally target mitochondrial and plasma membranes of cancer cells. The preference towards mitochondrial membranes is explained by their membrane potential, membrane composition resulting from α-proteobacterial origin and the fact that mitochondrial targeting signals could have evolved from AMPs. Taking into account the therapeutic potential of ACPs and millions of deaths due to cancer annually, it is of vital importance to find new cationic peptides that selectively destroy cancer cells. Therefore, to reduce the costs of experimental research, we have created a robust computational tool, CancerGram, that uses n-grams and random forests for predicting ACPs. Compared to other ACP classifiers, CancerGram is the first three-class model that effectively classifies peptides into: ACPs, AMPs and non-ACPs/non-AMPs, with AU1U amounting to 0.89 and a Kappa statistic of 0.65. CancerGram is available as a web server and R package on GitHub.",
                "authors": [
                    {
                        "name": "Burdukiewicz M."
                    },
                    {
                        "name": "Sidorczuk K."
                    },
                    {
                        "name": "Rafacz D."
                    },
                    {
                        "name": "Pietluch F."
                    },
                    {
                        "name": "Bakala M."
                    },
                    {
                        "name": "Slowik J."
                    },
                    {
                        "name": "Gagat P."
                    }
                ],
                "citationCount": 1,
                "date": "2020-11-01T00:00:00Z",
                "journal": "Pharmaceutics",
                "title": "Cancergram: An effective classifier for differentiating anticancer from antimicrobial peptides"
            },
            "pmcid": "PMC7692641",
            "pmid": "33142753"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        }
    ]
}