{
    "accessibility": "Open access",
    "additionDate": "2022-08-28T21:43:41.409067Z",
    "biotoolsCURIE": "biotools:irex",
    "biotoolsID": "irex",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "emily.serdoz@vumc.org",
            "name": "Emily Sheffer Serdoz",
            "orcidid": "https://orcid.org/0000-0003-2512-7019",
            "typeEntity": "Person"
        },
        {
            "name": "Gordon R. Bernard"
        },
        {
            "name": "Julie Ozier"
        },
        {
            "name": "Todd W. Rice"
        },
        {
            "name": "Paul Harris",
            "orcidid": "https://orcid.org/0000-0002-1744-2011"
        }
    ],
    "description": "A national web-based platform for operationalizing single IRB review.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "PTM localisation",
                    "uri": "http://edamontology.org/operation_3755"
                }
            ]
        }
    ],
    "homepage": "https://IRBExchange.org",
    "lastUpdate": "2022-08-28T21:43:41.413549Z",
    "name": "IREx",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1017/CTS.2022.376",
            "metadata": {
                "abstract": "© For decades, the research community called for streamlined Institutional Review Board (IRB) review processes for multisite studies. Department of Health and Human Services and National Institutes of Health (NIH) recognized this need and implemented single IRB (sIRB) of record mandates. However, announcing mandates without sufficient operational guidance and tools is insufficient to foster the desired change. Nearly 4 years into implementation of the NIH's sIRB mandate, operational challenges remain. Fortunately, NIH supports a web-based sIRB platform, the IRB Reliance Exchange (IREx), to facilitate sIRB communication and documentation. IREx has received continuous NIH funding supporting its evolution since 2011 and is now used by over 5,000 Human Research Protection Program and research personnel, 35 sIRBs, and 415 participating sites to operationalize sIRB review and approval on over 400 studies. IREx supports over 2300 reliance relationships with an average of 7 sites per study. The platform is continually used by sIRBs and relying sites, providing a valuable centralized portal for promoting a harmonized sIRB review process. IREx can promote transparency, standardize practice, minimize workflow variation, and mitigate the need for sIRBs to implement significant technical changes to their local electronic systems. IREx has proven to be nimble and adaptable with practice and policy changes over the past decade, as evidenced by continually increasing platform utilization.",
                "authors": [
                    {
                        "name": "Beadles J."
                    },
                    {
                        "name": "Bernard G.R."
                    },
                    {
                        "name": "Edwards T."
                    },
                    {
                        "name": "Harris P."
                    },
                    {
                        "name": "Ozier J."
                    },
                    {
                        "name": "Pulley J."
                    },
                    {
                        "name": "Rice T.W."
                    },
                    {
                        "name": "Serdoz E.S."
                    }
                ],
                "date": "2022-03-23T00:00:00Z",
                "journal": "Journal of Clinical and Translational Science",
                "title": "The IRB Reliance Exchange (IREx): A national web-based platform for operationalizing single IRB review"
            },
            "pmcid": "PMC9066316",
            "pmid": "35574155"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
