{
    "additionDate": "2018-07-28T08:29:13Z",
    "biotoolsCURIE": "biotools:unitas",
    "biotoolsID": "unitas",
    "credit": [
        {
            "email": "dgebert@students.uni-mainz.de",
            "name": "Daniel Gebert",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Complete annotation of small RNA datasets from NGS.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://sourceforge.net/#!/projects/unitas/files/readme.txt/download"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence annotation",
                    "uri": "http://edamontology.org/operation_0361"
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/projects/unitas/files/",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "license": "GPL-3.0",
    "name": "unitas",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s12864-017-4031-9",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: Next generation sequencing is a key technique in small RNA biology research that has led to the discovery of functionally different classes of small non-coding RNAs in the past years. However, reliable annotation of the extensive amounts of small non-coding RNA data produced by high-throughput sequencing is time-consuming and requires robust bioinformatics expertise. Moreover, existing tools have a number of shortcomings including a lack of sensitivity under certain conditions, limited number of supported species or detectable sub-classes of small RNAs. Results: Here we introduce unitas, an out-of-the-box ready software for complete annotation of small RNA sequence datasets, supporting the wide range of species for which non-coding RNA reference sequences are available in the Ensembl databases (currently more than 800). unitas combines high quality annotation and numerous analysis features in a user-friendly manner. A complete annotation can be started with one simple shell command, making unitas particularly useful for researchers not having access to a bioinformatics facility. Noteworthy, the algorithms implemented in unitas are on par or even outperform comparable existing tools for small RNA annotation that map to publicly available ncRNA databases. Conclusions: unitas brings together annotation and analysis features that hitherto required the installation of numerous different bioinformatics tools which can pose a challenge for the non-expert user. With this, unitas overcomes the problem of read normalization. Moreover, the high quality of sequence annotation and analysis, paired with the ease of use, make unitas a valuable tool for researchers in all fields connected to small RNA biology.",
                "authors": [
                    {
                        "name": "Gebert D."
                    },
                    {
                        "name": "Hewel C."
                    },
                    {
                        "name": "Rosenkranz D."
                    }
                ],
                "citationCount": 17,
                "date": "2017-08-22T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Unitas: The universal tool for annotation of small RNAs"
            },
            "pmcid": "PMC5567656",
            "pmid": "28830358"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        }
    ],
    "validated": 1
}