
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Incident curve plotting",
                    "uri": "http://edamontology.org/operation_3503"
                }
            ]
        }
    ],
    "labels": {
        "topic": [
            {
                "term": "Endocrinology and metabolism",
                "uri": "http://edamontology.org/topic_3407"
            },
            {
                "term": "Geriatric medicine",
                "uri": "http://edamontology.org/topic_3399"
            },
            {
                "term": "Nutritional science",
                "uri": "http://edamontology.org/topic_3390"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019, International Osteoporosis Foundation and National Osteoporosis Foundation.Summary: Osteoporosis is a metabolic disorder that results in increased bone fragility and risk of fractures. Hip fracture is the most important fragility fracture. Fracture Liaison Service (FLS) is a secondary prevention model which identifies patients at risk for fragility fractures. The introduction of an intensive FLS model could decrease 1-year-mortality of hip fracture patients. Introduction: Hip fractures are a clinical manifestation of osteoporosis, and these patients are at risk of premature death and suffering subsequent fractures. FLS is an approach for secondary facture prevention by identifying patients with fragility fractures and initiating the appropriate treatment. Our objective is to analyze the effect of the FLS model over the first-year mortality rates following a hip fracture. Methods: We conducted a prospective cohort study on patients over 60 years of age who suffered a hip fracture during two consecutive years, before and after the implementation of the FLS in our center (i.e., between January 2016 and December 2017). Patients’ information was withdrawn from our local computerized database. Patients were followed for 1 year after the hip fracture. Mortality and re-fracture rates were compared between the two groups using a multivariate Cox proportional hazard model. Results: A total of 724 individuals were included in this study (i.e., 357 before FLS implementation and 367 after FLS implementation). Anti-osteoporotic drugs were more frequently prescribed after FLS implementation [275 (74.9%) vs 44 (12.3%); p < 0.01]. A total of 74 (20.2%) patients after FLS implementation and 92 (25.8%) individuals before FLS implementation (p = 0.07) died during the follow-up period. A second fracture occurred in 17 (4.6%) patients after FLS implementation and 13 (3.6%) individuals before FLS implementation (p = 0.50). Patients who were treated with anti-osteoporotic drugs after the implementation of the FLS protocol had a lower 1-year mortality compared with patients managed before the implementation of the FLS protocol (treated or not treated with anti-osteoporotic drugs) [adjusted hazard ratio (HR) 0.66; 95% confidence interval (CI) 0.47–0.94; p < 0.05]. Conclusions: We did not observe significant 1-year-mortality differences following a hip fracture between patients treated before the implementation of an FLS protocol and patients treated after its implementation. The application of the FLS did not affect the risk of suffering a second osteoporotic fracture. However, patients treated with anti-osteoporotic drugs in an FLS context had a lower mortality rate compared with patients managed before the implementation of the FLS. Level of clinical evidence: 2.",
            "authors": [
                "Gonzalez-Quevedo D.",
                "Bautista-Enrique D.",
                "Perez-del-Rio V.",
                "Bravo-Bardaji M.",
                "Garcia-de-Quevedo D.",
                "Tamimi I."
            ],
            "cit_count": 0,
            "doi": "10.1007/S00198-019-05153-W",
            "journal": "Osteoporosis International",
            "pmid": "31511912",
            "title": "Fracture liaison service and mortality in elderly hip fracture patients: a prospective cohort study",
            "year": "2019-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:FLS",
        "biotoolsID": "FLS",
        "description": "> LOW CONFIDENCE! | > HOMEPAGE MISSING! | Fracture liaison service and mortality in elderly hip fracture patients | Osteoporosis is a metabolic disorder that results in increased bone fragility and risk of fractures. Hip fracture is the most important fragility fracture. Fracture Liaison Service (FLS) is a secondary prevention model which identifies patients at risk for fragility fractures. The introduction of an intensive FLS model could decrease 1-year-mortality of hip fracture patients. INTRODUCTION:Hip fractures are a clinical manifestation of osteoporosis, and these patients are at risk of premature death and suffering subsequent fractures. FLS is an approach for secondary facture prevention by identifying patients with fragility fractures and initiating the appropriate treatment. Our objective is to analyze the effect of the FLS model over the first-year mortality rates following a hip fracture",
        "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31511912",
        "name": "FLS"
    }
}