{
    "additionDate": "2024-01-10T12:24:42.519781Z",
    "biotoolsCURIE": "biotools:vemp",
    "biotoolsID": "vemp",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "415794814@qq.com",
            "name": "Jiayu Lin",
            "typeEntity": "Person"
        },
        {
            "email": "hh-p@163.com",
            "name": "Huapin Huang",
            "typeEntity": "Person"
        }
    ],
    "description": "Cervical and ocular vestibular evoked myogenic potentials in patients with diabetic peripheral neuropathy.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://fyey.shinyapps.io/VEMP_Model/",
    "lastUpdate": "2024-01-10T12:24:42.522423Z",
    "name": "VEMP",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S13098-023-01068-Z",
            "metadata": {
                "abstract": "Background: Diabetes causes impaired microarterial blood flow, demyelination and neuronal damage, which may lead to cochlear damage and vestibular malfunction. Vestibular evoked myogenic potentials (VEMP) is a simple, reproducible test. Cervical and ocular vestibular evoked myogenic potentials (cVEMP and oVEMP) can be explored in the saccadic-spinal and utriculo-ocular pathways in regular clinical practice. Objective: To evaluate possible vestibular evoked myogenic potential (VEMP) abnormalities in patients with diabetic peripheral neuropathy. Materials and methods: 89 patients with Type 2 Diabetes in the present study consisted of three groups: 29 patients with no peripheral neuropathy (NDPN group), 26 patients with asymptomatic neuropathy (SDPN group), 34 patients with symptomatic neuropathy (DPN group). Meanwhile, 42 healthy subjects were recruited as controls. The clinical characteristics (including gender, age, body mass index (BMI), and illness duration), as well as lipids (including triglyceride (TG), cholesterol (TC), low-density lipoprotein (LDL), and high-density lipoprotein (HDL)), uric acid, fasting blood glucose (FBG), and glycated hemoglobin (HbA1c) were compared among the four groups. Four groups were assessed using two vestibular tests including oVEMP and cVEMP. Latency and amplitude parameters were analyzed from VEMP plots. Results: The latency of n10, p15 (oVEMP), p13, n23 (cVEMP) were significantly prolonged in the SDPN and DPN groups compared with the control and NDPN groups (p < 0.01), whereas latencies were similar in NDPN and the control groups. The amplitudes were not significantly different (p > 0.05). oVEMP latency p15 and cVEMP latency (p13, n23) were positively correlated with HbA1c, FBG, and illness duration, and oVEMP latency n10 was positively correlated with HbA1c and FBG. A nomogram, including FBG, HbA1C, HDL, TG, TC, LDL and group, was constructed to predict VEMP parameters and p13 was found to be independently associated with diabetic subgroups. Receiver operating characteristic curve (ROC) analysis showed good accuracy in predicting p13 in this nomogram. A user-friendly website has been created to facilitate the application of this prediction model (https://fyey.shinyapps.io/VEMP_Model/). Conclusion: Patients with diabetic peripheral neuropathy may have vestibular dysfunction. VEMP may be useful in assessing vestibular impairment in diabetic patients.",
                "authors": [
                    {
                        "name": "Bai X."
                    },
                    {
                        "name": "Huang H."
                    },
                    {
                        "name": "Huang Y."
                    },
                    {
                        "name": "Lin J."
                    },
                    {
                        "name": "Ye L."
                    },
                    {
                        "name": "Zhang J."
                    }
                ],
                "citationCount": 1,
                "date": "2023-12-01T00:00:00Z",
                "journal": "Diabetology and Metabolic Syndrome",
                "title": "Cervical and ocular vestibular evoked myogenic potentials in patients with Diabetic Peripheral Neuropathy"
            },
            "pmcid": "PMC10176784",
            "pmid": "37170313"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Membrane and lipoproteins",
            "uri": "http://edamontology.org/topic_0820"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        }
    ]
}
