{
    "additionDate": "2020-01-09T17:59:32Z",
    "biotoolsCURIE": "biotools:dcmqi",
    "biotoolsID": "dcmqi",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "andrey.fedorov@gmail.com",
            "name": "Andriy Fedorov",
            "typeEntity": "Person"
        }
    ],
    "description": "DCMQI (DICOM for Quantitative Imaging) is a free, open source library that can help with the conversion between imaging research formats and the standard DICOM representation for image analysis results.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://wiki.slicer.org/slicerWiki/index.php/Documentation/Nightly/Modules/DICOMPETSUVPlugin"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/QIICR/Slicer-PETDICOMExtension/tree/master/DICOMPETSUVPlugin"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                }
            ]
        }
    ],
    "homepage": "https://github.com/QIICR/dcmqi",
    "language": [
        "Shell",
        "C++",
        "Python"
    ],
    "lastUpdate": "2021-01-11T13:02:02Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/QIICR/dcmqi/issues"
        }
    ],
    "name": "DCMQI",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.7287/PEERJ.PREPRINTS.1541V2",
            "pmcid": "PMC4888317",
            "pmid": "27257542"
        },
        {
            "doi": "10.7717/peerj.2057",
            "metadata": {
                "abstract": "© 2016 Fedorov et al.Background. Imaging biomarkers hold tremendous promise for precision medicine clinical applications. Development of such biomarkers relies heavily on image post-processing tools for automated image quantitation. Their deployment in the context of clinical research necessitates interoperability with the clinical systems. Comparison with the established outcomes and evaluation tasks motivate integration of the clinical and imaging data, and the use of standardized approaches to support annotation and sharing of the analysis results and semantics. We developed the methodology and tools to support these tasks in Positron Emission Tomography and Computed Tomography (PET/CT) quantitative imaging (QI) biomarker development applied to head and neck cancer (HNC) treatment response assessment, using the Digital Imaging and Communications in Medicine (DICOM®) international standard and free open-source software. Methods. Quantitative analysis of PET/CT imaging data collected on patients undergoing treatment for HNC was conducted. Processing steps included Standardized Uptake Value (SUV) normalization of the images, segmentation of the tumor using manual and semi-automatic approaches, automatic segmentation of the reference regions, and extraction of the volumetric segmentation-based measurements. Suitable components of the DICOM standard were identified to model the various types of data produced by the analysis. A developer toolkit of conversion routines and an Application Programming Interface (API) were contributed and applied to create a standards-based representation of the data. Results. DICOM Real World Value Mapping, Segmentation and Structured Reporting objects were utilized for standards-compliant representation of the PET/CT QI analysis results and relevant clinical data. A number of correction proposals to the standard were developed. The open-source DICOM toolkit (DCMTK) was improved to simplify the task of DICOM encoding by introducing new API abstractions. Conversion and visualization tools utilizing this toolkit were developed. The encoded objects were validated for consistency and interoperability. The resulting dataset was deposited in the QIN-HEADNECK collection of The Cancer Imaging Archive (TCIA). Supporting tools for data analysis and DICOM conversion were made available as free open-source software. Discussion. We presented a detailed investigation of the development and application of the DICOM model, as well as the supporting open-source tools and toolkits, to accommodate representation of the research data in QI biomarker development. We demonstrated that the DICOM standard can be used to represent the types of data relevant in HNC QI biomarker development, and encode their complex relationships. The resulting annotated objects are amenable to data mining applications, and are interoperable with a variety of systems that support the DICOM standard.",
                "authors": [
                    {
                        "name": "Fedorov A."
                    },
                    {
                        "name": "Clunie D."
                    },
                    {
                        "name": "Ulrich E."
                    },
                    {
                        "name": "Bauer C."
                    },
                    {
                        "name": "Wahle A."
                    },
                    {
                        "name": "Brown B."
                    },
                    {
                        "name": "Onken M."
                    },
                    {
                        "name": "Riesmeier J."
                    },
                    {
                        "name": "Pieper S."
                    },
                    {
                        "name": "Kikinis R."
                    },
                    {
                        "name": "Buatti J."
                    },
                    {
                        "name": "Beichel R.R."
                    }
                ],
                "citationCount": 35,
                "date": "2016-01-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "DICOM for quantitative imaging biomarker development: A standards based approach to sharing clinical data and structured PET/CT analysis results in head and neck cancer research"
            },
            "pmcid": "PMC4888317",
            "pmid": "27257542",
            "type": [
                "Primary"
            ]
        }
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        }
    ],
    "validated": 1
}