{
    "additionDate": "2016-03-03T13:39:08Z",
    "biotoolsCURIE": "biotools:espritz",
    "biotoolsID": "espritz",
    "credit": [
        {
            "name": "ELIXIR-ITA-PADOVA",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "silvio.tosatto@unipd.it",
            "name": "Silvio C.E. Tosatto",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://protein.bio.unipd.it"
        }
    ],
    "description": "Efficient disorder prediction tool.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://protein.bio.unipd.it/espritz/help_pages/help.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "note": "Espritz is a new web server to detect regions of proteins which are thought to contain no structural content.",
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "http://protein.bio.unipd.it/espritz",
    "lastUpdate": "2018-12-10T12:58:50Z",
    "name": "ESpritz",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-ITA-PADOVA",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btr682",
            "metadata": {
                "abstract": "Motivation: Intrinsically disordered regions are key for the function of numerous proteins, and the scant available experimental annotations suggest the existence of different disorder flavors. While efficient predictions are required to annotate entire genomes, most existing methods require sequence profiles for disorder prediction, making them cumbersome for high-throughput applications.Results: In this work, we present an ensemble of protein disorder predictors called ESpritz. These are based on bidirectional recursive neural networks and trained on three different flavors of disorder, including a novel NMR flexibility predictor. ESpritz can produce fast and accurate sequence-only predictions, annotating entire genomes in the order of hours on a single processor core. Alternatively, a slower but slightly more accurate ESpritz variant using sequence profiles can be used for applications requiring maximum performance. Two levels of prediction confidence allow either to maximize reasonable disorder detection or to limit expected false positives to 5%. ESpritz performs consistently well on the recent CASP9 data, reaching a S w measure of 54.82 and area under the receiver operator curve of 0.856. The fast predictor is four orders of magnitude faster and remains better than most publicly available CASP9 methods, making it ideal for genomic scale predictions. Conclusions: ESpritz predicts three flavors of disorder at two distinct false positive rates, either with a fast or slower and slightly more accurate approach. Given its state-of-the-art performance, it can be especially useful for high-throughput applications. © The Author 2011. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Walsh I."
                    },
                    {
                        "name": "Martin A.J.M."
                    },
                    {
                        "name": "Di domenico T."
                    },
                    {
                        "name": "Tosatto S.C.E."
                    }
                ],
                "citationCount": 162,
                "date": "2012-02-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Espritz: Accurate and fast prediction of protein disorder"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        }
    ],
    "validated": 1,
    "version": [
        "1.3"
    ]
}