{"credit":[{"email":"ashwini@hgc.jp","name":"Ashwini Patil","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"alok.sharma@griffith.edu.au","name":"Alok Sharma","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://github.com/roneshsharma/OPAL/wiki"}],"function":[{"operation":[{"term":"Protein structural motif recognition","uri":"http://edamontology.org/operation_0245"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Proteins","uri":"http://edamontology.org/topic_0078"},{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"},{"term":"Protein structure analysis","uri":"http://edamontology.org/topic_2814"},{"term":"Protein folds and structural domains","uri":"http://edamontology.org/topic_0736"}]},"publication":[{"abstract":"© The Author(s) 2018. Published by Oxford University Press.Motivation Intrinsically disordered proteins lack stable 3-dimensional structure and play a crucial role in performing various biological functions. Key to their biological function are the molecular recognition features (MoRFs) located within long disordered regions. Computationally identifying these MoRFs from disordered protein sequences is a challenging task. In this study, we present a new MoRF predictor, OPAL, to identify MoRFs in disordered protein sequences. OPAL utilizes two independent sources of information computed using different component predictors. The scores are processed and combined using common averaging method. The first score is computed using a component MoRF predictor which utilizes composition and sequence similarity of MoRF and non-MoRF regions to detect MoRFs. The second score is calculated using half-sphere exposure (HSE), solvent accessible surface area (ASA) and backbone angle information of the disordered protein sequence, using information from the amino acid properties of flanks surrounding the MoRFs to distinguish MoRF and non-MoRF residues. Results OPAL is evaluated using test sets that were previously used to evaluate MoRF predictors, MoRFpred, MoRFchibi and MoRFchibi-web. The results demonstrate that OPAL outperforms all the available MoRF predictors and is the most accurate predictor available for MoRF prediction.","authors":["Sharma R.","Raicar G.","Tsunoda T.","Patil A.","Sharma A."],"cit_count":6,"doi":"10.1093/bioinformatics/bty032","journal":"Bioinformatics","title":"OPAL: Prediction of MoRF regions in intrinsically disordered protein sequences","year":"2018-06-01"}],"summary":{"biotoolsCURIE":"biotools:opal","biotoolsID":"opal","description":"Prediction of MoRF regions in intrinsically disordered protein sequences.","homepage":"http://www.alok-ai-lab.com/tools/opal/","name":"OPAL"}}