{
    "additionDate": "2018-05-12T10:31:58Z",
    "biotoolsCURIE": "biotools:simplesynteny",
    "biotoolsID": "simplesynteny",
    "credit": [
        {
            "email": "dan.veltri@gmail.com",
            "name": "Dan Veltri",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Visualization of microsynteny across multiple species.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://www.dveltri.com/simplesynteny/faq.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Multiple sample visualisation",
                    "uri": "http://edamontology.org/operation_3744"
                }
            ]
        }
    ],
    "homepage": "https://www.dveltri.com/simplesynteny/",
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "SimpleSynteny",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/NAR/GKW330",
            "metadata": {
                "abstract": "Published by Oxford University Press on behalf of Nucleic Acids Research 2016. This work is written by (a) US Government employee(s) and is in the public domain in the US.Defining syntenic relationships among orthologous gene clusters is a frequent undertaking of biologists studying organismal evolution through comparative genomic approaches. With the increasing availability of genome data made possible through next-generation sequencing technology, there is a growing need for user-friendly tools capable of assessing synteny. Here we present SimpleSynteny, a new web-based platform capable of directly interrogating collinearity of local genomic neighbors across multiple species in a targeted manner. SimpleSynteny provides a pipeline for evaluating the synteny of a preselected set of gene targets across multiple organismal genomes. An emphasis has been placed on ease-of-use, and users are only required to submit FASTA files for their genomes and genes of interest. SimpleSynteny then guides the user through an iterative process of exploring and customizing genomes individually before combining them into a final high-resolution figure. Because the process is iterative, it allows the user to customize the organization of multiple contigs and incorporate knowledge from additional sources, rather than forcing complete dependence on the computational predictions. Additional tools are provided to help the user identify which contigs in a genome assembly contain gene targets and to optimize analyses of circular genomes. SimpleSynteny is freely available at: http://www.SimpleSynteny.com.",
                "authors": [
                    {
                        "name": "Veltri D."
                    },
                    {
                        "name": "Wight M.M."
                    },
                    {
                        "name": "Crouch J.A."
                    }
                ],
                "citationCount": 44,
                "date": "2016-07-08T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "SimpleSynteny: a web-based tool for visualization of microsynteny across multiple species"
            },
            "pmcid": "PMC4987899",
            "pmid": "27141960"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        }
    ],
    "validated": 1
}