{
    "additionDate": "2020-01-14T19:55:08Z",
    "biotoolsCURIE": "biotools:SiRJ",
    "biotoolsID": "SiRJ",
    "confidence_flag": "tool",
    "description": "A general response process theory for situational judgment tests.\n\nSituational judgment tests (SJTs) have emerged as a staple of assessment methodologies for organizational practitioners and researchers. Despite their prevalence, many questions regarding how to interpret respondent choices or how variations in item construction and instruction influence the nature of observed responses remain. Existing conceptual and empirical efforts to explore these questions have largely been rooted in reflexive psychometric measurement models that describe participant responses as indicative of (usually multiple) latent constructs. However, some have suggested that a key to better understanding SJT responses lies in unpacking the judgment and decision-making processes employed by respondents and the psychological and contextual factors that shape how those processes play out. To this end, the present article advances an integrative and generalizable process-oriented theory of SJT responding",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://grandjam.shinyapps.io/sirj",
    "lastUpdate": "2020-12-20T15:17:29Z",
    "name": "SiRJ",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1037/APL0000468",
            "metadata": {
                "abstract": "© 2020 American Psychological Association.Situational judgment tests (SJTs) have emerged as a staple of assessment methodologies for organizational practitioners and researchers. Despite their prevalence, many questions regarding how to interpret respondent choices or how variations in item construction and instruction influence the nature of observed responses remain. Existing conceptual and empirical efforts to explore these questions have largely been rooted in reflexive psychometric measurement models that describe participant responses as indicative of (usually multiple) latent constructs. However, some have suggested that a key to better understanding SJT responses lies in unpacking the judgment and decision-making processes employed by respondents and the psychological and contextual factors that shape how those processes play out. To this end, the present article advances an integrative and generalizable process-oriented theory of SJT responding. The framework, labeled situated reasoning and judgment (SiRJ), proposes that respondents engage in a series of conditional reasoning, similarity, and preference accumulation judgments when deciding how to evaluate and respond to an SJT item. To evaluate the theory's plausibility and utility, the SiRJ framework is translated into a formal computational model and results from a simulation study are analyzed using neural network and Bayesian survival analytic techniques that demonstrate its capability to replicate existing and new empirical effects, suggest insights into SJT interpretation and development, and stimulate new directions for future research. An interactive web application that allows users to explore the computational model developed for SiRJ (https://grandjam.shinyapps.io/sirj) as well as all reported data and the full model/simulation code (https://osf.io/uwdfm/) are also provided.",
                "authors": [
                    {
                        "name": "Grand J.A."
                    }
                ],
                "date": "2020-08-01T00:00:00Z",
                "journal": "Journal of Applied Psychology",
                "title": "A general response process theory for situational judgment tests"
            },
            "pmid": "31789550"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        }
    ],
    "validated": 1
}