{
    "accessibility": "Open access",
    "additionDate": "2023-01-20T02:31:15.864655Z",
    "biotoolsCURIE": "biotools:automorph",
    "biotoolsID": "automorph",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Daniel C. Alexander"
        },
        {
            "name": "Pearse A. Keane"
        },
        {
            "name": "Siegfried K. Wagner"
        },
        {
            "name": "Yukun Zhou"
        }
    ],
    "description": "Automated Retinal Vascular Morphology Quantification via a Deep Learning Pipeline.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image annotation",
                    "uri": "http://edamontology.org/operation_3553"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "https://github.com/rmaphoh/AutoMorph",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-01-20T02:31:15.867106Z",
    "license": "Apache-2.0",
    "name": "AutoMorph",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1167/tvst.11.7.12",
            "metadata": {
                "abstract": "© 2022 The Authors.Purpose: To externally validate a deep learning pipeline (AutoMorph) for automated analysis of retinal vascular morphology on fundus photographs. AutoMorph has been made publicly available, facilitating widespread research in ophthalmic and systemic diseases. Methods: AutoMorph consists of four functional modules: image preprocessing, image quality grading, anatomical segmentation (including binary vessel, artery/vein, and optic disc/cup segmentation), and vascular morphology feature measurement. Image quality grading and anatomical segmentation use the most recent deep learning techniques. We employ a model ensemble strategy to achieve robust results and analyze the prediction confidence to rectify false gradable cases in image quality grading. We externally validate the performance of each module on several independent publicly available datasets. Results: The EfficientNet-b4 architecture used in the image grading module achieves performance comparable to that of the state of the art for EyePACS-Q, with an F1-score of 0.86. The confidence analysis reduces the number of images incorrectly assessed as gradable by 76%. Binary vessel segmentation achieves an F1-score of 0.73 on AV-WIDE and 0.78 on DR HAGIS. Artery/vein scores are 0.66 on IOSTAR-AV, and disc segmentation achieves 0.94 in IDRID. Vascular morphology features measured from the AutoMorph segmentation map and expert annotation show good to excellent agreement. Conclusions: AutoMorph modules perform well even when external validation data show domain differences from training data (e.g., with different imaging devices). This fully automated pipeline can thus allow detailed, efficient, and comprehensive analysis of retinal vascular morphology on color fundus photographs. Translational Relevance: By making AutoMorph publicly available and open source, we hope to facilitate ophthalmic and systemic disease research, particularly in the emerging field of oculomics.",
                "authors": [
                    {
                        "name": "Alexander D.C."
                    },
                    {
                        "name": "Chia M.A."
                    },
                    {
                        "name": "Keane P.A."
                    },
                    {
                        "name": "Struyven R."
                    },
                    {
                        "name": "Wagner S.K."
                    },
                    {
                        "name": "Woodward-Court P."
                    },
                    {
                        "name": "Xu M."
                    },
                    {
                        "name": "Zhao A."
                    },
                    {
                        "name": "Zhou Y."
                    }
                ],
                "date": "2022-07-01T00:00:00Z",
                "journal": "Translational Vision Science and Technology",
                "title": "AutoMorph: Automated Retinal Vascular Morphology Quantification Via a Deep Learning Pipeline"
            },
            "pmcid": "PMC9290317",
            "pmid": "35833885"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
