
{
    "credit": [
        {
            "email": "raffaele.calogero@unito.it",
            "name": "Raffaele Calogero",
            "note": "Associate Professor at University of Torino, Italy",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://reproducible-bioinformatics.org/"
        },
        {
            "email": "beccuti@di.unito.it",
            "name": "Marco Beccuti",
            "note": "Assistant Professor at University of Torino",
            "typeEntity": "Person",
            "typeRoles": [
                "Developer"
            ]
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "https://kendomaniac.github.io/docker4seq/articles/docker4seq.html"
        }
    ],
    "labels": {
        "accessibility": [
            "Open access"
        ],
        "cost": "Free of charge",
        "elixirNode": [
            "Italy"
        ],
        "elixirPlatform": [
            "Tools"
        ],
        "language": [
            "R"
        ],
        "license": "GPL-3.0",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2018 The Author(s). Background: Reproducibility of a research is a key element in the modern science and it is mandatory for any industrial application. It represents the ability of replicating an experiment independently by the location and the operator. Therefore, a study can be considered reproducible only if all used data are available and the exploited computational analysis workflow is clearly described. However, today for reproducing a complex bioinformatics analysis, the raw data and the list of tools used in the workflow could be not enough to guarantee the reproducibility of the results obtained. Indeed, different releases of the same tools and/or of the system libraries (exploited by such tools) might lead to sneaky reproducibility issues. Results: To address this challenge, we established the Reproducible Bioinformatics Project (RBP), which is a non-profit and open-source project, whose aim is to provide a schema and an infrastructure, based on docker images and R package, to provide reproducible results in Bioinformatics. One or more Docker images are then defined for a workflow (typically one for each task), while the workflow implementation is handled via R-functions embedded in a package available at github repository. Thus, a bioinformatician participating to the project has firstly to integrate her/his workflow modules into Docker image(s) exploiting an Ubuntu docker image developed ad hoc by RPB to make easier this task. Secondly, the workflow implementation must be realized in R according to an R-skeleton function made available by RPB to guarantee homogeneity and reusability among different RPB functions. Moreover she/he has to provide the R vignette explaining the package functionality together with an example dataset which can be used to improve the user confidence in the workflow utilization. Conclusions: Reproducible Bioinformatics Project provides a general schema and an infrastructure to distribute robust and reproducible workflows. Thus, it guarantees to final users the ability to repeat consistently any analysis independently by the used UNIX-like architecture.",
            "authors": [
                "Kulkarni N.",
                "Alessandri L.",
                "Panero R.",
                "Arigoni M.",
                "Olivero M.",
                "Ferrero G.",
                "Cordero F.",
                "Beccuti M.",
                "Calogero R.A."
            ],
            "cit_count": 1,
            "journal": "BMC Bioinformatics",
            "pmid": "30367595",
            "title": "Reproducible bioinformatics project: A community for reproducible bioinformatics analysis pipelines",
            "type": "Primary",
            "year": "2018-10-15"
        },
        {
            "abstract": "© The Author 2017. Published by Oxford University Press. Short reads sequencing technology has been used for more than a decade now. However, the analysis of RNAseq and ChIPseq data is still computational demanding and the simple access to raw data does not guarantee results reproducibility between laboratories. To address these two aspects, we developed SeqBox, a cheap, efficient and reproducible RNAseq/ChIPseq hardware/software solution based on NUC6I7KYK mini-PC (an Intel consumer game computer with a fast processor and a high performance SSD disk), and Docker container platform. In SeqBox the analysis of RNAseq and ChIPseq data is supported by a friendly GUI. This allows access to fast and reproducible analysis also to scientists with/without scripting experience.",
            "authors": [
                "Beccuti M.",
                "Cordero F.",
                "Arigoni M.",
                "Panero R.",
                "Amparore E.G.",
                "Donatelli S.",
                "Calogero R.A."
            ],
            "cit_count": 2,
            "journal": "Bioinformatics",
            "pmid": "29069297",
            "title": "SeqBox: RNAseq/ChIPseq reproducible analysis on a consumer game computer",
            "year": "2018-03-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:docker4seq",
        "biotoolsID": "docker4seq",
        "description": "docker4seq provides a general schema and an infrastructure to distribute robust and reproducible workflows. It guarantees to final users the ability to repeat consistently any analysis independently by the used UNIX-like architecture.\ndocker4seq R package contains all the R functions required to handle all the steps of RNAseq and miRNA-seq workflow.",
        "homepage": "https://github.com/kendomaniac/docker4seq",
        "name": "docker4seq",
        "version": [
            "2.2.9"
        ]
    }
}