{
    "additionDate": "2017-12-18T00:04:15Z",
    "biotoolsCURIE": "biotools:bicluster",
    "biotoolsID": "bicluster",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.mdc-berlin.de/1151037/en/research/research_teams/systems_biology_of_gene_regulatory_elements"
        }
    ],
    "description": "Bicluster is a seed-based algorithm that identifies coherent genes in an exhaustive, but efficient manner.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.australianprostatecentre.org/research/software/seed-based-biclustering-of-gene-expression-data"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "http://www.australianprostatecentre.org/research/software/seed-based-biclustering-of-gene-expression-data",
    "language": [
        "Java"
    ],
    "lastUpdate": "2019-01-09T15:48:16Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/bicluster-seed-based-biclustering-of-gene-expression-data.html"
        }
    ],
    "name": "Bicluster",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0042431",
            "metadata": {
                "abstract": "Background: Accumulated biological research outcomes show that biological functions do not depend on individual genes, but on complex gene networks. Microarray data are widely used to cluster genes according to their expression levels across experimental conditions. However, functionally related genes generally do not show coherent expression across all conditions since any given cellular process is active only under a subset of conditions. Biclustering finds gene clusters that have similar expression levels across a subset of conditions. This paper proposes a seed-based algorithm that identifies coherent genes in an exhaustive, but efficient manner. Methods: In order to find the biclusters in a gene expression dataset, we exhaustively select combinations of genes and conditions as seeds to create candidate bicluster tables. The tables have two columns (a) a gene set, and (b) the conditions on which the gene set have dissimilar expression levels to the seed. First, the genes with less than the maximum number of dissimilar conditions are identified and a table of these genes is created. Second, the rows that have the same dissimilar conditions are grouped together. Third, the table is sorted in ascending order based on the number of dissimilar conditions. Finally, beginning with the first row of the table, a test is run repeatedly to determine whether the cardinality of the gene set in the row is greater than the minimum threshold number of genes in a bicluster. If so, a bicluster is outputted and the corresponding row is removed from the table. Repeating this process, all biclusters in the table are systematically identified until the table becomes empty. Conclusions: This paper presents a novel biclustering algorithm for the identification of additive biclusters. Since it involves exhaustively testing combinations of genes and conditions, the additive biclusters can be found more readily. © 2012 An et al.",
                "authors": [
                    {
                        "name": "An J."
                    },
                    {
                        "name": "Liew A.W.-C."
                    },
                    {
                        "name": "Nelson C.C."
                    }
                ],
                "citationCount": 6,
                "date": "2012-08-03T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Seed-based biclustering of gene expression data"
            },
            "pmcid": "PMC3411756",
            "pmid": "22879981",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1
}
