{
    "additionDate": "2018-06-18T19:33:20Z",
    "biotoolsCURIE": "biotools:dart_mapper",
    "biotoolsID": "dart_mapper",
    "credit": [
        {
            "email": "hsu@iis.sinica.edu.tw",
            "name": "Wen-Lian Hsu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "RNA-seq mapper with a divide and conquer strategy.",
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/hsinnan75/DART"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "homepage": "https://github.com/hsinnan75/DART",
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "DART",
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btx558",
            "metadata": {
                "abstract": "© The Author 2017. Published by Oxford University Press. Motivation In recent years, the massively parallel cDNA sequencing (RNA-Seq) technologies have become a powerful tool to provide high resolution measurement of expression and high sensitivity in detecting low abundance transcripts. However, RNA-seq data requires a huge amount of computational efforts. The very fundamental and critical step is to align each sequence fragment against the reference genome. Various de novo spliced RNA aligners have been developed in recent years. Though these aligners can handle spliced alignment and detect splice junctions, some challenges still remain to be solved. With the advances in sequencing technologies and the ongoing collection of sequencing data in the ENCODE project, more efficient alignment algorithms are highly demanded. Most read mappers follow the conventional seed-And-extend strategy to deal with inexact matches for sequence alignment. However, the extension is much more time consuming than the seeding step. Results We proposed a novel RNA-seq de novo mapping algorithm, call DART, which adopts a partitioning strategy to avoid the extension step. The experiment results on synthetic datasets and real NGS datasets showed that DART is a highly efficient aligner that yields the highest or comparable sensitivity and accuracy compared to most state-of-The-Art aligners, and more importantly, it spends the least amount of time among the selected aligners.",
                "authors": [
                    {
                        "name": "Lin H.-N."
                    },
                    {
                        "name": "Hsu W.-L."
                    }
                ],
                "citationCount": 1,
                "date": "2018-01-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "DART: A fast and accurate RNA-seq mapper with a partitioning strategy"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}