{
    "additionDate": "2021-03-19T09:03:31Z",
    "biotoolsCURIE": "biotools:gca",
    "biotoolsID": "gca",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "morota@vt.edu",
            "name": "Gota Morota",
            "orcidid": "https://orcid.org/0000-0002-3567-6911",
            "typeEntity": "Person"
        },
        {
            "email": "haipengyu@vt.edu",
            "name": "Haipeng Yu",
            "typeEntity": "Person"
        }
    ],
    "description": "An R package for genetic connectedness analysis using pedigree and genomic data.\n\nGenetic connectedness quantifies the extent of linkage between individuals across management units. The concept of genetic connectedness can be extended to measure the connectedness level between training and testing sets in whole-genome prediction. We developed the genetic connectedness analysis R package, GCA, which utilizes pedigree or genomic data to measure the connectedness between individuals across units.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://qgresources.github.io/GCA_Vignette/GCA.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/QGresources/GCA",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-22T12:25:48Z",
    "name": "GCA",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12864-021-07414-7",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Genetic connectedness is a critical component of genetic evaluation as it assesses the comparability of predicted genetic values across units. Genetic connectedness also plays an essential role in quantifying the linkage between reference and validation sets in whole-genome prediction. Despite its importance, there is no user-friendly software tool available to calculate connectedness statistics. Results: We developed the GCA R package to perform genetic connectedness analysis for pedigree and genomic data. The software implements a large collection of various connectedness statistics as a function of prediction error variance or variance of unit effect estimates. The GCA R package is available at GitHub and the source code is provided as open source. Conclusions: The GCA R package allows users to easily assess the connectedness of their data. It is also useful to determine the potential risk of comparing predicted genetic values of individuals across units or measure the connectedness level between training and testing sets in genomic prediction.",
                "authors": [
                    {
                        "name": "Morota G."
                    },
                    {
                        "name": "Yu H."
                    }
                ],
                "citationCount": 1,
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "GCA: an R package for genetic connectedness analysis using pedigree and genomic data"
            },
            "pmcid": "PMC7885574",
            "pmid": "33588757"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ]
}
