{
    "additionDate": "2020-01-09T18:00:27Z",
    "biotoolsCURIE": "biotools:AQUA-MER",
    "biotoolsID": "AQUA-MER",
    "confidence_flag": "tool",
    "description": "A database and toolkit for researchers working on environmental mercury geochemistry.\nAQUA-MER is useful for researchers who want to investigate mercury speciation in defined environments i.e., to which chemical elements and groups it will bind and in what proportions, given an input of concentrations of chemicals.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "https://aquamer.ornl.gov",
    "lastUpdate": "2021-01-14T15:57:52Z",
    "name": "AQUA-MER",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/JCC.26081",
            "metadata": {
                "abstract": "© 2019 Wiley Periodicals, Inc.To assess the chemical reactivity, toxicity, and mobility of pollutants in the environment, knowledge of their species distributions is critical. Because their direct measurement is often infeasible, speciation modeling is widely adopted. Mercury (Hg) is a representative pollutant for which study of its speciation benefits from modeling. However, Hg speciation modeling is often hindered by a lack of reliable thermodynamic constants. Although computational chemistry (e.g., density functional theory [DFT]) can generate these constants, methods for directly coupling DFT and speciation modeling are not available. Here, we combine computational chemistry and continuum-scale modeling with curated online databases to ameliorate the problem of unreliable inputs to Hg speciation modeling. Our AQUA-MER databases and web server (https://aquamer.ornl.gov) provides direct speciation results by combining web-based interfaces to a speciation calculator, databases of thermodynamic constants, and a computational chemistry toolkit to estimate missing constants. Although Hg is presented as a concrete use case, AQUA-MER can also be readily applied to other elements. © 2019 Wiley Periodicals, Inc.",
                "authors": [
                    {
                        "name": "Lian P."
                    },
                    {
                        "name": "Guo L."
                    },
                    {
                        "name": "Devarajan D."
                    },
                    {
                        "name": "Parks J.M."
                    },
                    {
                        "name": "Painter S.L."
                    },
                    {
                        "name": "Brooks S.C."
                    },
                    {
                        "name": "Smith J.C."
                    }
                ],
                "date": "2020-01-15T00:00:00Z",
                "journal": "Journal of Computational Chemistry",
                "title": "The AQUA-MER databases and aqueous speciation server: A web resource for multiscale modeling of mercury speciation"
            },
            "pmid": "31603259"
        }
    ],
    "toolType": [
        "Web application",
        "Database portal"
    ],
    "topic": [
        {
            "term": "Computational chemistry",
            "uri": "http://edamontology.org/topic_3332"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        }
    ],
    "validated": 1
}