
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "labels": {
        "topic": [
            {
                "term": "Mapping",
                "uri": "http://edamontology.org/topic_0102"
            },
            {
                "term": "Model organisms",
                "uri": "http://edamontology.org/topic_0621"
            },
            {
                "term": "Reproductive health",
                "uri": "http://edamontology.org/topic_3420"
            }
        ]
    },
    "publication": [
        {
            "abstract": "OBJECTIVE: Organizing key information for personal disaster preparedness in an efficient and accessible format is critical to ensure practical utility. The authors examine the use of mind mapping technology to organize personal disaster preparedness information and explore the potential of mind mapping software as a tool to create individual and family preparedness resources. DESIGN: The general features of mind maps are considered and a sample family preparedness plan was created using TheBrain, a mind mapping software. RESULTS: Mind maps are a promising tool to organize personal preparedness plans with the ability to include significant amounts of varied information in a structure that emphasizes relationships between topics and enables collaborative sharing.",
            "authors": [
                "Chen A.P.",
                "Chang A.H.",
                "Hsu E.B."
            ],
            "cit_count": 0,
            "doi": "10.5055/AJDM.2019.0320",
            "journal": "American journal of disaster medicine",
            "pmid": "31637690",
            "title": "Using mind mapping technology for personal preparedness planning",
            "year": "2019-03-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:TheBrain",
        "biotoolsID": "TheBrain",
        "description": "Using mind mapping technology for personal preparedness planning.\n\nTheBrain is the most powerful way to capture, organize, and share your notes, files, and web links across all your devices.\n\nIdeas and relationships visualized.\n\nAs you shift focus from topic to topic, TheBrain moves right along with you, showing your information and all the connections you've made. It's a natural extension of your thinking. Now you can see how things are connected and you'll never forget or lose an idea.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'preparedness', 'disaster preparedness', 'disaster', 'RESULTS:Mind'",
        "homepage": "https://www.thebrain.com",
        "name": "TheBrain"
    }
}