{
    "name": "Scribl", 
    "description": "Canvas-based graphics library that easily generates biological visuals of genomic regions, alignments, and assembly data. It can also be used in conventional offline pipelines, since everything needed to generate charts can be contained in a single html file.", 
    "homepage": "http://chmille4.github.com/Scribl/", 
    "biotoolsID": "scribl", 
    "biotoolsCURIE": "biotools:scribl", 
    "version": [
        "1.1.4"
    ], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0310", 
                    "term": "Sequence assembly"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Desktop application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0769", 
            "term": "Pipelines"
        }, 
        {
            "uri": "http://edamontology.org/topic_0622", 
            "term": "Genomics"
        }, 
        {
            "uri": "http://edamontology.org/topic_0196", 
            "term": "Assembly"
        }, 
        {
            "uri": "http://edamontology.org/topic_0654", 
            "term": "DNA"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "Java"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/scribl-1-1-4-html5-canvas-genomics-graphic-library.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "https://github.com/chmille4/Scribl/wiki", 
            "type": "Manual", 
            "note": null
        }, 
        {
            "url": "http://chmille4.github.io/Scribl/source.html", 
            "type": "API documentation", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1093/bioinformatics/bts677", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "Scribl: An HTML5 Canvas-based graphics library for visualizing genomic data over the web", 
                "abstract": "Motivation: High-throughput biological research requires simultaneous visualization as well as analysis of genomic data, e.g. read alignments, variant calls and genomic annotations. Traditionally, such integrative analysis required desktop applications operating on locally stored data. Many current terabyte-size datasets generated by large public consortia projects, however, are already only feasibly stored at specialist genome analysis centers. As even small laboratories can afford very large datasets, local storage and analysis are becoming increasingly limiting, and it is likely that most such datasets will soon be stored remotely, e.g. in the cloud. These developments will require web-based tools that enable users to access, analyze and view vast remotely stored data with a level of sophistication and interactivity that approximates desktop applications. As rapidly dropping cost enables researchers to collect data intended to answer questions in very specialized contexts, developers must also provide software libraries that empower users to implement customized data analyses and data views for their particular application. Such specialized, yet lightweight, applications would empower scientists to better answer specific biological questions than possible with general-purpose genome browsers currently available.Results: Using recent advances in core web technologies (HTML5), we developed Scribl, a flexible genomic visualization library specifically targeting coordinate-based data such as genomic features, DNA sequence and genetic variants. Scribl simplifies the development of sophisticated web-based graphical tools that approach the dynamism and interactivity of desktop applications.Availability and implementation: Software is freely available online at http://chmille4.github.com/Scribl/and is implemented in JavaScript with all modern browsers supported.Contact: Supplementary information: Supplementary data are available at Bioinformatics online. © 2012 The Author.", 
                "date": "2013-02-01T00:00:00Z", 
                "citationCount": 19, 
                "authors": [
                    {
                        "name": "Miller C.A."
                    }, 
                    {
                        "name": "Anthony J."
                    }, 
                    {
                        "name": "Meyer M.M."
                    }, 
                    {
                        "name": "Marth G."
                    }
                ], 
                "journal": "Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": null, 
            "url": "http://bioinformatics.bc.edu/meyerlab/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-12-18T00:12:57Z", 
    "lastUpdate": "2018-12-10T12:58:58Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}