
{
    "credit": [
        {
            "email": "cllu@cs.nthu.edu.tw",
            "name": "Dr. Chin Lung Lu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://genome.cs.nthu.edu.tw/OGtree2.0/help.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree generation (minimum distance methods)",
                    "uri": "http://edamontology.org/operation_0546"
                },
                {
                    "term": "Phylogenetic tree generation",
                    "uri": "http://edamontology.org/operation_0323"
                },
                {
                    "term": "Phylogenetic species tree construction",
                    "uri": "http://edamontology.org/operation_0544"
                },
                {
                    "term": "Phylogenetic tree reconstruction",
                    "uri": "http://edamontology.org/operation_3478"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Phylogeny",
                "uri": "http://edamontology.org/topic_0084"
            },
            {
                "term": "Phylogenomics",
                "uri": "http://edamontology.org/topic_0194"
            },
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "Whole genome sequencing",
                "uri": "http://edamontology.org/topic_3673"
            }
        ]
    },
    "publication": [
        {
            "abstract": "OGtree is a web-based tool for constructing genome trees of prokaryotic species based on a measure of combining overlapping-gene content and overlapping-gene order in their whole genomes. The overlapping genes (OGs) are defined as adjacent genes whose coding sequences overlap partially or entirely. In fact, OGs are ubiquitous in microbial genomes and more conserved between species than non-OGs. Based on these properties, it has been suggested that OGs can serve as better phylogenetic characters than non-OGs for reconstructing the evolutionary relationships among microbial genomes. OGtree takes the accession numbers of prokaryotic genomes as its input. It then downloads their complete genomes from the National Centre for Biotechnology Information and identifies OGs in each genome and their orthologous OGs in other genomes. Next, OGtree computes an overlapping-gene distance between each pair of input genomes based on a combination of their OG content and orthologous OG order. Finally, it utilizes distance-based methods of building tree to reconstruct the genome trees of input prokaryotic genomes according to their pairwise OG distance. OGtree is available online at http://bioalgorithm.life.nctu.edu.tw/OGtree/.",
            "authors": [
                "Jiang L.W.",
                "Lin K.L.",
                "Lu C.L."
            ],
            "cit_count": 10,
            "journal": "Nucleic acids research",
            "pmid": "18456706",
            "title": "OGtree: a tool for creating genome trees of prokaryotes based on overlapping genes.",
            "year": "2008-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:ogtree_2",
        "biotoolsID": "ogtree_2",
        "description": "Overlapping genes (OG) in prokaryotic species are used in OGtree to construct genome phylogeny trees. Overlapping gene content and overlapping gene order of the whole genome is used for the distance based method of tree construction. OGtree2.0 is a web server that can be used to reconstruct genome trees of prokaryotes on the basis of overlapping genes in prokaryotic whole genomes.",
        "homepage": "http://genome.cs.nthu.edu.tw/OGtree2.0/",
        "name": "OGtree 2"
    }
}