{
    "additionDate": "2020-01-14T09:14:09Z",
    "biotoolsCURIE": "biotools:MIRKB",
    "biotoolsID": "MIRKB",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "bairong.shen@scu.edu.cn",
            "name": "Bairong Shen",
            "typeEntity": "Person"
        }
    ],
    "description": "a myocardial infarction risk knowledge base.\n\nMyocardial Infarction Risk Knowledge Base.\n\nMIRKB (the Myocardial Infarction Risk Knowledge Base) is a database that collected single factors, combined factors, and risk models which are article-supported to be associated with the risk assessment, diagnosis, prognosis, and treatment of MI in human. The goal of MIKB was to improve the efficiency of MI research. MI is a common cardiovascular disease and a leading cause of death worldwide. It can be classified into many types according to the disease phase, lesion range, ECG expression, infarction location, and clinical type",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://sysbio.org.cn/MIRKB/",
    "lastUpdate": "2020-01-14T09:14:09Z",
    "name": "MIRKB",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAZ125",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Myocardial infarction (MI) is a common cardiovascular disease and a leading cause of death worldwide. The etiology of MI is complicated and not completely understood. Many risk factors are reported important for the development of MI, including lifestyle factors, environmental factors, psychosocial factors, genetic factors, etc. Identifying individuals with an increased risk of MI is urgent and a major challenge for improving prevention. The MI risk knowledge base (MIRKB) is developed for facilitating MI research and prevention. The goal of MIRKB is to collect risk factors and models related to MI to increase the efficiency of systems biological level understanding of the disease. MIRKB contains 8436 entries collected from 4366 articles in PubMed before 5 July 2019 with 7902 entries for 1847 single factors, 195 entries for 157 combined factors and 339 entries for 174 risk models. The single factors are classified into the following five categories based on their characteristics: molecular factor (2356 entries, 649 factors), imaging (821 entries, 252 factors), physiological factor (1566 entries, 219 factors), clinical factor (2523 entries, 561 factors), environmental factor (46 entries, 26 factors), lifestyle factor (306 entries, 65 factors) and psychosocial factor (284 entries, 75 factors). MIRKB will be helpful to the future systems level unraveling of the complex mechanism of MI genesis and progression.",
                "authors": [
                    {
                        "name": "Zhan C."
                    },
                    {
                        "name": "Shi M."
                    },
                    {
                        "name": "Wu R."
                    },
                    {
                        "name": "He H."
                    },
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Shen B."
                    }
                ],
                "citationCount": 1,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Database",
                "title": "MIRKB: A myocardial infarction risk knowledge base"
            },
            "pmcid": "PMC6830040",
            "pmid": "31688939"
        }
    ],
    "topic": [
        {
            "term": "Cardiology",
            "uri": "http://edamontology.org/topic_3335"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ]
}