{"credit":[{"email":"ycui2@uthsc.edu","typeEntity":"Person","typeRoles":["Primary contact"]}],"function":[{"operation":[{"term":"Microarray data analysis","uri":"http://edamontology.org/operation_2495"}]},{"operation":[{"term":"Classification","uri":"http://edamontology.org/operation_2990"}]}],"labels":{"language":["Java"],"maturity":"Emerging","operatingSystem":["Linux","Windows"],"toolType":["Desktop application"],"topic":[{"term":"DNA","uri":"http://edamontology.org/topic_0654"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/gifi-array-analyzer-1-2-beta-analysis-dna-microarray-data-gene-functional-classification-data.html"}],"publication":[{"abstract":"Microarray data should be interpreted in the context of existing biological knowledge. Here we present integrated analysis of microarray data and gene function classification data using homogeneity analysis. Homogeneity analysis is a graphical multivariate statistical method for analyzing categorical data. It converts categorical data into graphical display. By simultaneously quantifying the microarry-derived gene groups and gene function categories, it captures the complex relations between biological information derived from microarray data and the existing knowledge about the gene function. Thus, homogeneity analysis provides a mathematical framework for integrating the analysis of microarray data and the existing biological knowledge.","authors":["Cui Y.","Zhou M.","Wong W.H."],"cit_count":12,"doi":"10.1089/1536231041388320","journal":"OMICS A Journal of Integrative Biology","title":"Integrated analysis of microarray data and gene function information","type":"Primary","year":"2004-08-09"}],"summary":{"biotoolsCURIE":"biotools:gifi_array_analyzer","biotoolsID":"gifi_array_analyzer","description":"Gifi Array Analyzer is a Java application for integrated analysis of DNA microarray data and gene functional classification data.Gifi Array Analyzer implements Homals (Homogeneity Analysis by means of Alternating Least Square). Homogeneity analysis is a graphical, multivariate statistical method.","homepage":"http://compbio.uthsc.edu/Gifi.php","name":"Gifi Array Analyzer 1.2 beta"}}