{
    "additionDate": "2019-11-14T19:56:03Z",
    "biotoolsCURIE": "biotools:SamPler",
    "biotoolsID": "SamPler",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "odias@ceb.uminho.pt",
            "name": "Oscar Dias",
            "orcidid": "https://orcid.org/0000-0002-1765-7178",
            "typeEntity": "Person"
        }
    ],
    "description": "> MEDIUM CONFIDENCE! | a novel method for selecting parameters for gene functional annotation routines | Novel strategy for selecting best parameters for gene functional annotation routines in merlin | readme instructions updated · 81b3a5a9",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Local alignment",
                    "uri": "http://edamontology.org/operation_0495"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                }
            ]
        }
    ],
    "homepage": "https://gitlab.bio.di.uminho.pt/merlin-sysbio/merlin-sampler",
    "lastUpdate": "2020-12-16T10:38:38.418473Z",
    "name": "SamPler",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3038-4",
            "metadata": {
                "abstract": "BACKGROUND: As genome sequencing projects grow rapidly, the diversity of organisms with recently assembled genome sequences peaks at an unprecedented scale, thereby highlighting the need to make gene functional annotations fast and efficient. However, the (high) quality of such annotations must be guaranteed, as this is the first indicator of the genomic potential of every organism. Automatic procedures help accelerating the annotation process, though decreasing the confidence and reliability of the outcomes. Manually curating a genome-wide annotation of genes, enzymes and transporter proteins function is a highly time-consuming, tedious and impractical task, even for the most proficient curator. Hence, a semi-automated procedure, which balances the two approaches, will increase the reliability of the annotation, while speeding up the process. In fact, a prior analysis of the annotation algorithm may leverage its performance, by manipulating its parameters, hastening the downstream processing and the manual curation of assigning functions to genes encoding proteins. RESULTS: Here SamPler, a novel strategy to select parameters for gene functional annotation routines is presented. This semi-automated method is based on the manual curation of a randomly selected set of genes/proteins. Then, in a multi-dimensional array, this sample is used to assess the automatic annotations for all possible combinations of the algorithm's parameters. These assessments allow creating an array of confusion matrices, for which several metrics are calculated (accuracy, precision and negative predictive value) and used to reach optimal values for the parameters. CONCLUSIONS: The potential of this methodology is demonstrated with four genome functional annotations performed in merlin, an in-house user-friendly computational framework for genome-scale metabolic annotation and model reconstruction. For that, SamPler was implemented as a new plugin for the merlin tool.",
                "authors": [
                    {
                        "name": "Cruz F."
                    },
                    {
                        "name": "Lagoa D."
                    },
                    {
                        "name": "Mendes J."
                    },
                    {
                        "name": "Rocha I."
                    },
                    {
                        "name": "Ferreira E.C."
                    },
                    {
                        "name": "Rocha M."
                    },
                    {
                        "name": "Dias O."
                    }
                ],
                "citationCount": 2,
                "date": "2019-09-05T00:00:00Z",
                "journal": "BMC bioinformatics",
                "title": "SamPler - a novel method for selecting parameters for gene functional annotation routines"
            },
            "pmcid": "PMC6727554",
            "pmid": "31488049"
        }
    ],
    "topic": [
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        }
    ]
}