{
    "accessibility": [],
    "additionDate": "2017-12-18T00:10:41Z",
    "biotoolsCURIE": "biotools:pageman",
    "biotoolsID": "pageman",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": null,
            "gridid": null,
            "name": null,
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://bioinformatics.mpimp-golm.mpg.de/"
        }
    ],
    "description": "PageMan is a tool to get a quick overview of multiparallel experiments. PageMan also helps comparing experiments from different organisms.",
    "documentation": [
        {
            "note": null,
            "type": "User manual",
            "url": "http://mapman.mpimp-golm.mpg.de/pageman/help/help.html"
        },
        {
            "note": null,
            "type": "General",
            "url": "http://mapman.mpimp-golm.mpg.de/pageman/tutorial/index.html"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Microarray data analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://mapman.gabipd.org/web/guest/pageman",
    "homepage_status": 0,
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "license": null,
    "link": [
        {
            "note": null,
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/pageman-0-12-annotates-investigates-condenses-microarray-data-context-functional-ontologies.html"
        }
    ],
    "maturity": null,
    "name": "PageMan",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-7-535",
            "metadata": {
                "abstract": "Background: Microarray technology has become a widely accepted and standardized tool in biology. The first microarray data analysis programs were developed to support pair-wise comparison. However, as microarray experiments have become more routine, large scale experiments have become more common, which investigate multiple time points or sets of mutants or transgenics. To extract biological information from such high-throughput expression data, it is necessary to develop efficient analytical platforms, which combine manually curated gene ontologies with efficient visualization and navigation tools. Currently, most tools focus on a few limited biological aspects, rather than offering a holistic, integrated analysis. Results: Here we introduce PageMan, a multiplatform, user-friendly, and stand-alone software tool that annotates, investigates, and condenses high-throughput microarray data in the context of functional ontologies. It includes a GUI tool to transform different ontologies into a suitable format, enabling the user to compare and choose between different ontologies. It is equipped with several statistical modules for data analysis, including over-representation analysis and Wilcoxon statistical testing. Results are exported in a graphical format for direct use, or for further editing in graphics programs. PageMan provides a fast overview of single treatments, allows genome-level responses to be compared across several microarray experiments covering, for example, stress responses at multiple time points. This aids in searching for trait-specific changes in pathways using mutants or transgenics, analyzing development time-courses, and comparison between species. In a case study, we analyze the results of publicly available microarrays of multiple cold stress experiments using PageMan, and compare the results to a previously published meta-analysis. PageMan offers a complete user's guide, a web-based over-representation analysis as well as a tutorial, and is freely available at http://mapman.mpimp-golm.mpg.de/pageman/. Conclusion: PageMan allows multiple microarray experiments to be efficiently condensed into a single page graphical display. The flexible interface allows data to be quickly and easily visualized, facilitating comparisons within experiments and to published experiments, thus enabling researchers to gain a rapid overview of the biological responses in the experiments. © 2006 Usadel et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Usadel B."
                    },
                    {
                        "name": "Nagel A."
                    },
                    {
                        "name": "Steinhauser D."
                    },
                    {
                        "name": "Gibon Y."
                    },
                    {
                        "name": "Blasing O.E."
                    },
                    {
                        "name": "Redestig H."
                    },
                    {
                        "name": "Sreenivasulu N."
                    },
                    {
                        "name": "Krall L."
                    },
                    {
                        "name": "Hannah M.A."
                    },
                    {
                        "name": "Poree F."
                    },
                    {
                        "name": "Fernie A.R."
                    },
                    {
                        "name": "Stitt M."
                    }
                ],
                "citationCount": 221,
                "date": "2006-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "PageMan: An interactive ontology tool to generate, display, and annotate overview graphs for profiling experiments"
            },
            "note": null,
            "pmcid": null,
            "pmid": null,
            "type": "Primary",
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Ontologies",
            "uri": "http://edamontology.org/topic_0089"
        }
    ],
    "validated": 1,
    "version": [
        "0.12"
    ]
}