{
    "additionDate": "2017-08-03T18:58:45Z",
    "biotoolsCURIE": "biotools:ringer",
    "biotoolsID": "ringer",
    "credit": [
        {
            "email": "JMHolton@lbl.gov",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://ucxray.berkeley.edu/wiki/index.php/Main_Page"
        }
    ],
    "description": "The program  detects molecular motions by automatic electron density sampling. The aim of Ringer is to go beyond static structural snapshots of proteins by uncovering structural ensembles in X-ray electron density. This information can reveal not only which parts of proteins are flexible and which part are rigid, but it also can define alternate conformations that may be important for function. Alternate conformations of binding sites also may afford additional targets for drug design.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bl831.als.lbl.gov/ringer/ringer/Documentation/documentation.htm"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Structure analysis",
                    "uri": "http://edamontology.org/operation_2480"
                }
            ]
        }
    ],
    "homepage": "http://bl831.als.lbl.gov/ringer/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/ringer-detect-molecular-motions-automatic-electron-density-sampling.html"
        }
    ],
    "name": "Ringer",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Although proteins populate large structural ensembles, X-ray diffraction data are traditionally interpreted using a single model. To search for evidence of alternate conformers, we developed a program, Ringer, which systematically samples electron density around the dihedral angles of protein side chains. In a diverse set of 402 structures, Ringer identified weak, nonrandom electron-density features that suggest of the presence of hidden, lowly populated conformations for >18% of uniquely modeled residues. Although these peaks occur at electron-density levels traditionally regarded as noise, statistically significant (P < 10-5) enrichment of peaks at successive rotameric χ angles validates the assignment of these features as unmodeled conformations. Weak electron density corresponding to alternate rotamers also was detected in an accurate electron density map free of model bias. Ringer analysis of the high-resolution structures of free and peptide-bound calmodulin identified shifts in ensembles and connected the alternate conformations to ligand recognition. These results show that the signal in high-resolution electron density maps extends below the traditional 1 σ cutoff, and crystalline proteins are more polymorphic than current crystallographic models. Ringer provides an objective, systematic method to identify previously undiscovered alternate conformations that can mediate protein folding and function. Published by Wiley-Blackwell. © 2010 The Protein Society.",
                "authors": [
                    {
                        "name": "Lang P.T."
                    },
                    {
                        "name": "Ng H.-L."
                    },
                    {
                        "name": "Fraser J.S."
                    },
                    {
                        "name": "Corn J.E."
                    },
                    {
                        "name": "Echols N."
                    },
                    {
                        "name": "Sales M."
                    },
                    {
                        "name": "Holton J.M."
                    },
                    {
                        "name": "Alber T."
                    }
                ],
                "citationCount": 86,
                "date": "2010-01-01T00:00:00Z",
                "journal": "Protein Science",
                "title": "Automated electron-density sampling reveals widespread conformational polymorphism in proteins"
            },
            "pmid": "20499387"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        }
    ],
    "validated": 1
}