{
    "additionDate": "2017-08-03T19:02:15Z",
    "biotoolsCURIE": "biotools:superpc",
    "biotoolsID": "superpc",
    "credit": [
        {
            "email": "tibs@stanford.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www-stat.stanford.edu/~tibs/"
        }
    ],
    "description": "This tool does prediction for a censored survival outcome, or a regression outcome, using the “supervised principal component” approach. It is especially useful when the number of features p is >> n, the number of samples, for example in microarray studies.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://statweb.stanford.edu/~tibs/superpc/tutorial.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "http://www-stat.stanford.edu/~tibs/superpc/",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/superpc-1-05-survival-regression-analysis-microarrays.html"
        }
    ],
    "name": "SuperPC",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "An important goal of DNA microarray research is to develop tools to diagnose cancer more accurately based on the genetic profile of a tumor. There are several existing techniques in the literature for performing this type of diagnosis. Unfortunately, most of these techniques assume that different subtypes of cancer are already known to exist. Their utility is limited when such subtypes have not been previously identified. Although methods for identifying such subtypes exist, these methods do not work well for all datasets. It would be desirable to develop a procedure to find such subtypes that is applicable in a wide variety of circumstances. Even if no information is known about possible subtypes of a certain form of cancer, clinical information about the patients, such as their survival time, is often available. In this study, we develop some procedures that utilize both the gene expression data and the clinical data to identify subtypes of cancer and use this knowledge to diagnose future patients. These procedures were successfully applied to several publicly available datasets. We present diagnostic procedures that accurately predict the survival of future patients based on the gene expression profile and survival times of previous patients. This has the potential to be a powerful tool for diagnosing and treating cancer.",
                "authors": [
                    {
                        "name": "Bair E."
                    },
                    {
                        "name": "Tibshirani R."
                    }
                ],
                "citationCount": 411,
                "date": "2004-09-27T00:00:00Z",
                "journal": "PLoS Biology",
                "title": "Semi-supervised methods to predict patient survival from gene expression data"
            },
            "pmid": "15094809"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}