{
    "additionDate": "2021-01-18T07:45:02Z",
    "biotoolsCURIE": "biotools:gronor",
    "biotoolsID": "gronor",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "T. P. Straatsma",
            "typeEntity": "Person"
        }
    ],
    "description": "Massively parallel and GPU-accelerated non-orthogonal configuration interaction for large molecular systems.\n\nGronOR started in 2016 as a collaboration of the Theoretical Chemistry group of the University of Groningen in Groningen, the Netherlands and the National Center for Computational Sciences at the Oak Ridge National Laboratory in Oak Ridge, Tennessee, with the objective of developing massively parallel and accelerated computational chemistry applications.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://gronor.org",
    "lastUpdate": "2021-01-25T11:04:07Z",
    "name": "GronOR",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1063/1.5141358",
            "metadata": {
                "abstract": "© 2020 U.S. Government.GronOR is a program package for non-orthogonal configuration interaction calculations for an electronic wave function built in terms of anti-symmetrized products of multi-configuration molecular fragment wave functions. The two-electron integrals that have to be processed may be expressed in terms of atomic orbitals or in terms of an orbital basis determined from the molecular orbitals of the fragments. The code has been specifically designed for execution on distributed memory massively parallel and Graphics Processing Unit (GPU)-accelerated computer architectures, using an MPI+OpenACC/OpenMP programming approach. The task-based execution model used in the implementation allows for linear scaling with the number of nodes on the largest pre-exascale architectures available, provides hardware fault resiliency, and enables effective execution on systems with distinct central processing unit-only and GPU-accelerated partitions. The code interfaces with existing multi-configuration electronic structure codes that provide optimized molecular fragment orbitals, configuration interaction coefficients, and the required integrals. Algorithm and implementation details, parallel and accelerated performance benchmarks, and an analysis of the sensitivity of the accuracy of results and computational performance to thresholds used in the calculations are presented.",
                "authors": [
                    {
                        "name": "Straatsma T.P."
                    },
                    {
                        "name": "Broer R."
                    },
                    {
                        "name": "Faraji S."
                    },
                    {
                        "name": "Havenith R.W.A."
                    },
                    {
                        "name": "Suarez L.E.A."
                    },
                    {
                        "name": "Kathir R.K."
                    },
                    {
                        "name": "Wibowo M."
                    },
                    {
                        "name": "De Graaf C."
                    }
                ],
                "citationCount": 5,
                "date": "2020-02-14T00:00:00Z",
                "journal": "Journal of Chemical Physics",
                "title": "GronOR: Massively parallel and GPU-accelerated non-orthogonal configuration interaction for large molecular systems"
            },
            "pmid": "32061226"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}