{
    "accessibility": "Open access",
    "additionDate": "2023-01-30T23:36:01.227169Z",
    "biotoolsCURIE": "biotools:pscl-2lsaesm",
    "biotoolsID": "pscl-2lsaesm",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jiangning.song@monash.edu",
            "name": "Jiangning Song",
            "orcidid": "https://orcid.org/0000-0001-8031-9086",
            "typeEntity": "Person"
        },
        {
            "email": "njyudj@njust.edu.cn",
            "name": "Dong-Jun Yu",
            "orcidid": "https://orcid.org/0000-0002-6786-8053",
            "typeEntity": "Person"
        },
        {
            "name": "Fazal Hadi"
        },
        {
            "name": "Matee Ullah"
        }
    ],
    "description": "Bioimage-based prediction of protein subcellular localization by integrating heterogeneous features with the two-level SAE-SM and mean ensemble method.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Protein signal peptide detection",
                    "uri": "http://edamontology.org/operation_0418"
                },
                {
                    "term": "Subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                }
            ]
        }
    ],
    "homepage": "https://github.com/csbio-njust-edu/PScL-2LSAESM",
    "language": [
        "C",
        "MATLAB"
    ],
    "lastUpdate": "2024-11-24T15:06:41.402469Z",
    "license": "Not licensed",
    "name": "PScL-2LSAESM",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btac727",
            "metadata": {
                "abstract": "Motivation: Over the past decades, a variety of in silico methods have been developed to predict protein subcellular localization within cells. However, a common and major challenge in the design and development of such methods is how to effectively utilize the heterogeneous feature sets extracted from bioimages. In this regards, limited efforts have been undertaken. Results: We propose a new two-level stacked autoencoder network (termed 2L-SAE-SM) to improve its performance by integrating the heterogeneous feature sets. In particular, in the first level of 2L-SAE-SM, each optimal heterogeneous feature set is fed to train our designed stacked autoencoder network (SAE-SM). All the trained SAE-SMs in the first level can output the decision sets based on their respective optimal heterogeneous feature sets, known as ‘intermediate decision’ sets. Such intermediate decision sets are then ensembled using the mean ensemble method to generate the ‘intermediate feature’ set for the second-level SAE-SM. Using the proposed framework, we further develop a novel predictor, referred to as PScL-2LSAESM, to characterize image-based protein subcellular localization. Extensive benchmarking experiments on the latest benchmark training and independent test datasets collected from the human protein atlas databank demonstrate the effectiveness of the proposed 2L-SAE-SM framework for the integration of heterogeneous feature sets. Moreover, performance comparison of the proposed PScL-2LSAESM with current state-of-the-art methods further illustrates that PScL-2LSAESM clearly outperforms the existing state-of-the-art methods for the task of protein subcellular localization.",
                "authors": [
                    {
                        "name": "Hadi F."
                    },
                    {
                        "name": "Song J."
                    },
                    {
                        "name": "Ullah M."
                    },
                    {
                        "name": "Yu D.-J."
                    }
                ],
                "citationCount": 2,
                "date": "2023-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "PScL-2LSAESM: bioimage-based prediction of protein subcellular localization by integrating heterogeneous features with the two-level SAE-SM and mean ensemble method"
            },
            "pmcid": "PMC9947927",
            "pmid": "36413068"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Bioimaging",
            "uri": "http://edamontology.org/topic_3383"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Protein targeting and localisation",
            "uri": "http://edamontology.org/topic_0140"
        }
    ]
}
