{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2023-01-08T01:15:15.041763Z",
    "biotoolsCURIE": "biotools:ezcancertarget",
    "biotoolsID": "ezcancertarget",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "dora.david@med.semmelweis-univ.hu",
            "name": "David Dora",
            "orcidid": "https://orcid.org/0000-0002-3138-8816",
            "typeEntity": "Person"
        },
        {
            "email": "zoltan.lohinai@koranyi.hu",
            "name": "Zoltan Lohinai",
            "typeEntity": "Person"
        },
        {
            "name": "Csongor Gerdán"
        },
        {
            "name": "Gabor Szegvari"
        },
        {
            "name": "Timea Dora"
        }
    ],
    "description": "An open-access drug repurposing and data-collection tool to enhance target validation and optimize international research efforts against highly progressive cancers.",
    "documentation": [
        {
            "type": [
                "General",
                "User manual"
            ],
            "url": "https://cycle20.github.io/EZCancerTarget/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/cycle20/EZCancerTarget",
    "language": [
        "R",
        "Shell"
    ],
    "lastUpdate": "2023-01-08T01:17:51.825122Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://cycle20.github.io/EZCancerTarget/"
        }
    ],
    "name": "EZCancerTarget",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S13040-022-00307-9",
            "metadata": {
                "abstract": "© 2022, The Author(s).The expanding body of potential therapeutic targets requires easily accessible, structured, and transparent real-time interpretation of molecular data. Open-access genomic, proteomic and drug-repurposing databases transformed the landscape of cancer research, but most of them are difficult and time-consuming for casual users. Furthermore, to conduct systematic searches and data retrieval on multiple targets, researchers need the help of an expert bioinformatician, who is not always readily available for smaller research teams. We invite research teams to join and aim to enhance the cooperative work of more experienced groups to harmonize international efforts to overcome devastating malignancies. Here, we integrate available fundamental data and present a novel, open access, data-aggregating, drug repurposing platform, deriving our searches from the entries of Clue.io. We show how we integrated our previous expertise in small-cell lung cancer (SCLC) to initiate a new platform to overcome highly progressive cancers such as triple-negative breast and pancreatic cancer with data-aggregating approaches. Through the front end, the current content of the platform can be further expanded or replaced and users can create their drug-target list to select the clinically most relevant targets for further functional validation assays or drug trials. EZCancerTarget integrates searches from publicly available databases, such as PubChem, DrugBank, PubMed, and EMA, citing up-to-date and relevant literature of every target. Moreover, information on compounds is complemented with biological background information on eligible targets using entities like UniProt, String, and GeneCards, presenting relevant pathways, molecular- and biological function and subcellular localizations of these molecules. Cancer drug discovery requires a convergence of complex, often disparate fields. We present a simple, transparent, and user-friendly drug repurposing software to facilitate the efforts of research groups in the field of cancer research.",
                "authors": [
                    {
                        "name": "Dora D."
                    },
                    {
                        "name": "Dora T."
                    },
                    {
                        "name": "Gerdan C."
                    },
                    {
                        "name": "Lohinai Z."
                    },
                    {
                        "name": "Szegvari G."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "BioData Mining",
                "title": "EZCancerTarget: an open-access drug repurposing and data-collection tool to enhance target validation and optimize international research efforts against highly progressive cancers"
            },
            "pmcid": "PMC9526900",
            "pmid": "36183137"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
