{
    "additionDate": "2020-01-14T20:16:41Z",
    "biotoolsCURIE": "biotools:Joint_Multi-Modal_Longitudinal_Regression_Classification",
    "biotoolsID": "Joint_Multi-Modal_Longitudinal_Regression_Classification",
    "confidence_flag": "tool",
    "description": "Joint Multi-Modal Longitudinal Regression and Classification for Alzheimer's Disease Prediction.\n\nCode for Joint Multi-Modal Longitudinal Regression and Classification.\n\nJoint Multi-Modal Longitudinal Regression and Classification (JMMLRC) Estimator.\n\nThis repository contains the code for performing a classification and a regression task at the same time on longitudinal data. This work has been applied to the ADNI dataset and has shown state-of-the-art performance in predicting patients with and without Alzheimer's Disease.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/minds-mines/jmmlrc",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T20:55:09.123245Z",
    "name": "Joint Multi-Modal Longitudinal Regression Classification",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1109/tmi.2019.2958943",
            "metadata": {
                "abstract": "Alzheimer's disease (AD) is a serious neurodegenerative condition that affects millions of individuals across the world. As the average age of individuals in the United States and the world increases, the prevalence of AD will continue to grow. To address this public health problem, the research community has developed computational approaches to sift through various aspects of clinical data and uncover their insights, among which one of the most challenging problem is to determine the biological mechanisms that cause AD to develop. To study this problem, in this paper we present a novel Joint Multi-Modal Longitudinal Regression and Classification method and show how it can be used to identify the cognitive status of the participants in the Alzheimer's Disease Neuroimaging Initiative (ADNI) cohort and the underlying biological mechanisms. By intelligently combining clinical data of various modalities (i.e., genetic information and brain scans) using a variety of regularizations that can identify AD-relevant biomarkers, we perform the regression and classification tasks simultaneously. Because the proposed objective is a non-smooth optimization problem that is difficult to solve in general, we derive an efficient iterative algorithm and rigorously prove its convergence. To validate our new method in predicting the cognitive scores of patients and their clinical diagnosis, we conduct comprehensive experiments on the ADNI cohort. Our promising results demonstrate the benefits and flexibility of the proposed method. We anticipate that our new method is of interest to clinical communities beyond AD research and have open-sourced the code of our method online.11The code package for the proposed Joint Multi-Modal Longitudinal Regression and Classification model have been made publicly available online at https://github.com/minds-mines/jmmlrc.",
                "authors": [
                    {
                        "name": "Brand L."
                    },
                    {
                        "name": "Huang H."
                    },
                    {
                        "name": "Nichols K."
                    },
                    {
                        "name": "Shen L."
                    },
                    {
                        "name": "Wang H."
                    }
                ],
                "citationCount": 52,
                "date": "2020-06-01T00:00:00Z",
                "journal": "IEEE Transactions on Medical Imaging",
                "title": "Joint Multi-Modal Longitudinal Regression and Classification for Alzheimer's Disease Prediction"
            },
            "pmcid": "PMC7380699",
            "pmid": "31841400"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}
