{
    "additionDate": "2021-01-18T10:24:45Z",
    "biotoolsCURIE": "biotools:gloryx",
    "biotoolsID": "gloryx",
    "confidence_flag": "tool",
    "description": "Prediction of the Metabolites Resulting from Phase 1 and Phase 2 Biotransformations of Xenobiotics.\n\nNew E-Resource for Drug Discovery.\n\nRegioselectivity prediction for phase 1 and phase 2 metabolism.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic pathway prediction",
                    "uri": "http://edamontology.org/operation_3929"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                }
            ]
        }
    ],
    "homepage": "https://nerdd.zbh.uni-hamburg.de/",
    "lastUpdate": "2021-01-23T10:14:43Z",
    "name": "GLORYx",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1021/ACS.CHEMRESTOX.0C00224",
            "metadata": {
                "abstract": "© 2021 American Chemical Society. All rights reserved.Predicting the structures of metabolites formed in humans can provide advantageous insights for the development of drugs and other compounds. Here we present GLORYx, which integrates machine learning-based site of metabolism (SoM) prediction with reaction rule sets to predict and rank the structures of metabolites that could potentially be formed by phase 1 and/or phase 2 metabolism. GLORYx extends the approach from our previously developed tool GLORY, which predicted metabolite structures for cytochrome P450-mediated metabolism only. A robust approach to ranking the predicted metabolites is attained by using the SoM probabilities predicted by the FAME 3 machine learning models to score the predicted metabolites. On a manually curated test data set containing both phase 1 and phase 2 metabolites, GLORYx achieves a recall of 77% and an area under the receiver operating characteristic curve (AUC) of 0.79. Separate analysis of performance on a large amount of freely available phase 1 and phase 2 metabolite data indicates that achieving a meaningful ranking of predicted metabolites is more difficult for phase 2 than for phase 1 metabolites. GLORYx is freely available as a web server at https://nerdd.zbh.uni-hamburg.de/ and is also provided as a software package upon request. The data sets as well as all the reaction rules from this work are also made freely available.",
                "authors": [
                    {
                        "name": "De Bruyn Kops C."
                    },
                    {
                        "name": "Kirchmair J."
                    },
                    {
                        "name": "Mazzolari A."
                    },
                    {
                        "name": "Sicho M."
                    }
                ],
                "citationCount": 8,
                "date": "2021-02-15T00:00:00Z",
                "journal": "Chemical Research in Toxicology",
                "title": "GLORYx: Prediction of the Metabolites Resulting from Phase 1 and Phase 2 Biotransformations of Xenobiotics"
            },
            "pmid": "32786543"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
