{
    "additionDate": "2020-01-14T08:51:18Z",
    "biotoolsCURIE": "biotools:VADR",
    "biotoolsID": "VADR",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "description": "Classification and annotation of viral sequences based on RefSeq annotation.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Reverse complement",
                    "uri": "http://edamontology.org/operation_0363"
                },
                {
                    "term": "Sequence alignment validation",
                    "uri": "http://edamontology.org/operation_0447"
                },
                {
                    "term": "Sequence annotation",
                    "uri": "http://edamontology.org/operation_0361"
                }
            ]
        }
    ],
    "homepage": "https://github.com/nawrockie/vadr",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2025-07-05T14:56:17.738501Z",
    "name": "VADR",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/s12859-020-3537-3",
            "metadata": {
                "abstract": "Background: GenBank contains over 3 million viral sequences. The National Center for Biotechnology Information (NCBI) previously made available a tool for validating and annotating influenza virus sequences that is used to check submissions to GenBank. Before this project, there was no analogous tool in use for non-influenza viral sequence submissions. Results: We developed a system called VADR (Viral Annotation DefineR) that validates and annotates viral sequences in GenBank submissions. The annotation system is based on the analysis of the input nucleotide sequence using models built from curated RefSeqs. Hidden Markov models are used to classify sequences by determining the RefSeq they are most similar to, and feature annotation from the RefSeq is mapped based on a nucleotide alignment of the full sequence to a covariance model. Predicted proteins encoded by the sequence are validated with nucleotide-to-protein alignments using BLAST. The system identifies 43 types of \"alerts\" that (unlike the previous BLAST-based system) provide deterministic and rigorous feedback to researchers who submit sequences with unexpected characteristics. VADR has been integrated into GenBank's submission processing pipeline allowing for viral submissions passing all tests to be accepted and annotated automatically, without the need for any human (GenBank indexer) intervention. Unlike the previous submission-checking system, VADR is freely available (https://github.com/nawrockie/vadr) for local installation and use. VADR has been used for Norovirus submissions since May 2018 and for Dengue virus submissions since January 2019. Since March 2020, VADR has also been used to check SARS-CoV-2 sequence submissions. Other viruses with high numbers of submissions will be added incrementally. Conclusion: VADR improves the speed with which non-flu virus submissions to GenBank can be checked and improves the content and quality of the GenBank annotations. The availability and portability of the software allow researchers to run the GenBank checks prior to submitting their viral sequences, and thereby gain confidence that their submissions will be accepted immediately without the need to correspond with GenBank staff. Reciprocally, the adoption of VADR frees GenBank staff to spend more time on services other than checking routine viral sequence submissions.",
                "authors": [
                    {
                        "name": "Brister J.R."
                    },
                    {
                        "name": "Hatcher E.L."
                    },
                    {
                        "name": "Karsch-Mizrachi I."
                    },
                    {
                        "name": "Nawrocki E.P."
                    },
                    {
                        "name": "Schaffer A.A."
                    },
                    {
                        "name": "Shonkwiler L."
                    },
                    {
                        "name": "Yankie L."
                    }
                ],
                "citationCount": 51,
                "date": "2020-05-24T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "VADR: Validation and annotation of virus sequence submissions to GenBank"
            },
            "pmcid": "PMC7245624",
            "pmid": "32448124"
        }
    ],
    "topic": [
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Virology",
            "uri": "http://edamontology.org/topic_0781"
        }
    ],
    "validated": 1
}
