{
    "accessibility": "Open access",
    "additionDate": "2019-06-20T11:55:57Z",
    "biotoolsCURIE": "biotools:DisConICA",
    "biotoolsID": "DisConICA",
    "cost": "Free of charge",
    "description": "Software Package for Assessing Reproducibility of Brain Networks and their Discriminability across Disorders.",
    "documentation": [
        {
            "note": "Instructions for Processing with DisConICA – Version 1.01.1",
            "type": [
                "General"
            ],
            "url": "https://bitbucket.org/masauburn/disconica/raw/dc4efa3a5ae6f5327d7a5840ef3ea104adf9c523/Instructions%20for%20Processing%20with%20DisConICA_1_01_1.pdf"
        },
        {
            "note": "Instructions for Processing with DisConICA – Version 1.01.2",
            "type": [
                "General"
            ],
            "url": "https://bitbucket.org/masauburn/disconica/raw/dc4efa3a5ae6f5327d7a5840ef3ea104adf9c523/Instructions%20for%20Processing%20with%20DisConICA_1_01_2.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "https://bitbucket.org/masauburn/disconica/src/master/",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2020-06-16T10:55:24Z",
    "license": "Unlicense",
    "link": [
        {
            "note": "disconica_1_01_1",
            "type": [
                "Repository"
            ],
            "url": "https://bitbucket.org/masauburn/disconica/src/master/disconica_1_01_1/"
        },
        {
            "note": "disconica_1_01_2",
            "type": [
                "Repository"
            ],
            "url": "https://bitbucket.org/masauburn/disconica/src/master/disconica_1_01_2/"
        }
    ],
    "maturity": "Mature",
    "name": "DisConICA",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1007/s12021-019-09422-1",
            "metadata": {
                "abstract": "© 2019, Springer Science+Business Media, LLC, part of Springer Nature.There is a lack of objective biomarkers to accurately identify the underlying etiology and related pathophysiology of disparate brain-based disorders that are less distinguishable clinically. Brain networks derived from resting-state functional magnetic resonance imaging (rs-fMRI) has been a popular tool for discovering candidate biomarkers. Specifically, independent component analysis (ICA) of rs-fMRI data is a powerful multivariate technique for investigating brain networks. However, ICA-derived brain networks that are not highly reproducible within heterogeneous clinical populations may exhibit mean statistical separation between groups, yet not be sufficiently discriminative at the individual-subject level. We hypothesize that functional brain networks that are most reproducible in subjects within clinical and control groups separately, but not when the two groups are merged, may possess the ability to discriminate effectively between the groups even at the individual-subject level. In this study, we present DisConICA or “Discover Confirm Independent Component Analysis”, a software package that implements the methodology in support of our hypothesis. It relies on a “discover-confirm” approach based upon the assessment of reproducibility of independent components (representing brain networks) obtained from rs-fMRI (discover phase) using the gRAICAR (generalized Ranking and Averaging Independent Component Analysis by Reproducibility) algorithm, followed by unsupervised clustering analysis of these components to evaluate their ability to discriminate between groups (confirm phase). The unique feature of our software package is its ability to seamlessly interface with other software packages such as SPM and FSL, so that all related analyses utilizing features of other software can be performed within our package, thus providing a one-stop software solution starting with raw DICOM images to the final results. We showcase our software using rs-fMRI data acquired from US Army soldiers returning from the wars in Iraq and Afghanistan who were clinically grouped into the following groups: PTSD (posttraumatic stress disorder), comorbid PCS (post-concussion syndrome) + PTSD, and matched healthy combat controls. This software package along with test data sets is available for download at https://bitbucket.org/masauburn/disconica.",
                "authors": [
                    {
                        "name": "Denney T.S."
                    },
                    {
                        "name": "Deshpande G."
                    },
                    {
                        "name": "Dretsch M.N."
                    },
                    {
                        "name": "Hu X."
                    },
                    {
                        "name": "Katz J.S."
                    },
                    {
                        "name": "Rangaprakash D."
                    },
                    {
                        "name": "Syed M.A."
                    },
                    {
                        "name": "Yang Z."
                    }
                ],
                "citationCount": 2,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Neuroinformatics",
                "title": "DisConICA: a Software Package for Assessing Reproducibility of Brain Networks and their Discriminability across Disorders"
            },
            "pmid": "31187352",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        }
    ],
    "validated": 1,
    "version": [
        "1.01.1",
        "1.01.2"
    ]
}
