{"credit":[{"email":"phisite@embnet.sk","name":"phiSITE Support","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://www.phisite.org/main/index.php?nav=help"}],"function":[{"operation":[{"term":"Pathway or network prediction","uri":"http://edamontology.org/operation_3439"},{"term":"Transcriptional regulatory element prediction","uri":"http://edamontology.org/operation_0438"},{"term":"Regulatory element prediction","uri":"http://edamontology.org/operation_0438"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Database portal"],"topic":[{"term":"Transcription factors and regulatory sites","uri":"http://edamontology.org/topic_0749"},{"term":"Gene regulation","uri":"http://edamontology.org/topic_0204"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"},{"term":"Gene and protein families","uri":"http://edamontology.org/topic_0623"}]},"publication":[{"abstract":"We have developed phiSITE, database of gene regulation in bacteriophages. To date it contains detailed information about more than 700 experimentally confirmed or predicted regulatory elements (promoters, operators, terminators and attachment sites) from 32 bacteriophages belonging to Siphoviridae, Myoviridae and Podoviridae families. The database is manually curated, the data are collected mainly form scientific papers, cross-referenced with other database resources (EMBL, UniProt, NCBI taxonomy database, NCBI Genome, ICTVdb, PubMed Central) and stored in SQL based database system. The system provides full text search for regulatory elements, graphical visualization of phage genomes and several export options. In addition, visualizations of gene regulatory networks for five phages (Bacillus phage GA-1, Enterobacteria phage lambda, Enterobacteria phage Mu, Enterobacteria phage P2 and Mycoplasma phage P1) have been defined and made available. The phiSITE is accessible at http://www.phisite.org/. © The Author(s) 2009. Published by Oxford University Press.","authors":["Klucar L.","Stano M.","Hajduk M."],"cit_count":31,"journal":"Nucleic Acids Research","pmid":"19900969","title":"PhiSITE: Database of gene regulation in bacteriophages","year":"2009-11-07"}],"summary":{"biotoolsCURIE":"biotools:phisite","biotoolsID":"phisite","description":"Database of gene regulation in bacteriophages. It collects experimentally confirmed or predicted regulatory elements (promoters, operators, terminators and attachment sites) from bacteriophages belonging to Siphoviridae, Myoviridae and Podoviridae families. The database is manually curated, the data are collected mainly form scientific papers, cross-referenced with other database resources (EMBL, UniProt, NCBI taxonomy database, NCBI Genome, ICTVdb, PubMed Central).","homepage":"http://www.phisite.org","name":"phiSITE"}}