{
    "accessibility": [
        "Open access"
    ],
    "additionDate": "2019-05-21T08:41:49Z",
    "biotoolsCURIE": "biotools:EpiMethEx",
    "biotoolsID": "EpiMethEx",
    "cost": "Free of charge",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/giupardeb"
        }
    ],
    "description": "R package for large-scale integrated analysis in methylation hotspots linked to genetic regulation.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Whole genome methylation analysis",
                    "uri": "http://edamontology.org/operation_3206"
                },
                {
                    "term": "Gene methylation analysis",
                    "uri": "http://edamontology.org/operation_3207"
                }
            ]
        }
    ],
    "homepage": "https://github.com/giupardeb/EpiMethEx",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-05-21T08:41:49Z",
    "license": "Apache-2.0",
    "maturity": "Mature",
    "name": "EpiMethEx",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12859-018-2397-6",
            "metadata": {
                "abstract": "© 2018 The Author(s). Background: DNA methylation is an epigenetic mechanism of genomic regulation involved in the maintenance of homeostatic balance. Dysregulation of DNA methylation status is one of the driver alterations occurring in neoplastic transformation and cancer progression. The identification of methylation hotspots associated to gene dysregulation may contribute to discover new prognostic and diagnostic biomarkers, as well as, new therapeutic targets. Results: We present EpiMethEx (Epigenetic Methylation and Expression), a R package to perform a large-scale integrated analysis by cyclic correlation analyses between methylation and gene expression data. For each gene, samples are segmented according to the expression levels to select genes that are differentially expressed. This stratification allows to identify CG methylation probesets modulated among gene-stratified samples. Subsequently, the methylation probesets are grouped by their relative position in gene sequence to identify wide genomic methylation events statically related to genetic modulation. Conclusions: The beta-test study showed that the global methylation analysis was in agreement with scientific literature. In particular, this analysis revealed a negative association between promoter hypomethylation and overexpression in a wide number of genes. Less frequently, this overexpression was sustained by intragenic hypermethylation events.",
                "authors": [
                    {
                        "name": "Candido S."
                    },
                    {
                        "name": "Parasiliti Palumbo G.A."
                    },
                    {
                        "name": "Pennisi M."
                    },
                    {
                        "name": "Russo G."
                    },
                    {
                        "name": "Sgroi G."
                    },
                    {
                        "name": "Di Salvatore V."
                    },
                    {
                        "name": "Libra M."
                    },
                    {
                        "name": "Pappalardo F."
                    }
                ],
                "citationCount": 1,
                "date": "2019-02-04T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "EpiMethEx: A tool for large-scale integrated analysis in methylation hotspots linked to genetic regulation 06 Biological Sciences 0604 Genetics"
            },
            "pmid": "30717649",
            "type": "Primary"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ]
}