{
    "additionDate": "2021-01-18T07:36:44Z",
    "biotoolsCURIE": "biotools:dl4papers",
    "biotoolsID": "dl4papers",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "lbugnon@sinc.unl.edu.ar",
            "name": "L A Bugnon",
            "typeEntity": "Person"
        }
    ],
    "description": "DL4papers is a deep learning approach for the automatic interpretation of scientific articles. DL4papers is a method based on deep learning that is capable of analyzing and interpreting papers in order to automatically extract relevant relations from the published literature, and between specific keywords. DL4papers receives as input a set of desired keywords, and it returns a ranked list of papers that contain meaningful associations between them.",
    "download": [
        {
            "type": "Source code",
            "url": "https://sourceforge.net/projects/sourcesinc/files/dl4papers/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Article comparison",
                    "uri": "http://edamontology.org/operation_3437"
                }
            ]
        }
    ],
    "homepage": "http://sinc.unl.edu.ar/web-demo/dl4papers/",
    "lastUpdate": "2021-03-01T10:58:58Z",
    "name": "DL4papers",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA111",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: In precision medicine, next-generation sequencing and novel preclinical reports have led to an increasingly large amount of results, published in the scientific literature. However, identifying novel treatments or predicting a drug response in, for example, cancer patients, from the huge amount of papers available remains a laborious and challenging work. This task can be considered a text mining problem that requires reading a lot of academic documents for identifying a small set of papers describing specific relations between key terms. Due to the infeasibility of the manual curation of these relations, computational methods that can automatically identify them from the available literature are urgently needed. Results: We present DL4papers, a new method based on deep learning that is capable of analyzing and interpreting papers in order to automatically extract relevant relations between specific keywords. DL4papers receives as input a query with the desired keywords, and it returns a ranked list of papers that contain meaningful associations between the keywords. The comparison against related methods showed that our proposal outperformed them in a cancer corpus. The reliability of the DL4papers output list was also measured, revealing that 100% of the first two documents retrieved for a particular search have relevant relations, in average. This shows that our model can guarantee that in the top-2 papers of the ranked list, the relation can be effectively found. Furthermore, the model is capable of highlighting, within each document, the specific fragments that have the associations of the input keywords. This can be very useful in order to pay attention only to the highlighted text, instead of reading the full paper. We believe that our proposal could be used as an accurate tool for rapidly identifying relationships between genes and their mutations, drug responses and treatments in the context of a certain disease. This new approach can certainly be a very useful and valuable resource for the advancement of the precision medicine field. Contact: lbugnon@sinc.unl.edu.ar",
                "authors": [
                    {
                        "name": "Bugnon L.A."
                    },
                    {
                        "name": "Yones C."
                    },
                    {
                        "name": "Raad J."
                    },
                    {
                        "name": "Gerard M."
                    },
                    {
                        "name": "Rubiolo M."
                    },
                    {
                        "name": "Merino G."
                    },
                    {
                        "name": "Pividori M."
                    },
                    {
                        "name": "Di Persia L."
                    },
                    {
                        "name": "Milone D.H."
                    },
                    {
                        "name": "Stegmayer G."
                    }
                ],
                "date": "2020-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "DL4papers: A deep learning approach for the automatic interpretation of scientific articles"
            },
            "pmid": "32091584"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        }
    ]
}