{
    "additionDate": "2021-01-18T11:26:43Z",
    "biotoolsCURIE": "biotools:consort-nlp",
    "biotoolsID": "consort-nlp",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "herbpang@hku.hk",
            "name": "Herbert Pang",
            "typeEntity": "Person"
        }
    ],
    "description": "CONSORT-NLP is an Artificial Intelligence Tool with Automated Reporting Checklist Generation for Parallel Group Randomized Trials.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Literature search",
                    "uri": "http://edamontology.org/operation_0305"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "http://www.consort-nlp.org",
    "language": [
        "Java"
    ],
    "lastUpdate": "2021-02-17T14:31:54Z",
    "name": "CONSORT-NLP",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1001/JAMANETWORKOPEN.2020.14661",
            "metadata": {
                "abstract": "© 2020 Royal Society of Chemistry. All rights reserved.Importance: Adherence to the Consolidated Standards of Reporting Trials (CONSORT) for randomized clinical trials is associated with improvingquality because inadequate reporting in randomized clinical trials may complicate the interpretation and the application of findings to clinical care. Objective: To evaluate an automated reporting checklist generation tool that uses natural language processing (NLP), called CONSORT-NLP. Design, Setting, and Participants: This study used published journal articles as training, testing, and validation sets to develop, refine, and evaluate the CONSORT-NLP tool. Articles reporting randomized clinical trials were selected from 25 high-impact-factor journals under the following categories: (1) general and internal medicine, (2) oncology, and (3) cardiac and cardiovascular systems. Main Outcomes and Measures: For an evaluation of the performance of this tool, an accuracy metric defined as the number of correct assessments divided by all assessments was calculated. Results: The CONSORT-NLP tool uses the widely used Portable Document Format as an input file. Of the 37 CONSORT reporting items, 34 (92%) were included in the tool. Of these 34 reporting items, 30 were fully implemented; 28 (93%) of the fully implemented CONSORT reporting items had an accuracy of more than 90% for the validation set. The remaining 2 (7%) had an accuracy between 80% and 90% for the validation set. Two to 5 articles were selected from each of these journals for a total of 158 articles to establish a training set of 111 articles to train CONSORT-NLP for CONSORT reporting items, a testing set of 25 articles to refine CONSORT-NLP, and a validation set of 22 articles to assess the performance of CONSORT-NLP. The CONSORT-NLP tool used the Portable Document Format of the articles as input files. A CONSORT-NLP graphical user interface was built using Java in 2019. The time required to complete the CONSORT checklist manually vs using the CONSORT-NLP tool was compared for 30 articles. Two case studies for randomized clinical trials are provided as an illustration for the CONSORT-NLP tool. For the 30 articles investigated, CONSORT-NLP required a mean (SD) 23.0 (4.1) seconds, whereas the manual reviewer required a mean (SD) 11.9 (2.2), 22.6 (4.6), and 57.6 (7.1) minutes, for 3 reviewers, respectively. Conclusions and Relevance: The CONSORT-NLP tool is designed to assist in the reporting of randomized clinical trials. Potential users of CONSORT-NLP include clinicians, researchers, and scientists who plan to publish a randomized trial study in a peer-reviewed journal. The use of CONSORT-NLP may help them save substantial time when generating the CONSORT checklist. This tool may also be useful for manuscript reviewers and journal editors who review these articles.",
                "authors": [
                    {
                        "name": "Califf R.M."
                    },
                    {
                        "name": "Cheung K."
                    },
                    {
                        "name": "Page D."
                    },
                    {
                        "name": "Pang H."
                    },
                    {
                        "name": "Schilsky R.L."
                    },
                    {
                        "name": "Wang F."
                    },
                    {
                        "name": "Wang X."
                    }
                ],
                "date": "2020-10-01T00:00:00Z",
                "journal": "JAMA Network Open",
                "title": "Development and Validation of a Natural Language Processing Tool to Generate the CONSORT Reporting Checklist for Randomized Clinical Trials"
            },
            "pmcid": "PMC7545295",
            "pmid": "33030549"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Cardiology",
            "uri": "http://edamontology.org/topic_3335"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ]
}
