{
    "accessibility": "Open access",
    "additionDate": "2021-01-18T09:03:20Z",
    "biotoolsCURIE": "biotools:cupp",
    "biotoolsID": "cupp",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "asme@dtu.dk",
            "name": "Anne S Meyer",
            "orcidid": "https://orcid.org/0000-0001-8910-9931",
            "typeEntity": "Person"
        }
    ],
    "description": "Conserved Unique Peptide Patterns (CUPP) is a approach for sequence analysis employing conserved peptide patterns for determination of similarities between proteins. CUPP performs unsupervised clustering of proteins for formation of protein groups and can be used for fast annotation of enzyme protein family, subfamily and EC function of carbohydrate-active enzymes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Phylogenetic tree annotation",
                    "uri": "http://edamontology.org/operation_0558"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                }
            ]
        }
    ],
    "homepage": "https://cupp.info",
    "lastUpdate": "2021-02-18T18:31:40Z",
    "name": "CUPP",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA375",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.The CUPP platform includes a web server for functional annotation and sub-grouping of carbohydrate active enzymes (CAZymes) based on a novel peptide-based similarity assessment algorithm, i.e. protein grouping according to Conserved Unique Peptide Patterns (CUPP). This online platform is open to all users and there is no login requirement. The web server allows the user to perform genome-based annotation of carbohydrate active enzymes to CAZy families, CAZy subfamilies, CUPP groups and EC numbers (function) via assessment of peptide-motifs by CUPP. The web server is intended for functional annotation assessment of the CAZy inventory of prokaryotic and eukaryotic organisms from genomic DNA (up to 30MB compressed) or directly from amino acid sequences (up to 10MB compressed). The custom query sequences are assessed using the CUPP annotation algorithm, and the outcome is displayed in interactive summary result pages of CAZymes. The results displayed allow for inspection of members of the individual CUPP groups and include information about experimentally characterized members. The web server and the other resources on the CUPP platform can be accessed from https://cupp.info.",
                "authors": [
                    {
                        "name": "Barrett K."
                    },
                    {
                        "name": "Hunt C.J."
                    },
                    {
                        "name": "Lange L."
                    },
                    {
                        "name": "Meyer A.S."
                    }
                ],
                "citationCount": 4,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Conserved unique peptide patterns (CUPP) online platform: Peptide-based functional annotation of carbohydrate active enzymes"
            },
            "pmcid": "PMC7319580",
            "pmid": "32406917"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Carbohydrates",
            "uri": "http://edamontology.org/topic_0152"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ]
}