{
    "accessibility": "Open access",
    "additionDate": "2022-05-16T21:00:09.692391Z",
    "biotoolsCURIE": "biotools:spinspj",
    "biotoolsID": "spinspj",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "chenzhiwei@xmu.edu.cn",
            "name": "Zhiwei Chen",
            "orcidid": "https://orcid.org/0000-0001-6637-8194",
            "typeEntity": "Person"
        },
        {
            "email": "songkan@qone-inst.com",
            "name": "Kan Song",
            "typeEntity": "Person"
        },
        {
            "name": "Zao Liu"
        }
    ],
    "description": "A novel NMR scripting system to implement artificial intelligence and advanced applications.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.spinstudioj.net/spinspj/doc/Script%20programming.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Principal component analysis",
                    "uri": "http://edamontology.org/operation_3960"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                }
            ]
        }
    ],
    "homepage": "http://www.spinstudioj.net/spinspj",
    "language": [
        "Java",
        "Python"
    ],
    "lastUpdate": "2022-05-16T21:00:09.695080Z",
    "license": "EPL-1.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/qonenmr/spinspj"
        }
    ],
    "name": "SpinSPJ",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04492-Y",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Software for nuclear magnetic resonance (NMR) spectrometers offer general functionality of instrument control and data processing; these applications are often developed with non-scripting languages. NMR users need to flexibly integrate rapidly developing NMR applications with emerging technologies. Scripting systems offer open environments for NMR users to write custom programs. However, existing scripting systems have limited capabilities for both extending the functionality of NMR software’s non-script main program and using advanced native script libraries to support specialized application domains (e.g., biomacromolecules and metabolomics). Therefore, it is essential to design a novel scripting system to address both of these needs. Result: Here, a novel NMR scripting system named SpinSPJ is proposed. It works as a plug-in in the Java based NMR spectrometer software SpinStudioJ. In the scripting system, both Java based NMR methods and original CPython based libraries are supported. A module has been developed as a bridge to integrate the runtime environments of Java and CPython. The module works as an extension in the CPython environment and interacts with Java via the Java Native Interface. Leveraging this bridge, Java based instrument control and data processing methods of SpinStudioJ can be called with the CPython style. Compared with traditional scripting systems, SpinSPJ better supports both extending the non-script main program and implementing advanced NMR applications with a rich variety of script libraries. NMR researchers can easily call functions of instrument control and data processing as well as developing complex functionality (such as multivariate statistical analysis, deep learning, etc.) with CPython native libraries. Conclusion: SpinSPJ offers a user-friendly environment to implement custom functionality leveraging its powerful basic NMR and rich CPython libraries. NMR applications with emerging technologies can be easily integrated. The scripting system is free of charge and can be downloaded by visiting http://www.spinstudioj.net/spinspj.",
                "authors": [
                    {
                        "name": "Chen Z."
                    },
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Song K."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SpinSPJ: a novel NMR scripting system to implement artificial intelligence and advanced applications"
            },
            "pmcid": "PMC8650269",
            "pmid": "34875998"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        }
    ],
    "validated": 1
}
