{
    "additionDate": "2017-02-10T11:35:33Z",
    "biotoolsCURIE": "biotools:tmbeta-net",
    "biotoolsID": "tmbeta-net",
    "description": "Tool that predicts transmembrane beta strands in an outer membrane protein from its amino acid sequence.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                },
                {
                    "term": "Transmembrane protein analysis",
                    "uri": "http://edamontology.org/operation_0270"
                },
                {
                    "term": "Transmembrane protein prediction",
                    "uri": "http://edamontology.org/operation_0269"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                }
            ]
        }
    ],
    "homepage": "http://psfs.cbrc.jp/tmbeta-net/",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:39Z",
    "name": "TMBETA-NET",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Prediction of transmembrane β-strands in outer membrane proteins (OMP) is one of the important problems in computational chemistry and biology. In this work, we propose a method based on neural networks for identifying the membrane-spanning β-strands. We introduce the concept of \"residue probability\" for assigning residues in transmembrane β-strand segments. The performance of our method is evaluated with single-residue accuracy, correlation, specificity, and sensitivity. Our predicted segments show a good agreement with experimental observations with an accuracy level of 73% solely from amino acid sequence information. Further, the predictive power of N- and C-terminal residues in each segments, number of segments in each protein, and the influence of cutoff probability for identifying membrane-spanning β-strands will be discussed. We have developed a Web server for predicting the transmembrane β-strands from the amino acid sequence, and the prediction results are available at http://psfs.cbrc.jp/tmbeta-net/. © 2004 Wiley Periodicals, Inc.",
                "authors": [
                    {
                        "name": "Gromiha M.M."
                    },
                    {
                        "name": "Ahmad S."
                    },
                    {
                        "name": "Suwa M."
                    }
                ],
                "citationCount": 67,
                "date": "2004-04-15T00:00:00Z",
                "journal": "Journal of Computational Chemistry",
                "title": "Neural Network-Based Prediction of Transmembrane β-Strand Segments in Outer Membrane Proteins"
            },
            "pmid": "14978719"
        },
        {
            "metadata": {
                "abstract": "We have developed a web-server, TMBETA-NET for discriminating outer membrane proteins and predicting their membrane spanning β-strand segments. The amino acid compositions of globular and outer membrane proteins have been systematically analyzed and a statistical method has been proposed for discriminating outer membrane proteins. The prediction of membrane spanning segments is mainly based on feed forward neural network and refined with β-strand length. Our program takes the amino acid sequence as input and displays the type of the protein along with membrane-spanning β-strand segments as a stretch of highlighted amino acid residues. Further, the probability of residues to be in transmembrane β-strand has been provided with a coloring scheme. We observed that outer membrane proteins were discriminated with an accuracy of 89% and their membrane spanning β-strand segments at an accuracy of 73% just from amino acid sequence information. The prediction server is available at http://psfs.cbrc.jp/tmbeta-net/. © 2005 Oxford University Press.",
                "authors": [
                    {
                        "name": "Gromiha M.M."
                    },
                    {
                        "name": "Ahmad S."
                    },
                    {
                        "name": "Suwa M."
                    }
                ],
                "citationCount": 43,
                "date": "2005-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "TMBETA-NET: Discrimination and prediction of membrane spanning β-strands in outer membrane proteins"
            },
            "pmid": "15980447"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Membrane and lipoproteins",
            "uri": "http://edamontology.org/topic_0820"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}