
{
    "credit": [
        {
            "email": "mfourmen@bio.mq.edu.au",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://mateo.fourment.free.fr/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://bioinformatics.org/virusbanker/virusbanker-help.doc"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence database search",
                    "uri": "http://edamontology.org/operation_0338"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Data submission, annotation and curation",
                "uri": "http://edamontology.org/topic_0219"
            },
            {
                "term": "Virology",
                "uri": "http://edamontology.org/topic_0781"
            },
            {
                "term": "Nucleic acid structure analysis",
                "uri": "http://edamontology.org/topic_0097"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/virusbanker-1-0-mysql-database-virus-sequences-alignments.html"
        }
    ],
    "publication": [
        {
            "abstract": "Background: Viruses of the Bunyaviridae have segmented negative-stranded RNA genomes and several of them cause significant disease. Many partial sequences have been obtained from the segments so that GenBank searches give complex results. Sequence databases usually use HTML pages to mediate remote sorting, but this approach can be limiting and may discourage a user from exploring a database. Results: The VirusBanker database contains Bunyaviridae sequences and alignments and is presented as two spreadsheets generated by a Java program that interacts with a MySQL database on a server. Sequences are displayed in rows and may be sorted using information that is displayed in columns and includes data relating to the segment, gene, protein, species, strain, sequence length, terminal sequence and date and country of isolation. Bunyaviridae sequences and alignments may be downloaded from the second spreadsheet with titles defined by the user from the columns, or viewed when passed directly to the sequence editor, Jalview. Conclusion: VirusBanker allows large datasets of aligned nucleotide andprotein sequences from the Bunyaviridae to be compiled and winnowed rapidly using criteria that are formulated heuristically. © 2008 Fourment and Gibbs; licensee BioMed Central Ltd.",
            "authors": [
                "Fourment M.",
                "Gibbs M.J."
            ],
            "cit_count": 3,
            "journal": "BMC Bioinformatics",
            "pmid": "18251994",
            "title": "The VirusBanker database uses a Java program to allow flexible searching through Bunyaviridae sequences",
            "year": "2008-02-05"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:virusbanker",
        "biotoolsID": "virusbanker",
        "description": "MySQL database of virus sequences and alignments that is accessed via a Java program.",
        "homepage": "http://bioinformatics.org/virusbanker/",
        "name": "Virusbanker"
    }
}