{
    "additionDate": "2019-11-14T19:34:55Z",
    "biotoolsCURIE": "biotools:TPD",
    "biotoolsID": "TPD",
    "confidence_flag": "tool",
    "description": "measuring functional diversity across scales based on TPD with R | Methods for Measuring Functional Diversity Based on Trait Probability Density | Tools to calculate trait probability density functions (TPD) at any scale (e.g. populations, species, communities). TPD functions are used to compute several indices of functional diversity, as well as its partition across scales. These indices constitute a unified framework that incorporates the underlying probabilistic nature of trait distributions into uni- or multidimensional functional trait-based studies. See Carmona et al. (2016) <doi:10.1016/j.tree.2016.02.003> for further information",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://CRAN.R-project.org/package=TPD",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-28T16:47:21Z",
    "license": "GPL-3.0",
    "name": "TPD",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/ECY.2876",
            "metadata": {
                "abstract": "© 2019 by the Ecological Society of AmericaFunctional diversity (FD) has the potential to address many ecological questions, from impacts of global change on biodiversity to ecological restoration. There are several methods estimating the different components of FD. However, most of these methods can only be computed at limited spatial scales and cannot account for intraspecific trait variability (ITV), despite its significant contribution to FD. Trait probability density (TPD) functions (which explicitly account for ITV) reflect the probabilistic nature of niches. By doing so, the TPD approach reconciles existing methods for estimating FD within a unifying framework, allowing FD to be partitioned seamlessly across multiple scales (from individuals to species, and from local to global scales), and accounting for ITV. We present methods to estimate TPD functions at different spatial scales and probabilistic implementations of several FD concepts, including the primary components of FD (functional richness, evenness, and divergence), functional redundancy, functional rarity, and solutions to decompose beta FD into nested and unique components. The TPD framework has the potential to unify and expand analyses of functional ecology across scales, capturing the probabilistic and multidimensional nature of FD. The R package TPD (https://CRAN.R-project.org/package=TPD) will allow users to achieve more comparative results across regions and case studies.",
                "authors": [
                    {
                        "name": "Carmona C.P."
                    },
                    {
                        "name": "de Bello F."
                    },
                    {
                        "name": "Mason N.W.H."
                    },
                    {
                        "name": "Leps J."
                    }
                ],
                "citationCount": 23,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Ecology",
                "title": "Trait probability density (TPD): measuring functional diversity across scales based on TPD with R"
            },
            "pmid": "31471976"
        }
    ],
    "topic": [
        {
            "term": "Biodiversity",
            "uri": "http://edamontology.org/topic_3050"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}