
{
    "credit": [
        {
            "email": "jksander@brandeis.edu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://github.com/johnksander/BreatheEasyEDA/blob/master/documentaton/BEEDA_user_guide.pdf"
        }
    ],
    "download": [
        {
            "type": "Biological data",
            "url": "https://github.com/johnksander/BEEDA_sample_data"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "MATLAB"
        ],
        "license": "GPL-3.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Medicine",
                "uri": "http://edamontology.org/topic_3303"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Electrodermal activity (EDA) recordings are widely used in experimental psychology to measure skin conductance responses (SCRs) that reflect sympathetic nervous system arousal. However, irregular respiration patterns and deep breaths can cause EDA fluctuations that are difficult to distinguish from genuine arousal-related SCRs, presenting a methodological challenge that increases the likelihood of false positives in SCR analyses. Thus, it is crucial to identify respiration-related artifacts in EDA data. Here we developed a novel and freely distributed MATLAB toolbox, Breathe Easy EDA (BEEDA). BEEDA is a flexible toolbox that facilitates EDA visual inspection, allowing users to identify and eliminate respiration artifacts. BEEDA further includes functionality for EDA data analyses (measuring tonic and phasic EDA components) and reliability analyses for artifact identification. The toolbox is suitable for any experiment recording both EDA and respiration data, and flexibly adjusts to experiment-specific parameters (e.g., trial structure and analysis parameters).",
            "authors": [
                "Ksander J.C.",
                "Kark S.M.",
                "Madan C.R."
            ],
            "cit_count": 0,
            "doi": "10.12688/f1000research.13849.1",
            "journal": "F1000Research",
            "title": "Breathe Easy EDA: A MATLAB toolbox for psychophysiology data management, cleaning, and analysis",
            "year": "2018-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:breathe_easy_eda",
        "biotoolsID": "breathe_easy_eda",
        "description": "Easy and reliable identification of respiration-related artifacts in EDA data (data inspection and cleaning).",
        "homepage": "https://github.com/johnksander/BreatheEasyEDA",
        "name": "Breathe Easy EDA"
    }
}