{
    "additionDate": "2019-11-14T18:03:35Z",
    "biotoolsCURIE": "biotools:SOCCOMAS",
    "biotoolsID": "SOCCOMAS",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "lars.vogt@gmail.com",
            "name": "Lars Vogt",
            "orcidid": "https://orcid.org/0000-0002-8280-0487",
            "typeEntity": "Person"
        }
    ],
    "description": "a FAIR web content management system that uses knowledge graphs and that is based on semantic programming | Source code ontology for SOCCOMAS | SOCCOMAS: A FAIR Web Content Management System based on Semantic Programming using the Semantic Programming Ontology | SOCCOMAS (Semantic Ontology-Controlled application for web COntent MAngement Systems) is a semantic web content management system (S-WCMS) that utilizes the Semantic Programming Ontology (SPrO; https: github.com SemanticProgramming SPrO) and a Java Interpreter (https: github.com SemanticProgramming Interpreter) as well as an Interface (https: github.com SemanticProgramming Interface)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "homepage": "https://github.com/SemanticProgramming/SOCCOMAS",
    "language": [
        "JavaScript",
        "Java"
    ],
    "lastUpdate": "2019-11-14T18:03:35Z",
    "license": "LGPL-3.0",
    "name": "SOCCOMAS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAZ067",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.We introduce Semantic Ontology-Controlled application for web Content Management Systems (SOCCOMAS), a development framework for FAIR ('findable', 'accessible', 'interoperable', 'reusable') Semantic Web Content Management Systems (S-WCMSs). Each S-WCMS run by SOCCOMAS has its contents managed through a corresponding knowledge base that stores all data and metadata in the form of semantic knowledge graphs in a Jena tuple store. Automated procedures track provenance, user contributions and detailed change history. Each S-WCMS is accessible via both a graphical user interface (GUI), utilizing the JavaScript framework AngularJS, and a SPARQL endpoint. As a consequence, all data and metadata are maximally findable, accessible, interoperable and reusable and comply with the FAIR Guiding Principles. The source code of SOCCOMAS is written using the Semantic Programming Ontology (SPrO). SPrO consists of commands, attributes and variables, with which one can describe an S-WCMS. We used SPrO to describe all the features and workflows typically required by any S-WCMS and documented these descriptions in a SOCCOMAS source code ontology (SC-Basic). SC-Basic specifies a set of default features, such as provenance tracking and publication life cycle with versioning, which will be available in all S-WCMS run by SOCCOMAS. All features and workflows specific to a particular S-WCMS, however, must be described within an instance source code ontology (INST-SCO), defining, e.g. the function and composition of the GUI, with all its user interactions, the underlying data schemes and representations and all its workflow processes. The combination of descriptions in SC-Basic and a given INST-SCO specify the behavior of an S-WCMS. SOCCOMAS controls this S-WCMS through the Java-based middleware that accompanies SPrO, which functions as an interpreter. Because of the ontology-controlled design, SOCCOMAS allows easy customization with a minimum of technical programming background required, thereby seamlessly integrating conventional web page technologies with semantic web technologies. SOCCOMAS and the Java Interpreter are available from (https://github.com/SemanticProgramming).",
                "authors": [
                    {
                        "name": "Vogt L."
                    },
                    {
                        "name": "Baum R."
                    },
                    {
                        "name": "Bhatty P."
                    },
                    {
                        "name": "Kohler C."
                    },
                    {
                        "name": "Meid S."
                    },
                    {
                        "name": "Quast B."
                    },
                    {
                        "name": "Grobe P."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Database",
                "title": "SOCCOMAS: A FAIR web content management system that uses knowledge graphs and that is based on semantic programming"
            },
            "pmcid": "PMC6686081",
            "pmid": "31392324"
        }
    ],
    "topic": [
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Anatomy",
            "uri": "http://edamontology.org/topic_3067"
        }
    ]
}