{
    "additionDate": "2018-07-03T00:07:39Z",
    "biotoolsCURIE": "biotools:metaboanalyst",
    "biotoolsID": "metaboanalyst",
    "credit": [
        {
            "email": "jeff.xia@mcgill.ca",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Statistical, functional and integrative analysis of metabolomics data , interpretation, and integration with other omics data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.metaboanalyst.ca/faces/docs/Contact.xhtml"
        },
        {
            "type": [
                "General"
            ],
            "url": "http://www.metaboanalyst.ca/faces/docs/Faqs.xhtml"
        },
        {
            "type": [
                "Training material"
            ],
            "url": "http://www.metaboanalyst.ca/faces/docs/Tutorial.xhtml"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://www.metaboanalyst.ca/faces/docs/Resources.xhtml"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "http://www.metaboanalyst.ca",
    "language": [
        "Java",
        "R"
    ],
    "lastUpdate": "2024-11-24T14:57:57.338891Z",
    "license": "GPL-3.0",
    "name": "MetaboAnalyst",
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.1093/nar/gky310",
            "metadata": {
                "abstract": "We present a new update to MetaboAnalyst (version 4.0) for comprehensive metabolomic data analysis, interpretation, and integration with other omics data. Since the last major update in 2015, MetaboAnalyst has continued to evolve based on user feedback and technological advancements in the field. For this year's update, four newkey features have been added to MetaboAnalyst 4.0, including: (1) real-time R command tracking and display coupled with the release of a companion MetaboAnalystR package; (2) a MS Peaks to Pathways module for prediction of pathway activity from untargeted mass spectral data using themummichog algorithm; (3) a Biomarker Metaanalysis module for robust biomarker identification through the combination of multiple metabolomic datasets and (4) a Network Explorer module for integrative analysis of metabolomics, metagenomics, and/or transcriptomics data. The user interface of MetaboAnalyst 4.0 has been reengineered to provide a more modern look and feel, as well as to give more space and flexibility to introduce new functions. The underlying knowledgebases (compound libraries, metabolite sets, and metabolic pathways) have also been updated based on the latest data from the Human Metabolome Database (HMDB). A Docker image of MetaboAnalyst is also available to facilitate download and local installation of Metabo-Analyst.",
                "authors": [
                    {
                        "name": "Bourque G."
                    },
                    {
                        "name": "Caraus I."
                    },
                    {
                        "name": "Chong J."
                    },
                    {
                        "name": "Li C."
                    },
                    {
                        "name": "Li S."
                    },
                    {
                        "name": "Soufan O."
                    },
                    {
                        "name": "Wishart D.S."
                    },
                    {
                        "name": "Xia J."
                    }
                ],
                "citationCount": 2833,
                "date": "2018-07-02T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "MetaboAnalyst 4.0: Towards more transparent and integrative metabolomics analysis"
            },
            "pmcid": "PMC6030889",
            "pmid": "29762782"
        },
        {
            "doi": "10.1038/s41596-022-00710-w",
            "metadata": {
                "abstract": "Liquid chromatography coupled with high-resolution mass spectrometry (LC–HRMS) has become a workhorse in global metabolomics studies with growing applications across biomedical and environmental sciences. However, outstanding bioinformatics challenges in terms of data processing, statistical analysis and functional interpretation remain critical barriers to the wider adoption of this technology. To help the user community overcome these barriers, we have made major updates to the well-established MetaboAnalyst platform (www.metaboanalyst.ca). This protocol extends the previous 2011 Nature Protocol by providing stepwise instructions on how to use MetaboAnalyst 5.0 to: optimize parameters for LC–HRMS spectra processing; obtain functional insights from peak list data; integrate metabolomics data with transcriptomics data or combine multiple metabolomics datasets; conduct exploratory statistical analysis with complex metadata. Parameter optimization may take ~2 h to complete depending on the server load, and the remaining three stages may be executed in ~60 min.",
                "authors": [
                    {
                        "name": "Basu N."
                    },
                    {
                        "name": "Chang L."
                    },
                    {
                        "name": "Ewald J."
                    },
                    {
                        "name": "Hacariz O."
                    },
                    {
                        "name": "Pang Z."
                    },
                    {
                        "name": "Xia J."
                    },
                    {
                        "name": "Zhou G."
                    }
                ],
                "citationCount": 730,
                "date": "2022-08-01T00:00:00Z",
                "journal": "Nature Protocols",
                "title": "Using MetaboAnalyst 5.0 for LC–HRMS spectra processing, multi-omics integration and covariate adjustment of global metabolomics data"
            },
            "pmid": "35715522"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1,
    "version": [
        "4.0",
        "5.0"
    ]
}
