{
    "additionDate": "2017-02-10T11:35:24Z",
    "biotoolsCURIE": "biotools:crp",
    "biotoolsID": "crp",
    "credit": [
        {
            "email": "hayst001@mc.duke.edu",
            "name": "CRP Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Cleaved Radioactivity of Phosphopeptides (CRP) performs in silico proteolytic cleavage of protein sequences and reports the radioactivity that would be observed if a given serine, threonine or tyrosine were phosphorylated.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence cleavage",
                    "uri": "http://edamontology.org/operation_0366"
                }
            ]
        }
    ],
    "homepage": "http://fasta.bioch.virginia.edu/crp/",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "CRP",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "The CRP (Cleavage of Radiolabeled Phosphoproteins) program guides the design and interpretation of experiments to identify protein phosphorylation sites by Edman sequencing of unseparated peptides. Traditionally, phosphorylation sites are determined by cleaving the phosphoprotein and separating the peptides for Edman 32P-phosphate release sequencing. CRP analysis of a phosphoprotein's sequence accelerates this process by omitting the separation step: given a protein sequence of interest, the CRP program performs an in silico, proteolytic cleavage of the sequence and reports the predicted Edman cycles in which radioactivity would be observed if a given serine, threonine or tyrosine were phosphorylated. Experimentally observed cycles containing 32P can be compared with CRP predictions to confirm candidate sites and/or explore the ability of additional cleavage experiments to resolve remaining ambiguities. To reduce ambiguity, the phosphorylated residue (P-Tyr, P-Ser or P-Thr) can be determined experimentally, and CRP will ignore sites with alternative residues. CRP also provides simple predictions of likely phosphorylation sites using known kinase recognition motifs. The CRP interface is available at http://fasta.bioch.virginia.edu/crp.",
                "authors": [
                    {
                        "name": "Mackey A.J."
                    },
                    {
                        "name": "Haystead T.A.J."
                    },
                    {
                        "name": "Pearson W.R."
                    }
                ],
                "citationCount": 12,
                "date": "2003-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "CRP: Cleavage of Radiolabeled Phosphoproteins"
            },
            "pmid": "12824437"
        },
        {
            "metadata": {
                "abstract": "Edman phosphate ((32)P) release sequencing provides a high sensitivity means of identifying phosphorylation sites in proteins that complements mass spectrometry techniques. We have developed a bioinformatic assessment tool, the cleavage of radiolabeled protein (CRP) program, which enables experimental identification of phosphorylation sites via (32)P labeling and Edman degradation of cleaved proteins obtained at femtomole levels. By observing the Edman cycle(s) in which radioactivity is found, candidate phosphorylation sites are identified by determining which residues occur at the observed number of cycles downstream from a peptide cleavage site. In cases where more than one residue could be responsible for the observed radioactivity, additional experiments with cleavage reagents having alternative specificities may resolve the ambiguity. Given a protein sequence and a cleavage site, CRP performs these experiments in silico, identifying resolved sites based on user-supplied experimental data, as well as suggesting combinations of reagents for additional analyses. Analysis of the PhosphoBase protein sequence database suggests that CRP data from two cleavage experiments can be used to identify unambiguously 60% of known phosphorylation sites. Data from additional cleavage experiments may increase the overall coverage to 70% of known sites. By comparing theoretical data obtained from the CRP program with (32)P release data obtained from an Edman sequencer, a known phosphorylation site was identified unambiguously and correctly. In addition, our results show that in vivo phosphorylation sites can be determined routinely by differential proteolysis analysis and Edman cycling with less than 1 fmol of protein and 1000 cpm.",
                "authors": [
                    {
                        "name": "MacDonald J.A."
                    },
                    {
                        "name": "Mackey A.J."
                    },
                    {
                        "name": "Pearson W.R."
                    },
                    {
                        "name": "Haystead T.A."
                    }
                ],
                "citationCount": 43,
                "date": "2002-01-01T00:00:00Z",
                "journal": "Molecular & cellular proteomics : MCP",
                "title": "A strategy for the rapid identification of phosphorylation sites in the phosphoproteome."
            },
            "pmid": "12096113"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        },
        {
            "term": "Protein sites, features and motifs",
            "uri": "http://edamontology.org/topic_3510"
        }
    ],
    "validated": 1
}