{
    "additionDate": "2021-01-25T09:48:52Z",
    "biotoolsCURIE": "biotools:interactome3d",
    "biotoolsID": "interactome3d",
    "description": "Network-centered approaches are increasingly used to understand the fundamentals of biology. However, the molecular details contained in the interaction networks, often necessary to understand cellular processes, are very limited, and the experimental difficulties surrounding the determination of protein complex structures make computational modeling techniques paramount. Interactome3D is a resource for the structural annotation and modeling of protein-protein interactions. Through the integration of interaction data from the main pathway repositories, we provide structural details at atomic resolution for over 12,000 protein-protein interactions in eight model organisms. Unlike static databases, Interactome3D also allows biologists to upload newly discovered interactions and pathways in any species, select the best combination of structural templates and build three-dimensional models in a fully automated manner.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://interactome3d.irbbarcelona.org",
    "lastUpdate": "2021-01-25T09:49:42Z",
    "name": "Interactome3D",
    "owner": "ptck72",
    "publication": [
        {
            "doi": "10.1038/nmeth.2289",
            "metadata": {
                "abstract": "Network-centered approaches are increasingly used to understand the fundamentals of biology. However, the molecular details contained in the interaction networks, often necessary to understand cellular processes, are very limited, and the experimental difficulties surrounding the determination of protein complex structures make computational modeling techniques paramount. Here we present Interactome3D, a resource for the structural annotation and modeling of protein-protein interactions. Through the integration of interaction data from the main pathway repositories, we provide structural details at atomic resolution for over 12,000 protein-protein interactions in eight model organisms. Unlike static databases, Interactome3D also allows biologists to upload newly discovered interactions and pathways in any species, select the best combination of structural templates and build three-dimensional models in a fully automated manner. Finally, we illustrate the value of Interactome3D through the structural annotation of the complement cascade pathway, rationalizing a potential common mechanism of action suggested for several disease-causing mutations. © 2013 Nature America, Inc. All rights reserved.",
                "authors": [
                    {
                        "name": "Aloy P."
                    },
                    {
                        "name": "Ceol A."
                    },
                    {
                        "name": "Mosca R."
                    }
                ],
                "citationCount": 260,
                "date": "2013-01-01T00:00:00Z",
                "journal": "Nature Methods",
                "title": "Interactome3D: Adding structural details to protein networks"
            },
            "pmid": "23399932",
            "type": [
                "Method"
            ]
        }
    ],
    "validated": 1
}
