{
    "additionDate": "2024-02-23T09:50:57.915279Z",
    "biotoolsCURIE": "biotools:genetocn",
    "biotoolsID": "genetocn",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "fanny-dhelia.pajuste@ut.ee",
            "name": "Fanny-Dhelia Pajuste",
            "typeEntity": "Person"
        }
    ],
    "description": "An alignment-free method for gene copy number estimation directly from next-generation sequencing reads.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Copy number estimation",
                    "uri": "http://edamontology.org/operation_3233"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "k-mer counting",
                    "uri": "http://edamontology.org/operation_3472"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bioinfo-ut/GeneToCN",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:13:31.569598Z",
    "license": "GPL-3.0",
    "name": "GeneToCN",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1038/s41598-023-44636-z",
            "metadata": {
                "abstract": "Genomes exhibit large regions with segmental copy number variation, many of which include entire genes and are multiallelic. We have developed a computational method GeneToCN that counts the frequencies of gene-specific k-mers in FASTQ files and uses this information to infer copy number of the gene. We validated the copy number predictions for amylase genes (AMY1, AMY2A, AMY2B) using experimental data from digital droplet PCR (ddPCR) on 39 individuals and observed a strong correlation (R = 0.99) between GeneToCN predictions and experimentally determined copy numbers. An additional validation on FCGR3 genes showed a higher concordance for FCGR3A compared to two other methods, but reduced accuracy for FCGR3B. We further tested the method on three different genomic regions (SMN, NPY4R, and LPA Kringle IV-2 domain). Predicted copy number distributions of these genes in a set of 500 individuals from the Estonian Biobank were in good agreement with the previously published studies. In addition, we investigated the possibility to use GeneToCN on sequencing data generated by different technologies by comparing copy number predictions from Illumina, PacBio, and Oxford Nanopore data of the same sample. Despite the differences in variability of k-mer frequencies, all three sequencing technologies give similar predictions with GeneToCN.",
                "authors": [
                    {
                        "name": "Pajuste F.-D."
                    },
                    {
                        "name": "Remm M."
                    }
                ],
                "date": "2023-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "GeneToCN: an alignment-free method for gene copy number estimation directly from next-generation sequencing reads"
            },
            "pmcid": "PMC10584998",
            "pmid": "37853040"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Biobank",
            "uri": "http://edamontology.org/topic_3337"
        },
        {
            "term": "Copy number variation",
            "uri": "http://edamontology.org/topic_3958"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
