{
    "additionDate": "2021-01-18T07:59:50Z",
    "biotoolsCURIE": "biotools:svmtrip",
    "biotoolsID": "svmtrip",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "czhang5@unl.edu",
            "typeEntity": "Person"
        }
    ],
    "description": "A Method to Predict B-Cell Linear Antigenic Epitopes.\n\na tool to predict linear antigenic epitopes.\n\nRealistic prediction of protein surface regions that are preferentially recognized by antibodies (antigenic epitopes) can help the design of vaccine components and immuno-diagnostic reagents.\n\nBy secreting antibodies against antigens, B-cells play an important role in immune system to fight against the invasive pathogenic organism or substances. Antigenic epitopes are regions of protein surface that are preferentially recognized by B-cell antibodies . Prediction of antigenic epitopes is useful for the investigation to the mechanism in body self-protection systems and help during the design of vaccine components and immuno-diagnostic reagents.\n\nIn this work, we developed a new method to predict antigenic epitope with lastest sequence input from IEDB database.",
    "download": [
        {
            "type": "Downloads page",
            "url": "http://sysbio.unl.edu/SVMTriP/download.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Epitope mapping",
                    "uri": "http://edamontology.org/operation_0416"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                }
            ]
        }
    ],
    "homepage": "http://sysbio.unl.edu/SVMTriP",
    "lastUpdate": "2021-02-24T13:10:00Z",
    "name": "SVMTriP",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1007/978-1-0716-0389-5_17",
            "metadata": {
                "abstract": "© Springer Science+Business Media, LLC, part of Springer Nature 2020.Identifying protein antigenic epitopes recognizable by antibodies is the key step for new immuno-diagnostic reagent discovery and vaccine design. To facilitate this process and improve its efficiency, computational methods were developed to predict antigenic epitopes. For the linear B-cell epitope prediction, many methods were developed, including BepiPred, ABCPred, AAP, BCPred, BayesB, BEOracle/BROracle, BEST, and SVMTriP. Among these methods, SVMTriP, a frontrunner, utilized Support Vector Machine by combining the tri-peptide similarity and Propensity scores. Applied on non-redundant B-cell linear epitopes extracted from IEDB, SVMTriP achieved a sensitivity of 80.1% and a precision of 55.2% with a five-fold cross-validation. The AUC value was 0.702. The combination of similarity and propensity of tri-peptide subsequences can improve the prediction performance for linear B-cell epitopes. A webserver based on this method was constructed for public use. The server and all datasets used in the corresponding study are available at http://sysbio.unl.edu/SVMTriP. This chapter describes the webserver of SVMTriP.",
                "authors": [
                    {
                        "name": "Yao B."
                    },
                    {
                        "name": "Zheng D."
                    },
                    {
                        "name": "Liang S."
                    },
                    {
                        "name": "Zhang C."
                    }
                ],
                "citationCount": 2,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Methods in Molecular Biology",
                "title": "SVMTriP: A method to predict B-Cell linear antigenic epitopes"
            },
            "pmid": "32162263"
        }
    ],
    "topic": [
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Protein structural motifs and surfaces",
            "uri": "http://edamontology.org/topic_0166"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ]
}