{
    "accessibility": "Open access",
    "additionDate": "2023-02-10T12:28:32.499446Z",
    "biotoolsCURIE": "biotools:visiomode",
    "biotoolsID": "visiomode",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Constantinos Eleftheriou"
        },
        {
            "name": "Ian Duguid"
        },
        {
            "name": "Marie Zechner"
        },
        {
            "name": "Thomas Clarke"
        },
        {
            "name": "V. Poon"
        }
    ],
    "description": "An open-source platform for building rodent touchscreen-based behavioral assays.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://www.visiomode.org",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-02-10T12:28:32.502155Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/DuguidLab/visiomode"
        }
    ],
    "name": "Visiomode",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/j.jneumeth.2022.109779",
            "metadata": {
                "abstract": "© 2023 The AuthorsBackground: Touchscreen-based behavioral assays provide a robust method for assessing cognitive behavior in rodents, offering great flexibility and translational potential. The development of touchscreen assays presents a significant programming and mechanical engineering challenge, where commercial solutions can be prohibitively expensive and open-source solutions are underdeveloped, with limited adaptability. New method: Here, we present Visiomode (www.visiomode.org), an open-source platform for building rodent touchscreen-based behavioral tasks. Visiomode leverages the inherent flexibility of touchscreens to offer a simple yet adaptable software and hardware platform. The platform is built on the Raspberry Pi computer combining a web-based interface and powerful plug-in system with an operant chamber that can be adapted to generate a wide range of behavioral tasks. Results: As a proof of concept, we use Visiomode to build both simple stimulus-response and more complex visual discrimination tasks, showing that mice display rapid sensorimotor learning including switching between different motor responses (i.e., nose poke versus reaching). Comparison with existing methods: Commercial solutions are the ‘go to’ for rodent touchscreen behaviors, but the associated costs can be prohibitive, limiting their uptake by the wider neuroscience community. While several open-source solutions have been developed, efforts so far have focused on reducing the cost, rather than promoting ease of use and adaptability. Visiomode addresses these unmet needs providing a low-cost, extensible platform for creating touchscreen tasks. Conclusions: Developing an open-source, rapidly scalable and low-cost platform for building touchscreen-based behavioral assays should increase uptake across the science community and accelerate the investigation of cognition, decision-making and sensorimotor behaviors both in health and disease.",
                "authors": [
                    {
                        "name": "Clarke T."
                    },
                    {
                        "name": "Duguid I."
                    },
                    {
                        "name": "Eleftheriou C."
                    },
                    {
                        "name": "Poon V."
                    },
                    {
                        "name": "Zechner M."
                    }
                ],
                "date": "2023-02-15T00:00:00Z",
                "journal": "Journal of Neuroscience Methods",
                "title": "Visiomode: An open-source platform for building rodent touchscreen-based behavioral assays"
            },
            "pmid": "36621552"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
