{
    "accessibility": "Open access",
    "additionDate": "2023-01-26T02:30:32.166112Z",
    "biotoolsCURIE": "biotools:scehr",
    "biotoolsID": "scehr",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Chengxi Zang"
        },
        {
            "name": "Fei Wang"
        }
    ],
    "description": "Supervised Contrastive Learning for Clinical Risk Prediction using Electronic Health Records.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/calvin-zcx/SCEHR",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-01-26T02:30:32.169216Z",
    "license": "Not licensed",
    "name": "SCEHR",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1109/ICDM51629.2021.00097",
            "metadata": {
                "abstract": "© 2021 IEEE.Contrastive learning has demonstrated promising performance in image and text domains either in a self-supervised or a supervised manner. In this work, we extend the supervised contrastive learning framework to clinical risk prediction problems based on longitudinal electronic health records (EHR). We propose a general supervised contrastive loss {L}Contrastive Cross Entropy+\\lambda {L}Supervised Contrastive Regularizer for learning both binary classification (e.g. in-hospital mortality prediction) and multi-label classification (e.g. phenotyping) in a unified framework. Our supervised contrastive loss practices the key idea of contrastive learning, namely, pulling similar samples closer and pushing dissimilar ones apart from each other, simultaneously by its two components: {L}Contrastive Cross Entropy tries to contrast samples with learned anchors which represent positive and negative clusters, and {L}Supervised Contrastive Regularizer tries to contrast samples with each other according to their supervised labels. We propose two versions of the above supervised contrastive loss and our experiments on real-world EHR data demonstrate that our proposed loss functions show benefits in improving the performance of strong baselines and even state-of-the-art models on benchmarking tasks for clinical risk predictions. Our loss functions work well with extremely imbalanced data which are common for clinical risk prediction problems. Our loss functions can be easily used to replace (binary or multi-label) cross-entropy loss adopted in existing clinical predictive models. The Pytorch code is released at https://github.com/calvin-zcx/SCEHR.",
                "authors": [
                    {
                        "name": "Wang F."
                    },
                    {
                        "name": "Zang C."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Proceedings - IEEE International Conference on Data Mining, ICDM",
                "title": "SCEHR: Supervised Contrastive Learning for Clinical Risk Prediction using Electronic Health Records"
            },
            "pmcid": "PMC9692209",
            "pmid": "36438203"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}
