{
    "additionDate": "2017-01-17T15:03:27Z",
    "biotoolsCURIE": "biotools:pcagopromoter",
    "biotoolsID": "pcagopromoter",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "mhansen@sund.ku.dk",
            "name": "Morten Hansen",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "This package contains functions to ease the analyses of DNA micro arrays. It utilizes principal component analysis as the initial multivariate analysis, followed by functional interpretation of the principal component dimensions with overrepresentation analysis for GO terms and regulatory interpretations using overrepresentation analysis of predicted transcription factor binding sites with the primo algorithm.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/pcaGoPromoter.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/pcaGoPromoter_1.18.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/pcaGoPromoter.html",
    "language": [
        "R",
        "C++"
    ],
    "lastUpdate": "2018-12-30T16:50:20Z",
    "license": "GPL-2.0",
    "name": "pcaGoPromoter",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0032394",
            "metadata": {
                "abstract": "Analyzing data obtained from genome-wide gene expression experiments is challenging due to the quantity of variables, the need for multivariate analyses, and the demands of managing large amounts of data. Here we present the R package pcaGoPromoter, which facilitates the interpretation of genome-wide expression data and overcomes the aforementioned problems. In the first step, principal component analysis (PCA) is applied to survey any differences between experiments and possible groupings. The next step is the interpretation of the principal components with respect to both biological function and regulation by predicted transcription factor binding sites. The robustness of the results is evaluated using cross-validation, and illustrative plots of PCA scores and gene ontology terms are available. pcaGoPromoter works with any platform that uses gene symbols or Entrez IDs as probe identifiers. In addition, support for several popular Affymetrix GeneChip platforms is provided. To illustrate the features of the pcaGoPromoter package a serum stimulation experiment was performed and the genome-wide gene expression in the resulting samples was profiled using the Affymetrix Human Genome U133 Plus 2.0 chip. Array data were analyzed using pcaGoPromoter package tools, resulting in a clear separation of the experiments into three groups: controls, serum only and serum with inhibitor. Functional annotation of the axes in the PCA score plot showed the expected serum-promoted biological processes, e.g., cell cycle progression and the predicted involvement of expected transcription factors, including E2F. In addition, unexpected results, e.g., cholesterol synthesis in serum-depleted cells and NF-κB activation in inhibitor treated cells, were noted. In summary, the pcaGoPromoter R package provides a collection of tools for analyzing gene expression data. These tools give an overview of the input data via PCA, functional interpretation by gene ontology terms (biological processes), and an indication of the involvement of possible transcription factors. © 2012 Hansen et al.",
                "authors": [
                    {
                        "name": "Hansen M."
                    },
                    {
                        "name": "Gerds T.A."
                    },
                    {
                        "name": "Nielsen O.H."
                    },
                    {
                        "name": "Seidelin J.B."
                    },
                    {
                        "name": "Troelsen J.T."
                    },
                    {
                        "name": "Olsen J."
                    }
                ],
                "citationCount": 16,
                "date": "2012-02-27T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "PcaGoPromoter - An R package for biological and regulatory interpretation of principal components in genome-wide gene expression data"
            },
            "pmcid": "PMC3288097",
            "pmid": "22384239",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "DNA binding sites",
            "uri": "http://edamontology.org/topic_3125"
        }
    ],
    "validated": 1,
    "version": [
        "1.18.0"
    ]
}