{
    "additionDate": "2020-01-14T19:29:41Z",
    "biotoolsCURIE": "biotools:GOT-10k",
    "biotoolsID": "GOT-10k",
    "confidence_flag": "tool",
    "description": "A Large High-Diversity Benchmark for Generic Object Tracking in the Wild.\n\nGeneric Object Tracking Benchmark.\n\nA large, high-diversity, one-shot database for generic object tracking in the wild",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "homepage": "http://got-10k.aitestunion.com",
    "lastUpdate": "2020-12-03T12:22:11Z",
    "name": "GOT-10k",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1109/TPAMI.2019.2957464",
            "metadata": {
                "abstract": "© 1979-2012 IEEE.We introduce here a large tracking database that offers an unprecedentedly wide coverage of common moving objects in the wild, called GOT-10k. Specifically, GOT-10k is built upon the backbone of WordNet structure [1] and it populates the majority of over 560 classes of moving objects and 87 motion patterns, magnitudes wider than the most recent similar-scale counterparts [19], [20], [23], [26]. By releasing the large high-diversity database, we aim to provide a unified training and evaluation platform for the development of class-agnostic, generic purposed short-term trackers. The features of GOT-10k and the contributions of this article are summarized in the following. (1) GOT-10k offers over 10,000 video segments with more than 1.5 million manually labeled bounding boxes, enabling unified training and stable evaluation of deep trackers. (2) GOT-10k is by far the first video trajectory dataset that uses the semantic hierarchy of WordNet to guide class population, which ensures a comprehensive and relatively unbiased coverage of diverse moving objects. (3) For the first time, GOT-10k introduces the one-shot protocol for tracker evaluation, where the training and test classes are zero-overlapped. The protocol avoids biased evaluation results towards familiar objects and it promotes generalization in tracker development. (4) GOT-10k offers additional labels such as motion classes and object visible ratios, facilitating the development of motion-aware and occlusion-aware trackers. (5) We conduct extensive tracking experiments with 39 typical tracking algorithms and their variants on GOT-10k and analyze their results in this paper. (6) Finally, we develop a comprehensive platform for the tracking community that offers full-featured evaluation toolkits, an online evaluation server, and a responsive leaderboard. The annotations of GOT-10k's test data are kept private to avoid tuning parameters on it.",
                "authors": [
                    {
                        "name": "Huang L."
                    },
                    {
                        "name": "Zhao X."
                    },
                    {
                        "name": "Huang K."
                    }
                ],
                "citationCount": 37,
                "date": "2021-05-01T00:00:00Z",
                "journal": "IEEE Transactions on Pattern Analysis and Machine Intelligence",
                "title": "Got-10k: A large high-diversity benchmark for generic object tracking in the wild"
            },
            "pmid": "31804928"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}