{
    "name": "GRISOTTO", 
    "description": "GRISOTTO, uncovers motifs using prior information from a set of co-regulated DNA sequences.", 
    "homepage": "http://www.lx.it.pt/~asmc/software/grisotto.html", 
    "biotoolsID": "grisotto", 
    "biotoolsCURIE": "biotools:grisotto", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0238", 
                    "term": "Motif discovery"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0080", 
            "term": "Sequences"
        }, 
        {
            "uri": "http://edamontology.org/topic_0654", 
            "term": "DNA"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "Java"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/grisotto-motif-discovery-tool.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://www.lx.it.pt/~asmc/software/grisotto.html#FurtherInformation", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1186/1748-7188-6-13", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "GRISOTTO: A greedy approach to improve combinatorial algorithms for motif discovery with prior knowledge", 
                "abstract": "Background: Position-specific priors (PSP) have been used with success to boost EM and Gibbs sampler-based motif discovery algorithms. PSP information has been computed from different sources, including orthologous conservation, DNA duplex stability, and nucleosome positioning. The use of prior information has not yet been used in the context of combinatorial algorithms. Moreover, priors have been used only independently, and the gain of combining priors from different sources has not yet been studied.Results: We extend RISOTTO, a combinatorial algorithm for motif discovery, by post-processing its output with a greedy procedure that uses prior information. PSP's from different sources are combined into a scoring criterion that guides the greedy search procedure. The resulting method, called GRISOTTO, was evaluated over 156 yeast TF ChIP-chip sequence-sets commonly used to benchmark prior-based motif discovery algorithms. Results show that GRISOTTO is at least as accurate as other twelve state-of-the-art approaches for the same task, even without combining priors. Furthermore, by considering combined priors, GRISOTTO is considerably more accurate than the state-of-the-art approaches for the same task. We also show that PSP's improve GRISOTTO ability to retrieve motifs from mouse ChiP-seq data, indicating that the proposed algorithm can be applied to data from a different technology and for a higher eukaryote.Conclusions: The conclusions of this work are twofold. First, post-processing the output of combinatorial algorithms by incorporating prior information leads to a very efficient and effective motif discovery method. Second, combining priors from different sources is even more beneficial than considering them separately. © 2011 Carvalho and Oliveira; licensee BioMed Central Ltd.", 
                "date": "2011-04-22T00:00:00Z", 
                "citationCount": 2, 
                "authors": [
                    {
                        "name": "Carvalho A.M."
                    }, 
                    {
                        "name": "Oliveira A.L."
                    }
                ], 
                "journal": "Algorithms for Molecular Biology"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": null, 
            "url": "http://www.lx.it.pt/~asmc/index.html", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-12-18T00:06:56Z", 
    "lastUpdate": "2018-12-10T12:58:57Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}