{
    "additionDate": "2017-08-03T19:08:42Z",
    "biotoolsCURIE": "biotools:weighted_fdr",
    "biotoolsID": "weighted_fdr",
    "credit": [
        {
            "email": "kleil@upmc.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://wpicr.wpic.pitt.edu/WPICCompGen/"
        }
    ],
    "description": "Software to Apply Weighted False Discovery Rate for Multiple Testing. When testing a large number of hypotheses, such as an association genome scan, the power to detect modest effects can be low, due to the penalty for multiple testing.  This is especially true when traditional approaches such as the Bonferroni correction are employed.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://wpicr.wpic.pitt.edu/WPICCompGen/fdr/Instructions.htm"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "http://wpicr.wpic.pitt.edu/WPICCompGen/fdr/",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:49Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/weighted_fdr-1-2-apply-weighted-false-discovery-rate-multiple-testing.html"
        }
    ],
    "name": "weighted_FDR",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Scanning the genome for association between markers and complex diseases typically requires testing hundreds of thousands of genetic polymorphisms. Testing such a large number of hypotheses exacerbates the trade-off between power to detect meaningful associations and the chance of making false discoveries. Even before the full genome is scanned, investigators often favor certain regions on the basis of the results of prior investigations, such as previous linkage scans. The remaining regions of the genome are investigated simultaneously because genotyping is relatively inexpensive compared with the cost of recruiting participants for a genetic study and because prior evidence is rarely sufficient to rule out these regions as harboring genes with variation of conferring liability (liability genes). However, the multiple testing inherent in broad genomic searches diminishes power to detect association, even for genes falling in regions of the genome favored a priori. Multiple testing problems of this nature are well suited for application of the false-discovery rate (FDR) principle, which can improve power. To enhance power further, a new FDR approach is proposed that involves weighting the hypotheses on the basis of prior data. We present a method for using linkage data to weight the association P values. Our investigations reveal that if the linkage study is informative, the procedure improves power considerably. Remarkably, the loss in power is small, even when the linkage study is uninformative. For a class of genetic models, we calculate the sample size required to obtain useful prior information from a linkage study. This inquiry reveals that, among genetic models that are seemingly equal in genetic information, some are much more promising than others for this mode of analysis. © 2006 by The American Society of Human Genetics. All rights reserved.",
                "authors": [
                    {
                        "name": "Roeder K."
                    },
                    {
                        "name": "Bacanu S.-A."
                    },
                    {
                        "name": "Wasserman L."
                    },
                    {
                        "name": "Devlin B."
                    }
                ],
                "citationCount": 158,
                "date": "2006-01-01T00:00:00Z",
                "journal": "American Journal of Human Genetics",
                "title": "Using linkage genome scans to improve power of association in genome scans"
            },
            "pmid": "16400608"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}