
{
    "credit": [
        {
            "email": "klaholz@igbmc.fr",
            "name": "Bruno P. Klaholz",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://ibiss.igbmc.fr/doc/Manual_IBiSS_V1.00.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence alignment analysis (conservation)",
                    "uri": "http://edamontology.org/operation_0448"
                }
            ]
        }
    ],
    "labels": {
        "accessibility": [
            "Open access"
        ],
        "cost": "Free of charge",
        "language": [
            "JavaScript"
        ],
        "license": "Unlicense",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Electron microscopy",
                "uri": "http://edamontology.org/topic_0611"
            },
            {
                "term": "X-ray diffraction",
                "uri": "http://edamontology.org/topic_2828"
            },
            {
                "term": "Small molecules",
                "uri": "http://edamontology.org/topic_0154"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2015 The Author.Motivation: In the past few years, an increasing number of crystal and cryo electron microscopy (cryo-EM) structures of large macromolecular complexes, such as the ribosome or the RNA polymerase, have become available from various species. These multi-subunit complexes can be difficult to analyze at the level of amino acid sequence in combination with the 3D structural organization of the complex. Therefore, novel tools for simultaneous analysis of structure and sequence information of complex assemblies are required to better understand the basis of molecular mechanisms and their functional implications. Results: Here, we present a web-based tool, Integrative Biology of Sequences and Structures (IBiSS), which is designed for interactively displaying 3D structures and selected sequences of subunits from large macromolecular complexes thus allowing simultaneous structure-sequence analysis such as conserved residues involved in catalysis or protein-protein interfaces. This tool comprises a Graphic User Interface and uses a rapid-access internal database, containing the relevant pre-aligned multiple sequences across all species available and 3D structural information. These annotations are automatically retrieved and updated from UniProt and crystallographic and cryo-EM data available in the Protein Data Bank (PDB) and Electron Microscopy Data Bank (EMDB). Availability and implementation: The database contains all currently available structures of ribosomes, RNA polymerases, nucleosomes, proteasome, photosystem I and II complexes. IBiSS is available at http://ibiss.igbmc.fr Contact:",
            "authors": [
                "Beinsteiner B.",
                "Michalon J.",
                "Klaholz B.P."
            ],
            "cit_count": 3,
            "doi": "10.1093/bioinformatics/btv347",
            "journal": "Bioinformatics",
            "title": "IBiSS, a versatile and interactive tool for integrated sequence and 3D structure analysis of large macromolecular complexes",
            "type": "Primary",
            "year": "2015-03-25"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:IBiSS",
        "biotoolsID": "IBiSS",
        "description": "Tool for integrated sequence and 3D structure analysis of large macromolecular complexes.",
        "homepage": "http://ibiss.igbmc.fr/",
        "name": "IBiSS"
    }
}