{
    "additionDate": "2019-11-14T19:36:02Z",
    "biotoolsCURIE": "biotools:InferAMP",
    "biotoolsID": "InferAMP",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "pakenny@gundersenhealth.org",
            "name": "Paraic A. Kenny",
            "orcidid": "https://orcid.org/0000-0002-5434-4402",
            "typeEntity": "Person"
        }
    ],
    "description": "Python web app for copy number inference from discrete gene-level amplification signals noted in clinical tumor profiling reports | Genome scale copy number inference from discrete reports of gene-level amplifications on somatic cancer NGS testing reports | InferAMP - inferring genome-wide amplicon boundaries from cancer NGS reports | Optimized for Foundation One reports from Foundation Medicine | A working version of the web implementation is at http://inferamp.org",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://inferamp.org",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-14T09:54:35Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/paraickenny/inferAMP"
        }
    ],
    "name": "InferAMP",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.12688/F1000RESEARCH.19541.3",
            "metadata": {
                "abstract": "© 2019 Kenny PA.As somatic next-generation sequencing gene panel analysis in advanced cancer patients is becoming more routine, oncologists are frequently presented with reports containing lists of genes with increased copy number. Distinguishing which of these amplified genes, if any, might be driving tumor growth and might thus be worth considering targeting can be challenging. One particular issue is the frequent absence of genomic contextual information in clinical reports, making it very challenging to determine which reported genes might be co-amplified and how large any such amplicons might be. We describe a straightforward Python web app, InferAMP, into which healthcare professionals may enter lists of amplified genes from clinical reports. The tool reports (1) the likely size of amplified genomic regions, (2) which reported genes are co-amplified and (3) which other cancer-relevant genes that were not evaluated in the assay may also be co-amplified in the specimen. The tool is accessible for web queries at http://inferamp.org.",
                "authors": [
                    {
                        "name": "Kenny P.A."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "F1000Research",
                "title": "InferAMP, a python web app for copy number inference from discrete gene-level amplification signals noted in clinical tumor profiling reports"
            },
            "pmcid": "PMC6777010",
            "pmid": "31608148"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        }
    ],
    "validated": 1
}