{"credit":[{"email":"msc51@cam.ac.uk","name":"Nicole Cheung","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"tad26@cam.ac.uk","name":"Thomas Down","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"ja219@cam.ac.uk","name":"Julie Ahringer","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://beads.sourceforge.net/manual.php"}],"function":[{"operation":[{"term":"Standardisation and normalisation","uri":"http://edamontology.org/operation_3435"}]}],"labels":{"language":["Python"],"operatingSystem":["Linux","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"ChIP-seq","uri":"http://edamontology.org/topic_3169"}]},"publication":[{"abstract":"Genomic sequences obtained through highthroughput sequencing are not uniformly distributed across the genome. For example, sequencing data of total genomic DNA show significant, yet unexpected enrichments on promoters and exons. This systematic bias is a particular problem for techniques such as chromatin immunoprecipitation, where the signal for a target factor is plotted across genomic features. We have focused on data obtained from Illumina's Genome Analyser platform, where at least three factors contribute to sequence bias: GC content, mappability of sequencing reads, and regional biases that might be generated by local structure. We show that relying on input control as a normalizer is not generally appropriate due to sample to sample variation in bias. To correct sequence bias, we present BEADS (bias elimination algorithm for deep sequencing), a simple three-step normalization scheme that successfully unmasks real binding patterns in ChIP-seq data. We suggest that this procedure be done routinely prior to data interpretation and downstream analyses. © 2011 The Author(s).","authors":["Cheung M.-S.","Down T.A.","Latorre I.","Ahringer J."],"cit_count":84,"journal":"Nucleic Acids Research","pmid":"21646344","title":"Systematic bias in high-throughput sequencing data and its correction by BEADS","year":"2011-08-01"}],"summary":{"biotoolsCURIE":"biotools:beads","biotoolsID":"beads","description":"ChIP-seq data normalization for Illumina","homepage":"http://beads.sourceforge.net/","name":"BEADS"}}