{
    "additionDate": "2019-11-14T19:45:10Z",
    "biotoolsCURIE": "biotools:CREAM",
    "biotoolsID": "CREAM",
    "confidence_flag": "tool",
    "description": "Identifying clusters of cis-regulatory elements underpinning TAD structures and lineage-specific regulatory networks | Clustering of Genomic Regions Analysis Method | Provides a new method for identification of clusters of genomic regions within chromosomes. Primarily, it is used for calling clusters of cis-regulatory elements (COREs). 'CREAM' uses genome-wide maps of genomic regions in the tissue or cell type of interest, such as those generated from chromatin-based assays including DNaseI, ATAC or ChIP-Seq. 'CREAM' considers proximity of the elements within chromosomes of a given sample to identify COREs in the following steps: 1) It identifies window size or the maximum allowed distance between the elements within each CORE, 2) It identifies number of elements which should be clustered as a CORE, 3) It calls COREs, 4) It filters the COREs with lowest order which does not pass the threshold considered in the approach",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "cis-regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0441"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/CREAM/index.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-16T19:12:51Z",
    "license": "GPL-3.0",
    "name": "CREAM",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/GR.248658.119",
            "metadata": {
                "abstract": "© 2019 Madani Tonekaboni et al.Cellular identity relies on cell-type-specific gene expression controlled at the transcriptional level by cis-regulatory elements (CREs). CREs are unevenly distributed across the genome, giving rise to individual CREs and clusters of CREs (COREs). Technical and biological features hinder CORE identification. We addressed these issues by developing an unsupervised machine learning approach termed clustering of genomic regions analysis method (CREAM). CREAM automates CORE detection from chromatin accessibility profiles that are enriched in CREs strongly bound by master transcription regulators, proximal to highly expressed and essential genes, and discriminating cell identity. Although COREs share similarities with super-enhancers, we highlight differences in terms of the genomic distribution and structure of these cis-regulatory units. We further show the enhanced value of COREs over super-enhancers to identify master transcription regulators, highly expressed and essential genes defining cell identity. COREs enrich at topologically associated domain (TAD) boundaries. They are also preferentially bound by the chromatin looping factors CTCF and cohesin, in contrast to super-enhancers, forming clusters of CTCF and cohesin binding regions and defining homotypic clusters of transcription regulator binding regions (HCTs). Finally, we show the clinical utility of CREAM to identify COREs across chromatin accessibility profiles to stratify more than 400 tumor samples according to their cancer type and to delineate cancer type-specific active biological pathways. Collectively, our results support the utility of CREAM to delineate COREs underlying, with greater accuracy than individual CREs or super-enhancers, the cell-type-specific biological underpinning across a wide range of normal and cancer cell types.",
                "authors": [
                    {
                        "name": "Tonekaboni S.A.M."
                    },
                    {
                        "name": "Mazrooei P."
                    },
                    {
                        "name": "Kofia V."
                    },
                    {
                        "name": "Haibe-Kains B."
                    },
                    {
                        "name": "Lupien M."
                    }
                ],
                "citationCount": 6,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "Identifying clusters of cis-regulatory elements underpinning TAD structures and lineage-specific regulatory networks"
            },
            "pmcid": "PMC6771399",
            "pmid": "31533978"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}