{
    "additionDate": "2019-11-14T18:18:40Z",
    "biotoolsCURIE": "biotools:ACCOST",
    "biotoolsID": "ACCOST",
    "confidence_flag": "tool",
    "description": "Measuring significant changes in chromatin conformation with ACCOST | Abstract Chromatin conformation assays such as Hi-C cannot directly measure differences in 3D architecture between cell types or cell states. For this purpose, two or more Hi-C experiments must be carried out, but direct comparison of the resulting Hi-C matrices is confounded by several features of Hi-C data. Most notably, the genomic distance effect, whereby contacts between pairs of genomic loci that are proximal along the chromosome exhibit many more Hi-C contacts that distal pairs of loci, dominates every Hi-C matrix. Furthermore, the form that this distance effect takes often varies between different Hi-C experiments, even between replicate experiments. Thus, a statistical confidence measure designed to identify differential Hi-C contacts must accurately account for the genomic distance effect or risk being misled by large-scale but artifactual differences",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://bitbucket.org/noblelab/accost",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-01T14:07:28.915842Z",
    "license": "Apache-2.0",
    "name": "ACCOST",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/nar/gkaa069",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.Chromatin conformation assays such as Hi-C cannot directly measure differences in 3D architecture between cell types or cell states. For this purpose, two or more Hi-C experiments must be carried out, but direct comparison of the resulting Hi-C matrices is confounded by several features of Hi-C data. Most notably, the genomic distance effect, whereby contacts between pairs of genomic loci that are proximal along the chromosome exhibit many more Hi-C contacts that distal pairs of loci, dominates every Hi-C matrix. Furthermore, the form that this distance effect takes often varies between different Hi-C experiments, even between replicate experiments. Thus, a statistical confidence measure designed to identify differential Hi-C contacts must accurately account for the genomic distance effect or risk being misled by large-scale but artifactual differences. ACCOST (Altered Chromatin COnformation STatistics) accomplishes this goal by extending the statistical model employed by DEseq, re-purposing the 'size factors,' which were originally developed to account for differences in read depth between samples, to instead model the genomic distance effect. We show via analysis of simulated and real data that ACCOST provides unbiased statistical confidence estimates that compare favorably with competing methods such as diffHiC, FIND and HiCcompare. ACCOST is freely available with an Apache license at https://bitbucket.org/noblelab/accost.",
                "authors": [
                    {
                        "name": "Cook K.B."
                    },
                    {
                        "name": "Hristov B.H."
                    },
                    {
                        "name": "Le Roch K.G."
                    },
                    {
                        "name": "Vert J.P."
                    },
                    {
                        "name": "Noble W.S."
                    }
                ],
                "citationCount": 1,
                "date": "2020-03-18T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Measuring significant changes in chromatin conformation with ACCOST"
            }
        }
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        }
    ]
}