{
    "additionDate": "2019-11-14T20:04:03Z",
    "biotoolsCURIE": "biotools:comet-cell",
    "biotoolsID": "comet-cell",
    "confidence_flag": "tool",
    "description": "A toolkit for composing customizable genetic programs in mammalian cells | ABSTRACT Engineering mammalian cells to carry out sophisticated and customizable genetic programs requires a toolkit of multiple orthogonal and well-characterized transcription factors (TFs). To address this need, we developed the COmposable Mammalian Elements of Transcription (COMET) an ensemble of TFs and promoters that enable the design and tuning of gene expression to an extent not previously possible. COMET currently comprises 44 activating and 12 inhibitory zinc-finger TFs and 83 cognate promoters, combined in a framework that readily accommodates new parts. This system can tune gene expression over three orders of magnitude, provides chemically inducible control of TF activity, and enables single-layer Boolean logic",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Nucleic acids-binding site prediction",
                    "uri": "http://edamontology.org/operation_0420"
                }
            ]
        }
    ],
    "homepage": "https://github.com/leonardlab/COMET",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2020-12-16T16:49:06Z",
    "license": "MIT",
    "name": "COMET",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1101/769794"
        },
        {
            "doi": "10.1038/s41467-019-14147-5",
            "metadata": {
                "abstract": "© 2020, The Author(s).Engineering mammalian cells to carry out sophisticated and customizable genetic programs requires a toolkit of multiple orthogonal and well-characterized transcription factors (TFs). To address this need, we develop the COmposable Mammalian Elements of Transcription (COMET)—an ensemble of TFs and promoters that enable the design and tuning of gene expression to an extent not, to the best of our knowledge, previously possible. COMET currently comprises 44 activating and 12 inhibitory zinc-finger TFs and 83 cognate promoters, combined in a framework that readily accommodates new parts. This system can tune gene expression over three orders of magnitude, provides chemically inducible control of TF activity, and enables single-layer Boolean logic. We also develop a mathematical model that provides mechanistic insights into COMET performance characteristics. Altogether, COMET enables the design and construction of customizable genetic programs in mammalian cells.",
                "authors": [
                    {
                        "name": "Donahue P.S."
                    },
                    {
                        "name": "Draut J.W."
                    },
                    {
                        "name": "Muldoon J.J."
                    },
                    {
                        "name": "Edelstein H.I."
                    },
                    {
                        "name": "Bagheri N."
                    },
                    {
                        "name": "Leonard J.N."
                    }
                ],
                "citationCount": 11,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Nature Communications",
                "title": "The COMET toolkit for composing customizable genetic programs in mammalian cells"
            },
            "pmcid": "PMC7005830",
            "pmid": "32034124"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        }
    ],
    "validated": 1
}