{
    "additionDate": "2021-03-19T08:30:26Z",
    "biotoolsCURIE": "biotools:phenotagger",
    "biotoolsID": "phenotagger",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhiyong.lu@nih.gov",
            "name": "Zhiyong Lu",
            "typeEntity": "Person"
        }
    ],
    "description": "A Hybrid Method for Phenotype Concept Recognition using Human Phenotype Ontology.\n\nPhenoTagger is a hybrid method that combines dictionary and deep learning-based methods to recognize Human Phenotype Ontology (HPO) concepts in unstructured biomedical text. It is an ontology-driven method without requiring any manually labeled training data, as that is expensive and annotating a large-scale training dataset covering all classes of HPO concepts is highly challenging and unrealistic.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Named-entity and concept recognition",
                    "uri": "http://edamontology.org/operation_3280"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                },
                {
                    "term": "Text annotation",
                    "uri": "http://edamontology.org/operation_3778"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ncbi-nlp/PhenoTagger",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T20:38:18.188555Z",
    "name": "PhenoTagger",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btab019",
            "metadata": {
                "abstract": "Motivation: Automatic phenotype concept recognition from unstructured text remains a challenging task in biomedical text mining research. Previous works that address the task typically use dictionary-based matching methods, which can achieve high precision but suffer from lower recall. Recently, machine learning-based methods have been proposed to identify biomedical concepts, which can recognize more unseen concept synonyms by automatic feature learning. However, most methods require large corpora of manually annotated data for model training, which is difficult to obtain due to the high cost of human annotation. Results: In this article, we propose PhenoTagger, a hybrid method that combines both dictionary and machine learning-based methods to recognize Human Phenotype Ontology (HPO) concepts in unstructured biomedical text. We first use all concepts and synonyms in HPO to construct a dictionary, which is then used to automatically build a distantly supervised training dataset for machine learning. Next, a cutting-edge deep learning model is trained to classify each candidate phrase (n-gram from input sentence) into a corresponding concept label. Finally, the dictionary and machine learning-based prediction results are combined for improved performance. Our method is validated with two HPO corpora, and the results show that PhenoTagger compares favorably to previous methods. In addition, to demonstrate the generalizability of our method, we retrained PhenoTagger using the disease ontology MEDIC for disease concept recognition to investigate the effect of training on different ontologies. Experimental results on the NCBI disease corpus show that PhenoTagger without requiring manually annotated training data achieves competitive performance as compared with state-of-the-art supervised methods. Availabilityand implementation: The source code, API information and data for PhenoTagger are freely available at https://github.com/ncbi-nlp/PhenoTagger.",
                "authors": [
                    {
                        "name": "Ghosh R."
                    },
                    {
                        "name": "Lai P.-T."
                    },
                    {
                        "name": "Lu Z."
                    },
                    {
                        "name": "Luo L."
                    },
                    {
                        "name": "Oler A."
                    },
                    {
                        "name": "Robinson P.N."
                    },
                    {
                        "name": "Similuk M."
                    },
                    {
                        "name": "Veltri D."
                    },
                    {
                        "name": "Xirasagar S."
                    },
                    {
                        "name": "Yan S."
                    }
                ],
                "citationCount": 30,
                "date": "2021-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "PhenoTagger: A hybrid method for phenotype concept recognition using human phenotype ontology"
            },
            "pmcid": "PMC11025364",
            "pmid": "33471061"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web API"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        }
    ]
}
