{
    "additionDate": "2021-01-18T07:38:32Z",
    "biotoolsCURIE": "biotools:gcdiscrimination",
    "biotoolsID": "gcdiscrimination",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "lishuyan@lzu.edu.cn",
            "name": "Dekui Zhang",
            "typeEntity": "Person"
        },
        {
            "email": "sczdk1972@163.com",
            "name": "Shuyan Li",
            "typeEntity": "Person"
        }
    ],
    "description": "Identification of gastric cancer based on a milliliter of blood.\n\nGastric cancer (GC) continues to be one of the major causes of cancer deaths worldwide. Meanwhile, liquid biopsies have received extensive attention in the screening and detection of cancer along with better understanding and clinical practice of biomarkers.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://lishuyan.lzu.edu.cn/GC/",
    "lastUpdate": "2021-01-22T17:53:22Z",
    "name": "GCdiscrimination",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAA006",
            "metadata": {
                "abstract": "© 2020 The Author(s).Gastric cancer (GC) continues to be one of the major causes of cancer deaths worldwide. Meanwhile, liquid biopsies have received extensive attention in the screening and detection of cancer along with better understanding and clinical practice of biomarkers. In this work, 58 routine blood biochemical indices were tentatively used as integrated markers, which further expanded the scope of liquid biopsies and a discrimination system for GC consisting of 17 top-ranked indices, elaborated by random forest method was constructed to assist in preliminary assessment prior to histological and gastroscopic diagnosis based on the test data of a total of 2951 samples. The selected indices are composed of eight routine blood indices (MO%, IG#, IG%, EO%, P-LCR, RDW-SD, HCT and RDW-CV) and nine blood biochemical indices (TP, AMY, GLO, CK, CHO, CK-MB, TG, ALB and γ-GGT). The system presented a robust classification performance, which can quickly distinguish GC from other stomach diseases, different cancers and healthy people with sensitivity, specificity, total accuracy and area under the curve of 0.9067, 0.9216, 0.9138 and 0.9720 for the cross-validation set, respectively. Besides, this system can not only provide an innovative strategy to facilitate rapid and real-time GC identification, but also reveal the remote correlation between GC and these routine blood biochemical parameters, which helped to unravel the hidden association of these parameters with GC and serve as the basis for subsequent studies of the clinical value in prevention program and surveillance management for GC. The identification system, called GC discrimination, is now available online at http://lishuyan.lzu.edu.cn/GC/.",
                "authors": [
                    {
                        "name": "Wu J."
                    },
                    {
                        "name": "Yang Y."
                    },
                    {
                        "name": "Cheng L."
                    },
                    {
                        "name": "Wu J."
                    },
                    {
                        "name": "Xi L."
                    },
                    {
                        "name": "Ma Y."
                    },
                    {
                        "name": "Zhang P."
                    },
                    {
                        "name": "Xu X."
                    },
                    {
                        "name": "Zhang D."
                    },
                    {
                        "name": "Li S."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "GCdiscrimination: Identification of gastric cancer based on a milliliter of blood"
            },
            "pmid": "32010933"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        }
    ],
    "validated": 1
}