{
    "accessibility": "Open access",
    "additionDate": "2023-12-20T22:18:56.078141Z",
    "biotoolsCURIE": "biotools:braveheart",
    "biotoolsID": "braveheart",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jwaks@bidmc.harvard.edu",
            "name": "Jonathan W. Waks",
            "orcidid": "https://orcid.org/0000-0001-5560-5638",
            "typeEntity": "Person"
        }
    ],
    "description": "Open-source software for automated electrocardiographic and vectorcardiographic analysis.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://github.com/BIVectors/BRAVEHEART",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2024-11-24T14:27:33.071851Z",
    "license": "GPL-3.0",
    "name": "BRAVEHEART",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/j.cmpb.2023.107798",
            "metadata": {
                "abstract": "Background and Objectives: Electrocardiographic (ECG) and vectorcardiographic (VCG) analyses are used to diagnose current cardiovascular disease and for risk stratification for future adverse cardiovascular events. With increasing use of digital ECGs, research into novel ECG/VCG parameters has increased, but widespread computer-based ECG/VCG analysis is limited because there are no currently available, open-source, and easily customizable software packages designed for automated and reproducible analysis. Methods and Results: We present BRAVEHEART, an open-source, modular, customizable, and easy to use software package implemented in the MATLAB programming language, for scientific analysis of standard 12-lead ECGs acquired in a digital format. BRAVEHEART accepts a wide variety of digital ECG formats and provides complete and automatic ECG/VCG processing with signal denoising to remove high- and low-frequency artifact, non-dominant beat identification and removal, accurate fiducial point annotation, VCG construction, median beat construction, customizable measurements on median beats, and output of measurements and results in numeric and graphical formats. Conclusions: The BRAVEHEART software package provides easily customizable scientific analysis of ECGs and VCGs. We hope that making BRAVEHART available will allow other researchers to further the field of ECG/VCG analysis without having to spend significant time and resources developing their own ECG/VCG analysis software and will improve the reproducibility of future studies. Source code, compiled executables, and a detailed user guide can be found at http://github.com/BIVectors/BRAVEHEART. The source code is distributed under the GNU General Public License version 3.",
                "authors": [
                    {
                        "name": "Stabenau H.F."
                    },
                    {
                        "name": "Waks J.W."
                    }
                ],
                "citationCount": 4,
                "date": "2023-12-01T00:00:00Z",
                "journal": "Computer Methods and Programs in Biomedicine",
                "title": "BRAVEHEART: Open-source software for automated electrocardiographic and vectorcardiographic analysis"
            },
            "pmid": "37734217"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Cardiology",
            "uri": "http://edamontology.org/topic_3335"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
