{
    "additionDate": "2021-01-18T09:16:40Z",
    "biotoolsCURIE": "biotools:cypminer",
    "biotoolsID": "cypminer",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "carl.cerniglia@fda.hhs.gov",
            "name": "Carl E. Cerniglia",
            "typeEntity": "Person"
        }
    ],
    "description": "CYPminer was developed in the Python language to facilitate rapid, comprehensive analysis of CYPs from genomes of all kingdoms. CYPminer consists of two procedures i) to generate the Genome-CYP Matrix (GCM) that lists all occurrences of CYPs across the genomes, and ii) to perform analyses and visualization of the GCM, including pan-CYPomes (pan- and core-CYPome), CYP co-occurrence networks, CYP clouds, and genome clustering data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Okweon/CYPminer",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-18T19:18:47Z",
    "name": "CYPminer",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-020-3473-2",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Cytochrome P450 monooxygenases (termed CYPs or P450s) are hemoproteins ubiquitously found across all kingdoms, playing a central role in intracellular metabolism, especially in metabolism of drugs and xenobiotics. The explosive growth of genome sequencing brings a new set of challenges and issues for researchers, such as a systematic investigation of CYPs across all kingdoms in terms of identification, classification, and pan-CYPome analyses. Such investigation requires an automated tool that can handle an enormous amount of sequencing data in a timely manner. Results: CYPminer was developed in the Python language to facilitate rapid, comprehensive analysis of CYPs from genomes of all kingdoms. CYPminer consists of two procedures i) to generate the Genome-CYP Matrix (GCM) that lists all occurrences of CYPs across the genomes, and ii) to perform analyses and visualization of the GCM, including pan-CYPomes (pan- and core-CYPome), CYP co-occurrence networks, CYP clouds, and genome clustering data. The performance of CYPminer was evaluated with three datasets from fungal and bacterial genome sequences. Conclusions: CYPminer completes CYP analyses for large-scale genomes from all kingdoms, which allows systematic genome annotation and comparative insights for CYPs. CYPminer also can be extended and adapted easily for broader usage.",
                "authors": [
                    {
                        "name": "Kweon O."
                    },
                    {
                        "name": "Kim S.-J."
                    },
                    {
                        "name": "Kim J.H."
                    },
                    {
                        "name": "Nho S.W."
                    },
                    {
                        "name": "Bae D."
                    },
                    {
                        "name": "Chon J."
                    },
                    {
                        "name": "Hart M."
                    },
                    {
                        "name": "Baek D.-H."
                    },
                    {
                        "name": "Kim Y.-C."
                    },
                    {
                        "name": "Wang W."
                    },
                    {
                        "name": "Kim S.-K."
                    },
                    {
                        "name": "Sutherland J.B."
                    },
                    {
                        "name": "Cerniglia C.E."
                    }
                ],
                "citationCount": 1,
                "date": "2020-04-29T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "CYPminer: An automated cytochrome P450 identification, classification, and data analysis tool for genome data sets across kingdoms"
            },
            "pmcid": "PMC7191761",
            "pmid": "32349673"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ]
}