{
    "additionDate": "2018-06-30T16:45:15Z",
    "biotoolsCURIE": "biotools:elochoice",
    "biotoolsID": "elochoice",
    "credit": [
        {
            "email": "christofneumann1@gmail.com",
            "name": "Christof Neumann",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Preference rating for visual stimuli based on Elo ratings.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://cran.r-project.org/web/packages/EloChoice/EloChoice.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sample comparison",
                    "uri": "http://edamontology.org/operation_3731"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/EloChoice/index.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-25T14:44:38.350512Z",
    "name": "EloChoice",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0190393",
            "metadata": {
                "abstract": "We introduce “EloChoice”, a package for R which uses Elo rating to assess pairwise comparisons between stimuli in order to measure perceived stimulus characteristics. To demonstrate the package and compare results from forced choice pairwise comparisons to those from more standard single stimulus rating tasks using Likert (or Likert-type) items, we investigated perceptions of physical strength from images of male bodies. The stimulus set comprised images of 82 men standing on a raised platform with minimal clothing. Strength-related anthropometrics and grip strength measurements were available for each man in the set. UK laboratory participants (Study 1) and US online participants (Study 2) viewed all images in both a Likert rating task, to collect mean Likert scores, and a pairwise comparison task, to calculate Elo, mean Elo (mElo), and Bradley-Terry scores. Within both studies, Likert, Elo and Bradley-Terry scores were closely correlated to mElo scores (all rs > 0.95), and all measures were correlated with stimulus grip strength (all rs > 0.38) and body size (all rs > 0.59). However, mElo scores were less variable than Elo scores and were hundreds of times quicker to compute than Bradley-Terry scores. Responses in pairwise comparison trials were 2/3 quicker than in Likert tasks, indicating that participants found pairwise comparisons to be easier. In addition, mElo scores generated from a data set with half the participants randomly excluded produced very comparable results to those produced with Likert scores from the full participant set, indicating that researchers require fewer participants when using pairwise comparisons.",
                "authors": [
                    {
                        "name": "Clark A.P."
                    },
                    {
                        "name": "Howard K.L."
                    },
                    {
                        "name": "Neumann C."
                    },
                    {
                        "name": "Penton-Voak I.S."
                    },
                    {
                        "name": "Woods A.T."
                    }
                ],
                "citationCount": 35,
                "date": "2018-01-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Why rate when you could compare? Using the “EloChoice” package to assess pairwise comparisons of perceived physical strength"
            },
            "pmcid": "PMC5749798",
            "pmid": "29293615",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Applied mathematics",
            "uri": "http://edamontology.org/topic_3569"
        }
    ],
    "validated": 1
}
