
{
    "credit": [
        {
            "email": "valentina.boeva@inserm.dot.fr",
            "name": "Valentina Boeva",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.cbrc.kaust.edu.sa/hmcan/contact.php"
        },
        {
            "email": "haitham.ashoor@kaust.edu.sa",
            "name": "Haitham Ashoor",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.cbrc.kaust.edu.sa/hmcan/contact.php"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://www.cbrc.kaust.edu.sa/hmcan/desc.php"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Oncology",
                "uri": "http://edamontology.org/topic_2640"
            },
            {
                "term": "ChIP-seq",
                "uri": "http://edamontology.org/topic_3169"
            },
            {
                "term": "Epigenetics",
                "uri": "http://edamontology.org/topic_3295"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/hmcan-1-1-histone-modification-in-cancer.html"
        }
    ],
    "publication": [
        {
            "abstract": "Motivation: Cancer cells are often characterized by epigenetic changes, which include aberrant histone modifications. In particular, local or regional epigenetic silencing is a common mechanism in cancer for silencing expression of tumor suppressor genes. Though several tools have been created to enable detection of histone marks in ChIP-seq data from normal samples, it is unclear whether these tools can be efficiently applied to ChIP-seq data generated from cancer samples. Indeed, cancer genomes are often characterized by frequent copy number alterations: gains and losses of large regions of chromosomal material. Copy number alterations may create a substantial statistical bias in the evaluation of histone mark signal enrichment and result in underdetection of the signal in the regions of loss and overdetection of the signal in the regions of gain. Results: We present HMCan (Histone modifications in cancer), a tool specially designed to analyze histone modification ChIP-seq data produced from cancer genomes. HMCan corrects for the GC-content and copy number bias and then applies Hidden Markov Models to detect the signal from the corrected data. On simulated data, HMCan outperformed several commonly used tools developed to analyze histone modification data produced from genomes without copy number alterations. HMCan also showed superior results on a ChIP-seq dataset generated for the repressive histone mark H3K27me3 in a bladder cancer cell line. HMCan predictions matched well with experimental data (qPCR validated regions) and included, for example, the previously detected H3K27me3 mark in the promoter of the DLEC1 gene, missed by other tools we tested. © The Author 2013. Published by Oxford University Press. All rights reserved.",
            "authors": [
                "Ashoor H.",
                "Herault A.",
                "Kamoun A.",
                "Radvanyi F.",
                "Bajic V.B.",
                "Barillot E.",
                "Boeva V."
            ],
            "cit_count": 12,
            "journal": "Bioinformatics",
            "pmid": "24021381",
            "title": "HMCan: A method for detecting chromatin modifications in cancer samples using ChIP-seq data",
            "year": "2013-12-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:hmcan",
        "biotoolsID": "hmcan",
        "description": "Hidden Markov Model based tool that is developed to detect histone modification in cancer ChIP-seq data. It applies three correction steps to the data: copy number correction, GC bias correction and noise level correction.",
        "homepage": "http://www.cbrc.kaust.edu.sa/hmcan/",
        "name": "HMCan"
    }
}