{
    "additionDate": "2023-01-28T13:04:20.677259Z",
    "biotoolsCURIE": "biotools:fcclasses3",
    "biotoolsID": "fcclasses3",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Javier Cerezo"
        }
    ],
    "description": "Vibrationally-resolved spectra simulated at the edge of the harmonic approximation.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein secondary structure assignment",
                    "uri": "http://edamontology.org/operation_0319"
                },
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                }
            ]
        }
    ],
    "homepage": "http://www.iccom.cnr.it/en/fcclasses/",
    "lastUpdate": "2023-01-28T13:04:20.679954Z",
    "license": "Not licensed",
    "name": "FCclasses3",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1002/JCC.27027",
            "metadata": {
                "abstract": "© 2022 The Authors. Journal of Computational Chemistry published by Wiley Periodicals LLC.We introduce FCclasses3, a code to carry out vibronic simulations of electronic spectra and nonradiative rates, based on the harmonic approximation. Key new features are: implementation of the full family of vertical and adiabatic harmonic models, vibrational analysis in curvilinear coordinates, extension to several electronic spectroscopies and implementation of time-dependent approaches. The use of curvilinear valence internal coordinates allows the adoption of quadratic model potential energy surfaces (PES) of the initial and final states expanded at arbitrary configurations. Moreover, the implementation of suitable projectors provides a robust framework for defining reduced-dimensionality models by sorting flexible coordinates out of the harmonic subset, so that they can then be treated at anharmonic level, or with mixed quantum classical approaches. A set of tools to facilitate input preparation and output analysis is also provided. We show the program at work in the simulation of different spectra (one and two-photon absorption, emission and resonance Raman) and internal conversion rate of a typical rigid molecule, anthracene. Then, we focus on absorption and emission spectra of a series of flexible polyphenyl molecules, highlighting the relevance of some of the newly implemented features. The code is freely available at http://www.iccom.cnr.it/en/fcclasses/.",
                "authors": [
                    {
                        "name": "Cerezo J."
                    },
                    {
                        "name": "Santoro F."
                    }
                ],
                "date": "2023-02-05T00:00:00Z",
                "journal": "Journal of Computational Chemistry",
                "title": "FCclasses3: Vibrationally-resolved spectra simulated at the edge of the harmonic approximation"
            },
            "pmid": "36380723"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        }
    ]
}
