{
    "additionDate": "2021-01-18T08:47:31Z",
    "biotoolsCURIE": "biotools:pepset",
    "biotoolsID": "pepset",
    "confidence_flag": "tool",
    "description": "Comprehensive Evaluation of Fourteen Docking Programs on Protein-Peptide Complexes.\n\nA benchmark consisting of 185 protein-peptide complexes with peptide length ranging from 5 to 20 residues.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                },
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                },
                {
                    "term": "Protein-protein docking",
                    "uri": "http://edamontology.org/operation_3899"
                }
            ]
        }
    ],
    "homepage": "http://cadd.zju.edu.cn/pepset/",
    "lastUpdate": "2021-01-23T08:39:48Z",
    "name": "PepSet",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1021/ACS.JCTC.9B01208",
            "metadata": {
                "abstract": "Copyright © 2020 American Chemical Society.A large number of protein-protein interactions (PPIs) are mediated by the interactions between proteins and peptide segments binding partners, and therefore determination of protein-peptide interactions (PpIs) is quite crucial to elucidate important biological processes and design peptides or peptidomimetic drugs that can modulate PPIs. Nowadays, as a powerful computation tool, molecular docking has been widely utilized to predict the binding structures of protein-peptide complexes. However, although a number of docking programs have been available, the systematic study on the assessment of their performance for PpIs has never been reported. In this study, a benchmark data set called PepSet consisting of 185 protein-peptide complexes with peptide length ranging from 5 to 20 residues was employed to evaluate the performance of 14 docking programs, including three protein-protein docking programs (ZDOCK, FRODOCK, and HawkDock), three small molecule docking programs (GOLD, Surflex-Dock, and AutoDock Vina), and eight protein-peptide docking programs (GalaxyPepDock, MDockPeP, HPEPDOCK, CABS-dock, pepATTRACT, DINC, AutoDock CrankPep (ADCP), and HADDOCK peptide docking). A new evaluation parameter, named IL_RMSD, was proposed to measure the docking accuracy with fnat (the fraction of native contacts). In global docking, HPEPDOCK performs the best for the entire data set and yields the success rates of 4.3%, 24.3%, and 55.7% at the top 1, 10, and 100 levels, respectively. In local docking, overall, ADCP achieves the best predictions and reaches the success rates of 11.9%, 37.3%, and 70.3% at the top 1, 10, and 100 levels, respectively. It is expected that our work can provide some helpful insights into the selection and development of improved docking programs for PpIs. The benchmark data set is freely available at http://cadd.zju.edu.cn/pepset/.",
                "authors": [
                    {
                        "name": "Cao D."
                    },
                    {
                        "name": "Cao D."
                    },
                    {
                        "name": "Gao J."
                    },
                    {
                        "name": "Hou T."
                    },
                    {
                        "name": "Hou T."
                    },
                    {
                        "name": "Hou T."
                    },
                    {
                        "name": "Hu X."
                    },
                    {
                        "name": "Wang E."
                    },
                    {
                        "name": "Wang Z."
                    },
                    {
                        "name": "Weng G."
                    },
                    {
                        "name": "Yao X."
                    }
                ],
                "citationCount": 13,
                "date": "2020-06-09T00:00:00Z",
                "journal": "Journal of Chemical Theory and Computation",
                "title": "Comprehensive Evaluation of Fourteen Docking Programs on Protein-Peptide Complexes"
            },
            "pmid": "32324992"
        }
    ],
    "topic": [
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Protein structural motifs and surfaces",
            "uri": "http://edamontology.org/topic_0166"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
