{
    "name": "QTDT", 
    "description": "It provides a one-stop interface for family based tests of linkage disequilibrium. The general models are supported, and can be used to analyse quantitative or discrete traits in nuclear families, with or without parental genotypes, or extended pedigrees. In addition, QTDT can calculate exact p-values by permutation even when multiple linked polymorphisms are tested.", 
    "homepage": "http://csg.sph.umich.edu/abecasis/qtdt/", 
    "biotoolsID": "qtdt", 
    "biotoolsCURIE": "biotools:qtdt", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0488", 
                    "term": "Linkage disequilibrium calculation"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3517", 
            "term": "GWAS study"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "C++"
    ], 
    "license": "BSD-3-Clause", 
    "collectionID": [
        "Animal and Crop Genomics"
    ], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "http://csg.sph.umich.edu/abecasis/qtdt/docs/index.html", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1086/302698", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "A general test of association for quantitative traits in nuclear families", 
                "abstract": "High-resolution mapping is an important step in the identification of complex disease genes. In outbred populations, linkage disequilibrium is expected to operate over short distances and could provide a powerful fine- mapping tool. Here we build on recently developed methods for linkage- disequilibrium mapping of quantitative traits to construct a general approach that can accommodate nuclear families of any size, with or without parental information. Variance components are used to construct a test that utilizes information from all available offspring but that is not biased in the presence of linkage or familiality. A permutation test is described for situations in which maximum-likelihood estimates of the variance components are biased. Simulation studies are used to investigate power and error rates of this approach and to highlight situations in which violations of multivariate normality assumptions warrant the permutation test. The relationship between power and the level of linkage disequilibrium for this test suggests that the method is well suited to the analysis of dense maps. The relationship between power and family structure is investigated, and these results are applicable to study design in complex disease, especially for late-onset conditions for which parents are usually not available. When parental genotypes are available, power does not depend greatly on the number of offspring in each family. Power decreases when parental genotypes are not available, but the loss in power is negligible when four or more offspring per family are genotyped. Finally, it is shown that, when siblings are available, the total number of genotypes required in order to achieve comparable power is smaller if parents are not genotyped.", 
                "date": "2000-01-01T00:00:00Z", 
                "citationCount": 918, 
                "authors": [
                    {
                        "name": "Abecasis G.R."
                    }, 
                    {
                        "name": "Cardon L.R."
                    }, 
                    {
                        "name": "Cookson W.O.C."
                    }
                ], 
                "journal": "American Journal of Human Genetics"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": "gonzalo@umich.edu", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "admin", 
    "additionDate": "2017-08-20T15:58:49Z", 
    "lastUpdate": "2019-09-04T08:38:27Z", 
    "editPermission": {
        "type": "group", 
        "authors": [
            "animalandcropgenomics"
        ]
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}