{
    "additionDate": "2020-01-09T17:54:15Z",
    "biotoolsCURIE": "biotools:RR-APET",
    "biotoolsID": "RR-APET",
    "confidence_flag": "tool",
    "description": "Heart rate variability analysis software.\n\nBACKGROUND AND OBJECTIVES:Heart rate variability (HRV) has increasingly been linked to medical phenomena and several HRV metrics have been found to be good indicators of patient health. This has enabled generalised treatment plans to be developed in order to respond to subtle personal differences that are reflected in HRV metrics. There are several established HRV analysis platforms and methods available within the literature; some of which provide command line operation across databases but do not offer extensive graphical user interface (GUI) and editing functionality, while others offer extensive ECG editing but are not feasible over large datasets without considerable manual effort",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                }
            ]
        }
    ],
    "homepage": "https://gitlab.com/MegMcC/rr-apet-hrv-analysis-software",
    "language": [
        "R",
        "MATLAB",
        "Python"
    ],
    "lastUpdate": "2020-12-14T08:57:39Z",
    "name": "RR-APET",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.CMPB.2019.105127",
            "metadata": {
                "abstract": "© 2019Background and Objectives: Heart rate variability (HRV) has increasingly been linked to medical phenomena and several HRV metrics have been found to be good indicators of patient health. This has enabled generalised treatment plans to be developed in order to respond to subtle personal differences that are reflected in HRV metrics. There are several established HRV analysis platforms and methods available within the literature; some of which provide command line operation across databases but do not offer extensive graphical user interface (GUI) and editing functionality, while others offer extensive ECG editing but are not feasible over large datasets without considerable manual effort. The aim of this work is to provide a comprehensive open-source package, in a well known and multi-platform language, that offers considerable graphical signal editing features, flexibility within the algorithms used for R-peak detection and HRV quantification, and includes graphical functionality for batch processing. Thereby, providing a platform suited to either physician or researcher. Methods: RR-APET's software was developed in the Python language and is modular in format, providing a range of different modules for established R-peak detection algorithms, as well as an embedded template for alternate algorithms. These modules also include several easily adjustable features, allowing the user to optimise any of the algorithms for different ECG signals or databases. Additionally, the software's user-friendly GUI platform can be operated by both researchers or medical professionals to accomplish different tasks, such as: the in-depth visual analysis of a single ECG, or the analysis multiple signals in a single iteration using batch processing. RR-APET also supports several popular data formats, including text, HDF5, Matlab, and Waveform Database (WFDB) files. Results: The RR-APET platform presents multiple metrics that quantify the heart rate variability features of an R-to-R interval series, including time-domain, frequency-domain, and nonlinear metrics. When known R-peak annotations are available, positive predictability, sensitivity, detection error rate, and accuracy measures are also provided to assess the validity of the implemented R-peak detection algorithm. RR-APET scored an overall usability rating of 4.16 out of a possible 5, when released on a trial basis for user evaluation. Conclusions: With its unique ability to both create and operate on large databases, this software provides a strong platform from which to conduct further research in the field of HRV analytics and its correlation to patient healthcare outcomes. This software is available free of charge at https://gitlab.com/MegMcC/rr-apet-hrv-analysis-software and can be operated as an executable file within Windows, Mac and Linux systems.",
                "authors": [
                    {
                        "name": "McConnell M."
                    },
                    {
                        "name": "Schwerin B."
                    },
                    {
                        "name": "So S."
                    },
                    {
                        "name": "Richards B."
                    }
                ],
                "citationCount": 2,
                "date": "2020-03-01T00:00:00Z",
                "journal": "Computer Methods and Programs in Biomedicine",
                "title": "RR-APET - Heart rate variability analysis software"
            },
            "pmid": "31648100"
        }
    ],
    "topic": [
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        }
    ],
    "validated": 1
}