{
    "additionDate": "2017-08-03T18:54:25Z",
    "biotoolsCURIE": "biotools:popbam",
    "biotoolsID": "popbam",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.sas.rochester.edu/bio/labs/Garrigan/index.htm"
        }
    ],
    "description": "Comprehensive set of computational tools for evolutionary analysis of whole-genome alignments consisting of multiple individuals, from multiple populations or species.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/dgarriga/POPBAM"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Phylogenetic tree generation",
                    "uri": "http://edamontology.org/operation_0323"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "http://popbam.sourceforge.net/",
    "language": [
        "C",
        "C++"
    ],
    "lastUpdate": "2024-11-25T14:21:22.801928Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/popbam-tools-for-evolutionary-analysis-of-short-read-sequence-alignments.html"
        }
    ],
    "name": "POPBAM",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.4137/ebo.s12751",
            "metadata": {
                "abstract": "Background: While many bioinformatics tools currently exist for assembling and discovering variants from next-generation sequence data, there are very few tools available for performing evolutionary analyses from these data. Evolutionary and population genomics studies hold great promise for providing valuable insights into natural selection, the effect of mutations on phenotypes, and the origin of species. Thus, there is a need for an extensible and flexible computational tool that can function into a growing number of evolutionary bioinformatics pipelines. Results: This paper describes the POPBAM software, which is a comprehensive set of computational tools for evolutionary analysis of whole-genome alignments consisting of multiple individuals, from multiple populations or species. POPBAM works directly from BAM-formatted assembly files, calls variant sites, and calculates a variety of commonly used evolutionary sequence statistics. POPBAM is designed primarily to perform analyses in sliding windows across chromosomes or scaffolds. POPBAM accurately measures nucleotide diversity, population divergence, linkage disequilibrium, and the frequency spectrum of mutations from two or more populations. POPBAM can also produce phylogenetic trees of all samples in a BAM file. Finally, I demonstrate that the implementation of POPBAM is both fast and memory-efficient, and also can feasibly scale to the analysis of large BAM files with many individuals and populations. Software: The POPBAM program is written in C/C++ and is available from http://dgarriga.github.io/POPBAM. The program has few dependencies and can be built on a variety of Linux platforms. The program is open-source and users are encouraged to participate in the development of this resource. © the author(s). publisher and licensee Libertas Academica Ltd.",
                "authors": [
                    {
                        "name": "Garrigan D."
                    }
                ],
                "citationCount": 13,
                "date": "2013-09-01T00:00:00Z",
                "journal": "Evolutionary Bioinformatics",
                "title": "POPBAM: Tools for evolutionary analysis of short read sequence alignments"
            },
            "pmcid": "PMC3767577",
            "pmid": "24027417"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        }
    ],
    "validated": 1
}
