{
    "additionDate": "2021-01-18T09:12:41Z",
    "biotoolsCURIE": "biotools:tcmio",
    "biotoolsID": "tcmio",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Zhihong Liu",
            "typeEntity": "Person"
        },
        {
            "name": "Chuipu Cai",
            "typeEntity": "Person"
        },
        {
            "name": "Jiewen Du",
            "typeEntity": "Person"
        },
        {
            "email": "fangjs@gzucm.edu.cn",
            "name": "Jiansong Fang",
            "typeEntity": "Person"
        },
        {
            "email": "xielw@gdim.cn",
            "name": "Liwei Xie",
            "typeEntity": "Person"
        }
    ],
    "description": "A Comprehensive Database of Traditional Chinese Medicine on Immuno-Oncology.\n\nTraditional Chinese medicine (TCM) has been widely used in China and show effective in long history clinical practice.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://tcmio.xielab.net",
    "lastUpdate": "2021-02-26T17:38:17Z",
    "name": "TCMIO",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3389/FPHAR.2020.00439",
            "metadata": {
                "abstract": "© Copyright © 2020 Liu, Cai, Du, Liu, Cui, Fan, Wu, Fang and Xie.Advances in immuno-oncology (IO) are making immunotherapy a powerful tool for cancer treatment. With the discovery of an increasing number of IO targets, many herbs or ingredients from traditional Chinese medicine (TCM) have shown immunomodulatory function and antitumor effects via targeting the immune system. However, knowledge of underlying mechanisms is limited due to the complexity of TCM, which has multiple ingredients acting on multiple targets. To address this issue, we present TCMIO, a comprehensive database of Traditional Chinese Medicine on Immuno-Oncology, which can be used to explore the molecular mechanisms of TCM in modulating the cancer immune microenvironment. Over 120,000 small molecules against 400 IO targets were extracted from public databases and the literature. These ligands were further mapped to the chemical ingredients of TCM to identify herbs that interact with the IO targets. Furthermore, we applied a network inference-based approach to identify the potential IO targets of natural products in TCM. All of these data, along with cheminformatics and bioinformatics tools, were integrated into the publicly accessible database. Chemical structure mining tools are provided to explore the chemical ingredients and ligands against IO targets. Herb–ingredient–target networks can be generated online, and pathway enrichment analysis for TCM or prescription is available. This database is functional for chemical ingredient structure mining and network analysis for TCM. We believe that this database provides a comprehensive resource for further research on the exploration of the mechanisms of TCM in cancer immunity and TCM-inspired identification of novel drug leads for cancer immunotherapy. TCMIO can be publicly accessed at http://tcmio.xielab.net.",
                "authors": [
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Cai C."
                    },
                    {
                        "name": "Du J."
                    },
                    {
                        "name": "Liu B."
                    },
                    {
                        "name": "Cui L."
                    },
                    {
                        "name": "Fan X."
                    },
                    {
                        "name": "Wu Q."
                    },
                    {
                        "name": "Fang J."
                    },
                    {
                        "name": "Xie L."
                    }
                ],
                "citationCount": 2,
                "date": "2020-04-15T00:00:00Z",
                "journal": "Frontiers in Pharmacology",
                "title": "TCMIO: A Comprehensive Database of Traditional Chinese Medicine on Immuno-Oncology"
            },
            "pmcid": "PMC7174671",
            "pmid": "32351388"
        }
    ],
    "topic": [
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}