{
    "accessibility": "Open access",
    "additionDate": "2022-09-04T23:50:16.017172Z",
    "biotoolsCURIE": "biotools:pca-mutpred",
    "biotoolsID": "pca-mutpred",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "K. Veluraja"
        },
        {
            "name": "M. Michael Gromiha"
        },
        {
            "name": "N.R. Siva Shanmugam"
        }
    ],
    "description": "Prediction of Binding Free Energy Change Upon Missense Mutation in Protein-carbohydrate Complexes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein sequence",
                        "uri": "http://edamontology.org/data_2976"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Nucleic acid structure prediction",
                    "uri": "http://edamontology.org/operation_0475"
                },
                {
                    "term": "Protein secondary structure comparison",
                    "uri": "http://edamontology.org/operation_2488"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://web.iitm.ac.in/bioinfo2/pcamutpred",
    "lastUpdate": "2022-09-04T23:50:16.019677Z",
    "name": "PCA-MutPred",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.JMB.2022.167526",
            "metadata": {
                "abstract": "© 2022 Elsevier LtdProtein-carbohydrate interactions play an important role in several biological processes. The mutation of amino acid residues in carbohydrate-binding proteins may alter the binding affinity, affect the functions and lead to diseases. Elucidating the factors influencing the binding affinity change (ΔΔG) of protein-carbohydrate complexes upon mutation is a challenging task. In this work, we have collected the experimental data for the binding affinity change of 318 unique mutants and related with sequence and structural features of amino acid residues at the mutant sites. We found that accessible surface area, secondary structure, mutation preference, conservation score, hydrophobicity and contact energies are important to understand the binding affinity change upon mutation. We have developed multiple regression equations for predicting the binding affinity change upon mutation and our method showed an average correlation of 0.74 and a mean absolute error of 0.70 kcal/mol between experimental and predicted ΔΔG on a 10-fold cross-validation. Further, we have validated our method using an independent test data set of 124 (62 unique) mutations, which showed a correlation and MAE of 0.79 and 0.56 kcal/mol, respectively. We have developed a web server PCA-MutPred, Protein-CArbohydrate complex Mutation affinity Predictor, for predicting the change in binding affinity of protein–carbohydrate complexes and it is freely accessible at https://web.iitm.ac.in/bioinfo2/pcamutpred. We suggest that the method could be a useful resource for designing protein-carbohydrate complexes with desired affinities.",
                "authors": [
                    {
                        "name": "Michael Gromiha M."
                    },
                    {
                        "name": "Siva Shanmugam N.R."
                    },
                    {
                        "name": "Veluraja K."
                    }
                ],
                "citationCount": 1,
                "date": "2022-06-15T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "PCA-MutPred: Prediction of Binding Free Energy Change Upon Missense Mutation in Protein-carbohydrate Complexes"
            },
            "pmid": "35662456"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Carbohydrates",
            "uri": "http://edamontology.org/topic_0152"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
