{
    "accessibility": "Open access",
    "additionDate": "2021-12-06T23:31:18.383244Z",
    "biotoolsCURIE": "biotools:idacp",
    "biotoolsID": "idacp",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "4467@mmh.org.tw",
            "name": "Shun-Long Weng",
            "typeEntity": "Person"
        },
        {
            "name": "Kai-Yao Huang"
        },
        {
            "name": "Yi-Jhan Tseng"
        },
        {
            "name": "Hui-Ju Kao"
        }
    ],
    "description": "Identification of subtypes of anticancer peptides based on sequential features and physicochemical properties.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peptide identification",
                    "uri": "http://edamontology.org/operation_3631"
                },
                {
                    "term": "Protein signal peptide detection",
                    "uri": "http://edamontology.org/operation_0418"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                }
            ]
        }
    ],
    "homepage": "http://mer.hc.mmh.org.tw/iDACP/",
    "lastUpdate": "2021-12-06T23:33:39.306355Z",
    "license": "Not licensed",
    "name": "iDACP",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1038/S41598-021-93124-9",
            "metadata": {
                "abstract": "Anticancer peptides (ACPs) are a kind of bioactive peptides which could be used as a novel type of anticancer drug that has several advantages over chemistry-based drug, including high specificity, strong tumor penetration capacity, and low toxicity to normal cells. As the number of experimentally verified bioactive peptides has increased significantly, various of in silico approaches are imperative for investigating the characteristics of ACPs. However, the lack of methods for investigating the differences in physicochemical properties of ACPs. In this study, we compared the N- and C-terminal amino acid composition for each peptide, there are three major subtypes of ACPs that are defined based on the distribution of positively charged residues. For the first time, we were motivated to develop a two-step machine learning model for identification of the subtypes of ACPs, which classify the input data into the corresponding group before applying the classifier. Further, to improve the predictive power, the hybrid feature sets were considered for prediction. Evaluation by five-fold cross-validation showed that the two-step model trained with sequence-based features and physicochemical properties was most effective in discriminating between ACPs and non-ACPs. The two-step model trained with the hybrid features performed well, with a sensitivity of 86.75%, a specificity of 85.75%, an accuracy of 86.08%, and a Matthews Correlation Coefficient value of 0.703. Furthermore, the model also consistently provides the effective performance in independent testing set, with sensitivity of 77.6%, specificity of 94.74%, accuracy of 88.99% and the MCC value reached 0.75. Finally, the two-step model has been implemented as a web-based tool, namely iDACP, which is now freely available at http://mer.hc.mmh.org.tw/iDACP/ .",
                "authors": [
                    {
                        "name": "Huang K.-Y."
                    },
                    {
                        "name": "Tseng Y.-J."
                    },
                    {
                        "name": "Kao H.-J."
                    },
                    {
                        "name": "Chen C.-H."
                    },
                    {
                        "name": "Yang H.-H."
                    },
                    {
                        "name": "Weng S.-L."
                    }
                ],
                "date": "2021-06-30T00:00:00Z",
                "journal": "Scientific reports",
                "title": "Identification of subtypes of anticancer peptides based on sequential features and physicochemical properties"
            },
            "pmcid": "PMC8245499",
            "pmid": "34193950"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}