{
    "additionDate": "2019-11-14T18:32:22Z",
    "biotoolsCURIE": "biotools:nsLTP",
    "biotoolsID": "nsLTP",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "frederic.de-lamotte@inra.fr",
            "name": "Frédéric de Lamotte",
            "orcidid": "https://orcid.org/0000-0003-4234-1172",
            "typeEntity": "Person"
        }
    ],
    "description": "Comprehensive classification of the plant non-specific lipid transfer protein superfamily towards its sequence-structure-function analysis | Non-specific lipid transfer protein structure modeling | Theoretical structures have been calculated for the 787 other proteins using the @tome2 suite of programs to perform homology modeling. The quality of each final structure model has been evaluated by a set of several tools including Qmean (Benkert, Tosatto et al. 2008). Structures with low quality (i.e. for which the cysteine scaffold could not be fully modeled) were discarded from further analysis",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein cysteine and disulfide bond assignment",
                    "uri": "http://edamontology.org/operation_1850"
                },
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "homepage": "http://atome.cbs.cnrs.fr/AT2B/SERVER/LTP.html",
    "lastUpdate": "2021-01-04T09:09:33Z",
    "name": "nsLTP",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.7717/PEERJ.7504",
            "metadata": {
                "abstract": "Copyright © 2019 Fleury et al.Background: Non-specific Lipid Transfer Proteins (nsLTPs) are widely distributed in the plant kingdom and constitute a superfamily of related proteins. Several hundreds of different nsLTP sequences-and counting-have been characterized so far, but their biological functions remain unclear. It has been clear for years that they present a certain interest for agronomic and nutritional issues. Deciphering their functions means collecting and analyzing a variety of data from gene sequence to protein structure, from cellular localization to the physiological role. As a huge and growing number of new protein sequences are available nowadays, extracting meaningful knowledge from sequence-structure-function relationships calls for the development of new tools and approaches. As nsLTPs show high evolutionary divergence, but a conserved common right handed superhelix structural fold, and as they are involved in a large number of key roles in plant development and defense, they are a stimulating case study for validating such an approach. Methods: In this study, we comprehensively investigated 797 nsLTP protein sequences, including a phylogenetic analysis on canonical protein sequences, threedimensional structure modeling and functional annotation using several wellestablished bioinformatics programs. Additionally, two integrative methodologies using original tools were developed. The first was a new method for the detection of (i) conserved amino acid residues involved in structure stabilization and (ii) residues potentially involved in ligand interaction. The second was a structure-function classification based on the evolutionary trace display method using a new tree visualization interface. We also present a new tool for visualizing phylogenetic trees. Results: Following this new protocol, an updated classification of the nsLTP superfamily was established and a new functional hypothesis for key residues is suggested. Lastly, this work allows a better representation of the diversity of plant nsLTPs in terms of sequence, structure and function.",
                "authors": [
                    {
                        "name": "De Lamotte F."
                    },
                    {
                        "name": "Dufayard J.-F."
                    },
                    {
                        "name": "Fleury C."
                    },
                    {
                        "name": "Gautier M.-F."
                    },
                    {
                        "name": "Gracy J."
                    },
                    {
                        "name": "Labesse G."
                    },
                    {
                        "name": "Pons J.-L."
                    },
                    {
                        "name": "Ruiz M."
                    }
                ],
                "citationCount": 3,
                "date": "2019-01-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "Comprehensive classification of the plant non-specific lipid transfer protein superfamily towards its sequence-structure-function analysis"
            },
            "pmcid": "PMC6698131",
            "pmid": "31428542"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Lipids",
            "uri": "http://edamontology.org/topic_0153"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ],
    "validated": 1
}
