{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:07:45Z",
    "biotoolsCURIE": "biotools:UNRAVEL",
    "biotoolsID": "UNRAVEL",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "unravel@umcutrecht.nl",
            "typeEntity": "Project",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Big data analytics research data platform to improve care of patients with cardiomyopathies using routine electronic health records and standardized biobanking.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://www.unravelrdp.nl/?page_id=46"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "homepage": "http://www.unravelrdp.nl",
    "lastUpdate": "2020-06-16T10:55:26Z",
    "license": "Unlicense",
    "maturity": "Mature",
    "name": "UNRAVEL",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1007/S12471-019-1288-4",
            "metadata": {
                "abstract": "© 2019, The Author(s).Introduction: Despite major advances in our understanding of genetic cardiomyopathies, they remain the leading cause of premature sudden cardiac death and end-stage heart failure in persons under the age of 60 years. Integrated research databases based on a large number of patients may provide a scaffold for future research. Using routine electronic health records and standardised biobanking, big data analysis on a larger number of patients and investigations are possible. In this article, we describe the UNRAVEL research data platform embedded in routine practice to facilitate research in genetic cardiomyopathies. Design: Eligible participants with proven or suspected cardiac disease and their relatives are asked for permission to use their data and to draw blood for biobanking. Routinely collected clinical data are included in a research database by weekly extraction. A text-mining tool has been developed to enrich UNRAVEL with unstructured data in clinical notes. Preliminary results: Thus far, 828 individuals with a median age of 57 years have been included, 58% of whom are male. All data are captured in a temporal sequence amounting to a total of 18,565 electrocardiograms, 3619 echocardiograms, data from over 20,000 radiological examinations and 650,000 individual laboratory measurements. Conclusion: Integration of routine electronic health care in a research data platform allows efficient data collection, including all investigations in chronological sequence. Trials embedded in the electronic health record are now possible, providing cost-effective ways to answer clinical questions. We explicitly welcome national and international collaboration and have provided our protocols and other materials on www.unravelrdp.nl.",
                "authors": [
                    {
                        "name": "Sammani A."
                    },
                    {
                        "name": "Jansen M."
                    },
                    {
                        "name": "Linschoten M."
                    },
                    {
                        "name": "Bagheri A."
                    },
                    {
                        "name": "de Jonge N."
                    },
                    {
                        "name": "Kirkels H."
                    },
                    {
                        "name": "van Laake L.W."
                    },
                    {
                        "name": "Vink A."
                    },
                    {
                        "name": "van Tintelen J.P."
                    },
                    {
                        "name": "Dooijes D."
                    },
                    {
                        "name": "te Riele A.S.J.M."
                    },
                    {
                        "name": "Harakalova M."
                    },
                    {
                        "name": "Baas A.F."
                    },
                    {
                        "name": "Asselbergs F.W."
                    }
                ],
                "citationCount": 5,
                "date": "2019-09-01T00:00:00Z",
                "journal": "Netherlands Heart Journal",
                "title": "UNRAVEL: big data analytics research data platform to improve care of patients with cardiomyopathies using routine electronic health records and standardised biobanking"
            },
            "pmid": "31134468",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biobank",
            "uri": "http://edamontology.org/topic_3337"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Cardiology",
            "uri": "http://edamontology.org/topic_3335"
        }
    ],
    "validated": 1
}