{
    "additionDate": "2019-11-14T19:31:15Z",
    "biotoolsCURIE": "biotools:apples-phylogeny",
    "biotoolsID": "apples-phylogeny",
    "confidence_flag": "tool",
    "description": "Scalable Distance-based Phylogenetic Placement with or without Alignments | distance based phylogenetic placement | APPLES stands for Accurate Phylogenetic Placement with LEast Squares and addresses the problem of phylogenetic placement of DNA and protein sequences into an already existing reference tree. APPLES is a command-line tool and it can run on Linux, Mac OSX, and Windows",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree generation (maximum likelihood and Bayesian methods)",
                    "uri": "http://edamontology.org/operation_0547"
                },
                {
                    "term": "Phylogenetic tree generation (parsimony methods)",
                    "uri": "http://edamontology.org/operation_0545"
                },
                {
                    "term": "Phylogenetic tree reconstruction",
                    "uri": "http://edamontology.org/operation_3478"
                }
            ]
        }
    ],
    "homepage": "http://github.com/balabanmetin/apples",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-02T14:25:12Z",
    "license": "MIT",
    "name": "APPLES",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/SYSBIO/SYZ063",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press, on behalf of the Society of Systematic Biologists. All rights reserved. For permissions, please email: journals.permissions@oup.com.Placing a new species on an existing phylogeny has increasing relevance to several applications. Placement can be used to update phylogenies in a scalable fashion and can help identify unknown query samples using (meta-)barcoding, skimming, or metagenomic data. Maximum likelihood (ML) methods of phylogenetic placement exist, but these methods are not scalable to reference trees with many thousands of leaves, limiting their ability to enjoy benefits of dense taxon sampling in modern reference libraries. They also rely on assembled sequences for the reference set and aligned sequences for the query. Thus, ML methods cannot analyze data sets where the reference consists of unassembled reads, a scenario relevant to emerging applications of genome skimming for sample identification. We introduce APPLES, a distance-based method for phylogenetic placement. Compared to ML, APPLES is an order of magnitude faster and more memory efficient, and unlike ML, it is able to place on large backbone trees (tested for up to 200,000 leaves). We show that using dense references improves accuracy substantially so that APPLES on dense trees is more accurate than ML on sparser trees, where it can run. Finally, APPLES can accurately identify samples without assembled reference or aligned queries using kmer-based distances, a scenario that ML cannot handle. APPLES is available publically at github.com/balabanmetin/apples.",
                "authors": [
                    {
                        "name": "Balaban M."
                    },
                    {
                        "name": "Sarmashghi S."
                    },
                    {
                        "name": "Mirarab S."
                    }
                ],
                "citationCount": 11,
                "date": "2020-05-01T00:00:00Z",
                "journal": "Systematic Biology",
                "title": "APPLES: Scalable Distance-Based Phylogenetic Placement with or without Alignments"
            },
            "pmid": "31545363"
        }
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ],
    "validated": 1
}