{
    "additionDate": "2018-08-03T15:30:19Z",
    "biotoolsCURIE": "biotools:neuromatic",
    "biotoolsID": "neuromatic",
    "credit": [
        {
            "email": "j.rothman@ucl.ac.uk",
            "name": "Jason S. Rothman",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "An Integrated Open-Source Software Toolkit for Acquisition, Analysis and Simulation of Electrophysiological Data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.neuromatic.thinkrandom.com/NMBasics.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "http://www.neuromatic.thinkrandom.com/",
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "NeuroMatic",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.3389/fninf.2018.00014",
            "metadata": {
                "abstract": "© 2018 Rothman and Silver.Acquisition, analysis and simulation of electrophysiological properties of the nervous system require multiple software packages. This makes it difficult to conserve experimental metadata and track the analysis performed. It also complicates certain experimental approaches such as online analysis. To address this, we developed NeuroMatic, an open-source software toolkit that performs data acquisition (episodic, continuous and triggered recordings), data analysis (spike rasters, spontaneous event detection, curve fitting, stationarity) and simulations (stochastic synaptic transmission, synaptic short-term plasticity, integrate-and-fire and Hodgkin-Huxley-like single-compartment models). The merging of a wide range of tools into a single package facilitates a more integrated style of research, from the development of online analysis functions during data acquisition, to the simulation of synaptic conductance trains during dynamic-clamp experiments. Moreover, NeuroMatic has the advantage of working within Igor Pro, a platform-independent environment that includes an extensive library of built-in functions, a history window for reviewing the user’s workflow and the ability to produce publication-quality graphics. Since its original release, NeuroMatic has been used in a wide range of scientific studies and its user base has grown considerably. NeuroMatic version 3.0 can be foundat http://www.neuromatic.thinkrandom.comandhttps://github. com/SilverLabUCL/NeuroMatic.",
                "authors": [
                    {
                        "name": "Rothman J.S."
                    },
                    {
                        "name": "Silver R.A."
                    }
                ],
                "citationCount": 49,
                "date": "2018-04-04T00:00:00Z",
                "journal": "Frontiers in Neuroinformatics",
                "title": "Neuromatic: An integrated open-source software toolkit for acquisition, analysis and simulation of electrophysiological data"
            },
            "pmcid": "PMC5893720",
            "pmid": "29670519"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        },
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        },
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        }
    ],
    "validated": 1,
    "version": [
        "3.0"
    ]
}