{
    "name": "GESS", 
    "description": "Novel computational method for de novo detection of skipping event sites from raw RNA-seq reads without prior knowledge of gene annotations, as well as for determining the dominant isoform generated from such sites.", 
    "homepage": "http://compbio.uthscsa.edu/GESS_Web/", 
    "biotoolsID": "gess", 
    "biotoolsCURIE": "biotools:gess", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2499", 
                    "term": "Splicing model analysis"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0080", 
            "term": "Sequence analysis"
        }, 
        {
            "uri": "http://edamontology.org/topic_3320", 
            "term": "RNA splicing"
        }, 
        {
            "uri": "http://edamontology.org/topic_0099", 
            "term": "RNA"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "Python"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/gess-exon-skipping-scanner-detection-program-for-rna-seq-data.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://compbio.uthscsa.edu/GESS_Web/", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "24369421", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Computational analysis reveals a correlation of exon-skipping events with splicing, transcription and epigenetic factors", 
                "abstract": "Alternative splicing (AS), in higher eukaryotes, is one of the mechanisms of post-transcriptional regulation that generate multiple transcripts from the same gene. One particular mode of AS is the skipping event where an exon may be alternatively excluded or constitutively included in the resulting mature mRNA. Both transcript isoforms from this skipping event site, i.e. in which the exon is either included (inclusion isoform) or excluded (skipping isoform), are typically present in one cell, and maintain a subtle balance that is vital to cellular function and dynamics. However, how the prevailing conditions dictate which isoform is expressed and what biological factors might influence the regulation of this process remain areas requiring further exploration. In this study, we have developed a novel computational method, graph-based exon-skipping scanner (GESS), for de novo detection of skipping event sites from raw RNA-seq reads without prior knowledge of gene annotations, as well as for determining the dominant isoform generated from such sites. We have applied our method to publicly available RNA-seq data in GM12878 and K562 cells from the ENCODE consortium and experimentally validated several skipping site predictions by RT-PCR. Furthermore, we integrated other sequencing-based genomic data to investigate the impact of splicing activities, transcription factors (TFs) and epigenetic histone modifications on splicing outcomes. Our computational analysis found that splice sites within the skipping-isoform-dominated group (SIDG) tended to exhibit weaker MaxEntScan-calculated splice site strength around middle, 'skipping', exons compared to those in the inclusion-isoform- dominated group (IIDG). We further showed the positional preference pattern of splicing factors, characterized by enrichment in the intronic splice sites immediately bordering middle exons. Finally, our analysis suggested that different epigenetic factors may introduce a variable obstacle in the process of exon-intron boundary establishment leading to skipping events. © The Author(s) 2013.", 
                "date": "2014-01-01T00:00:00Z", 
                "citationCount": 16, 
                "authors": [
                    {
                        "name": "Ye Z."
                    }, 
                    {
                        "name": "Chen Z."
                    }, 
                    {
                        "name": "Lan X."
                    }, 
                    {
                        "name": "Hara S."
                    }, 
                    {
                        "name": "Sunkel B."
                    }, 
                    {
                        "name": "Huang T.H.-M."
                    }, 
                    {
                        "name": "Elnitski L."
                    }, 
                    {
                        "name": "Wang Q."
                    }, 
                    {
                        "name": "Jin V.X."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }
    ], 
    "credit": [
        {
            "name": "Zhenqing Ye", 
            "email": "yez@uthscsa.edu", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }, 
        {
            "name": "Victor Jin", 
            "email": "jinv@uthscsa.edu", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T18:44:13Z", 
    "lastUpdate": "2018-12-10T12:58:50Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}