{
    "additionDate": "2019-11-14T19:38:29Z",
    "biotoolsCURIE": "biotools:ADAPTIVE",
    "biotoolsID": "ADAPTIVE",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hai@kuicr.kyoto-u.ac.jp",
            "name": "Dai Hai Nguyen",
            "typeEntity": "Person"
        }
    ],
    "description": "leArning DAta-dePendenT, concIse molecular VEctors for fast, accurate metabolite identification from tandem mass spectra | Learning molecular vectors for metabolites from spectra-structure pairs] | We propose ADAPTIVE, which has two parts: learning two mappings 1) from structures to molecular vectors and 2) from spectra to molecular vectors",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Mass spectra calibration",
                    "uri": "http://edamontology.org/operation_3627"
                },
                {
                    "term": "Natural product identification",
                    "uri": "http://edamontology.org/operation_3803"
                },
                {
                    "term": "Spectrum calculation",
                    "uri": "http://edamontology.org/operation_3860"
                }
            ]
        }
    ],
    "homepage": "http://www.bic.kyoto-u.ac.jp/pathway/tools/ADAPTIVE",
    "lastUpdate": "2020-12-01T14:42:18Z",
    "name": "ADAPTIVE",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ319",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Motivation: Metabolite identification is an important task in metabolomics to enhance the knowledge of biological systems. There have been a number of machine learning-based methods proposed for this task, which predict a chemical structure of a given spectrum through an intermediate (chemical structure) representation called molecular fingerprints. They usually have two steps: (i) predicting fingerprints from spectra; (ii) searching chemical compounds (in database) corresponding to the predicted fingerprints. Fingerprints are feature vectors, which are usually very large to cover all possible substructures and chemical properties, and therefore heavily redundant, in the sense of having many molecular (sub)structures irrelevant to the task, causing limited predictive performance and slow prediction. Results: We propose ADAPTIVE, which has two parts: learning two mappings (i) from structures to molecular vectors and (ii) from spectra to molecular vectors. The first part learns molecular vectors for metabolites from given data, to be consistent with both spectra and chemical structures of metabolites. In more detail, molecular vectors are generated by a model, being parameterized by a message passing neural network, and parameters are estimated by maximizing the correlation between molecular vectors and the corresponding spectra in terms of Hilbert-Schmidt Independence Criterion. Molecular vectors generated by this model are compact and importantly adaptive (specific) to both given data and task of metabolite identification. The second part uses input output kernel regression (IOKR), the current cutting-edge method of metabolite identification. We empirically confirmed the effectiveness of ADAPTIVE by using a benchmark data, where ADAPTIVE outperformed the original IOKR in both predictive performance and computational efficiency.",
                "authors": [
                    {
                        "name": "Mamitsuka H."
                    },
                    {
                        "name": "Nguyen C.H."
                    },
                    {
                        "name": "Nguyen D.H."
                    }
                ],
                "citationCount": 6,
                "date": "2019-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "ADAPTIVE: LeArning DAta-dePendenT, concIse molecular VEctors for fast, accurate metabolite identification from tandem mass spectra"
            },
            "pmcid": "PMC6612897",
            "pmid": "31510641"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
