{
    "additionDate": "2016-10-30T05:33:50Z",
    "biotoolsCURIE": "biotools:pdb_redo",
    "biotoolsID": "pdb_redo",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "r.joosten@nki.nl",
            "name": "Robbie P. Joosten",
            "orcidid": "http://orcid.org/0000-0002-2323-2686",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "r.joosten@nki.nl",
            "name": "Robbie P. Joosten",
            "orcidid": "http://orcid.org/0000-0002-2323-2686",
            "typeRole": [
                "Support"
            ]
        }
    ],
    "description": "The PDB-REDO databank contains alternative (in many cases higher quality) versions of Protein Data Bank (PDB) structure models that were optimised by model refinement and rebuilding. \nThe structure models are supplemented by validation data that describe model quality and model changes with respect to the PDB version.\nAs the models are consistently treated, they are more suited for large-scale analysis of protein structure than their PDB counterparts.",
    "documentation": [
        {
            "type": [
                "Citation instructions"
            ],
            "url": "http://www.cmbi.ru.nl/pdb_redo/references.html"
        },
        {
            "type": [
                "General"
            ],
            "url": "http://www.cmbi.ru.nl/pdb_redo"
        }
    ],
    "download": [
        {
            "type": "Binaries",
            "url": "http://www.cmbi.ru.nl/pdb_redo/downloads.html"
        },
        {
            "type": "Source code",
            "url": "http://www.cmbi.ru.nl/pdb_redo/downloads.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein model validation",
                    "uri": "http://edamontology.org/operation_0321"
                },
                {
                    "term": "Protein property calculation",
                    "uri": "http://edamontology.org/operation_0250"
                },
                {
                    "term": "Protein structure analysis",
                    "uri": "http://edamontology.org/operation_2406"
                },
                {
                    "term": "Structure comparison",
                    "uri": "http://edamontology.org/operation_2483"
                },
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                }
            ]
        }
    ],
    "homepage": "http://pdb-redo.eu",
    "lastUpdate": "2024-11-24T14:31:24.967159Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "http://www.cmbi.ru.nl/pdb_redo/downloads.html"
        }
    ],
    "maturity": "Mature",
    "name": "PDB-REDO databank",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "rjoosten",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btr590",
            "metadata": {
                "abstract": "Motivation: Macromolecular crystal structures in the Protein Data Bank (PDB) are a key source of structural insight into biological processes. These structures, some >30 years old, were constructed with methods of their era. With PDB_REDO, we aim to automatically optimize these structures to better fit their corresponding experimental data, passing the benefits of new methods in crystallography on to a wide base of non-crystallographer structure users. Results: We developed new algorithms to allow automatic rebuilding and remodeling of main chain peptide bonds and side chains in crystallographic electron density maps, and incorporated these and further enhancements in the PDB_REDO procedure. Applying the updated PDB_REDO to the oldest, but also to some of the newest models in the PDB, corrects existing modeling errors and brings these models to a higher quality, as judged by standard validation methods. © The Author(s) 2011. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Cohen S.X."
                    },
                    {
                        "name": "Joosten K."
                    },
                    {
                        "name": "Joosten R.P."
                    },
                    {
                        "name": "Perrakis A."
                    },
                    {
                        "name": "Vriend G."
                    }
                ],
                "citationCount": 85,
                "date": "2011-12-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Automatic rebuilding and optimization of crystallographic structures in the Protein Data Bank"
            },
            "pmcid": "PMC3232375",
            "pmid": "22034521",
            "type": [
                "Other"
            ]
        },
        {
            "doi": "10.1093/nar/gkq1105",
            "metadata": {
                "abstract": "The Protein Data Bank (PDB) is the world-wide repository of macromolecular structure information. We present a series of databases that run parallel to the PDB. Each database holds one entry, if possible, for each PDB entry. DSSP holds the secondary structure of the proteins. PDBREPORT holds reports on the structure quality and lists errors. HSSP holds a multiple sequence alignment for all proteins. The PDBFINDER holds easy to parse summaries of the PDB file content, augmented with essentials from the other systems. PDB-REDO holds re-refined, and often improved, copies of all structures solved by X-ray. WHY NOT summarizes why certain files could not be produced. All these systems are updated weekly. The data sets can be used for the analysis of properties of protein structures in areas ranging from structural genomics, to cancer biology and protein design. © The Author(s) 2010.",
                "authors": [
                    {
                        "name": "Hekkelman M.L."
                    },
                    {
                        "name": "Hooft R.W.W."
                    },
                    {
                        "name": "Joosten R.P."
                    },
                    {
                        "name": "Krieger E."
                    },
                    {
                        "name": "Sander C."
                    },
                    {
                        "name": "Schneider R."
                    },
                    {
                        "name": "Te Beek T.A.H."
                    },
                    {
                        "name": "Vriend G."
                    }
                ],
                "citationCount": 584,
                "date": "2011-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "A series of PDB related databases for everyday needs"
            },
            "pmcid": "PMC3013697",
            "pmid": "21071423",
            "type": [
                "Other"
            ]
        },
        {
            "doi": "10.1093/nar/gku1028",
            "metadata": {
                "abstract": "We present a series of databanks (http://swift.cmbi. ru.nl/gv/facilities/) that hold information that is computationally derived from Protein Data Bank (PDB) entries and that might augment macromolecular structure studies. These derived databanks run parallel to the PDB, i.e. they have one entry per PDB entry. Several of the well-established databanks such as HSSP, PDBREPORT and PDB REDO have been updated and/or improved. The software that creates the DSSP databank, for example, has been rewritten to better cope with π-helices. A large number of databanks have been added to aid computational structural biology; some examples are lists of residues that make crystal contacts, lists of contacting residues using a series of contact definitions or lists of residue accessibilities. PDB files are not the optimal presentation of the underlying data for many studies.We thereforemade a series of databanks that hold PDB files in an easier to use or more consistent representation. The BDB databank holds X-ray PDB files with consistently represented B-factors.We also added several visualization tools to aid the users of our databanks.",
                "authors": [
                    {
                        "name": "Baakman C."
                    },
                    {
                        "name": "Black J."
                    },
                    {
                        "name": "Joosten R.P."
                    },
                    {
                        "name": "Krieger E."
                    },
                    {
                        "name": "Te Beek T.A.H."
                    },
                    {
                        "name": "Touw W.G."
                    },
                    {
                        "name": "Vriend G."
                    }
                ],
                "citationCount": 676,
                "date": "2015-01-28T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "A series of PDB-related databanks for everyday needs"
            },
            "pmcid": "PMC4383885",
            "pmid": "25352545",
            "type": [
                "Other"
            ]
        },
        {
            "doi": "10.1107/s0021889809008784",
            "metadata": {
                "abstract": "Structural biology, homology modelling and rational drug design require accurate three-dimensional macromolecular coordinates. However, the coordinates in the Protein Data Bank (PDB) have not all been obtained using the latest experimental and computational methods. In this study a method is presented for automated re-refinement of existing structure models in the PDB. A large-scale benchmark with 16 807 PDB entries showed that they can be improved in terms of fit to the deposited experimental X-ray data as well as in terms of geometric quality. The re-refinement protocol uses TLS models to describe concerted atom movement. The resulting structure models are made available through the PDB-REDO databank (http://www.cmbi.ru.nl/pdb-redo/). Grid computing techniques were used to overcome the computational requirements of this endeavour. © 2009 International Union of Crystallography.",
                "authors": [
                    {
                        "name": "Berglund A.-C."
                    },
                    {
                        "name": "Blanchet C."
                    },
                    {
                        "name": "Bloch V."
                    },
                    {
                        "name": "Bongcam-Rudloff E."
                    },
                    {
                        "name": "Breton V."
                    },
                    {
                        "name": "Combet C."
                    },
                    {
                        "name": "Da Costa A.L."
                    },
                    {
                        "name": "Deleage G."
                    },
                    {
                        "name": "Diarena M."
                    },
                    {
                        "name": "Fabbretti R."
                    },
                    {
                        "name": "Fettahi G."
                    },
                    {
                        "name": "Flegel V."
                    },
                    {
                        "name": "Gisel A."
                    },
                    {
                        "name": "Joosten R.P."
                    },
                    {
                        "name": "Kasam V."
                    },
                    {
                        "name": "Kervinen T."
                    },
                    {
                        "name": "Korpelainen E."
                    },
                    {
                        "name": "Mattila K."
                    },
                    {
                        "name": "Pagni M."
                    },
                    {
                        "name": "Reichstadt M."
                    },
                    {
                        "name": "Salzemann J."
                    },
                    {
                        "name": "Stockinger H."
                    },
                    {
                        "name": "Tickle I.J."
                    },
                    {
                        "name": "Vriend G."
                    }
                ],
                "citationCount": 185,
                "date": "2009-01-01T00:00:00Z",
                "journal": "Journal of Applied Crystallography",
                "title": "PDB-REDO: Automated re-refinement of X-ray structure models in the PDB"
            },
            "pmcid": "PMC3246819",
            "pmid": "22477769",
            "type": [
                "Other"
            ]
        },
        {
            "doi": "10.1107/s0907444908037591",
            "metadata": {
                "abstract": "The deposition of X-ray data along with the customary structural models defining PDB entries makes it possible to apply large-scale re-refinement protocols to these entries, thus giving users the benefit of improvements in X-ray methods that have occurred since the structure was deposited. Automated gradient refinement is an effective method to achieve this goal, but real-space intervention is most often required in order to adequately address problems detected by structure-validation software. In order to improve the existing protocol, automated re-refinement was combined with structure validation and difference-density peak analysis to produce a catalogue of problems in PDB entries that are amenable to automatic correction. It is shown that re-refinement can be effective in producing improvements, which are often associated with the systematic use of the TLS parameterization of B factors, even for relatively new and high-resolution PDB entries, while the accompanying manual or semi-manual map analysis and fitting steps show good prospects for eventual automation. It is proposed that the potential for simultaneous improvements in methods and in re-refinement results be further encouraged by broadening the scope of depositions to include refinement metadata and ultimately primary rather than reduced X-ray data.",
                "authors": [
                    {
                        "name": "Bricogne G."
                    },
                    {
                        "name": "Joosten R.P."
                    },
                    {
                        "name": "Vriend G."
                    },
                    {
                        "name": "Womack T."
                    }
                ],
                "citationCount": 69,
                "date": "2009-01-20T00:00:00Z",
                "journal": "Acta Crystallographica Section D: Biological Crystallography",
                "title": "Re-refinement from deposited X-ray data can deliver improved models for most PDB entries"
            },
            "pmcid": "PMC2631631",
            "pmid": "19171973",
            "type": [
                "Other"
            ]
        },
        {
            "doi": "10.1107/s0907444911054515",
            "metadata": {
                "abstract": "Developments of the PDB-REDO procedure that combine re-refinement and rebuilding within a unique decision-making framework to improve structures in the PDB are presented. PDB-REDO uses a variety of existing and custom-built software modules to choose an optimal refinement protocol (e.g. anisotropic, isotropic or overall B-factor refinement, TLS model) and to optimize the geometry versus data-refinement weights. Next, it proceeds to rebuild side chains and peptide planes before a final optimization round. PDB-REDO works fully automatically without the need for intervention by a crystallographic expert. The pipeline was tested on 12 000 PDB entries and the great majority of the test cases improved both in terms of crystallographic criteria such as R free and in terms of widely accepted geometric validation criteria. It is concluded that PDB-REDO is useful to update the otherwise static structures in the PDB to modern crystallographic standards. The publically available PDB-REDO database provides better model statistics and contributes to better refinement and validation targets. © International Union of Crystallography 2012.",
                "authors": [
                    {
                        "name": "Joosten K."
                    },
                    {
                        "name": "Joosten R.P."
                    },
                    {
                        "name": "Murshudov G.N."
                    },
                    {
                        "name": "Perrakis A."
                    }
                ],
                "citationCount": 179,
                "date": "2012-04-01T00:00:00Z",
                "journal": "Acta Crystallographica Section D: Biological Crystallography",
                "title": "PDB-REDO: Constructive validation, more than just looking for errors"
            },
            "pmcid": "PMC3322608",
            "pmid": "22505269",
            "type": [
                "Other"
            ]
        },
        {
            "doi": "10.1107/s2059798316013036",
            "metadata": {
                "abstract": "Many crystal structures in the Protein Data Bank contain zinc ions in a geometrically distorted tetrahedral complex with four Cys and/or His ligands. A method is presented to automatically validate and correct these zinc complexes. Analysis of the corrected zinc complexes shows that the average ZnCys distances and Cys-Zn-Cys angles are a function of the number of cysteines and histidines involved. The observed trends can be used to develop more contextsensitive targets for model validation and refinement.",
                "authors": [
                    {
                        "name": "Evers J.M.G."
                    },
                    {
                        "name": "Joosten R.P."
                    },
                    {
                        "name": "Touw W.G."
                    },
                    {
                        "name": "Van Beusekom B."
                    },
                    {
                        "name": "Vriend G."
                    }
                ],
                "citationCount": 24,
                "date": "2016-01-01T00:00:00Z",
                "journal": "Acta Crystallographica Section D: Structural Biology",
                "title": "Validation and correction of ZnCysxHisy complexes"
            },
            "pmcid": "PMC5053137",
            "pmid": "27710932",
            "type": [
                "Other"
            ]
        },
        {
            "doi": "10.1007/978-1-4939-3572-7_6",
            "metadata": {
                "abstract": "The use of macromolecular structures is widespread for a variety of applications, from teaching protein structure principles all the way to ligand optimization in drug development. Applying data mining techniques on these experimentally determined structures requires a highly uniform, standardized structural data source. The Protein Data Bank (PDB) has evolved over the years toward becoming the standard resource for macromolecular structures. However, the process selecting the data most suitable for specific applications is still very much based on personal preferences and understanding of the experimental techniques used to obtain these models. In this chapter, we will first explain the challenges with data standardization, annotation, and uniformity in the PDB entries determined by X-ray crystallography. We then discuss the specific effect that crystallographic data quality and model optimization methods have on structural models and how validation tools can be used to make informed choices. We also discuss specific advantages of using the PDB_REDO databank as a resource for structural data. Finally, we will provide guidelines on how to select the most suitable protein structure models for detailed analysis and how to select a set of structure models suitable for data mining.",
                "authors": [
                    {
                        "name": "Joosten R.P."
                    },
                    {
                        "name": "Perrakis A."
                    },
                    {
                        "name": "van Beusekom B."
                    }
                ],
                "citationCount": 10,
                "date": "2016-08-01T00:00:00Z",
                "journal": "Methods in Molecular Biology",
                "title": "Data mining of macromolecular structures"
            },
            "pmid": "27115630",
            "type": [
                "Other"
            ]
        },
        {
            "doi": "10.1126/science.317.5835.195",
            "metadata": {
                "authors": [
                    {
                        "name": "Joosten R.P."
                    },
                    {
                        "name": "Vriend G."
                    }
                ],
                "citationCount": 36,
                "date": "2007-07-13T00:00:00Z",
                "journal": "Science",
                "title": "PDB improvement starts with data deposition [3]"
            },
            "pmid": "17626865",
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        },
        {
            "term": "Structural biology",
            "uri": "http://edamontology.org/topic_1317"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        }
    ],
    "validated": 1
}
