{
    "additionDate": "2021-01-18T08:48:08Z",
    "biotoolsCURIE": "biotools:hla-emma",
    "biotoolsID": "hla-emma",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "c.s.m.kramer@lumc.nl",
            "name": "Cynthia S. M. Kramer",
            "orcidid": "https://orcid.org/0000-0003-1350-2336",
            "typeEntity": "Person"
        }
    ],
    "description": "A user-friendly tool to analyse HLA class I and class II compatibility on the amino acid level.\n\nHLA-EMMA is a software package designed to perform HLA class I and class II compatibility analysis on the amino acid level. HLA-EMMA predicts & analyses HLA antibody formation.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peptide immunogenicity prediction",
                    "uri": "http://edamontology.org/operation_0252"
                },
                {
                    "term": "Epitope mapping",
                    "uri": "http://edamontology.org/operation_0416"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "http://www.HLA-EMMA.com",
    "lastUpdate": "2021-01-30T11:52:22Z",
    "name": "HLA-EMMA",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1111/TAN.13883",
            "metadata": {
                "abstract": "© 2020 The Authors. HLA: Immune Response Genetics published by John Wiley & Sons Ltd.In renal transplantation, polymorphic amino acids on mismatched donor HLA molecules can lead to the induction of de novo donor-specific antibodies (DSA), which are associated with inferior graft survival. To ultimately prevent de novo DSA formation without unnecessarily precluding transplants it is essential to define which polymorphic amino acid mismatches can actually induce an antibody response. To facilitate this, we developed a user-friendly software program that establishes HLA class I and class II compatibility between donor and recipient on the amino acid level. HLA epitope mismatch algorithm (HLA-EMMA) is a software program that compares simultaneously the HLA class I and class II amino acid sequences of the donor with the HLA amino acid sequences of the recipient and determines the polymorphic solvent accessible amino acid mismatches that are likely to be accessible to B cell receptors. Analysis can be performed for a large number of donor-recipient pairs at once. As proof of principle, a previously described study cohort of 191 lymphocyte immunotherapy recipients was analysed with HLA-EMMA and showed a higher frequency of DSA formation with higher number of solvent accessible amino acids mismatches. Overall, HLA-EMMA can be used to analyse compatibility on amino acid level between donor and recipient HLA class I and class II simultaneously for large cohorts to ultimately determine the most immunogenic amino acid mismatches.",
                "authors": [
                    {
                        "name": "Kramer C.S.M."
                    },
                    {
                        "name": "Koster J."
                    },
                    {
                        "name": "Haasnoot G.W."
                    },
                    {
                        "name": "Roelen D.L."
                    },
                    {
                        "name": "Claas F.H.J."
                    },
                    {
                        "name": "Heidt S."
                    }
                ],
                "citationCount": 6,
                "date": "2020-07-01T00:00:00Z",
                "journal": "HLA",
                "title": "HLA-EMMA: A user-friendly tool to analyse HLA class I and class II compatibility on the amino acid level"
            },
            "pmcid": "PMC7317360",
            "pmid": "32227681"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Immunogenetics",
            "uri": "http://edamontology.org/topic_3930"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        }
    ]
}