{
    "additionDate": "2021-01-18T12:12:00Z",
    "biotoolsCURIE": "biotools:msuite",
    "biotoolsID": "msuite",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "sunkun@szbl.ac.cn",
            "name": "Kun Sun",
            "typeEntity": "Person"
        }
    ],
    "description": "A High-Performance and Versatile DNA Methylation Data-Analysis Toolkit.\n\nMsuite: Multi-mode DNA methylation data analysis suite.\n\nMsuite is written in Perl and R for Linux/Unix platform. To run Msuite you need a Linux/Unix machine with Bash 4 (or higher), Perl 5.10 (or higher) and R 2.10 (or higher) installed.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Bisulfite mapping",
                    "uri": "http://edamontology.org/operation_3186"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Methylation calling",
                    "uri": "http://edamontology.org/operation_3919"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/hellosunking/Msuite/",
    "language": [
        "C++",
        "Perl",
        "Shell"
    ],
    "lastUpdate": "2021-03-02T08:03:31Z",
    "name": "Msuite",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/J.PATTER.2020.100127",
            "metadata": {
                "abstract": "© 2020 The AuthorsDNA methylation is a pervasive and important epigenetic regulator in mammalian genome. For DNA methylome profiling, emerging bisulfite-free methods have demonstrated desirable superiority over the conventional bisulfite-treatment-based approaches, although current analysis software could not make full use of their advantages. In this work, we present Msuite, an easy-to-use, all-in-one data-analysis toolkit. Msuite implements a unique 4-letter analysis mode specifically optimized for emerging protocols; it also integrates quality controls, methylation call, and data visualizations. Msuite demonstrates substantial performance improvements over current state-of-the-art tools as well as fruitful functionalities, thus holding the potential to serve as an optimal toolkit to facilitate DNA methylome studies. Source codes and testing datasets for Msuite are freely available at https://github.com/hellosunking/Msuite/. © 2020 The AuthorsEmerging bisulfite-free assays for DNA methylome profiling have raised new requirements for data-analysis tools. Here, we present Msuite, an all-in-one package for DNA methylation data analysis with a unique 4-letter analysis mode for bisulfite-free protocols. Msuite has integrated quality control, read alignment, methylation call, and data visualization, and thus could serve as an optimal toolkit for DNA methylation studies. © 2020 The AuthorsDNA methylation is an essential epigenetic modification responsible for many biological regulation pathways. Despite the fact that various high-throughput methods have been developed for base-resolution DNA methylome profiling, DNA methylation data analysis remains a complex and challenging task. Here, we present Msuite, which has integrated quality control, read alignment, methylation call, and fruitful data-visualization functionalities, aiming to offer an all-in-one package for most of the current DNA methylation profiling assays. Msuite also provides dedicated support for emerging bisulfite-free protocols and outperforms the current tools in terms of higher accuracy and lower computational resource requirement. Hence, Msuite could serve as the optimal toolkit for DNA methylation data analysis as well as facilitating the popularization of emerging bisulfite-free protocols.",
                "authors": [
                    {
                        "name": "Deng L."
                    },
                    {
                        "name": "Li L."
                    },
                    {
                        "name": "Ma L."
                    },
                    {
                        "name": "Sun H."
                    },
                    {
                        "name": "Sun K."
                    },
                    {
                        "name": "Wang H."
                    },
                    {
                        "name": "Zhao Y."
                    }
                ],
                "date": "2020-11-13T00:00:00Z",
                "journal": "Patterns",
                "title": "Msuite: A High-Performance and Versatile DNA Methylation Data-Analysis Toolkit"
            },
            "pmcid": "PMC7691389",
            "pmid": "33294868"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Suite"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Data architecture, analysis and design",
            "uri": "http://edamontology.org/topic_3365"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Methylated DNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3674"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ]
}
