{
    "accessibility": "Open access",
    "additionDate": "2022-10-28T08:40:44.088911Z",
    "biotoolsCURIE": "biotools:tmbur",
    "biotoolsID": "tmbur",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "mmarra@bcgsc.ca",
            "name": "Marco A. Marra",
            "orcidid": "https://orcid.org/0000-0001-7146-7175",
            "typeEntity": "Person"
        },
        {
            "name": "Daniel J. Renouf"
        },
        {
            "name": "Janessa Laskin"
        },
        {
            "name": "Steven J. M. Jones"
        }
    ],
    "description": "A distributable tumor mutation burden approach for whole genome sequencing.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bcgsc/TMBur",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-10-28T08:40:44.091498Z",
    "license": "Not licensed",
    "name": "TMBur",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S12920-022-01348-Z",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: Tumor mutation burden (TMB) is a key characteristic used in a tumor-type agnostic context to inform the use of immune checkpoint inhibitors (ICI). Accurate and consistent measurement of TMB is crucial as it can significantly impact patient selection for therapy and clinical trials, with a threshold of 10 mutations/Mb commonly used as an inclusion criterion. Studies have shown that the most significant contributor to variability in mutation counts in whole genome sequence (WGS) data is differences in analysis methods, even more than differences in extraction or library construction methods. Therefore, tools for improving consistency in whole genome TMB estimation are of clinical importance. Methods: We developed a distributable TMB analysis suite, TMBur, to address the need for genomic TMB estimate consistency in projects that span jurisdictions. TMBur is implemented in Nextflow and performs all analysis steps to generate TMB estimates directly from fastq files, incorporating somatic variant calling with Manta, Strelka2, and Mutect2, and microsatellite instability profiling with MSISensor. These tools are provided in a Singularity container downloaded by the workflow at runtime, allowing the entire workflow to be run identically on most computing platforms. To test the reproducibility of TMBur TMB estimates, we performed replicate runs on WGS data derived from the COLO829 and COLO829BL cell lines at multiple research centres. The clinical value of derived TMB estimates was then evaluated using a cohort of 90 patients with advanced, metastatic cancer that received ICIs following WGS analysis. Patients were split into groups based on a threshold of 10/Mb, and time to progression from initiation of ICIs was examined using Kaplan–Meier and cox-proportional hazards analyses. Results: TMBur produced identical TMB estimates across replicates and at multiple analysis centres. The clinical utility of TMBur-derived TMB estimates were validated, with a genomic TMB ≥ 10/Mb demonstrating improved time to progression, even after correcting for differences in tumor type (HR = 0.39, p = 0.012). Conclusions: TMBur, a shareable workflow, generates consistent whole genome derived TMB estimates predictive of response to ICIs across multiple analysis centres. Reproducible TMB estimates from this approach can improve collaboration and ensure equitable treatment and clinical trial access spanning jurisdictions.",
                "authors": [
                    {
                        "name": "Abbasi S."
                    },
                    {
                        "name": "Corbett R.D."
                    },
                    {
                        "name": "Davidson S."
                    },
                    {
                        "name": "Jones S.J.M."
                    },
                    {
                        "name": "Laskin J."
                    },
                    {
                        "name": "Marra M.A."
                    },
                    {
                        "name": "Pleasance E.D."
                    },
                    {
                        "name": "Renouf D.J."
                    },
                    {
                        "name": "Shlien A."
                    },
                    {
                        "name": "Titmuss E."
                    },
                    {
                        "name": "Williamson L.M."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Medical Genomics",
                "title": "TMBur: a distributable tumor mutation burden approach for whole genome sequencing"
            },
            "pmcid": "PMC9450342",
            "pmid": "36071521"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ],
    "validated": 1
}
