{
    "accessibility": [],
    "additionDate": "2017-01-13T13:15:58Z",
    "biotoolsCURIE": "biotools:qpalma",
    "biotoolsID": "qpalma",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": "raetsch@inf.ethz.ch",
            "gridid": null,
            "name": "Gunnar Rätsch",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        }
    ],
    "description": "Alignment tool targeted to align spliced reads produced by Next Generation sequencing platforms.",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "http://www.raetschlab.org/suppl/qpalma"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://www.fml.mpg.de/raetsch/projects/qpalma",
    "homepage_status": 0,
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:55Z",
    "license": null,
    "link": [],
    "maturity": null,
    "name": "Qpalma",
    "operatingSystem": [],
    "otherID": [],
    "owner": "seqwiki_import",
    "publication": [
        {
            "doi": null,
            "metadata": {
                "abstract": "Motivation: Next generation sequencing technologies open exciting new possibilities for genome and transcriptome sequencing. While reads produced by these technologies are relatively short and error prone compared to the Sanger method their throughput is several magnitudes higher. To utilize such reads for transcriptome sequencing and gene structure identification, one needs to be able to accurately align the sequence reads over intron boundaries. This represents a significant challenge given their short length and inherent high error rate. Results: We present a novel approach, called QPALMA, for computing accurate spliced alignments which takes advantage of the read's quality information as well as computational splice site predictions. Our method uses a training set of spliced reads with quality information and known alignments. It uses a large margin approach similar to support vector machines to estimate its parameters to maximize alignment accuracy. In computational experiments, we illustrate that the quality information as well as the splice site predictions help to improve the alignment quality. Finally, to facilitate mapping of massive amounts of sequencing data typically generated by the new technologies, we have combined our method with a fast mapping pipeline based on enhanced suffix arrays. Our algorithms were optimized and tested using reads produced with the Illumina Genome Analyzer for the model plant Arabidopsis thaliana. © The Author 2008. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "De Bona F."
                    },
                    {
                        "name": "Ossowski S."
                    },
                    {
                        "name": "Schneeberger K."
                    },
                    {
                        "name": "Ratsch G."
                    }
                ],
                "citationCount": 77,
                "date": "2008-08-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Optimal spliced alignments of short sequence reads"
            },
            "note": null,
            "pmcid": null,
            "pmid": "18689821",
            "type": null,
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Suite"
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1,
    "version": []
}