{
    "additionDate": "2020-01-14T09:16:24Z",
    "biotoolsCURIE": "biotools:dLight1",
    "biotoolsID": "dLight1",
    "confidence_flag": "high",
    "description": "Imaging neuromodulators with high spatiotemporal resolution using genetically encoded indicators.\n\nData/code file for Figure 3 and 4 (and relevant Supplementary Figures) in Patriarchi et al. Science 2018.\n\nFP_Session_Processing2.m: MATLAB code to load raw photometry data (recorded by TDT rigs, see methods in Patriarchi et al., Science 2018 and Cho et al., Neuron 2017) and process to calculate dF/F values.\n\nTo download data and code to generate figures in MATLAB, please click the link below: https://www.dropbox.com/sh/ghpzchf1jmragrh/AADbFcWRtARsWrD-DbTJYQrZa?dl=0",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://github.com/GradinaruLab/dLight1",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2020-01-14T09:16:24Z",
    "name": "dLight1",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1038/S41596-019-0239-2",
            "metadata": {
                "abstract": "© 2019, The Author(s), under exclusive licence to Springer Nature Limited.Multiple aspects of neural activity, from neuronal firing to neuromodulator release and signaling, underlie brain function and ultimately shape animal behavior. The recently developed and constantly growing toolbox of genetically encoded sensors for neural activity, including calcium, voltage, neurotransmitter and neuromodulator sensors, allows precise measurement of these signaling events with high spatial and temporal resolution. Here, we describe the engineering, characterization and application of our recently developed dLight1, a suite of genetically encoded dopamine (DA) sensors based on human inert DA receptors. dLight1 offers high molecular specificity, requisite affinity and kinetics and great sensitivity for measuring DA release in vivo. The detailed workflow described in this protocol can be used to systematically characterize and validate dLight1 in increasingly intact biological systems, from cultured cells to acute brain slices to behaving mice. For tool developers, we focus on characterizing five distinct properties of dLight1: dynamic range, affinity, molecular specificity, kinetics and interaction with endogenous signaling; for end users, we provide comprehensive step-by-step instructions for how to leverage fiber photometry and two-photon imaging to measure dLight1 transients in vivo. The instructions provided in this protocol are designed to help laboratory personnel with a broad range of experience (at the graduate or post-graduate level) to develop and utilize novel neuromodulator sensors in vivo, by using dLight1 as a benchmark.",
                "authors": [
                    {
                        "name": "Patriarchi T."
                    },
                    {
                        "name": "Cho J.R."
                    },
                    {
                        "name": "Merten K."
                    },
                    {
                        "name": "Marley A."
                    },
                    {
                        "name": "Broussard G.J."
                    },
                    {
                        "name": "Liang R."
                    },
                    {
                        "name": "Williams J."
                    },
                    {
                        "name": "Nimmerjahn A."
                    },
                    {
                        "name": "von Zastrow M."
                    },
                    {
                        "name": "Gradinaru V."
                    },
                    {
                        "name": "Tian L."
                    }
                ],
                "date": "2019-12-01T00:00:00Z",
                "journal": "Nature Protocols",
                "title": "Imaging neuromodulators with high spatiotemporal resolution using genetically encoded indicators"
            },
            "pmid": "31732722"
        }
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        }
    ]
}