{
    "additionDate": "2024-06-19T08:45:02.037038Z",
    "biotoolsCURIE": "biotools:xmarkerfinder",
    "biotoolsID": "xmarkerfinder",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "najiao@fudan.edu.cn",
            "name": "Na Jiao",
            "orcidid": "http://orcid.org/0000-0003-3976-6313"
        }
    ],
    "description": "Identification and validation of microbial biomarkers from cross-cohort datasets using xMarkerFinder.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "https://www.biosino.org/xmarkerfinder/",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2024-11-24T13:51:40.348249Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/tjcadd2020/xMarkerFinder"
        }
    ],
    "name": "xMarkerFinder",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1038/s41596-024-00999-9",
            "metadata": {
                "abstract": "Microbial signatures have emerged as promising biomarkers for disease diagnostics and prognostics, yet their variability across different studies calls for a standardized approach to biomarker research. Therefore, we introduce xMarkerFinder, a four-stage computational framework for microbial biomarker identification with comprehensive validations from cross-cohort datasets, including differential signature identification, model construction, model validation and biomarker interpretation. xMarkerFinder enables the identification and validation of reproducible biomarkers for cross-cohort studies, along with the establishment of classification models and potential microbiome-induced mechanisms. Originally developed for gut microbiome research, xMarkerFinder’s adaptable design makes it applicable to various microbial habitats and data types. Distinct from existing biomarker research tools that typically concentrate on a singular aspect, xMarkerFinder uniquely incorporates a sophisticated feature selection process, specifically designed to address the heterogeneity between different cohorts, extensive internal and external validations, and detailed specificity assessments. Execution time varies depending on the sample size, selected algorithm and computational resource. Accessible via GitHub (https://github.com/tjcadd2020/xMarkerFinder), xMarkerFinder supports users with diverse expertise levels through different execution options, including step-to-step scripts with detailed tutorials and frequently asked questions, a single-command execution script, a ready-to-use Docker image and a user-friendly web server (https://www.biosino.org/xmarkerfinder). The authors describe xMarkerFinder, a four-stage computational framework for microbial biomarker identification with comprehensive validations from cross-cohort datasets. xMarkerFinder is the first computational framework aggregating meta-analyses and machine learning models for the establishment and validation of universally robust microbial biomarkers across multiple cohorts.",
                "authors": [
                    {
                        "name": "Chen W."
                    },
                    {
                        "name": "Gao S."
                    },
                    {
                        "name": "Gao W."
                    },
                    {
                        "name": "Jiao N."
                    },
                    {
                        "name": "Li Q."
                    },
                    {
                        "name": "Li W."
                    },
                    {
                        "name": "Lin W."
                    },
                    {
                        "name": "Liu L."
                    },
                    {
                        "name": "Wu D."
                    },
                    {
                        "name": "Yin W."
                    },
                    {
                        "name": "Zhang G."
                    },
                    {
                        "name": "Zhu R."
                    },
                    {
                        "name": "Zhu X."
                    }
                ],
                "citationCount": 1,
                "date": "2024-09-01T00:00:00Z",
                "journal": "Nature Protocols",
                "title": "Identification and validation of microbial biomarkers from cross-cohort datasets using xMarkerFinder"
            },
            "pmid": "38745111"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Metatranscriptomics",
            "uri": "http://edamontology.org/topic_3941"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ]
}
