{
    "accessibility": "Open access",
    "additionDate": "2018-03-16T08:47:44Z",
    "biotoolsCURIE": "biotools:iembase",
    "biotoolsID": "iembase",
    "collectionID": [
        "Rare Disease"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Prof. Dr. Nenad Blau",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://iembase.org/contact-team.asp"
        }
    ],
    "description": "Inborn Errors of Metabolism Knowledgebase (IEMbase) accepts an array of biochemical and clinical symptoms from a user and returns a ranked list of possible IEM disorders that match the input profile. In addition, the system can explain the rationale of its results, suggest possible tests that would assist in narrowing down the differential diagnosis, and provide access to its database of biochemical, molecular, and clinical information if more evidence is desired.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Classification",
                    "uri": "http://edamontology.org/operation_2990"
                }
            ]
        }
    ],
    "homepage": "http://iembase.org/",
    "lastUpdate": "2020-06-16T10:55:22Z",
    "maturity": "Mature",
    "name": "IEMbase",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1007/s10545-017-0125-4",
            "metadata": {
                "abstract": "© 2018, The Author(s).Phenomics is the comprehensive study of phenotypes at every level of biology: from metabolites to organisms. With high throughput technologies increasing the scope of biological discoveries, the field of phenomics has been developing rapid and precise methods to collect, catalog, and analyze phenotypes. Such methods have allowed phenotypic data to be widely used in medical applications, from assisting clinical diagnoses to prioritizing genomic diagnoses. To channel the benefits of phenomics into the field of inborn errors of metabolism (IEM), we have recently launched IEMbase, an expert-curated knowledgebase of IEM and their disease-characterizing phenotypes. While our efforts with IEMbase have realized benefits, taking full advantage of phenomics requires a comprehensive curation of IEM phenotypes in core phenomics projects, which is dependent upon contributions from the IEM clinical and research community. Here, we assess the inclusion of IEM biochemical phenotypes in a core phenomics project, the Human Phenotype Ontology. We then demonstrate the utility of biochemical phenotypes using a text-based phenomics method to predict gene-disease relationships, showing that the prediction of IEM genes is significantly better using biochemical rather than clinical profiles. The findings herein provide a motivating goal for the IEM community to expand the computationally accessible descriptions of biochemical phenotypes associated with IEM in phenomics resources.",
                "authors": [
                    {
                        "name": "Blau N."
                    },
                    {
                        "name": "Gottlieb M.M."
                    },
                    {
                        "name": "Jones S.J.M."
                    },
                    {
                        "name": "Lee J.J.Y."
                    },
                    {
                        "name": "Lever J."
                    },
                    {
                        "name": "Wasserman W.W."
                    },
                    {
                        "name": "van Karnebeek C.D.M."
                    }
                ],
                "citationCount": 2,
                "date": "2018-05-01T00:00:00Z",
                "journal": "Journal of Inherited Metabolic Disease",
                "title": "Text-based phenotypic profiles incorporating biochemical phenotypes of inborn errors of metabolism improve phenomics-based diagnosis"
            },
            "pmcid": "PMC5959948",
            "pmid": "29340838",
            "type": [
                "Other"
            ]
        },
        {
            "doi": "10.1038/gim.2017.108",
            "metadata": {
                "abstract": "© American College of Medical Genetics and Genomics.PurposeRecognizing individuals with inherited diseases can be difficult because signs and symptoms often overlap those of common medical conditions. Focusing on inborn errors of metabolism (IEMs), we present a method that brings the knowledge of highly specialized experts to professionals involved in early diagnoses. We introduce IEMbase, an online expert-curated IEM knowledge base combined with a prototype diagnosis support (mini-expert) system.MethodsDisease-characterizing profiles of specific biochemical markers and clinical symptoms were extracted from an expert-compiled IEM database. A mini-expert system algorithm was developed using cosine similarity and semantic similarity. The system was evaluated using 190 retrospective cases with established diagnoses, collected from 15 different metabolic centers.ResultsIEMbase provides 530 well-defined IEM profiles and matches a user-provided phenotypic profile to a list of candidate diagnoses/genes. The mini-expert system matched 62% of the retrospective cases to the exact diagnosis and 86% of the cases to a correct diagnosis within the top five candidates. The use of biochemical features in IEM annotations resulted in 41% more exact phenotype matches than clinical features alone.ConclusionIEMbase offers a central IEM knowledge repository for many genetic diagnostic centers and clinical communities seeking support in the diagnosis of IEMs.",
                "authors": [
                    {
                        "name": "Blau N."
                    },
                    {
                        "name": "Hoffmann G.F."
                    },
                    {
                        "name": "Lee J.J.Y."
                    },
                    {
                        "name": "Van Karnebeek C.D.M."
                    },
                    {
                        "name": "Wasserman W.W."
                    }
                ],
                "citationCount": 31,
                "date": "2018-01-01T00:00:00Z",
                "journal": "Genetics in Medicine",
                "title": "Knowledge base and mini-expert platform for the diagnosis of inborn errors of metabolism"
            },
            "pmcid": "PMC5763153",
            "pmid": "28726811",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal",
        "Web application",
        "Web service"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        }
    ],
    "validated": 1
}
