{
    "additionDate": "2018-10-01T15:15:44Z",
    "biotoolsCURIE": "biotools:metlab",
    "biotoolsID": "metlab",
    "credit": [
        {
            "email": "julliette.hayer@slu.se",
            "name": "Julliette Hayer",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "MetLab is aimed at providing scientists with an integrated tool for experimental design and analysis of viral metagenomes.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/norling/metlab/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence alignment analysis (site correlation)",
                    "uri": "http://edamontology.org/operation_0449"
                }
            ]
        }
    ],
    "homepage": "https://github.com/norling/metlab",
    "language": [
        "Shell",
        "Python",
        "C"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/norling/metlab/issues"
        }
    ],
    "name": "MetLab",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0160334",
            "metadata": {
                "abstract": "© 2016 Norling et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Metagenomics, the sequence characterization of all genomes within a sample, is widely used as a virus discovery tool as well as a tool to study viral diversity of animals. Metagenomics can be considered to have three main steps; sample collection and preparation, sequencing and finally bioinformatics. Bioinformatic analysis of metagenomic datasets is in itself a complex process, involving few standardized methodologies, thereby hampering comparison of metagenomics studies between research groups. In this publication the new bioinformatics framework MetLab is presented, aimed at providing scientists with an integrated tool for experimental design and analysis of viral metagenomes. MetLab provides support in designing the metagenomics experiment by estimating the sequencing depth needed for the complete coverage of a species. This is achieved by applying a methodology to calculate the probability of coverage using an adaptation of Stevens' theorem. It also provides scientists with several pipelines aimed at simplifying the analysis of viral metagenomes, including; quality control, assembly and taxonomic binning. We also implement a tool for simulating metagenomics datasets from several sequencing platforms. The overall aim is to provide virologists with an easy to use tool for designing, simulating and analyzing viral metagenomes. The results presented here include a benchmark towards other existing software, with emphasis on detection of viruses as well as speed of applications. This is packaged, as comprehensive software, readily available for Linux and OSX users at https://github.com/norling/metlab.",
                "authors": [
                    {
                        "name": "Norling M."
                    },
                    {
                        "name": "Karlsson-Lindsjo O.E."
                    },
                    {
                        "name": "Gourle H."
                    },
                    {
                        "name": "Bongcam-Rudloff E."
                    },
                    {
                        "name": "Hayer J."
                    }
                ],
                "citationCount": 7,
                "date": "2016-08-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "MetLab: An in silico experimental design, simulation and analysis tool for viral metagenomics studies"
            },
            "pmcid": "PMC4968819",
            "pmid": "27479078",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Experimental design and studies",
            "uri": "http://edamontology.org/topic_3678"
        }
    ],
    "validated": 1
}