{
    "additionDate": "2021-01-18T06:58:54Z",
    "biotoolsCURIE": "biotools:comeback",
    "biotoolsID": "comeback",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "evan_gatev@sfu.ca",
            "name": "Evan Gatev",
            "typeEntity": "Person"
        }
    ],
    "description": "Co-Methylation with genomic CpG Background (CoMeBack) estimates DNA co-methylation, defined as proximal CpG probes with correlated DNAm across individuals. CoMeBack outputs co-methylated regions (CMRs), spanning sets of array probes constructed based on all genomic CpG sites, including those not measured on the array, and without any phenotypic variable inputs.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Gene methylation analysis",
                    "uri": "http://edamontology.org/operation_3207"
                },
                {
                    "term": "Promoter prediction",
                    "uri": "http://edamontology.org/operation_0440"
                }
            ]
        }
    ],
    "homepage": "https://bitbucket.org/flopflip/comeback",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-17T13:21:09Z",
    "name": "CoMeBack",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA049",
            "metadata": {
                "abstract": "© 2020 The Author(s). Published by Oxford University Press. All rights reserved.Motivation: High-dimensional DNA methylation (DNAm) array coverage, while sparse in the context of the entire DNA methylome, still constitutes a very large number of CpG probes. The ensuing multiple-test corrections affect the statistical power to detect associations, likely contributing to prevalent limited reproducibility. Array probes measuring proximal CpG sites often have correlated levels of DNAm that may not only be biologically meaningful but also imply statistical dependence and redundancy. New methods that account for such correlations between adjacent probes may enable improved specificity, discovery and interpretation of statistical associations in DNAm array data. Results: We developed a method named Co-Methylation with genomic CpG Background (CoMeBack) that estimates DNA co-methylation, defined as proximal CpG probes with correlated DNAm across individuals. CoMeBack outputs co-methylated regions (CMRs), spanning sets of array probes constructed based on all genomic CpG sites, including those not measured on the array, and without any phenotypic variable inputs. This approach can reduce the multiple-test correction burden, while enhancing the discovery and specificity of statistical associations. We constructed and validated CMRs in whole blood, using publicly available Illumina Infinium 450 K array data from over 5000 individuals. These CMRs were enriched for enhancer chromatin states, and binding site motifs for several transcription factors involved in blood physiology. We illustrated how CMR-based epigenome-wide association studies can improve discovery and reduce false positives for associations with chronological age.",
                "authors": [
                    {
                        "name": "Gatev E."
                    },
                    {
                        "name": "Gladish N."
                    },
                    {
                        "name": "Kobor M.S."
                    },
                    {
                        "name": "Mostafavi S."
                    }
                ],
                "citationCount": 4,
                "date": "2020-05-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "CoMeBack: DNA methylation array data analysis for co-methylated regions"
            },
            "pmid": "31985744"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
