{
    "additionDate": "2017-01-13T13:14:53Z",
    "biotoolsCURIE": "biotools:genoread",
    "biotoolsID": "genoread",
    "credit": [
        {
            "email": "peccoud@vt.edu",
            "name": "Jean Peccoud",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "GenoREAD is a web-based, sequence verification software that can be used to compare Sanger sequencing trace files against a reference sequence.  Users can either submit their sequencing results one clone at a time, or they can submit a series of clones (as a project) to run at once.  Results can be viewed online or downloaded.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://sourceforge.net/projects/genoread/files/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/projects/genoread/",
    "language": [
        "PHP",
        "JavaScript",
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "maturity": "Mature",
    "name": "GenoREAD",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Gene synthesis attempts to assemble user-defined DNA sequences with base-level precision. Verifying the sequences of construction intermediates and the final product of a gene synthesis project is a critical part of the workflow, yet one that has received the least attention. Sequence validation is equally important for other kinds of curated clone collections. Ensuring that the physical sequence of a clone matches its published sequence is a common quality control step performed at least once over the course of a research project. GenoREAD is a web-based application that breaks the sequence verification process into two steps: the assembly of sequencing reads and the alignment of the resulting contig with a reference sequence. GenoREAD can determine if a clone matches its reference sequence. Its sophisticated reporting features help identify and troubleshoot problems that arise during the sequence verification process. GenoREAD has been experimentally validated on thousands of gene-sized constructs from an ORFeome project, and on longer sequences including whole plasmids and synthetic chromosomes. Comparing GenoREAD results with those from manual analysis of the sequencing data demonstrates that GenoREAD tends to be conservative in its diagnostic. GenoREAD is available at www.genoread.org. © 2012 The Author(s). Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Wilson M.L."
                    },
                    {
                        "name": "Cai Y."
                    },
                    {
                        "name": "Hanlon R."
                    },
                    {
                        "name": "Taylor S."
                    },
                    {
                        "name": "Chevreux B."
                    },
                    {
                        "name": "Setubal J.C."
                    },
                    {
                        "name": "Tyler B.M."
                    },
                    {
                        "name": "Peccoud J."
                    }
                ],
                "citationCount": 9,
                "date": "2013-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Sequence verification of synthetic DNA by assembly of sequencing reads"
            },
            "pmid": "23042248"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}