{
    "additionDate": "2021-01-18T08:17:14Z",
    "biotoolsCURIE": "biotools:dimedr",
    "biotoolsID": "dimedr",
    "confidence_flag": "tool",
    "description": "DIMEDR (Disparate Metabolomics Data Reassembler) is a algorithm for agglomerating incongruent LC-MS metabolomics datasets. (DIMEDR) attempts to bridge the inconsistencies between incongruent LC-MS metabolomics datasets of the same biological sample type. A single “primary” dataset is postprocessed via traditional means of peak identification, alignment, and grouping. DIMEDR utilizes this primary dataset as a progenitor template by which data from subsequent disparate datasets are reassembled and integrated into a unified framework that maximizes spectral feature similarity across all samples. This is accomplished by a novel procedure for universal retention time correction and comparison via identification of ubiquitous features in the initial primary dataset, which are subsequently utilized as endogenous internal standards during integration.",
    "download": [
        {
            "type": "Downloads page",
            "url": "https://sites.google.com/a/georgetown.edu/fornace-lab-informatics/home/dimedr"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Retention time prediction",
                    "uri": "http://edamontology.org/operation_3633"
                },
                {
                    "term": "Spectral analysis",
                    "uri": "http://edamontology.org/operation_3214"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://chemdata.nist.gov/dokuwiki/doku.php?id=chemdata:dimedr",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-01T09:06:16Z",
    "name": "DIMEDR",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1021/ACS.ANALCHEM.9B05763",
            "metadata": {
                "abstract": "Copyright © 2020 American Chemical Society.In the past decade, the field of LC-MS-based metabolomics has transformed from an obscure specialty into a major \"-omics\"platform for studying metabolic processes and biomolecular characterization. However, as a whole the field is still very fractured, as the nature of the instrumentation and the information produced by the platform essentially creates incompatible \"islands\"of datasets. This lack of data coherency results in the inability to accumulate a critical mass of metabolomics data that has enabled other -omics platforms to make impactful discoveries and meaningful advances. As such, we have developed a novel algorithm, called Disparate Metabolomics Data Reassembler (DIMEDR), which attempts to bridge the inconsistencies between incongruent LC-MS metabolomics datasets of the same biological sample type. A single \"primary\"dataset is postprocessed via traditional means of peak identification, alignment, and grouping. DIMEDR utilizes this primary dataset as a progenitor template by which data from subsequent disparate datasets are reassembled and integrated into a unified framework that maximizes spectral feature similarity across all samples. This is accomplished by a novel procedure for universal retention time correction and comparison via identification of ubiquitous features in the initial primary dataset, which are subsequently utilized as endogenous internal standards during integration. For demonstration purposes, two human and two mouse urine metabolomics datasets from four unrelated studies acquired over 4 years were unified via DIMEDR, which enabled meaningful analysis across otherwise incomparable and unrelated datasets.",
                "authors": [
                    {
                        "name": "Goudarzi M."
                    },
                    {
                        "name": "Laiakis E.C."
                    },
                    {
                        "name": "Mak T.D."
                    },
                    {
                        "name": "Stein S.E."
                    }
                ],
                "citationCount": 3,
                "date": "2020-04-07T00:00:00Z",
                "journal": "Analytical Chemistry",
                "title": "Disparate Metabolomics Data Reassembler: A Novel Algorithm for Agglomerating Incongruent LC-MS Metabolomics Datasets"
            },
            "pmid": "32118408"
        }
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
