{
    "additionDate": "2017-08-03T18:44:21Z",
    "biotoolsCURIE": "biotools:gift",
    "biotoolsID": "gift",
    "credit": [
        {
            "email": "zsp07@mails.tsinghua.edu.cn",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "C++ package to infer the chemogenomic features from drug-target interactions.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bioinfo.au.tsinghua.edu.cn/software/GIFT/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.au.tsinghua.edu.cn/software/GIFT/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/gift-global-optimization-based-inference-of-chemogenomic-features-from-drug-target-interactions.html"
        }
    ],
    "name": "GIFT",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© The Author 2015. Published by Oxford University Press. All rights reserved.Motivation: Gaining insight into chemogenomic drug-target interactions, such as those involving the substructures of synthetic drugs and protein domains, is important in fragment-based drug discovery and drug repositioning. Previous studies evaluated the interactions locally, thereby ignoring the competitive effects of different substructures or domains, but this could lead to high false-positive estimation, calling for a computational method that presents more predictive power. Results: A statistical model, termed Global optimization-based InFerence of chemogenomic features from drug-Target interactions, or GIFT, is proposed herein to evaluate substructure-domain interactions globally such that all substructure-domain contributions to drug-target interaction are analyzed simultaneously. Combinations of different chemical substructures were included since they may function as one unit. When compared to previous methods, GIFT showed better interpretive performance, and performance for the recovery of drug-target interactions was good. Among 53 known drug-domain interactions, 81% were accurately predicted by GIFT. Eighteen of the top 100 predicted combined substructure-domain interactions had corresponding drug-target structures in the Protein Data Bank database, and 15 out of the 18 had been proved. GIFT was then implemented to predict substructure-domain interactions based on drug repositioning. For example, the anticancer activities of tazarotene, adapalene, acitretin and raloxifene were identified. In summary, GIFT is a global chemogenomic inference approach and offers fresh insight into drug-target interactions.",
                "authors": [
                    {
                        "name": "Zu S."
                    },
                    {
                        "name": "Chen T."
                    },
                    {
                        "name": "Li S."
                    }
                ],
                "citationCount": 15,
                "date": "2015-08-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Global optimization-based inference of chemogenomic features from drug-target interactions"
            },
            "pmid": "25819672"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        }
    ],
    "validated": 1
}