{
    "additionDate": "2017-08-03T18:56:47Z",
    "biotoolsCURIE": "biotools:pseknc",
    "biotoolsID": "pseknc",
    "credit": [
        {
            "email": "leitianyu.china@gmail.com",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Represent a DNA or RNA sequence with a discrete model or vector yet still keep considerable sequence order information, particularly the global or long-range sequence order information, via the physicochemical properties of its constituent oligonucleotides.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://lin.uestc.edu.cn/pseknc/readme.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid sequence analysis",
                    "uri": "http://edamontology.org/operation_2478"
                }
            ]
        }
    ],
    "homepage": "http://lin.uestc.edu.cn/pseknc/default.aspx",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:43Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/pseknc-generating-pseudo-k-tuple-nucleotide-composition.html"
        }
    ],
    "name": "PseKNC",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "The pseudo oligonucleotide composition, or pseudo K-tuple nucleotide composition (PseKNC), can be used to represent a DNA or RNA sequence with a discrete model or vector yet still keep considerable sequence order information, particularly the global or long-range sequence order information, via the physicochemical properties of its constituent oligonucleotides. Therefore, the PseKNC approach may hold very high potential for enhancing the power in dealing with many problems in computational genomics and genome sequence analysis. However, dealing with different DNA or RNA problems may need different kinds of PseKNC. Here, we present a flexible and user-friendly web server for PseKNC (at http://lin.uestc.edu.cn/pseknc/default.aspx) by which users can easily generate many different modes of PseKNC according to their need by selecting various parameters and physicochemical properties. Furthermore, for the convenience of the vast majority of experimental scientists, a step-by-step guide is provided on how to use the current web server to generate their desired PseKNC without the need to follow the complicated mathematical equations, which are presented in this article just for the integrity of PseKNC formulation and its development. It is anticipated that the PseKNC web server will become a very useful tool in computational genomics and genome sequence analysis. © 2014 Elsevier Inc. All rights reserved.",
                "authors": [
                    {
                        "name": "Chen W."
                    },
                    {
                        "name": "Lei T.-Y."
                    },
                    {
                        "name": "Jin D.-C."
                    },
                    {
                        "name": "Lin H."
                    },
                    {
                        "name": "Chou K.-C."
                    }
                ],
                "citationCount": 324,
                "date": "2014-07-01T00:00:00Z",
                "journal": "Analytical Biochemistry",
                "title": "PseKNC: A flexible web server for generating pseudo K-tuple nucleotide composition"
            },
            "pmid": "24732113"
        }
    ],
    "toolType": [
        "Web application",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}