{
    "additionDate": "2020-01-14T20:10:18Z",
    "biotoolsCURIE": "biotools:3DSlicer_autogenerated",
    "biotoolsID": "3DSlicer_autogenerated",
    "confidence_flag": "low",
    "description": "In-House Surgeon-Led Virtual Surgical Planning for Maxillofacial Reconstruction.\n\nPURPOSE:Virtual surgical planning (VSP) and custom fabricated cutting guides for maxillofacial reconstruction have been shown to improve the accuracy of bony reconstruction and overall surgical efficiency and decrease the ischemia time. Our aim was to describe an in-house VSP technique for maxillofacial reconstructive procedures. MATERIALS AND METHODS:We used 2 free software applications. 3DSlicer (available at: http: www. 3dslicer.org) was used to extract the bones of interest for the recipient and the donor sites from the computed tomography scan's DICOM (digital imaging and communications in medicine) data. The Autodesk Meshmixer (Autodesk Inc, San Rafael, CA) was used to perform VSP and fabrication of the cutting guides.\n\n||| HOMEPAGE BROKEN!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'VSP', 'in-house VSP', 'maxillofacial'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                }
            ]
        }
    ],
    "homepage": "http://www.3dslicer.org",
    "lastUpdate": "2020-01-14T20:10:18Z",
    "name": "3DSlicer_autogenerated",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.JOMS.2019.11.013",
            "metadata": {
                "abstract": "© 2019 American Association of Oral and Maxillofacial SurgeonsPurpose: Virtual surgical planning (VSP) and custom fabricated cutting guides for maxillofacial reconstruction have been shown to improve the accuracy of bony reconstruction and overall surgical efficiency and decrease the ischemia time. Our aim was to describe an in-house VSP technique for maxillofacial reconstructive procedures. Materials and Methods: We used 2 free software applications. 3DSlicer (available at: http://www.3dslicer.org) was used to extract the bones of interest for the recipient and the donor sites from the computed tomography scan's DICOM (digital imaging and communications in medicine) data. The Autodesk Meshmixer (Autodesk Inc, San Rafael, CA) was used to perform VSP and fabrication of the cutting guides. A reconstructed jaw model was printed in-house using a commercially available fused deposition modeling-based desktop 3-dimensional (3D) printer (Qidi Technology, Zhejiang, China) and used to prebend the reconstruction plate. The cutting guides were printed using a commercially available resin-based stereolithography apparatus desktop 3D printer (Form 2, Dental SG Resin; Formlabs, Somerville, MA) to allow for sterilization of the guides. We performed this technique for 19 consecutive patients with maxillofacial benign or malignant tumors requiring microvascular bony reconstruction. We calculated the average time and associated costs using this in-house VSP technique. Results: The technique was found to be simple and repeatable. The average time required for VSP was 158 minutes (2 hours, 38 minutes). The average cost for printing the reconstructed model per case was $5.21 Canadian dollars (CAD), and the average cost for printing the cutting guides per case was $12.80 CAD. Conclusions: Using this technique, in-house VSP and 3D printing can be performed by the treating surgeon, without an engineering background, within a reasonable period.",
                "authors": [
                    {
                        "name": "Abo Sharkh H."
                    },
                    {
                        "name": "Makhoul N."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Journal of Oral and Maxillofacial Surgery",
                "title": "In-House Surgeon-Led Virtual Surgical Planning for Maxillofacial Reconstruction"
            },
            "pmid": "31843280"
        }
    ],
    "topic": [
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        }
    ]
}