
{
    "credit": [
        {
            "email": "help@predictprotein.org",
            "name": "PredictProtein Support",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://open.predictprotein.org/tutorials"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein secondary structure prediction (helices)",
                    "uri": "http://edamontology.org/operation_0468"
                },
                {
                    "term": "Protein fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Structure prediction",
                "uri": "http://edamontology.org/topic_0082"
            },
            {
                "term": "Protein folds and structural domains",
                "uri": "http://edamontology.org/topic_0736"
            },
            {
                "term": "Sequence sites, features and motifs",
                "uri": "http://edamontology.org/topic_0160"
            },
            {
                "term": "Protein structural motifs and surfaces",
                "uri": "http://edamontology.org/topic_0166"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            }
        ]
    },
    "publication": [
        {
            "abstract": "The META-PP server (http://cubic.bioc.columbia.edu/meta/) simplifies access to a battery of public protein structure and function prediction servers by providing a common and stable web-based interface. The goal is to make these powerful and increasingly essential methods more readily available to non-expert users and the bioinformatics community at large. At present META-PP provides access to a selected set of high-quality servers in the areas of comparative modelling, threading/fold recognition, secondary structure prediction and more specialized fields like contact and function prediction.",
            "authors": [
                "Eyrich V.A.",
                "Rost B."
            ],
            "cit_count": 13,
            "journal": "Nucleic Acids Research",
            "pmid": "12824314",
            "title": "META-PP: Single interface to crucial prediction servers",
            "year": "2003-07-01"
        },
        {
            "abstract": "PredictProtein (http://www.predictprotein.org) is an Internet service for sequence analysis and the prediction of protein structure and function. Users submit protein sequences or alignments; PredictProtein returns multiple sequence alignments, PROSITE sequence motifs, low-complexity regions (SEG), nuclear localization signals, regions lacking regular structure (NORS) and predictions of secondary structure, solvent accessibility, globular regions, transmembrane helices, coiled-coil regions, structural switch regions, disulfide-bonds, sub-cellular localization and functional annotations. Upon request fold recognition by prediction-based threading, CHOP domain assignments, predictions of transmembrane strands and inter-residue contacts are also available. For all services, users can submit their query either by electronic mail or interactively via the World Wide Web. © Oxford University Press 2004; all rights reserved.",
            "authors": [
                "Rost B.",
                "Yachdav G.",
                "Liu J."
            ],
            "cit_count": 1069,
            "journal": "Nucleic Acids Research",
            "pmid": "15215403",
            "title": "The PredictProtein server",
            "year": "2004-07-01"
        },
        {
            "abstract": "PredictProtein (PP, http://cubic.bioc.columbia.edu/pp/) is an internet service for sequence analysis and the prediction of aspects of protein structure and function. Users submit protein sequence or alignments; the server returns a multiple sequence alignment, PROSITE sequence motifs, low-complexity regions (SEG), ProDom domain assignments, nuclear localisation signals, regions lacking regular structure and predictions of secondary structure, solvent accessibility, globular regions, transmembrane helices, coiled-coil regions, structural switch regions and disulfide-bonds. Upon request, fold recognition by prediction-based threading is available. For all services, users can submit their query either by electronic mail or interactively from World Wide Web.",
            "authors": [
                "Rost B.",
                "Liu J."
            ],
            "cit_count": 162,
            "journal": "Nucleic Acids Research",
            "pmid": "12824312",
            "title": "The PredictProtein server",
            "year": "2003-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:predictprotein",
        "biotoolsID": "predictprotein",
        "description": "PredictProtein is a protein sequence analysis and structure prediction tool.  Users provide a protein sequence, and PredictProtein reports similar sequences, PROSITE sequence motifs, and various types of structure prediction information.  You can also use META PredictProtein to submit a sequence to one web form and query several other servers at once, retrieving the results by e-mail.",
        "homepage": "http://ppopen.rostlab.org",
        "name": "PredictProtein"
    }
}