{
    "additionDate": "2016-03-13T10:40:33Z",
    "biotoolsCURIE": "biotools:hapcol",
    "biotoolsID": "hapcol",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "ELIXIR-ITA-BICOCCA",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "bonizzoni@disco.unimib.it",
            "name": "Bonizzoni Paola",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A fast and memory-efficient method for haplotype assembly from long gapless reads, like those produced by SMRT sequencing technologies (PacBio RS II) and Oxford Nanopore flow cell technologies (MinION).",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://hapcol.algolab.eu/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "note": "Haplotype assembly",
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "http://hapcol.algolab.eu/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "license": "GPL-2.0",
    "maturity": "Emerging",
    "name": "HapCol",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "ELIXIR-ITA-BICOCCA",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btv495",
            "metadata": {
                "abstract": "© 2015 The Author 2015. Published by Oxford University Press. All rights reserved.Motivation: Haplotype assembly is the computational problem of reconstructing haplotypes in diploid organisms and is of fundamental importance for characterizing the effects of single-nucleotide polymorphisms on the expression of phenotypic traits. Haplotype assembly highly benefits from the advent of 'future-generation' sequencing technologies and their capability to produce long reads at increasing coverage. Existing methods are not able to deal with such data in a fully satisfactory way, either because accuracy or performances degrade as read length and sequencing coverage increase or because they are based on restrictive assumptions. Results: By exploiting a feature of future-generation technologies - the uniform distribution of sequencing errors - we designed an exact algorithm, called HapCol, that is exponential in the maximum number of corrections for each single-nucleotide polymorphism position and that minimizes the overall error-correction score. We performed an experimental analysis, comparing HapCol with the current state-of-the-art combinatorial methods both on real and simulated data. On a standard benchmark of real data, we show that HapCol is competitive with state-of-the-art methods, improving the accuracy and the number of phased positions. Furthermore, experiments on realistically simulated datasets revealed that HapCol requires significantly less computing resources, especially memory. Thanks to its computational efficiency, HapCol can overcome the limits of previous approaches, allowing to phase datasets with higher coverage and without the traditional all-heterozygous assumption. Availability and implementation: Our source code is available under the terms of the GNU General Public License at http://hapcol.algolab.eu/. Supplementary information: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Pirola Y."
                    },
                    {
                        "name": "Zaccaria S."
                    },
                    {
                        "name": "Dondi R."
                    },
                    {
                        "name": "Klau G.W."
                    },
                    {
                        "name": "Pisanti N."
                    },
                    {
                        "name": "Bonizzoni P."
                    }
                ],
                "citationCount": 26,
                "date": "2016-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "HapCol: Accurate and memory-efficient haplotype assembly from long reads"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ],
    "validated": 1,
    "version": [
        "1.1.1"
    ]
}