{
    "accessibility": "Open access",
    "additionDate": "2024-05-18T14:24:14.106623Z",
    "biotoolsCURIE": "biotools:glycomb",
    "biotoolsID": "glycomb",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "kkiyoko@soka.ac.jp",
            "name": "Kiyoko F. Aoki-Kinoshita",
            "typeEntity": "Person"
        },
        {
            "name": "Yushi Takahashi",
            "typeEntity": "Person"
        }
    ],
    "description": "A novel glycoconjugate data repository that bridges glycomics and proteomics.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://glycomb.glycosmos.org",
    "lastUpdate": "2024-05-18T14:24:14.108676Z",
    "name": "GlyComb",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/j.jbc.2023.105624",
            "metadata": {
                "abstract": "The glycosylation of proteins and lipids is known to be closely related to the mechanisms of various diseases such as influenza, cancer, and muscular dystrophy. Therefore, it has become clear that the analysis of post-translational modifications of proteins, including glycosylation, is important to accurately understand the functions of each protein molecule and the interactions among them. In order to conduct large-scale analyses more efficiently, it is essential to promote the accumulation, sharing, and reuse of experimental and analytical data in accordance with the FAIR (Findability, Accessibility, Interoperability, and Re-usability) data principles. However, a FAIR data repository for storing and sharing glycoconjugate information, including glycopeptides and glycoproteins, in a standardized format did not exist. Therefore, we have developed GlyComb (https://glycomb.glycosmos.org) as a new standardized data repository for glycoconjugate data. Currently, GlyComb can assign a unique identifier to a set of glycosylation information associated with a specific peptide sequence or UniProt ID. By standardizing glycoconjugate data via GlyComb identifiers and coordinating with existing web resources such as GlyTouCan and GlycoPOST, a comprehensive system for data submission and data sharing among researchers can be established. Here we introduce how GlyComb is able to integrate the variety of glycoconjugate data already registered in existing data repositories to obtain a better understanding of the available glycopeptides and glycoproteins, and their glycosylation patterns. We also explain how this system can serve as a foundation for a better understanding of glycan function.",
                "authors": [
                    {
                        "name": "Aoki-Kinoshita K.F."
                    },
                    {
                        "name": "Fujita A."
                    },
                    {
                        "name": "Shiota M."
                    },
                    {
                        "name": "Takahashi Y."
                    },
                    {
                        "name": "Yamada I."
                    }
                ],
                "date": "2024-02-01T00:00:00Z",
                "journal": "Journal of Biological Chemistry",
                "title": "GlyComb: A novel glycoconjugate data repository that bridges glycomics and proteomics"
            },
            "pmcid": "PMC10850976",
            "pmid": "38176651"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Biochemistry",
            "uri": "http://edamontology.org/topic_3292"
        },
        {
            "term": "Lipids",
            "uri": "http://edamontology.org/topic_0153"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ]
}
