
{
    "credit": [
        {
            "email": "Manuel.Garber@umassmed.edu",
            "name": "Manuel Garber",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://slncky.github.io/usage.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence motif discovery",
                    "uri": "http://edamontology.org/operation_0238"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "license": "MIT",
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Functional, regulatory and non-coding RNA",
                "uri": "http://edamontology.org/topic_0659"
            },
            {
                "term": "Evolutionary biology",
                "uri": "http://edamontology.org/topic_3299"
            },
            {
                "term": "Zoology",
                "uri": "http://edamontology.org/topic_3500"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2016 Chen et al. Background: Recent advances in transcriptome sequencing have enabled the discovery of thousands of long non-coding RNAs (lncRNAs) across many species. Though several lncRNAs have been shown to play important roles in diverse biological processes, the functions and mechanisms of most lncRNAs remain unknown. Two significant obstacles lie between transcriptome sequencing and functional characterization of lncRNAs: identifying truly non-coding genes from de novo reconstructed transcriptomes, and prioritizing the hundreds of resulting putative lncRNAs for downstream experimental interrogation. Results: We present slncky, a lncRNA discovery tool that produces a high-quality set of lncRNAs from RNA-sequencing data and further uses evolutionary constraint to prioritize lncRNAs that are likely to be functionally important. Our automated filtering pipeline is comparable to manual curation efforts and more sensitive than previously published computational approaches. Furthermore, we developed a sensitive alignment pipeline for aligning lncRNA loci and propose new evolutionary metrics relevant for analyzing sequence and transcript evolution. Our analysis reveals that evolutionary selection acts in several distinct patterns, and uncovers two notable classes of intergenic lncRNAs: one showing strong purifying selection on RNA sequence and another where constraint is restricted to the regulation but not the sequence of the transcript. Conclusion: Our results highlight that lncRNAs are not a homogenous class of molecules but rather a mixture of multiple functional classes with distinct biological mechanism and/or roles. Our novel comparative methods for lncRNAs reveals 233 constrained lncRNAs out of tens of thousands of currently annotated transcripts, which we make available through the slncky Evolution Browser.",
            "authors": [
                "Chen J.",
                "Shishkin A.A.",
                "Zhu X.",
                "Kadri S.",
                "Maza I.",
                "Guttman M.",
                "Hanna J.H.",
                "Regev A.",
                "Garber M."
            ],
            "cit_count": 38,
            "doi": "10.1186/s13059-016-0880-9",
            "journal": "Genome Biology",
            "title": "Evolutionary analysis across mammals reveals distinct classes of long non-coding RNAs",
            "year": "2016-02-02"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:slncky",
        "biotoolsID": "slncky",
        "description": "Filters a high-quality set of lncRNA from reconstructed RNA-seq data and searches for conserved lncRNAs using a sensitive noncoding aligning method.",
        "homepage": "http://slncky.github.io/",
        "name": "slncky"
    }
}