{
    "additionDate": "2017-08-03T18:55:51Z",
    "biotoolsCURIE": "biotools:phyre",
    "biotoolsID": "phyre",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.sbg.bio.ic.ac.uk/contact.html"
        }
    ],
    "description": "Major update to the original Phyre server. The new system is designed around the idea that you have a protein sequence/gene and want to predict its three-dimensional (3D) structure. It uses the alignment of hidden Markov models via HHsearch1 to significantly improve accuracy of alignment and detection rate.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.sbg.bio.ic.ac.uk/phyre2/workshops/2017/Cambridge/worked_examples.html"
        }
    ],
    "editPermission": {
        "authors": [
            "sergitobara"
        ],
        "type": "group"
    },
    "elixirNode": [
        "UK"
    ],
    "elixirPlatform": [
        "Tools"
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Sequence profile alignment",
                    "uri": "http://edamontology.org/operation_0300"
                }
            ]
        }
    ],
    "homepage": "http://www.sbg.bio.ic.ac.uk/phyre2/html/page.cgi?id=index",
    "lastUpdate": "2022-07-11T14:48:24.764413Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/phyre-2-0-protein-homologyanalogy-recognition-engine.html"
        }
    ],
    "name": "Phyre",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1038/nprot.2015.053",
            "metadata": {
                "abstract": "© 2015 Nature Publishing Group, a division of Macmillan Publishers Limited.Phyre2 is a suite of tools available on the web to predict and analyze protein structure, function and mutations. The focus of Phyre2 is to provide biologists with a simple and intuitive interface to state-of-the-art protein bioinformatics tools. Phyre2 replaces Phyre, the original version of the server for which we previously published a paper in Nature Protocols. In this updated protocol, we describe Phyre2, which uses advanced remote homology detection methods to build 3D models, predict ligand binding sites and analyze the effect of amino acid variants (e.g., nonsynonymous SNPs (nsSNPs)) for a user's protein sequence. Users are guided through results by a simple interface at a level of detail they determine. This protocol will guide users from submitting a protein sequence to interpreting the secondary and tertiary structure of their models, their domain composition and model quality. A range of additional available tools is described to find a protein structure in a genome, to submit large number of sequences at once and to automatically run weekly searches for proteins that are difficult to model. The server is available at http://www.sbg.bio.ic.ac.uk/phyre2. A typical structure prediction will be returned between 30 min and 2 h after submission.",
                "authors": [
                    {
                        "name": "Kelley L.A."
                    },
                    {
                        "name": "Mezulis S."
                    },
                    {
                        "name": "Sternberg M.J.E."
                    },
                    {
                        "name": "Wass M.N."
                    },
                    {
                        "name": "Yates C.M."
                    }
                ],
                "citationCount": 5497,
                "date": "2015-06-30T00:00:00Z",
                "journal": "Nature Protocols",
                "title": "The Phyre2 web portal for protein modeling, prediction and analysis"
            },
            "pmcid": "PMC5298202",
            "pmid": "25950237"
        },
        {
            "doi": "10.1038/nprot.2009.2",
            "metadata": {
                "abstract": "Determining the structure and function of a novel protein is a cornerstone of many aspects of modern biology. Over the past decades, a number of computational tools for structure prediction have been developed. It is critical that the biological community is aware of such tools and is able to interpret their results in an informed way. This protocol provides a guide to interpreting the output of structure prediction servers in general and one such tool in particular, the protein homology/analogy recognition engine (Phyre). New profile-profile matching algorithms have improved structure prediction considerably in recent years. Although the performance of Phyre is typical of many structure prediction systems using such algorithms, all these systems can reliably detect up to twice as many remote homologies as standard sequence-profile searching. Phyre is widely used by the biological community, with > 150 submissions per day, and provides a simple interface to results. Phyre takes 30 min to predict the structure of a 250-residue protein. © 2009 Macmillan Publishers Limited. All rights reserved.",
                "authors": [
                    {
                        "name": "Kelley L.A."
                    },
                    {
                        "name": "Sternberg M.J.E."
                    }
                ],
                "citationCount": 3508,
                "date": "2009-01-01T00:00:00Z",
                "journal": "Nature Protocols",
                "title": "Protein structure prediction on the web: A case study using the phyre server"
            },
            "pmid": "19247286"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}
