{
    "accessibility": "Open access",
    "additionDate": "2023-03-09T14:23:31.826793Z",
    "biotoolsCURIE": "biotools:clusterseg",
    "biotoolsID": "clusterseg",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Dinggang Shen"
        }
    ],
    "description": "A nucleus segmentation framework, namely ClusterSeg, to tackle nuclei clusters, which consists of a convolutional-transformer hybrid encoder and a 2.5-path decoder for precise predictions of nuclei instance mask, contours, and clustered-edges.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Microscope image visualisation",
                    "uri": "http://edamontology.org/operation_3552"
                }
            ]
        }
    ],
    "homepage": "https://github.com/lu-yizhou/ClusterSeg",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-03-09T14:23:31.832668Z",
    "license": "Not licensed",
    "name": "ClusterSeg",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.MEDIA.2023.102758",
            "metadata": {
                "abstract": "The detection and segmentation of individual cells or nuclei is often involved in image analysis across a variety of biology and biomedical applications as an indispensable prerequisite. However, the ubiquitous presence of crowd clusters with morphological variations often hinders successful instance segmentation. In this paper, nuclei cluster focused annotation strategies and frameworks are proposed to overcome this challenging practical problem. Specifically, we design a nucleus segmentation framework, namely ClusterSeg, to tackle nuclei clusters, which consists of a convolutional-transformer hybrid encoder and a 2.5-path decoder for precise predictions of nuclei instance mask, contours, and clustered-edges. Additionally, an annotation-efficient clustered-edge pointed strategy pinpoints the salient and error-prone boundaries, where a partially-supervised PS-ClusterSeg is presented using ClusterSeg as the segmentation backbone. The framework is evaluated with four privately curated image sets and two public sets with characteristic severely clustered nuclei across a variety range of image modalities, e.g., microscope, cytopathology, and histopathology images. The proposed ClusterSeg and PS-ClusterSeg are modality-independent and generalizable, and superior to current state-of-the-art approaches in multiple metrics empirically. Our collected data, the elaborate annotations to both public and private set, as well the source code, are released publicly at https://github.com/lu-yizhou/ClusterSeg.",
                "authors": [
                    {
                        "name": "Guo Y."
                    },
                    {
                        "name": "Huang J."
                    },
                    {
                        "name": "Huang Q."
                    },
                    {
                        "name": "Jiang F."
                    },
                    {
                        "name": "Ke J."
                    },
                    {
                        "name": "Liang X."
                    },
                    {
                        "name": "Liu S."
                    },
                    {
                        "name": "Lu Y."
                    },
                    {
                        "name": "Shen D."
                    },
                    {
                        "name": "Shen Y."
                    },
                    {
                        "name": "Wei Z."
                    },
                    {
                        "name": "Yao J."
                    },
                    {
                        "name": "Zhou Y."
                    },
                    {
                        "name": "Zhu J."
                    }
                ],
                "date": "2023-04-01T00:00:00Z",
                "journal": "Medical Image Analysis",
                "title": "ClusterSeg: A crowd cluster pinpointed nucleus segmentation framework with cross-modality datasets"
            },
            "pmid": "36731275"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
