{"credit":[],"labels":{"collectionID":["JIB.tools"]},"link":[{"note":"CmPIweb@JIB.tools - a web registry of tools published in the Journal of Integrative Bioinformatics","type":"SOFTWARE_CATALOGUE","url":"https://jib.tools/details.php?id=46"}],"publication":[{"abstract":"The CELLmicrocosmos 4.2 PathwayIntegration (CmPI) is a tool which provides hybrid-dimensional visualization and analysis of intracellular protein and gene localizations in the context of a virtual 3D environment. This tool is developed based on Java/Java3D/JOGL and provides a standalone application compatible to all relevant operating systems. However, it requires Java and the local installation of the software. Here we present the prototype of an alternative web-based visualization approach, using Three.js and D3.js. In this way it is possible to visualize and explore CmPI-generated localization scenarios including networks mapped to 3D cell components by just providing a URL to a collaboration partner. This publication describes the integration of the different technologies &ndash; Three.js, D3.js and PHP &ndash; as well as an application case: a localization scenario of the citrate cycle. The CmPI web viewer is available at: http://CmPIweb.CELLmicrocosmos.org.","authors":["Kovanci G.","Ghaffar M.","Sommer B."],"cit_count":0,"doi":"10.2390/biecoll-jib-2016-298","journal":"Journal of integrative bioinformatics","pmid":"28187414","title":"Web-based hybrid-dimensional Visualization and Exploration of Cytological Localization Scenarios","type":"Other","year":"2016-12-21"}],"summary":{"biotoolsCURIE":"biotools:CmPIweb","biotoolsID":"CmPIweb","description":"The CELLmicrocosmos 4.2 PathwayIntegration (CmPI) is a tool which provides hybrid-dimensional visualization and analysis of intracellular protein and gene localizations in the context of a virtual 3D environment. This tool is developed based on Java/Java3D/JOGL and provides a standalone application compatible to all relevant operating systems. However, it requires Java and the local installation of the software. Here we present the prototype of an alternative web-based visualization approach, using Three.js and D3.js. In this way it is possible to visualize and explore CmPI-generated localization scenarios including networks mapped to 3D cell components by just providing a URL to a collaboration partner. This publication describes the integration of the different technologies – Three.js, D3.js and PHP – as well as an application case: a localization scenario of the citrate cycle. The CmPI web viewer is available at: http://CmPIweb.CELLmicrocosmos.org.","homepage":"http://CmPIweb.CELLmicrocosmos.org","name":"CmPIweb"}}