{
    "additionDate": "2020-01-09T18:01:15Z",
    "biotoolsCURIE": "biotools:Legofit",
    "biotoolsID": "Legofit",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "rogers@anthro.utah.edu",
            "name": "Alan R. Rogers",
            "orcidid": "https://orcid.org/0000-0003-3987-3346",
            "typeEntity": "Person"
        }
    ],
    "description": "Estimating population history from genetic data.\n\nEstimate population history parameters from site pattern frequencies.\n\nLegofit is a computer package that uses counts of nucleotide site patterns to estimate the history of population size, subdivision, and gene flow.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/alanrogers/legofit",
    "language": [
        "C"
    ],
    "lastUpdate": "2020-12-22T10:37:27Z",
    "name": "Legofit",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3154-1",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Our current understanding of archaic admixture in humans relies on statistical methods with large biases, whose magnitudes depend on the sizes and separation times of ancestral populations. To avoid these biases, it is necessary to estimate these parameters simultaneously with those describing admixture. Genetic estimates of population histories also confront problems of statistical identifiability: different models or different combinations of parameter values may fit the data equally well. To deal with this problem, we need methods of model selection and model averaging, which are lacking from most existing software. Results: The Legofit software package allows simultaneous estimation of parameters describing admixture, and the sizes and separation times of ancestral populations. It includes facilities for data manipulation, estimation, analysis of residuals, model selection, and model averaging. Conclusions: Legofit uses genetic data to study the history of a subdivided population. It is unaffected by recent history and can therefore focus on the deep history of population size, subdivision, and admixture. It outperforms several statistical methods that have been widely used to study population history and should be useful in any species for which DNA sequence data is available from several populations.",
                "authors": [
                    {
                        "name": "Rogers A.R."
                    }
                ],
                "citationCount": 1,
                "date": "2019-10-28T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Legofit: Estimating population history from genetic data"
            },
            "pmcid": "PMC6819480",
            "pmid": "31660852"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        }
    ],
    "validated": 1
}
