{
    "additionDate": "2019-11-14T18:46:40Z",
    "biotoolsCURIE": "biotools:DHH_hearing_bilingual_learners",
    "biotoolsID": "DHH_hearing_bilingual_learners",
    "confidence_flag": "very low",
    "description": "> VERY_LOW CONFIDENCE! | > HOMEPAGE MISSING! | > CORRECT NAME OF TOOL COULD ALSO BE 'hearing bilingual learners', 'DHH hearing bilingual', 'bilingual learners', 'DHH learners' | Evidence-Based Interventions for Learners Who Are Deaf and/or Multilingual | Purpose Many educators and speech-language pathologists have difficulty providing effective interventions to the growing population of d Deaf and hard-of-hearing (DHH) learners who use more than 1 language. The purpose of this review article was to identify evidence-based interventions for speech, language, and literacy used with DHH multilingual learners (DMLs), monolingual DHH learners, and hearing bilingual learners without hearing loss. Interventions used with these groups can inform the practice of professionals providing services to DMLs. Method This review article considered speech, language, and literacy interventions used with DHH and hearing bilingual learners from birth to 21 years of age",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31398302",
    "lastUpdate": "2019-11-14T18:46:40Z",
    "name": "DHH hearing bilingual learners",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1044/2019_AJSLP-IDLL-19-0003",
            "metadata": {
                "abstract": "© 2019 American 1000 Speech-Language-Hearing Association.Purpose: Many educators and speech-language pathologists have difficulty providing effective interventions to the growing population of d/Deaf and hard-of-hearing (DHH) learners who use more than 1 language. The purpose of this review article was to identify evidence-based interventions for speech, language, and literacy used with DHH multilingual learners (DMLs), monolingual DHH learners, and hearing bilingual learners without hearing loss. Interventions used with these groups can inform the practice of professionals providing services to DMLs. Method: This review article considered speech, language, and literacy interventions used with DHH and hearing bilingual learners from birth to 21 years of age. The following electronic databases were searched: Academic Search Complete/EBSCO (CINAHL, Education, ERIC), Linguistics & Language Behavior Abstracts, PsycINFO, and PubMed. Data describing article, participant, methodological, and intervention variables were extracted from studies. The methodological quality of studies was examined using the Council for Exceptional Children’s (2014) standards for evidence-based practice in special education. Results: A total of 144 studies were reviewed, describing over 9,370 learners aged 1.8-22.0 years. Two studies investigated DMLs, 76 investigated DHH learners, and 67 investigated hearing bilingual learners. A total of 146 different interventions were examined. Most studies reported positive effects. Only 17 studies met all quality indicators specified by the Council for Exceptional Children (2014): 7 examined DHH learners, and 10 examined hearing bilingual learners. There was insufficient evidence for any intervention to be considered an evidence-based intervention, although 6 could potentially contribute to evidence-based practice. Conclusions: No evidence-based interventions for DMLs were identified. A small number of interventions examined in high-quality studies of DHH and hearing bilingual learners were identified, which may be appropriate for use with DMLs following further investigation.",
                "authors": [
                    {
                        "name": "Crowe K."
                    },
                    {
                        "name": "Guiberson M."
                    }
                ],
                "citationCount": 1,
                "date": "2019-08-01T00:00:00Z",
                "journal": "American Journal of Speech-Language Pathology",
                "title": "Evidence-based interventions for learners who are deaf and/or multilingual: A systematic quality review"
            },
            "pmid": "31398302"
        }
    ],
    "topic": [
        {
            "term": "Geriatric medicine",
            "uri": "http://edamontology.org/topic_3399"
        }
    ]
}