{
    "additionDate": "2021-01-18T10:38:15Z",
    "biotoolsCURIE": "biotools:explorerchain",
    "biotoolsID": "explorerchain",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "tskuo@ucsd.edu",
            "name": "Tsung-Ting Kuo",
            "orcidid": "https://orcid.org/0000-0002-8728-4477",
            "typeEntity": "Person"
        }
    ],
    "description": "A tool for online learning, blockchain network, and consensus algorithm.\n\nEXpectation Propagation LOgistic REgRession on permissioned blockCHAIN (ExplorerChain): Decentralized privacy-preserving online healthcare/genomics predictive model learning.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/tsungtingkuo/explorerchain",
    "language": [
        "Java",
        "MATLAB"
    ],
    "lastUpdate": "2021-02-06T13:41:38Z",
    "license": "BSD-2-Clause",
    "name": "ExplorerChain",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/JAMIAOPEN/OOAA017",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of the American Medical Informatics Association.Objective: Cross-institutional distributed healthcare/genomic predictive modeling is an emerging technology that fulfills both the need of building a more generalizable model and of protecting patient data by only exchanging the models but not the patient data. In this article, the implementation details are presented for one specific blockchain-based approach, ExplorerChain, from a software development perspective. The healthcare/ genomic use cases of myocardial infarction, cancer biomarker, and length of hospitalization after surgery are also described. Materials and Methods: ExplorerChain's 3 main technical components, including online machine learning, metadata of transaction, and the Proof-of-Information-Timed (PoINT) algorithm, are introduced in this study. Specifically, the 3 algorithms (ie, core, new network, and new site/data) are described in detail. Results: ExplorerChain was implemented and the design details of it were illustrated, especially the development configurations in a practical setting. Also, the system architecture and programming languages are introduced. The code was also released in an open source repository available at https://github.com/tsungtingkuo/ explorerchain. Discussion: The designing considerations of semi-trust assumption, data format normalization, and non-determinism was discussed. The limitations of the implementation include fixed-number participating sites, limited join-or-leave capability during initialization, advanced privacy technology yet to be included, and further investigation in ethical, legal, and social implications. Conclusion: This study can serve as a reference for the researchers who would like to implement and even deploy blockchain technology. Furthermore, the off-the-shelf software can also serve as a cornerstone to accelerate the development and investigation of future healthcare/genomic blockchain studies.",
                "authors": [
                    {
                        "name": "Kuo T.-T."
                    }
                ],
                "date": "2020-07-01T00:00:00Z",
                "journal": "JAMIA Open",
                "title": "The anatomy of a distributed predictive modeling framework: Online learning, blockchain network, and consensus algorithm"
            },
            "pmcid": "PMC7382618",
            "pmid": "32734160"
        }
    ],
    "topic": [
        {
            "term": "Anatomy",
            "uri": "http://edamontology.org/topic_3067"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        }
    ]
}
