{
    "additionDate": "2017-08-03T19:05:53Z",
    "biotoolsCURIE": "biotools:gnome",
    "biotoolsID": "gnome",
    "credit": [
        {
            "email": "sekwon.kong@childrens.harvard.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Interactive whole-genome analysis pipeline to prioritize disease-linked variants, genes, and pathways.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://gnome.tchlab.org/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "http://gnome.tchlab.org/",
    "language": [
        "Perl",
        "C++",
        "SQL"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/gnome-whole-genome-sequencing-analysis-pipeline.html"
        }
    ],
    "name": "gNOME",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Whole-genome sequencing (WGS) studies are uncovering disease-associated variants in both rare and nonrare diseases. Utilizing the next-generation sequencing for WGS requires a series of computational methods for alignment, variant detection, and annotation, and the accuracy and reproducibility of annotation results are essential for clinical implementation. However, annotating WGS with up to date genomic information is still challenging for biomedical researchers. Here, we present one of the fastest and highly scalable annotation, filtering, and analysis pipeline-gNOME-to prioritize phenotype-associated variants while minimizing false-positive findings. Intuitive graphical user interface of gNOME facilitates the selection of phenotype-associated variants, and the result summaries are provided at variant, gene, and genome levels. Moreover, the enrichment results of specific variants, genes, and gene sets between two groups or compared with population scale WGS datasets that is already integrated in the pipeline can help the interpretation. We found a small number of discordant results between annotation software tools in part due to different reporting strategies for the variants with complex impacts. Using two published whole-exome datasets of uveal melanoma and bladder cancer, we demonstrated gNOME's accuracy of variant annotation and the enrichment of loss-of-function variants in known cancer pathways. gNOME Web server and source codes are freely available to the academic community (http://gnome.tchlab.org). We present a fast and highly scalable annotation, filtering, and analysis pipeline, gNOME, to prioritize variants potentially associated with phenotype while minimizing false-positive findings. Our pipeline can perform accurate and reproducible annotation with graphical user interface for annotation-based filtering, as well as nonparameteric statistical tests between two groups at multiple levels of resolution: variants, genes, and gene sets. The software described in the manuscript is available at http://gnome.tchlab.org. © 2014 WILEY PERIODICALS, INC.",
                "authors": [
                    {
                        "name": "Lee I.-H."
                    },
                    {
                        "name": "Lee K."
                    },
                    {
                        "name": "Hsing M."
                    },
                    {
                        "name": "Choe Y."
                    },
                    {
                        "name": "Park J.-H."
                    },
                    {
                        "name": "Kim S.H."
                    },
                    {
                        "name": "Bohn J.M."
                    },
                    {
                        "name": "Neu M.B."
                    },
                    {
                        "name": "Hwang K.-B."
                    },
                    {
                        "name": "Green R.C."
                    },
                    {
                        "name": "Kohane I.S."
                    },
                    {
                        "name": "Kong S.W."
                    }
                ],
                "citationCount": 18,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Human Mutation",
                "title": "Prioritizing Disease-Linked Variants, Genes, and Pathways with an Interactive Whole-Genome Analysis Pipeline"
            },
            "pmid": "24478219"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}