{
    "accessibility": [],
    "additionDate": "2018-06-12T16:45:50Z",
    "biotoolsCURIE": "biotools:outbreak_responder",
    "biotoolsID": "outbreak_responder",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": "eric.nelson@ufl.edu",
            "gridid": null,
            "name": "Eric Jorge Nelson",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        }
    ],
    "description": "Phone application for rehydration calculator for diarrheal disease management in a resource-limited setting.",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "https://purl.stanford.edu/sv492bk0032"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                },
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ],
            "output": []
        }
    ],
    "homepage": "https://play.google.com/store/apps/developer?id=Outbreak+Responder&hl=en",
    "homepage_status": 0,
    "language": [],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "license": null,
    "link": [],
    "maturity": null,
    "name": "Outbreak Responder",
    "operatingSystem": [],
    "otherID": [],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1371/journal.pntd.0005290",
            "metadata": {
                "abstract": "© 2017 Haque et al.The emergence of mobile technology offers new opportunities to improve clinical guideline adherence in resource-limited settings. We conducted a clinical pilot study in rural Bangladesh to evaluate the impact of a smartphone adaptation of the World Health Organization (WHO) diarrheal disease management guidelines, including a modality for age-based weight estimation. Software development was guided by end-user input and evaluated in a resource-limited district and sub-district hospital during the fall 2015 cholera season; both hospitals lacked scales which necessitated weight estimation. The study consisted of a 6 week pre-intervention and 6 week intervention period with a 10-day post-discharge follow-up. Standard of care was maintained throughout the study with the exception that admitting clinicians used the tool during the intervention. Inclusion criteria were patients two months of age and older with uncomplicated diarrheal disease. The primary outcome was adherence to guidelines for prescriptions of intravenous (IV) fluids, antibiotics and zinc. A total of 841 patients were enrolled (325 pre-intervention; 516 intervention). During the intervention, the proportion of prescriptions for IV fluids decreased at the district and sub-district hospitals (both p < 0.001) with risk ratios (RRs) of 0.5 and 0.2, respectively. However, when IV fluids were prescribed, the volume better adhered to recommendations. The proportion of prescriptions for the recommended antibiotic azithromycin increased (p < 0.001 district; p = 0.035 sub-district) with RRs of 6.9 (district) and 1.6 (sub-district) while prescriptions for other antibiotics decreased; zinc adherence increased. Limitations included an absence of a concurrent control group and no independent dehydration assessment during the pre-intervention. Despite limitations, opportunities were identified to improve clinical care, including better assessment, weight estimation, and fluid/ antibiotic selection. These findings demonstrate that a smartphone-based tool can improve guideline adherence. This study should serve as a catalyst for a randomized controlled trial to expand on the findings and address limitations.",
                "authors": [
                    {
                        "name": "Haque F."
                    },
                    {
                        "name": "Ball R.L."
                    },
                    {
                        "name": "Khatun S."
                    },
                    {
                        "name": "Ahmed M."
                    },
                    {
                        "name": "Kache S."
                    },
                    {
                        "name": "Chisti M.J."
                    },
                    {
                        "name": "Sarker S.A."
                    },
                    {
                        "name": "Maples S.D."
                    },
                    {
                        "name": "Pieri D."
                    },
                    {
                        "name": "Vardhan Korrapati T."
                    },
                    {
                        "name": "Sarnquist C."
                    },
                    {
                        "name": "Federspiel N."
                    },
                    {
                        "name": "Rahman M.W."
                    },
                    {
                        "name": "Andrews J.R."
                    },
                    {
                        "name": "Rahman M."
                    },
                    {
                        "name": "Nelson E.J."
                    }
                ],
                "citationCount": 5,
                "date": "2017-01-19T00:00:00Z",
                "journal": "PLoS Neglected Tropical Diseases",
                "title": "Evaluation of a Smartphone Decision-Support Tool for Diarrheal Disease Management in a Resource-Limited Setting"
            },
            "note": null,
            "pmcid": null,
            "pmid": null,
            "type": "Primary",
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        }
    ],
    "validated": 1,
    "version": []
}