{
    "additionDate": "2021-01-18T10:35:58Z",
    "biotoolsCURIE": "biotools:dchap",
    "biotoolsID": "dchap",
    "confidence_flag": "tool",
    "description": "DCHap is a fast and accurate haplotype phasing tool for third-generation sequencing data. It works for both SMRT reads (PacBio) and Oxford Nanopore reads.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                },
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "homepage": "https://github.com/yanboANU/Haplotype-phasing",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-22T15:41:52Z",
    "name": "DCHap",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1109/TCBB.2020.3005673",
            "metadata": {
                "abstract": "IEEEThe development of DNA sequencing technologies makes it possible to obtain reads originated from both copies of a chromosome (two parental chromosomes, or haplotypes) of a single individual. Reconstruction of both haplotypes (i.e. haplotype phasing) plays a crucial role in genetic analysis and provides relationship information between genetic variation and disease susceptibility. With the emerging third-generation sequencing technologies, most existing approaches for haplotype phasing suffer from performance issues to handle long and error-prone reads. We develop a divide-and-conquer algorithm, DCHap, to phase haplotypes using third-generation reads. We benchmark DCHap against three state-of-the-art phasing tools on both PacBio SMRT data and ONT Nanopore data. The experimental results show that DCHap generates more accurate or comparable results (measured by the switch errors) while being scalable for higher coverage and longer reads. DCHap is a fast and accurate algorithm for haplotype phasing using third-generation sequencing data. As the third-generation sequencing platforms continue improving on their throughput and read lengths, accurate and scalable tools like DCHap are important to improve haplotype phasing from the advances of sequencing technologies. The source code is freely available at https://github.com/yanboANU/Haplotype-phasing.",
                "authors": [
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Lin Y."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
                "title": "DCHap: A divide-and-conquer haplotype phasing algorithm for third-generation"
            },
            "pmid": "32750878"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}