{
    "additionDate": "2020-01-09T17:54:52Z",
    "biotoolsCURIE": "biotools:bWGR",
    "biotoolsID": "bWGR",
    "confidence_flag": "tool",
    "description": "Bayesian Whole-Genome Regression.\n\nMOTIVATION:Whole-genome regressions methods represent a key framework for genome-wide prediction, cross-validation studies, and association analysis. The bWGR offers a compendium of Bayesian methods with various priors available, allowing users to predict complex traits with different genetic architectures. RESULTS:Here we introduce bWGR, an R package that enables users to efficient fit and cross-validate Bayesian and likelihood whole-genome regression methods. It implements a series of methods referred to as the Bayesian alphabet under the traditional Gibbs sampling and optimized Expectation-Maximization. The package also enables fitting efficient multivariate models and complex hierarchical models. The package is user-friendly and computational efficient. AVAILABILITY AND IMPLEMENTATION:bWGR is an R package available in the CRAN repository. It can be installed in R by typing: install.packages(\"bWGR\").\n\n||| HOMEPAGE MISSING!",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/bWGR/index.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-09T15:46:33.309570Z",
    "name": "bWGR",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ794",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press. All rights reserved.Motivation: Whole-genome regressions methods represent a key framework for genome-wide prediction, cross-validation studies and association analysis. The bWGR offers a compendium of Bayesian methods with various priors available, allowing users to predict complex traits with different genetic architectures. Results: Here we introduce bWGR, an R package that enables users to efficient fit and cross-validate Bayesian and likelihood whole-genome regression methods. It implements a series of methods referred to as the Bayesian alphabet under the traditional Gibbs sampling and optimized expectation-maximization. The package also enables fitting efficient multivariate models and complex hierarchical models. The package is user-friendly and computational efficient.",
                "authors": [
                    {
                        "name": "Xavier A."
                    },
                    {
                        "name": "Muir W.M."
                    },
                    {
                        "name": "Rainey K.M."
                    }
                ],
                "citationCount": 1,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "bWGR: Bayesian whole-genome regression"
            },
            "pmid": "31647543"
        }
    ],
    "topic": [
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        }
    ]
}