{
    "additionDate": "2020-01-09T17:49:57Z",
    "biotoolsCURIE": "biotools:OSuvm",
    "biotoolsID": "OSuvm",
    "confidence_flag": "tool",
    "description": "An interactive online consensus survival tool for uveal melanoma prognosis analysis.\n\nUveal melanoma (UM) is a rare, aggressive, but the most frequent primary intraocular malignancy in adults, and up to 50% of patients develop a tendency of liver metastases. Great efforts have been made to develop biomarkers that facilitate diagnosis, prediction of the risk, and response to treatment of UM. However, a biologically informative and highly accurate gold standard system for prognostic evaluation of UM remains to be established. To facilitate assessment of the prognosis of UM patients, we established a user-friendly Online consensus Survival tool for uveal melanoma, named OSuvm, by which users can easily estimate the prognostic values of genes of interest by the Kaplan-Meier survival plot with hazard ratio and log-rank test.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Incident curve plotting",
                    "uri": "http://edamontology.org/operation_3503"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.henu.edu.cn/UVM/UVMList.jsp",
    "lastUpdate": "2021-01-04T14:41:29Z",
    "name": "OSuvm",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/MC.23128",
            "metadata": {
                "abstract": "© 2019 Wiley Periodicals, Inc.Uveal melanoma (UM) is a rare, aggressive, but the most frequent primary intraocular malignancy in adults, and up to 50% of patients develop a tendency of liver metastases. Great efforts have been made to develop biomarkers that facilitate diagnosis, prediction of the risk, and response to treatment of UM. However, a biologically informative and highly accurate gold standard system for prognostic evaluation of UM remains to be established. To facilitate assessment of the prognosis of UM patients, we established a user-friendly Online consensus Survival tool for uveal melanoma, named OSuvm, by which users can easily estimate the prognostic values of genes of interest by the Kaplan-Meier survival plot with hazard ratio and log-rank test. OSuvm comprises four independent cohorts including 229 patients with both gene expression profiles and relevant clinical follow-up information, and it has shown great performance in evaluating the prognostic roles of previously reported biomarkers. Using OSuvm enables researchers and clinicians to rapidly and conveniently explore the prognostic value of genes of interest and develop new potential molecular biomarkers for UM. OSuvm can be accessed at http://bioinfo.henu.edu.cn/UVM/UVMList.jsp.",
                "authors": [
                    {
                        "name": "An Y."
                    },
                    {
                        "name": "Dong H."
                    },
                    {
                        "name": "Ge L."
                    },
                    {
                        "name": "Guo X."
                    },
                    {
                        "name": "Ji S."
                    },
                    {
                        "name": "Li N."
                    },
                    {
                        "name": "Wang F."
                    },
                    {
                        "name": "Wang Q."
                    },
                    {
                        "name": "Yang M."
                    },
                    {
                        "name": "Zhang G."
                    },
                    {
                        "name": "Zhu W."
                    }
                ],
                "citationCount": 8,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Molecular Carcinogenesis",
                "title": "OSuvm: An interactive online consensus survival tool for uveal melanoma prognosis analysis"
            },
            "pmid": "31646691"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ],
    "validated": 1
}
