{
    "accessibility": "Open access",
    "additionDate": "2024-06-17T10:13:19.968311Z",
    "biotoolsCURIE": "biotools:ramzis",
    "biotoolsID": "ramzis",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jzaia@bu.edu",
            "name": "Joseph Zaia",
            "orcidid": "https://orcid.org/0000-0001-9497-8701",
            "typeEntity": "Person"
        }
    ],
    "description": "Bioinformatic toolkit for rigorous assessment of the alterations to glycoprotein composition that occur during biological processes.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "https://github.com/WillHackett22/RAMZIS",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-06-17T10:16:40.170786Z",
    "license": "MIT",
    "name": "RAMZIS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bioadv/vbae012",
            "metadata": {
                "abstract": "Motivation: Glycosylation elaborates the structures and functions of glycoproteins; glycoproteins are common post-translationally modified proteins and are heterogeneous and non-deterministically synthesized as an evolutionarily driven mechanism that elaborates the functions of glycosylated gene products. Glycoproteins, accounting for approximately half of all proteins, require specialized proteomics data analysis methods due to micro- and macro-heterogeneities as a given glycosite can be divided into several glycosylated forms, each of which must be quantified. Sampling of heterogeneous glycopeptides is limited by mass spectrometer speed and sensitivity, resulting in missing values. In conjunction with the low sample size inherent to glycoproteomics, a specialized toolset is needed to determine if observed changes in glycopeptide abundances are biologically significant or due to data quality limitations. Results: We developed an R package, Relative Assessment of m/z Identifications by Similarity (RAMZIS), that uses similarity metrics to guide researchers to a more rigorous interpretation of glycoproteomics data. RAMZIS uses a permutation test to generate contextual similarity, which assesses the quality of mass spectral data and outputs a graphical demonstration of the likelihood of finding biologically significant differences in glycosylation abundance datasets. Investigators can assess dataset quality, holistically differentiate glycosites, and identify which glycopeptides are responsible for glycosylation pattern change. RAMZIS is validated by theoretical cases and a proof-of-concept application. RAMZIS enables comparison between datasets too stochastic, small, or sparse for interpolation while acknowledging these issues in its assessment. Using this tool, researchers will be able to rigorously define the role of glycosylation and the changes that occur during biological processes.",
                "authors": [
                    {
                        "name": "Carvalho L."
                    },
                    {
                        "name": "Chang D."
                    },
                    {
                        "name": "Hackett W.E."
                    },
                    {
                        "name": "Zaia J."
                    }
                ],
                "date": "2024-01-01T00:00:00Z",
                "journal": "Bioinformatics Advances",
                "title": "RAMZIS: a bioinformatic toolkit for rigorous assessment of the alterations to glycoprotein composition that occur during biological processes"
            },
            "pmcid": "PMC10879752",
            "pmid": "38384861"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biochemistry",
            "uri": "http://edamontology.org/topic_3292"
        },
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
