{
    "additionDate": "2021-01-18T11:30:59Z",
    "biotoolsCURIE": "biotools:erbk",
    "biotoolsID": "erbk",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "cli@xjtu.edu.cn",
            "name": "Chen Li",
            "typeEntity": "Person"
        }
    ],
    "description": "ERBK (Representation learning model of bio-entities) is a representation model for biological entities by fusing structured axioms with unstructured texts.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "homepage": "https://gitlab.com/BioAI/erbk",
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2021-03-08T09:09:01Z",
    "name": "ERBK",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA913",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: Structured semantic resources, for example, biological knowledge bases and ontologies, formally define biological concepts, entities and their semantic relationships, manifested as structured axioms and unstructured texts (e.g. textual definitions). The resources contain accurate expressions of biological reality and have been used by machine-learning models to assist intelligent applications like knowledge discovery. The current methods use both the axioms and definitions as plain texts in representation learning (RL). However, since the axioms are machine-readable while the natural language is human-understandable, difference in meaning of token and structure impedes the representations to encode desirable biological knowledge. Results: We propose ERBK, a RL model of bio-entities. Instead of using the axioms and definitions as a textual corpus, our method uses knowledge graph embedding method and deep convolutional neural models to encode the axioms and definitions respectively. The representations could not only encode more underlying biological knowledge but also be further applied to zero-shot circumstance where existing approaches fall short. Experimental evaluations show that ERBK outperforms the existing methods for predicting protein-protein interactions and gene-disease associations. Moreover, it shows that ERBK still maintains promising performance under the zero-shot circumstance. We believe the representations and the method have certain generality and could extend to other types of bio-relation.",
                "authors": [
                    {
                        "name": "Dong Y."
                    },
                    {
                        "name": "Jimeno Yepes A."
                    },
                    {
                        "name": "Li C."
                    },
                    {
                        "name": "Lou P."
                    }
                ],
                "date": "2021-04-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "A representation model for biological entities by fusing structured axioms with unstructured texts"
            },
            "pmid": "33107905"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        }
    ]
}
