{
    "additionDate": "2023-10-31T13:37:59.723864Z",
    "biotoolsCURIE": "biotools:kraken2tax",
    "biotoolsID": "kraken2tax",
    "description": "This tool converts data from Kraken to a Galaxy taxonomy representation.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Conversion",
                    "uri": "http://edamontology.org/operation_3434"
                }
            ]
        }
    ],
    "homepage": "https://github.com/galaxyproject/tools-devteam/tree/main/tool_collections/taxonomy/kraken2tax",
    "lastUpdate": "2024-11-24T14:35:43.758263Z",
    "name": "Kraken2Tax",
    "owner": "johangustafsson",
    "publication": [
        {
            "doi": "10.1101/gr.094508.109",
            "metadata": {
                "abstract": "How many species inhabit our immediate surroundings? A straightforward collection technique suitable for answering this question is known to anyone who has ever driven a car at highway speeds. The windshield of a moving vehicle is subjected to numerous insect strikes and can be used as a collection device for representative sampling. Unfortunately the analysis of biological material collected in that manner, as with most metagenomic studies, proves to be rather demanding due to the large number of required tools and considerable computational infrastructure. In this study, we use organic matter collected by a moving vehicle to design and test a comprehensive pipeline for phylogenetic profiling of metagenomic samples that includes all steps from processing and quality control of data generated by next-generation sequencing technologies to statistical analyses and data visualization. To the best of our knowledge, this is also the first publication that features a live online supplement providing access to exact analyses and workflows used in the article. © 2009 by Cold Spring Harbor Laboratory Press.",
                "authors": [
                    {
                        "name": "Ananda G."
                    },
                    {
                        "name": "Chiaromonte F."
                    },
                    {
                        "name": "Chung W.-Y."
                    },
                    {
                        "name": "Nekrutenko A."
                    },
                    {
                        "name": "Pond S.K."
                    },
                    {
                        "name": "Taylor J."
                    },
                    {
                        "name": "Wadhawan S."
                    }
                ],
                "citationCount": 59,
                "date": "2009-11-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "Windshield splatter analysis with the Galaxy metagenomic pipeline"
            },
            "pmcid": "PMC2775585",
            "pmid": "19819906"
        },
        {
            "doi": "10.1186/gb-2014-15-3-r46",
            "metadata": {
                "abstract": "Kraken is an ultrafast and highly accurate program for assigning taxonomic labels to metagenomic DNA sequences. Previous programs designed for this task have been relatively slow and computationally expensive, forcing researchers to use faster abundance estimation programs, which only classify small subsets of metagenomic data. Using exact alignment of k-mers, Kraken achieves classification accuracy comparable to the fastest BLAST program. In its fastest mode, Kraken classifies 100 base pair reads at a rate of over 4.1 million reads per minute, 909 times faster than Megablast and 11 times faster than the abundance estimation program MetaPhlAn. Kraken is available at http://ccb.jhu.edu/software/kraken/. © 2014 Wood and Salzberg; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Salzberg S.L."
                    },
                    {
                        "name": "Wood D.E."
                    }
                ],
                "citationCount": 2889,
                "date": "2014-03-03T00:00:00Z",
                "journal": "Genome Biology",
                "title": "Kraken: Ultrafast metagenomic sequence classification using exact alignments"
            },
            "pmcid": "PMC4053813",
            "pmid": "24580807"
        }
    ],
    "topic": [
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        }
    ]
}
