
{
    "credit": [
        {
            "name": "rki.de",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.european-virus-archive.com/contact-us"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://www.european-virus-archive.com/evag-project"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Virology",
                "uri": "http://edamontology.org/topic_0781"
            }
        ]
    },
    "publication": [
        {
            "abstract": "The European Virus Archive (EVA) was conceived as a direct response to the need for a coordinated and readily accessible collection of viruses that could be made available to academia, public health organisations and industry, initially within Europe, but ultimately throughout the world. Although scientists worldwide have accumulated virus collections since the early twentieth century, the quality of the collections and the viruses collected may vary according to the personal interests and agenda of the scientists. Moreover, when laboratories are re-organised or closed, collections are no longer maintained and gradually cease to exist. The tragedy of 9/11 and other disruptive activities have also meant that some previously available biological reagents are no longer openly exchanged between countries. In 2008, funding under the FP7-EU infrastructure programme enabled the initiation of the EVA. Within three years, it has developed from a consortium of nine European laboratories to encompass associated partners in Africa, Russia, China, Turkey, Germany and Italy. There is every reason to believe that EVA will continue to expand and ultimately exist as a globally networked, quality-controlled non-profit archive for the benefit of science. Organizations or individuals who would like to be considered as contributors are invited to contact the EVA coordinator, Jean-Louis Romette, at jean-louis.romette@univmed.fr. © 2012 Elsevier B.V..",
            "authors": [
                "Gould E.A.",
                "de Lamballerie X.",
                "Coutard B.",
                "Fooks A.R.",
                "Outlaw M.",
                "Drosten C.",
                "Guenther S.",
                "Klempa B.",
                "Pinschewer D.",
                "Avsic-Zupanc T.",
                "Sabeta C.",
                "Lukashev A.",
                "Eropkin M.",
                "Koslov A.",
                "Zverev V.",
                "Lvov D.",
                "Zhebrun A.",
                "Shipulin G.",
                "Niedrig M.",
                "Gao Fu G.",
                "Dong Liang G.",
                "Ippolito G.",
                "Koray E.",
                "Romette J.L."
            ],
            "cit_count": 7,
            "doi": "10.1016/j.antiviral.2012.05.005",
            "journal": "Antiviral Research",
            "pmid": "22626637",
            "title": "The European Virus Archive: A new resource for virology research",
            "type": "Primary",
            "year": "2012-08-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:evag",
        "biotoolsID": "evag",
        "description": "Non-profit organisation dedicated to the characterisation, conservation, production, distribution and characterisation of biological materials in the field of virology.",
        "homepage": "http://www.european-virus-archive.com/",
        "name": "European Virus Archive"
    }
}