{
    "additionDate": "2021-01-18T11:23:09Z",
    "biotoolsCURIE": "biotools:peryton",
    "biotoolsID": "peryton",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "gskoufos@uth.gr",
            "name": "Giorgos Skoufos",
            "typeEntity": "Person"
        },
        {
            "email": "arhatzig@uth.gr",
            "name": "Artemis G Hatzigeorgiou",
            "typeEntity": "Person"
        }
    ],
    "description": "Peryton is a manual collection of experimentally supported microbe-disease associations.\n\nPeryton constitutes a novel resource of experimentally supported microbe-disease associations, currently hosting more than 7,900 entries linking 43 diseases and 1,396 microorganisms. Peryton’s content is exclusively sustained by manual curation of biomedical articles. Importantly, diseases and microorganisms are provided in a systematic, standardized manner using reference resources to create database dictionaries. Information about the experimental design, study cohorts and the applied high- or low-throughput techniques are meticulously annotated and catered to users.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "https://dianalab.e-ce.uth.gr/peryton/",
    "lastUpdate": "2021-01-23T09:04:45Z",
    "name": "Peryton",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA902",
            "metadata": {
                "abstract": "© 2021 The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.We present Peryton (https://dianalab.e-ce.uth.gr/peryton/), a database of experimentally supported microbe-disease associations. Its first version constitutes a novel resource hosting more than 7900 entries linking 43 diseases with 1396 microorganisms. Peryton's content is exclusively sustained by manual curation of biomedical articles. Diseases and microorganisms are provided in a systematic, standardized manner using reference resources to create database dictionaries. Information about the experimental design, study cohorts and the applied high- or low-throughput techniques is meticulously annotated and catered to users. Several functionalities are provided to enhance user experience and enable ingenious use of Peryton. One or more microorganisms and/or diseases can be queried at the same time. Advanced filtering options and direct text-based filtering of results enable refinement of returned information and the conducting of tailored queries suitable to different research questions. Peryton also provides interactive visualizations to effectively capture different aspects of its content and results can be directly downloaded for local storage and downstream analyses. Peryton will serve as a valuable source, enabling scientists of microbe-related disease fields to form novel hypotheses but, equally importantly, to assist in cross-validation of findings.",
                "authors": [
                    {
                        "name": "Skoufos G."
                    },
                    {
                        "name": "Kardaras F.S."
                    },
                    {
                        "name": "Alexiou A."
                    },
                    {
                        "name": "Kavakiotis I."
                    },
                    {
                        "name": "Lambropoulou A."
                    },
                    {
                        "name": "Kotsira V."
                    },
                    {
                        "name": "Tastsoglou S."
                    },
                    {
                        "name": "Hatzigeorgiou A.G."
                    }
                ],
                "date": "2021-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Peryton: A manual collection of experimentally supported microbe-disease associations"
            },
            "pmid": "33080028"
        }
    ],
    "topic": [
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Cardiology",
            "uri": "http://edamontology.org/topic_3335"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Gastroenterology",
            "uri": "http://edamontology.org/topic_3409"
        }
    ],
    "validated": 1
}