{
    "additionDate": "2022-09-12T06:12:22.910964Z",
    "biotoolsCURIE": "biotools:dfcnn",
    "biotoolsID": "dfcnn",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hp.zhang@siat.ac.cn",
            "name": "Haiping Zhang",
            "typeEntity": "Person"
        },
        {
            "email": "yi.pan@siat.ac.c",
            "name": "Yi Pan",
            "typeEntity": "Person"
        },
        {
            "name": "Xuli Wu",
            "typeEntity": "Person"
        }
    ],
    "description": "DFCNN is a deep learning based model for fast identify protein-ligand interaction, and suitable for larget scale drug virtual screening.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Protein-protein docking",
                    "uri": "http://edamontology.org/operation_3899"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                }
            ]
        }
    ],
    "homepage": "http://cbblab.siat.ac.cn/DFCNN/index.php",
    "lastUpdate": "2022-09-12T06:12:22.914543Z",
    "license": "Other",
    "name": "DFCNN",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3389/FMOLB.2022.872086",
            "metadata": {
                "abstract": "Copyright © 2022 Zhang, Lin, Wei, Zhang, Liao, Wu, Pan and Wu.Computational methods with affordable computational resources are highly desirable for identifying active drug leads from millions of compounds. This requires a model that is both highly efficient and relatively accurate, which cannot be achieved by most of the current methods. In real virtual screening (VS) application scenarios, the desired method should perform much better in selecting active compounds by prediction than by random chance. Here, we systematically evaluate the performance of our previously developed DFCNN model in large-scale virtual screening, and the results show our method has approximately 22 times the success rate compared to the random chance on average with a score cutoff of 0.99. Of the 102 test cases, 10 cases have more than 98 times the success rate of a random guess. Interestingly, in three cases, the prediction success rate is 99 times that of a random guess by a score cutoff of 0.99. This indicates that in most situations after our extremely large-scale VS, the dataset can be reduced 20 to 100 times for the next step of virtual screening based on docking or MD simulation. Furthermore, we have employed an experimental method to verify our computational method by finding several activity inhibitors for Trypsin I Protease. In addition, we also show its proof-of-concept application in de novo drug screening. The results indicate the massive potential of this method in the first step of the real drug development workflow. Moreover, DFCNN only takes about 0.0000225s for one protein–compound prediction on average with 80 Intel CPU cores (2.00 GHz) and 60 GB RAM, which is at least tens of thousands of times faster than AutoDock Vina or Schrödinger high-throughput virtual screening. Additionally, an online webserver based on DFCNN for large-scale screening is available at http://cbblab.siat.ac.cn/DFCNN/index.php for the convenience of the users.",
                "authors": [
                    {
                        "name": "Liao L."
                    },
                    {
                        "name": "Lin X."
                    },
                    {
                        "name": "Pan Y."
                    },
                    {
                        "name": "Wei Y."
                    },
                    {
                        "name": "Wu H."
                    },
                    {
                        "name": "Wu X."
                    },
                    {
                        "name": "Zhang H."
                    },
                    {
                        "name": "Zhang H."
                    }
                ],
                "date": "2022-06-01T00:00:00Z",
                "journal": "Frontiers in Molecular Biosciences",
                "title": "Validation of Deep Learning-Based DFCNN in Extremely Large-Scale Virtual Screening and Application in Trypsin I Protease Inhibitor Discovery"
            },
            "pmcid": "PMC9200220",
            "pmid": "35720125"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Drug development",
            "uri": "http://edamontology.org/topic_3373"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        }
    ]
}
