{
    "additionDate": "2021-11-29T12:06:17.789189Z",
    "biotoolsCURIE": "biotools:saverunner",
    "biotoolsID": "saverunner",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "paci@diag.uniroma1.it",
            "name": "Paola Paci",
            "orcidid": "https://orcid.org/0000-0002-9393-2047",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "SAveRUNNER (Searching off-lAbel dRUg aNd NEtwoRk) is an R-based tool for drug repurposing.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/sportingCode/SAveRUNNER/blob/main/UserGuide.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/sportingCode/SAveRUNNER",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-11-29T12:06:17.791854Z",
    "license": "AGPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/sportingCode/SAveRUNNER/issues"
        }
    ],
    "name": "SAveRUNNER",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04076-W",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Currently, no proven effective drugs for the novel coronavirus disease COVID-19 exist and despite widespread vaccination campaigns, we are far short from herd immunity. The number of people who are still vulnerable to the virus is too high to hamper new outbreaks, leading a compelling need to find new therapeutic options devoted to combat SARS-CoV-2 infection. Drug repurposing represents an effective drug discovery strategy from existing drugs that could shorten the time and reduce the cost compared to de novo drug discovery. Results: We developed a network-based tool for drug repurposing provided as a freely available R-code, called SAveRUNNER (Searching off-lAbel dRUg aNd NEtwoRk), with the aim to offer a promising framework to efficiently detect putative novel indications for currently marketed drugs against diseases of interest. SAveRUNNER predicts drug–disease associations by quantifying the interplay between the drug targets and the disease-associated proteins in the human interactome through the computation of a novel network-based similarity measure, which prioritizes associations between drugs and diseases located in the same network neighborhoods. Conclusions: The algorithm was successfully applied to predict off-label drugs to be repositioned against the new human coronavirus (2019-nCoV/SARS-CoV-2), and it achieved a high accuracy in the identification of well-known drug indications, thus revealing itself as a powerful tool to rapidly detect potential novel medical indications for various drugs that are worth of further investigation. SAveRUNNER source code is freely available at https://github.com/giuliafiscon/SAveRUNNER.git, along with a comprehensive user guide.",
                "authors": [
                    {
                        "name": "Fiscon G."
                    },
                    {
                        "name": "Paci P."
                    }
                ],
                "citationCount": 7,
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SAveRUNNER: an R-based tool for drug repurposing"
            },
            "pmcid": "PMC7987121",
            "pmid": "33757425",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Drug development",
            "uri": "http://edamontology.org/topic_3373"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ]
}