{
    "additionDate": "2018-07-13T18:46:22Z",
    "biotoolsCURIE": "biotools:vadir",
    "biotoolsID": "vadir",
    "credit": [
        {
            "email": "mariani.andrea@mayo.edu",
            "name": "Dr. Andrea Mariani",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Integrated approach to Variant Detection in RNA.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://gigadb.org/dataset/100360"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "http://gigadb.org/dataset/100360",
    "language": [
        "Java",
        "Perl",
        "R",
        "Shell"
    ],
    "lastUpdate": "2024-11-24T20:27:13.943293Z",
    "license": "MIT",
    "name": "VaDiR",
    "operatingSystem": [
        "Linux"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_015797"
        }
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/gigascience/gix122",
            "metadata": {
                "abstract": "Background: Advances in next-generation DNA sequencing technologies are now enabling detailed characterization of sequence variations in cancer genomes. With whole-genome sequencing, variations in coding and non-coding sequences can be discovered. But the cost associated with it is currently limiting its general use in research. Whole-exome sequencing is used to characterize sequence variations in coding regions, but the cost associated with capture reagents and biases in capture rate limit its full use in research. Additional limitations include uncertainty in assigning the functional significance of the mutations when these mutations are observed in the non-coding region or in genes that are not expressed in cancer tissue. Results: We investigated the feasibility of uncovering mutations from expressed genes using RNA sequencing datasets with a method called Variant Detection in RNA(VaDiR) that integrates 3 variant callers, namely: SNPiR, RVBoost, and MuTect2. The combination of all 3 methods, which we called Tier 1 variants, produced the highest precision with true positive mutations from RNA-seq that could be validated at the DNA level. We also found that the integration of Tier 1 variants with those called by MuTect2 and SNPiR produced the highest recall with acceptable precision. Finally, we observed a higher rate of mutation discovery in genes that are expressed at higher levels. Conclusions: Our method, VaDiR, provides a possibility of uncovering mutations from RNA sequencing datasets that could be useful in further functional analysis. In addition, our approach allows orthogonal validation of DNA-based mutation discovery by providing complementary sequence variation analysis from paired RNA/DNA sequencing datasets.",
                "authors": [
                    {
                        "name": "Anders S."
                    },
                    {
                        "name": "Beyerlein P."
                    },
                    {
                        "name": "Chien J."
                    },
                    {
                        "name": "Koestler D."
                    },
                    {
                        "name": "Mariani A."
                    },
                    {
                        "name": "Neums L."
                    },
                    {
                        "name": "Suenaga S."
                    }
                ],
                "citationCount": 16,
                "date": "2018-02-01T00:00:00Z",
                "journal": "GigaScience",
                "title": "VaDiR: An integrated approach to Variant Detection in RNA"
            },
            "pmcid": "PMC5827345",
            "pmid": "29267927"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Molecular genetics",
            "uri": "http://edamontology.org/topic_3321"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
