{
    "name": "PatchFinder", 
    "description": "A server for the detection of highly conserved protein surfaces.", 
    "homepage": "http://patchfinder.tau.ac.il/", 
    "biotoolsID": "patchfinder", 
    "biotoolsCURIE": "biotools:patchfinder", 
    "version": [
        "1"
    ], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3351", 
                    "term": "Molecular surface analysis"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": "An algorithmic tool for the identification of functionally important regions in proteins with known three-dimentional (3D) structure. The algorithm is based on the observation that evolutionarily conserved regions are often functionally important and based on the following three steps:1. Assignment of an evolutionary conservation score for each position in the protein (using ConSurf).2. Extraction of solvent accessible residues in the protein. This step is aimed on eliminating residues which are conserved due to structural constrains and are typically buried in the protein core.3. Identification of the most significant cluster of conserved residues on the proteins' surface. This ML-patch is suspected to be the main functional site of the protein.After the ML-patch was found the search procedure is continued for non-overlapping secondary functional sites with weaker conservation signal.PatchFinder was examined on a dataset of 110 protein structures with annotated functional sites resid", 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_1317", 
            "term": "Structural biology"
        }, 
        {
            "uri": "http://edamontology.org/topic_2275", 
            "term": "Molecular modelling"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [], 
    "license": null, 
    "collectionID": [
        "Instruct"
    ], 
    "maturity": null, 
    "cost": "Free of charge", 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "http://patchfinder.tau.ac.il/Example.html", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1016/j.str.2008.10.017", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "Detection of Functionally Important Regions in \"Hypothetical Proteins\" of Known Structure", 
                "abstract": "Structural genomics initiatives provide ample structures of \"hypothetical proteins\" (i.e., proteins of unknown function) at an ever increasing rate. However, without function annotation, this structural goldmine is of little use to biologists who are interested in particular molecular systems. To this end, we used (an improved version of) the PatchFinder algorithm for the detection of functional regions on the protein surface, which could mediate its interactions with, e.g., substrates, ligands, and other proteins. Examination, using a data set of annotated proteins, showed that PatchFinder outperforms similar methods. We collected 757 structures of hypothetical proteins and their predicted functional regions in the N-Func database. Inspection of several of these regions demonstrated that they are useful for function prediction. For example, we suggested an interprotein interface and a putative nucleotide-binding site. A web-server implementation of PatchFinder and the N-Func database are available at http://patchfinder.tau.ac.il/. © 2008 Elsevier Ltd. All rights reserved.", 
                "date": "2008-12-12T00:00:00Z", 
                "citationCount": 42, 
                "authors": [
                    {
                        "name": "Nimrod G."
                    }, 
                    {
                        "name": "Schushan M."
                    }, 
                    {
                        "name": "Steinberg D.M."
                    }, 
                    {
                        "name": "Ben-Tal N."
                    }
                ], 
                "journal": "Structure"
            }
        }
    ], 
    "credit": [
        {
            "name": "Instruct", 
            "email": null, 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Institute", 
            "typeRole": [
                "Provider"
            ], 
            "note": null
        }, 
        {
            "name": null, 
            "email": "ccisb@stfc.ac.uk", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "Instruct", 
    "additionDate": "2015-02-16T10:08:11Z", 
    "lastUpdate": "2018-12-10T12:58:55Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}