{
    "additionDate": "2021-01-18T10:07:14Z",
    "biotoolsCURIE": "biotools:sbmclone",
    "biotoolsID": "sbmclone",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "braphael@princeton.edu",
            "name": "Benjamin J Raphael",
            "orcidid": "https://orcid.org/0000-0003-1274-048X",
            "typeEntity": "Person"
        }
    ],
    "description": "Identifying tumor clones in sparse single-cell mutation data.\n\nSBMClone is a tool that uses stochastic block model (SBM) inference methods to identify clonal structure (groups of cells that share groups of mutations) in low-coverage single-cell DNA sequencing data. While SBMClone was originally designed for single-nucleotide variants, it can also be applied to other types of mutations such as structural variants.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "https://github.com/raphael-group/SBMClone",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-11T16:37:28Z",
    "license": "BSD-3-Clause",
    "name": "SBMClone",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA449",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press.Motivation: Recent single-cell DNA sequencing technologies enable whole-genome sequencing of hundreds to thousands of individual cells. However, these technologies have ultra-low sequencing coverage (<0.5x per cell) which has limited their use to the analysis of large copy-number aberrations (CNAs) in individual cells. While CNAs are useful markers in cancer studies, single-nucleotide mutations are equally important, both in cancer studies and in other applications. However, ultra-low coverage sequencing yields single-nucleotide mutation data that are too sparse for current single-cell analysis methods. Results: We introduce SBMClone, a method to infer clusters of cells, or clones, that share groups of somatic single-nucleotide mutations. SBMClone uses a stochastic block model to overcome sparsity in ultra-low coverage single-cell sequencing data, and we show that SBMClone accurately infers the true clonal composition on simulated datasets with coverage at low as 0:2x. We applied SBMClone to single-cell whole-genome sequencing data from two breast cancer patients obtained using two different sequencing technologies. On the first patient, sequenced using the 10X Genomics CNV solution with sequencing coverage ≈0:03x, SBMClone recovers the major clonal composition when incorporating a small amount of additional information. On the second patient, where pre- and post-treatment tumor samples were sequenced using DOP-PCR with sequencing coverage ≈0:5x, SBMClone shows that tumor cells are present in the post-treatment sample, contrary to published analysis of this dataset.",
                "authors": [
                    {
                        "name": "Myers M.A."
                    },
                    {
                        "name": "Zaccaria S."
                    },
                    {
                        "name": "Raphael B.J."
                    }
                ],
                "citationCount": 1,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Identifying tumor clones in sparse single-cell mutation data"
            },
            "pmcid": "PMC7355247",
            "pmid": "32657385"
        }
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ]
}