{
    "additionDate": "2017-03-25T16:29:56Z",
    "biotoolsCURIE": "biotools:rnastructure",
    "biotoolsID": "rnastructure",
    "credit": [
        {
            "email": "David_Mathews@urmc.rochester.edu",
            "name": "David Mathews",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://rna.urmc.rochester.edu/"
        }
    ],
    "description": "A complete package for RNA and DNA secondary structure prediction and analysis. It includes algorithms for secondary structure prediction, including facility to predict base pairing probabilities. It also can be used to predict bimolecular structures and can predict the equilibrium binding affinity of an oligonucleotide to a structured RNA target.",
    "documentation": [
        {
            "type": "General",
            "url": "http://rna.urmc.rochester.edu/RNAstructureHelp.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0278"
                }
            ]
        }
    ],
    "homepage": "http://rna.urmc.rochester.edu/RNAstructure.html",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/rnastructure-5-2-prediction-analysis-rna-secondary-structure.html"
        }
    ],
    "name": "RNAstructure",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2015 The Author 2015. Published by Oxford University Press. All rights reserved. For Permissions, please e-mail: journals.permissions@oup.com.Motivation: There are numerous examples of RNA-RNA complexes, including microRNA-mRNA and small RNA-mRNA duplexes for regulation of translation, guide RNA interactions with target RNA for post-transcriptional modification and small nuclear RNA duplexes for splicing. Predicting the base pairs formed between two interacting sequences remains difficult, at least in part because of the competition between unimolecular and bimolecular structure. Results: Two algorithms were developed for improved prediction of bimolecular RNA structure that consider the competition between self-structure and bimolecular structure. These algorithms utilize two novel approaches to evaluate accessibility: free energy density minimization and pseudo-energy minimization. Free energy density minimization minimizes the folding free energy change per nucleotide involved in an intermolecular secondary structure. Pseudo-energy minimization (called AccessFold) minimizes the sum of free energy change and a pseudo-free energy penalty for bimolecular pairing of nucleotides that are unlikely to be accessible for bimolecular structure. The pseudo-free energy, derived from unimolecular pairing probabilities, is applied per nucleotide in bimolecular pairs, and this approach is able to predict binding sites that are split by unimolecular structures. A benchmark set of 17 bimolecular RNA structures was assembled to assess structure prediction. Pseudo-energy minimization provides a statistically significant improvement in sensitivity over the method that was found in a benchmark to be the most accurate previously available method, with an improvement from 36.8% to 57.8% in mean sensitivity for base pair prediction. Availability and implementation: Pseudo-energy minimization is available for download as AccessFold, under an open-source license and as part of the RNAstructure package, at: http://rna.urmc.rochester.edu/RNAstructure.html.",
                "authors": [
                    {
                        "name": "Dichiacchio L."
                    },
                    {
                        "name": "Sloma M.F."
                    },
                    {
                        "name": "Mathews D.H."
                    }
                ],
                "citationCount": 7,
                "date": "2016-04-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "AccessFold: Predicting RNA-RNA interactions with consideration for competing self-structure"
            },
            "pmid": "26589271"
        }
    ],
    "toolType": [
        "Web application",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}