{"collectionID": [], "accessibility": [], "topic": [{"term": "Proteins", "uri": "http://edamontology.org/topic_0078"}, {"term": "ChIP-seq", "uri": "http://edamontology.org/topic_3169"}, {"term": "DNA", "uri": "http://edamontology.org/topic_0654"}, {"term": "Genomics", "uri": "http://edamontology.org/topic_0622"}], "owner": "mbs_import", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": null, "note": null, "version": null, "pmid": "25192742", "type": null, "pmcid": null, "metadata": {"title": "SignalSpider: Probabilistic pattern discovery on multiple normalized ChIP-Seq signal profiles", "abstract": "© 2014 The Author.Motivation: Chromatin immunoprecipitation (ChIP) followed by high-throughput sequencing (ChIP-Seq) measures the genome-wide occupancy of transcription factors in vivo. Different combinations of DNA-binding protein occupancies may result in a gene being expressed in different tissues or at different developmental stages. To fully understand the functions of genes, it is essential to develop probabilistic models on multiple ChIP-Seq profiles to decipher the combinatorial regulatory mechanisms by multiple transcription factors. Results: In this work, we describe a probabilistic model (SignalSpider) to decipher the combinatorial binding events of multiple transcription factors. Comparing with similar existing methods, we found SignalSpider performs better in clustering promoter and enhancer regions. Notably, SignalSpider can learn higher-order combinatorial patterns from multiple ChIP-Seq profiles. We have applied SignalSpider on the normalized ChIP-Seq profiles from the ENCODE consortium and learned model instances. We observed different higher-order enrichment and depletion patterns across sets of proteins. Those clustering patterns are supported by Gene Ontology (GO) enrichment, evolutionary conservation and chromatin interaction enrichment, offering biological insights for further focused studies. We also proposed a specific enrichment map visualization method to reveal the genome-wide transcription factor combinatorial patterns from the models built, which extend our existing fine-scale knowledge on gene regulation to a genome-wide level. Availability and implementation: The matrix-algebra-optimized executables and source codes are available at the authors' websites: http://www.cs.toronto.edu/∼wkc/SignalSpider. Contact: Supplementary information: Supplementary data are available at Bioinformatics online.", "citationCount": 20, "authors": [{"name": "Wong K.-C."}, {"name": "Li Y."}, {"name": "Peng C."}, {"name": "Zhang Z."}], "date": "2015-01-01T00:00:00Z", "journal": "Bioinformatics"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": null, "url": "http://www.cs.toronto.edu/~wkc/", "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "kc.w@cityu.edu.hk"}], "biotoolsCURIE": "biotools:signalspider", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "http://www.cs.toronto.edu/~wkc/SignalSpider/", "function": [{"note": null, "input": [], "operation": [{"term": "Protein binding site prediction", "uri": "http://edamontology.org/operation_2575"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:52Z", "otherID": [], "description": "A probabilistic model for deciphering the combinatorial binding of DNA-binding proteins. The model (SignalSpider) aims at modeling and extracting patterns from multiple ChIP-Seq profiles.", "toolType": ["Script", "Desktop application"], "editPermission": {"type": "private", "authors": []}, "language": ["MATLAB"], "link": [{"url": "http://www.mybiosoftware.com/signalspider-probabilistic-modeling-and-pattern-discovery-on-multiple-normalized-chip-seq-signal-profile.html", "note": null, "type": "Software catalogue"}], "biotoolsID": "signalspider", "additionDate": "2017-08-03T19:01:30Z", "name": "SignalSpider", "license": null, "documentation": [{"url": "http://www.cs.toronto.edu/~wkc/SignalSpider/", "note": null, "type": "General"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux", "Windows"]}