
{
    "credit": [
        {
            "email": "matteo.ferla@gmail.com",
            "name": "Matteo P. Ferla",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.matteoferla.com/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://www.mutanalyst.com/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "JavaScript"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "PCR experiment",
                "uri": "http://edamontology.org/topic_3519"
            },
            {
                "term": "DNA mutation",
                "uri": "http://edamontology.org/topic_2533"
            },
            {
                "term": "Data quality management",
                "uri": "http://edamontology.org/topic_3572"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/mutanalyst-assessing-the-mutational-spectrum-of-eppcr-libraries.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2016 Ferla. Background: Assessing library diversity is an important control step in a directed evolution experiment. To do this, a limited amount of colonies from a test library are sequenced and tested. In the case of an error-prone PCR library, the spectrum of the identified mutations - the proportions of mutations of a specific nucleobase to another- is calculated enabling the user to make more informed predictions on library diversity and coverage. However, the calculations of the mutational spectrum are severely affected by the limited sample sizes. Results: Here an online program, called Mutanalyst, is presented, which not only automates the calculations, but also estimates errors involved. Specifically, the errors are calculated thanks to the complementarity of DNA, which means that a mutation has a complementary mutation on the other sequence. Additionally, in the case of determining the mean number of mutations per sequence it does so by fitting to a Poisson distribution, which is more robust than calculating the average in light of the small sampling size. Conclusion: As a result of the added measures to keep into account of small sample size the user can better assess whether the library is satisfactory or whether error-prone PCR conditions should be adjusted. The program is available at www.mutanalyst.com.",
            "authors": [
                "Ferla M.P."
            ],
            "cit_count": 1,
            "journal": "BMC Bioinformatics",
            "pmid": "27044645",
            "title": "Mutanalyst, an online tool for assessing the mutational spectrum of epPCR libraries with poor sampling",
            "year": "2016-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:mutanalyst",
        "biotoolsID": "mutanalyst",
        "description": "Online tool for assessing the mutational spectrum of epPCR (error-prone PCR) libraries with poor sampling.",
        "homepage": "http://www.mutanalyst.com/",
        "name": "Mutanalyst"
    }
}