{
    "accessibility": "Open access",
    "additionDate": "2019-05-20T09:59:31Z",
    "biotoolsCURIE": "biotools:FishResp",
    "biotoolsID": "FishResp",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "sergey.morozov@helsinki.fi",
            "name": "Sergey Morozov",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "R package and GUI application for analysis of aquatic respirometry data.",
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/cran/FishResp"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://fishresp.org/",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-06-16T10:55:22Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://cran.r-project.org/web/packages/FishResp/index.html"
        }
    ],
    "maturity": "Mature",
    "name": "FishResp",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1093/conphys/coz003",
            "metadata": {
                "abstract": "© 2018 The Author(s).Intermittent-flow respirometry is widely used to measure oxygen uptake rates and subsequently estimate aerobic metabolic rates of aquatic animals. However, the lack of a standard quality-control software to detect technical problems represents a potential impediment to comparisons across studies in the field of evolutionary and conservation physiology. Here, we introduce FishResp', a versatile R package and its graphical implementation for quality-control and filtering of raw respirometry data. Our goal is to provide a straightforward, cross-platform and free software to help improve the quality and comparability of metabolic rate estimates for reducing methodological fragmentation in the field of aquatic respirometry. FishResp accepts data from various respirometry systems, allows users to detect potential mechanical problems which can occur during oxygen uptake measurements (e.g. chamber leaking, poor water circulation), and offers six options to correct raw data for microbial oxygen consumption. The software performs filtering of raw data based on user criteria, and produces accurate and unbiased estimates of absolute and mass-specific metabolic rates. Using data from three-spined sticklebacks (Gasterosteus aculeatus) and Trinidadian guppies (Poecilia reticulata), we demonstrate the virtues of FishResp, highlighting the importance of detecting mechanical problems and correcting measurements for background respiration.",
                "authors": [
                    {
                        "name": "Morozov S."
                    },
                    {
                        "name": "Scott McCairns R.J."
                    },
                    {
                        "name": "Merila J."
                    }
                ],
                "citationCount": 3,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Conservation Physiology",
                "title": "FishResp: R package and GUI application for analysis of aquatic respirometry data"
            },
            "pmcid": "PMC6364290",
            "pmid": "30746152",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        }
    ],
    "version": [
        "1.0.3"
    ]
}