
{
    "credit": [
        {
            "email": "raph@stat.ubc.ca",
            "name": "Raphael Gottardo",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "http://bioconductor.org/packages/release/bioc/html/BAC.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/BAC_1.34.0.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "language": [
            "R"
        ],
        "license": "Artistic-2.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "ChIP-seq",
                "uri": "http://edamontology.org/topic_3169"
            },
            {
                "term": "DNA binding sites",
                "uri": "http://edamontology.org/topic_3125"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Chromatin-immunoprecipitation microarrays (ChIP-chip) that enable researchers to identify regions of a given genome that are bound by specific DNA-binding proteins present new challenges for statistical analysis due to the large number of probes, the high noise-to-signal ratio, and the spatial dependence between probes. We propose a method called BAC (Bayesian analysis of ChIP-chip) to detect transcription factor bound regions, which incorporate the dependence between probes while making little assumptions about the bound regions (e.g., length). BAC is robust to probe outliers with an exchangeable prior for the variances, which allows different variances for the probes but still shrink extreme empirical variances. Parameter estimation is carried out using Markov chain Monte Carlo and inference is based on the joint distribution of the parameters. Bound regions are detected using posterior probabilities computed from the joint posterior distribution of neighboring probes. We show that these posterior probabilities are well calibrated and can be used to obtain an estimate of the false discovery rate. The method is illustrated using two publicly available ChIP-chip data sets containing 18 experimentally validated regions. We compare our method to four other baseline and commonly used techniques, namely, the Wilcoxon's rank sum test, TileMap, HGMM, and MAT. We found BAC and HGMM to perform best at detecting validated regions. However, HGMM appears to be very sensitive to probe outliers compared to BAC. In addition, we present a simulation study, which shows that BAC is more powerful than the other four techniques under various simulation scenarios while being robust to model misspecification. © 2008, The International Biometric Society.",
            "authors": [
                "Gottardo R.",
                "Li W.",
                "Johnson W.E.",
                "Liu X.S."
            ],
            "cit_count": 27,
            "doi": "10.1111/j.1541-0420.2007.00899.x",
            "journal": "Biometrics",
            "title": "A flexible and powerful Bayesian hierarchical model for ChIP-chip experiments",
            "type": "Primary",
            "year": "2008-06-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:bac",
        "biotoolsID": "bac",
        "description": "This package uses a Bayesian hierarchical model to detect enriched regions from ChIP-chip experiments.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/BAC.html",
        "name": "BAC",
        "version": [
            "1.34.0"
        ]
    }
}