{
    "additionDate": "2022-09-12T06:58:05.047039Z",
    "biotoolsCURIE": "biotools:dopi",
    "biotoolsID": "dopi",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Chris Johnson"
        },
        {
            "name": "Nicholas J. Balfour",
            "orcidid": "https://orcid.org/0000-0002-2426-3898"
        }
    ],
    "description": "The Database of Pollinator Interactions (DoPI) documents British pollinator-plant associations.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://www.dopi.org.uk/about"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.dopi.org.uk/",
    "lastUpdate": "2022-09-12T06:58:05.049714Z",
    "license": "Not licensed",
    "name": "DoPI",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1002/ECY.3801",
            "metadata": {
                "abstract": "© 2022 The Authors. Ecology published by Wiley Periodicals LLC on behalf of The Ecological Society of America.Despite the importance of pollinating insects to natural environments and agriculture, there have been few attempts to unite the existing plant–pollinator interaction datasets into a single depository using a common format. Accordingly, we have created one of the world's first online, open-access, and searchable pollinator–plant interaction databases. DoPI (The Database of Pollinator Interactions) was built from a systematic review of the scientific literature and unpublished datasets requested from researchers and organizations. We collated records of interactions between British plant and insect flower–visitor species (or genera), together with associated metadata (date, location, habitat, source publication) when available. The dataset currently (December 2021) contains 101,539 records, detailing over 320,000 interactions. The number of interactions (i.e., the number of times a pairwise species interaction was recorded per occasion) varies considerably among records, averaging 3.6. These include records from 1888 pollinator species and 1241 plant species, totaling >17,000 pairwise species interactions. By combining a large volume of information in a single repository, DoPI can be used to answer fundamental ecological questions on the dynamics of pollination interactions in space and time, as well as applied questions in conservation practice. We hope this dynamic database will be a useful tool not only for researchers, but also for conservationists, funding agencies, governmental departments, beekeepers, agronomists, and gardeners. We request that this paper is cited when using the data in publications and individual studies when appropriate. Researchers and organizations are encouraged to add further data in the future. The database can be accessed at: https://www.dopi.org.uk/.",
                "authors": [
                    {
                        "name": "Balfour N.J."
                    },
                    {
                        "name": "Castellanos M.C."
                    },
                    {
                        "name": "Goulson D."
                    },
                    {
                        "name": "Johnson C."
                    },
                    {
                        "name": "Philippides A."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Ecology",
                "title": "DoPI: The Database of Pollinator Interactions"
            },
            "pmid": "35754095"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Biological databases",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ],
    "validated": 1
}
