{
    "additionDate": "2021-01-18T11:18:10Z",
    "biotoolsCURIE": "biotools:imodulondb",
    "biotoolsID": "imodulondb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "palsson@ucsd.edu",
            "name": "Bernhard O Palsson",
            "typeEntity": "Person"
        }
    ],
    "description": "A knowledgebase of microbial transcriptional regulation derived from machine learning.\n\nIndependent Component Analysis of Bacterial Transcriptomes.\n\niModulonDB is maintained by the Systems Biology Research Group at the University of California, San Diego.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene regulatory network prediction",
                    "uri": "http://edamontology.org/operation_2437"
                },
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://imodulondb.org",
    "lastUpdate": "2021-02-04T07:29:04.821388Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://imodulondb.org/iModulon.html?organism=e_coli&dataset=precise1&k=12"
        }
    ],
    "name": "iModulonDB",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA810",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.Independent component analysis (ICA) of bacterial transcriptomes has emerged as a powerful tool for obtaining co-regulated, independently-modulated gene sets (iModulons), inferring their activities across a range of conditions, and enabling their association to known genetic regulators. By grouping and analyzing genes based on observations from big data alone, iModulons can provide a novel perspective into how the composition of the transcriptome adapts to environmental conditions. Here, we present iModulonDB (imodulondb.org), a knowledgebase of prokaryotic transcriptional regulation computed from high-quality transcriptomic datasets using ICA. Users select an organism from the home page and then search or browse the curated iModulons that make up its transcriptome. Each iModulon and gene has its own interactive dashboard, featuring plots and tables with clickable, hoverable, and downloadable features. This site enhances research by presenting scientists of all backgrounds with co-expressed gene sets and their activity levels, which lead to improved understanding of regulator-gene relationships, discovery of transcription factors, and the elucidation of unexpected relationships between conditions and genetic regulatory activity. The current release of iModulonDB covers three organisms (Escherichia coli, Staphylococcus aureus and Bacillus subtilis) with 204 iModulons, and can be expanded to cover many additional organisms.",
                "authors": [
                    {
                        "name": "Rychel K."
                    },
                    {
                        "name": "Decker K."
                    },
                    {
                        "name": "Sastry A.V."
                    },
                    {
                        "name": "Phaneuf P.V."
                    },
                    {
                        "name": "Poudel S."
                    },
                    {
                        "name": "Palsson B.O."
                    }
                ],
                "citationCount": 2,
                "date": "2021-01-08T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "iModulonDB: a knowledgebase of microbial transcriptional regulation derived from machine learning"
            },
            "pmid": "33045728"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ]
}