{
    "accessibility": "Open access",
    "additionDate": "2023-02-04T00:30:11.358628Z",
    "biotoolsCURIE": "biotools:ndnet",
    "biotoolsID": "ndnet",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Chengju Liu",
            "orcidid": "https://orcid.org/0000-0001-7543-0855"
        },
        {
            "name": "Qijun Chen",
            "orcidid": "https://orcid.org/0000-0001-5644-1188"
        },
        {
            "name": "Qingqing Yan",
            "orcidid": "https://orcid.org/0000-0002-3304-1584"
        },
        {
            "name": "Shu Li",
            "orcidid": "https://orcid.org/0000-0001-8225-5426"
        }
    ],
    "description": "Spacewise Multiscale Representation Learning via Neighbor Decoupling for Real-Time Driving Scene Parsing.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                }
            ]
        }
    ],
    "homepage": "https://github.com/LiShuTJ/NDNet",
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2023-02-04T00:30:11.361037Z",
    "license": "MIT",
    "name": "NDNet",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1109/TNNLS.2022.3221745",
            "metadata": {
                "abstract": "IEEEAs a safety-critical application, autonomous driving requires high-quality semantic segmentation and real-time performance for deployment. Existing method commonly suffers from information loss and massive computational burden due to high-resolution input-output and multiscale learning scheme, which runs counter to the real-time requirements. In contrast to channelwise information modeling commonly adopted by modern networks, in this article, we propose a novel real-time driving scene parsing framework named NDNet from a novel perspective of spacewise neighbor decoupling (ND) and neighbor coupling (NC). We first define and implement the reversible operations called ND and NC, which realize lossless resolution conversion for complementary thumbnails sampling and collation to facilitate spatial modeling. Based on ND and NC, we further propose three modules, namely, local capturer and global dependence builder (LCGB), spacewise multiscale feature extractor (SMFE), and high-resolution semantic generator (HSG), which form the whole pipeline of NDNet. The LCGB serves as a stem block to preprocess the large-scale input for fast but lossless resolution reduction and extract initial features with global context. Then the SMFE is used for dense feature extraction and can obtain rich multiscale features in spatial dimension with less computational overhead. As for high-resolution semantic output, the HSG is designed for fast resolution reconstruction and adaptive semantic confusion amending. Experiments show the superiority of the proposed method. NDNet achieves the state-of-the-art performance on the Cityscapes dataset which reports 76.47% mIoU at 240<inline-formula> <tex-math notation=\"LaTeX\">$+$</tex-math> </inline-formula> frames/s and 78.8% mIoU at 150<inline-formula> <tex-math notation=\"LaTeX\">$+$</tex-math> </inline-formula> frames/s on the benchmark. Codes are available at https://github.com/LiShuTJ/NDNet.",
                "authors": [
                    {
                        "name": "Chen Q."
                    },
                    {
                        "name": "Li S."
                    },
                    {
                        "name": "Liu C."
                    },
                    {
                        "name": "Wang D."
                    },
                    {
                        "name": "Yan Q."
                    },
                    {
                        "name": "Zhou X."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Neural Networks and Learning Systems",
                "title": "NDNet: Spacewise Multiscale Representation Learning via Neighbor Decoupling for Real-Time Driving Scene Parsing"
            },
            "pmid": "36409808"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ]
}
