{
    "additionDate": "2017-12-18T00:12:52Z",
    "biotoolsCURIE": "biotools:svdman",
    "biotoolsID": "svdman",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://public.lanl.gov/mewall/"
        }
    ],
    "description": "Singular value decomposition analysis of global gene expression data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://public.lanl.gov/mewall/svdman/svdman-0.9b/doc/svdman.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Microarray data analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://public.lanl.gov/mewall/svdman/",
    "language": [
        "C"
    ],
    "lastUpdate": "2024-11-25T14:49:24.356938Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/svdman-0-9b-singular-decomposition-microarray-analysis.html"
        }
    ],
    "name": "SVDMAN",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/17.6.566",
            "metadata": {
                "abstract": "We have developed two novel methods for Singular Value Decomposition analysis (SVD) of microarray data. The first is a threshold-based method for obtaining gene groups, and the second is a method for obtaining a measure of confidence in SVD analysis. Gene groups are obtained by identifying elements of the left singular vectors, or gene coefficient vectors, that are greater in magnitude than the threshold W N-1/2, where N is the number of genes, and W is a weight factor whose default value is 3. The groups are non-exclusive and may contain genes of opposite (i.e. inversely correlated) regulatory response. The confidence measure is obtained by systematically deleting assays from the data set, interpolating the SVD of the reduced data set to reconstruct the missing assay, and calculating the Pearson correlation between the reconstructed assay and the original data. This confidence measure is applicable when each experimental assay corresponds to a value of parameter that can be interpolated, such as time, dose or concentration. Algorithms for the grouping method and the confidence measure are available in a software application called SVD Microarray Analysis (SVDMAN). In addition to calculating the SVD for generic analysis, SVDMAN provides a new means for using microarray data to develop hypotheses for gene associations and provides a measure of confidence in the hypotheses, thus extending current SVD research in the area of global gene expression analysis.",
                "authors": [
                    {
                        "name": "Brettin T.S."
                    },
                    {
                        "name": "Dyck P.A."
                    },
                    {
                        "name": "Wall M.E."
                    }
                ],
                "citationCount": 81,
                "date": "2001-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "SVDMAN - Singular value decomposition analysis of microarray data"
            },
            "pmid": "11395437",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1,
    "version": [
        "0.9b"
    ]
}
