{
    "additionDate": "2018-06-24T10:49:23Z",
    "biotoolsCURIE": "biotools:litpathexplorer",
    "biotoolsID": "litpathexplorer",
    "credit": [
        {
            "email": "sophia.ananiadou@manchester.ac.uk",
            "name": "Sophia Ananiadou",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Confidence-based visual text analytics tool for exploring literature-enriched pathway models.",
    "documentation": [
        {
            "type": "General",
            "url": "http://nactem.ac.uk/LitPathExplorer_BI/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Relation extraction",
                    "uri": "http://edamontology.org/operation_3625"
                },
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                }
            ]
        }
    ],
    "homepage": "http://nactem.ac.uk/LitPathExplorer_BI/",
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "LitPathExplorer",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btx774",
            "metadata": {
                "abstract": "© 2017 The Author. Published by Oxford University Press. All rights reserved.Motivation Pathway models are valuable resources that help us understand the various mechanisms underpinning complex biological processes. Their curation is typically carried out through manual inspection of published scientific literature to find information relevant to a model, which is a laborious and knowledge-intensive task. Furthermore, models curated manually cannot be easily updated and maintained with new evidence extracted from the literature without automated support. Results We have developed LitPathExplorer, a visual text analytics tool that integrates advanced text mining, semi-supervised learning and interactive visualization, to facilitate the exploration and analysis of pathway models using statements (i.e. events) extracted automatically from the literature and organized according to levels of confidence. LitPathExplorer supports pathway modellers and curators alike by: (i) extracting events from the literature that corroborate existing models with evidence; (ii) discovering new events which can update models; and (iii) providing a confidence value for each event that is automatically computed based on linguistic features and article metadata. Our evaluation of event extraction showed a precision of 89% and a recall of 71%. Evaluation of our confidence measure, when used for ranking sampled events, showed an average precision ranging between 61 and 73%, which can be improved to 95% when the user is involved in the semi-supervised learning process. Qualitative evaluation using pair analytics based on the feedback of three domain experts confirmed the utility of our tool within the context of pathway model exploration.",
                "authors": [
                    {
                        "name": "Soto A.J."
                    },
                    {
                        "name": "Zerva C."
                    },
                    {
                        "name": "Batista-Navarro R."
                    },
                    {
                        "name": "Ananiadou S."
                    }
                ],
                "date": "2018-04-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "LitPathExplorer: A confidence-based visual text analytics tool for exploring literature-enriched pathway models"
            }
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        }
    ],
    "validated": 1
}