{
    "additionDate": "2021-01-18T10:23:26Z",
    "biotoolsCURIE": "biotools:pycabnn",
    "biotoolsID": "pycabnn",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "shhong@oist.jp",
            "name": "Sungho Hong",
            "typeEntity": "Person"
        }
    ],
    "description": "Efficient and Extensible Software to Construct an Anatomical Basis for a Physiologically Realistic Neural Network Model.\n\nPycabnn (Python tool for Constructing an Anatomical Basis of a Neural Network; pronounce it as \"pie cabin\") is a Python 3 package to aid building a physiologically realistic neural network model. Pycabnn is for setting up a structural basis of a model, such as placing neurons in space and determine their connectivity, based on anatomical constraints. It is primarily developed for a model of the granular layer in the cerebellar cortex [1]. However, we tried to make it as adaptable as possible to other circuit models.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Neurite measurement",
                    "uri": "http://edamontology.org/operation_3450"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/CNS-oist/pycabnn",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-30T14:43:21Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/CNS-OIST/pycabnn"
        }
    ],
    "name": "pycabnn",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3389/FNINF.2020.00031",
            "metadata": {
                "abstract": "© Copyright © 2020 Wichert, Jee, De Schutter and Hong.Physiologically detailed models of neural networks are an important tool for studying how biophysical mechanisms impact neural information processing. An important, fundamental step in constructing such a model is determining where neurons are placed and how they connect to each other, based on known anatomical properties and constraints given by experimental data. Here we present an open-source software tool, pycabnn, that is dedicated to generating an anatomical model, which serves as the basis of a full network model. In pycabnn, we implemented efficient algorithms for generating physiologically realistic cell positions and for determining connectivity based on extended geometrical structures such as axonal and dendritic morphology. We demonstrate the capabilities and performance of pycabnn by using an example, a network model of the cerebellar granular layer, which requires generating more than half a million cells and computing their mutual connectivity. We show that pycabnn is efficient enough to carry out all the required tasks on a laptop computer within reasonable runtime, although it can also run in a parallel computing environment. Written purely in Python with limited external dependencies, pycabnn is easy to use and extend, and it can be a useful tool for computational neural network studies in the future.",
                "authors": [
                    {
                        "name": "De Schutter E."
                    },
                    {
                        "name": "Hong S."
                    },
                    {
                        "name": "Jee S."
                    },
                    {
                        "name": "Wichert I."
                    }
                ],
                "citationCount": 1,
                "date": "2020-07-07T00:00:00Z",
                "journal": "Frontiers in Neuroinformatics",
                "title": "Pycabnn: Efficient and Extensible Software to Construct an Anatomical Basis for a Physiologically Realistic Neural Network Model"
            },
            "pmcid": "PMC7358899",
            "pmid": "32733226"
        }
    ],
    "topic": [
        {
            "term": "Biophysics",
            "uri": "http://edamontology.org/topic_3306"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
