{
    "additionDate": "2020-01-14T09:16:53Z",
    "biotoolsCURIE": "biotools:CANet",
    "biotoolsID": "CANet",
    "confidence_flag": "tool",
    "description": "Cross-disease Attention Network for Joint Diabetic Retinopathy and Diabetic Macular Edema Grading.\n\nDiabetic retinopathy (DR) and diabetic macular edema (DME) are the leading causes of permanent blindness in the working-age population. Automatic grading of DR and DME helps ophthalmologists design tailored treatments to patients, thus is of vital importance in the clinical practice. However, prior works either grade DR or DME, and ignore the correlation between DR and its complication, i.e., DME. Moreover, the location information, e.g., macula and soft hard exhaust annotations, are widely used as a prior for grading. Such annotations are costly to obtain, hence it is desirable to develop automatic grading methods with only image-level supervision. In this paper, we present a novel cross-disease attention network (CANet) to jointly grade DR and DME by exploring the internal relationship between the diseases with only image-level supervision",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/xmengli999/CANet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-10T12:33:13Z",
    "name": "CANet",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1109/TMI.2019.2951844",
            "metadata": {
                "abstract": "© 1982-2012 IEEE.Diabetic retinopathy (DR) and diabetic macular edema (DME) are the leading causes of permanent blindness in the working-age population. Automatic grading of DR and DME helps ophthalmologists design tailored treatments to patients, thus is of vital importance in the clinical practice. However, prior works either grade DR or DME, and ignore the correlation between DR and its complication, i.e., DME. Moreover, the location information, e.g., macula and soft hard exhaust annotations, are widely used as a prior for grading. Such annotations are costly to obtain, hence it is desirable to develop automatic grading methods with only image-level supervision. In this article, we present a novel cross-disease attention network (CANet) to jointly grade DR and DME by exploring the internal relationship between the diseases with only image-level supervision. Our key contributions include the disease-specific attention module to selectively learn useful features for individual diseases, and the disease-dependent attention module to further capture the internal relationship between the two diseases. We integrate these two attention modules in a deep network to produce disease-specific and disease-dependent features, and to maximize the overall performance jointly for grading DR and DME. We evaluate our network on two public benchmark datasets, i.e., ISBI 2018 IDRiD challenge dataset and Messidor dataset. Our method achieves the best result on the ISBI 2018 IDRiD challenge dataset and outperforms other methods on the Messidor dataset. Our code is publicly available at https://github.com/xmengli999/CANet.",
                "authors": [
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Hu X."
                    },
                    {
                        "name": "Yu L."
                    },
                    {
                        "name": "Zhu L."
                    },
                    {
                        "name": "Fu C.-W."
                    },
                    {
                        "name": "Heng P.-A."
                    }
                ],
                "citationCount": 16,
                "date": "2020-05-01T00:00:00Z",
                "journal": "IEEE Transactions on Medical Imaging",
                "title": "CANet: Cross-Disease Attention Network for Joint Diabetic Retinopathy and Diabetic Macular Edema Grading"
            },
            "pmid": "31714219"
        }
    ],
    "topic": [
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        }
    ],
    "validated": 1
}