{
    "additionDate": "2021-01-18T08:49:09Z",
    "biotoolsCURIE": "biotools:priori-t",
    "biotoolsID": "priori-t",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "adityar.rao@tcs.com",
            "name": "Aditya Rao",
            "orcidid": "https://orcid.org/0000-0002-7161-737X",
            "typeEntity": "Person"
        }
    ],
    "description": "A tool for rare disease gene prioritization using MEDLINE.\nPhenotype-driven rare disease gene prioritization relies on high quality curated resources containing disease, gene and phenotype annotations. However, the effectiveness of gene prioritization tools is constrained by the incomplete coverage of rare disease, phenotype and gene annotations in such curated resources. METHODS:We extracted rare disease correlation pairs involving diseases, phenotypes and genes from MEDLINE abstracts and used the information propagation algorithm GCAS to build an association network. We built a tool called PRIORI-T for rare disease gene prioritization that uses this network for phenotype-driven rare disease gene prioritization. The quality of disease-gene associations in PRIORI-T was compared with resources such as DisGeNET and Open Targets in the context of rare diseases",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                },
                {
                    "term": "Variant prioritisation",
                    "uri": "http://edamontology.org/operation_3226"
                }
            ]
        }
    ],
    "homepage": "https://web.rniapps.net/priori-t/PRIORI-T.tar.gz",
    "lastUpdate": "2021-01-27T17:09:17Z",
    "name": "PRIORI-T",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0231728",
            "metadata": {
                "abstract": "© 2020 Rao et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Introduction Phenotype-driven rare disease gene prioritization relies on high quality curated resources containing disease, gene and phenotype annotations. However, the effectiveness of gene prioritization tools is constrained by the incomplete coverage of rare disease, phenotype and gene annotations in such curated resources. Methods We extracted rare disease correlation pairs involving diseases, phenotypes and genes from MEDLINE abstracts and used the information propagation algorithm GCAS to build an association network. We built a tool called PRIORI-T for rare disease gene prioritization that uses this network for phenotype-driven rare disease gene prioritization. The quality of disease-gene associations in PRIORI-T was compared with resources such as DisGeNET and Open Targets in the context of rare diseases. The gene prioritization performance of PRI-ORI-T was evaluated using phenotype descriptions of 230 real-world rare disease clinical cases collated from recent publications, as well as compared to other gene prioritization tools such as HANRD and Orphamizer. Results PRIORI-T contains qualitatively better associations than DisGeNET and Open Targets. Furthermore, the causal genes were captured within Top-50 for more than 40% of the real-world clinical cases and within Top-300 for more than 72% of the cases when PRIORI-T was used for gene prioritization. It outperformed other gene prioritization tools such as HANRD and Orphamizer that primarily rely on curated resources. Conclusions PRIORI-T exhibited improved gene prioritization performance without requiring high quality curated data. Thus, it holds great promise in phenotype-driven gene prioritization for rare disease studies.",
                "authors": [
                    {
                        "name": "Joseph T."
                    },
                    {
                        "name": "Kotte S."
                    },
                    {
                        "name": "Rao A."
                    },
                    {
                        "name": "Saipradeep V.G."
                    },
                    {
                        "name": "Sivadasan N."
                    },
                    {
                        "name": "Srinivasan R."
                    }
                ],
                "date": "2020-04-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Priori-T: A tool for rare disease gene prioritization using MEDLINE"
            },
            "pmcid": "PMC7173875",
            "pmid": "32315351"
        }
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        }
    ]
}
