{
    "additionDate": "2019-11-14T19:42:37Z",
    "biotoolsCURIE": "biotools:ZIKAVID-Zika_virus_infection_database",
    "biotoolsID": "ZIKAVID-Zika_virus_infection_database",
    "confidence_flag": "high",
    "description": "> CORRECT NAME OF TOOL COULD ALSO BE 'ZIKAVID', 'ZIKA Virus Infection Database' | a new platform to analyze the molecular impact of Zika virus infection | ZIKV is a database that has been manually developed and cured by Brazilian researchers, experts in the fields of microbial infection and host-pathogen interaction, molecular biology, proteomics and neurochemistry. Our goal is to gather all information on gene expression alterations at mRNA and/or protein level promoted by Zika virus infection in different host models. The… | ZIKV is a database that has been manually developed and cured by Brazilian researchers, experts in the fields of microbial infection and host-pathogen interaction, molecular biology, proteomics and neurochemistry | The database provides information on genes which expression was experimentally measured after ZIKV infection",
    "download": [
        {
            "type": "Downloads page",
            "url": "https://zikavid.org/download/"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                }
            ]
        }
    ],
    "homepage": "https://zikavid.org",
    "lastUpdate": "2019-11-14T19:42:37Z",
    "name": "ZIKAVID-Zika virus infection database",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/S13365-019-00799-Y",
            "metadata": {
                "abstract": "© 2019, Journal of NeuroVirology, Inc.The recent outbreak of Zika virus (ZIKV) in Brazil and other countries globally demonstrated the relevance of ZIKV studies. During and after this outbreak, there was an intense increase in scientific production on ZIKV infections, especially toward alterations promoted by the infection and related to clinical outcomes. Considering this massive amount of new data, mainly thousands of genes and proteins whose expression is impacted by ZIKV infection, the ZIKA Virus Infection Database (ZIKAVID) was created. ZIKAVID is an online database that comprises all genes or proteins, and associated information, for which expression was experimentally measured and found to be altered after ZIKV infection. The database, available at https://zikavid.org, contains 16,984 entries of gene expression measurements from a total of 7348 genes. It allows users to easily perform searches for different experimental hosts (cell lines, tissues, and animal models), ZIKV strains (African, Asian, and Brazilian), and target molecules (messenger RNA [mRNA] and protein), among others, used in differential expression studies regarding ZIKV infection. In this way, the ZIKAVID will serve as an additional and important resource to improve the characterization of the molecular impact and pathogenesis associated with ZIKV infection.",
                "authors": [
                    {
                        "name": "Rosa R.L."
                    },
                    {
                        "name": "Santi L."
                    },
                    {
                        "name": "Berger M."
                    },
                    {
                        "name": "Tureta E.F."
                    },
                    {
                        "name": "Quincozes-Santos A."
                    },
                    {
                        "name": "Souza D.O."
                    },
                    {
                        "name": "Guimaraes J.A."
                    },
                    {
                        "name": "Beys-da-Silva W.O."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Journal of NeuroVirology",
                "title": "ZIKAVID—Zika virus infection database: a new platform to analyze the molecular impact of Zika virus infection"
            },
            "pmid": "31512145"
        }
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}