{
    "additionDate": "2020-01-14T09:48:46Z",
    "biotoolsCURIE": "biotools:TM3_seq",
    "biotoolsID": "TM3_seq",
    "confidence_flag": "tool",
    "description": "A Tagmentation-Mediated 3' Sequencing Approach for Improving Scalability of RNAseq Experiments.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Community profiling",
                    "uri": "http://edamontology.org/operation_3200"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "RNA-Seq quantification",
                    "uri": "http://edamontology.org/operation_3800"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://lufpa.github.io/TM3Seq-Pipeline/",
    "lastUpdate": "2024-11-24T20:48:32.353444Z",
    "name": "TM3 seq",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1534/g3.119.400821",
            "metadata": {
                "abstract": "RNA-seq has become the standard tool for collecting genome-wide expression data in diverse fields, from quantitative genetics and medical genomics to ecology and developmental biology. However, RNA-seq library preparation is still prohibitive for many laboratories. Recently, the field of single-cell transcriptomics has reduced costs and increased throughput by adopting early barcoding and pooling of individual samples —producing a single final library containing all samples. In contrast, RNA-seq protocols where each sample is processed individually are significantly more expensive and lower throughput than single-cell approaches. Yet, many projects depend on individual library generation to preserve important samples or for follow-up re-sequencing experiments. Improving on currently available RNA-seq methods we have developed TM39seq, a 39-enriched library preparation protocol that uses Tn5 transposase and preserves sample identity at each step. TM39seq is designed for high-throughput processing of individual samples (96 samples in 6h, with only 3h hands-on time) at a fraction of the cost of commercial kits ($1.5 per sample). The protocol was tested in a range of human and Drosophila melanogaster RNA samples, recovering transcriptomes of the same quality and reliability than the commercial NEBNext kit. We expect that the cost- and time-efficient features of TM39seq make large-scale RNA-seq experiments more permissive for the entire scientific community.",
                "authors": [
                    {
                        "name": "Ayroles J.F."
                    },
                    {
                        "name": "Pallares L.F."
                    },
                    {
                        "name": "Picard S."
                    }
                ],
                "citationCount": 23,
                "date": "2020-01-01T00:00:00Z",
                "journal": "G3: Genes, Genomes, Genetics",
                "title": "Tm39Seq: A tagmentation-mediated 39 sequencing approach for improving scalability of RNAseq experiments"
            },
            "pmcid": "PMC6945013",
            "pmid": "31676507"
        }
    ],
    "topic": [
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
