{
    "additionDate": "2017-08-03T18:47:11Z",
    "biotoolsCURIE": "biotools:intemap",
    "biotoolsID": "intemap",
    "credit": [
        {
            "email": "hqzhu@pku.edu.cn",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://cqb.pku.edu.cn/ZhuLab/"
        },
        {
            "email": "laibinbin@ctb.pku.edu.cn",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://cqb.pku.edu.cn/ZhuLab/"
        }
    ],
    "description": "Pipeline which integrates individual assemblers for assembling metagenomic short sequencing reads.",
    "documentation": [
        {
            "type": "User manual",
            "url": "http://cqb.pku.edu.cn/ZhuLab/InteMAP/Manual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "http://cqb.pku.edu.cn/ZhuLab/InteMAP/index.html",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/intemap-integrated-metagenomic-assembly-pipeline-for-ngs-short-reads.html"
        }
    ],
    "name": "InteMAP",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2015 Lai et al. Background: Next-generation sequencing (NGS) has greatly facilitated metagenomic analysis but also raised new challenges for metagenomic DNA sequence assembly, owing to its high-throughput nature and extremely short reads generated by sequencers such as Illumina. To date, how to generate a high-quality draft assembly for metagenomic sequencing projects has not been fully addressed. Results: We conducted a comprehensive assessment on state-of-the-art de novo assemblers and revealed that the performance of each assembler depends critically on the sequencing depth. To address this problem, we developed a pipeline named InteMAP to integrate three assemblers, ABySS, IDBA-UD and CABOG, which were found to complement each other in assembling metagenomic sequences. Making a decision of which assembling approaches to use according to the sequencing coverage estimation algorithm for each short read, the pipeline presents an automatic platform suitable to assemble real metagenomic NGS data with uneven coverage distribution of sequencing depth. By comparing the performance of InteMAP with current assemblers on both synthetic and real NGS metagenomic data, we demonstrated that InteMAP achieves better performance with a longer total contig length and higher contiguity, and contains more genes than others. Conclusions: We developed a de novo pipeline, named InteMAP, that integrates existing tools for metagenomics assembly. The pipeline outperforms previous assembly methods on metagenomic assembly by providing a longer total contig length, a higher contiguity and covering more genes. InteMAP, therefore, could potentially be a useful tool for the research community of metagenomics.",
                "authors": [
                    {
                        "name": "Lai B."
                    },
                    {
                        "name": "Wang F."
                    },
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Duan L."
                    },
                    {
                        "name": "Zhu H."
                    }
                ],
                "citationCount": 7,
                "date": "2015-08-07T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "InteMAP: Integrated metagenomic assembly pipeline for NGS short reads"
            },
            "pmid": "26250558"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ],
    "validated": 1
}