{
    "additionDate": "2017-01-17T15:02:03Z",
    "biotoolsCURIE": "biotools:deds",
    "biotoolsID": "deds",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "yxiao@itsa.ucsf.edu",
            "name": "Yuanyuan Xiao",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "This library contains functions that calculate various statistics of differential expression for microarray data, including t statistics, fold change, F statistics, SAM, moderated t and F and B statistics. It also implements a new methodology called Differential Expression via Distance Summary, which selects differentially expressed genes by integrating and summarizing a set of statistics using a weighted distance approach.",
    "documentation": [
        {
            "type": "User manual",
            "url": "http://bioconductor.org/packages/release/bioc/html/DEDS.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/DEDS_1.48.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/DEDS.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "license": "GPL-3.0",
    "name": "DEDS",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1016/j.compbiomed.2013.12.002",
            "metadata": {
                "abstract": "Background: In this study, we empirically evaluated the consistency and accuracy of five different methods to detect differentially expressed genes (DEGs) based on microarray data.Methods: Five different methods were compared, including the t-test, significance analysis of microarrays (SAM), the empirical Bayes t-test (eBayes), t-tests relative to a threshold (TREAT), and assumption adequacy averaging (AAA). The percentage of overlapping genes (POG) and the percentage of overlapping genes related (POGR) scores were used to rank the different methods on their ability to maintain a consistent list of DEGs both within the same data set and across two different data sets concerning the same disease. The power of each method was evaluated based on a simulation approach which mimics the multivariate distribution of the original microarray data.Results: For smaller sample sizes (6 or less per group), moderated versions of the t-test (SAM, eBayes, and TREAT) were superior in terms of both power and consistency relative to the t-test and AAA, with TREAT having the highest consistency in each scenario. Differences in consistency were most pronounced for comparisons between two different data sets for the same disease. For larger sample sizes AAA had the highest power for detecting small effect sizes, while TREAT had the lowest.Discussion: For smaller sample sizes moderated versions of the t-test can generally be recommended, while for larger sample sizes selection of a method to detect DEGs may involve a compromise between consistency and power. © 2013 Elsevier Ltd.",
                "authors": [
                    {
                        "name": "Yang D."
                    },
                    {
                        "name": "Parrish R.S."
                    },
                    {
                        "name": "Brock G.N."
                    }
                ],
                "citationCount": 9,
                "date": "2014-03-01T00:00:00Z",
                "journal": "Computers in Biology and Medicine",
                "title": "Empirical evaluation of consistency and accuracy of methods to detect differentially expressed genes based on microarray data"
            },
            "type": "Benchmarking study"
        },
        {
            "doi": "10.1016/j.compbiomed.2013.12.002",
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ],
    "validated": 1,
    "version": [
        "1.48.0"
    ]
}