{
    "additionDate": "2020-01-09T17:31:21Z",
    "biotoolsCURIE": "biotools:MTGO-SC",
    "biotoolsID": "MTGO-SC",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "smarini@med.umich.edu",
            "name": "Simone Marini",
            "typeEntity": "Person"
        }
    ],
    "description": "Tool to Explore Gene Modules in Single-Cell RNA Sequencing Data.\n\nMTGO applied to Single Cell analysis.\n\nMTGO analysis applied to Single Cell data version 0.2.0 from GitHub.\n\nMTGO-SC is an adaptation for single cell RNA-sequencing (scRNA-seq) of MTGO, a biological network module detection algorithm. MTGO-SC integrates external gene annotations, such as the Gene Ontology terms or Reactome pathways with the gene expression networks obtained from single-cell DGE matrices.\n\nThis package integrates MTGO (Module detection via Topological information and Gene Ontology (GO) knowledge) to single cell analysis. Effort is made to seamless integration of Seurat results, together with visualization and filtering functions.\n\nne1s0n/MTGOsc: MTGO analysis applied to Single Cell data.\n\nExtracting gene modules from single cell RNA-seq cell clusters",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network comparison",
                    "uri": "http://edamontology.org/operation_0277"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ne1s0n/MTGOsc",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-01-09T17:31:21Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://rdrr.io/github/ne1s0n/MTGOsc/"
        }
    ],
    "name": "MTGO-SC",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FGENE.2019.00953",
            "metadata": {
                "abstract": "© Copyright © 2019 Nazzicari, Vella, Coronnello, Di Silvestre, Bellazzi and Marini.The identification of functional modules in gene interaction networks is a key step in understanding biological processes. Network interpretation is essential for unveiling biological mechanisms, candidate biomarkers, or potential targets for drug discovery/repositioning. Plenty of biological module identification algorithms are available, although none is explicitly designed to perform the task on single-cell RNA sequencing (scRNA-seq) data. Here, we introduce MTGO-SC, an adaptation for scRNA-seq of our biological network module detection algorithm MTGO. MTGO-SC isolates gene functional modules by leveraging on both the network topological structure and the annotations characterizing the nodes (genes). These annotations are provided by an external source, such as databases and literature repositories (e.g., the Gene Ontology, Reactome). Thanks to the depth of single-cell data, it is possible to define one network for each cell cluster (typically, cell type or state) composing each sample, as opposed to traditional bulk RNA-seq, where the emerging gene network is averaged over the whole sample. MTGO-SC provides two complexity levels for interpretation: the gene-gene interaction and the intermodule interaction networks. MTGO-SC is versatile in letting the users define the rules to extract the gene network and integrated with the Seurat scRNA-seq analysis pipeline. MTGO-SC is available at https://github.com/ne1s0n/MTGOsc.",
                "authors": [
                    {
                        "name": "Nazzicari N."
                    },
                    {
                        "name": "Vella D."
                    },
                    {
                        "name": "Coronnello C."
                    },
                    {
                        "name": "Di Silvestre D."
                    },
                    {
                        "name": "Bellazzi R."
                    },
                    {
                        "name": "Marini S."
                    }
                ],
                "date": "2019-10-09T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "MTGO-SC, A Tool to Explore Gene Modules in Single-Cell RNA Sequencing Data"
            },
            "pmcid": "PMC6794379",
            "pmid": "31649730"
        }
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        }
    ]
}