{"credit":[{"name":"Contact form","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://support.brenda-enzymes.org/open.php?topicId=1"}],"documentation":[{"type":"GENERAL","url":"http://www.bto.brenda-enzymes.org/tutorial.php"}],"function":[{"operation":[{"term":"Ontology comparison","uri":"http://edamontology.org/operation_3352"},{"term":"Gene expression profiling","uri":"http://edamontology.org/operation_0314"},{"term":"Ontology visualisation","uri":"http://edamontology.org/operation_3559"}]}],"labels":{"language":["Java"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Database portal"],"topic":[{"term":"Ontology and terminology","uri":"http://edamontology.org/topic_0089"},{"term":"Enzymes","uri":"http://edamontology.org/topic_0821"},{"term":"Model organisms","uri":"http://edamontology.org/topic_0621"},{"term":"Biobank","uri":"http://edamontology.org/topic_3337"},{"term":"Microarray experiment","uri":"http://edamontology.org/topic_3518"}]},"publication":[{"abstract":"BTO, the BRENDA Tissue Ontology (http://www.BTO.brenda-enzymes.org) represents a comprehensive structured encyclopedia of tissue terms. The project started in 2003 to create a connection between the enzyme data collection of the BRENDA enzyme database and a structured network of source tissues and cell types. Currently, BTO contains more than 4600 different anatomical structures, tissues, cell types and cell lines, classified under generic categories corresponding to the rules and formats of the Gene Ontology Consortium and organized as a directed acyclic graph (DAG). Most of the terms are endowed with comments on their derivation or definitions. The content of the ontology is constantly curated with ̃1000 new terms each year. Four different types of relationships between the terms are implemented. A versatile web interface with several search and navigation functionalities allows convenient online access to the BTO and to the enzymes isolated from the tissues. Important areas of applications of the BTO terms are the detection of enzymes in tissues and the provision of a solid basis for text-mining approaches in this field. It is widely used by lab scientists, curators of genomic and biochemical databases and bioinformaticians. The BTO is freely available at http://www.obofoundry.org. © The Author(s) 2010.","authors":["Gremse M.","Chang A.","Schomburg I.","Grote A.","Scheer M.","Ebeling C.","Schomburg D."],"cit_count":66,"journal":"Nucleic Acids Research","pmid":"21030441","title":"The BRENDA Tissue Ontology (BTO): The first all-integrating ontology of all organisms for enzyme sources","year":"2011-01-01"}],"summary":{"biotoolsCURIE":"biotools:bto","biotoolsID":"bto","description":"BRENDA Tissue Ontology is a structured encyclopedia of tissue terms. BTO contains different anatomical structures, tissues, cell types and cell lines, classified under generic categories corresponding to the rules and formats of the Gene Ontology Consortium and organized as a directed acyclic graph (DAG). A versatile web interface with several search and navigation functionalities allows convenient online access to the BTO and to the enzymes isolated from the tissues.","homepage":"http://www.BTO.brenda-enzymes.org","name":"The BRENDA Tissue Ontology (BTO)"}}