{
    "additionDate": "2017-12-18T00:03:30Z",
    "biotoolsCURIE": "biotools:allegro",
    "biotoolsID": "allegro",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://acgt.cs.tau.ac.il/"
        }
    ],
    "description": "It does simultaneous discovery of cis-regulatory motifs and their associated expression profiles. Its input are DNA sequences (typically, promoters or 3′ UTRs) and genome-wide expression profiles. Its output is the set of motifs found, and for each motif the set of genes it regulates (its transcriptional module). It is highly efficient and can analyze expression profiles of thousands of genes, measured across dozens of experimental conditions, along with all regulatory sequences in the genome.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://acgt.cs.tau.ac.il/allegro/overview.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence motif discovery",
                    "uri": "http://edamontology.org/operation_0238"
                }
            ]
        }
    ],
    "homepage": "http://acgt.cs.tau.ac.il/allegro/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/allegro-1-0-amadeus-1-2-motif-discovery-platform.html"
        }
    ],
    "name": "Allegro",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1093/nar/gkn1064",
            "metadata": {
                "abstract": "A major goal of system biology is the characterization of transcription factors and microRNAs (miRNAs) and the transcriptional programs they regulate. We present Allegro, a method for de-novo discovery of cis-regulatory transcriptional programs through joint analysis of genome-wide expression data and promoter or 3′ UTR sequences. The algorithm uses a novel log-likelihood-based, non-parametric model to describe the expression pattern shared by a group of co-regulated genes. We show that Allegro is more accurate and sensitive than existing techniques, and can simultaneously analyze multiple expression datasets with more than 100 conditions. We apply Allegro on datasets from several species and report on the transcriptional modules it uncovers. Our analysis reveals a novel motif over-represented in the promoters of genes highly expressed in murine oocytes, and several new motifs related to fly development. Finally, using stem-cell expression profiles, we identify three miRNA families with pivotal roles in human embryogenesis. © 2009 The Author(s).",
                "authors": [
                    {
                        "name": "Halperin Y."
                    },
                    {
                        "name": "Linhart C."
                    },
                    {
                        "name": "Ulitsky I."
                    },
                    {
                        "name": "Shamir R."
                    }
                ],
                "citationCount": 29,
                "date": "2009-04-02T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Allegro: Analyzing expression and sequence in concert to discover regulatory programs"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}