{
    "additionDate": "2020-01-09T17:42:10Z",
    "biotoolsCURIE": "biotools:PADS_Arsenal",
    "biotoolsID": "PADS_Arsenal",
    "confidence_flag": "tool",
    "description": "A database of prokaryotic defense systems related genes.\n\nProcaryotic Antiviral Defense System.\n\nprocaryotic database, defense system database, pangenome database.\n\nPADS Arsenal A Database of Prokaryotic Defense Systems Related Genes.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Operon prediction",
                    "uri": "http://edamontology.org/operation_0435"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://bigd.big.ac.cn/padsarsenal",
    "lastUpdate": "2021-01-04T15:01:36Z",
    "name": "PADS Arsenal",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/NAR/GKZ916",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press on behalf of Nucleic Acids Research.Defense systems are vital weapons for prokaryotes to resist heterologous DNA and survive from the constant invasion of viruses, and they are widely used in biochemistry investigation and antimicrobial drug research. So far, numerous types of defense systems have been discovered, but there is no comprehensive defense systems database to organize prokaryotic defense gene datasets. To fill this gap, we unveil the prokaryotic antiviral defense system (PADS) Arsenal (https://bigd.big.ac.cn/padsarsenal), a public database dedicated to gathering, storing, analyzing and visualizing prokaryotic defense gene datasets. The initial version of PADS Arsenal integrates 18 distinctive categories of defense system with the annotation of 6 600 264 genes retrieved from 63,701 genomes across 33 390 species of archaea and bacteria. PADS Arsenal provides various ways to retrieve defense systems related genes information and visualize them with multifarious function modes. Moreover, an online analysis pipeline is integrated into PADS Arsenal to facilitate annotation and evolutionary analysis of defense genes. PADS Arsenal can also visualize the dynamic variation information of defense genes from pan-genome analysis. Overall, PADS Arsenal is a state-of-the-art open comprehensive resource to accelerate the research of prokaryotic defense systems.",
                "authors": [
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Zhang Z."
                    },
                    {
                        "name": "Zhang H."
                    },
                    {
                        "name": "Zhao Y."
                    },
                    {
                        "name": "Zhang Z."
                    },
                    {
                        "name": "Xiao J."
                    }
                ],
                "citationCount": 8,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PADS Arsenal: A database of prokaryotic defense systems related genes"
            },
            "pmid": "31620779"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Biochemistry",
            "uri": "http://edamontology.org/topic_3292"
        }
    ],
    "validated": 1
}