{
    "additionDate": "2021-01-18T08:47:40Z",
    "biotoolsCURIE": "biotools:besc",
    "biotoolsID": "besc",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "sudhir.varma@hithru.com",
            "name": "Sudhir Varma",
            "orcidid": "https://orcid.org/0000-0002-4096-4782",
            "typeEntity": "Person"
        }
    ],
    "description": "The Batch Effect Signature Correction (BESC) algorithm that uses the batch effect signatures calculated on the reference set to efficiently predict and remove Microarray batch effect, which has been the primary bottleneck for large-scale integration of data from multiple experiments.",
    "download": [
        {
            "type": "Software package",
            "url": "http://54.92.200.66/ExplainBio/besc_0.99.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                },
                {
                    "term": "Expression data visualisation",
                    "uri": "http://edamontology.org/operation_0571"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "http://explainbio.com/",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-31T18:09:58Z",
    "name": "BESC",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0231446",
            "metadata": {
                "abstract": "© 2020 Sudhir Varma. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Microarray batch effect (BE) has been the primary bottleneck for large-scale integration of data from multiple experiments. Current BE correction methods either need known batch identities (ComBat) or have the potential to overcorrect, by removing true but unknown biological differences (Surrogate Variable Analysis SVA). It is well known that experimental conditions such as array or reagent batches, PCR amplification or ozone levels can affect the measured expression levels; often the direction of perturbation of the measured expression is the same in different datasets. However, there are no BE correction algorithms that attempt to estimate the individual effects of technical differences and use them to correct expression data. In this manuscript, we show that a set of signatures, each of which is a vector the length of the number of probes, calculated on a reference set of microarray samples can predict much of the batch effect in other validation sets. We present a rationale of selecting a reference set of samples designed to estimate technical differences without removing biological differences. Putting both together, we introduce the Batch Effect Signature Correction (BESC) algorithm that uses the BES calculated on the reference set to efficiently predict and remove BE. Using two independent validation sets, we show that BESC is capable of removing batch effect without removing unknown but true biological differences. Much of the variations due to batch effect is shared between different microarray datasets. That shared information can be used to predict signatures (i.e. directions of perturbation) due to batch effect in new datasets. The correction can be precomputed without using the samples to be corrected (blind), done on each sample individually (single sample) and corrects only known technical effects without removing known or unknown biological differences (conservative). Those three characteristics make it ideal for high-throughput correction of samples for a microarray data repository. We also compare the performance of BESC to three other batch correction methods: SVA, Removing Unwanted Variation (RUV) and Hidden Covariates with Prior (HCP). An R Package besc implementing the algorithm is available from http://explainbio.com.",
                "authors": [
                    {
                        "name": "Varma S."
                    }
                ],
                "citationCount": 2,
                "date": "2020-04-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Blind estimation and correction of microarray batch effect"
            },
            "pmcid": "PMC7145015",
            "pmid": "32271844"
        }
    ],
    "toolType": [
        "Library",
        "Web application"
    ],
    "topic": [
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        }
    ]
}