{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:20:24Z",
    "biotoolsCURIE": "biotools:DBTL",
    "biotoolsID": "DBTL",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "hrbeller@lbl.gov",
            "name": "Harry R. Beller",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The Design Build Test Learn (DBTL) cycle, facilitated by exponentially improving capabilities in synthetic biology, is an increasingly adopted metabolic engineering framework that represents a more systematic and efficient approach to strain development than historical efforts in biofuels and bio-based products.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://panoramaweb.org/DBTL-ML-for-dodencanol-production-in-e-coli.url",
    "lastUpdate": "2020-06-16T10:55:25Z",
    "license": "Unlicense",
    "maturity": "Mature",
    "name": "DBTL",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1021/ACSSYNBIO.9B00020",
            "metadata": {
                "abstract": "© 2019 American Chemical Society.The Design-Build-Test-Learn (DBTL) cycle, facilitated by exponentially improving capabilities in synthetic biology, is an increasingly adopted metabolic engineering framework that represents a more systematic and efficient approach to strain development than historical efforts in biofuels and biobased products. Here, we report on implementation of two DBTL cycles to optimize 1-dodecanol production from glucose using 60 engineered Escherichia coli MG1655 strains. The first DBTL cycle employed a simple strategy to learn efficiently from a relatively small number of strains (36), wherein only the choice of ribosome-binding sites and an acyl-ACP/acyl-CoA reductase were modulated in a single pathway operon including genes encoding a thioesterase (UcFatB1), an acyl-ACP/acyl-CoA reductase (Maqu-2507, Maqu-2220, or Acr1), and an acyl-CoA synthetase (FadD). Measured variables included concentrations of dodecanol and all proteins in the engineered pathway. We used the data produced in the first DBTL cycle to train several machine-learning algorithms and to suggest protein profiles for the second DBTL cycle that would increase production. These strategies resulted in a 21% increase in dodecanol titer in Cycle 2 (up to 0.83 g/L, which is more than 6-fold greater than previously reported batch values for minimal medium). Beyond specific lessons learned about optimizing dodecanol titer in E. coli, this study had findings of broader relevance across synthetic biology applications, such as the importance of sequencing checks on plasmids in production strains as well as in cloning strains, and the critical need for more accurate protein expression predictive tools.",
                "authors": [
                    {
                        "name": "Opgenorth P."
                    },
                    {
                        "name": "Costello Z."
                    },
                    {
                        "name": "Okada T."
                    },
                    {
                        "name": "Goyal G."
                    },
                    {
                        "name": "Chen Y."
                    },
                    {
                        "name": "Gin J."
                    },
                    {
                        "name": "Benites V."
                    },
                    {
                        "name": "De Raad M."
                    },
                    {
                        "name": "Northen T.R."
                    },
                    {
                        "name": "Deng K."
                    },
                    {
                        "name": "Deutsch S."
                    },
                    {
                        "name": "Baidoo E.E.K."
                    },
                    {
                        "name": "Petzold C.J."
                    },
                    {
                        "name": "Hillson N.J."
                    },
                    {
                        "name": "Garcia Martin H."
                    },
                    {
                        "name": "Beller H.R."
                    }
                ],
                "citationCount": 24,
                "date": "2019-06-21T00:00:00Z",
                "journal": "ACS Synthetic Biology",
                "title": "Lessons from Two Design-Build-Test-Learn Cycles of Dodecanol Production in Escherichia coli Aided by Machine Learning"
            },
            "pmid": "31072100",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Synthetic biology",
            "uri": "http://edamontology.org/topic_3895"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}