{"credit":[{"name":"SIB Swiss Institute of Bioinformatics","typeEntity":"Institute","typeRoles":["Provider"]},{"email":"helpdesk@expasy.org","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://swissregulon.unibas.ch/sr/documentation"}],"function":[{"operation":[{"term":"Pathway or network prediction","uri":"http://edamontology.org/operation_3439"},{"term":"Sequence alignment","uri":"http://edamontology.org/operation_0292"}]}],"labels":{"elixirNode":["Switzerland"],"elixirPlatform":["Data"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Database portal"],"topic":[{"term":"Genomics","uri":"http://edamontology.org/topic_0622"},{"term":"Systems biology","uri":"http://edamontology.org/topic_2259"},{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"},{"term":"Transcription factors and regulatory sites","uri":"http://edamontology.org/topic_0749"},{"term":"Gene transcripts","uri":"http://edamontology.org/topic_3512"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://expasy.org"}],"publication":[{"abstract":"Identification of genomic regulatory elements is essential for understanding the dynamics of cellular processes. This task has been substantially facilitated by the availability of genome sequences for many species and high-throughput data of transcripts and transcription factor (TF) binding. However, rigorous computational methods are necessary to derive accurate genome-wide annotations of regulatory sites from such data. SwissRegulon (http://swissregulon.unibas.ch) is a database containing genome-wide annotations of regulatory motifs, promoters and TF binding sites (TFBSs) in promoter regions across model organisms. Its binding site predictions were obtained with rigorous Bayesian probabilistic methods that operate on orthologous regions from related genomes, and use explicit evolutionary models to assess the evidence of purifying selection on each site. New in the current version of SwissRegulon is a curated collection of 190 mammalian regulatory motifs associated with 340 TFs, and TFBS annotations across a curated set of 35000 promoters in both human and mouse. Predictions of TFBSs for Saccharomyces cerevisiae have also been significantly extended and now cover 158 of yeast's 180 TFs. All data are accessible through both an easily navigable genome browser with search functions, and as flat files that can be downloaded for further analysis. © The Author(s) 2012.","authors":["Pachkov M.","Balwierz P.J.","Arnold P.","Ozonov E.","Van Nimwegen E."],"cit_count":48,"doi":"10.1093/nar/gks1145","journal":"Nucleic Acids Research","title":"SwissRegulon, a database of genome-wide annotations of regulatory sites: Recent updates","type":"Primary","year":"2013-01-01"}],"summary":{"biotoolsCURIE":"biotools:swissregulon","biotoolsID":"swissregulon","description":"SwissRegulon is a database of genome-wide annotations of regulatory sites. It contains annotations for 17 prokaryotes and 3 eukaryotes. The database frontend offers an intuitive interface showing genomic information in a clear and comprehensible graphical form.","homepage":"http://swissregulon.unibas.ch/sr/","name":"SwissRegulon"}}