{
    "additionDate": "2020-01-14T09:06:06Z",
    "biotoolsCURIE": "biotools:ImageDataExtractor",
    "biotoolsID": "ImageDataExtractor",
    "confidence_flag": "tool",
    "description": "A Tool To Extract and Quantify Data from Microscopy Images.\n\nExtract relevant images using ChemDataExtractor.\n\nIdentify regions corresponding to individual particles",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Single particle alignment and classification",
                    "uri": "http://edamontology.org/operation_3458"
                },
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "homepage": "http://www.imagedataextractor.org",
    "lastUpdate": "2020-12-14T09:04:41Z",
    "license": "MIT",
    "name": "ImageDataExtractor",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.9B00734",
            "metadata": {
                "abstract": "Copyright © 2019 American Chemical Society.The rise of data science is leading to new paradigms in data-driven materials discovery. This carries an essential notion that large data sources containing chemical structure and property information can be mined in a fashion that detects and exploits structure-property relationships, such that chemicals can be predicted to suit a given material application. The success of material predictions is predicated on these large data sources of chemical structure and property information being suited to a target application. Microscopy is commonly used to characterize chemical structure, especially in fields such as nanotechnology where material properties are highly dependent on the size and shape of nanoparticles. Large data sources of nanoparticle information stemming from microscopy images would thus be highly beneficial. Millions of microscopy images exist, but they lie fragmented across the literature, typically presented individually within a paper article and usually in a qualitative fashion therein, even though they harbor a wealth of numeric information. We present the ImageDataExtractor toolkit that autoidentifies and autoextracts microscopy images from scientific documents, whereupon it autonomously analyzes each image to produce quantitative particle size and shape information about its subject material. Each image is quantified by decoding its scale bar information using optical character recognition, with help from super-resolution convolutional neural networks where required. Individual particles are detected and profiled using various thresholding, segmentation, polygon fitting, and edge correction routines. The high-throughput operational capability of ImageDataExtractor means that it can be used to generate large-data sources of particle information for data-driven materials discovery. Evaluation metrics, precision and recall, are greater than 80% for the majority of the image processing steps, and precision is above 80% for all critical steps. The ImageDataExtractor tool is released under the MIT license and is available to download from http://www.imagedataextractor.org.",
                "authors": [
                    {
                        "name": "Beard E.J."
                    },
                    {
                        "name": "Cole J.M."
                    },
                    {
                        "name": "Mukaddem K.T."
                    },
                    {
                        "name": "Yildirim B."
                    }
                ],
                "citationCount": 9,
                "date": "2020-05-26T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "ImageDataExtractor: A Tool to Extract and Quantify Data from Microscopy Images"
            },
            "pmid": "31714792"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
