{
    "additionDate": "2016-04-22T12:24:13Z",
    "biotoolsCURIE": "biotools:biana",
    "biotoolsID": "biana",
    "credit": [
        {
            "name": "Javier Garcia-Garcia",
            "orcidid": "http://orcid.org/0000-0001-9539-2606",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "upf.edu",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "baldo.oliva@upf.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "This is the web server for BIANA (Biological Interactions And Network Analysis). Here, you can run BIANA by specifying your desired seed bioentities (e.g. proteins), setting the parameters (e.g. depth of network) and choosing which commands to run (e.g. print network in Cytoscape format).",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://sbi.imim.es/web/index.php/research/servers/biana?page=biana.server"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                }
            ]
        }
    ],
    "homepage": "http://sbi.imim.es/web/index.php/research/servers/biana?page=biana.server",
    "lastUpdate": "2018-12-29T14:31:02Z",
    "name": "BIANA",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "baldo.oliva@upf.edu",
    "publication": [
        {
            "doi": "10.1186/1471-2105-11-56",
            "metadata": {
                "abstract": "Background: The analysis and usage of biological data is hindered by the spread of information across multiple repositories and the difficulties posed by different nomenclature systems and storage formats. In particular, there is an important need for data unification in the study and use of protein-protein interactions. Without good integration strategies, it is difficult to analyze the whole set of available data and its properties.Results: We introduce BIANA (Biologic Interactions and Network Analysis), a tool for biological information integration and network management. BIANA is a Python framework designed to achieve two major goals: i) the integration of multiple sources of biological information, including biological entities and their relationships, and ii) the management of biological information as a network where entities are nodes and relationships are edges. Moreover, BIANA uses properties of proteins and genes to infer latent biomolecular relationships by transferring edges to entities sharing similar properties. BIANA is also provided as a plugin for Cytoscape, which allows users to visualize and interactively manage the data. A web interface to BIANA providing basic functionalities is also available. The software can be downloaded under GNU GPL license from http://sbi.imim.es/web/BIANA.php.Conclusions: BIANA's approach to data unification solves many of the nomenclature issues common to systems dealing with biological data. BIANA can easily be extended to handle new specific data repositories and new specific data types. The unification protocol allows BIANA to be a flexible tool suitable for different user requirements: non-expert users can use a suggested unification protocol while expert users can define their own specific unification rules. © 2010 Garcia-Garcia et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Garcia-Garcia J."
                    },
                    {
                        "name": "Guney E."
                    },
                    {
                        "name": "Aragues R."
                    },
                    {
                        "name": "Planas-Iglesias J."
                    },
                    {
                        "name": "Oliva B."
                    }
                ],
                "citationCount": 51,
                "date": "2010-01-27T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Biana: A software framework for compiling biological interactions and analyzing networks"
            },
            "pmcid": "PMC3098100",
            "pmid": "20105306",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web API"
    ],
    "topic": [
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}