
{
    "credit": [
        {
            "email": "barrett@ncbi.nlm.nih.gov",
            "name": "Tanya Barrett",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://www.ncbi.nlm.nih.gov/geo/info/overview.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Gene expression clustering",
                    "uri": "http://edamontology.org/operation_0313"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Animal and Crop Genomics"
        ],
        "license": "ODbL-1.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "Microarray experiment",
                "uri": "http://edamontology.org/topic_3518"
            },
            {
                "term": "Experimental design and studies",
                "uri": "http://edamontology.org/topic_3678"
            },
            {
                "term": "Probes and primers",
                "uri": "http://edamontology.org/topic_0632"
            }
        ]
    },
    "publication": [
        {
            "abstract": "A decade ago, the Gene Expression Omnibus (GEO) database was established at the National Center for Biotechnology Information (NCBI). The original objective of GEO was to serve as a public repository for high-throughput gene expression data generated mostly by microarray technology. However, the research community quickly applied microarrays to non-gene-expression studies, including examination of genome copy number variation and genome-wide profiling of DNA-binding proteins. Because the GEO database was designed with a flexible structure, it was possible to quickly adapt the repository to store these data types. More recently, as the microarray community switches to next-generation sequencing technologies, GEO has again adapted to host these data sets. Today, GEO stores over 20 000 microarray- and sequence-based functional genomics studies, and continues to handle the majority of direct high-throughput data submissions from the research community. Multiple mechanisms are provided to help users effectively search, browse, download and visualize the data at the level of individual genes or entire studies. This paper describes recent database enhancements, including new search and data representation tools, as well as a brief review of how the community uses GEO data. GEO is freely accessible at http://www.ncbi.nlm.nih.gov/geo/. © The Author(s) 2010.",
            "authors": [
                "Barrett T.",
                "Troup D.B.",
                "Wilhite S.E.",
                "Ledoux P.",
                "Evangelista C.",
                "Kim I.F.",
                "Tomashevsky M.",
                "Marshall K.A.",
                "Phillippy K.H.",
                "Sherman P.M.",
                "Muertter R.N.",
                "Holko M.",
                "Ayanbule O.",
                "Yefanov A.",
                "Soboleva A."
            ],
            "cit_count": 698,
            "journal": "Nucleic Acids Research",
            "pmid": "21097893",
            "title": "NCBI GEO: Archive for functional genomics data sets-10 years on",
            "year": "2011-01-01"
        },
        {
            "abstract": "The Gene Expression Omnibus (GEO) project was initiated in response to the growing demand for a public repository for high-throughput gene expression data. GEO provides a flexible and open design that facilitates submission, storage and retrieval of heterogeneous data sets from high-throughput gene expression and genomic hybridization experiments. GEO is not intended to replace in house gene expression databases that benefit from coherent data sets, and which are constructed to facilitate a particular analytic method, but rather complement these by acting as a tertiary, central data distribution hub. The three central data entities of GEO are platforms, samples and series, and were designed with gene expression and genomic hybridization experiments in mind. A platform is, essentially, a list of probes that define what set of molecules may be detected. A sample describes the set of molecules that are being probed and references a single platform used to generate its molecular abundance data. A series organizes samples into the meaningful data sets which make up an experiment. The GEO repository is publicly accessible through the World Wide Web at http://www.ncbi.nlm.nih.gov/geo.",
            "authors": [
                "Edgar R.",
                "Domrachev M.",
                "Lash A.E."
            ],
            "cit_count": 5298,
            "journal": "Nucleic Acids Research",
            "pmid": "11752295",
            "title": "Gene Expression Omnibus: NCBI gene expression and hybridization array data repository",
            "year": "2002-01-01"
        },
        {
            "abstract": "",
            "authors": [
                "Ball C.A.",
                "Brazma A.",
                "Causton H.",
                "Chervitz S.",
                "Edgar R.",
                "Hingamp P.",
                "Matese J.C.",
                "Parkinson H.",
                "Quackenbush J.",
                "Ringwald M.",
                "Sansone S.-A.",
                "Sherlock G.",
                "Spellman P.",
                "Stoeckert C.",
                "Tateno Y.",
                "Taylor R.",
                "White J.",
                "Winegarden N."
            ],
            "cit_count": 95,
            "journal": "PLoS Biology",
            "pmid": "15340489",
            "title": "Submission of microarray data to public repositories",
            "year": "2004-09-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:ncbi_geo",
        "biotoolsID": "ncbi_geo",
        "description": "Database that stores over 20,000 microarray- and sequence-based functional genomics studies, and continues to handle the majority of direct high-throughput data submissions from the research community. Multiple mechanisms are provided to help users effectively search, browse, download and visualize the data at the level of individual genes or entire studies.",
        "homepage": "http://www.ncbi.nlm.nih.gov/geo/",
        "name": "NCBI GEO"
    }
}