
{
    "credit": [
        {
            "email": "hector.sanz@isglobal.org",
            "name": "Hector Sanz",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://cran.r-project.org/web/packages/drLumi/vignettes/drLumi.pdf"
        },
        {
            "url": "https://cran.r-project.org/web/packages/drLumi/drLumi.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "Data management",
                "uri": "http://edamontology.org/topic_3071"
            },
            {
                "term": "Data quality management",
                "uri": "http://edamontology.org/topic_3572"
            },
            {
                "term": "Immunology",
                "uri": "http://edamontology.org/topic_0804"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2017 Sanz et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited. Multiplex bead-based immunoassays are used to measure concentrations of several analytes simultaneously. These assays include control standard curves (SC) to reduce between-plate variability and normalize quantitation of analytes of biological samples. Suboptimal calibration might result in large random error and decreased number of samples with analyte concentrations within the limits of quantification. Suboptimal calibration may be a consequence of poor fitness of the functions used for the SC, the treatment of the background noise and the method used to estimate the limits of quantification. Currently assessment of fitness of curves is largely dependent on operator and that may add additional error. Moreover, there is no software to automate data managing and quality control. In this article we present a R package, drLumi, with functions for managing data, calibrating assays and performing quality control. To optimize the assay the package implements: i) three dose-response functions, ii) four approaches for treating background noise and iii) three methods for estimating limits of quantifications. Other implemented functions are focused on the quality control of the fitted standard curve: detection of outliers, estimation of the confidence or prediction interval, and estimation of summary statistics. With demonstration purpose, we apply the software to 30 cytokines, chemokines and growth factors measured in a multiplex bead-based immunoassay in a study aiming to measure correlates of risk or protection from malaria of the RTS,S malaria vaccine nested in the Phase 3 randomized controlled trial of this vaccine.",
            "authors": [
                "Sanz H.",
                "Aponte J.J.",
                "Harezlak J.",
                "Dong Y.",
                "Ayestaran A.",
                "Nhabomba A.",
                "Mpina M.",
                "Maurin O.R.",
                "Diez-Padrisa N.",
                "Aguilar R.",
                "Moncunill G.",
                "Todagbe A.S.",
                "Daubenberger C.",
                "Dobano C.",
                "Valim C."
            ],
            "cit_count": 2,
            "doi": "10.1371/journal.pone.0187901",
            "journal": "PLoS ONE",
            "title": "drLumi: An open-source package to manage data, calibrate, and conduct quality control of multiplex bead-based immunoassays data analysis",
            "type": "Primary",
            "year": "2017-11-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:drlumi",
        "biotoolsID": "drlumi",
        "description": "Quality control routines for multiplex immunoassay data, including several approaches for: treating the background noise of the assay, fitting the dose-response curves and estimating the limits of quantification.",
        "homepage": "https://cran.r-project.org/web/packages/drLumi/index.html",
        "name": "drLumi"
    }
}