{
    "accessibility": "Open access",
    "additionDate": "2024-01-08T08:58:57.393664Z",
    "biotoolsCURIE": "biotools:tox21enricher",
    "biotoolsID": "tox21enricher",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "auerbachs@niehs.nih.gov",
            "name": "Scott Auerbach",
            "typeEntity": "Person"
        },
        {
            "email": "junguk.hur@med.und.edu",
            "name": "Junguk Hur",
            "typeEntity": "Person"
        }
    ],
    "description": "Shiny application for toxicity functional annotation analysis.",
    "download": [
        {
            "type": "Software package",
            "url": "http://hurlab.med.und.edu/tox21enricher_db.tar.gz"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "homepage": "http://hurlab.med.und.edu/Tox21Enricher/",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-01-08T08:58:57.396314Z",
    "license": "CC-BY-4.0",
    "name": "Tox21Enricher",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FTOX.2023.1147608",
            "metadata": {
                "abstract": "Inference of toxicological and mechanistic properties of untested chemicals through structural or biological similarity is a commonly employed approach for initial chemical characterization and hypothesis generation. We previously developed a web-based application, Tox21Enricher-Grails, on the Grails framework that identifies enriched biological/toxicological properties of chemical sets for the purpose of inferring properties of untested chemicals within the set. It was able to detect significantly overrepresented biological (e.g., receptor binding), toxicological (e.g., carcinogenicity), and chemical (e.g., toxicologically relevant chemical substructures) annotations within sets of chemicals screened in the Tox21 platform. Here, we present an R Shiny application version of Tox21Enricher-Grails, Tox21Enricher-Shiny, with more robust features and updated annotations. Tox21Enricher-Shiny allows users to interact with the web application component (available at http://hurlab.med.und.edu/Tox21Enricher/) through a user-friendly graphical user interface or to directly access the application’s functions through an application programming interface. This version now supports InChI strings as input in addition to CASRN and SMILES identifiers. Input chemicals that contain certain reactive functional groups (nitrile, aldehyde, epoxide, and isocyanate groups) may react with proteins in cell-based Tox21 assays: this could cause Tox21Enricher-Shiny to produce spurious enrichment analysis results. Therefore, this version of the application can now automatically detect and ignore such problematic chemicals in a user’s input. The application also offers new data visualizations, and the architecture has been greatly simplified to allow for simple deployment, version control, and porting. The application may be deployed onto a Posit Connect or Shiny server, and it uses Postgres for database management. As other Tox21-related tools are being migrated to the R Shiny platform, the development of Tox21Enricher-Shiny is a logical transition to use R’s strong data analysis and visualization capacities and to provide aesthetic and developmental consistency with other Tox21 applications developed by the Division of Translational Toxicology (DTT) at the National Institute of Environmental Health Sciences (NIEHS).",
                "authors": [
                    {
                        "name": "Auerbach S."
                    },
                    {
                        "name": "Combs P."
                    },
                    {
                        "name": "Erickson J."
                    },
                    {
                        "name": "Guo K."
                    },
                    {
                        "name": "Hsieh J.-H."
                    },
                    {
                        "name": "Hur J."
                    },
                    {
                        "name": "Nolte S."
                    },
                    {
                        "name": "Schmitt C."
                    }
                ],
                "date": "2023-01-01T00:00:00Z",
                "journal": "Frontiers in Toxicology",
                "title": "Tox21Enricher-Shiny: an R Shiny application for toxicity functional annotation analysis"
            },
            "pmcid": "PMC10333489",
            "pmid": "37441091"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        },
        {
            "term": "Compound libraries and screening",
            "uri": "http://edamontology.org/topic_3343"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Toxicology",
            "uri": "http://edamontology.org/topic_2840"
        }
    ]
}
