{
    "accessibility": "Open access",
    "additionDate": "2022-05-15T09:43:33.456849Z",
    "biotoolsCURIE": "biotools:deeprex",
    "biotoolsID": "deeprex",
    "collectionID": [
        "Bologna Biocomputing Group"
    ],
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "pierluigi.martelli@unibo.it",
            "name": "Pier Luigi Martelli",
            "orcidid": "https://orcid.org/0000-0002-0274-5669",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "castrense.savojardo2@unibo.it",
            "name": "Castrense Savojardo",
            "orcidid": "https://orcid.org/0000-0002-7359-0633",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "matteo.manfredi4@unibo.it",
            "name": "Matteo Manfredi",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "email": "rita.casadio@unibo.it",
            "name": "Rita Casadio",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A web server for characterising protein-solvent interaction starting from sequence.",
    "documentation": [
        {
            "note": "Web application manual",
            "type": [
                "User manual"
            ],
            "url": "https://deeprex.biocomp.unibo.it/about/tutorial/"
        },
        {
            "type": [
                "Command-line options"
            ],
            "url": "https://github.com/BolognaBiocomp/deeprex"
        }
    ],
    "download": [
        {
            "type": "Container file",
            "url": "https://hub.docker.com/r/bolognabiocomp/deeprex"
        },
        {
            "type": "Source code",
            "url": "https://github.com/BolognaBiocomp/deeprex"
        }
    ],
    "editPermission": {
        "authors": [
            "ELIXIR-ITA-BOLOGNA"
        ],
        "type": "group"
    },
    "elixirNode": [
        "Italy"
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein sequence",
                        "uri": "http://edamontology.org/data_2976"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Molecular surface calculation",
                    "uri": "http://edamontology.org/operation_0387"
                },
                {
                    "term": "Protein disorder prediction",
                    "uri": "http://edamontology.org/operation_3904"
                },
                {
                    "term": "Protein structure validation",
                    "uri": "http://edamontology.org/operation_0321"
                }
            ]
        }
    ],
    "homepage": "https://deeprex.biocomp.unibo.it",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-03-07T17:57:11.201008Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/BolognaBiocomp/deeprex"
        }
    ],
    "maturity": "Mature",
    "name": "DeepREx",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-ITA-BOLOGNA",
    "publication": [
        {
            "doi": "10.1016/J.CSBJ.2021.10.016",
            "metadata": {
                "abstract": "Protein–solvent interaction provides important features for protein surface engineering when the structure is absent or partially solved. Presently, we can integrate the notion of solvent exposed/buried residues with that of their flexibility and intrinsic disorder to highlight regions where mutations may increase or decrease protein stability in order to modify proteins for biotechnological reasons, while preserving their functional integrity. Here we describe a web server, which provides the unique possibility of integrating knowledge of solvent and non-solvent exposure with that of residue conservation, flexibility and disorder of a protein sequence, for a better understanding of which regions are relevant for protein integrity. The core of the webserver is DeepREx, a novel deep learning-based tool that classifies each residue in the sequence as buried or exposed. DeepREx is trained on a high-quality, non-redundant dataset derived from the Protein Data Bank comprising 2332 monomeric protein chains and benchmarked on a blind test set including 200 protein sequences unrelated with the training set. Results show that DeepREx performs at the state-of-the-art in the field. In turn, the Web Server, DeepREx-WS, supplements the predictions of DeepREx with features that allow a better characterisation of exposed and buried regions: i) residue conservation derived from multiple sequence alignment; ii) local sequence hydrophobicity; iii) residue flexibility computed with MEDUSA; iv) a predictor of secondary structure; v) the presence of disordered regions as derived from MobiDB-Lite3.0. The web server allows browsing, selecting and intersecting the different features. We demonstrate a possible application of the DeepREx-WS for assisting the identification of residues to be variated in protein surface engineering processes.",
                "authors": [
                    {
                        "name": "Casadio R."
                    },
                    {
                        "name": "Manfredi M."
                    },
                    {
                        "name": "Martelli P.L."
                    },
                    {
                        "name": "Savojardo C."
                    }
                ],
                "citationCount": 3,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Computational and Structural Biotechnology Journal",
                "title": "DeepREx-WS: A web server for characterising protein–solvent interaction starting from sequence"
            },
            "pmcid": "PMC8566768",
            "pmid": "34765094"
        },
        {
            "doi": "10.3389/fmolb.2020.626363",
            "metadata": {
                "abstract": "Solvent accessibility (SASA) is a key feature of proteins for determining their folding and stability. SASA is computed from protein structures with different algorithms, and from protein sequences with machine-learning based approaches trained on solved structures. Here we ask the question as to which extent solvent exposure of residues can be associated to the pathogenicity of the variation. By this, SASA of the wild-type residue acquires a role in the context of functional annotation of protein single-residue variations (SRVs). By mapping variations on a curated database of human protein structures, we found that residues targeted by disease related SRVs are less accessible to solvent than residues involved in polymorphisms. The disease association is not evenly distributed among the different residue types: SRVs targeting glycine, tryptophan, tyrosine, and cysteine are more frequently disease associated than others. For all residues, the proportion of disease related SRVs largely increases when the wild-type residue is buried and decreases when it is exposed. The extent of the increase depends on the residue type. With the aid of an in house developed predictor, based on a deep learning procedure and performing at the state-of-the-art, we are able to confirm the above tendency by analyzing a large data set of residues subjected to variations and occurring in some 12,494 human protein sequences still lacking three-dimensional structure (derived from HUMSAVAR). Our data support the notion that surface accessible area is a distinguished property of residues that undergo variation and that pathogenicity is more frequently associated to the buried property than to the exposed one.",
                "authors": [
                    {
                        "name": "Casadio R."
                    },
                    {
                        "name": "Manfredi M."
                    },
                    {
                        "name": "Martelli P.L."
                    },
                    {
                        "name": "Savojardo C."
                    }
                ],
                "citationCount": 51,
                "date": "2021-01-07T00:00:00Z",
                "journal": "Frontiers in Molecular Biosciences",
                "title": "Solvent Accessibility of Residues Undergoing Pathogenic Variations in Humans: From Protein Structures to Protein Sequences"
            },
            "type": [
                "Benchmarking study"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application"
    ],
    "topic": [
        {
            "term": "Biotechnology",
            "uri": "http://edamontology.org/topic_3297"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Protein structural motifs and surfaces",
            "uri": "http://edamontology.org/topic_0166"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        }
    ]
}
