{
    "name": "HashClone", 
    "description": "it is an easy-to-use and reliable bioinformatics tool that provides B-cells clonality assessment and MRD monitoring over time analyzing data from Next-Generation Sequencing (NGS) technique. The HashClone strategy-based is composed of three steps: the first and second steps implement an alignment-free prediction method that identifies a set of putative clones belonging to the repertoire of the patient under study. In the third step the IGH variable region, diversity region, and joining region identification is obtained by the alignment of rearrangements with respect to the international ImMunoGenetics information system database.", 
    "homepage": "https://github.com/kendomaniac/docker4seq", 
    "biotoolsID": "HashClone", 
    "biotoolsCURIE": "biotools:HashClone", 
    "version": [
        "version 1.2"
    ], 
    "otherID": [], 
    "relation": [], 
    "function": [], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3063", 
            "term": "Medical informatics"
        }
    ], 
    "operatingSystem": [
        "Linux"
    ], 
    "language": [
        "R", 
        "C++"
    ], 
    "license": "GPL-3.0", 
    "collectionID": [], 
    "maturity": "Mature", 
    "cost": "Free of charge", 
    "accessibility": [
        "Open access"
    ], 
    "elixirPlatform": [], 
    "elixirNode": [
        "Italy"
    ], 
    "link": [
        {
            "url": "https://github.com/kendomaniac/docker4seq/issues", 
            "type": "Issue tracker", 
            "note": null
        }
    ], 
    "download": [
        {
            "url": "https://github.com/kendomaniac/docker4seq/releases", 
            "type": "Source code", 
            "note": null, 
            "version": null
        }
    ], 
    "documentation": [
        {
            "url": "https://github.com/kendomaniac/docker4seq/blob/master/README.md", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "29169317", 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "HashClone: A new tool to quantify the minimal residual disease in B-cell lymphoma from deep sequencing data", 
                "abstract": "© 2017 The Author(s).Background: Mantle Cell Lymphoma (MCL) is a B cell aggressive neoplasia accounting for about the 6% of all lymphomas. The most common molecular marker of clonality in MCL, as in other B lymphoproliferative disorders, is the ImmunoGlobulin Heavy chain (IGH) rearrangement, occurring in B-lymphocytes. The patient-specific IGH rearrangement is extensively used to monitor the Minimal Residual Disease (MRD) after treatment through the standardized Allele-Specific Oligonucleotides Quantitative Polymerase Chain Reaction based technique. Recently, several studies have suggested that the IGH monitoring through deep sequencing techniques can produce not only comparable results to Polymerase Chain Reaction-based methods, but also might overcome the classical technique in terms of feasibility and sensitivity. However, no standard bioinformatics tool is available at the moment for data analysis in this context. Results: In this paper we present HashClone, an easy-to-use and reliable bioinformatics tool that provides B-cells clonality assessment and MRD monitoring over time analyzing data from Next-Generation Sequencing (NGS) technique. The HashClone strategy-based is composed of three steps: the first and second steps implement an alignment-free prediction method that identifies a set of putative clones belonging to the repertoire of the patient under study. In the third step the IGH variable region, diversity region, and joining region identification is obtained by the alignment of rearrangements with respect to the international ImMunoGenetics information system database. Moreover, a provided graphical user interface for HashClone execution and clonality visualization over time facilitate the tool use and the results interpretation. The HashClone performance was tested on the NGS data derived from MCL patients to assess the major B-cell clone in the diagnostic samples and to monitor the MRD in the real and artificial follow up samples. Conclusions: Our experiments show that in all the experimental settings, HashClone was able to correctly detect the major B-cell clones and to precisely follow them in several samples showing better accuracy than the state-of-art tool.", 
                "date": "2017-11-23T00:00:00Z", 
                "citationCount": 2, 
                "authors": [
                    {
                        "name": "Beccuti M."
                    }, 
                    {
                        "name": "Genuardi E."
                    }, 
                    {
                        "name": "Romano G."
                    }, 
                    {
                        "name": "Monitillo L."
                    }, 
                    {
                        "name": "Barbero D."
                    }, 
                    {
                        "name": "Boccadoro M."
                    }, 
                    {
                        "name": "Ladetto M."
                    }, 
                    {
                        "name": "Calogero R."
                    }, 
                    {
                        "name": "Ferrero S."
                    }, 
                    {
                        "name": "Cordero F."
                    }
                ], 
                "journal": "BMC Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": "Raffaele Calogero", 
            "email": "raffaele.calogero@gmail.com", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "beccuti", 
    "additionDate": "2019-02-18T16:00:16Z", 
    "lastUpdate": "2019-07-27T06:50:16Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 0, 
    "homepage_status": 0, 
    "elixir_badge": 0
}