{
    "additionDate": "2018-05-08T19:59:55Z",
    "biotoolsCURIE": "biotools:epimir",
    "biotoolsID": "epimir",
    "credit": [
        {
            "email": "jiangwei@hrbmu.edu.cn",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "lixia@hrbmu.edu.cn",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A database of curated mutual regulation between miRNAs and epigenetic modifications.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://210.46.85.180:8080/EpimiR/help.jsp"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://210.46.85.180:8080/EpimiR/",
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "EpimiR",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAU023",
            "metadata": {
                "abstract": "© The Author(s) 2014.As two kinds of important gene expression regulators, both epigenetic modification and microRNA (miRNA) can play significant roles in a wide range of human diseases. Recently, many studies have demonstrated that epigenetics and miRNA can affect each other in various ways. In this study, we established the EpimiR database, which collects 1974 regulations between 19 kinds of epigenetic modifications (such as DNA methylation, histone acetylation, H3K4me3, H3S10p) and 617 miRNAs across seven species (including Homo sapiens, Mus musculus, Rattus norvegicus, Gallus gallus, Epstein-Barr virus, Canis familiaris and Arabidopsis thaliana) from >300 references in the literature. These regulations can be divided into two parts: miR2Epi (103 entries describing how miRNA regulates epigenetic modification) and Epi2miR (1871 entries describing how epigenetic modification affects miRNA). Each entry of EpimiR not only contains basic descriptions of the validated experiment (method, species, reference and so on) but also clearly illuminates the regulatory pathway between epigenetics and miRNA. As a supplement to the curated information, the EpimiR extends to gather predicted epigenetic features (such as predicted transcription start site, upstream CpG island) associated with miRNA for users to guide their future biological experiments. Finally, EpimiR offers download and submission pages. Thus, EpimiR provides a fairly comprehensive repository about the mutual regulation between epigenetic modifications and miRNAs, which will promote the research on the regulatory mechanism of epigenetics and miRNA.",
                "authors": [
                    {
                        "name": "Dai E."
                    },
                    {
                        "name": "Yu X."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Meng F."
                    },
                    {
                        "name": "Wang S."
                    },
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Liu D."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Jiang W."
                    }
                ],
                "citationCount": 33,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Database",
                "title": "EpimiR: A database of curated mutual regulation between miRNAs and epigenetic modifications"
            },
            "pmcid": "PMC4037167",
            "pmid": "24682734"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        }
    ],
    "validated": 1
}