
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Retention time prediction",
                    "uri": "http://edamontology.org/operation_3633"
                }
            ]
        }
    ],
    "labels": {
        "accessibility": [
            "Open access"
        ],
        "cost": "Free of charge",
        "license": "Unlicense",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Proteomics",
                "uri": "http://edamontology.org/topic_0121"
            },
            {
                "term": "Proteomics experiment",
                "uri": "http://edamontology.org/topic_3520"
            },
            {
                "term": "Small molecules",
                "uri": "http://edamontology.org/topic_0154"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019 WILEY-VCH Verlag GmbH & Co. KGaA, WeinheimThe increasing role played by liquid chromatography-mass spectrometry (LC-MS)-based proteomics in biological discovery has led to a growing need for quality control (QC) on the LC-MS systems. While numerous quality control tools have been developed to track the performance of LC-MS systems based on a pre-defined set of performance factors (e.g., mass error, retention time), the precise influence and contribution of the performance factors and their generalization property to different biological samples are not as well characterized. Here, a web-based application (QCMAP) is developed for interactive diagnosis and prediction of the performance of LC-MS systems across different biological sample types. Leveraging on a standardized HeLa cell sample run as QC within a multi-user facility, predictive models are trained on a panel of commonly used performance factors to pinpoint the precise conditions to a (un)satisfactory performance in three LC-MS systems. It is demonstrated that the learned model can be applied to predict LC-MS system performance for brain samples generated from an independent study. By compiling these predictive models into our web-application, QCMAP allows users to benchmark the performance of their LC-MS systems using their own samples and identify key factors for instrument optimization. QCMAP is freely available from: http://shiny.maths.usyd.edu.au/QCMAP/.",
            "authors": [
                "Kim T.",
                "Chen I.R.",
                "Parker B.L.",
                "Humphrey S.J.",
                "Crossett B.",
                "Cordwell S.J.",
                "Yang P.",
                "Yang J.Y.H."
            ],
            "cit_count": 0,
            "doi": "10.1002/PMIC.201900068",
            "journal": "Proteomics",
            "pmid": "31099962",
            "title": "QCMAP: An Interactive Web-Tool for Performance Diagnosis and Prediction of LC-MS Systems",
            "type": "Primary",
            "year": "2019-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:QCMAP",
        "biotoolsID": "QCMAP",
        "description": "Web-Tool for Performance Diagnosis and Prediction of liquid chromatography-mass spectrometry (LC-MS) Systems.",
        "homepage": "http://shiny.maths.usyd.edu.au/QCMAP/",
        "name": "QCMAP"
    }
}