{
    "additionDate": "2021-01-18T08:36:55Z",
    "biotoolsCURIE": "biotools:prot2hg",
    "biotoolsID": "prot2hg",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "petra.lasssuthova@fnmotol.cz",
            "name": "Petra Lassuthova",
            "typeEntity": "Person"
        }
    ],
    "description": "Prot2HG is a database of protein domains mapped to the human genome.\n\nGenetic variation occurring within conserved functional protein domains warrants special attention when examining DNA variation in the context of disease causation. Here we introduce a resource, freely available at www.prot2hg.com, that addresses the question of whether a particular variant falls onto an annotated protein domain and directly translates chromosomal coordinates onto protein residues. The tool can perform a multiple-site query in a simple way, and the whole dataset is available for download as well as incorporated into our own accessible pipeline. To create this resource, National Center for Biotechnology Information protein data were retrieved using the Entrez Programming Utilities. After processing all human protein domains, residue positions were reverse translated and mapped to the reference genome hg19 and stored in a MySQL database",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Variant prioritisation",
                    "uri": "http://edamontology.org/operation_3226"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "http://www.prot2hg.com",
    "language": [
        "SQL"
    ],
    "lastUpdate": "2021-01-28T16:28:12Z",
    "name": "Prot2HG",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAZ161",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press.Genetic variation occurring within conserved functional protein domains warrants special attention when examining DNA variation in the context of disease causation. Here we introduce a resource, freely available at www.prot2hg.com, that addresses the question of whether a particular variant falls onto an annotated protein domain and directly translates chromosomal coordinates onto protein residues. The tool can perform a multiple-site query in a simple way, and the whole dataset is available for download as well as incorporated into our own accessible pipeline. To create this resource, National Center for Biotechnology Information protein data were retrieved using the Entrez Programming Utilities. After processing all human protein domains, residue positions were reverse translated and mapped to the reference genome hg19 and stored in a MySQL database. In total, 760 487 protein domains from 42 371 protein models were mapped to hg19 coordinates and made publicly available for search or download (www.prot2hg.com). In addition, this annotation was implemented into the genomics research platform GENESIS in order to query nearly 8000 exomes and genomes of families with rare Mendelian disorders (tgp-foundation.org). When applied to patient genetic data, we found that rare (<1%) variants in the Genome Aggregation Database were significantly more annotated onto a protein domain in comparison to common (>1%) variants. Similarly, variants described as pathogenic or likely pathogenic in ClinVar were more likely to be annotated onto a domain. In addition, we tested a dataset consisting of 60 causal variants in a cohort of patients with epileptic encephalopathy and found that 71% of them (43 variants) were propagated onto protein domains. In summary, we developed a resource that annotates variants in the coding part of the genome onto conserved protein domains in order to increase variant prioritization efficiency. Database URL: www.prot2hg.com.",
                "authors": [
                    {
                        "name": "Stanek D."
                    },
                    {
                        "name": "Bis-Brewer D.M."
                    },
                    {
                        "name": "Saghira C."
                    },
                    {
                        "name": "Danzi M.C."
                    },
                    {
                        "name": "Seeman P."
                    },
                    {
                        "name": "Lassuthova P."
                    },
                    {
                        "name": "Zuchner S."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Database",
                "title": "Prot2HG: A database of protein domains mapped to the human genome"
            },
            "pmcid": "PMC7157182",
            "pmid": "32293014"
        }
    ],
    "topic": [
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ]
}