
{
    "credit": [
        {
            "email": "pierre.neuvial@genopole.cnrs.fr",
            "name": "Pierre Neuvial",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://bioconductor.org/packages/release/bioc/html/MANOR.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/MANOR_1.46.0.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Loading",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Sequencing quality control",
                    "uri": "http://edamontology.org/operation_3218"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "language": [
            "R"
        ],
        "license": "GPL-2.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "Microarray experiment",
                "uri": "http://edamontology.org/topic_3518"
            },
            {
                "term": "Molecular genetics",
                "uri": "http://edamontology.org/topic_3321"
            }
        ]
    },
    "link": [
        {
            "type": "Mirror",
            "url": "http://bioinfo.curie.fr/projects/manor/index.html"
        }
    ],
    "publication": [
        {
            "abstract": "Background: Array-based comparative genomic hybridization (array-CGH) is a recently developed technique for analyzing changes in DNA copy number. As in all microarray analyses, normalization is required to correct for experimental artifacts while preserving the true biological signal. We investigated various sources of systematic variation in array-CGH data and identified two distinct types of spatial effect of no biological relevance as the predominant experimental artifacts: Continuous spatial gradients and local spatial bias. Local spatial bias affects a large proportion of arrays, and has not previously been considered in array-CGH experiments. Results: We show that existing normalization techniques do not correct these spatial effects properly. We therefore developed an automatic method for the spatial normalization of array-CGH data. This method makes it possible to delineate and to eliminate and/or correct areas affected by spatial bias. It is based on the combination of a spatial segmentation algorithm called NEM (Neighborhood Expectation Maximization) and spatial trend estimation. We defined quality criteria for array-CGH data, demonstrating significant improvements in data quality with our method for three data sets coming from two different platforms (198, 175 and 26 BAC-arrays). Conclusion: We have designed an automatic algorithm for the spatial normalization of BAC CGH-array data, preventing the misinterpretation of experimental artifacts as biologically relevant outliers in the genomic profile. This algorithm is implemented in the R package MANOR (Micro-Array NORmalization), which is described at http://bioinfo.curie.fr/projects/manor and available from the Bioconductor site http://www.bioconductor.org. It can also be tested on the CAPweb bioinformatics platform at http://bioinfo.curie.fr/CAPweb. © 2006 Neuvial et al; licensee BioMed Central Ltd.",
            "authors": [
                "Neuvial P.",
                "Hupe P.",
                "Brito I.",
                "Liva S.",
                "Manie E.",
                "Brennetot C.",
                "Radvanyi F.",
                "Aurias A.",
                "Barillot E."
            ],
            "cit_count": 67,
            "doi": "10.1186/1471-2105-7-264",
            "journal": "BMC Bioinformatics",
            "title": "Spatial normalization of array-CGH data",
            "type": "Primary",
            "year": "2006-12-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:manor",
        "biotoolsID": "manor",
        "description": "Importation, normalization, visualization, and quality control functions to correct identified sources of variability in array-CGH experiments.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/MANOR.html",
        "name": "MANOR",
        "version": [
            "1.46.0"
        ]
    }
}