{
    "additionDate": "2018-08-06T10:16:48Z",
    "biotoolsCURIE": "biotools:hiscom-mimi",
    "biotoolsID": "hiscom-mimi",
    "credit": [
        {
            "email": "biznok@gmail.com",
            "name": "Sungyoung Lee",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Hierarchical Structured Component analysis of microRNA-mRNA integration model is a novel statistical method to find biological relationship, efficiently study and identify such integrated markers. It could use subgroup information, it yelded more results, as related to phenotypes, than those of other existing methods that lack network information. It can be easily applied to other cancer studies to identify miRNA-mRNA integration sets for early diagnosis and prognosis.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "http://statgen.snu.ac.kr/software/hiscom-mimi/",
    "lastUpdate": "2024-11-25T14:27:57.412054Z",
    "name": "HisCoM-mimi",
    "owner": "shadi.m",
    "publication": [
        {
            "doi": "10.1186/s12859-018-2070-0",
            "metadata": {
                "abstract": "Background: Identification of multi-markers is one of the most challenging issues in personalized medicine era. Nowadays, many different types of omics data are generated from the same subject. Although many methods endeavor to identify candidate markers, for each type of omics data, few or none can facilitate such identification. Results: It is well known that microRNAs affect phenotypes only indirectly, through regulating mRNA expression and/or protein translation. Toward addressing this issue, we suggest a hierarchical structured component analysis of microRNA-mRNA integration (\"HisCoM-mimi\") model that accounts for this biological relationship, to efficiently study and identify such integrated markers. In simulation studies, HisCoM-mimi showed the better performance than the other three methods. Also, in real data analysis, HisCoM-mimi successfully identified more gives more informative miRNA-mRNA integration sets relationships for pancreatic ductal adenocarcinoma (PDAC) diagnosis, compared to the other methods. Conclusion: As exemplified by an application to pancreatic cancer data, our proposed model effectively identified integrated miRNA/target mRNA pairs as markers for early diagnosis, providing a much broader biological interpretation.",
                "authors": [
                    {
                        "name": "Choi S."
                    },
                    {
                        "name": "Jang J.-Y."
                    },
                    {
                        "name": "Kim Y."
                    },
                    {
                        "name": "Lee S."
                    },
                    {
                        "name": "Park T."
                    }
                ],
                "citationCount": 16,
                "date": "2018-05-08T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Hierarchical structural component modeling of microRNA-mRNA integration analysis"
            },
            "pmcid": "PMC5998903",
            "pmid": "29745843",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "miRNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
