{
    "additionDate": "2017-01-17T15:05:20Z",
    "biotoolsCURIE": "biotools:nem",
    "biotoolsID": "nem",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "frohlich@bit.uni-bonn.de",
            "name": "Holger Froehlich",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "This package allows to reconstruct features of pathways from the nested structure of perturbation effects. It takes as input a set of pathway components, which were perturbed, and a phenotypic readout of these perturbations (e.g. gene expression, protein expression). The output is a directed graph representing the phenotypic hierarchy.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/nem.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/nem_2.48.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/nem.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:53Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Mirror"
            ],
            "url": "http://www.bioconductor.org"
        }
    ],
    "name": "nem",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btq385",
            "metadata": {
                "abstract": "© The Author(s) 2010.Motivation: Network modelling in systems biology has become an important tool to study molecular interactions in cancer research, because understanding the interplay of proteins is necessary for developing novel drugs and therapies. De novo reconstruction of signalling pathways from data allows to unravel interactions between proteins and make qualitative statements on possible aberrations of the cellular regulatory program. We present a new method for reconstructing signalling networks from time course experiments after external perturbation and show an application of the method to data measuring abundance of phosphorylated proteins in a human breast cancer cell line, generated on reverse phase protein arrays. Results: Signalling dynamics is modelled using active and passive states for each protein at each timepoint. A fixed signal propagation scheme generates a set of possible state transitions on a discrete timescale for a given network hypothesis, reducing the number of theoretically reachable states. A likelihood score is proposed, describing the probability of measurements given the states of the proteins over time. The optimal sequence of state transitions is found via a hidden Markov model and network structure search is performed using a genetic algorithm that optimizes the overall likelihood of a population of candidate networks. Our method shows increased performance compared with two different dynamical Bayesian network approaches. For our real data, we were able to find several known signalling cascades from the ERBB signalling pathway.",
                "authors": [
                    {
                        "name": "Bender C."
                    },
                    {
                        "name": "Henjes F."
                    },
                    {
                        "name": "Frohlich H."
                    },
                    {
                        "name": "Wiemann S."
                    },
                    {
                        "name": "Korf U."
                    },
                    {
                        "name": "Beissbarth T."
                    }
                ],
                "citationCount": 2,
                "date": "2011-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Dynamic deterministic effects propagation networks: Learning signalling pathways from longitudinal protein array data"
            },
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ],
    "validated": 1,
    "version": [
        "2.48.0"
    ]
}