{
    "additionDate": "2017-08-03T18:56:49Z",
    "biotoolsCURIE": "biotools:putracer",
    "biotoolsID": "putracer",
    "credit": [
        {
            "email": "sh.arab@modares.ac.ir",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Reliable method to detect automatically structural domains as protein units. This server provides number of domains and domain boundary for a chain with continues-domains.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bioinf.modares.ac.ir/software/PUTracer/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                },
                {
                    "term": "Protein structure analysis",
                    "uri": "http://edamontology.org/operation_2406"
                }
            ]
        }
    ],
    "homepage": "http://bioinf.modares.ac.ir/software/PUTracer/",
    "lastUpdate": "2018-12-10T12:58:43Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/putracer-protein-unit-tracer.html"
        }
    ],
    "name": "Putracer",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Computer assisted assignment of protein domains is considered as an important issue in structural bioinformatics. The exponential increase in the number of known three dimensional protein structures and the significant role of proteins in biology, medicine and pharmacology illustrate the necessity of a reliable method to automatically detect structural domains as protein units. For this aim, we have developed a program based on the accessible surface area (ASA) and the hydrogen bonds energy in protein backbone (HBE). PUTracer (Protein Unit Tracer) is built on the features of a fast top-down approach to cut a chain into its domains (contiguous domains) with minimal change in ASA as well as HBE. Performance of the program was assessed by a comprehensive benchmark dataset of 124 protein chains, which is based on agreement among experts (e.g. CATH, SCOP) and was expanded to include structures with different types of domain combinations. Equal number of domains and at least 90% agreement in critical boundary accuracy were considered as correct assignment conditions. PUTracer assigned domains correctly in 81.45% of protein chains. Although low critical boundary accuracy in 18.55% of protein chains leads to the incorrect assignments, adjusting the scales causes to improve the performance up to 89.5%. We discuss here the success or failure of adjusting the scales with provided evidences. Availability: PUTracer is available at © 2013 Imperial College Press.",
                "authors": [
                    {
                        "name": "Arab S.S."
                    },
                    {
                        "name": "Gharamaleki M.P."
                    },
                    {
                        "name": "Pashandi Z."
                    },
                    {
                        "name": "Mobasseri R."
                    }
                ],
                "citationCount": 2,
                "date": "2013-02-01T00:00:00Z",
                "journal": "Journal of Bioinformatics and Computational Biology",
                "title": "Putracer: A novel method for identification of continuous-domains in multi-domain proteins"
            },
            "pmid": "23427994"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Protein sites, features and motifs",
            "uri": "http://edamontology.org/topic_3510"
        }
    ],
    "validated": 1
}