{
    "additionDate": "2017-08-03T18:55:28Z",
    "biotoolsCURIE": "biotools:pentacle",
    "biotoolsID": "pentacle",
    "credit": [
        {
            "email": "manuel.pastor@upf.edu",
            "name": "Manuel Pastor",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://cadd.imim.es/grib-cadd/"
        }
    ],
    "description": "Advanced software tool for obtaining alignment-independent 3D quantitative structure-activity relationships. The program starts from a set of structures, computing highly relevant 3D maps of interaction energies between the molecule and chemical probes (GRID based Molecular Interaction Fields, or MIFs).",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.moldiscovery.com/accounts/login/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Residue interaction prediction",
                    "uri": "http://edamontology.org/operation_0272"
                }
            ]
        }
    ],
    "homepage": "http://www.moldiscovery.com/login.php",
    "lastUpdate": "2018-12-10T12:58:45Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/pentacle-1-0-6-advanced-alignment-independent-3d-qsar.html"
        }
    ],
    "name": "Pentacle",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "The information provided by the alignment-independent GRid Independent Descriptors (GRIND) can be condensed by the application of principal component analysis, obtaining a small number of principal properties (GRIND-PP), which is more suitable for describing molecular similarity. The objective of the present study is to optimize diverse parameters involved in the obtention of the GRIND-PP and validate their suitability for applications, requiring a biologically relevant description of the molecular similarity. With this aim, GRIND-PP computed with a collection of diverse settings were used to carry out ligand-based virtual screening (LBVS) on standard conditions. The quality of the results obtained was remarkable and comparable with other LBVS methods, and their detailed statistical analysis allowed to identify the method settings more determinant for the quality of the results and their optimum. Remarkably, some of these optimum settings differ significantly from those used in previously published applications, revealing their unexplored potential. Their applicability in large compound database was also explored by comparing the equivalence of the results obtained using either computed or projected principal properties. In general, the results of the study confirm the suitability of the GRIND-PP for practical applications and provide useful hints about how they should be computed for obtaining optimum results. © 2009 American Chemical Society.",
                "authors": [
                    {
                        "name": "Duran A."
                    },
                    {
                        "name": "Pastor M."
                    },
                    {
                        "name": "Zamora I."
                    }
                ],
                "citationCount": 43,
                "date": "2009-09-28T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "Suitability of GRIND-based principal properties for the description of molecular similarity and ligand-based virtual screening"
            },
            "pmid": "19728739"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
