{
    "additionDate": "2020-01-09T18:06:35Z",
    "biotoolsCURIE": "biotools:METHODSSNPstats",
    "biotoolsID": "METHODSSNPstats",
    "confidence_flag": "medium",
    "description": "Interaction between eNOS gene polymorphism and current smoking on susceptibility to coronary heart disease in Chinese people.\n\nPrograma d'Analítica de Dades en Oncologia.\n\nPrograma d’Analítica de Dades en Oncologia.\n\nEl Programa d’Analítica de Dades en Oncologia (PADO) és un grup de recerca que pretén identificar i validar biomarcadors moleculars en càncer, tant de diagnòstic i pronòstic, com de resposta a tractament. També col·labora amb altres grups de recerca de la institució en projectes relacionats amb biomarcadors de el càncer.\n\nCentra la seva recerca en l’epidemiologia genètica, el diagnòstic molecular de el càncer, en els marcadors de pronòstic i predicció de resposta terapèutica i en la identificació de noves dianes terapèutiques.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'SNPs' (bio.tools/SNPs)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.iconcologia.net/SNPstats",
    "lastUpdate": "2020-01-09T18:06:35Z",
    "name": "METHODS:SNPstats",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1097/MCA.0000000000000780",
            "metadata": {
                "abstract": "OBJECTIVE: This study aims to explore the relation between endothelial nitric oxide synthase (eNOS) single-nucleotide polymorphisms (SNPs) and the risk of coronary heart disease (CHD). METHODS: SNPstats (online software: http://bioinfo.iconcologia.net/SNPstats) was performed to test Hardy-Weinberg equilibrium in controls. Generalized multifactor dimensionality reduction (GMDR) was adopted to screen the preferable interaction between eNOS SNPs and smoking. RESULTS: The frequency for the rs1799983-T allele was 31.1% in CHD patients, which was significantly higher than that of 19.8% in controls (P < 0.05). The frequency for the rs891512-A allele was 28.8% in cases, which was also significantly higher than that of 20.1% in controls (P < 0.05). Logistic regression analysis showed that both rs1799983-T and rs891512-A alleles were related with increased risk of CHD, and the odds ratios (ORs) [95% confidence interval (CI)] were 1.71 (1.31-2.15) and 1.57 (1.14-2.07), respectively. High-order interactions were investigated among SNPs and environmental factors using the GMDR method. The data showed that a two-locus model (rs1799983 × smoking) had a testing accuracy of 0.60 (P = 0.001). We found that current smokers with rs1799983-GT or TT within eNOS gene have the highest CHD risk, compared to never smokers with rs1799983-GG genotype, OR (95% CI) = 2.74 (1.78-3.85), after covariates adjustment for age, gender, BMI, and alcohol drinking. CONCLUSION: The rs1799983-T and rs891512-A alleles and interaction between rs1799983 and smoking were all risk factors of CHD.",
                "authors": [
                    {
                        "name": "Yang P."
                    },
                    {
                        "name": "Wu P."
                    },
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Feng J."
                    },
                    {
                        "name": "Zheng S."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Fan Z."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Coronary artery disease",
                "title": "Interaction between eNOS gene polymorphism and current smoking on susceptibility to coronary heart disease in Chinese people"
            },
            "pmid": "31567371"
        }
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Cardiology",
            "uri": "http://edamontology.org/topic_3335"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}