{
    "additionDate": "2017-12-18T00:10:39Z",
    "biotoolsCURIE": "biotools:ptrstalker",
    "biotoolsID": "ptrstalker",
    "credit": [
        {
            "email": "bioalgo@iit.cnr.it",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "PTRStalker is a new algorithm for ab-initio detection of fuzzy tandem repeats in protein amino acid sequences.",
    "documentation": [
        {
            "type": "General",
            "url": "http://bioalgo.iit.cnr.it/index.php?pg=ptrs#help"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Detection",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "homepage": "http://bioalgo.iit.cnr.it/index.php?pg=ptrs",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/ptrstalker-protein-tandem-repeats-discovery-visualization.html"
        }
    ],
    "name": "PTRStalker",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-13-S3-S8",
            "metadata": {
                "abstract": "Background: Tandem repetitions within protein amino acid sequences often correspond to regular secondary structures and form multi-repeat 3D assemblies of varied size and function. Developing internal repetitions is one of the evolutionary mechanisms that proteins employ to adapt their structure and function under evolutionary pressure. While there is keen interest in understanding such phenomena, detection of repeating structures based only on sequence analysis is considered an arduous task, since structure and function is often preserved even under considerable sequence divergence (fuzzy tandem repeats).Results: In this paper we present PTRStalker, a new algorithm for ab-initio detection of fuzzy tandem repeats in protein amino acid sequences. In the reported results we show that by feeding PTRStalker with amino acid sequences from the UniProtKB/Swiss-Prot database we detect novel tandemly repeated structures not captured by other state-of-the-art tools. Experiments with membrane proteins indicate that PTRStalker can detect global symmetries in the primary structure which are then reflected in the tertiary structure.Conclusions: PTRStalker is able to detect fuzzy tandem repeating structures in protein sequences, with performance beyond the current state-of-the art. Such a tool may be a valuable support to investigating protein structural properties when tertiary X-ray data is not available. © 2012 Pellegrini et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Pellegrini M."
                    },
                    {
                        "name": "Renda M.E."
                    },
                    {
                        "name": "Vecchio A."
                    }
                ],
                "citationCount": 9,
                "date": "2012-03-21T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Ab initio detection of fuzzy amino acid tandem repeats in protein sequences"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Sequences",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}