{
    "additionDate": "2017-02-14T09:34:57Z",
    "biotoolsCURIE": "biotools:rnapredator",
    "biotoolsID": "rnapredator",
    "credit": [
        {
            "email": "egg@tbi.univie.ac.at",
            "name": "RNApredator Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "RNApredator  is a web server for the prediction of bacterial sRNA targets. The user can choose from a large selection of genomes. Accessibility of the target to the sRNA is considered.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://nibiru.tbi.univie.ac.at/RNApredator/help.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                }
            ]
        }
    ],
    "homepage": "http://rna.tbi.univie.ac.at/RNApredator",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "name": "RNApredator",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Bacterial genomes encode a plethora of small RNAs (sRNAs), which are heterogeneous in size, structure and function. Most sRNAs act as post-transcriptional regulators by means of specific base pairing interactions with the 5′-untranslated region of mRNA transcripts, thereby modifying the stability of the target transcript and/or its ability to be translated. Here, we present RNApredator, a web server for the prediction of sRNA targets. The user can choose from a set of over 2155 genomes and plasmids from 1183 bacterial species. RNApredator then uses a dynamic programming approach, RNAplex, to compute putative targets. Compared to web servers with a similar task, RNApredator takes the accessibility of the target during the target search into account, improving the specificity of the predictions. Furthermore, enrichment in Gene Ontology terms, cellular pathways as well as changes in accessibilities along the target sequence can be done in fully automated post-processing steps. The predictive performance of the underlying dynamic programming approach RNAplex is similar to that of more complex methods, but needs at least three orders of magnitude less time to complete. RNApredator is available at http://rna.tbi.univie.ac.at/RNApredator. © 2011 The Author(s).",
                "authors": [
                    {
                        "name": "Eggenhofer F."
                    },
                    {
                        "name": "Hofacker I.L."
                    },
                    {
                        "name": "Stadler P.F."
                    },
                    {
                        "name": "Tafer H."
                    }
                ],
                "citationCount": 87,
                "date": "2011-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "RNApredator: Fast accessibility-based prediction of sRNA targets"
            },
            "pmid": "21672960"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
