{
    "accessibility": "Open access",
    "additionDate": "2022-09-30T21:46:22.339170Z",
    "biotoolsCURIE": "biotools:pbine",
    "biotoolsID": "pbine",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "hsinchou@stat.sinica.edu.tw",
            "name": "Hsin-Chou Yang",
            "typeEntity": "Person"
        },
        {
            "name": "Yin-Chun Lin"
        },
        {
            "name": "Yu-Jen Liang"
        }
    ],
    "description": "Evaluating statistical significance in a meta analysis by using numerical integration.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Yinchun-Lin/Pbine",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-09-30T21:46:22.341839Z",
    "license": "Not licensed",
    "name": "Pbine",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.CSBJ.2022.06.055",
            "metadata": {
                "abstract": "© 2022 The Author(s)Meta-analysis is a method for enhancing statistical power through the integration of information from multiple studies. Various methods for integrating p-values (i.e., statistical significance), including Fisher's method under an independence assumption, the permutation method, and the decorrelation method, have been broadly used in bioinformatics and computational biotechnology studies. However, these methods have limitations related to statistical assumption, computing efficiency, and accuracy of statistical significance estimation. In this study, we proposed a numerical integration method and examined its theoretical properties. Simulation studies were conducted to evaluate its Type I error, statistical power, computational efficiency, and estimation accuracy, and the results were compared with those of other methods. The results demonstrate that our proposed method performs well in terms of Type I error, statistical power, computing efficiency (regardless of sample size), and statistical significance estimation accuracy. P-value data from multiple large-scale genome-wide association studies (GWASs) and transcriptome-wise association studies (TWASs) were analyzed. The results demonstrate that our proposed method can be used to identify critical genomic regions associated with rheumatoid arthritis and asthma, increase statistical significance in individual GWASs and TWASs, and control for false-positives more effectively than can Fisher's method under an independence assumption. We created the software package Pbine, available at GitHub (https://github.com/Yinchun-Lin/Pbine).",
                "authors": [
                    {
                        "name": "Liang Y.-J."
                    },
                    {
                        "name": "Lin Y.-C."
                    },
                    {
                        "name": "Yang H.-C."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Computational and Structural Biotechnology Journal",
                "title": "Evaluating statistical significance in a meta-analysis by using numerical integration"
            },
            "pmcid": "PMC9283883",
            "pmid": "35860413"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
