{
    "additionDate": "2021-01-18T11:36:09Z",
    "biotoolsCURIE": "biotools:uspim",
    "biotoolsID": "uspim",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "C.L.Buckley@sussex.ac.uk",
            "name": "Christopher L. Buckley",
            "typeEntity": "Person"
        },
        {
            "email": "l.lagnado@sussex.ac.uk",
            "name": "Leon Lagnado",
            "typeEntity": "Person"
        }
    ],
    "description": "A software platform for selective plane illumination microscopy.\n\nSelective Plane Illumination Microscopy (SPIM) is a fluorescence imaging technique that allows volumetric imaging at high spatio-temporal resolution to monitor neural activity in live organisms such as larval zebrafish. A major challenge in the construction of a custom SPIM microscope using a scanned laser beam is the control and synchronization of the various hardware components.<h4>New method< h4>We present an open-source software, μSPIM Toolset, built around the widely adopted MicroManager platform, that provides control and acquisition functionality for a SPIM",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://uspim.org/#/",
    "lastUpdate": "2021-03-10T13:17:46Z",
    "name": "uSPIM Toolset",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1016/J.JNEUMETH.2020.108952",
            "metadata": {
                "abstract": "© 2020Background: Selective Plane Illumination Microscopy (SPIM) is a fluorescence imaging technique that allows volumetric imaging at high spatio-temporal resolution to monitor neural activity in live organisms such as larval zebrafish. A major challenge in the construction of a custom SPIM microscope using a scanned laser beam is the control and synchronization of the various hardware components. New Method: We present an open-source software, μSPIM Toolset, built around the widely adopted MicroManager platform, that provides control and acquisition functionality for a SPIM. A key advantage of μSPIM Toolset is a series of calibration procedures that optimize acquisition for a given set-up, making it relatively independent of the optical design of the microscope or the hardware used to build it. Results: μSPIM Toolset allows imaging of calcium activity throughout the brain of larval zebrafish at rates of 100 planes per second with single cell resolution. Comparison with Existing Methods: Several designs of SPIM have been published but are focused on imaging of developmental processes using a slower setup with a moving stage and therefore have limited use for functional imaging. In comparison, μSPIM Toolset uses a scanned beam to allow imaging at higher acquisition frequencies while minimizing disturbance of the sample. Conclusions: The μSPIM Toolset provides a flexible solution for the control of SPIM microscopes and demonstrated its utility for brain-wide imaging of neural activity in larval zebrafish.",
                "authors": [
                    {
                        "name": "Buckley C.L."
                    },
                    {
                        "name": "Lagnado L."
                    },
                    {
                        "name": "Pichler P."
                    },
                    {
                        "name": "Qian C."
                    },
                    {
                        "name": "Saska D."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Journal of Neuroscience Methods",
                "title": "μSPIM Toolset: A software platform for selective plane illumination microscopy"
            },
            "pmcid": "PMC7762823",
            "pmid": "33017646"
        }
    ],
    "topic": [
        {
            "term": "Data acquisition",
            "uri": "http://edamontology.org/topic_3077"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        }
    ]
}
