{
    "additionDate": "2018-07-19T16:32:57Z",
    "biotoolsCURIE": "biotools:neopeptide_analyser",
    "biotoolsID": "neopeptide_analyser",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "email": "peffs@liv.ac.uk",
            "name": "Mandy Peffers",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Neopeptide discovery in proteomics data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/PGB-LIV/neo-pep-tool/releases/"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Spectral analysis",
                    "uri": "http://edamontology.org/operation_3214"
                }
            ]
        }
    ],
    "homepage": "https://github.com/PGB-LIV/neo-pep-tool/releases/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2019-03-26T08:28:06Z",
    "license": "MIT",
    "name": "Neopeptide Analyser",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.12688/wellcomeopenres.11275.1",
            "metadata": {
                "abstract": "© 2017 Peffers MJ et al.Experiments involving mass spectrometry (MS)-based proteomics are widely used for analyses of connective tissues. Common examples include the use of relative quantification to identify differentially expressed peptides and proteins in cartilage and tendon. We are working on characterising so-called ‘neopeptides’, i.e. peptides formed due to native cleavage of proteins, for example under pathological conditions. Unlike peptides typically quantified in MS workflows due to the in vitro use of an enzyme such as trypsin, a neopeptide has at least one terminus that was not due to the use of trypsin in the workflow. The identification of neopeptides within these datasets is important in understanding disease pathology, and the development of antibodies that could be utilised as diagnostic biomarkers for diseases, such as osteoarthritis, and targets for novel treatments. Our previously described neopeptide data analysis workflow was laborious and was not amenable to robust statistical analysis, which reduced confidence in the neopeptides identified. To overcome this, we developed ‘Neopeptide Analyser’, a user friendly neopeptide analysis tool used in conjunction with label-free MS quantification tool Progenesis QIP for proteomics. Neopeptide Analyser filters data sourced from Progenesis QIP output to identify neopeptide sequences, as well as give the residues that are adjacent to the peptide in its corresponding protein sequence. It also produces normalised values for the neopeptide quantification values and uses these to perform statistical tests, which are also included in the output. Neopeptide Analyser is available as a Java application for Mac, Windows and Linux. The analysis features and ease of use encourages data exploration, which could aid the discovery of novel pathways in extracellular matrix degradation, the identification of potential biomarkers and as a tool to investigate matrix turnover. Neopeptide Analyser is available from https://github.com/PGB-LIV/neo-pep-tool/releases/.",
                "authors": [
                    {
                        "name": "Peffers M.J."
                    },
                    {
                        "name": "Jones A.R."
                    },
                    {
                        "name": "McCabe A."
                    },
                    {
                        "name": "Anderson J."
                    }
                ],
                "citationCount": 3,
                "date": "2017-01-01T00:00:00Z",
                "journal": "Wellcome Open Research",
                "title": "Neopeptide Analyser: A software tool for neopeptide discovery in proteomics data"
            },
            "pmcid": "PMC5428739",
            "pmid": "28503667"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Mass spectrometry",
            "uri": "http://edamontology.org/topic_3520"
        }
    ]
}