{
    "accessibility": [],
    "additionDate": "2018-07-14T09:41:50Z",
    "biotoolsCURIE": "biotools:rf_qsar",
    "biotoolsID": "rf_qsar",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": "ney@kaist.ac.kr",
            "gridid": null,
            "name": "Kyoungyeul Lee",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        },
        {
            "email": "MinhoLee@catholic.ac.kr",
            "gridid": null,
            "name": "Minho Lee",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        }
    ],
    "description": "Ligand-based virtual screening model comprising 1121 target SAR models built using a random forest algorithm.",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "http://rfqsar.kaist.ac.kr/help.php"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Protein property calculation",
                    "uri": "http://edamontology.org/operation_0250"
                },
                {
                    "term": "Protein interaction analysis",
                    "uri": "http://edamontology.org/operation_2949"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://rfqsar.kaist.ac.kr/home.php",
    "homepage_status": 0,
    "language": [
        "PHP"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "license": null,
    "link": [],
    "maturity": null,
    "name": "RF QSAR",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1186/s12859-017-1960-x",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: The identification of target molecules is important for understanding the mechanism of \"target deconvolution\" in phenotypic screening and \"polypharmacology\" of drugs. Because conventional methods of identifying targets require time and cost, in-silico target identification has been considered an alternative solution. One of the well-known in-silico methods of identifying targets involves structure activity relationships (SARs). SARs have advantages such as low computational cost and high feasibility; however, the data dependency in the SAR approach causes imbalance of active data and ambiguity of inactive data throughout targets. Results: We developed a ligand-based virtual screening model comprising 1121 target SAR models built using a random forest algorithm. The performance of each target model was tested by employing the ROC curve and the mean score using an internal five-fold cross validation. Moreover, recall rates for top-k targets were calculated to assess the performance of target ranking. A benchmark model using an optimized sampling method and parameters was examined via external validation set. The result shows recall rates of 67.6% and 73.9% for top-11 (1% of the total targets) and top-33, respectively. We provide a website for users to search the top-k targets for query ligands available publicly at http://rfqsar.kaist.ac.kr. Conclusions: The target models that we built can be used for both predicting the activity of ligands toward each target and ranking candidate targets for a query ligand using a unified scoring scheme. The scores are additionally fitted to the probability so that users can estimate how likely a ligand-target interaction is active. The user interface of our web site is user friendly and intuitive, offering useful information and cross references.",
                "authors": [
                    {
                        "name": "Lee K."
                    },
                    {
                        "name": "Lee M."
                    },
                    {
                        "name": "Kim D."
                    }
                ],
                "citationCount": 6,
                "date": "2017-12-28T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Utilizing random Forest QSAR models with optimized parameters for target identification and its application to target-fishing server"
            },
            "note": null,
            "pmcid": null,
            "pmid": null,
            "type": "Primary",
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        }
    ],
    "validated": 1,
    "version": []
}