
{
    "credit": [
        {
            "email": "jon.bohlin@gmail.com",
            "name": "Jon Bohlin",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "http://bioconductor.org/packages/release/bioc/html/GAprediction.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/GAprediction_1.0.0.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "CpG island and isochore detection",
                    "uri": "http://edamontology.org/operation_0430"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "language": [
            "R"
        ],
        "license": "GPL-2.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "Geriatric medicine",
                "uri": "http://edamontology.org/topic_3399"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2016 The Author(s). Background: We explored the association between gestational age and cord blood DNA methylation at birth and whether DNA methylation could be effective in predicting gestational age due to limitations with the presently used methods. We used data from the Norwegian Mother and Child Birth Cohort study (MoBa) with Illumina HumanMethylation450 data measured for 1753 newborns in two batches: MoBa 1, n = 1068; and MoBa 2, n = 685. Gestational age was computed using both ultrasound and the last menstrual period. We evaluated associations between DNA methylation and gestational age and developed a statistical model for predicting gestational age using MoBa 1 for training and MoBa 2 for predictions. The prediction model was additionally used to compare ultrasound and last menstrual period-based gestational age predictions. Furthermore, both CpGs and associated genes detected in the training models were compared to those detected in a published prediction model for chronological age. Results: There were 5474 CpGs associated with ultrasound gestational age after adjustment for a set of covariates, including estimated cell type proportions, and Bonferroni-correction for multiple testing. Our model predicted ultrasound gestational age more accurately than it predicted last menstrual period gestational age. Conclusions: DNA methylation at birth appears to be a good predictor of gestational age. Ultrasound gestational age is more strongly associated with methylation than last menstrual period gestational age. The CpGs linked with our gestational age prediction model, and their associated genes, differed substantially from the corresponding CpGs and genes associated with a chronological age prediction model.",
            "authors": [
                "Bohlin J.",
                "Haberg S.E.",
                "Magnus P.",
                "Reese S.E.",
                "Gjessing H.K.",
                "Magnus M.C.",
                "Parr C.L.",
                "Page C.M.",
                "London S.J.",
                "Nystad W."
            ],
            "cit_count": 10,
            "doi": "10.1186/s13059-016-1063-4",
            "journal": "Genome Biology",
            "title": "Prediction of gestational age based on genome-wide differentially methylated regions",
            "type": "Other",
            "year": "2016-10-07"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:gaprediction",
        "biotoolsID": "gaprediction",
        "description": "Predicts gestational age using Illumina HumanMethylation450 CpG data.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/GAprediction.html",
        "name": "GAprediction",
        "version": [
            "1.0.0"
        ]
    }
}