{
    "additionDate": "2021-01-18T10:21:09Z",
    "biotoolsCURIE": "biotools:pain-ckb",
    "biotoolsID": "pain-ckb",
    "confidence_flag": "tool",
    "description": "Pain-Domain-Specific Chemogenomics Knowledgebase for Target Identification and Systems Pharmacology Research.\n\nA generic knowledgebase computation platform integrated with our established chemogenomics tools as well as our algorithms for data visualization and analyses.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                },
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                }
            ]
        }
    ],
    "homepage": "https://www.cbligand.org/g/pain-ckb",
    "lastUpdate": "2021-03-15T14:38:51Z",
    "name": "Pain-CKB",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.0C00633",
            "metadata": {
                "abstract": "© 2020 American Chemical Society.A traditional single-target analgesic, though it may be highly selective and potent, may not be sufficient to mitigate pain. An alternative strategy for alleviation of pain is to seek simultaneous modulation at multiple nodes in the network of pain-signaling pathways through a multitarget analgesic or drug combinations. Here we present a comprehensive pain-domain-specific chemogenomics knowledgebase (Pain-CKB) with integrated computing tools for target identification and systems pharmacology research. Pain-CKB is constructed on the basis of our established chemogenomics technology with new features, including multiple compound support, multicavity protein support, and customizable symbol display. The determination of bioactivity is also revised to avoid the use of complex machine learning models. Our one-stop computing platform describes the chemical molecules, genes, and proteins involved in pain regulation. To date, Pain-CKB has archived 272 analgesics in the market, 84 pain-related targets with 207 available 3D crystal or cryo-EM structures, and 234 662 chemical agents reported for these target proteins. Moreover, Pain-CKB implements user-friendly web-interfaced computing tools and applications for the prediction and analysis of the relevant protein targets and visualization of the outputs, including HTDocking, TargetHunter, BBB permeation predictor, NGL viewer, Spider Plot, etc. The Pain-CKB server is accessible at https://www.cbligand.org/g/pain-ckb.",
                "authors": [
                    {
                        "name": "Feng Z."
                    },
                    {
                        "name": "Chen M."
                    },
                    {
                        "name": "Shen M."
                    },
                    {
                        "name": "Liang T."
                    },
                    {
                        "name": "Chen H."
                    },
                    {
                        "name": "Xie X.-Q."
                    }
                ],
                "citationCount": 3,
                "date": "2020-10-26T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "Pain-CKB, a pain-domain-specific chemogenomics knowledgebase for target identification and systems pharmacology research"
            },
            "pmid": "32786694"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}