
{
    "credit": [
        {
            "email": "vytas@belozersky.msu.ru",
            "name": "Vytas K Švedas",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://biokinet.belozersky.msu.ru/mustguseal-protocol"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Gene and protein families",
                "uri": "http://edamontology.org/topic_0623"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author(s) 2017. Published by Oxford University Press. All rights reserved. For Permissions, please e-mail: journals.permissions@oup.com. Motivation Comparative analysis of homologous proteins in a functionally diverse superfamily is a valuable tool at studying structure-function relationship, but represents a methodological challenge. Results The Mustguseal web-server can automatically build large structure-guided sequence alignments of functionally diverse protein families that include thousands of proteins basing on all available information about their structures and sequences in public databases. Superimposition of protein structures is implemented to compare evolutionarily distant relatives, whereas alignment of sequences is used to compare close homologues. The final alignment can be downloaded for a local use or operated on-line with the built-in interactive tools and further submitted to the integrated sister web-servers of Mustguseal to analyze conserved, subfamily-specific and co-evolving residues at studying a protein function and regulation, designing improved enzyme variants for practical applications and selective ligands to modulate functional properties of proteins. Availability and implementation Freely available on the web at https://biokinet.belozersky.msu.ru/mustguseal. Contact vytas@belozersky.msu.ru Supplementary informationSupplementary dataare available at Bioinformatics online.",
            "authors": [
                "Suplatov D.A.",
                "Kopylov K.E.",
                "Popova N.N.",
                "Voevodin V.V.",
                "Svedas V.K."
            ],
            "cit_count": 6,
            "doi": "10.1093/bioinformatics/btx831",
            "journal": "Bioinformatics",
            "title": "Mustguseal: A server for multiple structure-guided sequence alignment of protein families",
            "year": "2018-05-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:mustguseal",
        "biotoolsID": "mustguseal",
        "description": "Multiple structure-guided sequence alignment of protein families.",
        "homepage": "https://biokinet.belozersky.msu.ru/mustguseal",
        "name": "Mustguseal"
    }
}