{
    "additionDate": "2021-01-18T10:10:48Z",
    "biotoolsCURIE": "biotools:ape",
    "biotoolsID": "ape",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "v.kasalica@uu.nl",
            "name": "Vedran Kasalica",
            "orcidid": "https://orcid.org/0000-0002-0097-1056",
            "typeEntity": "Person"
        },
        {
            "email": "a.l.lamprecht@uu.nl",
            "name": "Anna-Lena Lamprecht",
            "orcidid": "https://orcid.org/0000-0003-1953-5606",
            "typeEntity": "Person"
        }
    ],
    "description": "APE (the Automated Pipeline Explorer) as a command-line tool and API for automated composition of scientific workflows. APE is easily configured to a new application domain by providing it with a domain ontology and semantically annotated tools. It can then be used to synthesize purpose-specific workflows based on a specification of the available workflow inputs, desired outputs and possibly additional constraints.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Retention time prediction",
                    "uri": "http://edamontology.org/operation_3633"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "homepage": "https://ape-framework.readthedocs.io/en/latest/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2021-05-27T08:09:08Z",
    "license": "Apache-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/sanctuuary/ape"
        }
    ],
    "name": "APE",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1007/978-3-030-50436-6_34",
            "metadata": {
                "abstract": "© The Author(s) 2020.Automated workflow composition is bound to take the work with scientific workflows to the next level. On top of today’s comprehensive eScience infrastructure, it enables the automated generation of possible workflows for a given specification. However, functionality for automated workflow composition tends to be integrated with one of the many available workflow management systems, and is thus difficult or impossible to apply in other environments. Therefore we have developed APE (the Automated Pipeline Explorer) as a command-line tool and API for automated composition of scientific workflows. APE is easily configured to a new application domain by providing it with a domain ontology and semantically annotated tools. It can then be used to synthesize purpose-specific workflows based on a specification of the available workflow inputs, desired outputs and possibly additional constraints. The workflows can further be transformed into executable implementations and/or exported into standard workflow formats. In this paper we describe APE v1.0 and discuss lessons learned from applications in bioinformatics and geosciences.",
                "authors": [
                    {
                        "name": "Kasalica V."
                    },
                    {
                        "name": "Lamprecht A.-L."
                    }
                ],
                "citationCount": 2,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics)",
                "title": "Ape: A command-line tool and api for automated workflow composition"
            },
            "pmcid": "PMC7304703"
        },
        {
            "doi": "10.1021/ACS.JPROTEOME.0C00983",
            "metadata": {
                "abstract": "© 2021 The Authors. Published by American Chemical Society.The bio.tools registry is a main catalogue of computational tools in the life sciences. More than 17 000 tools have been registered by the international bioinformatics community. The bio.tools metadata schema includes semantic annotations of tool functions, that is, formal descriptions of tools' data types, formats, and operations with terms from the EDAM bioinformatics ontology. Such annotations enable the automated composition of tools into multistep pipelines or workflows. In this Technical Note, we revisit a previous case study on the automated composition of proteomics workflows. We use the same four workflow scenarios but instead of using a small set of tools with carefully handcrafted annotations, we explore workflows directly on bio.tools. We use the Automated Pipeline Explorer (APE), a reimplementation and extension of the workflow composition method previously used. Moving \"into the wild\"opens up an unprecedented wealth of tools and a huge number of alternative workflows. Automated composition tools can be used to explore this space of possibilities systematically. Inevitably, the mixed quality of semantic annotations in bio.tools leads to unintended or erroneous tool combinations. However, our results also show that additional control mechanisms (tool filters, configuration options, and workflow constraints) can effectively guide the exploration toward smaller sets of more meaningful workflows.",
                "authors": [
                    {
                        "name": "Kasalica V."
                    },
                    {
                        "name": "Schwammle V."
                    },
                    {
                        "name": "Palmblad M."
                    },
                    {
                        "name": "Ison J."
                    },
                    {
                        "name": "Lamprecht A.-L."
                    }
                ],
                "date": "2021-04-02T00:00:00Z",
                "journal": "Journal of Proteome Research",
                "title": "APE in the Wild: Automated Exploration of Proteomics Workflows in the bio.tools Registry"
            },
            "pmcid": "PMC8041394",
            "pmid": "33720735"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ],
    "validated": 1
}