{
    "additionDate": "2021-01-18T10:10:48Z",
    "biotoolsCURIE": "biotools:ape",
    "biotoolsID": "ape",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "v.kasalica@uu.nl",
            "name": "Vedran Kasalica",
            "orcidid": "https://orcid.org/0000-0002-0097-1056",
            "typeEntity": "Person"
        },
        {
            "email": "a.l.lamprecht@uu.nl",
            "name": "Anna-Lena Lamprecht",
            "orcidid": "https://orcid.org/0000-0003-1953-5606",
            "typeEntity": "Person"
        }
    ],
    "description": "APE (the Automated Pipeline Explorer) as a command-line tool and API for automated composition of scientific workflows. APE is easily configured to a new application domain by providing it with a domain ontology and semantically annotated tools. It can then be used to synthesize purpose-specific workflows based on a specification of the available workflow inputs, desired outputs and possibly additional constraints.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Retention time prediction",
                    "uri": "http://edamontology.org/operation_3633"
                }
            ]
        }
    ],
    "homepage": "https://ape-framework.readthedocs.io/en/latest/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2021-01-24T18:43:09Z",
    "license": "Apache-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/sanctuuary/ape"
        }
    ],
    "name": "APE",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1007/978-3-030-50436-6_34",
            "metadata": {
                "abstract": "© The Author(s) 2020.Automated workflow composition is bound to take the work with scientific workflows to the next level. On top of today’s comprehensive eScience infrastructure, it enables the automated generation of possible workflows for a given specification. However, functionality for automated workflow composition tends to be integrated with one of the many available workflow management systems, and is thus difficult or impossible to apply in other environments. Therefore we have developed APE (the Automated Pipeline Explorer) as a command-line tool and API for automated composition of scientific workflows. APE is easily configured to a new application domain by providing it with a domain ontology and semantically annotated tools. It can then be used to synthesize purpose-specific workflows based on a specification of the available workflow inputs, desired outputs and possibly additional constraints. The workflows can further be transformed into executable implementations and/or exported into standard workflow formats. In this paper we describe APE v1.0 and discuss lessons learned from applications in bioinformatics and geosciences.",
                "authors": [
                    {
                        "name": "Kasalica V."
                    },
                    {
                        "name": "Lamprecht A.-L."
                    }
                ],
                "citationCount": 1,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics)",
                "title": "Ape: A command-line tool and api for automated workflow composition"
            },
            "pmcid": "PMC7304703"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        }
    ],
    "validated": 1
}