
{
    "credit": [
        {
            "email": "morganellaalx@gmail.com",
            "name": "Sandro Morganella",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://bioconductor.org/packages/release/bioc/html/VegaMC.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/VegaMC_3.12.0.tar.gz"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Microarray hybridisation data",
                        "uri": "http://edamontology.org/data_3117"
                    },
                    "format": [
                        {
                            "term": "TSV",
                            "uri": "http://edamontology.org/format_3475"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Polymorphism detection",
                    "uri": "http://edamontology.org/operation_3202"
                },
                {
                    "term": "Genome comparison",
                    "uri": "http://edamontology.org/operation_3209"
                },
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "language": [
            "R"
        ],
        "license": "GPL-2.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "Microarray experiment",
                "uri": "http://edamontology.org/topic_3518"
            },
            {
                "term": "DNA mutation",
                "uri": "http://edamontology.org/topic_2533"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Identification of genetic alterations of tumor cells has become a common method to detect the genes involved in development and progression of cancer. In order to detect driver genes, several samples need to be simultaneously analyzed. The Cancer Genome Atlas (TCGA) project provides access to a large amount of data for several cancer types. TGCA is an invaluable source of information, but analysis of this huge dataset possess important computational problems in terms of memory and execution times. Here, we present a R/package, called VegaMC (Vega multi-channel), that enables fast and efficient detection of significant recurrent copy number alterations in very large datasets. VegaMC is integrated with the output of the common tools that convert allele signal intensities in log R ratio and B allele frequency. It also enables the detection of loss of heterozigosity and provides in output two web pages allowing a rapid and easy navigation of the aberrant genes. Synthetic data and real datasets are used for quantitative and qualitative evaluation purposes. In particular, we demonstrate the ability of VegaMC on two large TGCA datasets: colon adenocarcinoma and glioblastoma multiforme. For both the datasets, we provide the list of aberrant genes which contain previously validated genes and can be used as basis for further investigations. © The Author 2012. Published by Oxford University Press. All rights reserved.",
            "authors": [
                "Morganella S.",
                "Ceccarelli M."
            ],
            "cit_count": 0,
            "doi": "10.1093/bioinformatics/bts453",
            "journal": "Bioinformatics",
            "title": "VegaMC: A r/bioconductor package for fast downstream analysis of large array comparative genomic hybridization datasets",
            "type": "Primary",
            "year": "2012-10-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:vegamc",
        "biotoolsID": "vegamc",
        "description": "This package enables the detection of driver chromosomal imbalances including loss of heterozygosity (LOH) from array comparative genomic hybridization (aCGH) data. It performs a joint segmentation of a dataset and uses a statistical framework to distinguish between driver and passenger mutations. It also has been implemented so that it can be integrated with the output produced by PennCNV tool.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/VegaMC.html",
        "name": "VegaMC",
        "version": [
            "3.12.0"
        ]
    }
}