{
    "accessibility": [],
    "additionDate": "2017-03-24T11:45:13Z",
    "biotoolsCURIE": "biotools:jphmm",
    "biotoolsID": "jphmm",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": "jphmm-contact@gobics.de",
            "gridid": null,
            "name": "jpHMM Support",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        }
    ],
    "description": "Jumping Profile Hidden Markov Model (jpHMM) takes a HIV-1 or HBV genome sequence and uses a pre-calculated multiple alignment of the major HIV-1 or HBV subtypes to predict the phylogenetic breakpoints and HIV/HBV subtype of the submitted sequence.",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "http://jphmm.gobics.de/help.html"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                },
                {
                    "term": "Local alignment",
                    "uri": "http://edamontology.org/operation_0495"
                },
                {
                    "term": "Recombination detection",
                    "uri": "http://edamontology.org/operation_0451"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://jphmm.gobics.de/",
    "homepage_status": 0,
    "language": [],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "license": null,
    "link": [],
    "maturity": null,
    "name": "jpHMM",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": null,
            "metadata": {
                "abstract": "Detecting recombinations in the genome sequence of human immunodeficiency virus (HIV-1) is crucial for epidemiological studies and for vaccine development. Herein, we present a web {erver for sub-typing and localization of phylogenetic breakpoints in HIV-1. Our software is based on a jumping profile Hidden Markov Model (jpHMM), a probabilistic generalization of the jumping-alignment approach proposed by Spang et al. The input data for our server is a partial or complete genome sequence from HIV-1; our tool assigns regions of the input sequence to known subtypes of HIV-1 and predicts phylogenetic breakpoints. © 2006 The Author(s).",
                "authors": [
                    {
                        "name": "Zhang M."
                    },
                    {
                        "name": "Zhang A."
                    },
                    {
                        "name": "Schultz A.-K."
                    },
                    {
                        "name": "Calef C."
                    },
                    {
                        "name": "Kuiken C."
                    },
                    {
                        "name": "Leitner T."
                    },
                    {
                        "name": "Korber B."
                    },
                    {
                        "name": "Morgenstern B."
                    },
                    {
                        "name": "Stanke M."
                    }
                ],
                "citationCount": 38,
                "date": "2006-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "jpHMM at GOBICS: A web server to detect genomic recombinations in HIV-1"
            },
            "note": null,
            "pmcid": null,
            "pmid": "16845050",
            "type": null,
            "version": null
        },
        {
            "doi": null,
            "metadata": {
                "abstract": "We describe a new algorithm for protein classification and the detection of remote homologs. The rationale is to exploit both vertical and horizontal information of a multiple alignment in a well-balanced manner. This is in contrast to established methods such as profiles and profile hidden Markov models which focus on vertical information as they model the columns of the alignment independently and to family pairwise search which focuses on horizontal information as it treats given sequences separately. In our setting, we want to select from a given database of \"candidate sequences\" those proteins that belong to a given superfamily. In order to do so, each candidate sequence is separately tested against a multiple alignment of the known members of the superfamily by means of a new jumping alignment algorithm. This algorithm is an extension of the Smith-Waterman algorithm and computes a local alignment of a single sequence and a multiple alignment. In contrast to traditional methods, however, this alignment is not based on a summary of the individual columns of the multiple alignment. Rather, the candidate sequence is at each position aligned to one sequence of the multiple alignment, called the \"reference sequence.\" In addition, the reference sequence may change within the alignment, while each such jump is penalized. To evaluate the discriminative quality of the jumping alignment algorithm, we compare it to profiles, profile hidden Markov models, and family pairwise search on a subset of the SCOP database of protein domains. The discriminative quality is assessed by median false positive counts (med-FP-counts). For moderate med-FP-counts, the number of successful searches with our method is considerably higher than with the competing methods.",
                "authors": [
                    {
                        "name": "Spang R."
                    },
                    {
                        "name": "Rehmsmeier M."
                    },
                    {
                        "name": "Stoye J."
                    }
                ],
                "citationCount": 27,
                "date": "2002-12-01T00:00:00Z",
                "journal": "Journal of Computational Biology",
                "title": "A novel approach to remote homology detection: Jumping alignments"
            },
            "note": null,
            "pmcid": null,
            "pmid": "12487762",
            "type": null,
            "version": null
        },
        {
            "doi": null,
            "metadata": {
                "abstract": "Previously, we developed jumping profile hidden Markov model (jpHMM), a new method to detect recombinations in HIV-1 genomes. The jpHMM predicts recombination breakpoints in a query sequence and assigns to each position of the sequence one of the major HIV-1 subtypes. Since incorrect subtype assignment or recombination prediction may lead to wrong conclusions in epidemiological or vaccine research, information about the reliability of the predicted parental subtypes and breakpoint positions is valuable. For this reason, we extended the output of jpHMM to include such information in terms of 'uncertainty' regions in the recombination prediction and an interval estimate of the breakpoint. Both types of information are computed based on the posterior probabilities of the subtypes at each query sequence position. Our results show that this extension strongly improves the reliability of the jpHMM recombination prediction. The jpHMM is available online at http://jphmm.gobics.de/.",
                "authors": [
                    {
                        "name": "Schultz A.-K."
                    },
                    {
                        "name": "Zhang M."
                    },
                    {
                        "name": "Bulla I."
                    },
                    {
                        "name": "Leitner T."
                    },
                    {
                        "name": "Korber B."
                    },
                    {
                        "name": "Morgenstern B."
                    },
                    {
                        "name": "Stanke M."
                    }
                ],
                "citationCount": 61,
                "date": "2009-08-04T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "jpHMM: Improving the reliability of recombination prediction in HIV-1"
            },
            "note": null,
            "pmcid": null,
            "pmid": "19443440",
            "type": null,
            "version": null
        },
        {
            "doi": null,
            "metadata": {
                "abstract": "jpHMM is a very accurate and widely used tool for recombination detection in genomic sequences of HIV-1. Here, we present an extension of jpHMM to analyze recombinations in viruses with circular genomes such as the hepatitis B virus (HBV). Sequence analysis of circular genomes is usually performed on linearized sequences using linear models. Since linear models are unable to model dependencies between nucleotides at the 5′-and 3′-end of a sequence, this can result in inaccurate predictions of recombination breakpoints and thus in incorrect classification of viruses with circular genomes. The proposed circular jpHMM takes into account the circularity of the genome and is not biased against recombination breakpoints close to the 5′-or 3′-end of the linearized version of the circular genome. It can be applied automatically to any query sequence without assuming a specific origin for the sequence coordinates. We apply the method to genomic sequences of HBV and visualize its output in a circular form. jpHMM is available online at http://jphmm.gobics.de for download and as a web server for HIV-1 and HBV sequences. © 2012 The Author(s).",
                "authors": [
                    {
                        "name": "Schultz A.-K."
                    },
                    {
                        "name": "Bulla I."
                    },
                    {
                        "name": "Abdou-Chekaraou M."
                    },
                    {
                        "name": "Gordien E."
                    },
                    {
                        "name": "Morgenstern B."
                    },
                    {
                        "name": "Zoulim F."
                    },
                    {
                        "name": "Deny P."
                    },
                    {
                        "name": "Stanke M."
                    }
                ],
                "citationCount": 28,
                "date": "2012-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "JpHMM: Recombination analysis in viruses with circular genomes such as the hepatitis B virus"
            },
            "note": null,
            "pmcid": null,
            "pmid": "22600739",
            "type": null,
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Virology",
            "uri": "http://edamontology.org/topic_0781"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        }
    ],
    "validated": 1,
    "version": []
}