{
    "additionDate": "2017-02-14T09:35:49Z",
    "biotoolsCURIE": "biotools:blasto",
    "biotoolsID": "blasto",
    "collectionID": [
        "BLAST"
    ],
    "credit": [
        {
            "email": "lfl@princeton.edu",
            "name": "Laura F. Landweber",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Modified BLAST tool for searching orthologous group data. It treats each orthologous group as a unit and outputs a ranked list of orthologous groups instead of single sequences.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence similarity search",
                    "uri": "http://edamontology.org/operation_0346"
                }
            ]
        }
    ],
    "homepage": "http://oxytricha.princeton.edu/BlastO/index.html",
    "lastUpdate": "2019-07-22T12:31:50Z",
    "name": "BLASTO",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "We present BLAST on Orthologous groups (BLASTO), a modified BLAST tool for searching orthologous group data. It treats each orthologous group as a unit and outputs a ranked list of orthologous groups instead of single sequences. By filtering out redundancy and putative paralogs, sequence comparisons to orthologous groups, instead of to single sequences in the database, can improve both functional prediction and phylogenetic inference. BLASTO computes the significance score of each orthologous group based on the individual BLAST hits in the orthologous group, using the number of taxa in the group as an optional weight. This allows users to control the species diversity of the orthologous groups. BLASTO incorporates the best-known multispecies ortholog databases, including NCBI Clusters of Orthologous Group, NCBI euKaryotic Orthologous Group database, OrthoMCL, MultiParanoid and TIGR Eukaryotic Gene Orthologues database, and offers a useful platform to integrate orthology information into functional inference and evolutionary studies of individual sequences. BLASTO is accessible online at http://oxytricha.princeton.edu/BlastO. © 2007 The Author(s).",
                "authors": [
                    {
                        "name": "Zhou Y."
                    },
                    {
                        "name": "Landweber L.F."
                    }
                ],
                "citationCount": 25,
                "date": "2007-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "BLASTO: A tool for searching orthologous groups"
            },
            "pmid": "17483516"
        }
    ],
    "relation": [
        {
            "biotoolsID": "blast",
            "type": "uses"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}