{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2020-01-14T08:59:25Z",
    "biotoolsCURIE": "biotools:ACPred-Fuse",
    "biotoolsID": "ACPred-Fuse",
    "confidence_flag": "tool",
    "description": "ACPred-Fuse is a web application that automatically can predict protein sequences with or without anticancer activity in peptide form.",
    "download": [
        {
            "type": "Downloads page",
            "url": "http://server.malab.cn/ACPred-Fuse/Download.html"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peptide identification",
                    "uri": "http://edamontology.org/operation_3631"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                },
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                }
            ]
        }
    ],
    "homepage": "http://server.malab.cn/ACPred-Fuse/Server.html",
    "lastUpdate": "2021-01-11T15:00:11Z",
    "name": "ACPred-Fuse",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIB/BBZ088",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press. All rights reserved.Fast and accurate identification of the peptides with anticancer activity potential from large-scale proteins is currently a challenging task. In this study, we propose a new machine learning predictor, namely, ACPred-Fuse, that can automatically and accurately predict protein sequences with or without anticancer activity in peptide form. Specifically, we establish a feature representation learning model that can explore class and probabilistic information embedded in anticancer peptides (ACPs) by integrating a total of 29 different sequence-based feature descriptors. In order to make full use of various multiview information, we further fused the class and probabilistic features with handcrafted sequential features and then optimized the representation ability of the multiview features, which are ultimately used as input for training our prediction model. By comparing the multiview features and existing feature descriptors, we demonstrate that the fused multiview features have more discriminative ability to capture the characteristics of ACPs. In addition, the information from different views is complementary for the performance improvement. Finally, our benchmarking comparison results showed that the proposed ACPred-Fuse is more precise and promising in the identification of ACPs than existing predictors. To facilitate the use of the proposed predictor, we built a web server, which is now freely available via http://server.malab.cn/ACPred-Fuse.",
                "authors": [
                    {
                        "name": "Rao B."
                    },
                    {
                        "name": "Zhou C."
                    },
                    {
                        "name": "Zhang G."
                    },
                    {
                        "name": "Su R."
                    },
                    {
                        "name": "Wei L."
                    }
                ],
                "citationCount": 10,
                "date": "2020-09-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "ACPred-Fuse: Fusing multi-view information improves the prediction of anticancer peptides"
            },
            "pmid": "31729528"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ],
    "validated": 1
}