{
    "additionDate": "2018-06-05T17:12:30Z",
    "biotoolsCURIE": "biotools:sailfish-cir",
    "biotoolsID": "sailfish-cir",
    "credit": [
        {
            "email": "zerodel@126.com",
            "name": "Musheng Li",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Pipeline for quantification of circular RNA.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/zerodel/Sailfish-cir"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA-Seq quantification",
                    "uri": "http://edamontology.org/operation_3800"
                },
                {
                    "term": "RNA structure prediction",
                    "uri": "http://edamontology.org/operation_2441"
                }
            ]
        }
    ],
    "homepage": "https://github.com/zerodel/Sailfish-cir",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "Sailfish-cir",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btx129",
            "metadata": {
                "abstract": "© 2017 The Author. Published by Oxford University Press. All rights reserved.Motivation: Circular RNAs (circRNAs) are a class of non-coding RNAs that are widely expressed in various cell lines and tissues of many organisms. Although the exact function of many circRNAs is largely unknown, the cell type-and tissue-specific circRNA expression has implicated their crucial functions in many biological processes. Hence, the quantification of circRNA expression from high-throughput RNA-seq data is becoming important to ascertain. Although many model-based methods have been developed to quantify linear RNA expression from RNA-seq data, these methods are not applicable to circRNA quantification. Results: Here, we proposed a novel strategy that transforms circular transcripts to pseudo-linear transcripts and estimates the expression values of both circular and linear transcripts using an existing model-based algorithm, Sailfish. The new strategy can accurately estimate transcript expression of both linear and circular transcripts from RNA-seq data. Several factors, such as gene length, amount of expression and the ratio of circular to linear transcripts, had impacts on quantification performance of circular transcripts. In comparison to count-based tools, the new computational framework had superior performance in estimating the amount of circRNA expression from both simulated and real ribosomal RNA-depleted (rRNA-depleted) RNA-seq datasets. On the other hand, the consideration of circular transcripts in expression quantification from rRNA-depleted RNA-seq data showed substantial increased accuracy of linear transcript expression. Our proposed strategy was implemented in a program named Sailfish-cir.",
                "authors": [
                    {
                        "name": "Li M."
                    },
                    {
                        "name": "Xie X."
                    },
                    {
                        "name": "Zhou J."
                    },
                    {
                        "name": "Sheng M."
                    },
                    {
                        "name": "Yin X."
                    },
                    {
                        "name": "Ko E.-A."
                    },
                    {
                        "name": "Zhou T."
                    },
                    {
                        "name": "Gu W."
                    }
                ],
                "citationCount": 22,
                "date": "2017-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Quantifying circular RNA expression from RNA-seq data using model-based framework"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}