
{
    "credit": [
        {
            "email": "jparkin@sickkids.ca",
            "name": "Dr. John Parkinson",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://compsysbio.org/elastin/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                },
                {
                    "term": "Representative sequence identification",
                    "uri": "http://edamontology.org/operation_2233"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Gene transcripts",
                "uri": "http://edamontology.org/topic_3512"
            },
            {
                "term": "Sequence composition, complexity and repeats",
                "uri": "http://edamontology.org/topic_0157"
            },
            {
                "term": "Phylogeny",
                "uri": "http://edamontology.org/topic_0084"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Due to the low complexity associated with their sequences, uncovering the evolutionary and functional relationships in highly repetitive proteins such as elastin, spider silks, resilin and abductin represents a significant challenge. Using the polymeric extracellular protein elastin as a model system, we present a novel computational approach to the study of sequence, function and evolutionary relationships in repetitive proteins. To address the absence of accurate sequence annotation for repetitive proteins such as elastin, we have constructed a new database repository, ElastoDB (http://theileria.ccb.sickkids.ca/elastin), dedicated to the storage and retrieval of elastin sequence- and meta-data. To analyse their sequence relationships we have devised an innovative new method, based on the identification of overrepresented 'fuzzy' motifs. Applying this method to elastin sequences derived from mammals, chicken, Xenopus and zebrafish resulted in the identification of both highly conserved, and taxon and species specific motifs that likely represent important functional and/or structural elements. The relative spacing and organization of these elements suggest that exon duplication events have played an important role in the evolution of elastin. Clustering of similarity profiles generated for sets of exons and introns, revealed a pattern of putative duplication events involving exons 15-30 in mammalian and chicken elastins, exons 20-31 in both zebrafish elastins, exons 15-20 in fugu elastin and exons 35-50 in Xenopus elastin 1. The success of this approach for elastin offers a promising route to the elucidation of sequence, structure, function and evolutionary relationships for many other proteins with sequences of low complexity. © 2007 International Society of Matrix Biology.",
            "authors": [
                "He D.",
                "Chung M.",
                "Chan E.",
                "Alleyne T.",
                "Ha K.C.H.",
                "Miao M.",
                "Stahl R.J.",
                "Keeley F.W.",
                "Parkinson J."
            ],
            "cit_count": 35,
            "journal": "Matrix Biology",
            "pmid": "17628459",
            "title": "Comparative genomics of elastin: Sequence analysis of a highly repetitive protein",
            "year": "2007-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:elastodb",
        "biotoolsID": "elastodb",
        "description": "Repository for well-characterized elastin sequences to facilitate its study. The database has since expanded to include other non-elastin sequences that share elastic properties.",
        "homepage": "http://www.compsysbio.org/elastin/",
        "name": "ElastoDB"
    }
}