{
    "additionDate": "2021-01-18T12:15:27Z",
    "biotoolsCURIE": "biotools:acpredstackl",
    "biotoolsID": "acpredstackl",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Jiangning.Song@monash.edu",
            "name": "Jiangning Song",
            "typeEntity": "Person"
        },
        {
            "email": "liuqzhong@nwsuaf.edu.cn",
            "name": "Shuqin Li",
            "typeEntity": "Person"
        },
        {
            "email": "lsq_cie@nwsuaf.edu.cn",
            "name": "Quanzhong Liu",
            "typeEntity": "Person"
        }
    ],
    "description": "ACPredStackL  is a ensemble learning framework using stacking strategy for accurate identification of ACPs.\nAnticancer peptides (ACPs),known as potential future therapeutics for cancer, have been studied extensively,attribution to their unique ability to target cancer cells without affecting healthy cells directly.Many peptide-based drugs are currently being evaluated in preclinical and clinical trial.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA-binding protein prediction",
                    "uri": "http://edamontology.org/operation_3900"
                },
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                },
                {
                    "term": "Peptide identification",
                    "uri": "http://edamontology.org/operation_3631"
                }
            ]
        }
    ],
    "homepage": "http://bigdata.biocie.cn/ACPredStackL/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-19T12:54:29Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/liangxiaoq/ACPredStackL"
        }
    ],
    "name": "ACPredStackL",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAA312",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.Anti-cancer peptides (ACPs) are known as potential therapeutics for cancer. Due to their unique ability to target cancer cells without affecting healthy cells directly, they have been extensively studied. Many peptide-based drugs are currently evaluated in the preclinical and clinical trials. Accurate identification of ACPs has received considerable attention in recent years; as such, a number of machine learning-based methods for in silico identification of ACPs have been developed. These methods promote the research on the mechanism of ACPs therapeutics against cancer to some extent. There is a vast difference in these methods in terms of their training/testing datasets, machine learning algorithms, feature encoding schemes, feature selection methods and evaluation strategies used. Therefore, it is desirable to summarize the advantages and disadvantages of the existing methods, provide useful insights and suggestions for the development and improvement of novel computational tools to characterize and identify ACPs. With this in mind, we firstly comprehensively investigate 16 state-of-the-art predictors for ACPs in terms of their core algorithms, feature encoding schemes, performance evaluation metrics and webserver/software usability. Then, comprehensive performance assessment is conducted to evaluate the robustness and scalability of the existing predictors using a well-prepared benchmark dataset. We provide potential strategies for the model performance improvement. Moreover, we propose a novel ensemble learning framework, termed ACPredStackL, for the accurate identification of ACPs. ACPredStackL is developed based on the stacking ensemble strategy combined with SVM, Naïve Bayesian, lightGBM and KNN. Empirical benchmarking experiments against the state-of-the-art methods demonstrate that ACPredStackL achieves a comparative performance for predicting ACPs. The webserver and source code of ACPredStackL is freely available at http://bigdata.biocie.cn/ACPredStackL/ and https://github.com/liangxiaoq/ACPredStackL, respectively.",
                "authors": [
                    {
                        "name": "Chen J."
                    },
                    {
                        "name": "Li F."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Li S."
                    },
                    {
                        "name": "Liang X."
                    },
                    {
                        "name": "Liu Q."
                    },
                    {
                        "name": "Song J."
                    },
                    {
                        "name": "Wu H."
                    }
                ],
                "citationCount": 2,
                "date": "2021-07-20T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "Large-scale comparative review and assessment of computational methods for anti-cancer peptide identification"
            },
            "pmid": "33316035"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
