{
    "additionDate": "2017-01-13T13:13:56Z",
    "biotoolsCURIE": "biotools:cabog",
    "biotoolsID": "cabog",
    "credit": [
        {
            "email": "jmiller@jcvi.org",
            "name": "J. Miller",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Celera Assembler is scientific software for DNA research.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://wgs-assembler.sourceforge.net/wiki/index.php?title=Main_Page"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "http://wgs-assembler.sourceforge.net/",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:54Z",
    "maturity": "Mature",
    "name": "CABOG",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: DNA sequence reads from Sanger and pyrosequencing platforms differ in cost, accuracy, typical coverage, average read length and the variety of available paired-end protocols. Both read types can complement one another in a 'hybrid' approach to whole-genome shotgun sequencing projects, but assembly software must be modified to accommodate their different characteristics. This is true even of pyrosequencing mated and unmated read combinations. Without special modifications, assemblers tuned for homogeneous sequence data may perform poorly on hybrid data. Results: Celera Assembler was modified for combinations of ABI 3730 and 454 FLX reads. The revised pipeline called CABOG (Celera Assembler with the Best Overlap Graph) is robust to homopolymer run length uncertainty, high read coverage and heterogeneous read lengths. In tests on four genomes, it generated the longest contigs among all assemblers tested. It exploited the mate constraints provided by paired-end reads from either platform to build larger contigs and scaffolds, which were validated by comparison to a finished reference sequence. A low rate of contig mis-assembly was detected in some CABOG assemblies, but this was reduced in the presence of sufficient mate pair data. © The Author 2008. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Brownley A."
                    },
                    {
                        "name": "Delcher A.L."
                    },
                    {
                        "name": "Johnson J."
                    },
                    {
                        "name": "Koren S."
                    },
                    {
                        "name": "Li K."
                    },
                    {
                        "name": "Miller J.R."
                    },
                    {
                        "name": "Mobarry C."
                    },
                    {
                        "name": "Sutton G."
                    },
                    {
                        "name": "Venter E."
                    },
                    {
                        "name": "Walenz B.P."
                    }
                ],
                "citationCount": 358,
                "date": "2008-12-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Aggressive assembly of pyrosequencing reads with mates"
            },
            "pmid": "18952627"
        }
    ],
    "toolType": [
        "Suite"
    ],
    "topic": [
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ],
    "validated": 1
}
