{
    "accessibility": "Open access",
    "additionDate": "2017-01-13T13:13:33Z",
    "biotoolsCURIE": "biotools:annovar",
    "biotoolsID": "annovar",
    "collectionID": [
        "ANNOVAR",
        "Rare Disease"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "email": "kai@openbioinformatics.org",
            "name": "Kai Wang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A tool for finding relevant genetic variants from high-throughput sequencing data based on functional annotation.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://annovar.openbioinformatics.org/en/latest/"
        }
    ],
    "editPermission": {
        "authors": [
            "ELIXIR-EE",
            "sergitobara"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene functional annotation",
                    "uri": "http://edamontology.org/operation_3672"
                },
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                },
                {
                    "term": "Variant prioritisation",
                    "uri": "http://edamontology.org/operation_3226"
                }
            ]
        }
    ],
    "homepage": "http://annovar.openbioinformatics.org/en/latest/",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2022-07-01T13:27:45.088269Z",
    "maturity": "Mature",
    "name": "ANNOVAR",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "doi": "10.1038/nprot.2015.105",
            "metadata": {
                "abstract": "© 2015 Nature America, Inc. All rights reserved.Recent developments in sequencing techniques have enabled rapid and high-throughput generation of sequence data, democratizing the ability to compile information on large amounts of genetic variations in individual laboratories. However, there is a growing gap between the generation of raw sequencing data and the extraction of meaningful biological information. Here, we describe a protocol to use the ANNOVAR (ANNOtate VARiation) software to facilitate fast and easy variant annotations, including gene-based, region-based and filter-based annotations on a variant call format (VCF) file generated from human genomes. We further describe a protocol for gene-based annotation of a newly sequenced nonhuman species. Finally, we describe how to use a user-friendly and easily accessible web server called wANNOVAR to prioritize candidate genes for a Mendelian disease. The variant annotation protocols take 5-30 min of computer time, depending on the size of the variant file, and 5-10 min of hands-on time. In summary, through the command-line tool and the web server, these protocols provide a convenient means to analyze genetic variants generated in humans and other species.",
                "authors": [
                    {
                        "name": "Wang K."
                    },
                    {
                        "name": "Yang H."
                    }
                ],
                "citationCount": 438,
                "date": "2015-10-29T00:00:00Z",
                "journal": "Nature Protocols",
                "title": "Genomic variant annotation and prioritization with ANNOVAR and wANNOVAR"
            },
            "pmcid": "PMC4718734",
            "pmid": "26379229"
        },
        {
            "doi": "10.1093/nar/gkq603",
            "metadata": {
                "abstract": "High-throughput sequencing platforms are generating massive amounts of genetic variation data for diverse genomes, but it remains a challenge to pinpoint a small subset of functionally important variants. To fill these unmet needs, we developed the ANNOVAR tool to annotate single nucleotide variants (SNVs) and insertions/deletions, such as examining their functional consequence on genes, inferring cytogenetic bands, reporting functional importance scores, finding variants in conserved regions, or identifying variants reported in the 1000 Genomes Project and dbSNP. ANNOVAR can utilize annotation databases from the UCSC Genome Browser or any annotation data set conforming to Generic Feature Format version 3 (GFF3). We also illustrate a 'variants reduction' protocol on 4.7 million SNVs and indels from a human genome, including two causal mutations for Miller syndrome, a rare recessive disease. Through a stepwise procedure, we excluded variants that are unlikely to be causal, and identified 20 candidate genes including the causal gene. Using a desktop computer, ANNOVAR requires ~4 min to perform gene-based annotation and ~15 min to perform variants reduction on 4.7 million variants, making it practical to handle hundreds of human genomes in a day. ANNOVAR is freely available at http://www.openbioinformatics.org/annovar/. © The Author(s) 2010. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Hakonarson H."
                    },
                    {
                        "name": "Li M."
                    },
                    {
                        "name": "Wang K."
                    }
                ],
                "citationCount": 7027,
                "date": "2010-07-03T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "ANNOVAR: Functional annotation of genetic variants from high-throughput sequencing data"
            },
            "pmcid": "PMC2938201",
            "pmid": "20601685",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1136/jmedgenet-2012-100918",
            "metadata": {
                "abstract": "Background High-throughput DNA sequencing platforms have become widely available. As a result, personal genomes are increasingly being sequenced in research and clinical settings. However, the resulting massive amounts of variants data pose significant challenges to the average biologists and clinicians without bioinformatics skills. Methods and results We developed a web server called wANNOVAR to address the critical needs for functional annotation of genetic variants from personal genomes. The server provides simple and intuitive interface to help users determine the functional significance of variants. These include annotating single nucleotide variants and insertions/deletions for their effects on genes, reporting their conservation levels (such as PhyloP and GERP++ scores), calculating their predicted functional importance scores (such as SIFT and PolyPhen scores), retrieving allele frequencies in public databases (such as the 1000 Genomes Project and NHLBI-ESP 5400 exomes), and implementing a 'variants reduction' protocol to identify a subset of potentially deleterious variants/genes. We illustrated how wANNOVAR can help draw biological insights from sequencing data, by analysing genetic variants generated on two Mendelian diseases. Conclusions We conclude that wANNOVAR will help biologists and clinicians take advantage of the personal genome information to expedite scientific discoveries. The wANNOVAR server is available at http://wannovar. usc.edu, and will be continuously updated to reflect the latest annotation information.",
                "authors": [
                    {
                        "name": "Chang X."
                    },
                    {
                        "name": "Wang K."
                    }
                ],
                "citationCount": 267,
                "date": "2012-07-01T00:00:00Z",
                "journal": "Journal of Medical Genetics",
                "title": "Wannovar: Annotating genetic variants for personal genomes via the web"
            },
            "pmid": "22717648"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web service"
    ],
    "topic": [
        {
            "term": "Functional genomics",
            "uri": "http://edamontology.org/topic_0085"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        }
    ],
    "validated": 1
}
