{
    "additionDate": "2021-01-18T11:43:43Z",
    "biotoolsCURIE": "biotools:caprib",
    "biotoolsID": "caprib",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "frederic.veyrier@inrs.ca",
            "name": "Frederic J. Veyrier",
            "orcidid": "https://orcid.org/0000-0002-8574-0547",
            "typeEntity": "Person"
        }
    ],
    "description": "Bioinformatics Tool for Comparative Analyses of Proteins In Bacteria (CAPRIB) is a user-friendly tool to study amino acid changes and selection for the exploration of intra-genus evolution. CAPRIB efficiently finds through an easy-to-use graphical interface amino-acid changes that are strictly associated to the emergence of a phenotype.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Phylogenetic analysis",
                    "uri": "http://edamontology.org/operation_0324"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BactSymEvol/Caprib",
    "language": [
        "Java",
        "Perl",
        "SQL"
    ],
    "lastUpdate": "2021-02-07T13:14:11Z",
    "name": "CAPRIB",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12864-020-07232-3",
            "metadata": {
                "abstract": "© 2020, The Author(s).Background: The evolution of bacteria is shaped by different mechanisms such as mutation, gene deletion, duplication, or insertion of foreign DNA among others. These genetic changes can accumulate in the descendants as a result of natural selection. Using phylogeny and genome comparisons, evolutionary paths can be somehow retraced, with recent events being much easier to detect than older ones. For this reason, multiple tools are available to study the evolutionary events within genomes of single species, such as gene composition alterations, or subtler mutations such as SNPs. However, these tools are generally designed to compare similar genomes and require advanced skills in bioinformatics. We present CAPRIB, a unique tool developed in Java that allows to determine the amino acid changes, at the genus level, that correlate with phenotypic differences between two groups of organisms. Results: CAPRIB has a user-friendly graphical interface and uses databases in SQL, making it easy to compare several genomes without the need for programming or thorough knowledge in bioinformatics. This intuitive software narrows down a list of amino acid changes that are concomitant with a given phenotypic divergence at the genus scale. Each permutation found by our software is associated with two already described statistical values that indicate its potential impact on the protein’s function, helping the user decide which promising candidates to further investigate. We show that CAPRIB is able to detect already known mutations and uncovers many more, and that this tool can be used to question molecular phylogeny. Finally, we exemplify the utility of CAPRIB by pinpointing amino acid changes that coincided with the emergence of slow-growing mycobacteria from their fast-growing counterparts. The software is freely available at https://github.com/BactSymEvol/Caprib. Conclusions: CAPRIB is a new bioinformatics software aiming to make genus-scale comparisons accessible to all. With its intuitive graphical interface, this tool identifies key amino acid changes concomitant with a phenotypic divergence. By comparing fast and slow-growing mycobacteria, we shed light on evolutionary hotspots, such as the cytokinin pathway, that are interesting candidates for further experimentations.",
                "authors": [
                    {
                        "name": "Guerra Maldonado J.F."
                    },
                    {
                        "name": "Vincent A.T."
                    },
                    {
                        "name": "Chenal M."
                    },
                    {
                        "name": "Veyrier F.J."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "CAPRIB: a user-friendly tool to study amino acid changes and selection for the exploration of intra-genus evolution"
            },
            "pmcid": "PMC7690079",
            "pmid": "33243176"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Molecular evolution",
            "uri": "http://edamontology.org/topic_3945"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}