
{
    "credit": [
        {
            "email": "hyung_won_choi@nuhs.edu.sg",
            "name": "Hyungwon Choi",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://sourceforge.net/projects/mapdia/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://mapdia.sourceforge.net/Main.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Spectral analysis",
                    "uri": "http://edamontology.org/operation_3214"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Proteomics"
        ],
        "language": [
            "C++"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Proteomics",
                "uri": "http://edamontology.org/topic_0121"
            },
            {
                "term": "Proteomics experiment",
                "uri": "http://edamontology.org/topic_3520"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/mapdia-model-based-analysis-of-quantitative-proteomics-data-in-dia-ms.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2015 Elsevier B.V. Data independent acquisition (DIA) mass spectrometry is an emerging technique that offers more complete detection and quantification of peptides and proteins across multiple samples. DIA allows fragment-level quantification, which can be considered as repeated measurements of the abundance of the corresponding peptides and proteins in the downstream statistical analysis. However, few statistical approaches are available for aggregating these complex fragment-level data into peptide- or protein-level statistical summaries. In this work, we describe a software package, mapDIA, for statistical analysis of differential protein expression using DIA fragment-level intensities. The workflow consists of three major steps: intensity normalization, peptide/fragment selection, and statistical analysis. First, mapDIA offers normalization of fragment-level intensities by total intensity sums as well as a novel alternative normalization by local intensity sums in retention time space. Second, mapDIA removes outlier observations and selects peptides/fragments that preserve the major quantitative patterns across all samples for each protein. Last, using the selected fragments and peptides, mapDIA performs model-based statistical significance analysis of protein-level differential expression between specified groups of samples. Using a comprehensive set of simulation datasets, we show that mapDIA detects differentially expressed proteins with accurate control of the false discovery rates. We also describe the analysis procedure in detail using two recently published DIA datasets generated for 14-3-3. β dynamic interaction network and prostate cancer glycoproteome. Availability: The software was written in C. ++ language and the source code is available for free through SourceForge website http://sourceforge.net/projects/mapdia/.This article is part of a Special Issue entitled: Computational Proteomics.",
            "authors": [
                "Teo G.",
                "Kim S.",
                "Tsou C.-C.",
                "Collins B.",
                "Gingras A.-C.",
                "Nesvizhskii A.I.",
                "Choi H."
            ],
            "cit_count": 29,
            "journal": "Journal of Proteomics",
            "pmid": "26381204",
            "title": "MapDIA: Preprocessing and statistical analysis of quantitative proteomics data from data independent acquisition mass spectrometry",
            "year": "2015-11-03"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:mapdia",
        "biotoolsID": "mapdia",
        "description": "Performs essential data preprocessing, including novel retention time-based normalization method and a sequence of peptide/fragment selection steps, and more importantly, hierarchical model-based statistical significance analysis for multi-group comparisons under representative experimental designs.",
        "homepage": "http://sourceforge.net/projects/mapdia/.",
        "name": "MAPDIA"
    }
}