{
    "additionDate": "2017-01-17T15:07:56Z",
    "biotoolsCURIE": "biotools:open_babel",
    "biotoolsID": "open_babel",
    "collectionID": [
        "EBI Training Tools"
    ],
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://sourceforge.net/projects/openbabel/support?source=navbar"
        }
    ],
    "description": "Chemical toolbox designed to search, convert, analyze, or store data from molecular modeling, chemistry, solid-state materials, biochemistry, or related areas.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://openbabel.org/wiki/Help"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://openbabel.org/wiki/Main_Page",
    "language": [
        "Java",
        "Python"
    ],
    "lastUpdate": "2021-04-26T08:37:03.972113Z",
    "name": "Open Babel",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_014920"
        }
    ],
    "owner": "ebi_training_import",
    "publication": [
        {
            "doi": "10.1186/1758-2946-3-33",
            "metadata": {
                "abstract": "Background: A frequent problem in computational modeling is the interconversion of chemical structures between different formats. While standard interchange formats exist (for example, Chemical Markup Language) and de facto standards have arisen (for example, SMILES format), the need to interconvert formats is a continuing problem due to the multitude of different application areas for chemistry data, differences in the data stored by different formats (0D versus 3D, for example), and competition between software along with a lack of vendorneutral formats. Results: We discuss, for the first time, Open Babel, an open-source chemical toolbox that speaks the many languages of chemical data. Open Babel version 2.3 interconverts over 110 formats. The need to represent such a wide variety of chemical and molecular data requires a library that implements a wide range of cheminformatics algorithms, from partial charge assignment and aromaticity detection, to bond order perception and canonicalization. We detail the implementation of Open Babel, describe key advances in the 2.3 release, and outline a variety of uses both in terms of software products and scientific research, including applications far beyond simple format interconversion. Conclusions: Open Babel presents a solution to the proliferation of multiple chemical file formats. In addition, it provides a variety of useful utilities from conformer searching and 2D depiction, to filtering, batch conversion, and substructure and similarity searching. For developers, it can be used as a programming library to handle chemical data in areas such as organic chemistry, drug design, materials science, and computational chemistry. It is freely available under an open-source license from http://openbabel.org. © 2011 O'Boyle et al; licensee Chemistry Central Ltd.",
                "authors": [
                    {
                        "name": "O'Boyle N.M."
                    },
                    {
                        "name": "Banck M."
                    },
                    {
                        "name": "James C.A."
                    },
                    {
                        "name": "Morley C."
                    },
                    {
                        "name": "Vandermeersch T."
                    },
                    {
                        "name": "Hutchison G.R."
                    }
                ],
                "citationCount": 2952,
                "date": "2011-10-01T00:00:00Z",
                "journal": "Journal of Cheminformatics",
                "title": "Open Babel: An Open chemical toolbox"
            }
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        },
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        },
        {
            "term": "Biochemistry",
            "uri": "http://edamontology.org/topic_3292"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        }
    ],
    "validated": 1
}