{
    "accessibility": "Open access",
    "additionDate": "2022-10-09T19:11:16.275319Z",
    "biotoolsCURIE": "biotools:prost",
    "biotoolsID": "prost",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "Jiangning.Song@monash.edu",
            "name": "Jiangning Song",
            "orcidid": "https://orcid.org/0000-0001-8031-9086"
        },
        {
            "name": "Dong-Jun Yu",
            "orcidid": "https://orcid.org/0000-0002-6786-8053"
        },
        {
            "name": "Fuyi Li",
            "orcidid": "https://orcid.org/0000-0001-5216-3213"
        },
        {
            "name": "Robin B. Gasser",
            "orcidid": "https://orcid.org/0000-0002-4423-1690"
        }
    ],
    "description": "AlphaFold2-aware Sequence-Based Predictor to Estimate Protein Stability Changes upon Missense Mutations.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein sequence",
                        "uri": "http://edamontology.org/data_2976"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Variant effect prediction",
                    "uri": "http://edamontology.org/operation_0331"
                }
            ]
        }
    ],
    "homepage": "https://prost.erc.monash.edu/seq",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:28:04.197524Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/ShahidIqb/PROST"
        }
    ],
    "name": "PROST",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1021/acs.jcim.2c00799",
            "metadata": {
                "abstract": "An essential step in engineering proteins and understanding disease-causing missense mutations is to accurately model protein stability changes when such mutations occur. Here, we developed a new sequence-based predictor for the protein stability (PROST) change (Gibb's free energy change, Δ ΔG) upon a single-point missense mutation. PROST extracts multiple descriptors from the most promising sequence-based predictors, such as BoostDDG, SAAFEC-SEQ, and DDGun. RPOST also extracts descriptors from iFeature and AlphaFold2. The extracted descriptors include sequence-based features, physicochemical properties, evolutionary information, evolutionary-based physicochemical properties, and predicted structural features. The PROST predictor is a weighted average ensemble model based on extreme gradient boosting (XGBoost) decision trees and an extra-trees regressor; PROST is trained on both direct and hypothetical reverse mutations using the S5294 (S2647 direct mutations + S2647 inverse mutations). The parameters for the PROST model are optimized using grid searching with 5-fold cross-validation, and feature importance analysis unveils the most relevant features. The performance of PROST is evaluated in a blinded manner, employing nine distinct data sets and existing state-of-the-art sequence-based and structure-based predictors. This method consistently performs well on frataxin, S217, S349, Ssym, S669, Myoglobin, and CAGI5 data sets in blind tests and similarly to the state-of-the-art predictors for p53 and S276 data sets. When the performance of PROST is compared with the latest predictors such as BoostDDG, SAAFEC-SEQ, ACDC-NN-seq, and DDGun, PROST dominates these predictors. A case study of mutation scanning of the frataxin protein for nine wild-type residues demonstrates the utility of PROST. Taken together, these findings indicate that PROST is a well-suited predictor when no protein structural information is available. The source code of PROST, data sets, examples, and pretrained models along with how to use PROST are available at https://github.com/ShahidIqb/PROST and https://prost.erc.monash.edu/seq.",
                "authors": [
                    {
                        "name": "Akutsu T."
                    },
                    {
                        "name": "Gasser R.B."
                    },
                    {
                        "name": "Ge F."
                    },
                    {
                        "name": "Iqbal S."
                    },
                    {
                        "name": "Li F."
                    },
                    {
                        "name": "Song J."
                    },
                    {
                        "name": "Webb G.I."
                    },
                    {
                        "name": "Yu D.-J."
                    },
                    {
                        "name": "Zheng Y."
                    }
                ],
                "citationCount": 29,
                "date": "2022-09-12T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "PROST: AlphaFold2-aware Sequence-Based Predictor to Estimate Protein Stability Changes upon Missense Mutations"
            },
            "pmid": "35973091"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        }
    ],
    "validated": 1
}
