{
    "additionDate": "2022-08-20T11:40:13.335658Z",
    "biotoolsCURIE": "biotools:dsdatlas",
    "biotoolsID": "dsdatlas",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "chenrongpumch@163.com",
            "name": "Rong Chen"
        },
        {
            "name": "Duoduo Zhang"
        }
    ],
    "description": "A disorders of sex development atlas for reproductive endocrinology-related gene discovery in integrative omics platforms.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Expression data visualisation",
                    "uri": "http://edamontology.org/operation_0571"
                }
            ]
        }
    ],
    "homepage": "http://dsd.geneworks.cn",
    "lastUpdate": "2022-08-20T11:40:13.338311Z",
    "license": "Not licensed",
    "name": "DSDatlas",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.XFSS.2022.02.007",
            "metadata": {
                "abstract": "© 2022 American Society for Reproductive MedicineObjective: To facilitate the identification of related genes and candidate biomarkers for disorders of sex development (DSD), we present disorders of sex development atlas (http://dsd.geneworks.cn). Disorders of sex development are a spectrum of endocrine diseases with distinct mutations of genes or chromosomes, but several issues regarding their pathogenesis remain elusive. High-throughput methods have allowed genomic and transcriptomic analyses of DSD; however, these data are deposited in various repositories owing to a lack of integrated online resources. Design: A descriptive study of a specialized gene discovery platform designed for DSD. Setting: Publicly available DSD omics datasets and self-produced datasets. Patient(s): None. Intervention(s): None. Main Outcome Measure(s): The gene ranking result, with detailed information based on DSD terms in a gene-disease association knowledge base, and results of differential gene expression and mutation analyses from omics datasets. Result(s): The disorders of sex development atlas maintains both a knowledgebase for ranking DSD candidate genes and a database for DSD-related omics data analysis and visualization. We included 4 dominant classes of DSD in the knowledgebase: 15 subclasses and 44 specific disease names. Construction of the knowledgebase was centered upon Phenolyzer, with add-on seed gene databases customized by DSD-related genes collected from MalaCards, GeneCards, and DisGeNET. For the database, 25 experimental datasets related to DSD were integrated, including 24 public datasets from Gene Expression Omnibus and Sequence Read Archive and 1 self-generated dataset. A total of 474 samples from 240 DSD samples were collected for the database. Conclusion(s): This platform provides a friendly interface that integrates flexible and comprehensive analysis tools for differential expression and gene mutations between the DSD groups and controls.",
                "authors": [
                    {
                        "name": "Chen R."
                    },
                    {
                        "name": "Jiang T."
                    },
                    {
                        "name": "Luo M."
                    },
                    {
                        "name": "Su M."
                    },
                    {
                        "name": "Tang R."
                    },
                    {
                        "name": "Zhang D."
                    }
                ],
                "date": "2022-05-01T00:00:00Z",
                "journal": "F and S Science",
                "title": "DSDatlas: disorders of sex development atlas for reproductive endocrinology-related gene discovery in integrative omics platforms"
            },
            "pmid": "35560008"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Reproductive health",
            "uri": "http://edamontology.org/topic_3420"
        }
    ],
    "validated": 1
}
