{"credit":[{"email":"samal@combine.rwth-aachen.de","name":"Satya Swarup Sama","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"frohlich@bit.uni-bonn.de","name":"Holger Fröhlich","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://sourceforge.net/p/metabolic-network-sgl/git/ci/master/tree/"}],"function":[{"operation":[{"term":"Pathway or network analysis","uri":"http://edamontology.org/operation_2497"}]}],"labels":{"language":["R"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Library"],"topic":[{"term":"Phenomics","uri":"http://edamontology.org/topic_3298"},{"term":"Genotype and phenotype","uri":"http://edamontology.org/topic_0625"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"}]},"publication":[{"abstract":"© The Author 2017. Published by Oxford University Press. All rights reserved. For Permissions, please e-mail: journals.permissions@oup.comSupplementary information: Supplementary data are available at Bioinformatics online.Motivation: Integration of metabolic networks with '-omics' data has been a subject of recent research in order to better understand the behaviour of such networks with respect to differences between biological and clinical phenotypes. Under the conditions of steady state of the reaction network and the non-negativity of fluxes, metabolic networks can be algebraically decomposed into a set of sub-pathways often referred to as extreme currents (ECs). Our objective is to find the statistical association of such sub-pathways with given clinical outcomes, resulting in a particular instance of a self-contained gene set analysis method. In this direction, we propose a method based on sparse group lasso (SGL) to identify phenotype associated ECs based on gene expression data. SGL selects a sparse set of feature groups and also introduces sparsity within each group. Features in our model are clusters of ECs, and feature groups are defined based on correlations among these features.Results: We apply our method to metabolic networks from KEGG database and study the association of network features to prostate cancer (where the outcome is tumor and normal, respectively) as well as glioblastoma multiforme (where the outcome is survival time). In addition, simulations show the superior performance of our method compared to global test, which is an existing self-contained gene set analysis method.Availability and implementation: R code (compatible with version 3.2.5) is available from http://www.abi.bit.uni-bonn.de/index.php?id=17.Contact: samal@combine.rwth-aachen.de or frohlich@bit.uni-bonn.de.","authors":["Samal S.S.","Radulescu O.","Weber A.","Frohlich H."],"cit_count":2,"doi":"10.1093/bioinformatics/btx427","journal":"Bioinformatics (Oxford, England)","title":"Linking metabolic network features to phenotypes using sparse group lasso","year":"2017-11-01"}],"summary":{"biotoolsCURIE":"biotools:metabolic_network_sgl","biotoolsID":"metabolic_network_sgl","description":"Linking metabolic network features to phenotypes using sparse group lasso.","homepage":"https://sourceforge.net/p/metabolic-network-sgl/git/ci/master/tree/","name":"Metabolic Network SGL"}}