{
    "additionDate": "2018-05-20T08:30:10Z",
    "biotoolsCURIE": "biotools:cape",
    "biotoolsID": "cape",
    "credit": [
        {
            "email": "Anna.Tyler@jax.org",
            "name": "Anna L. Tyler",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Combine complementary information across multiple related phenotypes to infer directed epistatic interactions between genetic markers. This analysis can be applied to a variety of engineered and natural populations.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://cran.r-project.org/web/packages/cape/cape.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/cape/",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "license": "GPL-3.0",
    "name": "CAPE",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1003270",
            "metadata": {
                "abstract": "Contemporary genetic studies are revealing the genetic complexity of many traits in humans and model organisms. Two hallmarks of this complexity are epistasis, meaning gene-gene interaction, and pleiotropy, in which one gene affects multiple phenotypes. Understanding the genetic architecture of complex traits requires addressing these phenomena, but interpreting the biological significance of epistasis and pleiotropy is often difficult. While epistasis reveals dependencies between genetic variants, it is often unclear how the activity of one variant is specifically modifying the other. Epistasis found in one phenotypic context may disappear in another context, rendering the genetic interaction ambiguous. Pleiotropy can suggest either redundant phenotype measures or gene variants that affect multiple biological processes. Here we present an R package, R/cape, which addresses these interpretation ambiguities by implementing a novel method to generate predictive and interpretable genetic networks that influence quantitative phenotypes. R/cape integrates information from multiple related phenotypes to constrain models of epistasis, thereby enhancing the detection of interactions that simultaneously describe all phenotypes. The networks inferred by R/cape are readily interpretable in terms of directed influences that indicate suppressive and enhancing effects of individual genetic variants on other variants, which in turn account for the variance in quantitative traits. We demonstrate the utility of R/cape by analyzing a mouse backcross, thereby discovering novel epistatic interactions influencing phenotypes related to obesity and diabetes. R/cape is an easy-to-use, platform-independent R package and can be applied to data from both genetic screens and a variety of segregating populations including backcrosses, intercrosses, and natural populations. The package is freely available under the GPL-3 license at http://cran.r-project.org/web/packages/cape. © 2013 Tyler et al.",
                "authors": [
                    {
                        "name": "Tyler A.L."
                    },
                    {
                        "name": "Lu W."
                    },
                    {
                        "name": "Hendrick J.J."
                    },
                    {
                        "name": "Philip V.M."
                    },
                    {
                        "name": "Carter G.W."
                    }
                ],
                "citationCount": 21,
                "date": "2013-10-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "CAPE: An R Package for Combined Analysis of Pleiotropy and Epistasis"
            },
            "pmcid": "PMC3808451",
            "pmid": "24204223"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}