{
    "accessibility": "Open access",
    "additionDate": "2022-10-03T21:54:20.984330Z",
    "biotoolsCURIE": "biotools:ge-impute",
    "biotoolsID": "ge-impute",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "zhouyuanbioinfo@hsc.pku.edu.cn",
            "name": "Yuan Zhou",
            "typeEntity": "Person"
        },
        {
            "name": "Xiaobin Wu",
            "orcidid": "https://orcid.org/0000-0002-1341-411X"
        }
    ],
    "description": "GE-Impute is an imputation method for scRNA-seq data based on graph embeddings.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Simulation analysis",
                    "uri": "http://edamontology.org/operation_0244"
                }
            ]
        }
    ],
    "homepage": "https://github.com/wxbCaterpillar/GE-Impute",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:31:15.572487Z",
    "license": "GPL-2.0",
    "name": "GE-Impute",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/bib/bbac313",
            "metadata": {
                "abstract": "Single-cell RNA-sequencing (scRNA-seq) has been widely used to depict gene expression profiles at the single-cell resolution. However, its relatively high dropout rate often results in artificial zero expressions of genes and therefore compromised reliability of results. To overcome such unwanted sparsity of scRNA-seq data, several imputation algorithms have been developed to recover the single-cell expression profiles. Here, we propose a novel approach, GE-Impute, to impute the dropout zeros in scRNA-seq data with graph embedding-based neural network model. GE-Impute learns the neural graph representation for each cell and reconstructs the cell-cell similarity network accordingly, which enables better imputation of dropout zeros based on the more accurately allocated neighbors in the similarity network. Gene expression correlation analysis between true expression data and simulated dropout data suggests significantly better performance of GE-Impute on recovering dropout zeros for both droplet- and plated-based scRNA-seq data. GE-Impute also outperforms other imputation methods in identifying differentially expressed genes and improving the unsupervised clustering on datasets from various scRNA-seq techniques. Moreover, GE-Impute enhances the identification of marker genes, facilitating the cell type assignment of clusters. In trajectory analysis, GE-Impute improves time-course scRNA-seq data analysis and reconstructing differentiation trajectory. The above results together demonstrate that GE-Impute could be a useful method to recover the single-cell expression profiles, thus enabling better biological interpretation of scRNA-seq data. GE-Impute is implemented in Python and is freely available at https://github.com/wxbCaterpillar/GE-Impute.",
                "authors": [
                    {
                        "name": "Wu X."
                    },
                    {
                        "name": "Zhou Y."
                    }
                ],
                "citationCount": 15,
                "date": "2022-09-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "GE-Impute: Graph embedding-based imputation for single-cell RNA-seq data"
            },
            "pmid": "35901457"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
