{"credit":[{"email":"help-swissmodel@unibas.ch","name":"Protein Structure Bioinformatics Group","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://swissmodel.expasy.org/docs/help"}],"function":[{"input":[{"data":{"term":"Protein sequence (raw)","uri":"http://edamontology.org/data_2974"},"format":[{"term":"FASTA","uri":"http://edamontology.org/format_1929"}]},{"data":{"term":"Protein sequence (raw)","uri":"http://edamontology.org/data_2974"}},{"data":{"term":"UniProt accession","uri":"http://edamontology.org/data_3021"}},{"data":{"term":"UniProt ID","uri":"http://edamontology.org/data_2291"}},{"data":{"term":"Sequence alignment (protein)","uri":"http://edamontology.org/data_1384"},"format":[{"term":"FASTA","uri":"http://edamontology.org/format_1929"}]}],"operation":[{"term":"Protein modelling","uri":"http://edamontology.org/operation_0477"},{"term":"Protein modelling (backbone)","uri":"http://edamontology.org/operation_0479"}],"output":[{"data":{"term":"Protein structure","uri":"http://edamontology.org/data_1460"},"format":[{"term":"mmcif","uri":"http://edamontology.org/format_1477"},{"term":"PDB","uri":"http://edamontology.org/format_1476"}]}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Molecular modelling","uri":"http://edamontology.org/topic_2275"},{"term":"Proteins","uri":"http://edamontology.org/topic_0078"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"},{"term":"Protein structure analysis","uri":"http://edamontology.org/topic_2814"},{"term":"Structure prediction","uri":"http://edamontology.org/topic_0082"}]},"publication":[{"abstract":"The SWISS-MODEL Repository is a database of annotated 3D protein structure models generated by the SWISS-MODEL homology-modelling pipeline. As of September 2005, the repository contained 675,000 models for 604,000 different protein sequences of the UniProt database. Regular updates ensure that the content of the repository reflects the current state of sequence and structure databases, integrating new or modified target sequences, and making use of new template structures. Each Repository entry consists of one or more 3D models accompanied by detailed information about the target protein and the model building process: functional annotation, a detailed template selection log, target-template alignment, summary of the model building and model quality assessment. The SWISS-MODEL Repository is freely accessible at http://swissmodel.expasy.org/repository/.","authors":["Kopp J.","Schwede T."],"cit_count":111,"journal":"Nucleic acids research","pmid":"16381875","title":"The SWISS-MODEL Repository: new features and functionalities.","year":"2006-01-01"},{"abstract":"Knowledge-based molecular modelling of proteins has proven useful in many instances including the rational design of mutagenesis experiments, but it has been generally limited by the availability of expensive computer hardware and software. To overcome these limitations, we have developed the SWISS-MODEL server for automated knowledge-based protein modelling. The SWISS-MODEL server uses the Brookhaven Protein Data Bank as a source of structural information and automatically generates protein models for sequences which share significant similarities with at least one protein of known 3D-structure. We now use the software framework of the server to generate large collections of protein models. To store these models, we have established the SWISS-MODEL Repository, a new database for protein models generated by theoretical approaches. This repository is directly integrated with SWISS-PROT and other databases through the ExPASy World-Wide Web server (URL is http:(/)/www.expasy.ch).","authors":["Peitsch M.C."],"cit_count":24,"journal":"Proceedings / ... International Conference on Intelligent Systems for Molecular Biology ; ISMB. International Conference on Intelligent Systems for Molecular Biology","pmid":"9322042","title":"Large scale protein modelling and model repository.","year":"1997-01-01"},{"abstract":"The SWISS-MODEL Repository is a database of annotated three-dimensional comparative protein structure models generated by the fully automated homology-modelling pipeline SWISS-MODEL. The Repository currently contains about 300 000 three-dimensional models for sequences from the Swiss-Prot and TrEMBL databases. The content of the Repository is updated on a regular basis incorporating new sequences, taking advantage of new template structures becoming available and reflecting improvements in the underlying modelling algorithms. Each entry consists of one or more three-dimensional protein models, the superposed template structures, the alignments on which the models are based, a summary of the modelling process and a force field based quality assessment. The SWISS-MODEL Repository can be queried via an interactive website at http://swissmodel.expasy.org/repository/. Annotation and cross-linking of the models with other databases, e.g. Swiss-Prot on the ExPASy server, allow for seamless navigation between protein sequence and structure information. The aim of the SWISS-MODEL Repository is to provide access to an up-to-date collection of annotated three-dimensional protein models generated by automated homology modelling, bridging the gap between sequence and structure databases.","authors":["Kopp J.","Schwede T."],"cit_count":244,"journal":"Nucleic Acids Research","pmid":"14681401","title":"The SWISS-MODEL repository of annotated three-dimensional protein structure homology models","year":"2004-01-01"},{"abstract":"Motivation: Homology models of proteins are of great interest for planning and analysing biological experiments when no experimental three-dimensional structures are available. Building homology models requires specialized programs and up-to-date sequence and structural databases. Integrating all required tools, programs and databases into a single web-based workspace facilitates access to homology modelling from a computer with web connection without the need of downloading and installing large program packages and databases. Results: SWISS-MODEL workspace is a web-based integrated service dedicated to protein structure homology modelling. It assists and guides the user in building protein homology models at different levels of complexity. A personal working environment is provided for each user where several modelling projects can be carried out in parallel. Protein sequence and structure databases necessary for modelling are accessible from the workspace and are updated in regular intervals. Tools for template selection, model building and structure quality evaluation can be invoked from within the workspace. Workflow and usage of the workspace are illustrated by modelling human Cyclin A1 and human Transmembrane Protease 3. © The Author 2005. Published by Oxford University Press. All rights reserved.","authors":["Arnold K.","Bordoli L.","Kopp J.","Schwede T."],"cit_count":5206,"journal":"Bioinformatics","pmid":"16301204","title":"The SWISS-MODEL workspace: A web-based environment for protein structure homology modelling","year":"2006-01-15"},{"abstract":"Comparative protein modeling is increasingly gaining interest since it is of great assistance during the rational design of mutagenesis experiments. The availability of this method, and the resulting models, has however been restricted by the availability of expensive computer hardware and software. To overcome these limitations, we have developed an environment for comparative protein modeling that consists of SWISS-MODEL, a server for automated comparative protein modeling and of the SWISS-PdbViewer, a sequence to structure workbench. The Swiss-PdbViewer not only acts as a client for SWISS-MODEL, but also provides a-large selection of structure analysis and display tools. In addition, we provide the SWISS-MODEL Repository, a database containing more than 3500 automatically generated protein models. By making such tools freely available to the scientific community, we hope to increase the use of protein structures and models in the process of experiment design.","authors":["Guex N.","Peitsch M.C."],"cit_count":8439,"journal":"Electrophoresis","pmid":"9504803","title":"SWISS-MODEL and the Swiss-PdbViewer: An environment for comparative protein modeling","year":"1997-12-01"},{"abstract":"SWISS-MODEL (http://swissmodel.expasy.org) is a server for automated comparative modeling of three-dimensional (3D) protein structures. It pioneered the field of automated modeling starting in 1993 and is the most widely-used free web-based automated modeling facility today. In 2002 the server computed 120 000 user requests for 3D protein models. SWISS-MODEL provides several levels of user interaction through its World Wide Web interface: in the 'first approach mode' only an amino acid sequence of a protein is submitted to build a 3D model. Template selection, alignment and model building are done completely automated by the server. In the 'alignment mode', the modeling process is based on a user-defined target-template alignment. Complex modeling tasks can be handled with the 'project mode' using DeepView (Swiss-PdbViewer), an integrated sequence-to-structure workbench. All models are sent back via email with a detailed modeling report. WhatCheck analyses and ANOLEA evaluations are provided optionally. The reliability of SWISS-MODEL is continuously evaluated in the EVA-CM project. The SWISS-MODEL server is under constant development to improve the successful implementation of expert knowledge into an easy-to-use server.","authors":["Schwede T.","Kopp J.","Guex N.","Peitsch M.C."],"cit_count":3770,"journal":"Nucleic Acids Research","pmid":"12824332","title":"SWISS-MODEL: An automated protein homology-modeling server","year":"2003-07-01"}],"summary":{"biotoolsCURIE":"biotools:swiss_model","biotoolsID":"swiss_model","description":"SWISS-MODEL is a fully automated protein structure homology-modelling server, accessible via the ExPASy web server, or from the program DeepView (Swiss Pdb-Viewer). The purpose of this server is to make Protein Modelling accessible to all biochemists and molecular biologists worldwide.","homepage":"https://swissmodel.expasy.org/","name":"SWISS-MODEL"}}