
{
    "credit": [
        {
            "email": "pkpanda@immt.res.in",
            "name": "Panda PK",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.immt.res.in/maxmod/team.htm"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://www.immt.res.in/maxmod/doc.htm"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C#"
        ],
        "operatingSystem": [
            "Windows"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Protein structure analysis",
                "uri": "http://edamontology.org/topic_2814"
            },
            {
                "term": "Molecular modelling",
                "uri": "http://edamontology.org/topic_2275"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/maxmod-improved-prediction-of-protein-3d-models.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2015, Springer-Verlag Berlin Heidelberg.Modeling the three-dimensional (3D) structures of proteins assumes great significance because of its manifold applications in biomolecular research. Toward this goal, we present MaxMod, a graphical user interface (GUI) of the MODELLER program that combines profile hidden Markov model (profile HMM) method with Clustal Omega program to significantly improve the selection of homologous templates and target-template alignment for construction of accurate 3D protein models. MaxMod distinguishes itself from other existing GUIs of MODELLER software by implementing effortless modeling of proteins using templates that bear modified residues. Additionally, it provides various features such as loop optimization, express modeling (a feature where protein model can be generated directly from its sequence, without any further user intervention) and automatic update of PDB database, thus enhancing the user-friendly control of computational tasks. We find that HMM-based MaxMod performs better than other modeling packages in terms of execution time and model quality. MaxMod is freely available as a downloadable standalone tool for academic and non-commercial purpose at http://www.immt.res.in/maxmod/.",
            "authors": [
                "Parida B.K.",
                "Panda P.K.",
                "Misra N.",
                "Mishra B.K."
            ],
            "cit_count": 4,
            "journal": "Journal of Molecular Modeling",
            "pmid": "25636267",
            "title": "MaxMod: a hidden Markov model based novel interface to MODELLER for improved prediction of protein 3D models",
            "year": "2015-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:maxmod",
        "biotoolsID": "maxmod",
        "description": "Standalone Graphical User Interface (GUI) of the MODELLER program which combines profile Hidden Markov Model (profile HMM) method with Clustal Omega for the construction of protein homology models.",
        "homepage": "http://www.immt.res.in/maxmod/",
        "name": "MaxMod"
    }
}