{
    "additionDate": "2021-01-18T09:21:54Z",
    "biotoolsCURIE": "biotools:ohdsi",
    "biotoolsID": "ohdsi",
    "confidence_flag": "tool",
    "description": "Observational Health Data Sciences and Informatics (OHDSI) is standardized analytics pipeline for reliable and rapid development and validation of prediction models using observational health data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/OHDSI/",
    "lastUpdate": "2022-01-03T08:51:05.953695Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://ohdsi.github.io/TheBookOfOhdsi/"
        }
    ],
    "name": "Observational Health Data Sciences and Informatics",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/j.cmpb.2021.106394",
            "metadata": {
                "abstract": "© 2021Background and objective: As a response to the ongoing COVID-19 pandemic, several prediction models in the existing literature were rapidly developed, with the aim of providing evidence-based guidance. However, none of these COVID-19 prediction models have been found to be reliable. Models are commonly assessed to have a risk of bias, often due to insufficient reporting, use of non-representative data, and lack of large-scale external validation. In this paper, we present the Observational Health Data Sciences and Informatics (OHDSI) analytics pipeline for patient-level prediction modeling as a standardized approach for rapid yet reliable development and validation of prediction models. We demonstrate how our analytics pipeline and open-source software tools can be used to answer important prediction questions while limiting potential causes of bias (e.g., by validating phenotypes, specifying the target population, performing large-scale external validation, and publicly providing all analytical source code). Methods: We show step-by-step how to implement the analytics pipeline for the question: ‘In patients hospitalized with COVID-19, what is the risk of death 0 to 30 days after hospitalization?’. We develop models using six different machine learning methods in a USA claims database containing over 20,000 COVID-19 hospitalizations and externally validate the models using data containing over 45,000 COVID-19 hospitalizations from South Korea, Spain, and the USA. Results: Our open-source software tools enabled us to efficiently go end-to-end from problem design to reliable Model Development and evaluation. When predicting death in patients hospitalized with COVID-19, AdaBoost, random forest, gradient boosting machine, and decision tree yielded similar or lower internal and external validation discrimination performance compared to L1-regularized logistic regression, whereas the MLP neural network consistently resulted in lower discrimination. L1-regularized logistic regression models were well calibrated. Conclusion: Our results show that following the OHDSI analytics pipeline for patient-level prediction modelling can enable the rapid development towards reliable prediction models. The OHDSI software tools and pipeline are open source and available to researchers from all around the world.",
                "authors": [
                    {
                        "name": "Khalid S."
                    },
                    {
                        "name": "Yang C."
                    },
                    {
                        "name": "Blacketer C."
                    },
                    {
                        "name": "Duarte-Salles T."
                    },
                    {
                        "name": "Fernandez-Bertolin S."
                    },
                    {
                        "name": "Kim C."
                    },
                    {
                        "name": "Park R.W."
                    },
                    {
                        "name": "Park J."
                    },
                    {
                        "name": "Schuemie M.J."
                    },
                    {
                        "name": "Sena A.G."
                    },
                    {
                        "name": "Suchard M.A."
                    },
                    {
                        "name": "You S.C."
                    },
                    {
                        "name": "Rijnbeek P.R."
                    },
                    {
                        "name": "Reps J.M."
                    }
                ],
                "date": "2021-11-01T00:00:00Z",
                "journal": "Computer Methods and Programs in Biomedicine",
                "title": "A standardized analytics pipeline for reliable and rapid development and validation of prediction models using observational health data"
            },
            "pmcid": "PMC8420135",
            "pmid": "34560604",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        }
    ]
}