{
    "additionDate": "2020-01-09T17:39:58Z",
    "biotoolsCURIE": "biotools:ChlamDB",
    "biotoolsID": "ChlamDB",
    "confidence_flag": "tool",
    "description": "A comparative genomics database of the phylum Chlamydiae and other members of the Planctomycetes-Verrucomicrobiae-Chlamydiae superphylum.\n\nChlamDB documentation — ChlamDB 2.0 (June 2019) documentation.\n\nA comparative genomics database of the phylum Chlamydiae and other PVC (Planctomycetes, Verrucomicrobia, Lentisphaerae).\n\nProblems and errors encountered on the ChlamDB website can be announced on the github page of the website",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://www.chlamdb.ch/docs/index.html"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                }
            ]
        }
    ],
    "homepage": "https://chlamdb.ch/",
    "language": [
        "JavaScript",
        "Python"
    ],
    "lastUpdate": "2020-12-11T20:12:02Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/metagenlab/chlamdb"
        }
    ],
    "name": "ChlamDB",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/NAR/GKZ924",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press on behalf of Nucleic Acids Research.ChlamDB is a comparative genomics database containing 277 genomes covering the entire Chlamydiae phylum as well as their closest relatives belonging to the Planctomycetes-Verrucomicrobiae-Chlamydiae (PVC) superphylum. Genomes can be compared, analyzed and retrieved using accessions numbers of the most widely used databases including COG, KEGG ortholog, KEGG pathway, KEGG module, Pfam and InterPro. Gene annotations from multiple databases including UniProt (curated and automated protein annotations), KEGG (annotation of pathways), COG (orthology), TCDB (transporters), STRING (protein-protein interactions) and InterPro (domains and signatures) can be accessed in a comprehensive overview page. Candidate effectors of the Type III secretion system (T3SS) were identified using four in silico methods. The identification of orthologs among all PVC genomes allows users to perform large-scale comparative analyses and to identify orthologs of any protein in all genomes integrated in the database. Phylogenetic relationships of PVC proteins and their closest homologs in RefSeq, comparison of transmembrane domains and Pfam domains, conservation of gene neighborhood and taxonomic profiles can be visualized using dynamically generated graphs, available for download. As a central resource for researchers working on chlamydia, chlamydia-related bacteria, verrucomicrobia and planctomyces, ChlamDB facilitates the access to comprehensive annotations, integrates multiple tools for comparative genomic analyses and is freely available at https://chlamdb.ch/. Database URL: https://chlamdb.ch/",
                "authors": [
                    {
                        "name": "Bertelli C."
                    },
                    {
                        "name": "Greub G."
                    },
                    {
                        "name": "Pillonel T."
                    },
                    {
                        "name": "Tagini F."
                    }
                ],
                "citationCount": 5,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "ChlamDB: A comparative genomics database of the phylum Chlamydiae and other members of the Planctomycetes-Verrucomicrobiae-Chlamydiae superphylum"
            },
            "pmcid": "PMC7145651",
            "pmid": "31665454"
        }
    ],
    "topic": [
        {
            "term": "Comparative genomics",
            "uri": "http://edamontology.org/topic_0797"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        }
    ],
    "validated": 1
}
