{"credit":[],"function":[{"operation":[{"term":"Regulatory element prediction","uri":"http://edamontology.org/operation_0438"},{"term":"Transcription factor binding site prediction","uri":"http://edamontology.org/operation_0445"},{"term":"Protein binding site prediction","uri":"http://edamontology.org/operation_2575"},{"term":"cis-regulatory element prediction","uri":"http://edamontology.org/operation_0441"},{"term":"Transcriptional regulatory element prediction","uri":"http://edamontology.org/operation_0438"}]}],"labels":{"toolType":["Web application"],"topic":[{"term":"Transcription factors and regulatory sites","uri":"http://edamontology.org/topic_0749"},{"term":"Nucleic acid sites, features and motifs","uri":"http://edamontology.org/topic_3511"},{"term":"Protein binding sites","uri":"http://edamontology.org/topic_3534"},{"term":"DNA binding sites","uri":"http://edamontology.org/topic_3125"},{"term":"Sequence sites, features and motifs","uri":"http://edamontology.org/topic_0160"}]},"publication":[{"abstract":"Gene regulatory circuits are often commonly shared between two closely related organisms. Our web tool iCR (identify Conserved target of a Regulon) makes use of this fact and identify conserved targets of a regulatory protein. iCR is a special refined extension of our previous tool PredictRegulon- that predicts genome wide, the potential binding sites and target operons of a regulatory protein in a single user selected genome. Like PredictRegulon, the iCR accepts known binding sites of a regulatory protein as ungapped multiple sequence alignment and provides the potential binding sites. However important differences are that the user can select more than one genome at a time and the output reports the genes that are common in two or more species. In order to achieve this, iCR makes use of Cluster of Orthologous Group (COG) indices for the genes. This tool analyses the upstream region of all user-selected prokaryote genome and gives the output based on conservation target orthologs. iCR also reports the Functional class codes based on COG classification for theencodedproteins ofdownstream genes which helps user understand the nature of the co-regulated genes at the result page itself. iCR is freely accessible at http://www.cdfd.org.in/icr/. © The Author 2006. Published by Oxford University Press. All rights reserved.","authors":["Ranjan S.","Seshadri J.","Vindal V.","Yellaboina S.","Ranjan A."],"cit_count":5,"journal":"Nucleic Acids Research","pmid":"16845075","title":"iCR: A web tool to identify conserved targets of a regulatory protein across the multiple related prokaryotic species","year":"2006-07-01"},{"abstract":"An interactive web server is developed for predicting the potential binding sites and its target operons for a given regulatory protein in prokaryotic genomes. The program allows users to submit known or experimentally determined binding sites of a regulatory protein as ungapped multiple sequence alignments. It analyses the upstream regions of all genes in a user-selected prokaryote genome and returns the potential binding sites along with the downstream co-regulated genes (operons). The known binding sites of a regulatory protein can also be used to identify its orthologue binding sites in phylogeneticaly related genomes where the trans-acting regulator protein and cognate cis-acting DNA sequences could be conserved. PredictRegulon can be freely accessed from a link on our world wide web server: http://www.cdfd.org.in/predictregulon/. © Oxford University Press 2004; all rights reserved.","authors":["Yellaboina S.","Seshadri J.","Kumar M.S.","Ranjan A."],"cit_count":37,"journal":"Nucleic Acids Research","pmid":"15215402","title":"PredictRegulon: A web server for the prediction of the regulatory protein in binding sites and operons in prokaryote genomes","year":"2004-07-01"}],"summary":{"biotoolsCURIE":"biotools:icr","biotoolsID":"icr","description":"Predict regulatory binding sites based on conservation across multiple species. The user provides an ungapped multiple sequence alignment representing the regulatory binding site. It reports back with predicted binding sites that are conserved and highlights the downstream co-regulated genes.","homepage":"http://210.212.215.199/icr/index.html","name":"iCR"}}