{
    "additionDate": "2020-01-09T17:49:26Z",
    "biotoolsCURIE": "biotools:SCSsim",
    "biotoolsID": "SCSsim",
    "confidence_flag": "tool",
    "description": "SCSsim is a tool designed for emulating single-cell genome sequencing data. It consists of three modules: 1) “simuVars” module aims to generate single cell genome from a given reference sequence by inserting user-defined genomic variations into genomic loci; 2) “learnProfile” component is developed to infer sequencing platform dependent profiles from real data; 3) “genReads” utility is provided to mimic single-cell genome amplification and read generation procedures based on the results of “simuVars” and “learnProfile”.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                },
                {
                    "term": "Sequence profile generation",
                    "uri": "http://edamontology.org/operation_0296"
                }
            ]
        }
    ],
    "homepage": "https://github.com/qasimyu/scssim",
    "language": [
        "C++"
    ],
    "lastUpdate": "2021-01-16T13:10:00Z",
    "license": "BSD-3-Clause",
    "name": "SCSsim",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ713",
            "metadata": {
                "abstract": "© 2020 Oxford University Press. All rights reserved.Motivation: Allele dropout (ADO) and unbalanced amplification of alleles are main technical issues of single-cell sequencing (SCS), and effectively emulating these issues is necessary for reliably benchmarking SCS-based bioinformatics tools. Unfortunately, currently available sequencing simulators are free of whole-genome amplification involved in SCS technique and therefore not suited for generating SCS datasets. We develop a new software package (SCSsim) that can efficiently simulate SCS datasets in a parallel fashion with minimal user intervention. SCSsim first constructs the genome sequence of single cell by mimicking a complement of genomic variations under user-controlled manner, and then amplifies the genome according to MALBAC technique and finally yields sequencing reads from the amplified products based on inferred sequencing profiles. Comprehensive evaluation in simulating different ADO rates, variation detection efficiency and genome coverage demonstrates that SCSsim is a very useful tool in mimicking single-cell sequencing data with high efficiency.",
                "authors": [
                    {
                        "name": "Du F."
                    },
                    {
                        "name": "Li A."
                    },
                    {
                        "name": "Sun X."
                    },
                    {
                        "name": "Yu Z."
                    }
                ],
                "citationCount": 3,
                "date": "2020-02-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "SCSsim: An integrated tool for simulating single-cell genome sequencing data"
            },
            "pmid": "31584615"
        }
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
