{
    "additionDate": "2020-01-09T17:56:03Z",
    "biotoolsCURIE": "biotools:HippMapp3r",
    "biotoolsID": "HippMapp3r",
    "confidence_flag": "tool",
    "description": "Hippocampal segmentation for brains with extensive atrophy using three-dimensional convolutional neural networks.\n\nWelcome to HippMapp3r’s documentation! — HippMapp3r documentation.\n\nFree document hosting provided by Read the Docs",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://hippmapp3r.readthedocs.io",
    "lastUpdate": "2020-12-10T08:36:08Z",
    "name": "HippMapp3r",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/HBM.24811",
            "metadata": {
                "abstract": "© 2019 The Authors. Human Brain Mapping published by Wiley Periodicals, Inc.Hippocampal volumetry is a critical biomarker of aging and dementia, and it is widely used as a predictor of cognitive performance; however, automated hippocampal segmentation methods are limited because the algorithms are (a) not publicly available, (b) subject to error with significant brain atrophy, cerebrovascular disease and lesions, and/or (c) computationally expensive or require parameter tuning. In this study, we trained a 3D convolutional neural network using 259 bilateral manually delineated segmentations collected from three studies, acquired at multiple sites on different scanners with variable protocols. Our training dataset consisted of elderly cases difficult to segment due to extensive atrophy, vascular disease, and lesions. Our algorithm, (HippMapp3r), was validated against four other publicly available state-of-the-art techniques (HippoDeep, FreeSurfer, SBHV, volBrain, and FIRST). HippMapp3r outperformed the other techniques on all three metrics, generating an average Dice of 0.89 and a correlation coefficient of 0.95. It was two orders of magnitude faster than some of the tested techniques. Further validation was performed on 200 subjects from two other disease populations (frontotemporal dementia and vascular cognitive impairment), highlighting our method's low outlier rate. We finally tested the methods on real and simulated “clinical adversarial” cases to study their robustness to corrupt, low-quality scans. The pipeline and models are available at: https://hippmapp3r.readthedocs.ioto facilitate the study of the hippocampus in large multisite studies.",
                "authors": [
                    {
                        "name": "Goubran M."
                    },
                    {
                        "name": "Ntiri E.E."
                    },
                    {
                        "name": "Akhavein H."
                    },
                    {
                        "name": "Holmes M."
                    },
                    {
                        "name": "Nestor S."
                    },
                    {
                        "name": "Ramirez J."
                    },
                    {
                        "name": "Adamo S."
                    },
                    {
                        "name": "Ozzoude M."
                    },
                    {
                        "name": "Scott C."
                    },
                    {
                        "name": "Gao F."
                    },
                    {
                        "name": "Martel A."
                    },
                    {
                        "name": "Swardfager W."
                    },
                    {
                        "name": "Masellis M."
                    },
                    {
                        "name": "Swartz R."
                    },
                    {
                        "name": "MacIntosh B."
                    },
                    {
                        "name": "Black S.E."
                    }
                ],
                "citationCount": 6,
                "date": "2020-02-01T00:00:00Z",
                "journal": "Human Brain Mapping",
                "title": "Hippocampal segmentation for brains with extensive atrophy using three-dimensional convolutional neural networks"
            },
            "pmid": "31609046"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        }
    ],
    "validated": 1
}