{
    "additionDate": "2021-01-18T11:57:54Z",
    "biotoolsCURIE": "biotools:pathsupcre8",
    "biotoolsID": "pathsupcre8",
    "confidence_flag": "tool",
    "description": "A Tool That Facilitates the Searching for Heterologous Biosynthetic Routes.\n\nPATHcre8 is an open-access online tool for heterologous biosynthesis pathway search. Given the starting compound, the target product, and the heterologous host, PATHcre8 explores biosynthesis routes and ranks them.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic pathway prediction",
                    "uri": "http://edamontology.org/operation_3929"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                }
            ]
        }
    ],
    "homepage": "https://www.cbrc.kaust.edu.sa/pathcre8/",
    "lastUpdate": "2021-01-22T18:23:35Z",
    "name": "PATHsupcre8",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1021/ACSSYNBIO.0C00058",
            "metadata": {
                "abstract": "© 2020 American Chemical Society.Developing computational tools that can facilitate the rational design of cell factories producing desired products at increased yields is challenging, as the tool needs to take into account that the preferred host organism usually has compounds that are consumed by competing reactions that reduce the yield of the desired product. On the other hand, the preferred host organisms may not have the native metabolic reactions needed to produce the compound of interest; thus, the computational tool needs to identify the metabolic reactions that will most efficiently produce the desired product. In this regard, we developed the generic tool PATHcre8 to facilitate an optimized search for heterologous biosynthetic pathway routes. PATHcre8 finds and ranks biosynthesis routes in a large number of organisms, including Cyanobacteria. The tool ranks the pathways based on feature scores that reflect reaction thermodynamics, the potentially toxic products in the pathway (compound toxicity), intermediate products in the pathway consumed by competing reactions (product consumption), and host-specific information such as enzyme copy number. A comparison with several other similar tools shows that PATHcre8 is more efficient in ranking functional pathways. To illustrate the effectiveness of PATHcre8, we further provide case studies focused on isoprene production and the biodegradation of cocaine. PATHcre8 is free for academic and nonprofit users and can be accessed at https://www.cbrc.kaust.edu.sa/pathcre8/.",
                "authors": [
                    {
                        "name": "Motwalli O."
                    },
                    {
                        "name": "Uludag M."
                    },
                    {
                        "name": "Mijakovic I."
                    },
                    {
                        "name": "Alazmi M."
                    },
                    {
                        "name": "Bajic V.B."
                    },
                    {
                        "name": "Gojobori T."
                    },
                    {
                        "name": "Gao X."
                    },
                    {
                        "name": "Essack M."
                    }
                ],
                "date": "2020-12-18T00:00:00Z",
                "journal": "ACS Synthetic Biology",
                "title": "PATHcre8: A Tool That Facilitates the Searching for Heterologous Biosynthetic Routes"
            },
            "pmid": "33198455"
        }
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        }
    ],
    "validated": 1
}