{
    "additionDate": "2021-10-04T10:07:48.031293Z",
    "biotoolsCURIE": "biotools:kmerator",
    "biotoolsID": "kmerator",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "therese.commes@inserm.fr",
            "name": "Thérèse Commes",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Kmerator is a prototype tool designed for the prediction of specific k-mers (also called tags) from input sequences, considering a reference genome and an ENSEMBL-like transcriptome. From these specific k-mers, it also outputs their corresponding specific contigs which are sequences of consecutive k-mers (overlapping length between k-mers must be k-1, otherwise, it's a new contig). Kmerator first uses Jellyfish to create 2 requestable indexes from the reference genome and transcriptome, and second, decomposes your input transcript or gene sequences to count the occurences of each k-mer in the genome and transcriptome.",
    "editPermission": {
        "authors": [
            "boureux"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Chimera detection",
                    "uri": "http://edamontology.org/operation_0450"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "RNA-Seq quantification",
                    "uri": "http://edamontology.org/operation_3800"
                },
                {
                    "term": "k-mer counting",
                    "uri": "http://edamontology.org/operation_3472"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Transipedia/kmerator",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-06-24T09:50:05.591467Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/Transipedia/kmerator/issues"
        }
    ],
    "maturity": "Emerging",
    "name": "Kmerator",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/nargab/lqab058",
            "metadata": {
                "abstract": "© 2021 The Author(s). Published by Oxford University Press on behalf of NAR Genomics and Bioinformatics.The huge body of publicly available RNA-sequencing (RNA-seq) libraries is a treasure of functional information allowing to quantify the expression of known or novel transcripts in tissues. However, transcript quantification commonly relies on alignment methods requiring a lot of computational resources and processing time, which does not scale easily to large datasets. K-mer decomposition constitutes a new way to process RNA-seq data for the identification of transcriptional signatures, as k-mers can be used to quantify accurately gene expression in a less resource-consuming way. We present the Kmerator Suite, a set of three tools designed to extract specific k-mer signatures, quantify these k-mers into RNA-seq datasets and quickly visualize large dataset characteristics. The core tool, Kmerator, produces specific k-mers for 97% of human genes, enabling the measure of gene expression with high accuracy in simulated datasets. KmerExploR, a direct application of Kmerator, uses a set of predictor gene-specific k-mers to infer metadata including library protocol, sample features or contaminations from RNA-seq datasets. KmerExploR results are visualized through a user-friendly interface. Moreover, we demonstrate that the Kmerator Suite can be used for advanced queries targeting known or new biomarkers such as mutations, gene fusions or long non-coding RNAs for human health applications.",
                "authors": [
                    {
                        "name": "Audoux J."
                    },
                    {
                        "name": "Bessiere C."
                    },
                    {
                        "name": "Bouge A.-L."
                    },
                    {
                        "name": "Boureux A."
                    },
                    {
                        "name": "Commes T."
                    },
                    {
                        "name": "Gautheret D."
                    },
                    {
                        "name": "Gilbert N."
                    },
                    {
                        "name": "Guibert B."
                    },
                    {
                        "name": "Riquier S."
                    },
                    {
                        "name": "Ruffle F."
                    },
                    {
                        "name": "Xue H."
                    }
                ],
                "date": "2021-09-01T00:00:00Z",
                "journal": "NAR Genomics and Bioinformatics",
                "title": "Kmerator Suite: Design of specific k-mer signatures and automatic metadata discovery in large RNA-seq datasets"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "version": [
        "0.5.2"
    ]
}
