{"credit":[{"email":"ke.jin@utoronto.ca","name":"Ke Jin","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://phenom.ccbr.utoronto.ca/help.jsp"}],"function":[{"operation":[{"term":"Data retrieval","uri":"http://edamontology.org/operation_2422"},{"term":"Gene expression profiling","uri":"http://edamontology.org/operation_0314"},{"term":"Gene expression QTL analysis","uri":"http://edamontology.org/operation_3232"},{"term":"Gene expression analysis","uri":"http://edamontology.org/operation_2495"},{"term":"Gene-set enrichment analysis","uri":"http://edamontology.org/operation_2436"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Database portal"],"topic":[{"term":"Phenomics","uri":"http://edamontology.org/topic_3298"},{"term":"Genotype and phenotype","uri":"http://edamontology.org/topic_0625"},{"term":"Imaging","uri":"http://edamontology.org/topic_3382"},{"term":"Genetic variation","uri":"http://edamontology.org/topic_0199"}]},"publication":[{"abstract":"About one-fifth of the genes in the budding yeast are essential for haploid viability and cannot be functionally assessed using standard genetic approaches such as gene deletion. To facilitate genetic analysis of essential genes, we and others have assembled collections of yeast strains expressing temperature-sensitive (ts) alleles of essential genes. To explore the phenotypes caused by essential gene mutation we used a panel of genetically engineered fluorescent markers to explore the morphology of cells in the ts strain collection using high-throughput microscopy. Here, we describe the design and implementation of an online database, PhenoM (Phenomics of yeast Mutants), for storing, retrieving, visualizing and data mining the quantitative single-cell measurements extracted from micrographs of the ts mutant cells. PhenoM allows users to rapidly search and retrieve raw images and their quantified morphological data for genes of interest. The database also provides several data-mining tools, including a PhenoBlast module for phenotypic comparison between mutant strains and a Gene Ontology module for functional enrichment analysis of gene sets showing similar morphological alterations. The current PhenoM version 1.0 contains 78 194 morphological images and 1 909 914 cells covering six subcellular compartments or structures for 775 ts alleles spanning 491 essential genes. PhenoM is freely available at http://phenom.ccbr.utoronto. ca/. © The Author(s) 2011.","authors":["Jin K.","Li J.","Vizeacoumar F.S.","Li Z.","Min R.","Zamparo L.","Vizeacoumar F.J.","Datti A.","Andrews B.","Boone C.","Zhang Z."],"cit_count":9,"journal":"Nucleic Acids Research","pmid":"22009677","title":"PhenoM: A database of morphological phenotypes caused by mutation of essential genes in Saccharomyces cerevisiae","year":"2012-01-01"}],"summary":{"biotoolsCURIE":"biotools:phenom","biotoolsID":"phenom","description":"Phenomics of yeast Mutants (PhenoM): contains quantitative measurements of 1,909,914 cells and 78,194 morphological images for 775 temperature-sensitive mutants spanning 491 different essential genes in permissive temperature (26 C) and restrictive temperature (32 C).","homepage":"http://phenom.ccbr.utoronto.ca/","name":"PhenoM"}}