{
    "additionDate": "2021-01-18T10:06:12Z",
    "biotoolsCURIE": "biotools:vaecox",
    "biotoolsID": "vaecox",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "kangj@korea.ac.kr",
            "name": "Jaewoo Kang",
            "orcidid": "https://orcid.org/0000-0001-6798-9106",
            "typeEntity": "Person"
        }
    ],
    "description": "Improved survival analysis by learning shared genomic information from pan-cancer data.\n\nRecent advances in deep learning have offered solutions to many biomedical tasks. However, there remains a challenge in applying deep learning to survival analysis using human cancer transcriptome data. Since the number of genes, the input variables of survival model, is larger than the amount of available cancer patient samples, deep learning models are prone to overfitting. To address the issue, we introduce a new deep learning architecture called VAECox. VAECox employs transfer learning and fine tuning.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/dmis-lab/VAECox",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-10T13:51:09Z",
    "name": "VAECox",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA462",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press.Motivation: Recent advances in deep learning have offered solutions to many biomedical tasks. However, there remains a challenge in applying deep learning to survival analysis using human cancer transcriptome data. As the number of genes, the input variables of survival model, is larger than the amount of available cancer patient samples, deep-learning models are prone to overfitting. To address the issue, we introduce a new deep-learning architecture called VAECox. VAECox uses transfer learning and fine tuning. Results: We pre-trained a variational autoencoder on all RNA-seq data in 20 TCGA datasets and transferred the trained weights to our survival prediction model. Then we fine-tuned the transferred weights during training the survival model on each dataset. Results show that our model outperformed other previous models such as Cox Proportional Hazard with LASSO and ridge penalty and Cox-nnet on the 7 of 10 TCGA datasets in terms of C-index. The results signify that the transferred information obtained from entire cancer transcriptome data helped our survival prediction model reduce overfitting and show robust performance in unseen cancer patient samples.",
                "authors": [
                    {
                        "name": "Choe J."
                    },
                    {
                        "name": "Kang J."
                    },
                    {
                        "name": "Kim K."
                    },
                    {
                        "name": "Kim S."
                    },
                    {
                        "name": "Lee I."
                    }
                ],
                "citationCount": 2,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Improved survival analysis by learning shared genomic information from pan-cancer data"
            },
            "pmcid": "PMC7355236",
            "pmid": "32657401"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
