{
    "additionDate": "2021-03-19T09:08:01Z",
    "biotoolsCURIE": "biotools:bow-gbdt",
    "biotoolsID": "bow-gbdt",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jdzxiaoxuan@163.com",
            "name": "Xuan Xiao",
            "typeEntity": "Person"
        },
        {
            "email": "qiuone@163.com",
            "name": "Wangren Qiu",
            "typeEntity": "Person"
        }
    ],
    "description": "BOW-GBDT is a GBDT classifier combining with artificial neural network for identifying GPCR–Drug Interaction based on Wordbook Learning from sequences.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                },
                {
                    "term": "Transmembrane protein prediction",
                    "uri": "http://edamontology.org/operation_0269"
                }
            ]
        }
    ],
    "homepage": "http://www.jci-bioinfo.cn/bowgbdt",
    "lastUpdate": "2021-03-21T10:34:56Z",
    "name": "BOW-GBDT",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3389/FCELL.2020.623858",
            "metadata": {
                "abstract": "© Copyright © 2021 Qiu, Lv, Hong, Jia and Xiao.Background: As a class of membrane protein receptors, G protein-coupled receptors (GPCRs) are very important for cells to complete normal life function and have been proven to be a major drug target for widespread clinical application. Hence, it is of great significance to find GPCR targets that interact with drugs in the process of drug development. However, identifying the interaction of the GPCR–drug pairs by experimental methods is very expensive and time-consuming on a large scale. As more and more database about GPCR–drug pairs are opened, it is viable to develop machine learning models to accurately predict whether there is an interaction existing in a GPCR–drug pair. Methods: In this paper, the proposed model aims to improve the accuracy of predicting the interactions of GPCR–drug pairs. For GPCRs, the work extracts protein sequence features based on a novel bag-of-words (BOW) model improved with weighted Silhouette Coefficient and has been confirmed that it can extract more pattern information and limit the dimension of feature. For drug molecules, discrete wavelet transform (DWT) is used to extract features from the original molecular fingerprints. Subsequently, the above-mentioned two types of features are contacted, and SMOTE algorithm is selected to balance the training dataset. Then, artificial neural network is used to extract features further. Finally, a gradient boosting decision tree (GBDT) model is trained with the selected features. In this paper, the proposed model is named as BOW-GBDT. Results: D92M and Check390 are selected for testing BOW-GBDT. D92M is used for a cross-validation dataset which contains 635 interactive GPCR–drug pairs and 1,225 non-interactive pairs. Check390 is used for an independent test dataset which consists of 130 interactive GPCR–drug pairs and 260 non-interactive GPCR–drug pairs, and each element in Check390 cannot be found in D92M. According to the results, the proposed model has a better performance in generation ability compared with the existing machine learning models. Conclusion: The proposed predictor improves the accuracy of the interactions of GPCR–drug pairs. In order to facilitate more researchers to use the BOW-GBDT, the predictor has been settled into a brand-new server, which is available at http://www.jci-bioinfo.cn/bowgbdt.",
                "authors": [
                    {
                        "name": "Hong Y."
                    },
                    {
                        "name": "Jia J."
                    },
                    {
                        "name": "Lv Z."
                    },
                    {
                        "name": "Qiu W."
                    },
                    {
                        "name": "Xiao X."
                    }
                ],
                "date": "2021-02-01T00:00:00Z",
                "journal": "Frontiers in Cell and Developmental Biology",
                "title": "BOW-GBDT: A GBDT Classifier Combining With Artificial Neural Network for Identifying GPCR–Drug Interaction Based on Wordbook Learning From Sequences"
            },
            "pmcid": "PMC7882597",
            "pmid": "33598456"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Membrane and lipoproteins",
            "uri": "http://edamontology.org/topic_0820"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
