{
    "additionDate": "2020-01-14T19:56:31Z",
    "biotoolsCURIE": "biotools:OncoLnc",
    "biotoolsID": "OncoLnc",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "m13657094265@163.com",
            "name": "Ju Guo",
            "orcidid": "https://orcid.org/0000-0002-3413-2234",
            "typeEntity": "Person"
        }
    ],
    "description": "Bioinformatics Analysis Identified Key Molecular Changes in Bladder Cancer Development and Recurrence.\n\nHere you can link TCGA survival data to mRNA, miRNA, or lncRNA expression levels. To get started simply input either a Tier 3 TCGA mRNA, miRNA, or MiTranscriptome beta lncRNA. More information can be found at this publication, youtube, or Omnes Res. News.\n\nA pan-cancer analysis using data in OncoLnc: OncoRank.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "http://www.oncolnc.org/",
    "lastUpdate": "2021-01-04T13:34:00Z",
    "name": "OncoLnc",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1155/2019/3917982",
            "metadata": {
                "abstract": "© 2019 Qingke Chen et al.Background and Objectives: Bladder cancer (BC) is a complex tumor associated with high recurrence and mortality. To discover key molecular changes in BC, we analyzed next-generation sequencing data of BC and surrounding tissue samples from clinical specimens. Methods. Gene expression profiling datasets of bladder cancer were analyzed online. The Database for Annotation, Visualization, and Integrated Discovery (DAVID, https://david.ncifcrf.gov/) was used to perform Gene Ontology (GO) functional and KEGG pathway enrichment analyses. Molecular Complex Detection (MCODE) in Cytoscape software (Cytoscape_v3.6.1) was applied to identify hub genes. Protein expression and survival data were downloaded from OncoLnc (http://www.oncolnc.org/). Gene expression data were obtained from the ONCOMINE website (https://www.oncomine.org/). Results. We identified 4211 differentially expressed genes (DEGs) by analysis of surrounding tissue vs. cancer tissue (SC analysis) and 410 DEGs by analysis of cancer tissue vs. recurrent tissue cluster (CR analysis). GO function analysis revealed enrichment of DEGs in genes related to the cytoplasm and nucleoplasm for both clusters, and KEGG pathway analysis showed enrichment of DEGs in the PI3K-Akt signaling pathway. We defined the 20 genes with the highest degree of connectivity as the hub genes. Cox regression revealed CCNB1, ESPL1, CENPM, BLM, and ASPM were related to overall survival. The expression levels of CCNB1, ESPL1, CENPM, BLM, and ASPM were 4.795-, 5.028-, 8.691-, 2.083-, and 3.725-fold higher in BC than the levels in normal tissues, respectively. Conclusions. The results suggested that the functions of CCNB1, ESPL1, CENPM, BLM, and ASPM may contribute to BC development and the functions of CCNB1, ESPL1, CENPM, and BLM may also contribute to BC recurrence.",
                "authors": [
                    {
                        "name": "Chen Q."
                    },
                    {
                        "name": "Deng J."
                    },
                    {
                        "name": "Fu B."
                    },
                    {
                        "name": "Guo J."
                    },
                    {
                        "name": "Hu J."
                    }
                ],
                "citationCount": 3,
                "date": "2019-01-01T00:00:00Z",
                "journal": "BioMed Research International",
                "title": "Bioinformatics Analysis Identified Key Molecular Changes in Bladder Cancer Development and Recurrence"
            },
            "pmcid": "PMC6881748",
            "pmid": "31828101"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ],
    "validated": 1
}
