{
    "additionDate": "2017-08-03T18:46:30Z",
    "biotoolsCURIE": "biotools:hiview",
    "biotoolsID": "hiview",
    "credit": [
        {
            "name": "Li Group",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.unc.edu/~yunmli/index.html"
        }
    ],
    "description": "First integrative genome browser to leverage Hi-C results for the interpretation of GWAS variants. It is able to display Hi-C data and statistical evidence for chromatin interactions in genomic regions surrounding any given GWAS variant, enabling straightforward visualization and interpretation.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.unc.edu/~yunmli/HiView/view/FAQHiView1.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome visualisation",
                    "uri": "http://edamontology.org/operation_3208"
                }
            ]
        }
    ],
    "homepage": "http://www.unc.edu/~yunmli/HiView/",
    "homepage_status": 2,
    "lastUpdate": "2018-12-10T12:58:43Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/hiview-gwas-variant-centred-hi-c-visualization-tool.html"
        }
    ],
    "name": "HiView",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2016 Xu et al. Background: Genome-wide association studies (GWAS) have identified thousands of genetic variants associated with complex traits and diseases. However, most of them are located in the non-protein coding regions, and therefore it is challenging to hypothesize the functions of these non-coding GWAS variants. Recent large efforts such as the ENCODE and Roadmap Epigenomics projects have predicted a large number of regulatory elements. However, the target genes of these regulatory elements remain largely unknown. Chromatin conformation capture based technologies such as Hi-C can directly measure the chromatin interactions and have generated an increasingly comprehensive catalog of the interactome between the distal regulatory elements and their potential target genes. Leveraging such information revealed by Hi-C holds the promise of elucidating the functions of genetic variants in human diseases. Results: In this work, we present HiView, the first integrative genome browser to leverage Hi-C results for the interpretation of GWAS variants. HiView is able to display Hi-C data and statistical evidence for chromatin interactions in genomic regions surrounding any given GWAS variant, enabling straightforward visualization and interpretation. Conclusions: We believe that as the first GWAS variants-centered Hi-C genome browser, HiView is a useful tool guiding post-GWAS functional genomics studies. HiView is freely accessible at: http://www.unc.edu/∼yunmli/HiView.",
                "authors": [
                    {
                        "name": "Xu Z."
                    },
                    {
                        "name": "Zhang G."
                    },
                    {
                        "name": "Duan Q."
                    },
                    {
                        "name": "Chai S."
                    },
                    {
                        "name": "Zhang B."
                    },
                    {
                        "name": "Wu C."
                    },
                    {
                        "name": "Jin F."
                    },
                    {
                        "name": "Yue F."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Hu M."
                    }
                ],
                "citationCount": 7,
                "date": "2016-03-11T00:00:00Z",
                "journal": "BMC Research Notes",
                "title": "HiView: An integrative genome browser to leverage Hi-C results for the interpretation of GWAS variants"
            },
            "pmid": "26969411"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        }
    ],
    "validated": 1
}