
{
    "credit": [
        {
            "name": "Luca Clementi",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://sourceforge.net/u/lclement/profile/"
        },
        {
            "name": "Sriram Krishnan",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://sourceforge.net/u/srikrish/profile/"
        },
        {
            "name": "Wilfred Li",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://sourceforge.net/u/wilfredli/profile/"
        },
        {
            "name": "Nadya Williams",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://sourceforge.net/u/nadyawilliams/profile/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Service discovery",
                    "uri": "http://edamontology.org/operation_3761"
                },
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Service management",
                    "uri": "http://edamontology.org/operation_3760"
                },
                {
                    "term": "Service composition",
                    "uri": "http://edamontology.org/operation_3762"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Medicine",
                "uri": "http://edamontology.org/topic_3303"
            },
            {
                "term": "Medical informatics",
                "uri": "http://edamontology.org/topic_3063"
            },
            {
                "term": "Literature and language",
                "uri": "http://edamontology.org/topic_3068"
            },
            {
                "term": "Biomedical science",
                "uri": "http://edamontology.org/topic_3344"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Biomedical applications have become increasingly complex, and they often require large-scale high-performance computing resources with a large number of processors and memory. The complexity of application deployment and the advances in cluster, grid and cloud computing require new modes of support for biomedical research. Scientific Software as a Service (sSaaS) enables scalable and transparent access to biomedical applications through simple standards-based Web interfaces. Towards this end, we built a production web server (http://ws.nbcr.net) in August 2007 to support the bioinformatics application called MEME. The server has grown since to include docking analysis with AutoDock and AutoDock Vina, electrostatic calculations using PDB2PQR and APBS, and off-target analysis using SMAP. All the applications on the servers are powered by Opal, a toolkit that allows users to wrap scientific applications easily as web services without any modification to the scientific codes, by writing simple XML configuration files. Opal allows both web forms-based access and programmatic access of all our applications. The Opal toolkit currently supports SOAP-based Web service access to a number of popular applications from the National Biomedical Computation Resource (NBCR) and affiliated collaborative and service projects. In addition, Opal's programmatic access capability allows our applications to be accessed through many workflow tools, including Vision, Kepler, Nimrod/K and VisTrails. From mid-August 2007 to the end of 2009, we have successfully executed 239 814 jobs. The number of successfully executed jobs more than doubled from 205 to 411 per day between 2008 and 2009. The Opal-enabled service model is useful for a wide range of applications. It provides for interoperation with other applications with Web Service interfaces, and allows application developers to focus on the scientific tool and workflow development. Web server availability: http://ws.nbcr.net. © The Author(s) 2010. Published by Oxford University Press.",
            "authors": [
                "Ren J.",
                "Williams N.",
                "Clementi L.",
                "Krishnan S.",
                "Li W.W."
            ],
            "cit_count": 30,
            "journal": "Nucleic Acids Research",
            "pmid": "20529877",
            "title": "Opal web services for biomedical applications",
            "year": "2010-06-05"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:opal_ws",
        "biotoolsID": "opal_ws",
        "description": "Opal Web Services for Biomedical Applications is a production web server. Powered by Opal, it allows users to use scientific applications easily as web services without any modification to the scientific codes.",
        "homepage": "https://sourceforge.net/projects/opaltoolkit/files/",
        "name": "Opal Web Services for Biomedical Applications"
    }
}