{
    "additionDate": "2020-01-14T19:29:45Z",
    "biotoolsCURIE": "biotools:shinyBN",
    "biotoolsID": "shinyBN",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ywei@njmu.edu.cn",
            "name": "Yongyue Wei",
            "typeEntity": "Person"
        },
        {
            "email": "fengchen@njmu.edu.cn",
            "name": "Feng Chen",
            "typeEntity": "Person"
        }
    ],
    "description": "an online application for interactive Bayesian network inference and visualization.\n\nshinyBN is an R/Shiny application for interactive construction, inference and visualization of Bayesian Network, which provide friendly GUI for users lacking of programming skills. It's mainly based on five R packages: bnlearn for structure learning, parameter training, gRain for network inference, and visNetwork for network visualization, pROC and rmda for receiver operating characteristic (ROC) curve and decision curves analysis (DCA) , respectively, which was further wrapped by Shiny, a framework to build interactive web application straight by R",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Network simulation",
                    "uri": "http://edamontology.org/operation_3562"
                },
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                }
            ]
        }
    ],
    "homepage": "https://jiajin.shinyapps.io/shinyBN/",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-19T16:21:03Z",
    "license": "Apache-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/JiajinChen/shinyBN"
        }
    ],
    "name": "shinyBN",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3309-0",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: High-throughput technologies have brought tremendous changes to biological domains, and the resulting high-dimensional data has also posed enormous challenges to computational science. A Bayesian network is a probabilistic graphical model represented by a directed acyclic graph, which provides concise semantics to describe the relationship between entities and has an independence assumption that is suitable for sparse omics data. Bayesian networks have been broadly used in biomedical research fields, including disease risk assessment and prognostic prediction. However, the inference and visualization of Bayesian networks are unfriendly to the users lacking programming skills. Results: We developed an R/Shiny application, shinyBN, which is an online graphical user interface to facilitate the inference and visualization of Bayesian networks. shinyBN supports multiple types of input and provides flexible settings for network rendering and inference. For output, users can download network plots, prediction results and external validation results in publication-ready high-resolution figures. Conclusion: Our user-friendly application (shinyBN) provides users with an easy method for Bayesian network modeling, inference and visualization via mouse clicks. shinyBN can be used in the R environment or online and is compatible with three major operating systems, including Windows, Linux and Mac OS. shinyBN is deployed at https://jiajin.shinyapps.io/shinyBN/. Source codes and the manual are freely available at https://github.com/JiajinChen/shinyBN.",
                "authors": [
                    {
                        "name": "Chen J."
                    },
                    {
                        "name": "Zhang R."
                    },
                    {
                        "name": "Dong X."
                    },
                    {
                        "name": "Lin L."
                    },
                    {
                        "name": "Zhu Y."
                    },
                    {
                        "name": "He J."
                    },
                    {
                        "name": "Christiani D.C."
                    },
                    {
                        "name": "Wei Y."
                    },
                    {
                        "name": "Chen F."
                    }
                ],
                "citationCount": 4,
                "date": "2019-12-16T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "ShinyBN: an online application for interactive Bayesian network inference and visualization"
            },
            "pmcid": "PMC6916222",
            "pmid": "31842743"
        }
    ],
    "topic": [
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ],
    "validated": 1
}