{
    "additionDate": "2022-12-27T19:18:04.504953Z",
    "biotoolsCURIE": "biotools:ci-net",
    "biotoolsID": "ci-net",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Zihao Liu",
            "orcidid": "https://orcid.org/0000-0003-4044-2172"
        }
    ],
    "description": "Clinical-Inspired Network for Automated Skin Lesion Recognition.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                }
            ]
        }
    ],
    "homepage": "https://github.com/lzh19961031/Dermoscopy_classification",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-12-27T19:18:04.507566Z",
    "license": "Not licensed",
    "name": "CI-Net",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1109/TMI.2022.3215547",
            "metadata": {
                "abstract": "IEEEThe lesion recognition of dermoscopy images is significant for automated skin cancer diagnosis. Most of the existing methods ignore the medical perspective, which is crucial since this task requires a large amount of medical knowledge. A few methods are designed according to medical knowledge, but they ignore to be fully in line with doctors&#x2019; entire learning and diagnosis process, since certain strategies and steps of those are conducted in practice for doctors. Thus, we put forward Clinical-Inspired Network (CI-Net) to involve the learning strategy and diagnosis process of doctors, as for a better analysis. The diagnostic process contains three main steps: the zoom step, the observe step and the compare step. To simulate these, we introduce three corresponding modules: a lesion area attention module, a feature extraction module and a lesion feature attention module. To simulate the distinguish strategy, which is commonly used by doctors, we introduce a distinguish module. We evaluate our proposed CI-Net on six challenging datasets, including ISIC 2016, ISIC 2017, ISIC 2018, ISIC 2019, ISIC 2020 and PH2 datasets, and the results indicate that CI-Net outperforms existing work. The code is publicly available at https://github.com/lzh19961031/Dermoscopy&#x005F;classification.",
                "authors": [
                    {
                        "name": "Jiang T."
                    },
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Xiong R."
                    }
                ],
                "citationCount": 1,
                "date": "2022-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Medical Imaging",
                "title": "CI-Net: Clinical-Inspired Network for Automated Skin Lesion Recognition"
            },
            "pmid": "36279355"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ],
    "validated": 1
}
