{
    "accessibility": "Open access",
    "additionDate": "2024-01-01T18:29:55.468455Z",
    "biotoolsCURIE": "biotools:hic4d",
    "biotoolsID": "hic4d",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "zheng.wang@miami.edu",
            "name": "Zheng Wang",
            "typeEntity": "Person"
        },
        {
            "name": "Tong Liu",
            "typeEntity": "Person"
        }
    ],
    "description": "HiC4D is a tool for forecasting spatiotemporal Hi-C data with residual ConvLSTM (ResConvLSTM).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Residue contact prediction",
                    "uri": "http://edamontology.org/operation_0272"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://dna.cs.miami.edu/HiC4D/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-01-01T18:29:55.471180Z",
    "license": "CC-BY-4.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/zwang-bioinformatics/HiC4D/"
        }
    ],
    "name": "HiC4D",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAD263",
            "metadata": {
                "abstract": "The Hi-C experiments have been extensively used for the studies of genomic structures. In the last few years, spatiotemporal Hi-C has largely contributed to the investigation of genome dynamic reorganization. However, computationally modeling and forecasting spatiotemporal Hi-C data still have not been seen in the literature. We present HiC4D for dealing with the problem of forecasting spatiotemporal Hi-C data. We designed and benchmarked a novel network and named it residual ConvLSTM (ResConvLSTM), which is a combination of residual network and convolutional long short-term memory (ConvLSTM). We evaluated our new ResConvLSTM networks and compared them with the other five methods, including a naïve network (NaiveNet) that we designed as a baseline method and four outstanding video-prediction methods from the literature: ConvLSTM, spatiotemporal LSTM (ST-LSTM), self-attention LSTM (SA-LSTM) and simple video prediction (SimVP). We used eight different spatiotemporal Hi-C datasets for the blind test, including two from mouse embryogenesis, one from somatic cell nuclear transfer (SCNT) embryos, three embryogenesis datasets from different species and two non-embryogenesis datasets. Our evaluation results indicate that our ResConvLSTM networks almost always outperform the other methods on the eight blind-test datasets in terms of accurately predicting the Hi-C contact matrices at future time-steps. Our benchmarks also indicate that all of the methods that we benchmarked can successfully recover the boundaries of topologically associating domains called on the experimental Hi-C contact matrices. Taken together, our benchmarks suggest that HiC4D is an effective tool for predicting spatiotemporal Hi-C data. HiC4D is publicly available at both http://dna.cs.miami.edu/HiC4D/ and https://github.com/zwang-bioinformatics/HiC4D/.",
                "authors": [
                    {
                        "name": "Liu T."
                    },
                    {
                        "name": "Wang Z."
                    }
                ],
                "date": "2023-09-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "HiC4D: forecasting spatiotemporal Hi-C data with residual ConvLSTM"
            },
            "pmcid": "PMC10516390",
            "pmid": "37478379"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}
