{
    "additionDate": "2021-01-18T08:34:23Z",
    "biotoolsCURIE": "biotools:faspr",
    "biotoolsID": "faspr",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhng@umich.edu",
            "name": "Yang Zhang",
            "typeEntity": "Person"
        }
    ],
    "description": "FASPR is an open-source tool for fast and accurate protein structural modeling of protein side-chain conformations and packing.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Side chain modelling",
                    "uri": "http://edamontology.org/operation_0480"
                },
                {
                    "term": "Backbone modelling",
                    "uri": "http://edamontology.org/operation_0479"
                },
                {
                    "term": "Accessible surface calculation",
                    "uri": "http://edamontology.org/operation_0384"
                },
                {
                    "term": "Protein geometry calculation",
                    "uri": "http://edamontology.org/operation_0249"
                },
                {
                    "term": "Hydrogen bond calculation",
                    "uri": "http://edamontology.org/operation_0394"
                }
            ]
        }
    ],
    "homepage": "https://zhanglab.ccmb.med.umich.edu/FASPR",
    "language": [
        "C++"
    ],
    "lastUpdate": "2021-03-10T20:07:45Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/tommyhuangthu/FASPR"
        }
    ],
    "name": "FASPR",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA234",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: Protein structure and function are essentially determined by how the side-chain atoms interact with each other. Thus, accurate protein side-chain packing (PSCP) is a critical step toward protein structure prediction and protein design. Despite the importance of the problem, however, the accuracy and speed of current PSCP programs are still not satisfactory. Results: We present FASPR for fast and accurate PSCP by using an optimized scoring function in combination with a deterministic searching algorithm. The performance of FASPR was compared with four state-of-the-art PSCP methods (CISRR, RASP, SCATD and SCWRL4) on both native and non-native protein backbones. For the assessment on native backbones, FASPR achieved a good performance by correctly predicting 69.1% of all the side-chain dihedral angles using a stringent tolerance criterion of 20°, compared favorably with SCWRL4, CISRR, RASP and SCATD which successfully predicted 68.8%, 68.6%, 67.8% and 61.7%, respectively. Additionally, FASPR achieved the highest speed for packing the 379 test protein structures in only 34.3 s, which was significantly faster than the control methods. For the assessment on non-native backbones, FASPR showed an equivalent or better performance on I-TASSER predicted backbones and the backbones perturbed from experimental structures. Detailed analyses showed that the major advantage of FASPR lies in the optimal combination of the dead-end elimination and tree decomposition with a well optimized scoring function, which makes FASPR of practical use for both protein structure modeling and protein design studies.",
                "authors": [
                    {
                        "name": "Huang X."
                    },
                    {
                        "name": "Pearce R."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "citationCount": 4,
                "date": "2020-03-31T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "FASPR: An open-source tool for fast and accurate protein side-chain packing"
            },
            "pmcid": "PMC7320614",
            "pmid": "32259206"
        }
    ],
    "toolType": [
        "Web application",
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        },
        {
            "term": "Protein structural motifs and surfaces",
            "uri": "http://edamontology.org/topic_0166"
        }
    ]
}