{
    "additionDate": "2017-01-13T13:13:43Z",
    "biotoolsCURIE": "biotools:bfast",
    "biotoolsID": "bfast",
    "credit": [
        {
            "name": "Nils Homer",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://sourceforge.net/u/nilshomer/profile/"
        }
    ],
    "description": "Blat-like Fast Accurate Search Tool.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://sourceforge.net/p/bfast/wiki/Home/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome indexing",
                    "uri": "http://edamontology.org/operation_3211"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/projects/bfast",
    "language": [
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:53Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "BFAST",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: DNA sequence comparison is based on optimal local alignment of two sequences using a similarity score. However, some new DNA sequencing technologies do not directly measure the base sequence, but rather an encoded form, such as the two-base encoding considered here. In order to compare such data to a reference sequence, the data must be decoded into sequence. The decoding is deterministic, but the possibility of measurement errors requires searching among all possible error modes and resulting alignments to achieve an optimal balance of fewer errors versus greater sequence similarity. Results: We present an extension of the standard dynamic programming method for local alignment, which simultaneously decodes the data and performs the alignment, maximizing a similarity score based on a weighted combination of errors and edits, and allowing an affine gap penalty. We also present simulations that demonstrate the performance characteristics of our two base encoded alignment method and contrast those with standard DNA sequence alignment under the same conditions. Conclusion: The new local alignment algorithm for two-base encoded data has substantial power to properly detect and correct measurement errors while identifying underlying sequence variants, and facilitating genome re-sequencing efforts based on this form of sequence data. © 2009 Homer et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Homer N."
                    },
                    {
                        "name": "Merriman B."
                    },
                    {
                        "name": "Nelson S.F."
                    }
                ],
                "citationCount": 31,
                "date": "2009-06-09T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Local alignment of two-base encoded DNA sequence"
            },
            "pmid": "19508732"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ],
    "validated": 1
}
