{
    "additionDate": "2017-12-18T00:06:46Z",
    "biotoolsCURIE": "biotools:ggb",
    "biotoolsID": "ggb",
    "credit": [
        {
            "email": "nbaliga@systemsbiology.org",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The GGB (Gaggle Genome Browser) is an open source software tool for visualizing high-density data plotted against coordinates on the genome. Tiling arrays, ChIP-chip, and high-throughput sequencing are a few potential use-cases. The genome browser is designed to gracefully handle large datasets, allow easy import of user data, and interoperate with other bioinformatics tools through the Gaggle framework.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://gaggle.systemsbiology.net/docs/geese/genomebrowser/help/start/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome browser",
                    "uri": "http://edamontology.org/operation_3208"
                }
            ]
        }
    ],
    "homepage": "http://gaggle.systemsbiology.net/docs/geese/genomebrowser/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2021-04-15T06:16:52Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/ggb-1-0-visualization-systems-biology-data-context-genome.html"
        }
    ],
    "name": "GGB",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_011780"
        }
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-11-382",
            "metadata": {
                "abstract": "Background: High-density tiling arrays and new sequencing technologies are generating rapidly increasing volumes of transcriptome and protein-DNA interaction data. Visualization and exploration of this data is critical to understanding the regulatory logic encoded in the genome by which the cell dynamically affects its physiology and interacts with its environment.Results: The Gaggle Genome Browser is a cross-platform desktop program for interactively visualizing high-throughput data in the context of the genome. Important features include dynamic panning and zooming, keyword search and open interoperability through the Gaggle framework. Users may bookmark locations on the genome with descriptive annotations and share these bookmarks with other users. The program handles large sets of user-generated data using an in-process database and leverages the facilities of SQL and the R environment for importing and manipulating data.A key aspect of the Gaggle Genome Browser is interoperability. By connecting to the Gaggle framework, the genome browser joins a suite of interconnected bioinformatics tools for analysis and visualization with connectivity to major public repositories of sequences, interactions and pathways. To this flexible environment for exploring and combining data, the Gaggle Genome Browser adds the ability to visualize diverse types of data in relation to its coordinates on the genome.Conclusions: Genomic coordinates function as a common key by which disparate biological data types can be related to one another. In the Gaggle Genome Browser, heterogeneous data are joined by their location on the genome to create information-rich visualizations yielding insight into genome organization, transcription and its regulation and, ultimately, a better understanding of the mechanisms that enable the cell to dynamically respond to its environment. © 2010 Bare et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Baliga N.S."
                    },
                    {
                        "name": "Bare J.C."
                    },
                    {
                        "name": "Koide T."
                    },
                    {
                        "name": "Reiss D.J."
                    },
                    {
                        "name": "Tenenbaum D."
                    }
                ],
                "citationCount": 22,
                "date": "2010-07-19T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Integration and visualization of systems biology data in context of the genome"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Biology",
            "uri": "http://edamontology.org/topic_3070"
        },
        {
            "term": "ChIP-chip",
            "uri": "http://edamontology.org/topic_3179"
        },
        {
            "term": "ChIP-chip",
            "uri": "http://edamontology.org/topic_3179"
        },
        {
            "term": "ChiP",
            "uri": "http://edamontology.org/topic_3179"
        },
        {
            "term": "High-throughput sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}
