{
    "additionDate": "2022-10-28T05:59:15.133778Z",
    "biotoolsCURIE": "biotools:cacp-deepgram",
    "biotoolsID": "cacp-deepgram",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Fawaz Khaled Alarfaj"
        },
        {
            "name": "Shahid Akbar"
        }
    ],
    "description": "Classification of anticancer peptides via deep neural network and skip-gram-based word embedding model.",
    "documentation": [
        {
            "type": [
                "Quick start guide"
            ],
            "url": "https://github.com/shahidakbarcs/cACP-DeepGram/tree/main/fastText"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/shahidakbarcs/cACP-DeepGram",
    "language": [
        "C",
        "C++",
        "MATLAB"
    ],
    "lastUpdate": "2024-11-24T15:25:51.963323Z",
    "license": "Not licensed",
    "name": "cACP-DeepGram",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/j.artmed.2022.102349",
            "metadata": {
                "abstract": "Cancer is a Toxic health concern worldwide, it happens when cellular modifications cause the irregular growth and division of human cells. Several traditional approaches such as therapies and wet laboratory-based methods have been applied to treat cancer cells. However, these methods are considered less effective due to their high cost and diverse side effects. According to recent advancements, peptide-based therapies have attracted the attention of scientists because of their high selectivity. Peptide therapy can efficiently treat the targeted cells, without affecting the normal cells. Due to the rapid increase of peptide sequences, an accurate prediction model has become a challenging task. Keeping the significance of anticancer peptides (ACPs) in cancer treatment, an intelligent and reliable prediction model is highly indispensable. In this paper, a FastText-based word embedding strategy has been employed to represent each peptide sample via a skip-gram model. After extracting the peptide embedding descriptors, the deep neural network (DNN) model was applied to accurately discriminate the ACPs. The optimized parameters of DNN achieved an accuracy of 96.94 %, 93.41 %, and 94.02 % using training, alternate, and independent samples, respectively. It was observed that our proposed cACP-DeepGram model outperformed and reported ~10 % highest prediction accuracy than existing predictors. It is suggested that the cACP-DeepGram model will be a reliable tool for scientists and might play a valuable role in academic research and drug discovery. The source code and the datasets are publicly available at https://github.com/shahidakbarcs/cACP-DeepGram.",
                "authors": [
                    {
                        "name": "Akbar S."
                    },
                    {
                        "name": "Alarfaj F.K."
                    },
                    {
                        "name": "Hayat M."
                    },
                    {
                        "name": "Khan S."
                    },
                    {
                        "name": "Tahir M."
                    }
                ],
                "citationCount": 79,
                "date": "2022-09-01T00:00:00Z",
                "journal": "Artificial Intelligence in Medicine",
                "title": "cACP-DeepGram: Classification of anticancer peptides via deep neural network and skip-gram-based word embedding model"
            },
            "pmid": "36100346"
        }
    ],
    "toolType": [
        "Library",
        "Script"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
