{
    "additionDate": "2022-11-06T12:43:08.072419Z",
    "biotoolsCURIE": "biotools:greenscreen",
    "biotoolsID": "greenscreen",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "wagnerdo@sas.upenn.edu",
            "name": "Doris Wagner",
            "typeEntity": "Person"
        }
    ],
    "description": "A simple method to remove artifactual signals and enrich for true peaks in genomic datasets including ChIP-seq data.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                },
                {
                    "term": "Peak detection",
                    "uri": "http://edamontology.org/operation_3215"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                }
            ]
        }
    ],
    "homepage": "https://github.com/sklasfeld/GreenscreenProject",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2024-11-24T15:22:37.644413Z",
    "license": "GPL-3.0",
    "name": "greenscreen",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/plcell/koac282",
            "metadata": {
                "abstract": "Chromatin immunoprecipitation followed by sequencing (ChIP-seq) is widely used to identify factor binding to genomic DNA and chromatin modifications. ChIP-seq data analysis is affected by genomic regions that generate ultra-high artifactual signals. To remove these signals from ChIP-seq data, the Encyclopedia of DNA Elements (ENCODE) project developed comprehensive sets of regions defined by low mappability and ultra-high signals called blacklists for human, mouse (Mus musculus), nematode (Caenorhabditis elegans), and fruit fly (Drosophila melanogaster). However, blacklists are not currently available for many model and nonmodel species. Here, we describe an alternative approach for removing false-positive peaks called greenscreen. Greenscreen is easy to implement, requires few input samples, and uses analysis tools frequently employed for ChIP-seq. Greenscreen removes artifactual signals as effectively as blacklists in Arabidopsis thaliana and human ChIP-seq dataset while covering less of the genome and dramatically improves ChIP-seq peak calling and downstream analyses. Greenscreen filtering reveals true factor binding overlap and occupancy changes in different genetic backgrounds or tissues. Because it is effective with as few as two inputs, greenscreen is readily adaptable for use in any species or genome build. Although developed for ChIP-seq, greenscreen also identifies artifactual signals from other genomic datasets including Cleavage Under Targets and Release Using Nuclease. We present an improved ChIP-seq pipeline incorporating greenscreen that detects more true peaks than other methods.",
                "authors": [
                    {
                        "name": "Klasfeld S."
                    },
                    {
                        "name": "Roule T."
                    },
                    {
                        "name": "Wagner D."
                    }
                ],
                "citationCount": 6,
                "date": "2022-12-01T00:00:00Z",
                "journal": "Plant Cell",
                "title": "Greenscreen: A simple method to remove artifactual signals and enrich for true peaks in genomic datasets including ChIP-seq data"
            },
            "pmid": "36124976"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "ChIP-on-chip",
            "uri": "http://edamontology.org/topic_3179"
        },
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
