{
    "name": "GRAAL", 
    "description": "Aligns a pair of nodes originating in different networks based on a similarity measure of their local neighbourhoods.", 
    "homepage": "http://bio-nets.doc.ic.ac.uk/GRAAL_suppl_inf/", 
    "biotoolsID": "graal", 
    "biotoolsCURIE": "biotools:graal", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2497", 
                    "term": "Pathway or network analysis"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Library"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_2259", 
            "term": "Systems biology"
        }, 
        {
            "uri": "http://edamontology.org/topic_0602", 
            "term": "Molecular interactions, pathways and networks"
        }
    ], 
    "operatingSystem": [
        "Linux"
    ], 
    "language": [
        "C++"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/graal-c-graal-mi-graal-matching-based-integrative-graph-aligner.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://www0.cs.ucl.ac.uk/staff/natasa/GRAAL/index.html", 
            "type": "General", 
            "note": null
        }, 
        {
            "url": "http://www0.cs.ucl.ac.uk/staff/natasa/GRAAL/GRAAL_SI.pdf", 
            "type": "Other", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "25725498", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "L-GRAAL: Lagrangian graphlet-based network aligner", 
                "abstract": "© 2015 The Author 2015. Published by Oxford University Press. Motivation: Discovering and understanding patterns in networks of protein-protein interactions (PPIs) is a central problem in systems biology. Alignments between these networks aid functional understanding as they uncover important information, such as evolutionary conserved pathways, protein complexes and functional orthologs. A few methods have been proposed for global PPI network alignments, but because of NP-completeness of underlying sub-graph isomorphism problem, producing topologically and biologically accurate alignments remains a challenge. Results: We introduce a novel global network alignment tool, Lagrangian GRAphlet-based ALigner (L-GRAAL), which directly optimizes both the protein and the interaction functional conservations, using a novel alignment search heuristic based on integer programming and Lagrangian relaxation. We compare L-GRAAL with the state-of-the-art network aligners on the largest available PPI networks from BioGRID and observe that L-GRAAL uncovers the largest common sub-graphs between the networks, as measured by edge-correctness and symmetric sub-structures scores, which allow transferring more functional information across networks. We assess the biological quality of the protein mappings using the semantic similarity of their Gene Ontology annotations and observe that L-GRAAL best uncovers functionally conserved proteins. Furthermore, we introduce for the first time a measure of the semantic similarity of the mapped interactions and show that L-GRAAL also uncovers best functionally conserved interactions. In addition, we illustrate on the PPI networks of baker's yeast and human the ability of L-GRAAL to predict new PPIs. Finally, L-GRAAL's results are the first to show that topological information is more important than sequence information for uncovering functionally conserved interactions. Availability and implementation: L-GRAAL is coded in C++. Software is available at: http://bio-nets.doc.ic.ac.uk/L-GRAAL/.", 
                "date": "2015-07-01T00:00:00Z", 
                "citationCount": 36, 
                "authors": [
                    {
                        "name": "Malod-Dognin N."
                    }, 
                    {
                        "name": "Przulj N."
                    }
                ], 
                "journal": "Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": "Natasa Przulj", 
            "email": "natas@acs.ucl.ac.uk", 
            "url": "http://www.doc.ic.ac.uk/~natasha//index.html", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T18:44:41Z", 
    "lastUpdate": "2018-12-10T12:58:55Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}