{
    "accessibility": "Open access",
    "additionDate": "2022-06-07T21:33:18.982921Z",
    "biotoolsCURIE": "biotools:enfusion",
    "biotoolsID": "enfusion",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "peter.white@nationwidechildrens.org",
            "name": "Peter White",
            "orcidid": "https://orcid.org/0000-0002-5218-5903",
            "typeEntity": "Person"
        },
        {
            "name": "James R. Fitch"
        },
        {
            "name": "Stephanie LaHaye"
        }
    ],
    "description": "The ENsemble Fusion (EnFusion) repo contains a Dockerfile to build a Docker Image that can overlap outputs from 7 fusion detection algorithms, to identify high confidence fusion events.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Sequence motif recognition",
                    "uri": "http://edamontology.org/operation_0239"
                }
            ]
        }
    ],
    "homepage": "https://github.com/nch-igm/EnFusion",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-06-07T21:33:18.985389Z",
    "license": "BSD-3-Clause",
    "name": "EnFusion",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S12864-021-08094-Z",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Pediatric cancers typically have a distinct genomic landscape when compared to adult cancers and frequently carry somatic gene fusion events that alter gene expression and drive tumorigenesis. Sensitive and specific detection of gene fusions through the analysis of next-generation-based RNA sequencing (RNA-Seq) data is computationally challenging and may be confounded by low tumor cellularity or underlying genomic complexity. Furthermore, numerous computational tools are available to identify fusions from supporting RNA-Seq reads, yet each algorithm demonstrates unique variability in sensitivity and precision, and no clearly superior approach currently exists. To overcome these challenges, we have developed an ensemble fusion calling approach to increase the accuracy of identifying fusions. Results: Our Ensemble Fusion (EnFusion) approach utilizes seven fusion calling algorithms: Arriba, CICERO, FusionMap, FusionCatcher, JAFFA, MapSplice, and STAR-Fusion, which are packaged as a fully automated pipeline using Docker and Amazon Web Services (AWS) serverless technology. This method uses paired end RNA-Seq sequence reads as input, and the output from each algorithm is examined to identify fusions detected by a consensus of at least three algorithms. These consensus fusion results are filtered by comparison to an internal database to remove likely artifactual fusions occurring at high frequencies in our internal cohort, while a “known fusion list” prevents failure to report known pathogenic events. We have employed the EnFusion pipeline on RNA-Seq data from 229 patients with pediatric cancer or blood disorders studied under an IRB-approved protocol. The samples consist of 138 central nervous system tumors, 73 solid tumors, and 18 hematologic malignancies or disorders. The combination of an ensemble fusion-calling pipeline and a knowledge-based filtering strategy identified 67 clinically relevant fusions among our cohort (diagnostic yield of 29.3%), including RBPMS-MET, BCAN-NTRK1, and TRIM22-BRAF fusions. Following clinical confirmation and reporting in the patient’s medical record, both known and novel fusions provided medically meaningful information. Conclusions: The EnFusion pipeline offers a streamlined approach to discover fusions in cancer, at higher levels of sensitivity and accuracy than single algorithm methods. Furthermore, this method accurately identifies driver fusions in pediatric cancer, providing clinical impact by contributing evidence to diagnosis and, when appropriate, indicating targeted therapies.",
                "authors": [
                    {
                        "name": "Abdelbaki M.S."
                    },
                    {
                        "name": "Arbesfeld J.A."
                    },
                    {
                        "name": "Bedrosian T.A."
                    },
                    {
                        "name": "Bir N."
                    },
                    {
                        "name": "Boue D.R."
                    },
                    {
                        "name": "Cottrell C.E."
                    },
                    {
                        "name": "Eisfeld A.-K."
                    },
                    {
                        "name": "Finlay J.L."
                    },
                    {
                        "name": "Fitch J.R."
                    },
                    {
                        "name": "Franklin S.J."
                    },
                    {
                        "name": "Gupta A."
                    },
                    {
                        "name": "Herman A.C."
                    },
                    {
                        "name": "Kelly B.J."
                    },
                    {
                        "name": "Koboldt D.C."
                    },
                    {
                        "name": "Koo S.C."
                    },
                    {
                        "name": "LaHaye S."
                    },
                    {
                        "name": "Lammi G.E."
                    },
                    {
                        "name": "Lee K."
                    },
                    {
                        "name": "Leonard J.R."
                    },
                    {
                        "name": "Leraas K."
                    },
                    {
                        "name": "Magrini V."
                    },
                    {
                        "name": "Mardis E.R."
                    },
                    {
                        "name": "McGrath S.D."
                    },
                    {
                        "name": "Miller A.R."
                    },
                    {
                        "name": "Miller K.E."
                    },
                    {
                        "name": "Mrozek K."
                    },
                    {
                        "name": "Osorio D.S."
                    },
                    {
                        "name": "Schieffer K.M."
                    },
                    {
                        "name": "Setty B."
                    },
                    {
                        "name": "Varga E.A."
                    },
                    {
                        "name": "Voytovich K.J."
                    },
                    {
                        "name": "Wagner A.H."
                    },
                    {
                        "name": "Wetzel A."
                    },
                    {
                        "name": "White P."
                    },
                    {
                        "name": "Wijeratne S."
                    },
                    {
                        "name": "Wilson R.K."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Discovery of clinically relevant fusions in pediatric cancer"
            },
            "pmcid": "PMC8642973",
            "pmid": "34863095"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene structure",
            "uri": "http://edamontology.org/topic_0114"
        },
        {
            "term": "Haematology",
            "uri": "http://edamontology.org/topic_3408"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
