{
    "additionDate": "2018-09-25T07:12:56Z",
    "biotoolsCURIE": "biotools:survivalgwas_power",
    "biotoolsID": "survivalgwas_power",
    "credit": [
        {
            "email": "Hamzah.Syed@liverpool.ac.uk",
            "name": "Hamzah Syed",
            "orcidid": "http://orcid.org/0000-0001-6981-6962",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "SurvivalGWAS_Power performs power calculations for time to event outcomes over a range of study designs and different analytical approaches. The software calculates the power to detect single nucleotide polymorphism association with a time to event outcome over a range of study design scenarios.",
    "documentation": [
        {
            "type": [
                "Training material"
            ],
            "url": "https://www.liverpool.ac.uk/media/livacuk/instituteoftranslationalmedicine/biostats/SurvivalGWAS_PowerSuiteExample.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Probabilistic data generation",
                    "uri": "http://edamontology.org/operation_3480"
                }
            ]
        }
    ],
    "homepage": "https://www.liverpool.ac.uk/translational-medicine/research/statistical-genetics/survival-gwas/",
    "language": [
        "C#"
    ],
    "lastUpdate": "2019-01-13T18:10:47Z",
    "license": "GPL-3.0",
    "name": "SurvivalGWAS_Power",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1186/s12859-016-1407-9",
            "metadata": {
                "abstract": "© 2016 The Author(s).Background: Power calculators are currently available for the design of genetic association studies of binary phenotypes and quantitative traits, but not for \"time to event\" outcomes, which are of particular relevance in pharmacogenetics. With the rapid emergence of pharmacogenetic association studies of single nucleotide polymorphisms (SNPs), and the complexity of clinical outcomes they consider, there is a need for software to perform power calculations of time to event data over a range of design scenarios and analytical methodologies. Results: We have developed the user friendly software tool SurvivalGWAS_Power to perform power calculations for time to event outcomes over a range of study designs and different analytical approaches. The software calculates the power to detect SNP association with a time to event outcome over a range of study design scenarios. The software enables analyses under a Cox proportional hazards model or Weibull regression model, and can account for treatment and SNP-treatment interaction effects. Simulated data sets can also be generated by SurvivalGWAS_Power to enable analyses with methods that are not currently supported by the power calculator, thereby increasing the flexibility of the software. Conclusions: SurvivalGWAS_Power addresses the need for flexible and user-friendly software for power calculations for genetic association studies of time to event outcomes, with particular design features of relevance in pharmacogenetics.",
                "authors": [
                    {
                        "name": "Syed H."
                    },
                    {
                        "name": "Jorgensen A.L."
                    },
                    {
                        "name": "Morris A.P."
                    }
                ],
                "citationCount": 3,
                "date": "2016-12-08T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SurvivalGWAS_Power: A user friendly tool for power calculations in pharmacogenetic studies with \"time to event\" outcomes"
            },
            "pmcid": "PMC5146816",
            "pmid": "27931206",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Pharmacogenomics",
            "uri": "http://edamontology.org/topic_0208"
        },
        {
            "term": "Applied mathematics",
            "uri": "http://edamontology.org/topic_3569"
        },
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        }
    ],
    "validated": 1,
    "version": [
        "v1.5"
    ]
}