{
    "accessibility": "Open access",
    "additionDate": "2023-03-30T23:20:07.983239Z",
    "biotoolsCURIE": "biotools:casbert",
    "biotoolsID": "casbert",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ymun794@aucklanduni.ac.nz",
            "name": "Yuda Munarko",
            "orcidid": "http://orcid.org/0000-0002-9656-3945",
            "typeEntity": "Person"
        },
        {
            "name": "Anand Rampadarath"
        },
        {
            "name": "David P. Nickerson",
            "orcidid": "http://orcid.org/0000-0003-4667-9779"
        }
    ],
    "description": "BERT-Based Retrieval for Compositely Annotated Biosimulation Model Entities.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Named-entity and concept recognition",
                    "uri": "http://edamontology.org/operation_3280"
                },
                {
                    "term": "Text annotation",
                    "uri": "http://edamontology.org/operation_3778"
                }
            ]
        }
    ],
    "homepage": "https://github.com/napakalas/casbert",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:50:04.153694Z",
    "license": "GPL-3.0",
    "name": "CASBERT",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/fbinf.2023.1107467",
            "metadata": {
                "abstract": "Maximising FAIRness of biosimulation models requires a comprehensive description of model entities such as reactions, variables, and components. The COmputational Modeling in BIology NEtwork (COMBINE) community encourages the use of Resource Description Framework with composite annotations that semantically involve ontologies to ensure completeness and accuracy. These annotations facilitate scientists to find models or detailed information to inform further reuse, such as model composition, reproduction, and curation. SPARQL has been recommended as a key standard to access semantic annotation with RDF, which helps get entities precisely. However, SPARQL is unsuitable for most repository users who explore biosimulation models freely without adequate knowledge of ontologies, RDF structure, and SPARQL syntax. We propose here a text-based information retrieval approach, CASBERT, that is easy to use and can present candidates of relevant entities from models across a repository’s contents. CASBERT adapts Bidirectional Encoder Representations from Transformers (BERT), where each composite annotation about an entity is converted into an entity embedding for subsequent storage in a list of entity embeddings. For entity lookup, a query is transformed to a query embedding and compared to the entity embeddings, and then the entities are displayed in order based on their similarity. The list structure makes it possible to implement CASBERT as an efficient search engine product, with inexpensive addition, modification, and insertion of entity embedding. To demonstrate and test CASBERT, we created a dataset for testing from the Physiome Model Repository and a static export of the BioModels database consisting of query-entities pairs. Measured using Mean Average Precision and Mean Reciprocal Rank, we found that our approach can perform better than the traditional bag-of-words method.",
                "authors": [
                    {
                        "name": "Munarko Y."
                    },
                    {
                        "name": "Nickerson D.P."
                    },
                    {
                        "name": "Rampadarath A."
                    }
                ],
                "date": "2023-01-01T00:00:00Z",
                "journal": "Frontiers in Bioinformatics",
                "title": "CASBERT: BERT-based retrieval for compositely annotated biosimulation model entities"
            },
            "pmcid": "PMC9971925",
            "pmid": "36865672"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        }
    ]
}
