
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.imtech.res.in/raghava/glycoep/team.html"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://crdd.osdd.net/raghava/glycoep/help.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Prediction",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/glycoep-prediction-of-glycosysylation-sites-in-eukaryotics-proteins.html"
        }
    ],
    "publication": [
        {
            "abstract": "Glycosylation is one of the most abundant and an important post-translational modification of proteins. Glycosylated proteins (glycoproteins) are involved in various cellular biological functions like protein folding, cell-cell interactions, cell recognition and host-pathogen interactions. A large number of eukaryotic glycoproteins also have therapeutic and potential technology applications. Therefore, characterization and analysis of glycosites (glycosylated residues) in these proteins is of great interest to biologists. In order to cater these needs a number of in silico tools have been developed over the years, however, a need to get even better prediction tools remains. Therefore, in this study we have developed a new webserver GlycoEP for more accurate prediction of N-linked, O-linked and C-linked glycosites in eukaryotic glycoproteins using two larger datasets, namely, standard and advanced datasets. In case of standard datasets no two glycosylated proteins are more similar than 40%; advanced datasets are highly non-redundant where no two glycosites' patterns (as defined in methods) have more than 60% similarity. Further, based on our results with several algorihtms developed using different machine-learning techniques, we found Support Vector Machine (SVM) as optimum tool to develop glycosite prediction models. Accordingly, using our more stringent and non-redundant advanced datasets, the SVM based models developed in this study achieved a prediction accuracy of 84.26%, 86.87% and 91.43% with corresponding MCC of 0.54, 0.20 and 0.78, for N-, O- and C-linked glycosites, respectively. The best performing models trained on advanced datasets were then implemented as a user-friendly web server GlycoEP (http://www.imtech.res.in/raghava/glycoep/). Additionally, this server provides prediction models developed on standard datasets and allows users to scan sequons in input protein sequences. © 2013 Chauhan et al.",
            "authors": [
                "Chauhan J.S.",
                "Rao A.",
                "Raghava G.P.S."
            ],
            "cit_count": 93,
            "doi": "10.1371/journal.pone.0067008",
            "journal": "PLoS ONE",
            "title": "In silico Platform for Prediction of N-, O- and C-Glycosites in Eukaryotic Protein Sequences",
            "type": "Primary",
            "year": "2013-06-28"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:glycoep",
        "biotoolsID": "glycoep",
        "description": "GlycoEP is a new webserver for more accurate prediction of N-linked, O-linked and C-linked glycosites in eukaryotic glycoproteins using two larger datasets, namely, standard and advanced datasets.",
        "homepage": "http://www.imtech.res.in/raghava/glycoep/",
        "name": "GlycoEP"
    }
}