{
    "additionDate": "2020-01-14T09:21:20Z",
    "biotoolsCURIE": "biotools:RiboVIEW",
    "biotoolsID": "RiboVIEW",
    "confidence_flag": "tool",
    "description": "a computational framework for visualization, quality control and statistical analysis of ribosome profiling data.\n\nVisualization, Quality and Statistics for Ribosome Profiling.\n\nThis is package RiboVIEW for Visualization, Quality and Statistics for Ribosome Profiling",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/carinelegrand/RiboVIEW",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2020-12-14T07:46:40Z",
    "name": "RiboVIEW",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/NAR/GKZ1074",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press on behalf of Nucleic Acids Research.Recently, newly developed ribosome profiling methods based on high-Throughput sequencing of ribosome-protected mRNA footprints allow to study genome-wide translational changes in detail. However, computational analysis of the sequencing data still represents a bottleneck for many laboratories. Further, specific pipelines for quality control and statistical analysis of ribosome profiling data, providing high levels of both accuracy and confidence, are currently lacking. In this study, we describe automated bioinformatic and statistical diagnoses to perform robust quality control of ribosome profiling data (RiboQC), to efficiently visualize ribosome positions and to estimate ribosome speed (RiboMine) in an unbiased way. We present an R pipeline to setup and undertake the analyses that offers the user an HTML page to scan own data regarding the following aspects: periodicity, ligation and digestion of footprints; reproducibility and batch effects of replicates; drug-related artifacts; unbiased codon enrichment including variability between mRNAs, for A, P and E sites; mining of some causal or confounding factors. We expect our pipeline to allow an optimal use of the wealth of information provided by ribosome profiling experiments.",
                "authors": [
                    {
                        "name": "Legrand C."
                    },
                    {
                        "name": "Tuorto F."
                    }
                ],
                "citationCount": 3,
                "date": "2020-01-24T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "RiboVIEW: A computational framework for visualization, quality control and statistical analysis of ribosome profiling data"
            },
            "pmid": "31777932"
        }
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
