{
    "name": "IncGraph", 
    "description": "An efficient and incremental approach for calculating the differences in orbit counts when performing single edge modifications in a network. Calculating the differences in orbit counts is much more efficient than recalculating all orbit counts from scratch for each time point.", 
    "homepage": "https://cran.r-project.org/web/packages/incgraph/index.html", 
    "biotoolsID": "incgraph", 
    "biotoolsCURIE": "biotools:incgraph", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2454", 
                    "term": "Gene prediction"
                }, 
                {
                    "uri": "http://edamontology.org/operation_2492", 
                    "term": "Protein interaction prediction"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Library"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0602", 
            "term": "Molecular interactions, pathways and networks"
        }, 
        {
            "uri": "http://edamontology.org/topic_0204", 
            "term": "Gene regulation"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "R"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "https://cran.r-project.org/web/packages/incgraph/incgraph.pdf", 
            "type": "Manual", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1371/journal.pone.0195997", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "IncGraph: Incremental graphlet counting for topology optimisation", 
                "abstract": "© 2018 Cannoodt et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Motivation Graphlets are small network patterns that can be counted in order to characterise the structure of a network (topology). As part of a topology optimisation process, one could use graphlet counts to iteratively modify a network and keep track of the graphlet counts, in order to achieve certain topological properties. Up until now, however, graphlets were not suited as a metric for performing topology optimisation; when millions of minor changes are made to the network structure it becomes computationally intractable to recalculate all the graphlet counts for each of the edge modifications. Results IncGraph is a method for calculating the differences in graphlet counts with respect to the network in its previous state, which is much more efficient than calculating the graphlet occurrences from scratch at every edge modification made. In comparison to static counting approaches, our findings show IncGraph reduces the execution time by several orders of magnitude. The usefulness of this approach was demonstrated by developing a graphlet-based metric to optimise gene regulatory networks. IncGraph is able to quickly quantify the topological impact of small changes to a network, which opens novel research opportunities to study changes in topologies in evolving or online networks, or develop graphlet-based criteria for topology optimisation. Availability IncGraph is freely available as an open-source R package on CRAN (incgraph). The development version is also available on GitHub (rcannood/incgraph).", 
                "date": "2018-04-01T00:00:00Z", 
                "citationCount": 1, 
                "authors": [
                    {
                        "name": "Cannoodt R."
                    }, 
                    {
                        "name": "Ruyssinck J."
                    }, 
                    {
                        "name": "Ramon J."
                    }, 
                    {
                        "name": "De Preter K."
                    }, 
                    {
                        "name": "Saeys Y."
                    }
                ], 
                "journal": "PLoS ONE"
            }
        }
    ], 
    "credit": [
        {
            "name": "Robrecht Cannoodt", 
            "email": "robrecht.cannoodt@gmail.com", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "migle_sur", 
    "additionDate": "2018-06-30T20:46:49Z", 
    "lastUpdate": "2018-12-10T12:58:59Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}