{
    "accessibility": "Open access",
    "additionDate": "2022-12-27T02:31:54.819391Z",
    "biotoolsCURIE": "biotools:microfim",
    "biotoolsID": "microfim",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "giulia.agostinetto@unimib.it",
            "name": "Agostinetto Giulia",
            "typeEntity": "Person"
        },
        {
            "name": "Bruno Antonia"
        },
        {
            "name": "Casiraghi Maurizio"
        },
        {
            "name": "Pescini Dario"
        },
        {
            "name": "Sandionigi Anna"
        }
    ],
    "description": "Extending Association Rule Mining to Microbiome Pattern Analysis.'",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Relation extraction",
                    "uri": "http://edamontology.org/operation_3625"
                },
                {
                    "term": "Scatter plot plotting",
                    "uri": "http://edamontology.org/operation_2940"
                }
            ]
        }
    ],
    "homepage": "https://github.com/qLSLab/microFIM",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:15:49.813516Z",
    "license": "Not licensed",
    "name": "microFIM",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/fbinf.2021.794547",
            "metadata": {
                "abstract": "Boosted by the exponential growth of microbiome-based studies, analyzing microbiome patterns is now a hot-topic, finding different fields of application. In particular, the use of machine learning techniques is increasing in microbiome studies, providing deep insights into microbial community composition. In this context, in order to investigate microbial patterns from 16S rRNA metabarcoding data, we explored the effectiveness of Association Rule Mining (ARM) technique, a supervised-machine learning procedure, to extract patterns (in this work, intended as groups of species or taxa) from microbiome data. ARM can generate huge amounts of data, making spurious information removal and visualizing results challenging. Our work sheds light on the strengths and weaknesses of pattern mining strategy into the study of microbial patterns, in particular from 16S rRNA microbiome datasets, applying ARM on real case studies and providing guidelines for future usage. Our results highlighted issues related to the type of input and the use of metadata in microbial pattern extraction, identifying the key steps that must be considered to apply ARM consciously on 16S rRNA microbiome data. To promote the use of ARM and the visualization of microbiome patterns, specifically, we developed microFIM (microbial Frequent Itemset Mining), a versatile Python tool that facilitates the use of ARM integrating common microbiome outputs, such as taxa tables. microFIM implements interest measures to remove spurious information and merges the results of ARM analysis with the common microbiome outputs, providing similar microbiome strategies that help scientists to integrate ARM in microbiome applications. With this work, we aimed at creating a bridge between microbial ecology researchers and ARM technique, making researchers aware about the strength and weaknesses of association rule mining approach.",
                "authors": [
                    {
                        "name": "Anna S."
                    },
                    {
                        "name": "Antonia B."
                    },
                    {
                        "name": "Dario P."
                    },
                    {
                        "name": "Giulia A."
                    },
                    {
                        "name": "Maurizio C."
                    }
                ],
                "citationCount": 2,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Frontiers in Bioinformatics",
                "title": "Extending Association Rule Mining to Microbiome Pattern Analysis: Tools and Guidelines to Support Real Applications"
            },
            "pmcid": "PMC9580939",
            "pmid": "36303759"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        }
    ],
    "validated": 1
}
