{
    "additionDate": "2017-12-18T00:09:42Z",
    "biotoolsCURIE": "biotools:noa",
    "biotoolsID": "noa",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://apps.cytoscape.org/apps/noa"
        }
    ],
    "description": "The NOA (Network Ontology Analysis) plugin for Cytoscape implements the NOA algorithm for network-based enrichment analysis, which extends Gene Ontology annotations to network links, or edges.",
    "documentation": [
        {
            "type": "General",
            "url": "http://nrnb.org/tools/noa/#techdocs"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Enrichment",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "homepage": "http://nrnb.org/tools/noa/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/noa-1-1-cytoscape-plugin-for-network-ontology-analysis.html"
        }
    ],
    "name": "NOA",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1093/nar/gkr251",
            "metadata": {
                "abstract": "Gene ontology analysis has become a popular and important tool in bioinformatics study, and current ontology analyses are mainly conducted in individual gene or a gene list. However, recent molecular network analysis reveals that the same list of genes with different interactions may perform different functions. Therefore, it is necessary to consider molecular interactions to correctly and specifically annotate biological networks. Here, we propose a novel Network Ontology Analysis (NOA) method to perform gene ontology enrichment analysis on biological networks. Specifically, NOA first defines link ontology that assigns functions to interactions based on the known annotations of joint genes via optimizing two novel indexes 'Coverage' and 'Diversity'. Then, NOA generates two alternative reference sets to statistically rank the enriched functional terms for a given biological network. We compare NOA with traditional enrichment analysis methods in several biological networks, and find that: (i) NOA can capture the change of functions not only in dynamic transcription regulatory networks but also in rewiring protein interaction networks while the traditional methods cannot and (ii) NOA can find more relevant and specific functions than traditional methods in different types of static networks. Furthermore, a freely accessible web server for NOA has been developed at http://www.aporc.org/noa/. © 2011 The Author(s).",
                "authors": [
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Huang Q."
                    },
                    {
                        "name": "Liu Z.-P."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Wu L.-Y."
                    },
                    {
                        "name": "Chen L."
                    },
                    {
                        "name": "Zhang X.-S."
                    }
                ],
                "citationCount": 75,
                "date": "2011-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "NOA: A novel Network Ontology Analysis method"
            },
            "type": "Primary"
        },
        {
            "doi": "10.1093/bioinformatics/btt334",
            "metadata": {
                "abstract": "The Network Ontology Analysis (NOA) plugin for Cytoscape implements the NOA algorithm for network-based enrichment analysis, which extends Gene Ontology annotations to network links, or edges. The plugin facilitates the annotation and analysis of one or more networks in Cytoscape according to user-defined parameters. In addition to tables, the NOA plugin also presents results in the form of heatmaps and overview networks in Cytoscape, which can be exported for publication figures.Availability: The NOA plugin is an open source, Java program for Cytoscape version 2.8 available via the Cytoscape App Store (http://apps.cytoscape.org/apps/noa) and plugin manager. A detailed user manual is available at http://nrnb.org/tools/noa.Contact: apico@gladstone.ucsf.edu Supplementary information: Supplementary data are available at Bioinformatics online. © 2013 The Author 2013. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Zhang C."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Hanspers K."
                    },
                    {
                        "name": "Xu D."
                    },
                    {
                        "name": "Chen L."
                    },
                    {
                        "name": "Pico A.R."
                    }
                ],
                "citationCount": 18,
                "date": "2013-08-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "NOA: A cytoscape plugin for network ontology analysis"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Plug-in"
    ],
    "topic": [
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        }
    ],
    "validated": 1,
    "version": [
        "1.1"
    ]
}