{
    "additionDate": "2017-01-13T13:15:20Z",
    "biotoolsCURIE": "biotools:megan",
    "biotoolsID": "megan",
    "credit": [
        {
            "email": "huson@informatik.uni-tuebingen.de",
            "name": "Huson DH",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Metagenome Analysis Software - MEGAN (MEtaGenome ANalyzer\u009d) is a new computer program that allows laptop analysis of large metagenomic datasets. In a preprocessing step, the set of DNA reads (or contigs) is compared against databases of known sequences using BLAST or another comparison tool. MEGAN can then be used to compute and interactively explore the taxonomical content of the dataset, employing the NCBI taxonomy to summarize and order the results.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://ab.inf.uni-tuebingen.de/software/megan6/getting-started/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                },
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                }
            ]
        }
    ],
    "homepage": "http://ab.inf.uni-tuebingen.de/software/megan6/",
    "lastUpdate": "2018-12-10T12:58:53Z",
    "name": "MEGAN",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Metagenomics is the study of the genomic content of a sample of organisms obtained from a common habitat using targeted or random sequencing. Goals include understanding the extent and role of microbial diversity. The taxonomical content of such a sample is usually estimated by comparison against sequence databases of known sequences. Most published studies use the analysis of paired-end reads, complete sequences of environmental fosmid and BAC clones, or environmental assemblies. Emerging sequencing-by-synthesis technologies with very high throughput are paving the way to low-cost random \"shotgun\" approaches. This paper introduces MEGAN, a new computer program that allows laptop analysis of large metagenomic data sets. In a preprocessing step, the set of DNA sequences is compared against databases of known sequences using BLAST or another comparison tool. MEGAN is then used to compute and explore the taxonomical content of the data set, employing the NCBI taxonomy to summarize and order the results. A simple lowest common ancestor algorithm assigns reads to taxa such that the taxonomical level of the assigned taxon reflects the level of conservation of the sequence. The software allows large data sets to be dissected without the need for assembly or the targeting of specific phylogenetic markers. It provides graphical and statistical output for comparing different data sets. The approach is applied to several data sets, including the Sargasso Sea data set, a recently published metagenomic data set sampled from a mammoth bone, and several complete microbial genomes. Also, simulations that evaluate the performance of the approach for different read lengths are presented. ©2007 by Cold Spring Harbor Laboratory Press.",
                "authors": [
                    {
                        "name": "Huson D.H."
                    },
                    {
                        "name": "Auch A.F."
                    },
                    {
                        "name": "Qi J."
                    },
                    {
                        "name": "Schuster S.C."
                    }
                ],
                "citationCount": 1752,
                "date": "2007-03-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "MEGAN analysis of metagenomic data"
            },
            "pmid": "17255551"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}