{
    "additionDate": "2020-01-14T09:17:51Z",
    "biotoolsCURIE": "biotools:OPSCC",
    "biotoolsID": "OPSCC",
    "confidence_flag": "tool",
    "description": "High nodal FDG uptake increases risk of distant metastasis in patients with oropharyngeal squamous cell carcinoma.\n\nBACKGROUND:The purpose of this study was to investigate if FDG uptake metrics in primary tumor and lymph node metastases in patients with oropharyngeal squamous cell carcinoma (OPSCC) has a prognostic value beyond UICC8 staging in a multiple endpoint model. METHODS:Patients with OPSCC treated with primary radiotherapy at Rigshospitalet in the period 2010-2017 were included. All patients had a pretreatment FDG PET CT scan performed. Four cause-specific Cox regression models were built for the hazard ratios (HR) of recurrence in T-, N-, M-site, and death with no evidence of disease (NED), respectively. The following variables were included: T-, N-stage, p16 status, metabolic tumor volume, and FDG uptake in both primary tumor and lymph nodes.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://rasmussen.shinyapps.io/OPSCCmodelFDG_PET/",
    "lastUpdate": "2021-01-04T14:11:46Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://rasmussen.shinyapps.io/OPSCCmodelFDG_PET_Extended/"
        }
    ],
    "name": "OPSCC",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/S00259-019-04572-5",
            "metadata": {
                "abstract": "© 2019, Springer-Verlag GmbH Germany, part of Springer Nature.Background: The purpose of this study was to investigate if FDG uptake metrics in primary tumor and lymph node metastases in patients with oropharyngeal squamous cell carcinoma (OPSCC) has a prognostic value beyond UICC8 staging in a multiple endpoint model. Methods: Patients with OPSCC treated with primary radiotherapy at Rigshospitalet in the period 2010–2017 were included. All patients had a pretreatment FDG PET/CT scan performed. Four cause-specific Cox regression models were built for the hazard ratios (HR) of recurrence in T-, N-, M-site, and death with no evidence of disease (NED), respectively. The following variables were included: T-, N-stage, p16 status, metabolic tumor volume, and FDG uptake in both primary tumor and lymph nodes. A competing risk analysis was performed and absolute risk estimates were estimated using the Aalen–Johansen method. Results: Overall, 441 patients were included. Thirty-four patients had T-site recurrence, 31 N-site recurrence, 32 M-site recurrence, and 52 patients had death NED as event. Nodal FDG uptake had a significant impact on N- and M-site recurrence, with HRs of 2.13 (CI 1.20–3.77) and 2.18 (CI 1.16–4.10). The individual prognostication of absolute risk of the four events for any given patient can be assessed in the online tool (https://rasmussen.shinyapps.io/OPSCCmodelFDG_PET/). Conclusion: High nodal FDG uptake increases the risk of N- and M-site recurrence in patients with OPSCC in a competing risk scenario. The reported results are available in an easy applicable online tool and can help identify relevant candidates for future trials testing treatment approaches.",
                "authors": [
                    {
                        "name": "Christensen J.T."
                    },
                    {
                        "name": "Fischer B.M."
                    },
                    {
                        "name": "Friborg J."
                    },
                    {
                        "name": "Hakansson K."
                    },
                    {
                        "name": "Jensen J.S."
                    },
                    {
                        "name": "Lofgren J."
                    },
                    {
                        "name": "Rasmussen J.H."
                    },
                    {
                        "name": "Vogelius I.R."
                    },
                    {
                        "name": "Zamani M."
                    },
                    {
                        "name": "von Buchwald C."
                    }
                ],
                "date": "2020-05-01T00:00:00Z",
                "journal": "European Journal of Nuclear Medicine and Molecular Imaging",
                "title": "High nodal FDG uptake increases risk of distant metastasis in patients with oropharyngeal squamous cell carcinoma"
            },
            "pmid": "31720757"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        }
    ],
    "validated": 1
}
