{"credit":[{"email":"daniel.huson@uni-tuebingen.de","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://ab.inf.uni-tuebingen.de/software/megan6/getting-started/"}],"function":[{"operation":[{"term":"Phylogenetic tree visualisation","uri":"http://edamontology.org/operation_0567"},{"term":"Phylogenetic tree generation","uri":"http://edamontology.org/operation_0323"},{"term":"Taxonomic classification","uri":"http://edamontology.org/operation_3460"}]}],"labels":{"collectionID":["Animal and Crop Genomics"],"language":["Java"],"license":"Proprietary","operatingSystem":["Linux","Windows","Mac"],"toolType":["Desktop application"],"topic":[{"term":"Metagenomics","uri":"http://edamontology.org/topic_3174"}]},"publication":[{"abstract":"A major challenge in the analysis of environmental sequences is data integration. The question is how to analyze different types of data in a unified approach, addressing both the taxonomic and functional aspects. To facilitate such analyses, we have substantially extended MEGAN, a widely used taxonomic analysis program. The new program, MEGAN4, provides an integrated approach to the taxonomic and functional analysis of metagenomic, metatranscriptomic, metaproteomic, and rRNA data. While taxonomic analysis is performed based on the NCBI taxonomy, functional analysis is performed using the SEED classification of subsystems and functional roles or the KEGG classification of pathways and enzymes. A number of examples illustrate how such analyses can be performed, and show that one can also import and compare classification results obtained using others' tools. MEGAN4 is freely available for academic purposes, and installers for all three major operating systems can be downloaded from www-ab.informatik.uni-tuebingen.de/software/megan. © 2011 by Cold Spring Harbor Laboratory Press.","authors":["Huson D.H.","Mitra S.","Ruscheweyh H.-J.","Weber N.","Schuster S.C."],"cit_count":752,"doi":"10.1101/gr.120618.111","journal":"Genome Research","title":"Integrative analysis of environmental sequences using MEGAN4","type":"Primary","year":"2011-09-01"}],"summary":{"biotoolsCURIE":"biotools:megan6","biotoolsID":"megan6","description":"Comprehensive toolbox for interactively analyzing microbiome data. It can perform taxonomic analysis using the NCBI taxonomy. Perform functional analysis using InterPro2GO, SEED, eggNOG or KEGG. Make bar chartsm word clouds, Coronoi tree maps and other charts. Perform PCoA, clustering and networks.","homepage":"http://ab.inf.uni-tuebingen.de/software/megan6/","name":"MEGAN6"}}