{
    "additionDate": "2017-08-03T18:59:36Z",
    "biotoolsCURIE": "biotools:sibis",
    "biotoolsID": "sibis",
    "credit": [
        {
            "email": "thompson@unistra.fr",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.lbgi.fr/~julie/"
        }
    ],
    "description": "The tool designed to detect inconsistencies based on the evolutionary information in multiple sequence alignments. A Bayesian framework, combined with Dirichlet mixture models, is used to estimate the probability of observing specific amino acids and to detect inconsistent or erroneous sequence segments.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.lbgi.fr/~julie/SIBIS/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence alignment validation",
                    "uri": "http://edamontology.org/operation_0447"
                }
            ]
        }
    ],
    "homepage": "http://www.lbgi.fr/~julie/SIBIS",
    "language": [
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/sibis-1-0-bayesian-model-for-inconsistent-protein-sequence-estimation.html"
        }
    ],
    "name": "SIBIS",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: The prediction of protein coding genes is a major challenge that depends on the quality of genome sequencing, the accuracy of the model used to elucidate the exonic structure of the genes and the complexity of the gene splicing process leading to different protein variants. As a consequence, today's protein databases contain a huge amount of inconsistency, due to both natural variants and sequence prediction errors. Results: We have developed a new method, called SIBIS, to detect such inconsistencies based on the evolutionary information in multiple sequence alignments. A Bayesian framework, combined with Dirichlet mixture models, is used to estimate the probability of observing specific amino acids and to detect inconsistent or erroneous sequence segments. We evaluated the performance of SIBIS on a reference set of protein sequences with experimentally validated errors and showed that the sensitivity is significantly higher than previous methods, with only a small loss of specificity. We also assessed a large set of human sequences from the UniProt database and found evidence of inconsistency in 48% of the previously uncharacterized sequences. We conclude that the integration of quality control methods like SIBIS in automatic analysis pipelines will be critical for the robust inference of structural, functional and phylogenetic information from these sequences.. © The Author(s) 2014.",
                "authors": [
                    {
                        "name": "Khenoussi W."
                    },
                    {
                        "name": "Vanhoutreve R."
                    },
                    {
                        "name": "Poch O."
                    },
                    {
                        "name": "Thompson J.D."
                    }
                ],
                "citationCount": 4,
                "date": "2014-09-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "SIBIS: A Bayesian model for inconsistent protein sequence estimation"
            },
            "pmid": "24825613"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1
}