{
    "additionDate": "2017-01-17T14:59:13Z",
    "biotoolsCURIE": "biotools:pigengene",
    "biotoolsID": "pigengene",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "zare@txstate.edu",
            "name": "Habil Zare",
            "orcidid": "http://orcid.org/0000-0001-5902-6238",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "This package infers biological signatures from gene expression profiles using data from one platform, and evaluate them on a different one. It also identifies clusters of highly coexpressed genes using coexpression network analysis, summarizing the biological information of each module in an eigengene, learning a Bayesian network that models the probabilistic dependencies between modules, and building a decision tree based on the expression of eigengenes.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/Pigengene.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/Pigengene_1.0.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical inference",
                    "uri": "http://edamontology.org/operation_3658"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/Pigengene.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-15T01:27:21Z",
    "license": "GPL-2.0",
    "name": "Pigengene",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1186/s12920-017-0253-6",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: The distinct types of hematological malignancies have different biological mechanisms and prognoses. For instance, myelodysplastic syndrome (MDS) is generally indolent and low risk; however, it may transform into acute myeloid leukemia (AML), which is much more aggressive. Methods: We develop a novel network analysis approach that uses expression of eigengenes to delineate the biological differences between these two diseases. Results: We find that specific genes in the extracellular matrix pathway are underexpressed in AML. We validate this finding in three ways: (a) We train our model on a microarray dataset of 364 cases and test it on an RNA Seq dataset of 74 cases. Our model showed 95% sensitivity and 86% specificity in the training dataset and showed 98% sensitivity and 91% specificity in the test dataset. This confirms that the identified biological signatures are independent from the expression profiling technology and independent from the training dataset. (b) Immunocytochemistry confirms that MMP9, an exemplar protein in the extracellular matrix, is underexpressed in AML. (c) MMP9 is hypermethylated in the majority of AML cases (n=194, Welch's t-test p-value <10-138), which complies with its low expression in AML. Our novel network analysis approach is generalizable and useful in studying other complex diseases (e.g., breast cancer prognosis). We implement our methodology in the Pigengene software package, which is publicly available through Bioconductor. Conclusions: Eigengenes define informative biological signatures that are robust with respect to expression profiling technology. These signatures provide valuable information about the underlying biology of diseases, and they are useful in predicting diagnosis and prognosis.",
                "authors": [
                    {
                        "name": "Foroushani A."
                    },
                    {
                        "name": "Agrahari R."
                    },
                    {
                        "name": "Docking R."
                    },
                    {
                        "name": "Chang L."
                    },
                    {
                        "name": "Duns G."
                    },
                    {
                        "name": "Hudoba M."
                    },
                    {
                        "name": "Karsan A."
                    },
                    {
                        "name": "Zare H."
                    }
                ],
                "citationCount": 15,
                "date": "2017-03-16T00:00:00Z",
                "journal": "BMC Medical Genomics",
                "title": "Large-scale gene network analysis reveals the significance of extracellular matrix pathway and homeobox genes in acute myeloid leukemia: An introduction to the Pigengene package and its applications"
            },
            "pmcid": "PMC5353782",
            "pmid": "28298217",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1,
    "version": [
        "1.0.0"
    ]
}