{
    "additionDate": "2019-11-14T20:05:21Z",
    "biotoolsCURIE": "biotools:FSTA",
    "biotoolsID": "FSTA",
    "confidence_flag": "low",
    "description": "> LOW CONFIDENCE! | > HOMEPAGE BROKEN! | > CORRECT NAME OF TOOL COULD ALSO BE 'AGRICOLA', 'FSTA AGRICOLA', 'WoS' | Accounting for Relevance When Evaluating Database Performance | The impetus for this study is the limited amount of information on performance characteristics of food science-encompassing online bibliographic databases. Database usage is an important element in modern research because a comprehensive understanding of current knowledge is essential for effective, unbiased hypothesis formulation and testing",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "https://www.ebsco.com/products/research-databases/fsta",
    "lastUpdate": "2019-11-14T20:05:21Z",
    "name": "FSTA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1111/1750-3841.14769",
            "metadata": {
                "abstract": "© 2019 Institute of Food Technologists®Abstract: The impetus for this study is the limited amount of information on performance characteristics of food science–encompassing online bibliographic databases. Database usage is an important element in modern research because a comprehensive understanding of current knowledge is essential for effective, unbiased hypothesis formulation and testing. Six databases commonly recommended by academic libraries for information retrieval in the food sciences (Academic Search Premier [ASP], Agricultural Online Access [AGRICOLA], CAB Direct, Food Science and Technology Abstracts [FSTA], PubMed, and Web of Science [WoS]) were compared in a case study based on the research topic “in vitro bile acid binding properties of dietary lignin.” A complex string of search terms was used for citation retrieval, and predetermined inclusion/exclusion criteria were used to determine the relevancy of retrieved articles. Searching WoS and CAB Direct returned the greatest number of relevant articles, followed closely by FSTA, PubMed, and AGRICOLA. FSTA and AGRICOLA returned the highest ratios of relevant-to-irrelevant articles, followed closely by CAB Direct. None of the databases, when used alone, recovered all of the relevant articles identified in the study; WoS indexed the highest percentage of relevant articles identified (WoS = 10; total = 19). WoS also had the highest number of relevant articles that were unique to any one database. The thoroughness of searching the complete group of databases was tested by comparison of retrieved citations with those found in relevant review articles, revealing the need for testing overall inclusivity. Practical Application: Comprehensive online information retrieval is the most efficient means of accessing current knowledge. Awareness of current knowledge is essential for effective, unbiased decision making in private sector and academic/government-based research endeavors. Thus, online database usage is an essential element of modern food science research. This paper provides tangible examples of the performance characteristics of online bibliographic databases commonly recommended for information retrieval in the food sciences. The paper is written so as to aid the reader in making decisions with respect to database usage for the recovery of topic-relevant peer-reviewed articles germane to their area of research.",
                "authors": [
                    {
                        "name": "Urhan T.K."
                    },
                    {
                        "name": "Rempel H.G."
                    },
                    {
                        "name": "Meunier-Goddik L."
                    },
                    {
                        "name": "Penner M.H."
                    }
                ],
                "date": "2019-10-01T00:00:00Z",
                "journal": "Journal of Food Science",
                "title": "Information Retrieval in Food Science Research II: Accounting for Relevance When Evaluating Database Performance"
            },
            "pmid": "31550403"
        }
    ],
    "topic": [
        {
            "term": "Nutritional science",
            "uri": "http://edamontology.org/topic_3390"
        },
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ]
}