{
    "additionDate": "2019-11-14T19:35:35Z",
    "biotoolsCURIE": "biotools:Atacama_Database",
    "biotoolsID": "Atacama_Database",
    "confidence_flag": "tool",
    "description": "a platform of the microbiome of the Atacama Desert | The Atacama Desert is one of the oldest and driest places on Earth. In the last decade, microbial richness and diversity has been acknowledged as an important biological resource of this region. Owing to the value of the microbial diversity apparent in potential biotechnology applications and conservation purposes, it is necessary to catalogue these microbial communities to promote research activities and help to preserve the wide range of ecological niches of the Atacama region. A prototype Atacama Database has been designed and it provides a description of the rich microbial diversity of the Atacama Desert, and helps to visualise available literature resources. Data has been collected, curated, and organised into several categories to generate a single record for each organism in the database that covers classification, isolation metadata, morphology, physiology, genome and metabolism information",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://www.atacamadb.cl",
    "lastUpdate": "2020-12-09T13:25:25.484398Z",
    "name": "Atacama Database",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/S10482-019-01328-X",
            "metadata": {
                "abstract": "© 2019, Springer Nature Switzerland AG.The Atacama Desert is one of the oldest and driest places on Earth. In the last decade, microbial richness and diversity has been acknowledged as an important biological resource of this region. Owing to the value of the microbial diversity apparent in potential biotechnology applications and conservation purposes, it is necessary to catalogue these microbial communities to promote research activities and help to preserve the wide range of ecological niches of the Atacama region. A prototype Atacama Database has been designed and it provides a description of the rich microbial diversity of the Atacama Desert, and helps to visualise available literature resources. Data has been collected, curated, and organised into several categories to generate a single record for each organism in the database that covers classification, isolation metadata, morphology, physiology, genome and metabolism information. The current version of Atacama Database contains 2302 microorganisms and includes cultured and uncultured organisms retrieved from different environments within the desert between 1984 and 2016. These organisms are distributed in bacterial, archaeal or eukaryotic domains, along with those that are unclassified taxonomically. The initial prototype of the Atacama Database includes a basic search and taxonomic and advanced search tools to allow identification and comparison of microbial populations, and space distribution within this biome. A geolocation search was implemented to visualise the microbial diversity of the ecological niches defined by sectors and extract general information of the sampling sites. This effort will aid understanding of the microbial ecology of the desert, microbial population dynamics, seasonal behaviour, impact of climate change over time, and reveal further biotechnological applications of these microorganisms. The Atacama Database is freely available at: https://www.atacamadb.cl.",
                "authors": [
                    {
                        "name": "Contador C.A."
                    },
                    {
                        "name": "Veas-Castillo L."
                    },
                    {
                        "name": "Tapia E."
                    },
                    {
                        "name": "Antipan M."
                    },
                    {
                        "name": "Miranda N."
                    },
                    {
                        "name": "Ruiz-Tagle B."
                    },
                    {
                        "name": "Garcia-Araya J."
                    },
                    {
                        "name": "Andrews B.A."
                    },
                    {
                        "name": "Marin M."
                    },
                    {
                        "name": "Dorador C."
                    },
                    {
                        "name": "Asenjo J.A."
                    }
                ],
                "date": "2020-02-01T00:00:00Z",
                "journal": "Antonie van Leeuwenhoek, International Journal of General and Molecular Microbiology",
                "title": "Atacama Database: a platform of the microbiome of the Atacama Desert"
            },
            "pmid": "31535335"
        }
    ],
    "topic": [
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Biotechnology",
            "uri": "http://edamontology.org/topic_3297"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        }
    ]
}