{
    "additionDate": "2020-01-09T18:14:15Z",
    "biotoolsCURIE": "biotools:CRM-SIRT",
    "biotoolsID": "CRM-SIRT",
    "confidence_flag": "tool",
    "description": "A novel constrained reconstruction model towards high-resolution sub-tomogram averaging.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/icthrm/CRM",
    "language": [
        "C++",
        "C"
    ],
    "lastUpdate": "2020-12-16T19:40:05Z",
    "name": "CRM-SIRT",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ787",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.MOTIVATION: Electron tomography (ET) offers a unique capacity to image biological structures in situ. However, the resolution of ET reconstructed tomograms is not comparable to that of the single-particle cryo-EM. If many copies of the object of interest are present in the tomograms, their structures can be reconstructed in the tomogram, picked, aligned and averaged to increase the signal-to-noise ratio and improve the resolution, which is known as the subtomogram averaging. To date, the resolution improvement of the subtomogram averaging is still limited because each reconstructed subtomogram is of low reconstruction quality due to the missing wedge issue. RESULTS: In this article, we propose a novel computational model, the constrained reconstruction model (CRM), to better recover the information from the multiple subtomograms and compensate for the missing wedge issue in each of them. CRM is supposed to produce a refined reconstruction in the final turn of subtomogram averaging after alignment, instead of directly taking the average. We first formulate the averaging method and our CRM as linear systems, and prove that the solution space of CRM is no larger, and in practice much smaller, than that of the averaging method. We then propose a sparse Kaczmarz algorithm to solve the formulated CRM, and further extend the solution to the simultaneous algebraic reconstruction technique (SART). Experimental results demonstrate that CRM can significantly alleviate the missing wedge issue and improve the final reconstruction quality. In addition, our model is robust to the number of images in each tilt series, the tilt range and the noise level. AVAILABILITY AND IMPLEMENTATION: The codes of CRM-SIRT and CRM-SART are available at https://github.com/icthrm/CRM. SUPPLEMENTARY INFORMATION: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Han R."
                    },
                    {
                        "name": "Li L."
                    },
                    {
                        "name": "Yang P."
                    },
                    {
                        "name": "Zhang F."
                    },
                    {
                        "name": "Gao X."
                    }
                ],
                "date": "2021-07-12T00:00:00Z",
                "journal": "Bioinformatics (Oxford, England)",
                "title": "A novel constrained reconstruction model towards high-resolution subtomogram averaging"
            },
            "pmid": "31617571"
        }
    ],
    "topic": [
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        },
        {
            "term": "Biological imaging",
            "uri": "http://edamontology.org/topic_3383"
        }
    ],
    "validated": 1
}