{
    "name": "IMEter", 
    "description": "Calculate if an intron enhances gene expression.", 
    "homepage": "http://korflab.ucdavis.edu/cgi-bin/web-imeter.pl", 
    "biotoolsID": "imeter", 
    "biotoolsCURIE": "biotools:imeter", 
    "version": [
        "2.1"
    ], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3463", 
                    "term": "Gene expression correlation"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web service"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0077", 
            "term": "Nucleic acids"
        }, 
        {
            "uri": "http://edamontology.org/topic_0203", 
            "term": "Gene expression"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "Perl"
    ], 
    "license": "Unlicensed", 
    "collectionID": [
        "Animal and Crop Genomics"
    ], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "https://github.com/KorfLab/IME", 
            "type": "Issue tracker", 
            "note": null
        }, 
        {
            "url": "https://github.com/KorfLab/IME/issues", 
            "type": "Issue tracker", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "https://github.com/KorfLab/IME/blob/master/README_IMEter_v2.1.md", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1093/nar/gkr043", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Other", 
            "version": null, 
            "metadata": {
                "title": "Comparative and functional analysis of intron-mediated enhancement signals reveals conserved features among plants", 
                "abstract": "Introns in a wide range of organisms including plants, animals and fungi are able to increase the expression of the gene that they are contained in. This process of intron-mediated enhancement (IME) is most thoroughly studied in Arabidopsis thaliana, where it has been shown that enhancing introns are typically located near the promoter and are compositionally distinct from downstream introns. In this study, we perform a comprehensive comparative analysis of several sequenced plant genomes. We find that enhancing sequences are conserved in the multi-cellular plants but are either absent or unrecognizable in algae. IME signals are preferentially located towards the 5′-end of first introns but also appear to be enriched in 5′-UTRs and coding regions near the transcription start site. Enhancing introns are found most prominently in genes that are highly expressed in a wide range of tissues. Through site-directed mutagenesis in A. thaliana, we show that IME signals can be inserted or removed from introns to increase or decrease gene expression. Although we do not yet know the specific mechanism of IME, the predicted signals appear to be both functional and highly conserved. © 2011 The Author(s).", 
                "date": "2011-07-01T00:00:00Z", 
                "citationCount": 80, 
                "authors": [
                    {
                        "name": "Parra G."
                    }, 
                    {
                        "name": "Bradnam K."
                    }, 
                    {
                        "name": "Rose A.B."
                    }, 
                    {
                        "name": "Korf I."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }, 
        {
            "doi": "10.1105/tpc.107.057190", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "Promoter-proximal introns in Arabidopsis thaliana are enriched in dispersed signals that elevate gene expression", 
                "abstract": "Introns that elevate mRNA accumulation have been found in a wide range of eukaryotes. However, not all introns affect gene expression, and direct testing is currently the only way to identify stimulatory introns. Our genome-wide analysis in Arabidopsis thaliana revealed that promoter-proximal introns as a group are compositionally distinct from distal introns and that the degree to which an individual intron matches the promoter-proximal intron profile is a strong predictor of its ability to increase expression. We found that the sequences responsible for elevating expression are dispersed throughout an enhancing intron, as is a candidate motif that is overrepresented in first introns and whose occurrence in tested introns is proportional to its effect on expression. The signals responsible for intron-mediated enhancement are apparently conserved between Arabidopsis and rice (Oryza sativa) despite the large evolutionary distance separating these plants. © 2008 American Society of Plant Biologists.", 
                "date": "2008-03-01T00:00:00Z", 
                "citationCount": 96, 
                "authors": [
                    {
                        "name": "Rose A.B."
                    }, 
                    {
                        "name": "Elfersi T."
                    }, 
                    {
                        "name": "Parra G."
                    }, 
                    {
                        "name": "Korf I."
                    }
                ], 
                "journal": "Plant Cell"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": "ifkorf@ucdavis.edu", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "admin", 
    "additionDate": "2017-08-20T15:57:33Z", 
    "lastUpdate": "2019-09-04T08:38:12Z", 
    "editPermission": {
        "type": "group", 
        "authors": [
            "animalandcropgenomics"
        ]
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}