{
    "additionDate": "2022-08-11T08:27:16.251346Z",
    "biotoolsCURIE": "biotools:biochemddi",
    "biotoolsID": "biochemddi",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Chang-Qing Yu",
            "orcidid": "https://orcid.org/0000-0003-4712-8784",
            "typeEntity": "Person"
        },
        {
            "name": "Li-Ping Li",
            "typeEntity": "Person"
        }
    ],
    "description": "BioChemDDI web server is constructed to predict drug-drug interactions, which is compatible with most major browsers, and the parallel speed-up is implemented.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://120.77.11.78/BioChemDDI/tutorial/"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                },
                {
                    "term": "Small molecule design",
                    "uri": "http://edamontology.org/operation_4009"
                }
            ]
        }
    ],
    "homepage": "http://120.77.11.78/BioChemDDI/",
    "lastUpdate": "2022-08-11T08:27:16.253767Z",
    "license": "Not licensed",
    "name": "BioChemDDI",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3390/BIOLOGY11050758",
            "metadata": {
                "abstract": "© 2022 by the authors. Licensee MDPI, Basel, Switzerland.Simple Summary: Throughout history, combining drugs has been a common method in the fight against complex diseases. However, potential drug–drug interactions could give rise to unknown toxicity issues, which requires the urgent proposal of efficient methods to identify potential interac-tions.We use computer technology and machine learning techniques to propose a novel computational framework to calculate scores of drug–drug interaction probability for simplifying the screening process. Additionally, we built an online prescreening tool for biological researchers to further verify possible interactions in the fields of biomedicine and pharmacology. Overall, our study can provide new insights and approaches for rapidly identifying potential drug–drug interactions. Abstract: During the development of drug and clinical applications, due to the co-administration of different drugs that have a high risk of interfering with each other’s mechanisms of action, correctly identifying potential drug–drug interactions (DDIs) is important to avoid a reduction in drug therapeutic activities and serious injuries to the organism. Therefore, to explore potential DDIs, we develop a computational method of integrating multi-level information. Firstly, the information of chemical sequence is fully captured by the Natural Language Processing (NLP) algorithm, and multiple biological function similarity information is fused by Similarity Network Fusion (SNF). Secondly, we extract deep network structure information through Hierarchical Representation Learning for Networks (HARP). Then, a highly representative comprehensive feature descriptor is constructed through the self-attention module that efficiently integrates biochemical and network features. Finally, a deep neural network (DNN) is employed to generate the prediction results. Contrasted with the previous supervision model, BioChemDDI innovatively introduced graph collapse for extracting a network structure and utilized the biochemical information during the pre-training process. The prediction results of the benchmark dataset indicate that BioChemDDI outperforms other existing models. Moreover, the case studies related to three cancer diseases, including breast cancer, hepatocellular carcinoma and malignancies, were analyzed using BioChemDDI. As a result, 24, 18 and 20 out of the top 30 predicted cancer-related drugs were confirmed by the databases. These experimental results demonstrate that BioChemDDI is a useful model to predict DDIs and can provide reliable candidates for biological experiments. The web server of BioChemDDI predictor is freely available to conduct further studies.",
                "authors": [
                    {
                        "name": "Guan Y.-J."
                    },
                    {
                        "name": "Guo L.-X."
                    },
                    {
                        "name": "Li L.-P."
                    },
                    {
                        "name": "Pan J."
                    },
                    {
                        "name": "Ren Z.-H."
                    },
                    {
                        "name": "You Z.-H."
                    },
                    {
                        "name": "Yu C.-Q."
                    }
                ],
                "date": "2022-05-01T00:00:00Z",
                "journal": "Biology",
                "title": "BioChemDDI: Predicting Drug–Drug Interactions by Fusing Biochemical and Structural Information through a Self-Attention Mechanism"
            },
            "pmcid": "PMC9138786",
            "pmid": "35625486"
        }
    ],
    "toolType": [
        "Web application",
        "Workflow"
    ],
    "topic": [
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
