
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://sbml.org/About"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://sbml.org/Documents"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "EBI Training Tools"
        ],
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Suite"
        ],
        "topic": [
            {
                "term": "Systems biology",
                "uri": "http://edamontology.org/topic_2259"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Motivation: Molecular biotechnology now makes it possible to build elaborate systems models, but the systems biology community needs information standards if models are to be shared, evaluated and developed cooperatively. Results: We summarize the Systems Biology Markup Language (SBML) Level 1, a free, open, XML-based format for representing biochemical reaction networks. SBML is a software-independent language for describing models common to research in many areas of computational biology, including cell signaling pathways, metabolic pathways, gene regulation, and others.",
            "authors": [
                "Hucka M.",
                "Finney A.",
                "Sauro H.M.",
                "Bolouri H.",
                "Doyle J.C.",
                "Kitano H.",
                "Arkin A.P.",
                "Bornstein B.J.",
                "Bray D.",
                "Cornish-Bowden A.",
                "Cuellar A.A.",
                "Dronov S.",
                "Gilles E.D.",
                "Ginkel M.",
                "Gor V.",
                "Goryanin I.I.",
                "Hedley W.J.",
                "Hodgman T.C.",
                "Hofmeyr J.-H.",
                "Hunter P.J.",
                "Juty N.S.",
                "Kasberger J.L.",
                "Kremling A.",
                "Kummer U.",
                "Le Novere N.",
                "Loew L.M.",
                "Lucio D.",
                "Mendes P.",
                "Minch E.",
                "Mjolsness E.D.",
                "Nakayama Y.",
                "Nelson M.R.",
                "Nielsen P.F.",
                "Sakurada T.",
                "Schaff J.C.",
                "Shapiro B.E.",
                "Shimizu T.S.",
                "Spence H.D.",
                "Stelling J.",
                "Takahashi K.",
                "Tomita M.",
                "Wagner J.",
                "Wang J."
            ],
            "cit_count": 1840,
            "doi": "10.1093/bioinformatics/btg015",
            "journal": "Bioinformatics",
            "title": "The systems biology markup language (SBML): A medium for representation and exchange of biochemical network models",
            "year": "2003-03-01"
        },
        {
            "abstract": "Background: Qualitative frameworks, especially those based on the logical discrete formalism, are increasingly used to model regulatory and signalling networks. A major advantage of these frameworks is that they do not require precise quantitative data, and that they are well-suited for studies of large networks. While numerous groups have developed specific computational tools that provide original methods to analyse qualitative models, a standard format to exchange qualitative models has been missing. Results: We present the Systems Biology Markup Language (SBML) Qualitative Models Package (\" qual\"), an extension of the SBML Level 3 standard designed for computer representation of qualitative models of biological networks. We demonstrate the interoperability of models via SBML qual through the analysis of a specific signalling network by three independent software tools. Furthermore, the collective effort to define the SBML qual format paved the way for the development of LogicalModel, an open-source model library, which will facilitate the adoption of the format as well as the collaborative development of algorithms to analyse qualitative models. Conclusions: SBML qual allows the exchange of qualitative models among a number of complementary software tools. SBML qual has the potential to promote collaborative work on the development of novel computational approaches, as well as on the specification and the analysis of comprehensive qualitative models of regulatory and signalling networks. © 2013 Chaouiya et al.; licensee BioMed Central Ltd.",
            "authors": [
                "Chaouiya C.",
                "Berenguier D.",
                "Keating S.M.",
                "Naldi A.",
                "van Iersel M.P.",
                "Rodriguez N.",
                "Drager A.",
                "Buchel F.",
                "Cokelaer T.",
                "Kowal B.",
                "Wicks B.",
                "Goncalves E.",
                "Dorier J.",
                "Page M.",
                "Monteiro P.T.",
                "von Kamp A.",
                "Xenarios I.",
                "de Jong H.",
                "Hucka M.",
                "Klamt S.",
                "Thieffry D.",
                "Le Novere N.",
                "Saez-Rodriguez J.",
                "Helikar T."
            ],
            "cit_count": 55,
            "doi": "10.1186/1752-0509-7-135",
            "journal": "BMC Systems Biology",
            "title": "SBML qualitative models: A model representation format and infrastructure to foster interactions between qualitative modelling formalisms and tools",
            "year": "2013-12-10"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:sbml",
        "biotoolsID": "sbml",
        "description": "Project that develops and makes available a number of software resources in addition to the homonimous .org portal.",
        "homepage": "http://sbml.org/Software",
        "name": "SBML"
    }
}