{
    "additionDate": "2021-01-18T10:59:39Z",
    "biotoolsCURIE": "biotools:saambe-seq",
    "biotoolsID": "saambe-seq",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ealexov@clemson.edu",
            "name": "Emil Alexov",
            "typeEntity": "Person"
        }
    ],
    "description": "A Sequence-based Method for Predicting Mutation Effect on Protein-protein Binding Affinity.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Protein-protein binding site prediction",
                    "uri": "http://edamontology.org/operation_2464"
                },
                {
                    "term": "Variant effect prediction",
                    "uri": "http://edamontology.org/operation_0331"
                }
            ]
        }
    ],
    "homepage": "http://compbio.clemson.edu/saambe_webserver/indexSEQ.php#started",
    "lastUpdate": "2021-02-10T15:03:25Z",
    "name": "SAAMBE-SEQ",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA761",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: Vast majority of human genetic disorders are associated with mutations that affect protein protein interactions by altering wild-type binding affinity. Therefore, it is extremely important to assess the effect of mutations on protein protein binding free energy to assist the development of therapeutic solutions. Currently, the most popular approaches use structural information to deliver the predictions, which precludes them to be applicable on genome-scale investigations. Indeed, with the progress of genomic sequencing, researchers are frequently dealing with assessing effect of mutations for which there is no structure available. Results: Here, we report a Gradient Boosting Decision Tree machine learning algorithm, the SAAMBE-SEQ, which is completely sequence-based and does not require structural information at all. SAAMBE-SEQ utilizes 80 features representing evolutionary information, sequence-based features and change of physical properties upon mutation at the mutation site. The approach is shown to achieve Pearson correlation coefficient (PCC) of 0.83 in 5-fold cross validation in a benchmarking test against experimentally determined binding free energy change (DDG). Further, a blind test (no-STRUC) is compiled collecting experimental DDG upon mutation for protein complexes for which structure is not available and used to benchmark SAAMBE-SEQ resulting in PCC in the range of 0.37 0.46. The accuracy of SAAMBE-SEQ method is found to be either better or comparable to most advanced structure-based methods. SAAMBE-SEQ is very fast, available as webserver and stand-alone code, and indeed utilizes only sequence information, and thus it is applicable for genome-scale investigations to study the effect of mutations on protein protein interactions.",
                "authors": [
                    {
                        "name": "Li G."
                    },
                    {
                        "name": "Pahari S."
                    },
                    {
                        "name": "Murthy A.K."
                    },
                    {
                        "name": "Liang S."
                    },
                    {
                        "name": "Fragoza R."
                    },
                    {
                        "name": "Yu H."
                    },
                    {
                        "name": "Alexov E."
                    }
                ],
                "citationCount": 1,
                "date": "2021-04-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "SAAMBE-SEQ: A sequence-based method for predicting mutation effect on protein-protein binding affinity"
            },
            "pmid": "32866236"
        }
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Protein interaction experiment",
            "uri": "http://edamontology.org/topic_3957"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        }
    ]
}