{
    "accessibility": "Open access",
    "additionDate": "2023-02-12T15:21:34.671882Z",
    "biotoolsCURIE": "biotools:bloodnet",
    "biotoolsID": "bloodnet",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "chunfeng.lian@xjtu.edu.cn",
            "name": "Fan Wang",
            "typeEntity": "Person"
        },
        {
            "email": "fan.wang@xjtu.edu.cn",
            "name": "Chunfeng Lian",
            "typeEntity": "Person"
        },
        {
            "email": "wzy218@xjtu.edu.cn",
            "name": "Zhenyuan Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "An attention-based deep network for accurate, efficient, and costless bloodstain time since deposition inference.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/shenxiaochenn/BloodNet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-02-12T15:21:34.674827Z",
    "license": "MIT",
    "link": [
        {
            "note": "Satasets and pre-trained models can be freely accessed via",
            "type": [
                "Other"
            ],
            "url": "https://figshare.com/articles/dataset/BloodNet_An_attention-based_deep_network_for_accurate_efficient_and_costless_bloodstain_time_since_deposition_inference/21291825"
        }
    ],
    "name": "BloodNet",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAC557",
            "metadata": {
                "abstract": "© The Author(s) 2022. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.The time since deposition (TSD) of a bloodstain, i.e., the time of a bloodstain formation is an essential piece of biological evidence in crime scene investigation. The practical usage of some existing microscopic methods (e.g., spectroscopy or RNA analysis technology) is limited, as their performance strongly relies on high-end instrumentation and/or rigorous laboratory conditions. This paper presents a practically applicable deep learning-based method (i.e., BloodNet) for efficient, accurate, and costless TSD inference from a macroscopic view, i.e., by using easily accessible bloodstain photos. To this end, we established a benchmark database containing around 50,000 photos of bloodstains with varying TSDs. Capitalizing on such a large-scale database, BloodNet adopted attention mechanisms to learn from relatively high-resolution input images the localized fine-grained feature representations that were highly discriminative between different TSD periods. Also, the visual analysis of the learned deep networks based on the Smooth Grad-CAM tool demonstrated that our BloodNet can stably capture the unique local patterns of bloodstains with specific TSDs, suggesting the efficacy of the utilized attention mechanism in learning fine-grained representations for TSD inference. As a paired study for BloodNet, we further conducted a microscopic analysis using Raman spectroscopic data and a machine learning method based on Bayesian optimization. Although the experimental results show that such a new microscopic-level approach outperformed the state-of-the-art by a large margin, its inference accuracy is significantly lower than BloodNet, which further justifies the efficacy of deep learning techniques in the challenging task of bloodstain TSD inference. Our code is publically accessible via https://github.com/shenxiaochenn/BloodNet. Our datasets and pre-trained models can be freely accessed via https://figshare.com/articles/dataset/21291825.",
                "authors": [
                    {
                        "name": "Chen R."
                    },
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "Li Z."
                    },
                    {
                        "name": "Lian C."
                    },
                    {
                        "name": "Liang X."
                    },
                    {
                        "name": "Shen C."
                    },
                    {
                        "name": "Sun Q."
                    },
                    {
                        "name": "Wang F."
                    },
                    {
                        "name": "Wang G."
                    },
                    {
                        "name": "Wang Z."
                    },
                    {
                        "name": "Wu H."
                    },
                    {
                        "name": "Yu K."
                    }
                ],
                "date": "2023-01-19T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "BloodNet: An attention-based deep network for accurate, efficient, and costless bloodstain time since deposition inference"
            },
            "pmid": "36572655"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        }
    ]
}
