{"credit":[{"name":"bils.se","typeEntity":"Institute","typeRoles":["Provider"]},{"email":"arne@bioinfo.se","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://octopus.cbr.su.se/index.php?about=help"}],"function":[{"input":[{"data":{"term":"Protein sequence","uri":"http://edamontology.org/data_2976"}}],"operation":[{"term":"Transmembrane protein analysis","uri":"http://edamontology.org/operation_0270"}],"output":[{"data":{"term":"Protein features","uri":"http://edamontology.org/data_1277"}}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"}]},"publication":[{"abstract":"Motivation: As α-helical transmembrane proteins constitute roughly 25% of a typical genome and are vital parts of many essential biological processes, structural knowledge of these proteins is necessary for increasing our understanding of such processes. Because structural knowledge of transmembrane proteins is difficult to attain experimentally, improved methods for prediction of structural features of these proteins are important. Results: OCTOPUS, a new method for predicting transmembrane protein topology is presented and benchmarked using a dataset of 124 sequences with known structures. Using a novel combination of hidden Markov models and artificial neural networks, OCTOPUS predicts the correct topology for 94% of the sequences. In particular, OCTOPUS is the first topology predictor to fully integrate modeling of reentrant/membrane-dipping regions and transmembrane hairpins in the topological grammar. © The Author 2008. Published by Oxford University Press. All rights reserved.","authors":["Viklund H.","Elofsson A."],"cit_count":224,"doi":"10.1093/bioinformatics/btn221","journal":"Bioinformatics","title":"OCTOPUS: Improving topology prediction by two-track ANN-based preference scores and an extended topological grammar","type":"Primary","year":"2008-08-01"}],"summary":{"biotoolsCURIE":"biotools:octopus","biotoolsID":"octopus","description":"Prediction of membrane protein topology and signal peptides.","homepage":"http://octopus.cbr.su.se/","name":"OCTOPUS","version":["1"]}}