{
    "additionDate": "2020-01-09T18:24:28Z",
    "biotoolsCURIE": "biotools:infection_dating",
    "biotoolsID": "infection_dating",
    "confidence_flag": "low",
    "credit": [
        {
            "email": "EGrebe@vitalant.org",
            "name": "Eduard Grebe",
            "orcidid": "https://orcid.org/0000-0001-7046-7245",
            "typeEntity": "Person"
        }
    ],
    "description": "Interpreting HIV diagnostic histories into infection time estimates.\n\nBACKGROUND:It is frequently of epidemiological and or clinical interest to estimate the date of HIV infection or time-since-infection of individuals. Yet, for over 15 years, the only widely-referenced infection dating algorithm that utilises diagnostic testing data to estimate time-since-infection has been the 'Fiebig staging' system. This defines a number of stages of early HIV infection through various standard combinations of contemporaneous discordant diagnostic results using tests of different sensitivity.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'infection dating tool', 'infection date', 'interpretation diagnostic', 'interpretation diagnostic testing'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://tools.incidence-estimation.org/idt/",
    "lastUpdate": "2020-01-09T18:24:28Z",
    "name": "infection dating",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12879-019-4543-9",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: It is frequently of epidemiological and/or clinical interest to estimate the date of HIV infection or time-since-infection of individuals. Yet, for over 15 years, the only widely-referenced infection dating algorithm that utilises diagnostic testing data to estimate time-since-infection has been the 'Fiebig staging' system. This defines a number of stages of early HIV infection through various standard combinations of contemporaneous discordant diagnostic results using tests of different sensitivity. To develop a new, more nuanced infection dating algorithm, we generalised the Fiebig approach to accommodate positive and negative diagnostic results generated on the same or different dates, and arbitrary current or future tests-as long as the test sensitivity is known. For this purpose, test sensitivity is the probability of a positive result as a function of time since infection. Methods: The present work outlines the analytical framework for infection date estimation using subject-level diagnostic testing histories, and data on test sensitivity. We introduce a publicly-available online HIV infection dating tool that implements this estimation method, bringing together 1) curatorship of HIV test performance data, and 2) infection date estimation functionality, to calculate plausible intervals within which infection likely became detectable for each individual. The midpoints of these intervals are interpreted as infection time 'point estimates' and referred to as Estimated Dates of Detectable Infection (EDDIs). The tool is designed for easy bulk processing of information (as may be appropriate for research studies) but can also be used for individual patients (such as in clinical practice). Results: In many settings, including most research studies, detailed diagnostic testing data are routinely recorded, and can provide reasonably precise estimates of the timing of HIV infection. We present a simple logic to the interpretation of diagnostic testing histories into infection time estimates, either as a point estimate (EDDI) or an interval (earliest plausible to latest plausible dates of detectable infection), along with a publicly-accessible online tool that supports wide application of this logic. Conclusions: This tool, available at https://tools.incidence-estimation.org/idt/, is readily updatable as test technology evolves, given the simple architecture of the system and its nature as an open source project.",
                "authors": [
                    {
                        "name": "Grebe E."
                    },
                    {
                        "name": "Facente S.N."
                    },
                    {
                        "name": "Bingham J."
                    },
                    {
                        "name": "Pilcher C.D."
                    },
                    {
                        "name": "Powrie A."
                    },
                    {
                        "name": "Gerber J."
                    },
                    {
                        "name": "Priede G."
                    },
                    {
                        "name": "Chibawara T."
                    },
                    {
                        "name": "Busch M.P."
                    },
                    {
                        "name": "Murphy G."
                    },
                    {
                        "name": "Kassanjee R."
                    },
                    {
                        "name": "Welte A."
                    }
                ],
                "citationCount": 3,
                "date": "2019-10-26T00:00:00Z",
                "journal": "BMC Infectious Diseases",
                "title": "Interpreting HIV diagnostic histories into infection time estimates: Analytical framework and online tool"
            },
            "pmcid": "PMC6815418",
            "pmid": "31655566"
        }
    ],
    "topic": [
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}