{"collectionID": [], "accessibility": [], "topic": [{"term": "Small molecules", "uri": "http://edamontology.org/topic_0154"}, {"term": "Molecular interactions, pathways and networks", "uri": "http://edamontology.org/topic_0602"}, {"term": "Protein folding, stability and design", "uri": "http://edamontology.org/topic_0130"}, {"term": "Proteins", "uri": "http://edamontology.org/topic_0078"}, {"term": "Structure analysis", "uri": "http://edamontology.org/topic_0081"}], "owner": "ELIXIR-EE", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": null, "note": null, "version": null, "pmid": "19880386", "type": null, "pmcid": null, "metadata": {"title": "PepX: A structural database of non-redundant protein peptide complexes", "abstract": "Although protein-peptide interactions are estimated to constitute up to 40% of all protein interactions, relatively little information is available for the structural details of these interactions. Peptide-mediated interactions are a prime target for drug design because they are predominantly present in signaling and regulatory networks. A reliable data set of nonredundant protein-peptide complexes is indispensable as a basis for modeling and design, but current data sets for protein-peptide interactions are often biased towards specific types of interactions or are limited to interactions with small ligands. In PepX (http://pepx.switchlab.org), we have designed an unbiased and exhaustive data set of all protein-peptide complexes available in the Protein Data Bank with peptide lengths up to 35 residues. In addition, these complexes have been clustered based on their binding interfaces rather than sequence homology, providing a set of structurally diverse protein-peptide interactions. The final data set contains 505 unique protein-peptide interface clusters from 1431 complexes. Thorough annotation of each complex with both biological and structural information facilitates searching for and browsing through individual complexes and clusters. Moreover, we provide an additional source of data for peptide design by annotating peptides with naturally occurring backbone variations using fragment clusters from the BriX database. © The Author(s) 2009. Published by Oxford University Press.", "citationCount": 72, "authors": [{"name": "Vanhee P."}, {"name": "Reumers J."}, {"name": "Stricher F."}, {"name": "Baeten L."}, {"name": "Serrano L."}, {"name": "Schymkowitz J."}, {"name": "Rousseau F."}], "date": "2009-10-30T00:00:00Z", "journal": "Nucleic Acids Research"}}], "homepage_status": 1, "credit": [], "biotoolsCURIE": "biotools:pepx", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "http://pepx.switchlab.org/pepx/", "function": [{"note": null, "input": [], "operation": [{"term": "Protein modelling", "uri": "http://edamontology.org/operation_0477"}, {"term": "Clustering", "uri": "http://edamontology.org/operation_3432"}, {"term": "Peptide database search", "uri": "http://edamontology.org/operation_3646"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:40Z", "otherID": [], "description": "Exhaustive data set of all protein-peptide complexes available in the PDB with peptide lengths up to 35 residues. Complexes have been clustered based on their binding interfaces rather than sequence homology, providing a set of structurally diverse protein-peptide interactions. Each complex is annotated with both biological and structural information. Peptides are also annotated with naturally occurring backbone variations using fragment clusters from the BriX database to aid peptide design.", "toolType": ["Database portal"], "editPermission": {"type": "private", "authors": []}, "language": [], "link": [], "biotoolsID": "pepx", "additionDate": "2017-03-27T07:56:13Z", "name": "PepX", "license": null, "documentation": [], "maturity": null, "confidence_flag": null, "operatingSystem": []}