{
    "additionDate": "2021-01-18T09:11:10Z",
    "biotoolsCURIE": "biotools:aitac",
    "biotoolsID": "aitac",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "xiguoyuan@mail.xidian.edu.cn",
            "name": "Xiguo Yuan",
            "typeEntity": "Person"
        }
    ],
    "description": "AITAC is a method for  accurately infer tumor purity and absolute copy numbers in a tumor sample by using high-throughput sequencing (HTS) data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Copy number estimation",
                    "uri": "http://edamontology.org/operation_3233"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BDanalysis/aitac",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-21T16:08:17Z",
    "license": "GPL-3.0",
    "name": "AITAC",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3389/FGENE.2020.00458",
            "metadata": {
                "abstract": "© Copyright © 2020 Yuan, Li, Zhao, Bai and Zhang.Inference of absolute copy numbers in tumor genomes is one of the key points in the study of tumor genesis. However, the mixture of tumor and normal cells poses a big challenge to this task. Accurate estimation of tumor purity (i.e., the fraction of tumor cells) is a necessary step to solve this problem. In this paper, we propose a new approach, AITAC, to accurately infer tumor purity and absolute copy numbers in a tumor sample by using high-throughput sequencing (HTS) data. In contrast to many existing algorithms for estimating tumor purity, which usually rely on pre-detected mutation genotypes (heterogeneity and homogeneity), AITAC just requires read depths (RDs) observed at the regions with copy number losses. AITAC creates a non-linear model to correlate tumor purity, observed and expected RDs. It adopts an exhaustive search strategy to scan tumor purity in a wide range, and chooses the tumor purity that minimizes the deviation between observed RDs and expected ones as the optimal solution. We apply the proposed approach to both simulation and real sequencing data sets and demonstrate its performance by comparing with two classical approaches. AITAC is freely available at https://github.com/BDanalysis/aitac and can be expected to become a useful approach for researchers to analyze copy numbers in cancer genome.",
                "authors": [
                    {
                        "name": "Yuan X."
                    },
                    {
                        "name": "Li Z."
                    },
                    {
                        "name": "Zhao H."
                    },
                    {
                        "name": "Bai J."
                    },
                    {
                        "name": "Zhang J."
                    }
                ],
                "citationCount": 2,
                "date": "2020-04-30T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "Accurate Inference of Tumor Purity and Absolute Copy Numbers From High-Throughput Sequencing Data"
            },
            "pmcid": "PMC7205152",
            "pmid": "32425990"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ],
    "validated": 1
}