{
    "additionDate": "2017-08-03T19:06:56Z",
    "biotoolsCURIE": "biotools:methylflow",
    "biotoolsID": "methylflow",
    "credit": [
        {
            "email": "hcorrada@gmail.com",
            "name": "Hector Corrada Bravo",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.hcbravo.org/"
        }
    ],
    "description": "Software of cell-specific methylation pattern reconstruction from high-throughput bisulfite-converted DNA sequencing.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/hcorrada/methylFlow/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Methylation analysis",
                    "uri": "http://edamontology.org/operation_3204"
                }
            ]
        }
    ],
    "homepage": "https://github.com/hcorrada/methylFlow",
    "language": [
        "R",
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/methylflow-cell-specific-methylation-pattern-reconstruction.html"
        }
    ],
    "name": "methylFlow",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2016 The Author 2016. Published by Oxford University Press. All rights reserved. Motivation: DNA methylation aberrations are now known to, almost universally, accompany the initiation and progression of cancers. In particular, the colon cancer epigenome contains specific genomic regions that, along with differences in methylation levels with respect to normal colon tissue, also show increased epigenetic and gene expression heterogeneity at the population level, i.e. across tumor samples, in comparison with other regions in the genome. Tumors are highly heterogeneous at the clonal level as well, and the relationship between clonal and population heterogeneity is poorly understood. Results: We present an approach that uses sequencing reads from high-throughput sequencing of bisulfite-converted DNA to reconstruct heterogeneous cell populations by assembling cell-specific methylation patterns. Our methodology is based on the solution of a specific class of minimum cost network flow problems. We use our methods to analyze the relationship between clonal heterogeneity and population heterogeneity in high-coverage data from multiple samples of colon tumor and matched normal tissues. Availability and implementation: http://github.com/hcorrada/methylFlow. Supplementary information: Supplementary information is available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Dorri F."
                    },
                    {
                        "name": "Mendelowitz L."
                    },
                    {
                        "name": "Corrada Bravo H."
                    }
                ],
                "citationCount": 2,
                "date": "2016-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "MethylFlow: Cell-specific methylation pattern reconstruction from high-throughput bisulfite-converted DNA sequencing"
            },
            "pmid": "27246923"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        }
    ],
    "validated": 1
}