{
    "additionDate": "2017-12-18T00:08:25Z",
    "biotoolsCURIE": "biotools:linkprep",
    "biotoolsID": "linkprep",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://bioinf.wehi.edu.au/"
        }
    ],
    "description": "Linkprep create LINKAGE style .pre and .dat files from AGRF style data. This creates standard format input files for linkage analysis software from human genotyping data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Linkage analysis",
                    "uri": "http://edamontology.org/operation_0283"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "http://bioinf.wehi.edu.au/software/index.html",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/linkprep-2-9-create-linkage-style-files-agrf-style-data.html"
        }
    ],
    "name": "Linkprep",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1086/339932",
            "metadata": {
                "abstract": "Association of multiple sclerosis (MS) with the human leukocyte antigen (HLA) class II haplotype DRB1*1501-DQB1*0602 is the most consistently replicated finding of genetic studies of the disease. However, the high level of linkage disequilibrium (LD) in the HLA region has hindered the identification of other loci that single-marker tests for association are unlikely to resolve. In order to address this issue, we generated haplotypes spanning 14.754 Mb (5 cM) across the entire HLA region. The haplotypes, which were inferred by genotyping relatives of 152 patients with MS and 105 unaffected control subjects of Tasmanian ancestry, define a genomic segment from D6S276 to D6S291, including 13 microsatellite markers integrated with allele-typing data for DRB1 and DQB1. Association to the DRB1*1501-DQB1*0602 haplotype was replicated. In addition, we found that the class I/extended class I region, defined by a genomic segment of ∼400 kb between MOGCA and D6S265, harbors genes that independently increase risk of, or provide protection from, MS. Log-linear modeling analysis of constituent haplotypes that represent genomic regions containing class I (MOGCA-D6S265), class III (TNFa-TNFd-D6S273), and class II (DRB1-DQB1) genes indicated that having class I and class II susceptibility variants on the same haplotype provides an additive effect on risk. Moreover, we found no evidence for a disease locus in the class III region defined by a 150-kb genomic segment containing the TNF locus and 14 other genes. A global overview of LD performed using GOLD identified two discrete blocks of LD in the HLA region that correspond well with previous findings. We propose that the analysis of haplotypes, by use of the types of approaches outlined in the present article, should make it possible to more accurately define the contribution of the HLA to MS.",
                "authors": [
                    {
                        "name": "Rubio J.P."
                    },
                    {
                        "name": "Bahlo M."
                    },
                    {
                        "name": "Butzkueven H."
                    },
                    {
                        "name": "Van der Mei I.A.F."
                    },
                    {
                        "name": "Sale M.M."
                    },
                    {
                        "name": "Dickinson J.L."
                    },
                    {
                        "name": "Groom P."
                    },
                    {
                        "name": "Johnson L.J."
                    },
                    {
                        "name": "Simmons R.D."
                    },
                    {
                        "name": "Tait B."
                    },
                    {
                        "name": "Varney M."
                    },
                    {
                        "name": "Taylor B."
                    },
                    {
                        "name": "Dwyer T."
                    },
                    {
                        "name": "Williamson R."
                    },
                    {
                        "name": "Gough N.M."
                    },
                    {
                        "name": "Kilpatrick T.J."
                    },
                    {
                        "name": "Speed T.P."
                    },
                    {
                        "name": "Foote S.J."
                    }
                ],
                "citationCount": 81,
                "date": "2002-01-01T00:00:00Z",
                "journal": "American Journal of Human Genetics",
                "title": "Genetic dissection of the human leukocyte antigen region by use of haplotypes of Tasmanians with multiple sclerosis"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genotyping",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Linkage",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1,
    "version": [
        "2.9"
    ]
}