{
    "additionDate": "2023-12-19T15:32:30.514014Z",
    "biotoolsCURIE": "biotools:MaCProQC",
    "biotoolsID": "MaCProQC",
    "description": "A workflow for the quality assessment of mass spectrometry (MS) based proteomics analyses",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Mass spectrometry data",
                        "uri": "http://edamontology.org/data_2536"
                    },
                    "format": [
                        {
                            "term": "Thermo RAW",
                            "uri": "http://edamontology.org/format_3712"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Spectral analysis",
                    "uri": "http://edamontology.org/operation_3214"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Plot",
                        "uri": "http://edamontology.org/data_2884"
                    }
                }
            ]
        }
    ],
    "homepage": "https://workflowhub.eu/workflows/343?version=1",
    "lastUpdate": "2023-12-19T15:49:49.378579Z",
    "name": "MaCProQC",
    "owner": "n.m.palmblad@lumc.nl",
    "publication": [
        {
            "doi": "10.3390/biom13030491",
            "metadata": {
                "abstract": "Proteomic studies using mass spectrometry (MS)-based quantification are a main approach to the discovery of new biomarkers. However, a number of analytical conditions in front and during MS data acquisition can affect the accuracy of the obtained outcome. Therefore, comprehensive quality assessment of the acquired data plays a central role in quantitative proteomics, though, due to the immense complexity of MS data, it is often neglected. Here, we address practically the quality assessment of quantitative MS data, describing key steps for the evaluation, including the levels of raw data, identification and quantification. With this, four independent datasets from cerebrospinal fluid, an important biofluid for neurodegenerative disease biomarker studies, were assessed, demonstrating that sample processing-based differences are already reflected at all three levels but with varying impacts on the quality of the quantitative data. Specifically, we provide guidance to critically interpret the quality of MS data for quantitative proteomics. Moreover, we provide the free and open source quality control tool MaCProQC, enabling systematic, rapid and uncomplicated data comparison of raw data, identification and feature detection levels through defined quality metrics and a step-by-step quality control workflow.",
                "authors": [
                    {
                        "name": "Barkovits-Boeddinghaus K."
                    },
                    {
                        "name": "Eisenacher M."
                    },
                    {
                        "name": "Marcus K."
                    },
                    {
                        "name": "Rozanova S."
                    },
                    {
                        "name": "Schork K."
                    },
                    {
                        "name": "Serschnitzki B."
                    },
                    {
                        "name": "Tonges L."
                    },
                    {
                        "name": "Uszkoreit J."
                    }
                ],
                "citationCount": 1,
                "date": "2023-03-01T00:00:00Z",
                "journal": "Biomolecules",
                "title": "Quality Control—A Stepchild in Quantitative Proteomics: A Case Study for the Human CSF Proteome"
            },
            "pmcid": "PMC10046854",
            "pmid": "36979426",
            "type": [
                "Primary"
            ]
        }
    ],
    "version": [
        "1"
    ]
}
