
{
    "credit": [
        {
            "email": "wh@csu.edu.cn",
            "name": "Hong Wang",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "https://github.com/whcsu/SurvELM/blob/master/SurvELM-Manual.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Incident curve plotting",
                    "uri": "http://edamontology.org/operation_3503"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R",
            "C++"
        ],
        "license": "GPL-3.0",
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Statistics and probability",
                "uri": "http://edamontology.org/topic_2269"
            }
        ]
    },
    "link": [
        {
            "type": "Issue tracker",
            "url": "https://github.com/whcsu/SurvELM/issues"
        }
    ],
    "publication": [
        {
            "abstract": "© 2018 Elsevier B.V. Due to its fast learning speed, simplicity of code implementation and effectiveness in prediction, extreme learning machine(ELM) for single hidden layer feedforward neural networks (SLFNs) has received considerable attentions recently. However, few researchers consider its possible applications in high dimensional survival analysis. In this article, we present a set of six survival analysis models to model high dimensional right-censored survival data by combining kernel ELMs with the Buckley–James estimator, regularized Cox model, random forests and boosting. In addition to a traditional R package “SurvELM”, we also provide a simple and interactive web-based version using Shiny. The R Package is available at https://github.com/whcsu/SurvELM and its Shiny version is available at https://whcsu.shinyapps.io/SurvELM/. Experimental results on several real datasets demonstrate that the proposed models are strong competitors to other popular survival prediction models under high or ultra-high dimensional setting.",
            "authors": [
                "Wang H.",
                "Zhou L."
            ],
            "cit_count": 1,
            "doi": "10.1016/j.knosys.2018.07.009",
            "journal": "Knowledge-Based Systems",
            "title": "SurvELM: An R package for high dimensional survival analysis with extreme learning machine",
            "type": "Primary",
            "year": "2018-11-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:survelm",
        "biotoolsID": "survelm",
        "description": "A set of six survival analysis models to model high dimensional right-censored survival data by combining kernel ELMs with the Buckley–James estimator, regularized Cox model, random forests and boosting.",
        "homepage": "https://github.com/whcsu/SurvELM",
        "name": "SurvELM"
    }
}