{
    "additionDate": "2024-01-26T11:56:36.354897Z",
    "biotoolsCURIE": "biotools:rphylopic",
    "biotoolsID": "rphylopic",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "willgearty@gmail.com",
            "name": "William Gearty",
            "typeEntity": "Person"
        }
    ],
    "description": "An R package for fetching, transforming, and visualising PhyloPic silhouettes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://www.phylopic.org/",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2024-01-26T11:56:36.357540Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://rphylopic.palaeoverse.org"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/palaeoverse-community/rphylopic"
        }
    ],
    "name": "rphylopic",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1111/2041-210X.14221",
            "metadata": {
                "abstract": "Effective data visualisation is vital for data exploration, analysis and communication in research. In ecology and evolutionary biology, data are often associated with various taxonomic entities. Graphics of organisms associated with these taxa are valuable for framing results within a broader biological context. However, acquiring and using such resources can be challenging due to availability and licensing constraints. The PhyloPic database solves many of these issues by making organism silhouettes freely available. Tools that integrate this database with existing research workflows are needed to remove hurdles associated with data visualisation in the biological sciences. Here, we introduce rphylopic, an R package for fetching, transforming and visualising silhouettes of organisms from the PhyloPic database. In addition to making over 8000 organism silhouettes available within the R programming language, rphylopic empowers users to modify the appearance of these silhouettes for ultimate customisability when coding production–quality visualisations in both base R and ggplot2 workflows. In this work, we provide details about how the package can be installed, its implementation and potential use cases. For the latter, we showcase three examples across the ecology and evolutionary biology spectrum. Our hope is that rphylopic will make it easier for biologists to develop more accessible and engaging data visualisations by making external resources readily accessible, customisable and usable within R. In turn, by integrating into existing workflows, rphylopic helps to ensure that science is reproducible and accessible.",
                "authors": [
                    {
                        "name": "Gearty W."
                    },
                    {
                        "name": "Jones L.A."
                    }
                ],
                "citationCount": 1,
                "date": "2023-11-01T00:00:00Z",
                "journal": "Methods in Ecology and Evolution",
                "title": "rphylopic: An R package for fetching, transforming, and visualising PhyloPic silhouettes"
            }
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
