{
    "additionDate": "2020-01-14T09:09:35Z",
    "biotoolsCURIE": "biotools:Annot",
    "biotoolsID": "Annot",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "heiserl@ohsu.edu",
            "name": "Laura M. Heiser",
            "orcidid": "https://orcid.org/0000-0003-3330-0950",
            "typeEntity": "Person"
        }
    ],
    "description": "a Django-based sample, reagent, and experiment metadata tracking system.\n\nAnnot and information about what Annot is can be found here: https://gitlab.com/biotransistor/annot . This here is just tutorial material for the tutorial described here: http://annot.readthedocs.io/en/latest/man_tutorial.html .\n\nWelcome to Annotamentum’s Documentation. — Annot 5 documentation.\n\nWelcome to Annotamentum’s Documentation.¶.\n\nDjango admin based sample, reagent and experiment metadata tracking.\n\nSummary: Annot is a web application, developed for biological wetlab experiment layout, sample and reagent logging, so that data is ready for sharing and analysis. On its core annot makes use of the acpipe_anjson library and acjson - assay coordinate json - file format. The use of controlled vocabulary from ontologies for sample and reagent annotation is enforced. Annot’s modular implementation can be adapted to a variety of experimental paradigms",
    "documentation": [
        {
            "type": [
                "Training material"
            ],
            "url": "https://gitlab.com/biotransistor/annotTutorial/"
        },
        {
            "type": [
                "User manual"
            ],
            "url": "https://annot.readthedocs.io/en/latest/"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image annotation",
                    "uri": "http://edamontology.org/operation_3553"
                },
                {
                    "term": "Phylogenetic tree annotation",
                    "uri": "http://edamontology.org/operation_0558"
                },
                {
                    "term": "Sequence annotation",
                    "uri": "http://edamontology.org/operation_0361"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "https://gitlab.com/biotransistor/annot",
    "language": [
        "R",
        "SQL",
        "Python"
    ],
    "lastUpdate": "2020-12-02T13:43:56Z",
    "name": "Annot",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3147-0",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: In biological experiments, comprehensive experimental metadata tracking-which comprises experiment, reagent, and protocol annotation with controlled vocabulary from established ontologies-remains a challenge, especially when the experiment involves multiple laboratory scientists who execute different steps of the protocol. Here we describe Annot, a novel web application designed to provide a flexible solution for this task. Results: Annot enforces the use of controlled vocabulary for sample and reagent annotation while enabling robust investigation, study, and protocol tracking. The cornerstone of Annot's implementation is a json syntax-compatible file format, which can capture detailed metadata for all aspects of complex biological experiments. Data stored in this json file format can easily be ported into spreadsheet or data frame files that can be loaded into R (https://www.r-project.org/) or Pandas, Python's data analysis library (https://pandas.pydata.org/). Annot is implemented in Python3 and utilizes the Django web framework, Postgresql, Nginx, and Debian. It is deployed via Docker and supports all major browsers. Conclusions: Annot offers a robust solution to annotate samples, reagents, and experimental protocols for established assays where multiple laboratory scientists are involved. Further, it provides a framework to store and retrieve metadata for data analysis and integration, and therefore ensures that data generated in different experiments can be integrated and jointly analyzed. This type of solution to metadata tracking can enhance the utility of large-scale datasets, which we demonstrate here with a large-scale microenvironment microarray study.",
                "authors": [
                    {
                        "name": "Bucher E."
                    },
                    {
                        "name": "Claunch C.J."
                    },
                    {
                        "name": "Hee D."
                    },
                    {
                        "name": "Smith R.L."
                    },
                    {
                        "name": "Devlin K."
                    },
                    {
                        "name": "Thompson W."
                    },
                    {
                        "name": "Korkola J.E."
                    },
                    {
                        "name": "Heiser L.M."
                    }
                ],
                "date": "2019-11-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Annot: A Django-based sample, reagent, and experiment metadata tracking system"
            },
            "pmcid": "PMC6824123",
            "pmid": "31675914"
        }
    ],
    "topic": [
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Data submission, annotation and curation",
            "uri": "http://edamontology.org/topic_0219"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ],
    "validated": 1
}