{
    "additionDate": "2019-11-14T18:34:20Z",
    "biotoolsCURIE": "biotools:RESULTSMWMM",
    "biotoolsID": "RESULTSMWMM",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "yongshengbaicool@gmail.com",
            "name": "Yongsheng Bai",
            "orcidid": "https://orcid.org/0000-0002-9944-5426",
            "typeEntity": "Person"
        }
    ],
    "description": "> MEDIUM CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'MWMM', 'blossom' | Clustering analysis of microRNA and mRNA expression data from TCGA using maximum edge-weighted matching algorithms | maximum weighted merger method",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                },
                {
                    "term": "Weighted correlation network analysis",
                    "uri": "http://edamontology.org/operation_3766"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BaiLab/MWMM",
    "language": [
        "R",
        "Python"
    ],
    "lastUpdate": "2019-11-14T18:34:20Z",
    "name": "RESULTS:MWMM",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12920-019-0562-Z",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: microRNA (miRNA) is a short RNA (∼ 22 nt) that regulates gene expression at the posttranscriptional level. Aberration of miRNA expressions could affect their targeting mRNAs involved in cancer-related signaling pathways. We conduct clustering analysis of miRNA and mRNA using expression data from the Cancer Genome Atlas (TCGA). We combine the Hungarian algorithm and blossom algorithm in graph theory. Data analysis is done using programming language R and Python. Methods: We first quantify edge-weights of the miRNA-mRNA pairs by combining their expression correlation coefficient in tumor (T-CC) and correlation coefficient in normal (N-CC). We thereby introduce a bipartite graph partition procedure to identify cluster candidates. Specifically, we propose six weight formulas to quantify the change of miRNA-mRNA expression T-CC relative to N-CC, and apply the traditional hierarchical clustering to subjectively evaluate the different weight formulas of miRNA-mRNA pairs. Among these six different weight formulas, we choose the optimal one, which we define as the integrated mean value weights, to represent the connections between miRNA and mRNAs. Then the Hungarian algorithm and the blossom algorithm are employed on the miRNA-mRNA bipartite graph to passively determine the clusters. The combination of Hungarian and the blossom algorithms is dubbed maximum weighted merger method (MWMM). Results: MWMM identifies clusters of different sizes that meet the mathematical criterion that internal connections inside a cluster are relatively denser than external connections outside the cluster and biological criterion that the intra-cluster Gene Ontology (GO) term similarities are larger than the inter-cluster GO term similarities. MWMM is developed using breast invasive carcinoma (BRCA) as training data set, but can also applies to other cancer type data sets. MWMM shows advantage in GO term similarity in most cancer types, when compared to other algorithms. Conclusions: miRNAs and mRNAs that are likely to be affected by common underlying causal factors in cancer can be clustered by MWMM approach and potentially be used as candidate biomarkers for different cancer types and provide clues for targets of precision medicine in cancer treatment.",
                "authors": [
                    {
                        "name": "Ding L."
                    },
                    {
                        "name": "Feng Z."
                    },
                    {
                        "name": "Bai Y."
                    }
                ],
                "citationCount": 2,
                "date": "2019-08-05T00:00:00Z",
                "journal": "BMC Medical Genomics",
                "title": "Clustering analysis of microRNA and mRNA expression data from TCGA using maximum edge-weighted matching algorithms"
            },
            "pmcid": "PMC6683425",
            "pmid": "31382962"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}