
{
    "credit": [
        {
            "name": "Ivica Letunic",
            "typeEntity": "Person",
            "typeRoles": [
            ]
        },
        {
            "name": "European Molecular Biology Laboratory (EMBL)",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ],
            "url": "https://www.embl.de/"
        },
        {
            "name": "HD-HuB",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ],
            "url": "https://www.hd-hub.de/"
        },
        {
            "email": "zeller@embl.de",
            "name": "Georg Zeller",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "http://itol.embl.de/help.cgi"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Phylogenetic tree",
                        "uri": "http://edamontology.org/data_0872"
                    },
                    "format": [
                        {
                            "term": "Nexus format",
                            "uri": "http://edamontology.org/format_1912"
                        },
                        {
                            "term": "phyloXML",
                            "uri": "http://edamontology.org/format_3159"
                        },
                        {
                            "term": "newick",
                            "uri": "http://edamontology.org/format_1910"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Phylogenetic tree visualisation",
                    "uri": "http://edamontology.org/operation_0567"
                },
                {
                    "term": "Phylogenetic tree analysis",
                    "uri": "http://edamontology.org/operation_0324"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Phylogenetic tree image",
                        "uri": "http://edamontology.org/data_1707"
                    },
                    "format": [
                        {
                            "term": "Image format",
                            "uri": "http://edamontology.org/format_3547"
                        }
                    ]
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "de.NBI"
        ],
        "cost": "Free of charge",
        "language": [
            "JavaScript"
        ],
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Phylogenetics",
                "uri": "http://edamontology.org/topic_3293"
            },
            {
                "term": "Metagenomics",
                "uri": "http://edamontology.org/topic_3174"
            },
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author(s) 2016. Published by Oxford University Press on behalf of Nucleic Acids Research. Interactive Tree Of Life (http://itol.embl.de) is a web-based tool for the display, manipulation and annotation of phylogenetic trees. It is freely available and open to everyone. The current version was completely redesigned and rewritten, utilizing current web technologies for speedy and streamlined processing. Numerous new features were introduced and several new data types are now supported. Trees with up to 100,000 leaves can now be efficiently displayed. Full interactive control over precise positioning of various annotation features and an unlimited number of datasets allow the easy creation of complex tree visualizations. iTOL 3 is the first tool which supports direct visualization of the recently proposed phylogenetic placements format. Finally, iTOL's account system has been redesigned to simplify the management of trees in user-defined workspaces and projects, as it is heavily used and currently handles already more than 500,000 trees from more than 10,000 individual users.",
            "authors": [
                "Letunic I.",
                "Bork P."
            ],
            "cit_count": 919,
            "journal": "Nucleic acids research",
            "pmid": "27095192",
            "title": "Interactive tree of life (iTOL) v3: an online tool for the display and annotation of phylogenetic and other trees",
            "year": "2016-07-08"
        },
        {
            "abstract": "Interactive Tree Of Life (http://itol.embl.de) is a web-based tool for the display, manipulation and annotation of phylogenetic trees. It is freely available and open to everyone. In addition to classical tree viewer functions, iTOL offers many novel ways of annotating trees with various additional data. Current version introduces numerous new features and greatly expands the number of supported data set types. Trees can be interactively manipulated and edited. A free personal account system is available, providing management and sharing of trees in user defined workspaces and projects. Export to various bitmap and vector graphics formats is supported. Batch access interface is available for programmatic access or inclusion of interactive trees into other web services. © 2011 The Author(s).",
            "authors": [
                "Letunic I.",
                "Bork P."
            ],
            "cit_count": 886,
            "journal": "Nucleic Acids Research",
            "pmid": "21470960",
            "title": "Interactive Tree of Life v2: Online annotation and display of phylogenetic trees made easy",
            "year": "2011-07-01"
        },
        {
            "abstract": "Summary: Interactive Tree Of Life (iTOL) is a web-based tool for the display, manipulation and annotation of phylogenetic trees. Trees can be interactively pruned and re-rooted. Various types of data such as genome sizes or protein domain repertoires can be mapped onto the tree. Export to several bitmap and vector graphics formats is supported. © 2007 Oxford University Press.",
            "authors": [
                "Letunic I.",
                "Bork P."
            ],
            "cit_count": 1097,
            "journal": "Bioinformatics",
            "pmid": "17050570",
            "title": "Interactive Tree Of Life (iTOL): An online tool for phylogenetic tree display and annotation",
            "year": "2007-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:itol",
        "biotoolsID": "itol",
        "description": "Online tool for the display and manipulation of phylogenetic trees. It provides a large variety of tree layouts, drawing and annotation features including circular tree layout, which is well-suited particularly for mid-sized trees (up to several thousand leaves). Tree displays can be exported in several graphical formats, both bitmap and vector based.",
        "homepage": "http://itol.embl.de/",
        "name": "Interactive Tree Of Life (iTOL)",
        "version": [
            "3.0"
        ]
    }
}