{
    "additionDate": "2017-04-06T13:09:25Z",
    "biotoolsCURIE": "biotools:itol",
    "biotoolsID": "itol",
    "collectionID": [
        "de.NBI"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "email": "zeller@embl.de",
            "name": "Georg Zeller",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "Ivica Letunic",
            "typeEntity": "Person"
        },
        {
            "name": "European Molecular Biology Laboratory (EMBL)",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ],
            "url": "https://www.embl.de/"
        },
        {
            "name": "HD-HuB",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ],
            "url": "https://www.hd-hub.de/"
        }
    ],
    "description": "Interactive Tree Of Life (iTOL) is an online tool for the display and manipulation of phylogenetic trees. It provides a large variety of tree layouts, drawing and annotation features including circular tree layout. iTOL is well-suited for a wide range of tree sizes up to several thousand leaves. Tree displays can be exported in several graphical formats, both bitmap and vector based.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://itol.embl.de/help.cgi"
        }
    ],
    "editPermission": {
        "authors": [
            "magelm"
        ],
        "type": "group"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Phylogenetic tree",
                        "uri": "http://edamontology.org/data_0872"
                    },
                    "format": [
                        {
                            "term": "Nexus format",
                            "uri": "http://edamontology.org/format_1912"
                        },
                        {
                            "term": "newick",
                            "uri": "http://edamontology.org/format_1910"
                        },
                        {
                            "term": "phyloXML",
                            "uri": "http://edamontology.org/format_3159"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Phylogenetic tree analysis",
                    "uri": "http://edamontology.org/operation_0324"
                },
                {
                    "term": "Phylogenetic tree visualisation",
                    "uri": "http://edamontology.org/operation_0567"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Phylogenetic tree image",
                        "uri": "http://edamontology.org/data_1707"
                    },
                    "format": [
                        {
                            "term": "Image format",
                            "uri": "http://edamontology.org/format_3547"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://itol.embl.de/",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2024-02-17T14:21:20.156092Z",
    "maturity": "Mature",
    "name": "Interactive Tree Of Life (iTOL)",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "hdhub",
    "publication": [
        {
            "metadata": {
                "abstract": "Interactive Tree Of Life (http://itol.embl.de) is a web-based tool for the display, manipulation and annotation of phylogenetic trees. It is freely available and open to everyone. In addition to classical tree viewer functions, iTOL offers many novel ways of annotating trees with various additional data. Current version introduces numerous new features and greatly expands the number of supported data set types. Trees can be interactively manipulated and edited. A free personal account system is available, providing management and sharing of trees in user defined workspaces and projects. Export to various bitmap and vector graphics formats is supported. Batch access interface is available for programmatic access or inclusion of interactive trees into other web services. © 2011 The Author(s).",
                "authors": [
                    {
                        "name": "Bork P."
                    },
                    {
                        "name": "Letunic I."
                    }
                ],
                "citationCount": 1048,
                "date": "2011-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Interactive Tree of Life v2: Online annotation and display of phylogenetic trees made easy"
            },
            "pmid": "21470960"
        },
        {
            "metadata": {
                "abstract": "Summary: Interactive Tree Of Life (iTOL) is a web-based tool for the display, manipulation and annotation of phylogenetic trees. Trees can be interactively pruned and re-rooted. Various types of data such as genome sizes or protein domain repertoires can be mapped onto the tree. Export to several bitmap and vector graphics formats is supported. © 2007 Oxford University Press.",
                "authors": [
                    {
                        "name": "Bork P."
                    },
                    {
                        "name": "Letunic I."
                    }
                ],
                "citationCount": 1542,
                "date": "2007-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Interactive Tree Of Life (iTOL): An online tool for phylogenetic tree display and annotation"
            },
            "pmid": "17050570"
        },
        {
            "metadata": {
                "abstract": "© The Author(s) 2016. Published by Oxford University Press on behalf of Nucleic Acids Research.Interactive Tree Of Life (http://itol.embl.de) is a web-based tool for the display, manipulation and annotation of phylogenetic trees. It is freely available and open to everyone. The current version was completely redesigned and rewritten, utilizing current web technologies for speedy and streamlined processing. Numerous new features were introduced and several new data types are now supported. Trees with up to 100,000 leaves can now be efficiently displayed. Full interactive control over precise positioning of various annotation features and an unlimited number of datasets allow the easy creation of complex tree visualizations. iTOL 3 is the first tool which supports direct visualization of the recently proposed phylogenetic placements format. Finally, iTOL's account system has been redesigned to simplify the management of trees in user-defined workspaces and projects, as it is heavily used and currently handles already more than 500,000 trees from more than 10,000 individual users.",
                "authors": [
                    {
                        "name": "Bork P."
                    },
                    {
                        "name": "Letunic I."
                    }
                ],
                "citationCount": 2647,
                "date": "2016-07-08T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "Interactive tree of life (iTOL) v3: an online tool for the display and annotation of phylogenetic and other trees"
            },
            "pmid": "27095192"
        },
        {
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press on behalf of Nucleic Acids Research.The Interactive Tree Of Life (https://itol.embl.de) is an online tool for the display, manipulation and annotation of phylogenetic and other trees. It is freely available and open to everyone. The current version introduces four new dataset types, together with numerous new features. Annotation options have been expanded and new control options added for many display elements. An interactive spreadsheet-like editor has been implemented, providing dataset creation and editing directly in the web interface. Font support has been rewritten with full support for UTF-8 character encoding throughout the user interface. Google Web Fonts are now fully supported in the tree text labels. iTOL v4 is the first tool which supports direct visualization of Qiime 2 trees and associated annotations. The user account system has been streamlined and expanded with new navigation options, and currently handles >700 000 trees from more than 40 000 individual users. Full batch access has been implemented allowing programmatic upload and export of trees and annotations.",
                "authors": [
                    {
                        "name": "Bork P."
                    },
                    {
                        "name": "Letunic I."
                    }
                ],
                "citationCount": 1675,
                "date": "2019-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Interactive Tree of Life (iTOL) v4: Recent updates and new developments"
            },
            "pmid": "30931475",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        }
    ],
    "validated": 1,
    "version": [
        "5.0"
    ]
}
