{
    "additionDate": "2018-09-14T09:46:47Z",
    "biotoolsCURIE": "biotools:toxsign",
    "biotoolsID": "toxsign",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "frederic.chalmel@univ-rennes1.fr",
            "name": "Chalmel Frédéric",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The TOXicogenomic sIgNature (TOXsIgN) is a cross-species resource that supports online submission, storage, and retrieval of TOXicogenomic sIgNatures. TOXsIgN aims at complementing existing resources by acting as a distribution hub for the community. One of its unique features is its ability to archive heterogeneous data. TOXsIgN thus allows users to upload lists of genes positively (overexpressed for transcriptomic assays) affected and negatively (underexpressed) affected from distinct –omics experiments (e.g., transcriptomics, proteomics, or epigenomics). It also provides users with a working environment containing a powerful search engine as well as bioinformatics/biostatistics modules that enable cross-species and cross-technology signature comparisons or enrichment analyses. TOXsIgN is thus intended to serve as a warehouse for toxicogenomics and predictive toxicology tools simultaneously based on and able to analyze the overall set of signatures deposited by the community.",
    "documentation": [
        {
            "note": "Tutorial material",
            "type": "Training material",
            "url": "http://toxsign.genouest.org/app/#/tutorial"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence set",
                        "uri": "http://edamontology.org/data_0850"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Database search results",
                        "uri": "http://edamontology.org/data_2080"
                    }
                }
            ]
        }
    ],
    "homepage": "http://toxsign.genouest.org/app/#/",
    "lastUpdate": "2019-02-06T13:49:08Z",
    "maturity": "Mature",
    "name": "TOXsIgN",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "olivier.collin@irisa.fr",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/bty040",
            "metadata": {
                "abstract": "© The Author(s) 2018. Motivation At the same time that toxicologists express increasing concern about reproducibility in this field, the development of dedicated databases has already smoothed the path toward improving the storage and exchange of raw toxicogenomic data. Nevertheless, none provides access to analyzed and interpreted data as originally reported in scientific publications. Given the increasing demand for access to this information, we developed TOXsIgN, a repository for TOXicogenomic sIgNatures. Results The TOXsIgN repository provides a flexible environment that facilitates online submission, storage and retrieval of toxicogenomic signatures by the scientific community. It currently hosts 754 projects that describe more than 450 distinct chemicals and their 8491 associated signatures. It also provides users with a working environment containing a powerful search engine as well as bioinformatics/biostatistics modules that enable signature comparisons or enrichment analyses. Availability and implementation The TOXsIgN repository is freely accessible at http://toxsign.genouest.org. Website implemented in Python, JavaScript and MongoDB, with all major browsers supported. Supplementary informationSupplementary dataare available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Darde T.A."
                    },
                    {
                        "name": "Gaudriault P."
                    },
                    {
                        "name": "Beranger R."
                    },
                    {
                        "name": "Lancien C."
                    },
                    {
                        "name": "Caillarec-Joly A."
                    },
                    {
                        "name": "Sallou O."
                    },
                    {
                        "name": "Bonvallot N."
                    },
                    {
                        "name": "Chevrier C."
                    },
                    {
                        "name": "Mazaud-Guittot S."
                    },
                    {
                        "name": "Jegou B."
                    },
                    {
                        "name": "Collin O."
                    },
                    {
                        "name": "Becker E."
                    },
                    {
                        "name": "Rolland A.D."
                    },
                    {
                        "name": "Chalmel F."
                    }
                ],
                "citationCount": 4,
                "date": "2018-06-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "TOXsIgN: A cross-species repository for toxicogenomic signatures"
            }
        }
    ],
    "toolType": [
        "Web application",
        "Database portal"
    ],
    "topic": [
        {
            "term": "Toxicology",
            "uri": "http://edamontology.org/topic_2840"
        }
    ],
    "validated": 1
}