{
    "additionDate": "2017-08-20T15:14:27Z",
    "biotoolsCURIE": "biotools:beagle",
    "biotoolsID": "beagle",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "email": "browning@uw.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Beagle is a software package that performs genotype calling, genotype phasing, imputation of ungenotyped markers, and identity-by-descent segment detection.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://faculty.washington.edu/browning/beagle/beagle.html"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics",
            "sergitobara"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                }
            ]
        }
    ],
    "homepage": "https://faculty.washington.edu/browning/beagle/beagle.html",
    "language": [
        "Java"
    ],
    "lastUpdate": "2024-11-24T15:58:09.226421Z",
    "license": "GPL-3.0",
    "name": "BEAGLE",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1086/521987",
            "metadata": {
                "abstract": "Whole-genome association studies present many new statistical and computational challenges due to the large quantity of data obtained. One of these challenges is haplotype inference; methods for haplotype inference designed for small data sets from candidate-gene studies do not scale well to the large number of individuals genotyped in whole-genome association studies. We present a new method and software for inference of haplotype phase and missing data that can accurately phase data from whole-genome association studies, and we present the first comparison of haplotype-inference methods for real and simulated data sets with thousands of genotyped individuals. We find that our method outperforms existing methods in terms of both speed and accuracy for large data sets with thousands of individuals and densely spaced genetic markers, and we use our method to phase a real data set of 3,002 individuals genotyped for 490,032 markers in 3.1 days of computing time, with 99% of masked alleles imputed correctly. Our method is implemented in the Beagle software package, which is freely available. © 2007 by The American Society of Human Genetics. All rights reserved.",
                "authors": [
                    {
                        "name": "Browning B.L."
                    },
                    {
                        "name": "Browning S.R."
                    }
                ],
                "citationCount": 2326,
                "date": "2007-01-01T00:00:00Z",
                "journal": "American Journal of Human Genetics",
                "title": "Rapid and accurate haplotype phasing and missing-data inference for whole-genome association studies by use of localized haplotype clustering"
            },
            "pmcid": "PMC2265661",
            "pmid": "17924348",
            "type": [
                "Primary"
            ],
            "version": "4.1"
        },
        {
            "doi": "10.1016/j.ajhg.2015.11.020",
            "metadata": {
                "abstract": "We present a genotype imputation method that scales to millions of reference samples. The imputation method, based on the Li and Stephens model and implemented in Beagle v.4.1, is parallelized and memory efficient, making it well suited to multi-core computer processors. It achieves fast, accurate, and memory-efficient genotype imputation by restricting the probability model to markers that are genotyped in the target samples and by performing linear interpolation to impute ungenotyped variants. We compare Beagle v.4.1 with Impute2 and Minimac3 by using 1000 Genomes Project data, UK10K Project data, and simulated data. All three methods have similar accuracy but different memory requirements and different computation times. When imputing 10 Mb of sequence data from 50,000 reference samples, Beagle's throughput was more than 100× greater than Impute2's throughput on our computer servers. When imputing 10 Mb of sequence data from 200,000 reference samples in VCF format, Minimac3 consumed 26× more memory per computational thread and 15× more CPU time than Beagle. We demonstrate that Beagle v.4.1 scales to much larger reference panels by performing imputation from a simulated reference panel having 5 million samples and a mean marker density of one marker per four base pairs.",
                "authors": [
                    {
                        "name": "Browning B.L."
                    },
                    {
                        "name": "Browning S.R."
                    }
                ],
                "citationCount": 737,
                "date": "2016-01-01T00:00:00Z",
                "journal": "American Journal of Human Genetics",
                "title": "Genotype Imputation with Millions of Reference Samples"
            },
            "pmcid": "PMC4716681",
            "pmid": "26748515",
            "version": "4.1"
        },
        {
            "doi": "10.1016/j.ajhg.2018.07.015",
            "metadata": {
                "abstract": "Genotype imputation is commonly performed in genome-wide association studies because it greatly increases the number of markers that can be tested for association with a trait. In general, one should perform genotype imputation using the largest reference panel that is available because the number of accurately imputed variants increases with reference panel size. However, one impediment to using larger reference panels is the increased computational cost of imputation. We present a new genotype imputation method, Beagle 5.0, which greatly reduces the computational cost of imputation from large reference panels. We compare Beagle 5.0 with Beagle 4.1, Impute4, Minimac3, and Minimac4 using 1000 Genomes Project data, Haplotype Reference Consortium data, and simulated data for 10k, 100k, 1M, and 10M reference samples. All methods produce nearly identical accuracy, but Beagle 5.0 has the lowest computation time and the best scaling of computation time with increasing reference panel size. For 10k, 100k, 1M, and 10M reference samples and 1,000 phased target samples, Beagle 5.0's computation time is 3× (10k), 12× (100k), 43× (1M), and 533× (10M) faster than the fastest alternative method. Cost data from the Amazon Elastic Compute Cloud show that Beagle 5.0 can perform genome-wide imputation from 10M reference samples into 1,000 phased target samples at a cost of less than one US cent per sample.",
                "authors": [
                    {
                        "name": "Browning B.L."
                    },
                    {
                        "name": "Browning S.R."
                    },
                    {
                        "name": "Zhou Y."
                    }
                ],
                "citationCount": 1014,
                "date": "2018-09-06T00:00:00Z",
                "journal": "American Journal of Human Genetics",
                "title": "A One-Penny Imputed Genome from Next-Generation Reference Panels"
            },
            "pmcid": "PMC6128308",
            "pmid": "30100085",
            "version": "5.4"
        },
        {
            "doi": "10.1016/j.ajhg.2021.08.005",
            "metadata": {
                "abstract": "Haplotype phasing is the estimation of haplotypes from genotype data. We present a fast, accurate, and memory-efficient haplotype phasing method that scales to large-scale SNP array and sequence data. The method uses marker windowing and composite reference haplotypes to reduce memory usage and computation time. It incorporates a progressive phasing algorithm that identifies confidently phased heterozygotes in each iteration and fixes the phase of these heterozygotes in subsequent iterations. For data with many low-frequency variants, such as whole-genome sequence data, the method employs a two-stage phasing algorithm that phases high-frequency markers via progressive phasing in the first stage and phases low-frequency markers via genotype imputation in the second stage. This haplotype phasing method is implemented in the open-source Beagle 5.2 software package. We compare Beagle 5.2 and SHAPEIT 4.2.1 by using expanding subsets of 485,301 UK Biobank samples and 38,387 TOPMed samples. Both methods have very similar accuracy and computation time for UK Biobank SNP array data. However, for TOPMed sequence data, Beagle is more than 20 times faster than SHAPEIT, achieves similar accuracy, and scales to larger sample sizes.",
                "authors": [
                    {
                        "name": "Browning B.L."
                    },
                    {
                        "name": "Browning S.R."
                    },
                    {
                        "name": "Tian X."
                    },
                    {
                        "name": "Zhou Y."
                    }
                ],
                "citationCount": 243,
                "date": "2021-10-07T00:00:00Z",
                "journal": "American Journal of Human Genetics",
                "title": "Fast two-stage phasing of large-scale sequence data"
            },
            "pmcid": "PMC8551421",
            "pmid": "34478634",
            "version": "5.4"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        }
    ],
    "validated": 1,
    "version": [
        "5.0"
    ]
}
