{
    "additionDate": "2017-08-20T15:14:27Z",
    "biotoolsCURIE": "biotools:beagle",
    "biotoolsID": "beagle",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "email": "browning@uw.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Beagle is a software package that performs genotype calling, genotype phasing, imputation of ungenotyped markers, and identity-by-descent segment detection.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://faculty.washington.edu/browning/beagle/beagle.html"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                }
            ]
        }
    ],
    "homepage": "https://faculty.washington.edu/browning/beagle/beagle.html",
    "language": [
        "Java"
    ],
    "lastUpdate": "2019-09-04T08:37:55Z",
    "license": "GPL-3.0",
    "name": "BEAGLE",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1086/521987",
            "metadata": {
                "abstract": "Whole-genome association studies present many new statistical and computational challenges due to the large quantity of data obtained. One of these challenges is haplotype inference; methods for haplotype inference designed for small data sets from candidate-gene studies do not scale well to the large number of individuals genotyped in whole-genome association studies. We present a new method and software for inference of haplotype phase and missing data that can accurately phase data from whole-genome association studies, and we present the first comparison of haplotype-inference methods for real and simulated data sets with thousands of genotyped individuals. We find that our method outperforms existing methods in terms of both speed and accuracy for large data sets with thousands of individuals and densely spaced genetic markers, and we use our method to phase a real data set of 3,002 individuals genotyped for 490,032 markers in 3.1 days of computing time, with 99% of masked alleles imputed correctly. Our method is implemented in the Beagle software package, which is freely available. © 2007 by The American Society of Human Genetics. All rights reserved.",
                "authors": [
                    {
                        "name": "Browning S.R."
                    },
                    {
                        "name": "Browning B.L."
                    }
                ],
                "citationCount": 1178,
                "date": "2007-01-01T00:00:00Z",
                "journal": "American Journal of Human Genetics",
                "title": "Rapid and accurate haplotype phasing and missing-data inference for whole-genome association studies by use of localized haplotype clustering"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        }
    ],
    "validated": 1,
    "version": [
        "5.0"
    ]
}