{
    "additionDate": "2021-06-14T13:25:14Z",
    "biotoolsCURIE": "biotools:aramis",
    "biotoolsID": "aramis",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "baguado@cbm.csis.es",
            "name": "B Aguado",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Accurate long-Reads Assembly correction Method for Indel errorS (ARAMIS) is a NGS long-reads indels correction pipeline that combines several correction software in just one step using accurate short reads. As a proof OF concept, six organisms were selected based on their different GC content, size and genome complexity, and their PacBio-assembled genomes were corrected thoroughly by this pipeline.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                },
                {
                    "term": "Indel detection",
                    "uri": "http://edamontology.org/operation_0452"
                },
                {
                    "term": "Sequencing error detection",
                    "uri": "http://edamontology.org/operation_3195"
                }
            ]
        }
    ],
    "homepage": "https://github.com/genomics-ngsCBMSO/ARAMIS.git",
    "language": [
        "Python",
        "R",
        "Shell"
    ],
    "lastUpdate": "2024-11-24T20:20:33.301966Z",
    "name": "ARAMIS",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/bib/bbab170",
            "metadata": {
                "abstract": "NGS long-reads sequencing technologies (or third generation) such as Pacific BioSciences (PacBio) have revolutionized the sequencing field over the last decade improving multiple genomic applications like de novo genome assemblies. However, their error rate, mostly involving insertions and deletions (indels), is currently an important concern that requires special attention to be solved. Multiple algorithms are available to fix these sequencing errors using short reads (such as Illumina), although they require long processing times and some errors may persist. Here, we present Accurate long-Reads Assembly correction Method for Indel errorS (ARAMIS), the first NGS long-reads indels correction pipeline that combines several correction software in just one step using accurate short reads. As a proof OF concept, six organisms were selected based on their different GC content, size and genome complexity, and their PacBio-assembled genomes were corrected thoroughly by this pipeline. We found that the presence of systematic sequencing errors in long-reads PacBio sequences affecting homopolymeric regions, and that the type of indel error introduced during PacBio sequencing are related to the GC content of the organism. The lack of knowledge of this fact leads to the existence of numerous published studies where such errors have been found and should be resolved since they may contain incorrect biological information. ARAMIS yields better results with less computational resources needed than other correction tools and gives the possibility of detecting the nature of the found indel errors found and its distribution along the genome. The source code of ARAMIS is available at https://github.com/genomics-ngsCBMSO/ARAMIS.git",
                "authors": [
                    {
                        "name": "Aguado B."
                    },
                    {
                        "name": "Amils R."
                    },
                    {
                        "name": "Berenguer J."
                    },
                    {
                        "name": "Carrasco-Ramiro F."
                    },
                    {
                        "name": "Gonzalez-De La Fuente S."
                    },
                    {
                        "name": "Peiro-Pastor R."
                    },
                    {
                        "name": "Requena J.M."
                    },
                    {
                        "name": "Sacristan-Horcajada E."
                    }
                ],
                "citationCount": 11,
                "date": "2021-11-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "ARAMIS: From systematic errors of NGS long reads to accurate assemblies"
            },
            "pmcid": "PMC8574707",
            "pmid": "34013348"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
