{
    "name": "HCsnip", 
    "description": "Decompose given hierarchical clustering tree into non-overlapping clusters in a semi-supervised way by using available patients follow-up information as guidance. Contains functions for snipping HC tree, various cluster quality evaluation criteria, assigning new patients to one of the two given HC trees, testing the significance of clusters with permutation argument and clusters visualization using sample's molecular entropy.", 
    "homepage": "http://bioconductor.org/packages/release/bioc/html/HCsnip.html", 
    "biotoolsID": "hcsnip", 
    "biotoolsCURIE": "biotools:hcsnip", 
    "version": [
        "1.14.0"
    ], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3432", 
                    "term": "Clustering"
                }
            ], 
            "input": [
                {
                    "data": {
                        "uri": "http://edamontology.org/data_0928", 
                        "term": "Gene expression profile"
                    }, 
                    "format": [
                        {
                            "uri": "http://edamontology.org/format_2058", 
                            "term": "Gene expression report format"
                        }
                    ]
                }
            ], 
            "output": [
                {
                    "data": {
                        "uri": "http://edamontology.org/data_1772", 
                        "term": "Score"
                    }, 
                    "format": [
                        {
                            "uri": "http://edamontology.org/format_2330", 
                            "term": "Textual format"
                        }, 
                        {
                            "uri": "http://edamontology.org/format_3547", 
                            "term": "Image format"
                        }
                    ]
                }, 
                {
                    "data": {
                        "uri": "http://edamontology.org/data_2884", 
                        "term": "Plot"
                    }, 
                    "format": [
                        {
                            "uri": "http://edamontology.org/format_2330", 
                            "term": "Textual format"
                        }, 
                        {
                            "uri": "http://edamontology.org/format_3547", 
                            "term": "Image format"
                        }
                    ]
                }
            ], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool", 
        "Library"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0203", 
            "term": "Gene expression"
        }, 
        {
            "uri": "http://edamontology.org/topic_2640", 
            "term": "Oncology"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "R"
    ], 
    "license": "GPL-2.0", 
    "collectionID": [
        "BioConductor"
    ], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [
        {
            "url": "http://bioconductor/packages/release/bioc/src/contrib/HCsnip_1.14.0.tar.gz", 
            "type": "Source code", 
            "note": null, 
            "version": null
        }
    ], 
    "documentation": [
        {
            "url": "http://bioconductor.org/packages/release/bioc/html/HCsnip.html", 
            "type": "Manual", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1186/s12859-014-0448-1", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "Semi-supervised adaptive-height snipping of the hierarchical clustering tree", 
                "abstract": "© Obulkasim et al.; licensee BioMed Central.In genomics, hierarchical clustering (HC) is a popular method for grouping similar samples based on a distance measure. HC algorithms do not actually create clusters, but compute a hierarchical representation of the data set. Usually, a fixed height on the HC tree is used, and each contiguous branch of samples below that height is considered a separate cluster. Due to the fixed-height cutting, those clusters may not unravel significant functional coherence hidden deeper in the tree. Besides that, most existing approaches do not make use of available clinical information to guide cluster extraction from the HC. Thus, the identified subgroups may be difficult to interpret in relation to that information. Results: We develop a novel framework for decomposing the HC tree into clusters by semi-supervised piecewise snipping. The framework, called guided piecewise snipping, utilizes both molecular data and clinical information to decompose the HC tree into clusters. It cuts the given HC tree at variable heights to find a partition (a set of non-overlapping clusters) which does not only represent a structure deemed to underlie the data from which HC tree is derived, but is also maximally consistent with the supplied clinical data. Moreover, the approach does not require the user to specify the number of clusters prior to the analysis. Extensive results on simulated and multiple medical data sets show that our approach consistently produces more meaningful clusters than the standard fixed-height cut and/or non-guided approaches. Conclusions: The guided piecewise snipping approach features several novelties and advantages over existing approaches. The proposed algorithm is generic, and can be combined with other algorithms that operate on detected clusters. This approach represents an advancement in several regards: (1) a piecewise tree snipping framework that efficiently extracts clusters by snipping the HC tree possibly at variable heights while preserving the HC tree structure; (2) a flexible implementation allowing a variety of data types for both building and snipping the HC tree, including patient follow-up data like survival as auxiliary information.", 
                "date": "2015-01-16T00:00:00Z", 
                "citationCount": 2, 
                "authors": [
                    {
                        "name": "Obulkasim A."
                    }, 
                    {
                        "name": "Meijer G.A."
                    }, 
                    {
                        "name": "van de Wiel M.A."
                    }
                ], 
                "journal": "BMC Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": "Askar Obulkasim", 
            "email": "askar703@gmail.com", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "bioconductor_import", 
    "additionDate": "2017-01-17T14:57:21Z", 
    "lastUpdate": "2018-12-10T12:58:54Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 1, 
    "elixir_badge": 0
}