{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.wur.nl/en/contact_form.htm?contactpersonid=4869"}],"documentation":[{"type":"GENERAL","url":"http://www.wur.nl/en/show/RECORD.htm"}],"function":[{"operation":[{"term":"Recombination detection","uri":"http://edamontology.org/operation_0451"}]}],"labels":{"operatingSystem":["Windows"],"toolType":["Desktop application"],"topic":[{"term":"Mapping","uri":"http://edamontology.org/topic_0102"},{"term":"Genetics","uri":"http://edamontology.org/topic_3053"},{"term":"DNA replication and recombination","uri":"http://edamontology.org/topic_3127"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/record-2-0-arranging-markers-linear-order.html"}],"publication":[{"abstract":"A new method, REcombination Counting and ORDering (RECORD) is presented for the ordering of loci on genetic linkage maps. The method minimizes the total number of recombination events. The search algorithm is a heuristic procedure, combining elements of branch-and-bound with local reshuffling. Since the criterion we propose does not require intensive calculations, the algorithm rapidly produces an optimal ordering as well as a series of near-optimal ones. The latter provides insight into the local certainty of ordering along the map. A simulation study was performed to compare the performance of RECORD and JoinMap. RECORD is much faster and less sensitive to missing observations and scoring errors, since the optimisation criterion is less dependent on the position of the erroneous markers. In particular, RECORD performs better in regions of the map with high marker density. The implications of high marker densities on linkage map construction are discussed. © Springer-Verlag 2005.","authors":["Van Os H.","Stam P.","Visser R.G.F.","Van Eck H.J."],"cit_count":166,"journal":"Theoretical and Applied Genetics","pmid":"16228189","title":"RECORD: A novel method for ordering loci on a genetic linkage map","year":"2005-12-01"}],"summary":{"biotoolsCURIE":"biotools:record","biotoolsID":"record","description":"\"REcombination Counting and ORDering\" can be used for the ordering of loci on genetic linkage maps. The method minimises the total number of recombination events. The search algorithm is a heuristic procedure, combining elements of branch-and-bound with local reshuffling.","homepage":"http://www.wageningenur.nl/en/show/RECORD.htm","name":"Record"}}