{
    "additionDate": "2017-08-20T16:29:55Z",
    "biotoolsCURIE": "biotools:ocsestdb",
    "biotoolsID": "ocsestdb",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "email": "liusy@oilcrop.cn",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Developed to provide users a comprehansive seed expression sequence tags database of oil crops for comparative analysis. In ocsEASTdb, it provided ESTs and unigenes detail information of four oil crop species, A.hypogaea, B.napus (high or low oil), G.max, S.indicum.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://ocri-genomics.org/ocsESTdb/manual.htm"
        }
    ],
    "download": [
        {
            "type": "Biological data",
            "url": "http://ocri-genomics.org/ocsESTdb/download.htm"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                },
                {
                    "term": "Sequence annotation",
                    "uri": "http://edamontology.org/operation_0361"
                },
                {
                    "term": "Sequence clustering",
                    "uri": "http://edamontology.org/operation_0291"
                }
            ]
        }
    ],
    "homepage": "http://ocri-genomics.org/ocsESTdb/",
    "language": [
        "JavaScript",
        "Perl",
        "Python",
        "SQL"
    ],
    "lastUpdate": "2020-01-19T17:47:47Z",
    "license": "Not licensed",
    "name": "ocsESTdb",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1186/s12870-014-0399-8",
            "metadata": {
                "abstract": "© 2015 Ke et al.; licensee BioMed Central.Background: Oil crop seeds are important sources of fatty acids (FAs) for human and animal nutrition. Despite their importance, there is a lack of an essential bioinformatics resource on gene transcription of oil crops from a comparative perspective. In this study, we developed ocsESTdb, the first database of expressed sequence tag (EST) information on seeds of four large-scale oil crops with an emphasis on global metabolic networks and oil accumulation metabolism that target the involved unigenes. Description: A total of 248,522 ESTs and 106,835 unigenes were collected from the cDNA libraries of rapeseed (Brassica napus), soybean (Glycine max), sesame (Sesamum indicum) and peanut (Arachis hypogaea). These unigenes were annotated by a sequence similarity search against databases including TAIR, NR protein database, Gene Ontology, COG, Swiss-Prot, TrEMBL and Kyoto Encyclopedia of Genes and Genomes (KEGG). Five genome-scale metabolic networks that contain different numbers of metabolites and gene-enzyme reaction-association entries were analysed and constructed using Cytoscape and yEd programs. Details of unigene entries, deduced amino acid sequences and putative annotation are available from our database to browse, search and download. Intuitive and graphical representations of EST/unigene sequences, functional annotations, metabolic pathways and metabolic networks are also available. ocsESTdb will be updated regularly and can be freely accessed at http://ocri-genomics.org/ocsESTdb/ . Conclusion: ocsESTdb may serve as a valuable and unique resource for comparative analysis of acyl lipid synthesis and metabolism in oilseed plants. It also may provide vital insights into improving oil content in seeds of oil crop species by transcriptional reconstruction of the metabolic network.",
                "authors": [
                    {
                        "name": "Dong C."
                    },
                    {
                        "name": "Hua W."
                    },
                    {
                        "name": "Ke T."
                    },
                    {
                        "name": "Liu S."
                    },
                    {
                        "name": "Mao H."
                    },
                    {
                        "name": "Yu J."
                    }
                ],
                "citationCount": 6,
                "date": "2015-01-21T00:00:00Z",
                "journal": "BMC Plant Biology",
                "title": "ocsESTdb: A database of oil crop seed EST sequences for comparative analysis and investigation of a global metabolic network and oil accumulation metabolism"
            },
            "pmcid": "PMC4312456",
            "pmid": "25604238",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}
