{
    "additionDate": "2021-01-18T09:54:04Z",
    "biotoolsCURIE": "biotools:metabcc-lr",
    "biotoolsID": "metabcc-lr",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "anuradha.wickramarachchi@anu.edu.au",
            "name": "Anuradha Wickramarachchi",
            "typeEntity": "Person"
        },
        {
            "email": "yu.lin@anu.edu.au",
            "name": "Yu Lin",
            "typeEntity": "Person"
        }
    ],
    "description": "Metagenomics binning by coverage and composition for long reads.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Read binning",
                    "uri": "http://edamontology.org/operation_3798"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "k-mer counting",
                    "uri": "http://edamontology.org/operation_3472"
                }
            ]
        }
    ],
    "homepage": "https://github.com/anuradhawick/MetaBCC-LR",
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2021-02-22T07:22:07Z",
    "license": "GPL-2.0",
    "name": "MetaBCC-LR",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA441",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press.Motivation: Metagenomics studies have provided key insights into the composition and structure of microbial communities found in different environments. Among the techniques used to analyse metagenomic data, binning is considered a crucial step to characterize the different species of micro-organisms present. The use of short-read data in most binning tools poses several limitations, such as insufficient species-specific signal, and the emergence of long-read sequencing technologies offers us opportunities to surmount them. However, most current metagenomic binning tools have been developed for short reads. The few tools that can process long reads either do not scale with increasing input size or require a database with reference genomes that are often unknown. In this article, we present MetaBCC-LR, a scalable reference-free binning method which clusters long reads directly based on their k-mer coverage histograms and oligonucleotide composition. Results: We evaluate MetaBCC-LR on multiple simulated and real metagenomic long-read datasets with varying coverages and error rates. Our experiments demonstrate that MetaBCC-LR substantially outperforms state-of-the-art reference-free binning tools, achieving ∼13% improvement in F1-score and ∼30% improvement in ARI compared to the best previous tools. Moreover, we show that using MetaBCC-LR before long-read assembly helps to enhance the assembly quality while significantly reducing the assembly cost in terms of time and memory usage. The efficiency and accuracy of MetaBCC-LR pave the way for more effective long-read-based metagenomics analyses to support a wide range of applications. Availability and implementation: The source code is freely available at: https://github.com/anuradhawick/MetaBCC-LR.",
                "authors": [
                    {
                        "name": "Lin Y."
                    },
                    {
                        "name": "Mallawaarachchi V."
                    },
                    {
                        "name": "Rajan V."
                    },
                    {
                        "name": "Wickramarachchi A."
                    }
                ],
                "citationCount": 2,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "MetaBCC-LR: Metagenomics binning by coverage and composition for long reads"
            },
            "pmcid": "PMC7355282",
            "pmid": "32657364"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
