{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:23:44Z",
    "biotoolsCURIE": "biotools:RDXplorer",
    "biotoolsID": "RDXplorer",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "makarovv@gmail.com",
            "name": "Makarov V.",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "> TOOL (matuskalas) | Comprehensively benchmarking applications for detecting copy number variation | The RDXplorer is a computational tool for copy number variants (CNV) detection in whole human genome sequence data using read depth (RD) coverage. CNV detection is based on the Event-Wise Testing (EWT) algorithm recently published by our group\nNote: (matuskalas): Lumpy (or lumpy-sv) is a completely different tool, atm missing in bio.tools (https://github.com/arq5x/lumpy-sv)",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://rdxplorer.sourceforge.net/"
        }
    ],
    "download": [
        {
            "type": "Software package",
            "url": "https://sourceforge.net/projects/rdxplorer/files/latest/download"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Read depth analysis",
                    "uri": "http://edamontology.org/operation_3230"
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/projects/rdxplorer/",
    "language": [
        "R",
        "Python"
    ],
    "lastUpdate": "2021-01-07T11:58:51Z",
    "license": "Other",
    "maturity": "Emerging",
    "name": "RDXplorer",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1007069",
            "metadata": {
                "abstract": "© 2019 Zhang et al.Motivation: Recently, copy number variation (CNV) has gained considerable interest as a type of genomic variation that plays an important role in complex phenotypes and disease susceptibility. Since a number of CNV detection methods have recently been developed, it is necessary to help investigators choose suitable methods for CNV detection depending on their objectives. For this reason, this study compared ten commonly used CNV detection applications, including CNVnator, ReadDepth, RDXplorer, LUMPY and Control-FREEC, benchmarking the applications by sensitivity, specificity and computational demands. Taking the DGV gold standard variants as a standard dataset, we evaluated the ten applications with real sequencing data at sequencing depths from 5X to 50X. Among the ten methods benchmarked, LUMPY performs the best for both high sensitivity and specificity at each sequencing depth. For the purpose of high specificity, Canvas is also a good choice. If high sensitivity is preferred, CNVnator and RDXplorer are better choices. Additionally, CNVnator and GROM-RD perform well for low-depth sequencing data. Our results provide a comprehensive performance evaluation for these selected CNV detection methods and facilitate future development and improvement in CNV prediction methods.",
                "authors": [
                    {
                        "name": "Zhang L."
                    },
                    {
                        "name": "Bai W."
                    },
                    {
                        "name": "Yuan N."
                    },
                    {
                        "name": "Du Z."
                    }
                ],
                "citationCount": 14,
                "date": "2019-01-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Comprehensively benchmarking applications for detecting copy number variation"
            },
            "pmcid": "PMC6555534",
            "pmid": "31136576",
            "type": [
                "Benchmarking study"
            ]
        },
        {
            "metadata": {
                "abstract": "Methods for the direct detection of copy number variation (CNV) genome-wide have become effective instruments for identifying genetic risk factors for disease. The application of next-generation sequencing platforms to genetic studies promises to improve sensitivity to detect CNVs as well as inversions, indels, and SNPs. New computational approaches are needed to systematically detect these variants from genome sequence data. Existing sequence-based approaches for CNV detection are primarily based on paired-end read mapping (PEM) as reported previously by Tuzun et al. and Korbel et al. Due to limitations of the PEM approach, some classes of CNVs are difficult to ascertain, including large insertions and variants located within complex genomic regions. To overcome these limitations, we developed a method for CNV detection using read depth of coverage. Event-wise testing (EWT) is a method based on significance testing. In contrast to standard segmentation algorithms that typically operate by performing likelihood evaluation for every point in the genome, EWT works on intervals of data points, rapidly searching for specific classes of events. Overall false-positive rate is controlled by testing the significance of each possible event and adjusting for multiple testing. Deletions and duplications detected in an individual genome by EWT are examined across multiple genomes to identify polymorphism between individuals. We estimated error rates using simulations based on real data, and we applied EWT to the analysis of chromosome 1 from paired-end shotgun sequence data (303) on five individuals. Our results suggest that analysis of read depth is an effective approach for the detection of CNVs, and it captures structural variants that are refractory to established PEM-based methods. © 2009 by Cold Spring Harbor Laboratory Press.",
                "authors": [
                    {
                        "name": "Yoon S."
                    },
                    {
                        "name": "Xuan Z."
                    },
                    {
                        "name": "Makarov V."
                    },
                    {
                        "name": "Ye K."
                    },
                    {
                        "name": "Sebat J."
                    }
                ],
                "citationCount": 395,
                "date": "2009-09-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "Sensitive and accurate detection of copy number variants using read depth of coverage"
            },
            "pmid": "19657104",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ],
    "validated": 1
}