{
    "additionDate": "2020-01-14T20:00:50Z",
    "biotoolsCURIE": "biotools:pathway",
    "biotoolsID": "pathway",
    "confidence_flag": "tool",
    "description": "Software for pathway/genome informatics and systems biology.\n\nThe Pathway Tools software performs computational genomics, metabolic reconstruction and modeling, and analysis of gene-expression and metabolomics data.\n\nPathway Tools is a comprehensive systems biology software system that is associated with the BioCyc database collection. The software has been licensed by more than 10,000 groups and powers a number of websites for biological databases. Pathway Tools integrates a broad set of capabilities that span genome informatics, pathway informatics, regulatory informatics, and omics data analysis. The software supports multiple use cases in bioinformatics and systems biology:.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                },
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                }
            ]
        }
    ],
    "homepage": "http://pathwaytools.com",
    "lastUpdate": "2021-01-05T09:40:23Z",
    "name": "pathway",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIB/BBZ104",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.MOTIVATION: Biological systems function through dynamic interactions among genes and their products, regulatory circuits and metabolic networks. Our development of the Pathway Tools software was motivated by the need to construct biological knowledge resources that combine these many types of data, and that enable users to find and comprehend data of interest as quickly as possible through query and visualization tools. Further, we sought to support the development of metabolic flux models from pathway databases, and to use pathway information to leverage the interpretation of high-throughput data sets. RESULTS: In the past 4 years we have enhanced the already extensive Pathway Tools software in several respects. It can now support metabolic-model execution through the Web, it provides a more accurate gap filler for metabolic models; it supports development of models for organism communities distributed across a spatial grid; and model results may be visualized graphically. Pathway Tools supports several new omics-data analysis tools including the Omics Dashboard, multi-pathway diagrams called pathway collages, a pathway-covering algorithm for metabolomics data analysis and an algorithm for generating mechanistic explanations of multi-omics data. We have also improved the core pathway/genome databases management capabilities of the software, providing new multi-organism search tools for organism communities, improved graphics rendering, faster performance and re-designed gene and metabolite pages. AVAILABILITY: The software is free for academic use; a fee is required for commercial use. See http://pathwaytools.com. CONTACT: pkarp@ai.sri.com. SUPPLEMENTARY INFORMATION: Supplementary data are available at Briefings in Bioinformatics online.",
                "authors": [
                    {
                        "name": "Karp P.D."
                    },
                    {
                        "name": "Midford P.E."
                    },
                    {
                        "name": "Billington R."
                    },
                    {
                        "name": "Kothari A."
                    },
                    {
                        "name": "Krummenacker M."
                    },
                    {
                        "name": "Latendresse M."
                    },
                    {
                        "name": "Ong W.K."
                    },
                    {
                        "name": "Subhraveti P."
                    },
                    {
                        "name": "Caspi R."
                    },
                    {
                        "name": "Fulcher C."
                    },
                    {
                        "name": "Keseler I.M."
                    },
                    {
                        "name": "Paley S.M."
                    }
                ],
                "citationCount": 2,
                "date": "2021-01-18T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "Pathway Tools version 23.0 update: software for pathway/genome informatics and systems biology"
            },
            "pmid": "31813964"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}