{
    "additionDate": "2019-11-14T19:34:08Z",
    "biotoolsCURIE": "biotools:CCMP",
    "biotoolsID": "CCMP",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hayoun@usc.edu",
            "name": "Ha Youn Lee",
            "typeEntity": "Person"
        }
    ],
    "description": "Software-as-a-service approach for fully-automated microbiome profiling | Microbiome profiling holds great promise for the development of novel disease biomarkers and therapeutics. Next-generation sequencing is currently the preferred method for microbiome data collection and multiple standardized tools, packages, and pipelines have been developed for the purpose of raw data processing and microbial annotation. However, these currently available pipelines come with entry-level barriers such as high-performance hardware, software installation, and sequential command-line scripting that often deter end-users. We thus created Cloud Computing for Microbiome Profiling (CCMP, https: ccmp.usc.edu), a public cloud-based web tool which combines the analytical power of current microbiome analysis platforms with a user-friendly interface",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://ccmp.usc.edu",
    "lastUpdate": "2020-12-10T14:36:27Z",
    "name": "CCMP",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.YJBINX.2019.100040",
            "metadata": {
                "abstract": "© 2019Microbiome profiling holds great promise for the development of novel disease biomarkers and therapeutics. Next-generation sequencing is currently the preferred method for microbiome data collection and multiple standardized tools, packages, and pipelines have been developed for the purpose of raw data processing and microbial annotation. However, these currently available pipelines come with entry-level barriers such as high-performance hardware, software installation, and sequential command-line scripting that often deter end-users. We thus created Cloud Computing for Microbiome Profiling (CCMP, https://ccmp.usc.edu), a public cloud-based web tool which combines the analytical power of current microbiome analysis platforms with a user-friendly interface. CCMP is a free-of-charge software-as-a-service (SaaS) that simplifies user experience by enabling users to complete their analysis in a single step, uploading raw sequencing data files. Once users upload 16S ribosomal RNA gene sequence data, our pipeline performs taxonomic annotation, abundance profiling, and statistical tests to report microbiota signatures altered by diseases or experimental conditions. CCMP took a 125 gigabyte (GB) input of 16S ribosomal RNA gene sequence data from 1052 specimens in FASTQ format and reported figures and tables of taxonomic annotations, statistical tests, α and β diversity calculations, and principal coordinate analyses within 21 h. CCMP is the first fully-automated web interface that integrates three key solutions for large-scale data analysis: cloud computing, fast file transfer technology, and microbiome analysis tools. As a reliable platform that supplies consistent microbiome analysis, CCMP will advance microbiome research by making effortful bioinformatics easily accessible to public.",
                "authors": [
                    {
                        "name": "Park S.Y."
                    },
                    {
                        "name": "Nanda S."
                    },
                    {
                        "name": "Faraci G."
                    },
                    {
                        "name": "Park Y."
                    },
                    {
                        "name": "Lee H.Y."
                    }
                ],
                "citationCount": 2,
                "date": "2019-06-01T00:00:00Z",
                "journal": "Journal of Biomedical Informatics: X",
                "title": "CCMP: Software-as-a-service approach for fully-automated microbiome profiling"
            },
            "pmcid": "PMC6719681",
            "pmid": "31482150"
        }
    ],
    "topic": [
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        }
    ],
    "validated": 1
}