
{
    "credit": [
        {
            "email": "gibbs@brown.edu",
            "name": "Gibbs Motif Sampler Team",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "http://ccmbweb.ccv.brown.edu/gibbs/bernoulli.html"
        },
        {
            "type": "GENERAL",
            "url": "http://ccmbweb.ccv.brown.edu/gibbs/web_help_text.Gibbs_versions.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence motif recognition",
                    "uri": "http://edamontology.org/operation_0239"
                },
                {
                    "term": "Transcription factor binding site prediction",
                    "uri": "http://edamontology.org/operation_0445"
                },
                {
                    "term": "Transcriptional regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0438"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Transcription factors and regulatory sites",
                "uri": "http://edamontology.org/topic_0749"
            },
            {
                "term": "Sequence sites, features and motifs",
                "uri": "http://edamontology.org/topic_0160"
            },
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "Protein structural motifs and surfaces",
                "uri": "http://edamontology.org/topic_0166"
            },
            {
                "term": "Nucleic acid sites, features and motifs",
                "uri": "http://edamontology.org/topic_3511"
            }
        ]
    },
    "publication": [
        {
            "abstract": "The Gibbs Motif Sampler is a software package for locating common elements in collections of biopolymer sequences. In this paper we describe a new variation of the Gibbs Motif Sampler, the Gibbs Recursive Sampler, which has been developed specifically for locating multiple transcription factor binding sites for multiple transcription factors simultaneously in unaligned DNA sequences that may be heterogeneous in DNA composition. Here we describe the basic operation of the web-based version of this sampler. The sampler may be accessed at http://bayesweb.wadsworth.org/gibbs/gibbs.html and at http://www.bioinfo.rpi.edu/applications/bayesian/gibbs/gibbs.html. An online user guide is available at http://bayesweb.wadsworth.org/gibbs/bernoulli.html and at Solaris, Solaris.x86 and Linux versions of the sampler are available as stand-alone programs for academic and not-for-profit users. Commercial licenses are also available. The Gibbs Recursive Sampler is distributed in accordance with the ISCB level 0 guidelines and a requirement for citation of use in scientific publications.",
            "authors": [
                "Thompson W.",
                "Rouchka E.C.",
                "Lawrence C.E."
            ],
            "cit_count": 232,
            "journal": "Nucleic Acids Research",
            "pmid": "12824370",
            "title": "Gibbs Recursive Sampler: Finding transcription factor binding sites",
            "year": "2003-07-01"
        },
        {
            "abstract": "The detection and alignment of locally conserved regions (motifs) in multiple sequences can provide insight into protein structure, function, and evolution. A new Gibbs sampling algorithm is described that detects motif‐encoding regions in sequences and optimally partitions them into distinct motif models; this is illustrated using a set of immunoglobulin fold proteins. When applied to sequences sharing a single motif, the sampler can be used to classify motif regions into related submodels, as is illustrated using helix‐turn‐helix DNA‐binding proteins. Other statistically based procedures are described for searching a database for sequences matching motifs found by the sampler. When applied to a set of 32 very distantly related bacterial integral outer membrane proteins, the sampler revealed that they share a subtle, repetitive motif. Although BLAST (Altschul SF et al., 1990, J Mol Biol 215:403–410) fails to detect significant pairwise similarity between any of the sequences, the repeats present in these outer membrane proteins, taken as a whole, are highly significant (based on a generally applicable statistical test for motifs described here). Analysis of bacterial porins with known trimeric β‐barrel structure and related proteins reveals a similar repetitive motif corresponding to alternating membrane‐spanning β‐strands. These β‐strands occur on the membrane interface (as opposed to the trimeric interface) of the β‐barrel. The broad conservation and structural location of these repeats suggests that they play important functional roles. Copyright © 1995 The Protein Society",
            "authors": [
                "Neuwald A.F.",
                "Liu J.S.",
                "Lawrence C.E."
            ],
            "cit_count": 310,
            "journal": "Protein Science",
            "pmid": "8520488",
            "title": "Gibbs motif sampling: Detection of bacterial outer membrane protein repeats",
            "year": "1995-01-01"
        },
        {
            "abstract": "The Gibbs Centroid Sampler is a software package designed for locating conserved elements in biopolymer sequences. The Gibbs Centroid Sampler reports a centroid alignment, i.e. an alignment that has the minimum total distance to the set of samples chosen from the a posteriori probability distribution of transcription factor binding-site alignments. In so doing, it garners information from the full ensemble of solutions, rather than only the single most probable point that is the target of many motif-finding algorithms, including its predecessor, the Gibbs Recursive Sampler. Centroid estimators have been shown to yield substantial improvements, in both sensitivity and positive predictive values, to the prediction of RNA secondary structure and motif finding. The Gibbs Centroid Sampler, along with interactive tutorials, an online user manual, and information on downloading the software, is available at: http://bayesweb.wadsworth.org/gibbs/gibbs.html. © 2007 The Author(s).",
            "authors": [
                "Thompson W.A.",
                "Newberg L.A.",
                "Conlan S.",
                "McCue L.A.",
                "Lawrence C.E."
            ],
            "cit_count": 39,
            "journal": "Nucleic Acids Research",
            "pmid": "17483517",
            "title": "The gibbs centroid sampler",
            "year": "2007-07-01"
        },
        {
            "abstract": "Toward the goal of identifying complete sets of transcription factor (TF)-binding sites in the genomes of several gamma proteobacteria, and hence describing their transcription regulatory networks, we present a phylogenetic footprinting method for identifying these sites. Probable transcription regulatory sites upstream of Escherichia coli genes were identified by cross-species comparison using an extended Gibbs sampling algorithm. Close examination of a study set of 184 genes with documented transcription regulatory sites revelead that when orthologous data were available from at least two other gamma proteobacterial species, 81% of our predictions corresponded with the documented sites, and 67% corresponded when data from only one other species were available. That the remaining predictions included bona fide TF-binding sites was proven by affinity purification of a putative transcription factor (YijC) bound to such a site upstream of the fabA gene. Predicted regulatory sites for 2097 E.coli genes are available at http://www.wadsworth.org/ resnres/bioinfo/.",
            "authors": [
                "McCue L.A.",
                "Thompson W.",
                "Carmack C.S.",
                "Ryan M.P.",
                "Liu J.S.",
                "Derbyshire V.",
                "Lawrence C.E."
            ],
            "cit_count": 202,
            "journal": "Nucleic Acids Research",
            "pmid": "11160901",
            "title": "Phylogenetic footprinting of transcription factor binding sites in proteobacterial genomes",
            "year": "2001-02-01"
        },
        {
            "abstract": "A wealth of protein and DNA sequence data is being generated by genome projects and other sequencing efforts. A crucial barrier to deciphering these sequences and understanding the relations among them is the difficulty of detecting subtle local residue patterns common to multiple sequences. Such patterns frequently reflect similar molecular structures and biological properties. A mathematical definition of this \"local multiple alignment\" problem suitable for full computer automation has been used to develop a new and sensitive algorithm, based on the statistical method of iterative sampling. This algorithm finds an optimized local alignment model for N sequences in N-linear time, requiring only seconds on current workstations, and allows the simultaneous detection and optimization of multiple patterns and pattern repeats. The method is illustrated as applied to helixturn-helix proteins, lipocalins, and prenyltransferases.",
            "authors": [
                "Lawrence C.E.",
                "Altschul S.F.",
                "Boguski M.S.",
                "Liu J.S.",
                "Neuwald A.F.",
                "Wootton J.C."
            ],
            "cit_count": 1342,
            "journal": "Science",
            "pmid": "8211139",
            "title": "Detecting subtle sequence signals: A gibbs sampling strategy for multiple alignment",
            "year": "1993-01-01"
        },
        {
            "abstract": "Elucidating the human transcriptional regulatory network is a challenge of the post-genomic era. Technical progress so far is impressive, including detailed understanding of regulatory mechanisms for at least a few genes in multicellular organisms, rapid and precise localization of regulatory regions within extensive regions of DNA by means of cross-species comparison, and de novo determination of transcription-factor binding specificities from large-scale yeast expression data. Here we address two problems involved in extending these results to the human genome: first, it has been unclear how many model organism genomes will be needed to delineate most regulatory regions; and second, the discovery of transcription-factor binding sites (response elements) from expression data has not yet been generalized from single-celled organisms to multicellular organisms. We found that 98% (74/75) of experimentally defined sequence-specific binding sites of skeletal-muscle-specific transcription factors are confined to the 19% of human sequences that are most conserved in the orthologous rodent sequences. Also we found that in using this restriction, the binding specificities of all three major muscle-specific transcription factors (MYF, SRF and MEF2) can be computationally identified.",
            "authors": [
                "Wasserman W.W.",
                "Palumbo M.",
                "Thompson W.",
                "Fickett J.W.",
                "Lawrence C.E."
            ],
            "cit_count": 372,
            "journal": "Nature Genetics",
            "pmid": "11017083",
            "title": "Human-mouse genome comparisons to locate regulatory sites",
            "year": "2000-10-01"
        },
        {
            "abstract": "Clusters of transcription factor binding sites (TFBSs) which direct gene expression constitute cis-regulatory modules (CRMs). We present a novel algorithm, based on Gibbs sampling, which locates, de novo, the cis features of these CRMs, their component TFBSs, and the properties of their spatial distribution. The algorithm finds 69% of experimentally reported TFBSs and 85% of the CRMs in a reference data set of regions upstream of genes differentially expressed in skeletal muscle cells. A discriminant procedure based on the output of the model specifically discriminated regulatory sequences in muscle-specific genes in an independent test set. Application of the method to the analysis of 2710 10-kb fragments upstream of annotated human genes identified 17 novel candidate modules with a false discovery rate ≤0.05, demonstrating the applicability of the method to genome-scale data. © 2004 by Cold Spring Harbor Laboratory Press.",
            "authors": [
                "Thompson W.",
                "Palumbo M.J.",
                "Wasserman W.W.",
                "Liu J.S.",
                "Lawrence C.E."
            ],
            "cit_count": 69,
            "journal": "Genome Research",
            "pmid": "15466295",
            "title": "Decoding human regulatory circuits",
            "year": "2004-10-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:gibbs_motif_sampler",
        "biotoolsID": "gibbs_motif_sampler",
        "description": "Gibbs Motif Sampler allows you to identify motifs, conserved regions, in DNA or protein sequences.  This tool can be applied for the detection of transcription factor binding sites (TFBS).",
        "homepage": "http://ccmbweb.ccv.brown.edu/gibbs/gibbs.html",
        "name": "Gibbs Motif Sampler"
    }
}