{
    "additionDate": "2019-11-14T19:51:59Z",
    "biotoolsCURIE": "biotools:DrDiff",
    "biotoolsID": "DrDiff",
    "confidence_flag": "medium",
    "description": "> MEDIUM CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'DrDiff framework', 'drift-diffusion DrDiff', 'Drift-diffusion DrDiff framework' | Drift-diffusion (DrDiff) framework determines kinetics and thermodynamics of two-state folding trajectory and tunes diffusion models | Stochastic drift-diffusion (DrDiff) framework can evaluate free energy, drift and diffusion coefficients, transition path and first passage times using trajectory time traces | Drift-diffusion (DrDiff) framework",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Simulation analysis",
                    "uri": "http://edamontology.org/operation_0244"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ronaldolab/DrDiff",
    "language": [
        "Python"
    ],
    "lastUpdate": "2019-11-14T19:51:59Z",
    "license": "GPL-3.0",
    "name": "DrDiff",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1063/1.5113499",
            "metadata": {
                "abstract": "© 2019 Author(s).The stochastic drift-diffusion (DrDiff) theory is an approach used to characterize the dynamical properties of simulation data. With new features in transition times analyses, the framework characterized the thermodynamic free-energy profile [F(Q)], the folding time (τf), and transition path time (τTP) by determining the coordinate-dependent drift-velocity [v(Q)] and diffusion [D(Q)] coefficients from trajectory time traces. In order to explore the DrDiff approach and to tune it with two other methods (Bayesian analysis and fep1D algorithm), a numerical integration of the Langevin equation with known D(Q) and F(Q) was performed and the inputted coefficients were recovered with success by the diffusion models. DrDiff was also applied to investigate the prion protein (PrP) kinetics and thermodynamics by analyzing folding/unfolding simulations. The protein structure-based model, the well-known Gō-model, was employed in a coarse-grained Cα level to generate long constant-temperature time series. PrP was chosen due to recent experimental single-molecule studies in D and τTP that stressed the importance and the difficulty of probing these quantities and the rare transition state events related to prion misfolding and aggregation. The PrP thermodynamic double-well F(Q) profile, the \"X\" shape of τf(T), and the linear shape of τTP(T) were predicted with v(Q) and D(Q) obtained by the DrDiff algorithm. With the advance of single-molecule techniques, the DrDiff framework might be a useful ally for determining kinetic and thermodynamic properties by analyzing time observables of biomolecular systems. The code is freely available at https://github.com/ronaldolab/DrDiff.",
                "authors": [
                    {
                        "name": "Freitas F.C."
                    },
                    {
                        "name": "Lima A.N."
                    },
                    {
                        "name": "Contessoto V.D.G."
                    },
                    {
                        "name": "Whitford P.C."
                    },
                    {
                        "name": "Oliveira R.J.D."
                    }
                ],
                "date": "2019-09-21T00:00:00Z",
                "journal": "Journal of Chemical Physics",
                "title": "Drift-diffusion (DrDiff) framework determines kinetics and thermodynamics of two-state folding trajectory and tunes diffusion models"
            },
            "pmid": "31542001"
        }
    ],
    "topic": [
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        },
        {
            "term": "Biomolecular simulation",
            "uri": "http://edamontology.org/topic_3892"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        }
    ]
}