{
    "accessibility": "Open access",
    "additionDate": "2020-08-11T18:06:30Z",
    "biotoolsCURIE": "biotools:plant_ptm_viewer",
    "biotoolsID": "plant_ptm_viewer",
    "collectionID": [
        "VIB",
        "UGent",
        "BIG N2N"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Patrick Willems",
            "typeRole": [
                "Provider",
                "Primary contact"
            ]
        },
        {
            "name": "Thomas Van Parys",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "Alison Horne",
            "typeRole": [
                "Developer"
            ]
        }
    ],
    "description": "The Plant PTM Viewer is an integrative PTM resource that comprises approximately 370 000 PTM sites for 19 types of protein modifications in plant proteins from five different species.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://www.psb.ugent.be/webtools/ptm-viewer/tutorial.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "elixirNode": [
        "Belgium"
    ],
    "homepage": "http://www.psb.ugent.be/PlantPTMViewer",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2020-09-08T14:37:32Z",
    "license": "Not licensed",
    "maturity": "Mature",
    "name": "Plant PTM Viewer",
    "owner": "bits@vib.be",
    "publication": [
        {
            "doi": "10.1111/tpj.14345",
            "metadata": {
                "abstract": "© 2019 The Authors The Plant Journal © 2019 John Wiley & Sons LtdPost-translational modifications (PTMs) of proteins are central in any kind of cellular signaling. Modern mass spectrometry technologies enable comprehensive identification and quantification of various PTMs. Given the increased numbers and types of mapped protein modifications, a database is necessary that simultaneously integrates and compares site-specific information for different PTMs, especially in plants for which the available PTM data are poorly catalogued. Here, we present the Plant PTM Viewer (http://www.psb.ugent.be/PlantPTMViewer), an integrative PTM resource that comprises approximately 370 000 PTM sites for 19 types of protein modifications in plant proteins from five different species. The Plant PTM Viewer provides the user with a protein sequence overview in which the experimentally evidenced PTMs are highlighted together with an estimate of the confidence by which the modified peptides and, if possible, the actual modification sites were identified and with functional protein domains or active site residues. The PTM sequence search tool can query PTM combinations in specific protein sequences, whereas the PTM BLAST tool searches for modified protein sequences to detect conserved PTMs in homologous sequences. Taken together, these tools help to assume the role and potential interplay of PTMs in specific proteins or within a broader systems biology context. The Plant PTM Viewer is an open repository that allows the submission of mass spectrometry-based PTM data to remain at pace with future PTM plant studies.",
                "authors": [
                    {
                        "name": "Willems P."
                    },
                    {
                        "name": "Horne A."
                    },
                    {
                        "name": "Van Parys T."
                    },
                    {
                        "name": "Goormachtig S."
                    },
                    {
                        "name": "De Smet I."
                    },
                    {
                        "name": "Botzki A."
                    },
                    {
                        "name": "Van Breusegem F."
                    },
                    {
                        "name": "Gevaert K."
                    }
                ],
                "citationCount": 6,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Plant Journal",
                "title": "The Plant PTM Viewer, a central resource for exploring plant protein modifications"
            },
            "pmid": "31004550",
            "type": [
                "Primary"
            ],
            "version": "1.0"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "version": [
        "1.0"
    ]
}