{
    "additionDate": "2017-12-18T00:14:50Z",
    "biotoolsCURIE": "biotools:elprep",
    "biotoolsID": "elprep",
    "credit": [
        {
            "email": "pascal.costanza@imec.be",
            "name": "Pascal Costanza",
            "orcidid": "https://orcid.org/0000-0001-8894-3238",
            "typeEntity": "Person"
        },
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.exascience.com/"
        }
    ],
    "description": "Is a high-performance tool for preparing .sam/.bam/.cram files for variant calling in sequencing pipelines.It can be used as a drop-in replacement for SAMtools/Picard, and was extensively tested with different pipelines for variant analysis with GATK.",
    "documentation": [
        {
            "type": [
                "API documentation"
            ],
            "url": "https://godoc.org/github.com/ExaScience/elprep"
        },
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/ExaScience/elprep"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ExaScience/elprep",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-25T13:38:59Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/elprep-high-performance-preparation-of-sequence-alignmentmap-files-for-variant-calling.html"
        }
    ],
    "name": "elPrep",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1177/1176934319869015",
            "metadata": {
                "abstract": "© The Author(s) 2019.elPrep is an extensible multithreaded software framework for efficiently processing Sequence Alignment/Map (SAM)/Binary Alignment/Map (BAM) files in next-generation sequencing pipelines. Similar to other SAM/BAM tools, a key challenge in elPrep is memory management, as such programs need to manipulate large amounts of data. We therefore investigated 3 programming languages with support for assisted or automated memory management for implementing elPrep, namely C++, Go, and Java. We implemented a nontrivial subset of elPrep in all 3 programming languages and compared them by benchmarking their runtime performance and memory use to determine the best language in terms of computational performance. In a previous article, we motivated why, based on these results, we eventually selected Go as our implementation language. In this article, we discuss the difficulty of achieving the best performance in each language in terms of programming language constructs and standard library support. While benchmarks are easy to objectively measure and evaluate, this is less obvious for assessing ease of programming. However, because we expect elPrep to be regularly modified and extended, this is an equally important aspect. We illustrate representative examples of challenges in all 3 languages, and give our opinion why we think that Go is a reasonable choice also in this light.",
                "authors": [
                    {
                        "name": "Costanza P."
                    },
                    {
                        "name": "Herzeel C."
                    },
                    {
                        "name": "Verachtert W."
                    }
                ],
                "citationCount": 2,
                "date": "2019-08-01T00:00:00Z",
                "journal": "Evolutionary Bioinformatics",
                "title": "Comparing Ease of Programming in C++, Go, and Java for Implementing a Next-Generation Sequencing Tool"
            },
            "pmcid": "PMC6698987",
            "pmid": "31452597"
        },
        {
            "doi": "10.1371/journal.pone.0132868",
            "metadata": {
                "abstract": "© 2015 Herzeel et al.ElPrep is a high-performance tool for preparing sequence alignment/map files for variant calling in sequencing pipelines. It can be used as a replacement for SAMtools and Picard for preparation steps such as filtering, sorting, marking duplicates, reordering contigs, and so on, while producing identical results. What sets elPrep apart is its software architecture that allows executing preparation pipelines by making only a single pass through the data, no matter how many preparation steps are used in the pipeline. elPrep is designed as a multithreaded application that runs entirely in memory, avoids repeated file I/O, and merges the computation of several preparation steps to significantly speed up the execution time. For example, for a preparation pipeline of five steps on a whole-exome BAM file (NA12878), we reduce the execution time from about 1:40 hours, when using a combination of SAMtools and Picard, to about 15 minutes when using elPrep, while utilising the same server resources, here 48 threads and 23GB of RAM. For the same pipeline on whole-genome data (NA12878), elPrep reduces the runtime from 24 hours to less than 5 hours. As a typical clinical study may contain sequencing data for hundreds of patients, elPrep can remove several hundreds of hours of computing time, and thus substantially reduce analysis time and cost. Copyright:",
                "authors": [
                    {
                        "name": "Costanza P."
                    },
                    {
                        "name": "Decap D."
                    },
                    {
                        "name": "Fostier J."
                    },
                    {
                        "name": "Herzeel C."
                    },
                    {
                        "name": "Reumers J."
                    }
                ],
                "citationCount": 14,
                "date": "2015-07-16T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "ElPrep: High-performance preparation of sequence alignment/map files for variant calling"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1,
    "version": [
        "2.4"
    ]
}
