{
    "additionDate": "2019-11-14T18:41:38Z",
    "biotoolsCURIE": "biotools:QSM",
    "biotoolsID": "QSM",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "pas2018@med.cornell.edu",
            "name": "Pascal Spincemaille",
            "typeEntity": "Person"
        }
    ],
    "description": "Clinical Integration of Automated Processing for Brain Quantitative Susceptibility Mapping | Cornell MRI Research Lab Research Interests | Quantitative Susceptibility Mapping | Quantitative Susceptibility Mapping (QSM) provides a map of local tissue magnetic susceptibility",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                }
            ]
        }
    ],
    "homepage": "http://pre.weill.cornell.edu/mri/pages/qsm.html",
    "lastUpdate": "2021-01-31T13:08:54Z",
    "name": "QSM",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1111/JON.12658",
            "metadata": {
                "abstract": "© 2019 by the American Society of NeuroimagingBACKGROUND AND PURPOSE: Quantitative susceptibility mapping (QSM) of the brain has become highly reproducible and has applications in an expanding array of diseases. To translate QSM from bench to bedside, it is important to automate its reconstruction immediately after data acquisition. In this work, a server system that automatically reconstructs QSM and exchange images with the scanner using the DICOM standard is demonstrated using a multi-site, multi-vendor reproducibility study and a large, single-site, multi-scanner image quality review study in a clinical environment. METHODS: A single healthy subject was scanned with a 3D multi-echo gradient echo sequence at nine sites around the world using scanners from three manufacturers. A high-resolution (HiRes,.5 ×.5 × 1 mm3 reconstructed) and standard-resolution (StdRes,.5 ×.5 × 3 mm3) protocol was performed. ROI analysis of various white matter and gray matter regions was performed to investigate reproducibility across sites. At one institution, a retrospective multi-scanner image quality review was carried out of all clinical QSM images acquired consecutively in 1 month. RESULTS: Reconstruction times using a GPU were 29 ± 22 seconds (StdRes) and 55 ± 39 seconds (HiRes). ROI standard deviation across sites was below 24 ppb (StdRes) and 17 ppb (HiRes). Correlations between ROI averages across sites were on average.92 (StdRes) and.96 (HiRes). Image quality review of 873 consecutive patients revealed diagnostic or excellent image quality in 96% of patients. CONCLUSION: Online QSM reconstruction for a variety of sites and scanner platforms with low cross-site ROI standard deviation is demonstrated. Image quality review revealed diagnostic or excellent image quality in 96% of 873 patients.",
                "authors": [
                    {
                        "name": "Spincemaille P."
                    },
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Zhang S."
                    },
                    {
                        "name": "Kovanlikaya I."
                    },
                    {
                        "name": "Ippoliti M."
                    },
                    {
                        "name": "Makowski M."
                    },
                    {
                        "name": "Watts R."
                    },
                    {
                        "name": "de Rochefort L."
                    },
                    {
                        "name": "Venkatraman V."
                    },
                    {
                        "name": "Desmond P."
                    },
                    {
                        "name": "Santin M.D."
                    },
                    {
                        "name": "Lehericy S."
                    },
                    {
                        "name": "Kopell B.H."
                    },
                    {
                        "name": "Peran P."
                    },
                    {
                        "name": "Wang Y."
                    }
                ],
                "citationCount": 6,
                "date": "2019-11-01T00:00:00Z",
                "journal": "Journal of Neuroimaging",
                "title": "Clinical Integration of Automated Processing for Brain Quantitative Susceptibility Mapping: Multi-Site Reproducibility and Single-Site Robustness"
            },
            "pmcid": "PMC6814493",
            "pmid": "31379055"
        }
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Allergy, clinical immunology and immunotherapeutics",
            "uri": "http://edamontology.org/topic_3400"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ],
    "validated": 1
}