{
    "additionDate": "2017-02-10T14:14:52Z",
    "biotoolsCURIE": "biotools:nomad-ref",
    "biotoolsID": "nomad-ref",
    "credit": [
        {
            "email": "delarue@pasteur.fr",
            "name": "Marc Delarue",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Normal Mode Analysis, Deformation, and Refinement (NOMAD-Ref) provides tools for calculating functionally relevant movements in biological macromolecules.  This resource provides tools for investigating different conformations of large protein structures, for modeling receptor/ligand docking complexes, and for calculating the associated molecular motions.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://lorentz.immstr.pasteur.fr/nomad-ref.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                },
                {
                    "term": "Molecular model refinement",
                    "uri": "http://edamontology.org/operation_0322"
                },
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                },
                {
                    "term": "Protein flexibility and motion analysis",
                    "uri": "http://edamontology.org/operation_0244"
                }
            ]
        }
    ],
    "homepage": "http://lorentz.immstr.pasteur.fr/nomad-ref.php",
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "NOMAD-Ref",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "The Elastic Network Model is used to investigate the open/closed transition in all DNA-dependent polymerases whose structure is known in both forms. For each structure the model accounts well for experimental crystallographic B-factors. It is found in all cases that the transition can be well described with just a handful of the normal modes. Usually, only the lowest and/or the second lowest frequency normal modes deduced from the open form give rise to calculated displacement vectors that have a correlation coefficient larger than 0.50 with the observed difference vectors between the two forms. This is true for every structural class of DNA-dependent polymerases where a direct comparison with experimental structural data is available. In cases where only one form has been observed by X-ray crystallography, it is possible to make predictions concerning the possible existence of another form in solution by carefully examining the vector displacements predicted for the lowest frequency normal modes. This simple model, which has the advantage to be computationally inexpensive, could be used to design novel kind of drugs directed against polymerases, namely drugs preventing the open/closed transition from occurring in bacterial or viral DNA-dependent polymerases. © 2002 Elsevier Science Ltd. All rights reserved.",
                "authors": [
                    {
                        "name": "Delarue M."
                    },
                    {
                        "name": "Sanejouand Y.-H."
                    }
                ],
                "citationCount": 217,
                "date": "2002-01-01T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "Simplified normal mode analysis of conformational transitions in DNA-dependent polymerases: The Elastic Network Model"
            },
            "pmid": "12126621"
        },
        {
            "metadata": {
                "abstract": "Normal mode analysis (NMA) is an efficient way to study collective motions in biomolecules that bypasses the computational costs and many limitations associated with full dynamics simulations. The NOMAD-Ref web server presented here provides tools for online calculation of the normal modes of large molecules (up to 100 000 atoms) maintaining a full all-atom representation of their structures, as well as access to a number of programs that utilize these collective motions for deformation and refinement of biomolecular structures. Applications include the generation of sets of decoys with correct stereochemistry but arbitrary large amplitude movements, the quantification of the overlap between alternative conformations of a molecule, refinement of structures against experimental data, such as X-ray diffraction structure factors or Cryo-EM mapsandoptimization of docked complexes by modeling receptor/ ligand flexibility through normal mode motions. © The Author 2006. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Lindahl E."
                    },
                    {
                        "name": "Azuara C."
                    },
                    {
                        "name": "Koehl P."
                    },
                    {
                        "name": "Delarue M."
                    }
                ],
                "citationCount": 282,
                "date": "2006-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "NOMAD-Ref: Visualization, deformation and refinement of macromolecular structures based on all-atom normal mode analysis"
            },
            "pmid": "16845062"
        },
        {
            "metadata": {
                "abstract": "Prediction of structural changes resulting from complex formation, both in ligands and receptors, is an important and unsolved problem in structural biology. In this work, we use all-atom normal modes calculated with the Elastic Network Model as a basis set to model structural flexibility during formation of macromolecular complexes and refine the non-bonded intermolecular energy between the two partners (protein-ligand or protein-DNA) along 5-10 of the lowest frequency normal mode directions. The method handles motions unrelated to the docking transparently by first applying the modes that improve non-bonded energy most and optionally restraining amplitudes; in addition, the method can correct small errors in the ligand position when the first six rigid-body modes are switched on. For a test set of six protein receptors that show an open-to-close transition when binding small ligands, our refinement scheme reduces the protein coordinate cRMS by 0.3-3.2 Å. For two test cases of DNA structures interacting with proteins, the program correctly refines the docked B-DNA starting form into the expected bent DNA, reducing the DNA cRMS from 8.4 to 4.8 and from 8.7 to 5.4 Å, respectively. A public web server implementation of the refinement method is available at http://lorentz.immstr.pasteur.fr. © The Author 2005. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Lindahl E."
                    },
                    {
                        "name": "Delarue M."
                    }
                ],
                "citationCount": 58,
                "date": "2005-09-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Refinement of docked protein-ligand and protein-DNA structures using low frequency normal mode amplitude optimization"
            },
            "pmid": "16087736"
        },
        {
            "metadata": {
                "abstract": "As more and more structures of macromolecular complexes get solved in different conditions, it has become apparent that flexibility is an inherent part of their biological function. Normal mode analysis using simplified models of proteins such as the elastic network model has proved very effective in showing that many of the structural transitions derived from a survey of the Protein Data Bank can be explained by just a few of the lowest-frequency normal modes. In this work, normal modes are used to carry out medium- or low-resolution structural refinement, enforcing collective and large-amplitude movements that are beyond the reach of existing methods. Refinement is carried out in reciprocal space with respect to the normal mode amplitudes, by using standard conjugate-gradient minimization. Several tests on synthetic diffraction data whose mode concentration follows the one of real movements observed in the Protein Data Bank have shown that the radius of convergence is larger than the one of rigid-body refinement. Tests with experimental diffraction data for the same protein in different environments also led to refined structural models showing drastic reduction of the rms deviation with the target model. Because the structural transition is described by very few parameters, over-fitting of real experimental data is easily detected by using a cross-validation test. The method has also been applied to the refinement of atomic models into molecular envelopes and could readily be used to fit large macromolecular complex rearrangements into cryo-electron microscopy-reconstructed images as well as small-angle x-ray scattering-derived envelopes.",
                "authors": [
                    {
                        "name": "Delarue M."
                    },
                    {
                        "name": "Dumas P."
                    }
                ],
                "citationCount": 175,
                "date": "2004-05-04T00:00:00Z",
                "journal": "Proceedings of the National Academy of Sciences of the United States of America",
                "title": "On the use of low-frequency normal modes to enforce collective movements in refining macromolecular structural models"
            },
            "pmid": "15096585"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}