{
    "additionDate": "2021-01-18T08:04:21Z",
    "biotoolsCURIE": "biotools:opendose",
    "biotoolsID": "opendose",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "manuel.bardies@inserm.fr",
            "name": "Manuel Bardiès",
            "typeEntity": "Person"
        }
    ],
    "description": "Open-Access Resource for Nuclear Medicine Dosimetry.\n\nIf you wish to receive the OpenDose newsletter, send an email to this link. You will receive shortly a confirmation email for your registration.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                }
            ]
        }
    ],
    "homepage": "http://www.opendose.org",
    "lastUpdate": "2021-03-15T09:20:36Z",
    "name": "OpenDose",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.2967/JNUMED.119.240366",
            "metadata": {
                "abstract": "COPYRIGHT © 2020 by the Society of Nuclear Medicine and Molecular Imaging.Radiopharmaceutical dosimetry depends on the localization in space and time of radioactive sources and requires the estimation of the amount of energy emitted by the sources deposited within targets. In particular, when computing resources are not accessible, this task can be performed using precomputed tables of specific absorbed fractions (SAFs) or S values based on dosimetric models. The aim of the OpenDose collaboration is to generate and make freely available a range of dosimetric data and tools. Methods: OpenDose brings together resources and expertise from 18 international teams to produce and compare traceable dosimetric data using 6 of the most popular Monte Carlo codes in radiation transport (EGSnrc/EGS11, FLUKA, GATE, Geant4, MCNP/MCNPX, and PENELOPE). SAFs are uploaded, together with their associated statistical uncertainties, in a relational database. S values are then calculated from monoenergetic SAFs on the basis of the radioisotope decay data presented in International Commission on Radiological Protection Publication 107. Results: The OpenDose collaboration produced SAFs for all source region and target combinations of the 2 International Commission on Radiological Protection Publication 110 adult reference models. SAFs computed from the different Monte Carlo codes were in good agreement at all energies, with SDs below individual statistical uncertainties. Calculated S values were in good agreement with OLINDA/EXM 2.0 (commercial) and IDAC-Dose 2.1 (free) software. A dedicated website (www.opendose.org) has been developed to provide easy and open access to all data. Conclusion: The OpenDose website allows the display and downloading of SAFs and the corresponding S values for 1,252 radionuclides. The OpenDose collaboration, open to new research teams, will extend data production to other dosimetric models and implement new free features, such as online dosimetric tools and patient-specific absorbed dose calculation software, together with educational resources.",
                "authors": [
                    {
                        "name": "Bardies M."
                    },
                    {
                        "name": "Borys D."
                    },
                    {
                        "name": "Botta F."
                    },
                    {
                        "name": "Bzowski P."
                    },
                    {
                        "name": "Chauvin M."
                    },
                    {
                        "name": "Dabin J."
                    },
                    {
                        "name": "Denis-Bacelar A.M."
                    },
                    {
                        "name": "Desbree A."
                    },
                    {
                        "name": "Falzone N."
                    },
                    {
                        "name": "Gil A.V."
                    },
                    {
                        "name": "Lee B.Q."
                    },
                    {
                        "name": "Mairani A."
                    },
                    {
                        "name": "Malaroda A."
                    },
                    {
                        "name": "Mathieu G."
                    },
                    {
                        "name": "McKay E."
                    },
                    {
                        "name": "Mora-Ramirez E."
                    },
                    {
                        "name": "Robinson A.P."
                    },
                    {
                        "name": "Sarrut D."
                    },
                    {
                        "name": "Struelens L."
                    }
                ],
                "citationCount": 7,
                "date": "2020-10-01T00:00:00Z",
                "journal": "Journal of Nuclear Medicine",
                "title": "OpenDose: Open-access resource for nuclear medicine dosimetry"
            },
            "pmcid": "PMC7539649",
            "pmid": "32169912"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        }
    ]
}
