{
    "accessibility": "Open access",
    "additionDate": "2022-12-12T19:55:02.930017Z",
    "biotoolsCURIE": "biotools:smartphone-rcct",
    "biotoolsID": "smartphone-rcct",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "mail@juergen-barth.de",
            "name": "Jürgen Barth",
            "orcidid": "https://orcid.org/0000-0001-7096-7178",
            "typeEntity": "Person"
        },
        {
            "name": "Claudia M. Witt",
            "orcidid": "https://orcid.org/0000-0002-5440-7805"
        },
        {
            "name": "Eulàlia Grifol-Clar",
            "orcidid": "http://orcid.org/0000-0003-3944-0372"
        },
        {
            "name": "Noelia Álvarez-Díaz",
            "orcidid": "http://orcid.org/0000-0002-5904-3609"
        }
    ],
    "description": "An online repository of randomized controlled clinical trials of smartphone applications for chronic conditions.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "https://osf.io/hvf8x",
    "lastUpdate": "2022-12-12T19:55:02.932888Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://osf.io/nxerf/"
        }
    ],
    "name": "Smartphone-RCCT",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/s13063-022-06849-x",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: Chronic health conditions have a big impact on disability, morbidity, and mortality worldwide. Smartphone health applications (apps) can improve the health of patients with chronic conditions and enhance the quality and efficiency of healthcare. The number of randomized controlled trials (RCTs) of smartphone health apps is increasing, but a collection of the available evidence into a single database is still missing. The purpose of this study is to describe Smartphone-RCCT, which is an in-progress database of RCTs of smartphone apps for chronic conditions. Methods: For a study to be included in the database, the following criteria had to be met: (a) RCT published in a peer-reviewed journal; (b) population: adult study participants with one or several chronic conditions that represent the main health problem addressed by the study intervention; (c) intervention: smartphone health app used by the patient; (d) comparator: any control condition; (e) outcomes: any patient-reported health outcome (studies exclusively measuring the patients’ knowledge about the chronic conditions or their satisfaction with the smartphone app were excluded); (f) sample size: at least 15 participants per study arm. We searched in electronic databases and other resources to identify relevant studies. Two reviewers selected the studies and extracted data independently. Annual updates are planned. Results: The proposed database is called Smartphone-RCCT, an open-access repository collecting bibliographic references and important characteristics of RCTs of smartphone apps for chronic conditions. The database is available for free in Open Science Framework (OSF): https://osf.io/nxerf/. To date, it includes 70 trials. Their references can be exported to standard reference management software and the extracted data is available in a Microsoft Excel file. Conclusions: Smartphone-RCCT is the first systematic open-access database collecting peer-reviewed publications of RCTs of smartphone apps for patients with chronic conditions. The database accelerates the delivery of evidence-based information in a dynamic research field. It represents an essential resource for different stakeholders, such as professionals working in evidence synthesis, meta-epidemiological studies, or planning an RCT.",
                "authors": [
                    {
                        "name": "Alvarez-Diaz N."
                    },
                    {
                        "name": "Barth J."
                    },
                    {
                        "name": "Grifol-Clar E."
                    },
                    {
                        "name": "Kramm C."
                    },
                    {
                        "name": "Lopez-Alcalde J."
                    },
                    {
                        "name": "Pach D."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Witt C.M."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "Trials",
                "title": "Smartphone-RCCT: an online repository of randomized controlled clinical trials of smartphone applications for chronic conditions"
            },
            "pmcid": "PMC9615349",
            "pmid": "36303168"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Biological databases",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ],
    "validated": 1
}
