{
    "name": "RDC-PANDA", 
    "description": "RDC-based SSE PAcking with NOEs for Structure Determination and NOE Assignment is a suite of programs for nuclear Overhauser effect (NOE) assignment and high-resolution structure determination starting with a global fold calculated from exact solutions to the residual dipolar coupling (RDC) equations. It is specifically designed for automated NMR NOE assignment and protein structure determination.", 
    "homepage": "http://www.cs.duke.edu/donaldlab/rdcpanda.php", 
    "biotoolsID": "rdc-panda", 
    "biotoolsCURIE": "biotools:rdc-panda", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2479", 
                    "term": "Protein sequence analysis"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Suite"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0593", 
            "term": "NMR"
        }, 
        {
            "uri": "http://edamontology.org/topic_1317", 
            "term": "Structural biology"
        }, 
        {
            "uri": "http://edamontology.org/topic_0082", 
            "term": "Structure prediction"
        }, 
        {
            "uri": "http://edamontology.org/topic_2814", 
            "term": "Protein structure analysis"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/rdc-panda-1-0-nmr-noe-assignment-protein-structure-determination.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://www.cs.duke.edu/donaldlab/software/rdcpanda/rdc-panda_manual.pdf", 
            "type": "Manual", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "19711185", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "High-resolution protein structure determination starting with a global fold calculated from exact solutions to the RDC equations", 
                "abstract": "We present a novel structure determination approach that exploits the global orientational restraints from RDCs to resolve ambiguous NOE assignments. Unlike traditional approaches that bootstrap the initial fold from ambiguous NOE assignments, we start by using RDCs to compute accurate secondary structure element (SSE) backbones at the beginning of structure calculation. Our structure determination package, called rdc-Panda (RDC-based SSE PA cking with N OEs for Structure D etermination and NOE A ssignment), consists of three modules: (1) rdc-exact; (2) Packer; and (3) hana (HA usdorff-based N OE A ssignment). rdc-exact computes the global optimal solution of backbone dihedral angles for each secondary structure element by exactly solving a system of quartic RDC equations derived by Wang and Donald (Proceedings of the IEEE computational systems bioinformatics conference (CSB), Stanford, CA, 2004a; J Biomol NMR 29(3):223-242, 2004b), and systematically searching over the roots, each of which is a backbone dihedral φ- or ψ-angle consistent with the RDC data. Using a small number of unambiguous inter-SSE NOEs extracted using only chemical shift information, Packer performs a systematic search for the core structure, including all SSE backbone conformations. hana uses a Hausdorff-based scoring function to measure the similarity between the experimental spectra and the back-computed NOE pattern for each side-chain from a statistically-diverse rotamer library, and drives the selection of optimal position-specific rotamers for filtering ambiguous NOE assignments. Finally, a local minimization approach is used to compute the loops and refine side-chain conformations by fixing the core structure as a rigid body while allowing movement of loops and side-chains. rdc-Panda was applied to NMR data for the FF Domain 2 of human transcription elongation factor CA150 (RNA polymerase II C-terminal domain interacting protein), human ubiquitin, the ubiquitin-binding zinc finger domain of the human Y-family DNA polymerase Eta (pol η UBZ), and the human Set2-Rpb1 interacting domain (hSRI). These results demonstrated the efficiency and accuracy of our algorithm, and show that rdc-Panda can be successfully applied for high-resolution protein structure determination using only a limited set of NMR data by first computing RDC-defined backbones. © Springer Science+Business Media B.V. 2009.", 
                "date": "2009-08-28T00:00:00Z", 
                "citationCount": 28, 
                "authors": [
                    {
                        "name": "Zeng J."
                    }, 
                    {
                        "name": "Boyles J."
                    }, 
                    {
                        "name": "Tripathy C."
                    }, 
                    {
                        "name": "Wang L."
                    }, 
                    {
                        "name": "Yan A."
                    }, 
                    {
                        "name": "Zhou P."
                    }, 
                    {
                        "name": "Donald B.R."
                    }
                ], 
                "journal": "Journal of Biomolecular NMR"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": "panda@cs.duke.edu", 
            "url": "http://www.cs.duke.edu/donaldlab/index.php", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T18:57:35Z", 
    "lastUpdate": "2018-12-10T12:58:42Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}