{
    "additionDate": "2022-08-22T13:08:29.374692Z",
    "biotoolsCURIE": "biotools:epb",
    "biotoolsID": "epb",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "John Z. H. Zhang",
            "orcidid": "https://orcid.org/0000-0003-2853-7910",
            "typeEntity": "Person"
        },
        {
            "name": "Changge Ji",
            "typeEntity": "Person"
        }
    ],
    "description": "A Effective Polarizable Bond method",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                },
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Small molecule design",
                    "uri": "http://edamontology.org/operation_4009"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Xundrug/EPB",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-08-22T13:08:29.377639Z",
    "license": "Not licensed",
    "name": "EPB",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1039/D0RA01483D",
            "metadata": {
                "abstract": "This journal is © 2020 The Royal Society of Chemistry.Electrostatic interaction plays an essential role in protein-ligand binding. Due to the polarization effect, electrostatic interactions are largely impacted by their local environments. However, traditional force fields use fixed point charge-charge interactions to describe electrostatic interactions but is unable to include the polarization effect. The lack of the polarization effect in the force field representation can result in substantial error in biomolecular studies, such as molecular dynamics and molecular docking. Docking programs usually employ traditional force fields to estimate the binding energy between a ligand and a protein for pose selection or scoring. The intermolecular interaction energy mainly consists of van der Waals and electrostatic interaction in the force field representation. In the current study, we developed an Effective Polarizable Bond (EPB) method for small organic molecules and applied this EPB method to optimize protein-ligand docking in computational tests for a variety of protein-ligand systems. We tested the method on a set of 38 cocrystallized structures taken from the Protein Data Bank (PDB) and found that the maximum error was reduced from 7.98 Å to 2.03 Å when using EPB Dock, providing strong evidence that the use of EPB charges is important. We found that our optimized docking approach with EPB charges could improve the docking performance, sometimes dramatically, and the maximum error was reduced from 12.88 Å to 1.57 Å in Optimized Docking (in the case of 1fqx). The average RMSD decreased from 2.83 Å to 1.85 Å. Further investigations showed that the use of the EBP method could enhance intermolecular hydrogen bonding, which is a major contributing factor to improved docking performance. Developed tools for the calculation of the polarized ligand charge from a protein-ligand complex structure with the EPB method are freely available on GitHub (https://github.com/Xundrug/EPB).",
                "authors": [
                    {
                        "name": "Duan G."
                    },
                    {
                        "name": "Ji C."
                    },
                    {
                        "name": "Zhang J.Z.H."
                    }
                ],
                "citationCount": 9,
                "date": "2020-04-20T00:00:00Z",
                "journal": "RSC Advances",
                "title": "Developing an effective polarizable bond method for small molecules with application to optimized molecular docking"
            },
            "pmcid": "PMC9052371",
            "pmid": "35495446"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Suite"
    ],
    "topic": [
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
