{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.4c.ucc.ie/~gifrim/"}],"function":[{"operation":[{"term":"Regression","uri":"http://edamontology.org/operation_3659"}]},{"operation":[{"term":"Sequence classification","uri":"http://edamontology.org/operation_2995"}]},{"operation":[{"term":"Classification","uri":"http://edamontology.org/operation_2990"}]}],"labels":{"language":["C++"],"operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"References","uri":"http://edamontology.org/topic_3068"},{"term":"DNA","uri":"http://edamontology.org/topic_0654"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/seql-2-0-sequence-learner.html"}],"publication":[{"abstract":"We present a framework for discriminative sequence classification where linear classifiers work directly in the explicit high-dimensional predictor space of all subsequences in the training set (as opposed to kernel-induced spaces). This is made feasible by employing a gradient-bounded coordinatedescent algorithm for efficiently selecting discriminative subsequences without having to expand the whole space. Our framework can be applied to a wide range of loss functions, including binomial log-likelihood loss of logistic regression and squared hinge loss of support vector machines. When applied to protein remote homology detection and remote fold recognition, our framework achieves comparable performance to the state-of-the-art (e.g., kernel support vector machines). In contrast to state-of-the-art sequence classifiers, our models are simply lists of weighted discriminative subsequences and can thus be interpreted and related to the biological problem - a crucial requirement for the bioinformatics and medical communities. Copyright 2011 ACM.","authors":["Ifrim G.","Wiuf C."],"cit_count":16,"doi":"10.1145/2020408.2020519","journal":"Proceedings of the ACM SIGKDD International Conference on Knowledge Discovery and Data Mining","title":"Bounded coordinate-descent for biological sequence classification in high dimensional predictor space","type":"Primary","year":"2011-09-16"}],"summary":{"biotoolsCURIE":"biotools:seql","biotoolsID":"seql","description":"Implementation of a greedy coordinate-wise gradient descent technique for efficiently learning sequence classifiers.","homepage":"http://daimi.au.dk/~ifrim//seql/seql.html","name":"SEQL","version":["2.0"]}}