{
    "additionDate": "2021-01-18T10:22:33Z",
    "biotoolsCURIE": "biotools:fae",
    "biotoolsID": "fae",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "yfyao@phy.ecnu.edu.cn",
            "name": "Ye-feng Yao",
            "typeEntity": "Person"
        },
        {
            "email": "gyang@phy.ecnu.edu.cn",
            "name": "Guang Yang",
            "orcidid": "https://orcid.org/0000-0001-8942-427X",
            "typeEntity": "Person"
        }
    ],
    "description": "Feature Analysis Explorer (FAE) can help researchers develop a classification model with comparison among different methods. This project was inspired on the Radiomics, and provides a GUI to help analyze the feature matrix, including feature matrix pre-process, model development, and results visualization.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/salan668/FAE",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-08T11:06:02Z",
    "license": "GPL-3.0",
    "name": "FAE",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0237587",
            "metadata": {
                "abstract": "Copyright: © 2020 Song et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.In radiomics studies, researchers usually need to develop a supervised machine learning model to map image features onto the clinical conclusion. A classical machine learning pipeline consists of several steps, including normalization, feature selection, and classification. It is often tedious to find an optimal pipeline with appropriate combinations. We designed an open-source software package named FeAture Explorer (FAE). It was programmed with Python and used NumPy, pandas, and scikit-learning modules. FAE can be used to extract image features, preprocess the feature matrix, develop different models automatically, and evaluate them with common clinical statistics. FAE features a user-friendly graphical user interface that can be used by radiologists and researchers to build many different pipelines, and to compare their results visually. To prove the effectiveness of FAE, we developed a candidate model to classify the clinical-significant prostate cancer (CS PCa) and non-CS PCa using the PROSTATEx dataset. We used FAE to try out different combinations of feature selectors and classifiers, compare the area under the receiver operating characteristic curve of different models on the validation dataset, and evaluate the model using independent test data. The final model with the analysis of variance as the feature selector and linear discriminate analysis as the classifier was selected and evaluated conveniently by FAE. The area under the receiver operating characteristic curve on the training, validation, and test dataset achieved results of 0.838, 0.814, and 0.824, respectively. FAE allows researchers to build radiomics models and evaluate them using an independent testing dataset. It also provides easy model comparison and result visualization. We believe FAE can be a convenient tool for radiomics studies and other medical studies involving supervised machine learning.",
                "authors": [
                    {
                        "name": "Song Y."
                    },
                    {
                        "name": "Zhang J."
                    },
                    {
                        "name": "Zhang Y.-D."
                    },
                    {
                        "name": "Hou Y."
                    },
                    {
                        "name": "Yan X."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Zhou M."
                    },
                    {
                        "name": "Yao Y.-F."
                    },
                    {
                        "name": "Yang G."
                    }
                ],
                "citationCount": 3,
                "date": "2020-08-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "FeAture Explorer (FAE): A tool for developing and comparing radiomics models"
            },
            "pmcid": "PMC7431107",
            "pmid": "32804986"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        }
    ]
}