{
    "additionDate": "2019-11-14T20:02:07Z",
    "biotoolsCURIE": "biotools:ETI",
    "biotoolsID": "ETI",
    "confidence_flag": "tool",
    "description": "A unique tool to help understand HIV prevention among high-risk young women in Ukraine | Estimate time since infection from NGS diversity",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://hiv.biozentrum.unibas.ch/ETI/",
    "lastUpdate": "2020-12-28T12:27:07Z",
    "name": "ETI",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/129387"
        },
        {
            "doi": "10.1371/journal.pcbi.1005775",
            "metadata": {
                "abstract": "© 2017 Puller et al.Estimating the time since infection (TI) in newly diagnosed HIV-1 patients is challenging, but important to understand the epidemiology of the infection. Here we explore the utility of virus diversity estimated by next-generation sequencing (NGS) as novel biomarker by using a recent genome-wide longitudinal dataset obtained from 11 untreated HIV-1-infected patients with known dates of infection. The results were validated on a second dataset from 31 patients. Virus diversity increased linearly with time, particularly at 3rd codon positions, with little inter-patient variation. The precision of the TI estimate improved with increasing sequencing depth, showing that diversity in NGS data yields superior estimates to the number of ambiguous sites in Sanger sequences, which is one of the alternative biomarkers. The full advantage of deep NGS was utilized with continuous diversity measures such as average pairwise distance or site entropy, rather than the fraction of polymorphic sites. The precision depended on the genomic region and codon position and was highest when 3rd codon positions in the entire pol gene were used. For these data, TI estimates had a mean absolute error of around 1 year. The error increased only slightly from around 0.6 years at a TI of 6 months to around 1.1 years at 6 years. Our results show that virus diversity determined by NGS can be used to estimate time since HIV-1 infection many years after the infection, in contrast to most alternative biomarkers. We provide the regression coefficients as well as web tool for TI estimation.",
                "authors": [
                    {
                        "name": "Albert J."
                    },
                    {
                        "name": "Neher R."
                    },
                    {
                        "name": "Puller V."
                    }
                ],
                "citationCount": 24,
                "date": "2017-10-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Estimating time of HIV-1 infection from next-generation sequence diversity"
            },
            "pmcid": "PMC5638550",
            "pmid": "28968389",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/VE/VEZ002.013",
            "pmcid": "PMC6735795",
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Geriatric medicine",
            "uri": "http://edamontology.org/topic_3399"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
