{
    "additionDate": "2017-08-03T18:49:28Z",
    "biotoolsCURIE": "biotools:mica-aligner",
    "biotoolsID": "mica-aligner",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/aquaskyline/MICA-aligner"
        }
    ],
    "description": "New short-read aligner that is optimized in view of MIC’s limitation and the extra parallelism inside each MIC core.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/aquaskyline/MICA-aligner/blob/master/README"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "homepage": "https://github.com/aquaskyline/MICA-aligner",
    "language": [
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/mica-aligner-next-generation-sequencing-short-reads-aligner-based-on-intel-mic.html"
        }
    ],
    "name": "MICA-aligner",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2015 Luo et al.; licensee BioMed Central Ltd.Background: Short-read aligners have recently gained a lot of speed by exploiting the massive parallelism of GPU. An uprising alterative to GPU is Intel MIC; supercomputers like Tianhe-2, currently top of TOP500, is built with 48,000 MIC boards to offer ~55 PFLOPS. The CPU-like architecture of MIC allows CPU-based software to be parallelized easily; however, the performance is often inferior to GPU counterparts as an MIC card contains only ~60 cores (while a GPU card typically has over a thousand cores). Results: To better utilize MIC-enabled computers for NGS data analysis, we developed a new short-read aligner MICA that is optimized in view of MIC's limitation and the extra parallelism inside each MIC core. By utilizing the 512-bit vector units in the MIC and implementing a new seeding strategy, experiments on aligning 150 bp paired-end reads show that MICA using one MIC card is 4.9 times faster than BWA-MEM (using 6 cores of a top-end CPU), and slightly faster than SOAP3-dp (using a GPU). Furthermore, MICA's simplicity allows very efficient scale-up when multiple MIC cards are used in a node (3 cards give a 14.1-fold speedup over BWA-MEM). Summary: MICA can be readily used by MIC-enabled supercomputers for production purpose. We have tested MICA on Tianhe-2 with 90 WGS samples (17.47 Tera-bases), which can be aligned in an hour using 400 nodes. MICA has impressive performance even though MIC is only in its initial stage of development. Availability and implementation: MICA's source code is freely available at http://sourceforge.net/projects/mica-aligner under GPL v3. Supplementary information: Supplementary information is available as \"Additional File 1\". Datasets are available at www.bio8.cs.hku.hk/dataset/mica.",
                "authors": [
                    {
                        "name": "Luo R."
                    },
                    {
                        "name": "Cheung J."
                    },
                    {
                        "name": "Wu E."
                    },
                    {
                        "name": "Wang H."
                    },
                    {
                        "name": "Chan S.-H."
                    },
                    {
                        "name": "Law W.-C."
                    },
                    {
                        "name": "He G."
                    },
                    {
                        "name": "Yu C."
                    },
                    {
                        "name": "Liu C.-M."
                    },
                    {
                        "name": "Zhou D."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Li R."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Zhu X."
                    },
                    {
                        "name": "Peng S."
                    },
                    {
                        "name": "Lam T.-W."
                    }
                ],
                "citationCount": 11,
                "date": "2015-04-23T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "MICA: A fast short-read aligner that takes full advantage of Many Integrated Core Architecture (MIC)"
            },
            "pmid": "25952019"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}