{
    "additionDate": "2021-01-18T08:46:45Z",
    "biotoolsCURIE": "biotools:spi-hub",
    "biotoolsID": "spi-hub",
    "confidence_flag": "tool",
    "description": "a gateway to scholarly publishing information.\n\nAdvances in the health sciences rely on sharing research and data through publication. As information professionals are often asked to contribute their knowledge to assist clinicians and researchers in selecting journals for publication, the authors recognized an opportunity to build a decision support tool, SPI-Hub: Scholarly Publishing Information Hub™, to capture the team's collective publishing industry knowledge, while carefully retaining the quality of service. SPI-Hub's decision support functionality relies on a data framework that describes journal publication policies and practices through a newly designed metadata structure, the Knowledge Management Journal Record™. Metadata fields are populated through a semi-automated process that uses custom programming to access content from multiple sources. Each record includes 25 metadata fields representing best publishing practices",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "https://spi-hub.app.vumc.org/tutorials",
    "lastUpdate": "2021-02-21T13:57:30Z",
    "name": "SPI-Hub",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.5195/JMLA.2020.815",
            "metadata": {
                "abstract": "© 2020, Medical Library Association. All rights reserved.Background: Advances in the health sciences rely on sharing research and data through publication. As information professionals are often asked to contribute their knowledge to assist clinicians and researchers in selecting journals for publication, the authors recognized an opportunity to build a decision support tool, SPI-Hub: Scholarly Publishing Information Hub™, to capture the team’s collective publishing industry knowledge, while carefully retaining the quality of service. Case Presentation: SPI-Hub’s decision support functionality relies on a data framework that describes journal publication policies and practices through a newly designed metadata structure, the Knowledge Management Journal Record™. Metadata fields are populated through a semi-automated process that uses custom programming to access content from multiple sources. Each record includes 25 metadata fields representing best publishing practices. Currently, the database includes more than 24,000 health sciences journal records. To correctly capture the resources needed for both completion and future maintenance of the project, the team conducted an internal study to assess time requirements for completing records through different stages of automation. Conclusions: The journal decision support tool, SPI-Hub, provides an opportunity to assess publication practices by compiling data from a variety of sources in a single location. Automated and semi-automated approaches have effectively reduced the time needed for data collection. Through a comprehensive knowledge management framework and the incorporation of multiple quality points specific to each journal, SPI-Hub provides prospective users with both recommendations for publication and holistic assessment of the trustworthiness of journals in which to publish research and acquire trusted knowledge.",
                "authors": [
                    {
                        "name": "Blasingame M.N."
                    },
                    {
                        "name": "Clark J.D."
                    },
                    {
                        "name": "Desautels S.J."
                    },
                    {
                        "name": "Fox Z.E."
                    },
                    {
                        "name": "Giuse D.A."
                    },
                    {
                        "name": "Giuse N.B."
                    },
                    {
                        "name": "Koonce T.Y."
                    },
                    {
                        "name": "Su J."
                    },
                    {
                        "name": "Williams A.M."
                    },
                    {
                        "name": "Zhao J."
                    }
                ],
                "date": "2020-04-01T00:00:00Z",
                "journal": "Journal of the Medical Library Association",
                "title": "Spi-hub™: A gateway to scholarly publishing information"
            },
            "pmcid": "PMC7069808",
            "pmid": "32256240"
        }
    ],
    "topic": [
        {
            "term": "Biomedical science",
            "uri": "http://edamontology.org/topic_3344"
        },
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ]
}
