
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://csbl.bmb.uga.edu/"
        }
    ],
    "documentation": [
        {
            "url": "http://csbl.bmb.uga.edu/downloads/domainparser_manual/manual.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Protein structure",
                "uri": "http://edamontology.org/topic_2814"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/domainparser-2-protein-structure-domain-partition.html"
        }
    ],
    "publication": [
        {
            "abstract": "Motivation: Automatic decomposition of a multi-domain protein into individual domains represents a highly interesting and unsolved problem. As the number of protein structures in PDB is growing at an exponential rate, there is clearly a need for more reliable and efficient methods for protein domain decomposition simply to keep the domain databases up-to-date. Results: We present a new algorithm for solving the domain decomposition problem, using a graph-theoretic approach. We have formulated the problem as a network flow problem, in which each residue of a protein is represented as a node of the network and each residue-residue contact is represented as an edge with a particular capacity, depending on the type of the contact. A two-domain decomposition problem is solved by finding a bottleneck (or a minimum cut) of the network, which minimizes the total cross-edge capacity, using the classical Ford-Fulkerson algorithm. A multi-domain decomposition problem is solved through repeatedly solving a series of two-domain problems. The algorithm has been implemented as a computer program, called DomainParser. We have tested the program on a commonly used test set consisting of 55 proteins. The decomposition results are 78.2% in agreement with the literature on both the number of decomposed domains and the assignments of residues to each domain, which compares favorably to existing programs. On the subset of two-domain proteins (20 in number), the program assigned 96.7% of the residues correctly when we require that the number of decomposed domains is two.",
            "authors": [
                "Xu Y.",
                "Xu D.",
                "Gabow H.N."
            ],
            "cit_count": 77,
            "doi": "10.1093/bioinformatics/16.12.1091",
            "journal": "Bioinformatics",
            "pmid": "11159328",
            "title": "Protein domain decomposition using a graph-theoretic approach",
            "type": "Primary",
            "year": "2000-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:domainparser",
        "biotoolsID": "domainparser",
        "description": "DomainParser uses a new algorithm for the decomposition of a multi-domain protein into individual structural domains. The underlying principle used is that residue-residue contacts are denser within a domain than between domains. We have formulated the domain decomposition problem as a network flow problem, in which each residue is represented as a node of a network and each residue-residue contact is represented as an edge with a particular capacity, depending on the type of the contact.",
        "homepage": "http://csbl.bmb.uga.edu/downloads/indexa.php#domainparser2",
        "name": "DomainParser",
        "version": [
            "2"
        ]
    }
}