{"collectionID": [], "accessibility": [], "topic": [{"term": "Molecular interactions, pathways and networks", "uri": "http://edamontology.org/topic_0602"}, {"term": "Endocrinology and metabolism", "uri": "http://edamontology.org/topic_3407"}], "owner": "ELIXIR-EE", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": null, "note": null, "version": null, "pmid": "20228128", "type": null, "pmcid": null, "metadata": {"title": "Pathway discovery in metabolic networks by subgraph extraction", "abstract": "Motivation: Subgraph extraction is a powerful technique to predict pathways from biological networks and a set of query items (e.g. genes, proteins, compounds, etc.). It can be applied to a variety of different data types, such as gene expression, protein levels, operons or phylogenetic profiles. In this article, we investigate different approaches to extract relevant pathways from metabolic networks. Although these approaches have been adapted to metabolic networks, they are generic enough to be adjusted to other biological networks as well. Results: We comparatively evaluated seven sub-network extraction approaches on 71 known metabolic pathways from Saccharomyces cerevisiae and a metabolic network obtained from MetaCyc. The best performing approach is a novel hybrid strategy, which combines a random walk-based reduction of the graph with a shortest paths-based algorithm, and which recovers the reference pathways with an accuracy of ~77%. Availability: Most of the presented algorithms are available as part of the network analysis tool set (NeAT). The kWalks method is released under the GPL3 license. Contact: kfaust@ulb.ac.be. Supplementary information: Supplementary data are available at Bioinformatics online. © The Author(s) 2010. Published by Oxford University Press.", "citationCount": 57, "authors": [{"name": "Faust K."}, {"name": "Dupont P."}, {"name": "Callut J."}, {"name": "van Helden J."}], "date": "2010-03-12T00:00:00Z", "journal": "Bioinformatics"}}, {"doi": null, "note": null, "version": null, "pmid": "19281817", "type": null, "pmcid": null, "metadata": {"title": "Metabolic Pathfinding Using RPAIR Annotation", "abstract": "Metabolic databases contain information about thousands of small molecules and reactions, which can be represented as networks. In the context of metabolic reconstruction, pathways can be inferred by searching optimal paths in such networks. A recurrent problem is the presence of pool metabolites (e.g., water, energy carriers, and cofactors), which are connected to hundreds of reactions, thus establishing irrelevant shortcuts between nodes of the network. One solution to this problem relies on weighted networks to penalize highly connected compounds. A more refined solution takes the chemical structure of reactants into account in order to differentiate between side and main compounds of a reaction. Thanks to an intensive annotation effort at KEGG, decompositions of reactions into reactant pairs (RPAIR) categorized by their role (main, trans, cofac, ligase, and leave) are now available. The goal of this article is to evaluate the impact of RPAIR data on pathfinding in metabolic networks. To this end, we measure the impact of different parameters concerning the construction of the metabolic network: mapping of reactions and reactant pairs onto a graph, use of selected categories of reactant pairs, weighting schemes for compounds and reactions, removal of highly connected metabolites, and reaction directionality. In total, we tested 104 combinations of parameters and identified their optimal values for pathfinding on the basis of 55 reference pathways from three organisms. The best-performing metabolic network combines the biochemical knowledge encoded by KEGG RPAIR with a weighting scheme penalizing highly connected compounds. With this network, we could recover reference pathways from Escherichia coli with an average accuracy of 93% (32 pathways), from Saccharomyces cerevisiae with an average accuracy of 66% (11 pathways), and from humans with an average accuracy of 70% (12 pathways). Our pathfinding approach is available as part of the Network Analysis Tools. © 2009 Elsevier Ltd. All rights reserved.", "citationCount": 42, "authors": [{"name": "Faust K."}, {"name": "Croes D."}, {"name": "van Helden J."}], "date": "2009-05-01T00:00:00Z", "journal": "Journal of Molecular Biology"}}, {"doi": null, "note": null, "version": null, "pmid": "15980483", "type": null, "pmcid": null, "metadata": {"title": "Metabolic PathFinding: Inferring relevant pathways in biochemical networks", "abstract": "Our knowledge of metabolism can be represented as a network comprising several thousands of nodes (compounds and reactions). Several groups applied graph theory to analyse the topological properties of this network and to infer metabolic pathways by path finding. This is, however, not straightforward, with a major problem caused by traversing irrelevant shortcuts through highly connected nodes, which correspond to pool metabolites and co-factors (e.g. H2O, NADP and H+). In this study, we present a web server implementing two simple approaches, which circumvent this problem, thereby improving the relevance of the inferred pathways. In the simplest approach, the shortest path is computed, while filtering out the selection of highly connected compounds. In the second approach, the shortest path is computed on the weighted metabolic graph where each compound is assigned a weight equal to its connectivity in the network. This approach significantly increases the accuracy of the inferred pathways, enabling the correct inference of relatively long pathways (e.g. with as many as eight intermediate reactions). Available options include the calculation of the k-shortest paths between two specified seed nodes (either compounds or reactions). Multiple requests can be submitted in a queue. Results are returned by email, in textual as well as graphical formats (available in http://www.scmbb.ulb.ac.be/pathfinding/). © 2005 Oxford University Press.", "citationCount": 67, "authors": [{"name": "Croes D."}, {"name": "Couche F."}, {"name": "Wodak S.J."}, {"name": "van Helden J."}], "date": "2005-07-01T00:00:00Z", "journal": "Nucleic Acids Research"}}], "homepage_status": 1, "credit": [], "biotoolsCURIE": "biotools:pathway_extraction", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "http://rsat.bigre.ulb.ac.be/rsat/index_neat.html", "function": [{"note": null, "input": [], "operation": [{"term": "Pathway or network prediction", "uri": "http://edamontology.org/operation_3439"}, {"term": "Metabolic network modelling", "uri": "http://edamontology.org/operation_3660"}, {"term": "Pathway or network analysis", "uri": "http://edamontology.org/operation_2497"}, {"term": "Network simulation", "uri": "http://edamontology.org/operation_3562"}, {"term": "Pathway or network visualisation", "uri": "http://edamontology.org/operation_3083"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:39Z", "otherID": [], "description": "This tool is a part of the network analysis tool suite (NeAT). Given a metabolic network, the tool extracts a subnetwork that connects a list of input compounds, reactions, EC numbers or enzyme-coding genes. Three metabolic networks (KEGG LIGAND, KEGG RPAIR and MetaCyc) are preloaded, but custom networks can be submitted as well.", "toolType": ["Web application"], "editPermission": {"type": "private", "authors": []}, "language": [], "link": [], "biotoolsID": "pathway_extraction", "additionDate": "2017-02-10T11:34:03Z", "name": "Pathway extraction", "license": null, "documentation": [], "maturity": null, "confidence_flag": null, "operatingSystem": []}