{
    "accessibility": "Open access",
    "additionDate": "2021-01-18T12:27:34Z",
    "biotoolsCURIE": "biotools:mriml",
    "biotoolsID": "mriml",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Chris Kozakiewicz"
        },
        {
            "name": "Nicholas Clark"
        },
        {
            "name": "Gustavo Machado",
            "orcidid": "https://orcid.org/0000-0001-7552-6144"
        },
        {
            "name": "Nick Fountain-Jones",
            "orcidid": "https://orcid.org/0000-0001-9248-8493"
        }
    ],
    "description": "We introduce a new R package ‘MrIML’ (Multi-response Interpretable Machine Learning). MrIML provides a powerful and interpretable framework that enables users to harness recent advances in machine learning to map multi-locus genomic relationships, to identify loci of interest for future landscape genetics studies and to gain new insights into adaptation across environmental gradients. Relationships between genetic change and environment are often non-linear, interactive and autocorrelated. Our package helps capture this complexity and offers functions that construct, fit and conduct inference on a wide range of highly flexible models that are routinely used for single-locus landscape genetics studies but are rarely extended to estimate response functions for multiple loci",
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/nfj1380/mrIML/releases/tag/V1.0.1"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://nfj1380.github.io/mrIML",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-01-12T21:41:37.226402Z",
    "license": "Other",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/nfj1380/mrIML"
        }
    ],
    "name": "MrIML",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1111/1755-0998.13495",
            "metadata": {
                "abstract": "© 2021 John Wiley & Sons LtdWe introduce a new R package “MrIML” (“Mister iml”; Multi-response Interpretable Machine Learning). MrIML provides a powerful and interpretable framework that enables users to harness recent advances in machine learning to quantify multilocus genomic relationships, to identify loci of interest for future landscape genetics studies, and to gain new insights into adaptation across environmental gradients. Relationships between genetic variation and environment are often nonlinear and interactive; these characteristics have been challenging to address using traditional landscape genetic approaches. Our package helps capture this complexity and offers functions that fit and interpret a wide range of highly flexible models that are routinely used for single-locus landscape genetics studies but are rarely extended to estimate response functions for multiple loci. To demonstrate the package's broad functionality, we test its ability to recover landscape relationships from simulated genomic data. We also apply the package to two empirical case studies. In the first, we model genetic variation of North American balsam poplar (Populus balsamifera, Salicaceae) populations across environmental gradients. In the second case study, we recover the landscape and host drivers of feline immunodeficiency virus genetic variation in bobcats (Lynx rufus). The ability to model thousands of loci collectively and compare models from linear regression to extreme gradient boosting, within the same analytical framework, has the potential to be transformative. The MrIML framework is also extendable and not limited to modelling genetic variation; for example, it can quantify the environmental drivers of microbiomes and coinfection dynamics.",
                "authors": [
                    {
                        "name": "Carver S."
                    },
                    {
                        "name": "Charleston M."
                    },
                    {
                        "name": "Clark N.J."
                    },
                    {
                        "name": "Forester B.R."
                    },
                    {
                        "name": "Fountain-Jones N.M."
                    },
                    {
                        "name": "Gagne R.B."
                    },
                    {
                        "name": "Greenwell B."
                    },
                    {
                        "name": "Kozakiewicz C.P."
                    },
                    {
                        "name": "Kraberger S."
                    },
                    {
                        "name": "Landguth E.L."
                    },
                    {
                        "name": "Machado G."
                    },
                    {
                        "name": "Mayer M."
                    },
                    {
                        "name": "Trumbo D.R."
                    }
                ],
                "citationCount": 2,
                "date": "2021-11-01T00:00:00Z",
                "journal": "Molecular Ecology Resources",
                "title": "MrIML: Multi-response interpretable machine learning to model genomic landscapes"
            },
            "pmid": "34448358"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        }
    ]
}
