{
    "accessibility": "Open access",
    "additionDate": "2019-05-07T06:46:28Z",
    "biotoolsCURIE": "biotools:PFOND",
    "biotoolsID": "PFOND",
    "cost": "Free of charge",
    "credit": [
        {
            "typeEntity": "Project",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://pfond.cmmt.ubc.ca/contact-pfond/"
        },
        {
            "email": "webmaster@cmmt.ubc.ca",
            "name": "Wasserman Lab",
            "typeEntity": "Division",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Portal for Families Overcoming Neurodevelopmental Disorders (PFOND) provides a structured web interface for the information sharing with individuals struggling with the consequences of rare developmental disorders.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                }
            ]
        }
    ],
    "homepage": "http://pfond.cmmt.ubc.ca/index.html",
    "language": [
        "JavaScript",
        "PHP"
    ],
    "lastUpdate": "2020-06-16T10:55:23Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/pfond/PFOND"
        }
    ],
    "maturity": "Mature",
    "name": "PFOND",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.2196/resprot.2675",
            "metadata": {
                "abstract": "Background: The Portal for Families Overcoming Neurodevelopmental Disorders (PFOND) provides a structured Internet interface for the sharing of information with individuals struggling with the consequences of rare developmental disorders. Large disease-impacted communities can support fundraising organizations that disseminate Web-based information through elegant websites run by professional staff. Such quality resources for families challenged by rare disorders are infrequently produced and, when available, are often dependent upon the continued efforts of a single individual. Objective: The project endeavors to create an intuitive Web-based software system that allows a volunteer with limited technical computer skills to produce a useful rare disease website in a short time period. Such a system should provide access to emerging news and research findings, facilitate community participation, present summary information about the disorder, and allow for transient management by volunteers who are likely to change periodically. Methods: The prototype portal was implemented using the WordPress software system with both existing and customized supplementary plug-in software modules. Gamification scoring features were implemented in a module, allowing editors to measure progress. The system was installed on a Linux-based computer server, accessible across the Internet through standard Web browsers. Results: A prototype PFOND system was implemented and tested. The prototype system features a structured organization with distinct partitions for background information, recent publications, and community discussions. The software design allows volunteer editors to create a themed website, implement a limited set of topic pages, and connect the software to dynamic RSS feeds providing information about recent news or advances. The prototype was assessed by a fraction of the disease sites developed (8 out of 27), including Aarskog-Scott syndrome, Aniridia, Adams-Oliver syndrome, Cat Eye syndrome, Kabuki syndrome, Leigh syndrome, Peters anomaly, and Rothmund-Thomson syndrome. The editor progress score was used to measure performance for a portion of sites. Conclusions: The PFOND system provides a convenient and structured Internet resource for the facilitated creation of information resources for families confronted by rare disorders. The system empowers volunteers to participate in the creation of quality content, while allowing for the inevitable turnover of contributors over time. The next phase of PFOND development will focus on volunteer participation in system development and community engagement.",
                "authors": [
                    {
                        "name": "Ye X.C."
                    },
                    {
                        "name": "Ng I."
                    },
                    {
                        "name": "Seid-Karbasi P."
                    },
                    {
                        "name": "Imam T."
                    },
                    {
                        "name": "Lee C.E."
                    },
                    {
                        "name": "Chen S.Y."
                    },
                    {
                        "name": "Herman A."
                    },
                    {
                        "name": "Sharma B."
                    },
                    {
                        "name": "Johal G."
                    },
                    {
                        "name": "Gu B."
                    },
                    {
                        "name": "Wasserman W.W."
                    }
                ],
                "citationCount": 3,
                "date": "2013-01-01T00:00:00Z",
                "journal": "Journal of Medical Internet Research",
                "title": "Portal for families overcoming neurodevelopmental disorders (PFOND): Implementation of a software framework for facilitated community website creation by nontechnical volunteers"
            },
            "pmcid": "PMC3742411",
            "pmid": "23920006",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application",
        "Web service"
    ],
    "topic": [
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        }
    ],
    "validated": 1
}