{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:07:37Z",
    "biotoolsCURIE": "biotools:DEPOT",
    "biotoolsID": "DEPOT",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "Andrei.Gabrielian@nih.gov",
            "name": "Andrei Gabrielian",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "depot_support@niaid.nih.gov",
            "typeEntity": "Person",
            "typeRole": [
                "Support"
            ]
        }
    ],
    "description": "Multi-domain tuberculosis data analysis resource.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://depot.tbportals.niaid.nih.gov",
    "language": [
        "JavaScript",
        "R"
    ],
    "lastUpdate": "2020-06-16T10:55:25Z",
    "license": "Unlicense",
    "maturity": "Mature",
    "name": "DEPOT",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0217410",
            "metadata": {
                "abstract": "© 2019 Public Library of Science. All rights reserved.The NIAID TB Portals Program (TBPP) established a unique and growing database repository of socioeconomic, geographic, clinical, laboratory, radiological, and genomic data from patient cases of drug-resistant tuberculosis (DR-TB). Currently, there are 2,428 total cases from nine country sites (Azerbaijan, Belarus, Moldova, Georgia, Romania, China, India, Kazakhstan, and South Africa), 1,611 (66%) of which are multidrug- or extensively-drug resistant and 1,185 (49%), 863 (36%), and 952 (39%) of which contain X-ray, computed tomography (CT) scan, and genomic data, respectively. We introduce the Data Exploration Portal (TB DEPOT, https://depot.tbportals.niaid.nih.gov) to visualize and analyze these multi-domain data. The TB DEPOT leverages the TBPP integration of clinical, socioeconomic, genomic, and imaging data into standardized formats and enables user-driven, repeatable, and reproducible analyses. It furthers the TBPP goals to provide a web-enabled analytics platform to countries with a high burden of multidrug-resistant TB (MDR-TB) but limited IT resources and inaccessible data, and enables the reusability of data, in conformity with the NIH's Findable, Accessible, Interoperable, and Reusable (FAIR) principles. TB DEPOT provides access to \"analysis-ready\" data and the ability to generate and test complex clinically-oriented hypotheses instantaneously with minimal statistical background and data processing skills. TB DEPOT is also promising for enhancing medical training and furnishing well annotated, hard to find, MDR-TB patient cases. TB DEPOT, as part of TBPP, further fosters collaborative research efforts to better understand drug-resistant tuberculosis and aid in the development of novel diagnostics and personalized treatment regimens.",
                "authors": [
                    {
                        "name": "Gabrielian A."
                    },
                    {
                        "name": "Engle E."
                    },
                    {
                        "name": "Harris M."
                    },
                    {
                        "name": "Wollenberg K."
                    },
                    {
                        "name": "Juarez-Espinosa O."
                    },
                    {
                        "name": "Glogowski A."
                    },
                    {
                        "name": "Long A."
                    },
                    {
                        "name": "Patti L."
                    },
                    {
                        "name": "Hurt D.E."
                    },
                    {
                        "name": "Rosenthal A."
                    },
                    {
                        "name": "Tartakovsky M."
                    }
                ],
                "citationCount": 1,
                "date": "2019-05-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "TB DEPOT (data exploration portal): A multidomain tuberculosis data analysis resource"
            },
            "pmcid": "PMC6532897",
            "pmid": "31120982"
        }
    ],
    "toolType": [
        "Web application",
        "Database portal"
    ],
    "topic": [
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Respiratory medicine",
            "uri": "http://edamontology.org/topic_3322"
        }
    ]
}