{
    "accessibility": "Open access",
    "additionDate": "2022-04-03T22:03:20.469992Z",
    "biotoolsCURIE": "biotools:plf_svm",
    "biotoolsID": "plf_svm",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "mdsohrawordicse@gmail.com",
            "name": "Md. Sohrawordi"
        },
        {
            "name": "Md. Ali Hossain"
        }
    ],
    "description": "Prediction of lysine formylation sites using support vector machine based on the sample selection from majority classes and synthetic minority over-sampling techniques.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein sequence",
                        "uri": "http://edamontology.org/data_2976"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "PTM localisation",
                    "uri": "http://edamontology.org/operation_3755"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                }
            ]
        }
    ],
    "homepage": "https://plf-svm.herokuapp.com/",
    "lastUpdate": "2022-04-03T22:03:20.473420Z",
    "name": "PLF_SVM",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.BIOCHI.2021.10.001",
            "metadata": {
                "abstract": "© 2021 Elsevier B.V. and Société Française de Biochimie et Biologie Moléculaire (SFBBM)Lysine formylation is a newly discovered and mostly interested type of post-translational modification (PTM) that is generally found on core and linker histone proteins of prokaryote and eukaryote and plays various important roles on the regulation of various cellular mechanisms. Hence, it is very urgent to properly identify formylation site in protein for understanding the molecular mechanism of formylation deeply and defining drug for relevant diseases. As experimentally identification of formylation site using traditional processes are expensive and time consuming, a simple and high speedy mathematical model for predicting accurately lysine formylation sites is highly desired. A useful computational model named PLF_SVM is deigned and proposed in this study by using binary encoding (BE), amino acid composition (AAC), reverse position relative incidence matrix (RPRIM), position relative incidence matrix (PRIM), and position specific amino acid propensity (PSAAP) feature generation methods for predicting formylated and non-formylated lysine sites. Besides, the Synthetic Minority Oversampling Technique (SMOTE) and a proposed sample selection strategy named EnSVM are applied to handle the imbalance training dataset problem. Thereafter, the optimal number of features are selected by F-score method to train the model. Finally, it has been seen that PLF_SVM outperforms the state-of-the-art approaches in validation and independent test with an accuracy of 98.61% and 98.77% respectively. At https://plf-svm.herokuapp.com/, a user-friendly web tool is also created for identifying formylation sites. Therefore, the proposed method may be helpful guideline for the analysis and prediction of formylated lysine and knowing the process of cellular regulation.",
                "authors": [
                    {
                        "name": "Hossain M.A."
                    },
                    {
                        "name": "Sohrawordi M."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Biochimie",
                "title": "Prediction of lysine formylation sites using support vector machine based on the sample selection from majority classes and synthetic minority over-sampling techniques"
            },
            "pmid": "34627982"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ],
    "validated": 1
}
