{
    "additionDate": "2020-01-14T09:06:40Z",
    "biotoolsCURIE": "biotools:ContinuousFlex",
    "biotoolsID": "ContinuousFlex",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "slavica.jonic@upmc.fr",
            "name": "Slavica Jonić",
            "orcidid": "https://orcid.org/0000-0001-5112-2743",
            "typeEntity": "Person"
        },
        {
            "name": "Mohamad Harastani"
        }
    ],
    "description": "Hybrid Electron Microscopy Normal Mode Analysis with Scipion.\nPlugin to use continuousflex protocols within the Scipion framework.\nThis plugin provides HEMNMA and StructMap protocols and is frequently updated.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                },
                {
                    "term": "Single particle analysis",
                    "uri": "http://edamontology.org/operation_3457"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://pypi.org/project/scipion-em-continuousflex",
    "language": [
        "MATLAB",
        "Python"
    ],
    "lastUpdate": "2023-01-08T15:43:54.750894Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/scipion-em/scipion-em-continuousflex"
        }
    ],
    "name": "ContinuousFlex",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/PRO.3772",
            "metadata": {
                "abstract": "© 2019 The Protein SocietyHybrid Electron Microscopy Normal Mode Analysis (HEMNMA) method was introduced in 2014. HEMNMA computes normal modes of a reference model (an atomic structure or an electron microscopy map) of a molecular complex and uses this model and its normal modes to analyze single-particle images of the complex to obtain information on its continuous conformational changes, by determining the full distribution of conformational variability from the images. An advantage of HEMNMA is a simultaneous determination of all parameters of each image (particle conformation, orientation, and shift) through their iterative optimization, which allows applications of HEMNMA even when the effects of conformational changes dominate those of orientational changes. HEMNMA was first implemented in Xmipp and was using MATLAB for statistical analysis of obtained conformational distributions and for fitting of underlying trajectories of conformational changes. A HEMNMA implementation independent of MATLAB is now available as part of a plugin of Scipion V2.0 (http://scipion.i2pc.es). This plugin, named ContinuousFlex, can be installed by following the instructions at https://pypi.org/project/scipion-em-continuousflex. In this article, we present this new HEMNMA software, which is user-friendly, totally free, and open-source. Statement for a Broader Audience: This article presents Hybrid Electron Microscopy Normal Mode Analysis (HEMNMA) software that allows analyzing single-particle images of a complex to obtain information on continuous conformational changes of the complex, by determining the full distribution of conformational variability from the images. The HEMNMA software is user-friendly, totally free, open-source, and available as part of ContinuousFlex plugin (https://pypi.org/project/scipion-em-continuousflex) of Scipion V2.0 (http://scipion.i2pc.es).",
                "authors": [
                    {
                        "name": "Harastani M."
                    },
                    {
                        "name": "Jonic S."
                    },
                    {
                        "name": "Sorzano C.O.S."
                    }
                ],
                "citationCount": 15,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Protein Science",
                "title": "Hybrid Electron Microscopy Normal Mode Analysis with Scipion"
            },
            "pmcid": "PMC6933837",
            "pmid": "31693263"
        },
        {
            "doi": "10.1016/J.JSB.2022.107906",
            "metadata": {
                "abstract": "© 2022 Elsevier Inc.ContinuousFlex is a user-friendly open-source software package for analyzing continuous conformational variability of macromolecules in cryo electron microscopy (cryo-EM) and cryo electron tomography (cryo-ET) data. In 2019, ContinuousFlex became available as a plugin for Scipion, an image processing software package extensively used in the cryo-EM field. Currently, ContinuousFlex contains software for running (1) recently published methods HEMNMA-3D, TomoFlow, and NMMD; (2) earlier published methods HEMNMA and StructMap; and (3) methods for simulating cryo-EM and cryo-ET data with conformational variability and methods for data preprocessing. It also includes external software for molecular dynamics simulation (GENESIS) and normal mode analysis (ElNemo), used in some of the mentioned methods. The HEMNMA software has been presented in the past, but not the software of other methods. Besides, ContinuousFlex currently also offers a deep learning extension of HEMNMA, named DeepHEMNMA. In this article, we review these methods in the context of the ContinuousFlex package, developed to facilitate their use by the community.",
                "authors": [
                    {
                        "name": "Hamitouche I."
                    },
                    {
                        "name": "Harastani M."
                    },
                    {
                        "name": "Jonic S."
                    },
                    {
                        "name": "Moghadam N.B."
                    },
                    {
                        "name": "Vuillemot R."
                    }
                ],
                "citationCount": 1,
                "date": "2022-12-01T00:00:00Z",
                "journal": "Journal of Structural Biology",
                "title": "ContinuousFlex: Software package for analyzing continuous conformational variability of macromolecules in cryo electron microscopy and tomography data"
            },
            "pmid": "36244611"
        }
    ],
    "toolType": [
        "Plug-in"
    ],
    "topic": [
        {
            "term": "Electron microscopy",
            "uri": "http://edamontology.org/topic_0611"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        }
    ],
    "validated": 1
}
