{
    "additionDate": "2022-10-03T05:41:25.983009Z",
    "biotoolsCURIE": "biotools:dprot",
    "biotoolsID": "dprot",
    "credit": [
        {
            "name": "Gajendra P.S. Raghava",
            "url": "https://webs.iiitd.edu.in/raghava/dprot/home.html"
        }
    ],
    "description": "DPROT is a PSSM based predictor for the prediction of disordered proteins. A simple two state prediction id done over the query protein.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/dprot/home.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "https://webs.iiitd.edu.in/raghava/dprot/home.html",
    "lastUpdate": "2022-10-03T05:43:29.793678Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/dprot/home.html"
        }
    ],
    "name": "dprot",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "raghavagps",
    "publication": [
        {
            "doi": "10.1007/s00726-008-0085-y",
            "metadata": {
                "abstract": "The association of structurally disordered proteins with a number of diseases has engendered enormous interest and therefore demands a prediction method that would facilitate their expeditious study at molecular level. The present study describes the development of a computational method for predicting disordered proteins using sequence and profile compositions as input features for the training of SVM models. First, we developed the amino acid and dipeptide compositions based SVM modules which yielded sensitivities of 75.6 and 73.2% along with Matthew's Correlation Coefficient (MCC) values of 0.75 and 0.60, respectively. In addition, the use of predicted secondary structure content (coil, sheet and helices) in the form of composition values attained a sensitivity of 76.8% and MCC value of 0.77. Finally, the training of SVM models using evolutionary information hidden in the multiple sequence alignment profile improved the prediction performance by achieving a sensitivity value of 78% and MCC of 0.78. Furthermore, when evaluated on an independent dataset of partially disordered proteins, the same SVM module provided a correct prediction rate of 86.6%. Based on the above study, a web server (\"DPROT\") was developed for the prediction of disordered proteins, which is available at http://www.imtech.res.in/raghava/dprot/. © 2008 Springer-Verlag.",
                "authors": [
                    {
                        "name": "Garg A."
                    },
                    {
                        "name": "Raghava G.P.S."
                    },
                    {
                        "name": "Sethi D."
                    }
                ],
                "citationCount": 11,
                "date": "2008-10-01T00:00:00Z",
                "journal": "Amino Acids",
                "title": "DPROT: Prediction of disordered proteins using evolutionary information"
            },
            "pmid": "18425404"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ]
}
