
{
    "credit": [
        {
            "email": "ferran.sanz@upf.edu",
            "name": "Ferran Sanz",
            "typeEntity": "Person",
            "typeRoles": [
                "Contributor"
            ]
        },
        {
            "email": "janet.pinero@upf.edu",
            "name": "Janet Piñero",
            "typeRoles": [
                "Contributor",
                "Developer",
                "Maintainer",
                "Support"
            ]
        },
        {
            "name": "Núria Queralt Rosinach",
            "typeRoles": [
                "Developer",
                "Contributor"
            ]
        },
        {
            "email": "laura.furlong@upf.edu",
            "name": "Laura I. Furlong",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://grib.imim.es/about-us/laurai-furlong/"
        },
        {
            "name": "Alba Gutiérrez-Sacristán",
            "typeEntity": "Person",
            "typeRoles": [
                "Developer"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://www.disgenet.org/dbinfo"
        }
    ],
    "download": [
        {
            "note": "disgenet2r R package",
            "url": "https://bitbucket.org/ibi_group/disgenet2r/"
        },
        {
            "type": "Downloads page",
            "url": "http://www.disgenet.org/downloads"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Identifier",
                        "uri": "http://edamontology.org/data_0842"
                    },
                    "format": [
                        {
                            "term": "TSV",
                            "uri": "http://edamontology.org/format_3475"
                        }
                    ]
                }
            ],
            "note": "The current version of DisGeNET (v6.0) contains 628,685 gene-disease associations (GDAs), between 17,549 genes and 24,166 diseases, disorders, traits, and clinical or abnormal human phenotypes, and 210,498 variant-disease associations (VDAs), between 117,337 variants and 10,358 diseases, traits, and phenotypes.",
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Variant prioritisation",
                    "uri": "http://edamontology.org/operation_3226"
                },
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Database search results",
                        "uri": "http://edamontology.org/data_2080"
                    },
                    "format": [
                        {
                            "term": "TSV",
                            "uri": "http://edamontology.org/format_3475"
                        }
                    ]
                }
            ]
        }
    ],
    "labels": {
        "accessibility": [
            "Open access"
        ],
        "collectionID": [
            "Drug Research and Development",
            "Rare Disease",
            "Complex Disease",
            "Mendelian Disease"
        ],
        "cost": "Free of charge",
        "elixirNode": [
            "Spain"
        ],
        "elixirPlatform": [
            "Interoperability"
        ],
        "license": "CC-BY-NC-SA-4.0",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Plug-in",
            "SPARQL endpoint",
            "Web application",
            "Web API",
            "Database portal"
        ],
        "topic": [
            {
                "term": "Translational medicine",
                "uri": "http://edamontology.org/topic_3342"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Biomedical science",
                "uri": "http://edamontology.org/topic_3344"
            },
            {
                "term": "Genetic variation",
                "uri": "http://edamontology.org/topic_0199"
            },
            {
                "term": "Natural language processing",
                "uri": "http://edamontology.org/topic_0218"
            },
            {
                "term": "Ontology and terminology",
                "uri": "http://edamontology.org/topic_0089"
            },
            {
                "term": "Bioinformatics",
                "uri": "http://edamontology.org/topic_0091"
            },
            {
                "term": "Data integration and warehousing",
                "uri": "http://edamontology.org/topic_3366"
            },
            {
                "term": "Data identity and mapping",
                "uri": "http://edamontology.org/topic_3345"
            }
        ]
    },
    "link": [
        {
            "type": "Repository",
            "url": "http://www.disgenet.org/"
        }
    ],
    "publication": [
        {
            "abstract": "© The Author(s) 2015. Published by Oxford University Press.DisGeNET is a comprehensive discovery platform designed to address a variety of questions concerning the genetic underpinning of human diseases. DisGeNET contains over 380 000 associations between >16 000 genes and 13 000 diseases, which makes it one of the largest repositories currently available of its kind. DisGeNET integrates expert-curated databases with text-mined data, covers information on Mendelian and complex diseases, and includes data from animal disease models. It features a score based on the supporting evidence to prioritize gene-disease associations. It is an open access resource available through a web interface, a Cytoscape plugin and as a Semantic Web resource. The web interface supports user-friendly data exploration and navigation. DisGeNET data can also be analysed via the DisGeNET Cytoscape plugin, and enriched with the annotations of other plugins of this popular network analysis software suite. Finally, the information contained in DisGeNET can be expanded and complemented using Semantic Web technologies and linked to a variety of resources already present in the Linked Data cloud. Hence, DisGeNET offers one of the most comprehensive collections of human gene-disease associations and a valuable set of tools for investigating the molecular mechanisms underlying diseases of genetic origin, designed to fulfill the needs of different user profiles, including bioinformaticians, biologists and health-care practitioners.",
            "authors": [
                "Pinero J.",
                "Queralt-Rosinach N.",
                "Bravo A.",
                "Deu-Pons J.",
                "Bauer-Mehren A.",
                "Baron M.",
                "Sanz F.",
                "Furlong L.I."
            ],
            "cit_count": 253,
            "doi": "10.1093/database/bav028",
            "journal": "Database",
            "title": "DisGeNET: A discovery platform for the dynamical exploration of human diseases and their genes",
            "type": "Primary",
            "year": "2015-01-01"
        },
        {
            "abstract": "© The Author(s) 2016. The information about the genetic basis of human diseases lies at the heart of precision medicine and drug discovery. However, to realize its full potential to support these goals, several problems, such as fragmentation, heterogeneity, availability and different conceptualization of the data must be overcome. To provide the community with a resource free of these hurdles, we have developed DisGeNET (http://www.disgenet.org), one of the largest available collections of genes and variants involved in human diseases. DisGeNET integrates data from expert curated repositories, GWAS catalogues, animal models and the scientific literature. DisGeNET data are homogeneously annotated with controlled vocabularies and community-driven ontologies. Additionally, several original metrics are provided to assist the prioritization of genotype-phenotype relationships. The information is accessible through a web interface, a Cytoscape App, an RDF SPARQL endpoint, scripts in several programming languages and an R package. DisGeNET is a versatile platform that can be used for different research purposes including the investigation of the molecular underpinnings of specific human diseases and their comorbidities, the analysis of the properties of disease genes, the generation of hypothesis on drug therapeutic action and drug adverse effects, the validation of computationally predicted disease genes and the evaluation of text-mining methods performance.",
            "authors": [
                "Pinero J.",
                "Bravo A.",
                "Queralt-Rosinach N.",
                "Gutierrez-Sacristan A.",
                "Deu-Pons J.",
                "Centeno E.",
                "Garcia-Garcia J.",
                "Sanz F.",
                "Furlong L.I."
            ],
            "cit_count": 211,
            "doi": "10.1093/nar/gkw943",
            "journal": "Nucleic Acids Research",
            "title": "DisGeNET: A comprehensive platform integrating information on human disease-associated genes and variants",
            "type": "Primary",
            "year": "2017-01-01"
        },
        {
            "abstract": "Summary: DisGeNET is a plugin for Cytoscape to query and analyze human gene-disease networks. DisGeNET allows user-friendly access to a new gene-disease database that we have developed by integrating data from several public sources. DisGeNET permits queries restricted to (i) the original data source, (ii) the association type, (iii) the disease class or (iv) specific gene(s)/disease(s). It represents gene-disease associations in terms of bipartite graphs and provides gene centric and disease centric views of the data. It assists the user in the interpretation and exploration of the genetic basis of human diseases by a variety of built-in functions. Moreover, DisGeNET permits multicolouring of nodes (genes/diseases) according to standard disease classification for expedient visualization. © The Author 2010. Published by Oxford University Press. All rights reserved.",
            "authors": [
                "Bauer-Mehren A.",
                "Rautschka M.",
                "Sanz F.",
                "Furlong L.I."
            ],
            "cit_count": 104,
            "doi": "10.1093/bioinformatics/btq538",
            "journal": "Bioinformatics",
            "title": "DisGeNET: A Cytoscape plugin to visualize, integrate, search and analyze gene-disease networks",
            "type": "Method",
            "year": "2010-11-01"
        },
        {
            "abstract": "© 2016 The Author 2016. Published by Oxford University Press. Motivation: DisGeNET-RDF makes available knowledge on the genetic basis of human diseases in the Semantic Web. Gene-disease associations (GDAs) and their provenance metadata are published as human-readable and machine-processable web resources. The information on GDAs included in DisGeNET-RDF is interlinked to other biomedical databases to support the development of bioinformatics approaches for translational research through evidence-based exploitation of a rich and fully interconnected linked open data. Availability and implementation: http://rdf.disgenet.org/ Contact:",
            "authors": [
                "Queralt-Rosinach N.",
                "Pinero J.",
                "Bravo A.",
                "Sanz F.",
                "Furlong L.I."
            ],
            "cit_count": 18,
            "doi": "10.1093/bioinformatics/btw214",
            "journal": "Bioinformatics",
            "title": "DisGeNET-RDF: Harnessing the innovative power of the Semantic Web to explore the genetic basis of diseases",
            "type": "Method",
            "year": "2016-07-15"
        },
        {
            "abstract": "Background: Scientists have been trying to understand the molecular mechanisms of diseases to design preventive and therapeutic strategies for a long time. For some diseases, it has become evident that it is not enough to obtain a catalogue of the disease-related genes but to uncover how disruptions of molecular networks in the cell give rise to disease phenotypes. Moreover, with the unprecedented wealth of information available, even obtaining such catalogue is extremely difficult. Principal Findings: We developed a comprehensive gene-disease association database by integrating associations from several sources that cover different biomedical aspects of diseases. In particular, we focus on the current knowledge of human genetic diseases including mendelian, complex and environmental diseases. To assess the concept of modularity of human diseases, we performed a systematic study of the emergent properties of human gene-disease networks by means of network topology and functional annotation analysis. The results indicate a highly shared genetic origin of human diseases and show that for most diseases, including mendelian, complex and environmental diseases, functional modules exist. Moreover, a core set of biological pathways is found to be associated with most human diseases. We obtained similar results when studying clusters of diseases, suggesting that related diseases might arise due to dysfunction of common biological processes in the cell. Conclusions: For the first time, we include mendelian, complex and environmental diseases in an integrated gene-disease association database and show that the concept of modularity applies for all of them. We furthermore provide a functional analysis of disease-related modules providing important new biological insights, which might not be discovered when considering each of the gene-disease association repositories independently. Hence, we present a suitable framework for the study of how genetic and environmental factors, such as drugs, contribute to diseases. Availability: The gene-disease networks used in this study and part of the analysis are available at http://ibi.imim.es/DisGeNET/DisGeNETweb.html#Download. © 2011 Bauer-Mehren et al.",
            "authors": [
                "Bauer-Mehren A.",
                "Bundschus M.",
                "Rautschka M.",
                "Mayer M.A.",
                "Sanz F.",
                "Furlong L.I."
            ],
            "cit_count": 101,
            "doi": "10.1371/journal.pone.0020284",
            "journal": "PLoS ONE",
            "title": "Gene-disease network analysis reveals functional modules in mendelian, complex and environmental diseases",
            "type": "Usage",
            "year": "2011-06-20"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:disgenet",
        "biotoolsID": "disgenet",
        "description": "DisGeNET is a discovery platform containing one of the largest publicly available collections of genes and variants associated to human diseases. DisGeNET integrates data from expert curated repositories, GWAS catalogues, animal models and the scientific literature. DisGeNET data are homogeneously annotated with controlled vocabularies and community-driven ontologies. Additionally, several original metrics are provided to assist the prioritization of genotype–phenotype relationships.\n\nThe current version of DisGeNET (v6.0) contains 628,685 gene-disease associations (GDAs), between 17,549 genes and 24,166 diseases, disorders, traits, and clinical or abnormal human phenotypes, and 210,498 variant-disease associations (VDAs), between 117,337 variants and 10,358 diseases, traits, and phenotypes.",
        "homepage": "http://www.disgenet.org/",
        "name": "DisGeNET",
        "version": [
            "Database version 6.0",
            "Platform v1.1.0",
            "REST API v1.0.0",
            "DisGeNET RDF release 5.0",
            "disgenet2r R package Version: 0.0.9"
        ]
    }
}