{
    "additionDate": "2021-01-18T11:54:41Z",
    "biotoolsCURIE": "biotools:i2d_r",
    "biotoolsID": "i2d_r",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ke.xu@yale.edu",
            "name": "Ke Xu",
            "typeEntity": "Person"
        }
    ],
    "description": "An R package for simulating data from images and the implications in biomedical research.\n\nThe R package i2d is a novel tool that allows users to transform an image into a simulated dataset that can be used to extract and analyze the complex information in biomedical and biological research. The package also includes three novel and efficient methods for image clustering based on finding minimum spanning tree by Prim's algorithm, detecting communities by modularity optimization, and finding the branches of the backbone of minimum spanning tree.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "http://github.com/XiaoyuLiang/i2d",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T20:46:06.763593Z",
    "name": "i2d_R",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btaa991",
            "metadata": {
                "abstract": "Motivation: High-quality imaging analyses have been proposed to drive innovation in biomedical and biological research. However, the application of images remains underexploited because of the limited capacity of human vision and the challenges in extracting quantitative information from images. Computationally extracting quantitative information from images is critical to overcoming this limitation. Here, we present a novel R package, i2d, to simulate data from an image based on digital convolution. Results: The R package i2d allows users to transform an image into a simulated dataset that can be used to extract and analyze complex information in biomedical and biological research. The package also includes three novel and efficient methods for graph clustering based on simulated data, which can be used to dissect complex gene networks into sub-clusters that have similar biological functions.",
                "authors": [
                    {
                        "name": "Hu Y."
                    },
                    {
                        "name": "Liang X."
                    },
                    {
                        "name": "Xu K."
                    },
                    {
                        "name": "Yan C."
                    }
                ],
                "date": "2021-08-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "I2d: An R package for simulating data from images and the implications in biomedical research"
            },
            "pmcid": "PMC8388026",
            "pmid": "33244599"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        }
    ]
}
