{
    "accessibility": "Open access",
    "additionDate": "2022-03-21T11:51:45.566274Z",
    "biotoolsCURIE": "biotools:hyb",
    "biotoolsID": "hyb",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "gkudla@gmail.com",
            "name": "Grzegorz Kudla",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "hyb is a bioinformatics pipeline for analysis of CLASH (crosslinking, ligation and sequencing of hybrids) data.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/gkudla/hyb",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2022-03-21T11:51:45.568764Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/gkudla/hyb/issues"
        }
    ],
    "name": "hyb",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/j.ymeth.2013.10.015",
            "metadata": {
                "abstract": "Associations between proteins and RNA-RNA duplexes are important in post-transcriptional regulation of gene expression. The CLASH (Cross-linking, Ligation and Sequencing of Hybrids) technique captures RNA-RNA interactions by physically joining two RNA molecules associated with a protein complex into a single chimeric RNA molecule. These events are relatively rare and considerable effort is needed to detect a small number of chimeric sequences amongst millions of non-chimeric cDNA reads resulting from a CLASH experiment. We present the \"hyb\" bioinformatics pipeline, which we developed to analyse high-throughput cDNA sequencing data from CLASH experiments. Although primarily designed for use with AGO CLASH data, hyb can also be used for the detection and annotation of chimeric reads in other high-throughput sequencing datasets. We examined the sensitivity and specificity of chimera detection in a test dataset using the BLAST, BLAST+, BLAT, pBLAT and Bowtie2 read alignment programs. We obtained the most reliable results in the shortest time using a combination of preprocessing with Flexbar and subsequent read-mapping using Bowtie2. The \"hyb\" software is distributed under the GNU GPL (General Public License) and can be downloaded from https://github.com/gkudla/hyb. © 2013 The Authors.",
                "authors": [
                    {
                        "name": "Helwak A."
                    },
                    {
                        "name": "Kudla G."
                    },
                    {
                        "name": "Moody J."
                    },
                    {
                        "name": "Tollervey D."
                    },
                    {
                        "name": "Travis A.J."
                    }
                ],
                "citationCount": 40,
                "date": "2014-02-01T00:00:00Z",
                "journal": "Methods",
                "title": "Hyb: A bioinformatics pipeline for the analysis of CLASH (crosslinking, ligation and sequencing of hybrids) data"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script",
        "Workflow"
    ],
    "topic": [
        {
            "term": "Gene structure",
            "uri": "http://edamontology.org/topic_0114"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
