{
    "accessibility": "Open access",
    "additionDate": "2023-11-07T15:12:34.182381Z",
    "biotoolsCURIE": "biotools:deepmpf",
    "biotoolsID": "deepmpf",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "m19995002283@163.com",
            "name": "Yan-Fang Ma",
            "typeEntity": "Person"
        },
        {
            "email": "xaycq@163.com",
            "name": "Chang-Qing Yu",
            "typeEntity": "Person"
        },
        {
            "email": "zhuhongyou@nwpu.edu.cn",
            "name": "Zhu-Hong You",
            "typeEntity": "Person"
        },
        {
            "email": "zouquan@nclab.net",
            "name": "Quan Zou",
            "typeEntity": "Person"
        }
    ],
    "description": "Deep learning framework for predicting drug-target interactions based on multi-modal representation with meta-path semantic analysis.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein sequence",
                        "uri": "http://edamontology.org/data_2976"
                    },
                    "format": [
                        {
                            "term": "SMILES",
                            "uri": "http://edamontology.org/format_1196"
                        },
                        {
                            "term": "uniprotkb-like format",
                            "uri": "http://edamontology.org/format_2547"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Local alignment",
                    "uri": "http://edamontology.org/operation_0495"
                },
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                },
                {
                    "term": "Small molecule design",
                    "uri": "http://edamontology.org/operation_4009"
                }
            ]
        }
    ],
    "homepage": "http://120.77.11.78/DeepMPF/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-11-07T15:12:34.184844Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/MrPhil/DeepMPF"
        }
    ],
    "name": "DeepMPF",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12967-023-03876-3",
            "metadata": {
                "abstract": "Background: Drug-target interaction (DTI) prediction has become a crucial prerequisite in drug design and drug discovery. However, the traditional biological experiment is time-consuming and expensive, as there are abundant complex interactions present in the large size of genomic and chemical spaces. For alleviating this phenomenon, plenty of computational methods are conducted to effectively complement biological experiments and narrow the search spaces into a preferred candidate domain. Whereas, most of the previous approaches cannot fully consider association behavior semantic information based on several schemas to represent complex the structure of heterogeneous biological networks. Additionally, the prediction of DTI based on single modalities cannot satisfy the demand for prediction accuracy. Methods: We propose a multi-modal representation framework of ‘DeepMPF’ based on meta-path semantic analysis, which effectively utilizes heterogeneous information to predict DTI. Specifically, we first construct protein–drug-disease heterogeneous networks composed of three entities. Then the feature information is obtained under three views, containing sequence modality, heterogeneous structure modality and similarity modality. We proposed six representative schemas of meta-path to preserve the high-order nonlinear structure and catch hidden structural information of the heterogeneous network. Finally, DeepMPF generates highly representative comprehensive feature descriptors and calculates the probability of interaction through joint learning. Results: To evaluate the predictive performance of DeepMPF, comparison experiments are conducted on four gold datasets. Our method can obtain competitive performance in all datasets. We also explore the influence of the different feature embedding dimensions, learning strategies and classification methods. Meaningfully, the drug repositioning experiments on COVID-19 and HIV demonstrate DeepMPF can be applied to solve problems in reality and help drug discovery. The further analysis of molecular docking experiments enhances the credibility of the drug candidates predicted by DeepMPF. Conclusions: All the results demonstrate the effectively predictive capability of DeepMPF for drug-target interactions. It can be utilized as a useful tool to prescreen the most potential drug candidates for the protein. The web server of the DeepMPF predictor is freely available at http://120.77.11.78/DeepMPF/, which can help relevant researchers to further study.",
                "authors": [
                    {
                        "name": "Guan Y.-J."
                    },
                    {
                        "name": "Ma Y.-F."
                    },
                    {
                        "name": "Pan J."
                    },
                    {
                        "name": "Ren Z.-H."
                    },
                    {
                        "name": "Wang X.-F."
                    },
                    {
                        "name": "You H.-R."
                    },
                    {
                        "name": "You Z.-H."
                    },
                    {
                        "name": "Yu C.-Q."
                    },
                    {
                        "name": "Zou Q."
                    }
                ],
                "citationCount": 3,
                "date": "2023-12-01T00:00:00Z",
                "journal": "Journal of Translational Medicine",
                "title": "DeepMPF: deep learning framework for predicting drug–target interactions based on multi-modal representation with meta-path semantic analysis"
            },
            "pmcid": "PMC9876420",
            "pmid": "36698208"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Drug development",
            "uri": "http://edamontology.org/topic_3373"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
