{
    "accessibility": "Open access",
    "additionDate": "2022-06-10T08:52:17.173260Z",
    "biotoolsCURIE": "biotools:sortpred",
    "biotoolsID": "sortpred",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "bala@ajou.ac.kr",
            "name": "Balachandran Manavalan",
            "typeEntity": "Person"
        },
        {
            "email": "evodevo@smu.ac.kr",
            "name": "Chang-Bae Kim",
            "typeEntity": "Person"
        },
        {
            "name": "Adeel Malik"
        },
        {
            "name": "Sathiyamoorthy Subramaniyam"
        }
    ],
    "description": "The first machine learning based predictor to identify bacterial sortases and their classes using sequence-derived information.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "https://procarb.org/sortpred",
    "lastUpdate": "2022-06-10T08:52:17.175871Z",
    "name": "SortPred",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.CSBJ.2021.12.014",
            "metadata": {
                "abstract": "© 2021 The AuthorsSortase enzymes are cysteine transpeptidases that embellish the surface of Gram-positive bacteria with various proteins thereby allowing these microorganisms to interact with their neighboring environment. It is known that several of their substrates can cause pathological implications, so researchers have focused on the development of sortase inhibitors. Currently, six different classes of sortases (A-F) are recognized. However, with the extensive application of bacterial genome sequencing projects, the number of potential sortases in the public databases has exploded, presenting considerable challenges in annotating these sequences. It is very laborious and time-consuming to characterize these sortase classes experimentally. Therefore, this study developed the first machine-learning-based two-layer predictor called SortPred, where the first layer predicts the sortase from the given sequence and the second layer predicts their class from the predicted sortase. To develop SortPred, we constructed an original benchmarking dataset and investigated 31 feature descriptors, primarily on five feature encoding algorithms. Afterward, each of these descriptors were trained using a random forest classifier and their robustness was evaluated with an independent dataset. Finally, we selected the final model independently for both layers depending on the performance consistency between cross-validation and independent evaluation. SortPred is expected to be an effective tool for identifying bacterial sortases, which in turn may aid in designing sortase inhibitors and exploring their functions. The SortPred webserver and a standalone version are freely accessible at: https://procarb.org/sortpred.",
                "authors": [
                    {
                        "name": "Kim C.-B."
                    },
                    {
                        "name": "Malik A."
                    },
                    {
                        "name": "Manavalan B."
                    },
                    {
                        "name": "Subramaniyam S."
                    }
                ],
                "citationCount": 3,
                "date": "2022-01-01T00:00:00Z",
                "journal": "Computational and Structural Biotechnology Journal",
                "title": "SortPred: The first machine learning based predictor to identify bacterial sortases and their classes using sequence-derived information"
            },
            "pmcid": "PMC8703055",
            "pmid": "34976319"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
