{
    "additionDate": "2021-05-26T20:52:27Z",
    "biotoolsCURIE": "biotools:metawrap",
    "biotoolsID": "metawrap",
    "credit": [
        {
            "email": "james@taylorlab.org",
            "name": "James Taylor",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "Jocelyne DiRuggiero",
            "orcidid": "https://orcid.org/0000-0001-6721-8061",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "james@taylorlab.org",
            "name": "Taylor Lab at Johns Hopkins University",
            "typeEntity": "Division",
            "url": "http://taylorlab.org/"
        },
        {
            "name": "Gherman V. Uritskiy",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ],
            "url": "https://github.com/ursky"
        }
    ],
    "description": "MetaWRAP aims to be an easy-to-use metagenomic wrapper suite that accomplishes the core tasks of metagenomic analysis from start to finish: read quality control, assembly, visualization, taxonomic profiling, extracting draft genomes (binning), and functional annotation.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/bxlab/metaWRAP/blob/master/Usage_tutorial.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Read binning",
                    "uri": "http://edamontology.org/operation_3798"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Demultiplexing",
                    "uri": "http://edamontology.org/operation_3933"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bxlab/metaWRAP",
    "language": [
        "Shell",
        "Python"
    ],
    "lastUpdate": "2021-07-20T20:31:35.814929Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/bxlab/metaWRAP/issues"
        }
    ],
    "name": "MetaWRAP",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/s40168-018-0541-1",
            "metadata": {
                "abstract": "© 2018 The Author(s).Background: The study of microbiomes using whole-metagenome shotgun sequencing enables the analysis of uncultivated microbial populations that may have important roles in their environments. Extracting individual draft genomes (bins) facilitates metagenomic analysis at the single genome level. Software and pipelines for such analysis have become diverse and sophisticated, resulting in a significant burden for biologists to access and use them. Furthermore, while bin extraction algorithms are rapidly improving, there is still a lack of tools for their evaluation and visualization. Results: To address these challenges, we present metaWRAP, a modular pipeline software for shotgun metagenomic data analysis. MetaWRAP deploys state-of-the-art software to handle metagenomic data processing starting from raw sequencing reads and ending in metagenomic bins and their analysis. MetaWRAP is flexible enough to give investigators control over the analysis, while still being easy-to-install and easy-to-use. It includes hybrid algorithms that leverage the strengths of a variety of software to extract and refine high-quality bins from metagenomic data through bin consolidation and reassembly. MetaWRAP's hybrid bin extraction algorithm outperforms individual binning approaches and other bin consolidation programs in both synthetic and real data sets. Finally, metaWRAP comes with numerous modules for the analysis of metagenomic bins, including taxonomy assignment, abundance estimation, functional annotation, and visualization. Conclusions: MetaWRAP is an easy-to-use modular pipeline that automates the core tasks in metagenomic analysis, while contributing significant improvements to the extraction and interpretation of high-quality metagenomic bins. The bin refinement and reassembly modules of metaWRAP consistently outperform other binning approaches. Each module of metaWRAP is also a standalone component, making it a flexible and versatile tool for tackling metagenomic shotgun sequencing data. MetaWRAP is open-source software available at https://github.com/bxlab/metaWRAP.",
                "authors": [
                    {
                        "name": "Uritskiy G.V."
                    },
                    {
                        "name": "Diruggiero J."
                    },
                    {
                        "name": "Taylor J."
                    }
                ],
                "citationCount": 149,
                "date": "2018-09-15T00:00:00Z",
                "journal": "Microbiome",
                "title": "MetaWRAP - A flexible pipeline for genome-resolved metagenomic data analysis 08 Information and Computing Sciences 0803 Computer Software 08 Information and Computing Sciences 0806 Information Systems"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "Metagenomic sequencing",
            "uri": "http://edamontology.org/topic_3837"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        }
    ]
}