{
    "additionDate": "2021-11-01T08:39:05.359688Z",
    "biotoolsCURIE": "biotools:oric-ens",
    "biotoolsID": "oric-ens",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "swakkhar@cse.uiu.ac.bd",
            "name": "Swakkhar Shatabda",
            "orcidid": "https://orcid.org/0000-0003-0669-072X",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "OriC-ENS is a sequence-based ensemble classifier for predicting origin of replication in S. cerevisiae. DNA Replication plays the most crucial part in biological inheritance, ensuring an even flow of genetic information from parent to offspring.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                }
            ]
        }
    ],
    "homepage": "https://github.com/MehediAzim/OriC-ENS",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-11-01T08:40:15.906602Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/MehediAzim/OriC-ENS/issues"
        }
    ],
    "name": "OriC-ENS",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.COMPBIOLCHEM.2021.107502",
            "metadata": {
                "abstract": "© 2021 Elsevier LtdDNA Replication plays the most crucial part in biological inheritance, ensuring an even flow of genetic information from parent to offspring. The beginning site of DNA Replication which is called the Origin of Replication (ORI), plays a significant role in understanding the molecular mechanisms and genomic analysis of DNA. Hence, it is paramount to accurately identify the origin of replication to gain a more accurate understanding of the biochemical and genomic properties of DNA. In this paper, We have proposed a new approach named OriC-ENS that uses sequence-based feature extraction techniques, K-mer, K-gapped Mono-Di, and Di Mono, and an ensemble classification technique that uses majority voting for the identification of Origin of Replication. We have used three SVM classifiers, one for the K-mer features and two more for K-Gapped Mono-Di and K-Gapped Di-mono features. Finally, we used majority voting to combine the prediction by each predictor. Experimental results on the S. Cerevisiae dataset have shown that our method achieves an accuracy of 91.62 % which outperforms other state-of-the-art methods by a significant margin. We have also tested our method using other evaluation metrics such as Matthews Correlation Coefficient (MCC), Area Under Curve(AUC), Sensitivity, and Specificity, where it has achieved a score of 0.83, 0.98, 0.90, and 0.92 respectively. We have further evaluated our model on an independent test set collected from OriDB, consisting of the sequences of Schizosaccharomyces pombe where we have seen that our model can predict the origin of replication efficiently and with great precision. We have made our python-based source code available at https://github.com/MehediAzim/OriC-ENS.",
                "authors": [
                    {
                        "name": "Azim S.M."
                    },
                    {
                        "name": "Haque M.R."
                    },
                    {
                        "name": "Shatabda S."
                    }
                ],
                "citationCount": 1,
                "date": "2021-06-01T00:00:00Z",
                "journal": "Computational Biology and Chemistry",
                "title": "OriC-ENS: A sequence-based ensemble classifier for predicting origin of replication in S. cerevisiae"
            },
            "pmid": "33962169",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ]
}