{
    "accessibility": "Open access",
    "additionDate": "2015-02-04T09:25:19Z",
    "biotoolsCURIE": "biotools:gpcrdb",
    "biotoolsID": "gpcrdb",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "info@gpcr.org",
            "name": "GPCRDB",
            "note": "Contact for general and support questions regarding the GPCRdb",
            "typeEntity": "Project",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "name": "David Gloriam",
            "note": "Head of the GPCRdb",
            "orcidid": "https://orcid.org/0000-0002-4299-7561",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://drug.ku.dk/staff/?pure=en/persons/352279"
        }
    ],
    "description": "GPCRdb contains reference data, interactive visualisation and experiment design tools for G protein-coupled receptors (GPCRs). GPCRdb curates sequence alignments, structures and receptor mutations from literature. Interactive diagrams visualise receptor residues (e.g. snakeplot and helix box plot) and relationships (e.g phylogenetic trees).",
    "documentation": [
        {
            "note": "Documentation for the REST web services",
            "type": [
                "API documentation"
            ],
            "url": "https://gpcrdb.org/services/reference/"
        },
        {
            "note": "Documentation of the GPCRdb ranging from a general introduction to tool descriptions and development instructions.",
            "type": [
                "General"
            ],
            "url": "https://docs.gpcrdb.org"
        }
    ],
    "editPermission": {
        "authors": [
            "AJK_dev"
        ],
        "type": "group"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein sequence (raw)",
                        "uri": "http://edamontology.org/data_2974"
                    }
                },
                {
                    "data": {
                        "term": "Protein structure",
                        "uri": "http://edamontology.org/data_1460"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Alignment",
                    "uri": "http://edamontology.org/operation_2928"
                },
                {
                    "term": "Classification",
                    "uri": "http://edamontology.org/operation_2990"
                },
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                },
                {
                    "term": "Sequence clustering",
                    "uri": "http://edamontology.org/operation_0291"
                },
                {
                    "term": "Sequence comparison",
                    "uri": "http://edamontology.org/operation_2451"
                },
                {
                    "term": "Sequence motif comparison",
                    "uri": "http://edamontology.org/operation_0240"
                },
                {
                    "term": "Sequence similarity search",
                    "uri": "http://edamontology.org/operation_0346"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Phylogenetic tree",
                        "uri": "http://edamontology.org/data_0872"
                    }
                },
                {
                    "data": {
                        "term": "Phylogenetic tree image",
                        "uri": "http://edamontology.org/data_1707"
                    }
                },
                {
                    "data": {
                        "term": "Plot",
                        "uri": "http://edamontology.org/data_2884"
                    }
                },
                {
                    "data": {
                        "term": "Protein features",
                        "uri": "http://edamontology.org/data_1277"
                    }
                },
                {
                    "data": {
                        "term": "Protein sequence record",
                        "uri": "http://edamontology.org/data_2886"
                    }
                },
                {
                    "data": {
                        "term": "Protein structure",
                        "uri": "http://edamontology.org/data_1460"
                    }
                },
                {
                    "data": {
                        "term": "Sequence alignment (pair)",
                        "uri": "http://edamontology.org/data_1381"
                    }
                },
                {
                    "data": {
                        "term": "Sequence search results",
                        "uri": "http://edamontology.org/data_0857"
                    }
                }
            ]
        }
    ],
    "homepage": "https://gpcrdb.org",
    "language": [
        "Python",
        "SQL"
    ],
    "lastUpdate": "2022-12-22T08:35:09.692744Z",
    "link": [
        {
            "note": "Data repository for the GPCRdb",
            "type": [
                "Repository"
            ],
            "url": "https://github.com/protwis/gpcrdb_data"
        },
        {
            "note": "Issue tracker for the GPCRdb",
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/protwis/protwis/issues"
        },
        {
            "note": "Source of the framework that runs GPCRdb",
            "type": [
                "Repository"
            ],
            "url": "https://github.com/protwis/protwis"
        }
    ],
    "maturity": "Mature",
    "name": "GPCRDB",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "GPCRDB",
    "publication": [
        {
            "doi": "10.1038/s41586-020-2888-2",
            "metadata": {
                "abstract": "© 2020, The Author(s), under exclusive licence to Springer Nature Limited.G-protein-coupled receptors (GPCRs) are membrane proteins that modulate physiology across human tissues in response to extracellular signals. GPCR-mediated signalling can differ because of changes in the sequence1,2 or expression3 of the receptors, leading to signalling bias when comparing diverse physiological systems4. An underexplored source of such bias is the generation of functionally diverse GPCR isoforms with different patterns of expression across different tissues. Here we integrate data from human tissue-level transcriptomes, GPCR sequences and structures, proteomics, single-cell transcriptomics, population-wide genetic association studies and pharmacological experiments. We show how a single GPCR gene can diversify into several isoforms with distinct signalling properties, and how unique isoform combinations expressed in different tissues can generate distinct signalling states. Depending on their structural changes and expression patterns, some of the detected isoforms may influence cellular responses to drugs and represent new targets for developing drugs with improved tissue selectivity. Our findings highlight the need to move from a canonical to a context-specific view of GPCR signalling that considers how combinatorial expression of isoforms in a particular cell type, tissue or organism collectively influences receptor signalling and drug responses.",
                "authors": [
                    {
                        "name": "Babu M.M."
                    },
                    {
                        "name": "Crilly S.E."
                    },
                    {
                        "name": "Gloriam D.E."
                    },
                    {
                        "name": "Harris M."
                    },
                    {
                        "name": "Ladds G."
                    },
                    {
                        "name": "Mackenzie A.E."
                    },
                    {
                        "name": "Malinverni D."
                    },
                    {
                        "name": "Marti-Solano M."
                    },
                    {
                        "name": "Milligan G."
                    },
                    {
                        "name": "Munk C."
                    },
                    {
                        "name": "Pearce A."
                    },
                    {
                        "name": "Peng J."
                    },
                    {
                        "name": "Puthenveedu M.A."
                    },
                    {
                        "name": "Quon T."
                    },
                    {
                        "name": "Tobin A.B."
                    },
                    {
                        "name": "Wang X."
                    }
                ],
                "citationCount": 39,
                "date": "2020-11-26T00:00:00Z",
                "journal": "Nature",
                "title": "Combinatorial expression of GPCR isoforms affects signalling and drug responses"
            },
            "note": "GPCR isoform resource as available in the GPCRdb"
        },
        {
            "doi": "10.1038/s41592-018-0302-x",
            "metadata": {
                "abstract": "© 2019, Springer Nature America, Inc.G-protein-coupled receptors (GPCRs) transduce physiological and sensory stimuli into appropriate cellular responses and mediate the actions of one-third of drugs. GPCR structural studies have revealed the general bases of receptor activation, signaling, drug action and allosteric modulation, but so far cover only 13% of nonolfactory receptors. We broadly surveyed the receptor modifications/engineering and methods used to produce all available GPCR crystal and cryo-electron microscopy (cryo-EM) structures, and present an interactive resource integrated in GPCRdb (http://www.gpcrdb.org) to assist users in designing constructs and browsing appropriate experimental conditions for structure studies.",
                "authors": [
                    {
                        "name": "Bibbe J.M."
                    },
                    {
                        "name": "Deupi X."
                    },
                    {
                        "name": "Flock T."
                    },
                    {
                        "name": "Gloriam D.E."
                    },
                    {
                        "name": "Hanson M.A."
                    },
                    {
                        "name": "Isberg V."
                    },
                    {
                        "name": "Munk C."
                    },
                    {
                        "name": "Mutt E."
                    },
                    {
                        "name": "Nikolajsen L.F."
                    },
                    {
                        "name": "Stevens R.C."
                    }
                ],
                "citationCount": 85,
                "date": "2019-02-01T00:00:00Z",
                "journal": "Nature Methods",
                "title": "An online resource for GPCR structure determination and analysis"
            },
            "note": "GPCR construct design tool as available in the GPCRdb"
        },
        {
            "doi": "10.1093/nar/gkv1178",
            "metadata": {
                "abstract": "© The Author(s) 2015.Recent developments in G protein-coupled receptor (GPCR) structural biology and pharmacology have greatly enhanced our knowledge of receptor structure-function relations, and have helped improve the scientific foundation for drug design studies. The GPCR database, GPCRdb, serves a dual role in disseminating and enabling new scientific developments by providing reference data, analysis tools and interactive diagrams. This paper highlights new features in the fifth major GPCRdb release: (i) GPCR crystal structure browsing, superposition and display of ligand interactions; (ii) direct deposition by users of point mutations and their effects on ligand binding; (iii) refined snake and helix box residue diagram looks; and (iii) phylogenetic trees with receptor classification colour schemes. Under the hood, the entire GPCRdb front- and back-ends have been recoded within one infrastructure, ensuring a smooth browsing experience and development. GPCRdb is available at http://www.gpcrdb.org/ and it's open source code at https://bitbucket.org/gpcr/protwis.",
                "authors": [
                    {
                        "name": "Bojarski A.J."
                    },
                    {
                        "name": "Gloriam D.E."
                    },
                    {
                        "name": "Harpsoe K."
                    },
                    {
                        "name": "Hauser A.S."
                    },
                    {
                        "name": "Isberg V."
                    },
                    {
                        "name": "Mordalski S."
                    },
                    {
                        "name": "Munk C."
                    },
                    {
                        "name": "Rataj K."
                    },
                    {
                        "name": "Vriend G."
                    },
                    {
                        "name": "Vroling B."
                    }
                ],
                "citationCount": 196,
                "date": "2016-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "GPCRdb: An information system for G protein-coupled receptors"
            },
            "note": "2016 GPCRdb publication"
        },
        {
            "doi": "10.1093/nar/gkx1109",
            "metadata": {
                "abstract": "© The Author(s) 2017. Published by Oxford University Press on behalf of Nucleic Acids Research.G protein-coupled receptors are the most abundant mediators of both human signalling processes and therapeutic effects. Herein, we report GPCRome-wide homology models of unprecedented quality, and roughly 150 000 GPCR ligands with data on biological activities and commercial availability. Based on the strategy of 'Less model - more Xtal', each model exploits both a main template and alternative local templates. This achieved higher similarity to new structures than any of the existing resources, and refined crystal structures with missing or distorted regions. Models are provided for inactive, intermediate and active states - except for classes C and F that so far only have inactive templates. The ligand database has separate browsers for: (i) target selection by receptor, family or class, (ii) ligand filtering based on cross-experiment activities (min, max and mean) or chemical properties, (iii) ligand source data and (iv) commercial availability. SMILES structures and activity spreadsheets can be downloaded for further processing. Furthermore, three recent landmark publications on GPCR drugs, G protein selectivity and genetic variants have been accompanied with resources that now let readers view and analyse the findings themselves in GPCRdb. Altogether, this update will enable scientific investigation for the wider GPCR community. GPCRdb is available at http://www.gpcrdb.org.",
                "authors": [
                    {
                        "name": "Bojarski A.J."
                    },
                    {
                        "name": "Gloriam D.E."
                    },
                    {
                        "name": "Harpsoe K."
                    },
                    {
                        "name": "Hauser A.S."
                    },
                    {
                        "name": "Mordalski S."
                    },
                    {
                        "name": "Munk C."
                    },
                    {
                        "name": "Pandy-Szekeres G."
                    },
                    {
                        "name": "Tsonkov T.M."
                    }
                ],
                "citationCount": 299,
                "date": "2018-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "GPCRdb in 2018: Adding GPCR structure models and ligands"
            },
            "note": "2018 GPCRdb publication"
        },
        {
            "doi": "10.1038/s41594-021-00675-6",
            "metadata": {
                "abstract": "© 2021, The Author(s), under exclusive licence to Springer Nature America, Inc.We present an online, interactive platform for comparative analysis of all available G-protein coupled receptor (GPCR) structures while correlating to functional data. The comprehensive platform encompasses structure similarity, secondary structure, protein backbone packing and movement, residue–residue contact networks, amino acid properties and prospective design of experimental mutagenesis studies. This lets any researcher tap the potential of sophisticated structural analyses enabling a plethora of basic and applied receptor research studies.",
                "authors": [
                    {
                        "name": "Gloriam D.E."
                    },
                    {
                        "name": "Hauser A.S."
                    },
                    {
                        "name": "Kooistra A.J."
                    },
                    {
                        "name": "Munk C."
                    }
                ],
                "citationCount": 3,
                "date": "2021-11-01T00:00:00Z",
                "journal": "Nature Structural and Molecular Biology",
                "title": "An online GPCR structure analysis platform"
            },
            "note": "An online GPCR structure analysis platform",
            "pmid": "34759374"
        },
        {
            "doi": "10.1093/nar/gkaa1080",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research. This is an Open Access article distributed under the terms of the Creative Commons Attribution License (http://creativecommons.org/licenses/by/4.0/), which permits unrestricted reuse, distribution, and reproduction in any medium, provided the original work is properly cited.G protein-coupled receptors (GPCRs) form both the largest family of membrane proteins and drug targets, mediating the action of one-third of medicines. The GPCR database, GPCRdb serves >4 000 researchers every month and offers reference data, analysis of own or literature data, experiment design and dissemination of published datasets. Here, we describe new and updated GPCRdb resources with a particular focus on integration of sequence, structure and function. GPCRdb contains all human non-olfactory GPCRs (and >27 000 orthologs), G-proteins and arrestins. It includes over 2 000 drug and in-trial agents and nearly 200 000 ligands with activity and availability data. GPCRdb annotates all published GPCR structures (updated monthly), which are also offered in a refined version (with re-modeled missing/distorted regions and reverted mutations) and provides structure models of all human non-olfactory receptors in inactive, intermediate and active states. Mutagenesis data in the GPCRdb spans natural genetic variants, GPCR-G protein interfaces, ligand sites and thermostabilising mutations. A new sequence signature tool for identification of functional residue determinants has been added and two data driven tools to design ligand site mutations and constructs for structure determination have been updated extending their coverage of receptors and modifications. The GPCRdb is available at https://gpcrdb.org.",
                "authors": [
                    {
                        "name": "Esguerra M."
                    },
                    {
                        "name": "Gloriam D.E."
                    },
                    {
                        "name": "Keseru G.M."
                    },
                    {
                        "name": "Kooistra A.J."
                    },
                    {
                        "name": "Mamyrbekov A."
                    },
                    {
                        "name": "Mordalski S."
                    },
                    {
                        "name": "Munk C."
                    },
                    {
                        "name": "Pandy-Szekeres G."
                    }
                ],
                "citationCount": 129,
                "date": "2021-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "GPCRdb in 2021: Integrating GPCR sequence, structure and function"
            },
            "note": "2021 GPCRdb publication",
            "type": [
                "Other"
            ]
        },
        {
            "doi": "10.1093/nar/gkac1013",
            "note": "2023 GPCRdb publication",
            "pmid": "36395823",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal",
        "Web application",
        "Web service"
    ],
    "topic": [
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        },
        {
            "term": "Protein secondary structure",
            "uri": "http://edamontology.org/topic_3542"
        },
        {
            "term": "Protein sites, features and motifs",
            "uri": "http://edamontology.org/topic_3510"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Structural biology",
            "uri": "http://edamontology.org/topic_1317"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}
