{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.mpimp-golm.mpg.de/2168/en"}],"documentation":[{"type":"TRAINING_MATERIAL","url":"http://matapax.mpimp-golm.mpg.de/main/documentation/tutorial.html"}],"function":[{"operation":[{"term":"Analysis","uri":"http://edamontology.org/operation_2945"}]}],"labels":{"language":["R"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Genetics","uri":"http://edamontology.org/topic_3053"},{"term":"Experimental design and studies","uri":"http://edamontology.org/topic_3678"},{"term":"Model organisms","uri":"http://edamontology.org/topic_0621"},{"term":"Plant biology","uri":"http://edamontology.org/topic_0780"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/matapax-2-0-genome-wide-association-study-web-platform.html"}],"publication":[{"abstract":"High-throughput sequencing and genotyping methods are dramatically increasing the number of observable genetic intraspecies differences that can be exploited as genetic markers. In addition, automated phenotyping platforms and \"omics\" profiling technologies further enlarge the set of quantifiable macroscopic and molecular traits at an ever-increasing pace. Combined, both lines of technological advances create unparalleled opportunities to identify candidate gene regions and, ideally, even single genes responsible for observed variations in a particular trait via association studies. However, as of yet, this new potential is not sufficiently matched by enabling software solutions to easily exploit this wealth of genotype/ phenotype information. We have developed Matapax, a Web-based platform to address this need. Initially, we built the infrastructure to support association studies in Arabidopsis (Arabidopsis thaliana) based on several genotyping efforts covering up to 1,375 Arabidopsis accessions. Based on the user-supplied trait information, associated single-nucleotide polymorphism markers and single-nucleotide polymorphism-harboring or -neighboring genes are identified using both the GAPIT and EMMA libraries developed for R. Additional interrogation is facilitated by displaying candidate regions and genes in a genome browser and by providing relevant annotation information. In the future, we plan to broaden the scope of organisms to other plant species as more genotype/phenotype information becomes available. Matapax is freely available at http:// matapax.mpimp-golm.mpg.de and can be accessed using any internet browser. © 2012 American Society of Plant Biologists. All Rights Reserved.","authors":["Childs L.H.","Lisec J.","Walther D."],"cit_count":8,"journal":"Plant Physiology","pmid":"22353578","title":"Matapax: An online high-throughput genome-wide association study pipeline","year":"2012-04-01"}],"summary":{"biotoolsCURIE":"biotools:matapax","biotoolsID":"matapax","description":"Platform for high throughput collaborative genome wide association studies (GWAS). Computational time is reduced by processing user-supplied trait data in parallel. Result analysis is facilitated by displaying annotated candidate markers in tabular format and in a genome browser.","homepage":"http://matapax.mpimp-golm.mpg.de/","name":"Matapax"}}