{
    "accessibility": "Open access",
    "additionDate": "2022-06-28T10:26:09.413427Z",
    "biotoolsCURIE": "biotools:virsearcher",
    "biotoolsID": "virsearcher",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Fu Liu"
        },
        {
            "name": "Jiaxue He"
        },
        {
            "name": "Qiaoliang Liu"
        },
        {
            "name": "Yan Miao"
        }
    ],
    "description": "Identifying Bacteriophages from Metagenomes by Combining Convolutional Neural Network and Gene Information.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://github.com/DrJackson18/virSearcher",
    "language": [
        "C",
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:59:31.143793Z",
    "license": "GPL-3.0",
    "name": "virSearcher",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1109/tcbb.2022.3161135",
            "metadata": {
                "abstract": "Metagenome sequencing provides an unprecedented opportunity for the discovery of unknown microbes and viruses. A large number of phages and prokaryotes are mixed together in metagenomes. To study the influence of phages on human bodies and environments, it is of great significance to isolate phages from metagenomes. However, it is difficult to identify novel phages because of the diversity of their sequences and the frequent presence of short contigs in metagenomes. Here, virSearcher is developed to identify phages from metagenomes by combining the convolutional neural network (CNN) and the gene information of input sequences. Firstly, an input sequence is encoded in accordance with the different functions of its coding and the non-coding regions and then is converted into word embedding code through a word embedding layer before a convolutional layer. Meanwhile, the hit ratio of the virus genes is combined with the output of the CNN to further improve the performance of the network. The genes used by virSearcher consist of complete and incomplete genes. Experiments on several metagenomes have showed that, compared with others, virSearcher can significantly improve the performance for the identification of short sequences, while maintaining the performance for long ones.",
                "authors": [
                    {
                        "name": "Dong T."
                    },
                    {
                        "name": "He J."
                    },
                    {
                        "name": "Hou T."
                    },
                    {
                        "name": "Liu F."
                    },
                    {
                        "name": "Liu Q."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Miao Y."
                    }
                ],
                "citationCount": 4,
                "date": "2023-01-01T00:00:00Z",
                "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
                "title": "Virsearcher: Identifying Bacteriophages from Metagenomes by Combining Convolutional Neural Network and Gene Information"
            },
            "pmid": "35316191"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Metagenomic sequencing",
            "uri": "http://edamontology.org/topic_3837"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        }
    ],
    "validated": 1
}
