{
    "accessibility": [
        "Open access"
    ],
    "additionDate": "2017-06-13T08:49:49Z",
    "biotoolsCURIE": "biotools:isoformswitchanalyzer",
    "biotoolsID": "isoformswitchanalyzer",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Kristoffer Vitting-Seerup"
        },
        {
            "name": "Kristoffer Vitting-Seerup",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://bioconductor.org/packages/devel/bioc/vignettes/IsoformSwitchAnalyzeR/inst/doc/IsoformSwitchAnalyzeR.html#how-to-get-help"
        },
        {
            "email": "albin@bio.ku.dk",
            "name": "Albin Sandelin",
            "orcidid": "http://orcid.org/0000-0002-7109-7378",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Enables identification of isoform switches with predicted functional consequences from RNA-seq data. Consequences can be chosen from a long list but includes protein domains gain/loss changes in NMD sensitivity etc. It directly supports import of data from Cufflinks/Cuffdiff, Kallisto, Salmon and RSEM but other transcript qunatification tools are easy to import as well.",
    "documentation": [
        {
            "note": "Or open vignette when R package have ben installed",
            "type": [
                "User manual"
            ],
            "url": "https://bioconductor.org/packages/devel/bioc/vignettes/IsoformSwitchAnalyzeR/inst/doc/IsoformSwitchAnalyzeR.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "note": "The basic input is a replicate transcript/isoform expression matrix as well as the genomic coordinates of the transcript/isoforms. The output is a list of (prioritized) isoform switches with predicted consequences.",
            "operation": [
                {
                    "term": "Sequence comparison",
                    "uri": "http://edamontology.org/operation_2451"
                },
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/IsoformSwitchAnalyzeR/",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-15T02:05:09Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "http://bioconductor.org/packages/IsoformSwitchAnalyzeR/"
        }
    ],
    "maturity": "Mature",
    "name": "IsoformSwitchAnalyzeR",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "KVS",
    "publication": [
        {
            "doi": "10.1158/1541-7786.MCR-16-0459",
            "metadata": {
                "abstract": "© 2017 AACR. Alternative usage of transcript isoforms from the same gene has been hypothesized as an important feature in cancers. However, differential usage of gene transcripts between conditions (isoform switching) has not been comprehensively characterized in and across cancer types. To this end, we developed methods for identification and visualization of isoform switches with predicted functional consequences. Using these methods, we characterized isoform switching in RNA-seq data from >5,500 cancer patients covering 12 solid cancer types. Isoform switches with potential functional consequences were common, affecting approximately 19% of multiple transcript genes. Among these, isoform switches leading to loss of DNA sequence encoding protein domains were more frequent than expected, particularly in pancancer switches. We identified several isoform switches as powerful biomarkers: 31 switches were highly predictive of patient survival independent of cancer types. Our data constitute an important resource for cancer researchers, available through interactive web tools. Moreover, our methods, available as an R package, enable systematic analysis of isoform switches from other RNA-seq datasets. Implications: This study indicates that isoform switches with predicted functional consequences are common and important in dysfunctional cells, which in turn means that gene expression should be analyzed at the isoform level.",
                "authors": [
                    {
                        "name": "Vitting-Seerup K."
                    },
                    {
                        "name": "Sandelin A."
                    }
                ],
                "citationCount": 9,
                "date": "2017-09-01T00:00:00Z",
                "journal": "Molecular Cancer Research",
                "title": "The landscape of isoform switches in human cancers"
            },
            "pmid": "28584021",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ],
    "validated": 1
}