{
    "accessibility": "Open access",
    "additionDate": "2022-11-03T20:58:51.814994Z",
    "biotoolsCURIE": "biotools:survivalposns",
    "biotoolsID": "survivalposns",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "dxzhao@jlu.edu.cn",
            "name": "Dongxu Zhao",
            "typeEntity": "Person"
        },
        {
            "name": "Liming Jiang"
        },
        {
            "name": "Yan Gong"
        },
        {
            "name": "Yangwei Pi"
        },
        {
            "name": "Yuexin Tong"
        },
        {
            "name": "Zhangheng Huang"
        }
    ],
    "description": "Individualized assessment of risk and overall survival in patients newly diagnosed with primary osseous spinal neoplasms with synchronous distant metastasis.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Incident curve plotting",
                    "uri": "http://edamontology.org/operation_3503"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://yxyx.shinyapps.io/SurvivalPOSNs/",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-11-03T20:58:51.817678Z",
    "name": "SurvivalPOSNs",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/FPUBH.2022.955427",
            "metadata": {
                "abstract": "Copyright © 2022 Tong, Huang, Jiang, Pi, Gong and Zhao.Background: The prognosis of patients with primary osseous spinal neoplasms (POSNs) presented with distant metastases (DMs) is still poor. This study aimed to evaluate the independent risk and prognostic factors in this population and then develop two web-based models to predict the probability of DM in patients with POSNs and the overall survival (OS) rate of patients with DM. Methods: The data of patients with POSNs diagnosed between 2004 and 2017 were extracted from the Surveillance, Epidemiology, and End Results (SEER) database. Univariate and multivariate logistics regression analyses were used to study the risk factors of DM. Based on independent DM-related variables, we developed a diagnostic nomogram to estimate the risk of DM in patients with POSNs. Among all patients with POSNs, those who had synchronous DM were included in the prognostic cohort for investigating the prognostic factors by using Cox regression analysis, and then a nomogram incorporating predictors was developed to predict the OS of patients with POSNs with DM. Kaplan–Meier (K-M) survival analysis was conducted to study the survival difference. In addition, validation of these nomograms were performed by using receiver operating characteristic (ROC) curves, the area under curves (AUCs), calibration curves, and decision curve analysis (DCA). Results: A total of 1345 patients with POSNs were included in the study, of which 238 cases (17.70%) had synchronous DM at the initial diagnosis. K-M survival analysis and multivariate Cox regression analysis showed that patients with DM had poorer prognosis. Grade, T stage, N stage, and histological type were found to be significantly associated with DM in patients with POSNs. Age, surgery, and histological type were identified as independent prognostic factors of patients with POSNs with DM. Subsequently, two nomograms and their online versions (https://yxyx.shinyapps.io/RiskofDMin/ and https://yxyx.shinyapps.io/SurvivalPOSNs/) were developed. The results of ROC curves, calibration curves, DCA, and K-M survival analysis together showed the excellent predictive accuracy and clinical utility of these newly proposed nomograms. Conclusion: We developed two well-validated nomograms to accurately quantify the probability of DM in patients with POSNs and predict the OS rate in patients with DM, which were expected to be useful tools to facilitate individualized clinical management of these patients.",
                "authors": [
                    {
                        "name": "Gong Y."
                    },
                    {
                        "name": "Huang Z."
                    },
                    {
                        "name": "Jiang L."
                    },
                    {
                        "name": "Pi Y."
                    },
                    {
                        "name": "Tong Y."
                    },
                    {
                        "name": "Zhao D."
                    }
                ],
                "date": "2022-08-22T00:00:00Z",
                "journal": "Frontiers in Public Health",
                "title": "Individualized assessment of risk and overall survival in patients newly diagnosed with primary osseous spinal neoplasms with synchronous distant metastasis"
            },
            "pmcid": "PMC9441606",
            "pmid": "36072380"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        }
    ],
    "validated": 1
}
