{
    "additionDate": "2017-08-03T18:45:13Z",
    "biotoolsCURIE": "biotools:genestoryteller",
    "biotoolsID": "genestoryteller",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://bioserver-3.bioacademy.gr/Bioserver/GeneStoryTeller/contact.html"
        }
    ],
    "description": "Mobile application that provides users with a synopsis regarding the information of human genes from various points of view. Synopsis is given as a little story, while, users may perform queries regarding a gene of interest. It is developed for Android and provides general, functional, clinical and network information for known and predicted human genes.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bioserver-3.bioacademy.gr/Bioserver/GeneStoryTeller/Tutorial.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://bioserver-3.bioacademy.gr/Bioserver/GeneStoryTeller/",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:44Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/genestoryteller-mobile-app-for-quick-and-comprehensive-information-retrieval-of-human-genes.html"
        }
    ],
    "name": "GeneStoryTeller",
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© The Author(s) 2015.In the last few years, mobile devices such as smartphones and tablets have become an integral part of everyday life, due to their software/hardware rapid development, as well as the increased portability they offer. Nevertheless, up to now, only few Apps have been developed in the field of bioinformatics, capable to perform fast and robust access to services. We have developed the GeneStoryTeller, a mobile application for Android platforms, where users are able to instantly retrieve information regarding any recorded human gene, derived from eight publicly available databases, as a summary story. Complementary information regarding gene-drugs interactions, functional annotation and disease associations for each selected gene is also provided in the gene story. The most challenging part during the development of the GeneStoryTeller was to keep balance between storing data locally within the app and obtaining the updated content dynamically via a network connection. This was accomplished with the implementation of an administrative site where data are curated and synchronized with the application requiring a minimum human intervention.",
                "authors": [
                    {
                        "name": "Eleftheriou S.V."
                    },
                    {
                        "name": "Bourdakou M.M."
                    },
                    {
                        "name": "Athanasiadis E.I."
                    },
                    {
                        "name": "Spyrou G.M."
                    }
                ],
                "date": "2015-01-01T00:00:00Z",
                "journal": "Database",
                "title": "Gene story teller: A mobile app for quick and comprehensive information retrieval of human genes"
            },
            "pmid": "26055097"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Molecular genetics",
            "uri": "http://edamontology.org/topic_3321"
        },
        {
            "term": "Data management",
            "uri": "http://edamontology.org/topic_3071"
        }
    ],
    "validated": 1
}