{
    "additionDate": "2019-11-14T18:12:33Z",
    "biotoolsCURIE": "biotools:DeepCalpain",
    "biotoolsID": "DeepCalpain",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "chenghan@zzu.edu.cn",
            "name": "Han Cheng",
            "typeEntity": "Person"
        },
        {
            "name": "Jingsi Dong",
            "typeEntity": "Person"
        },
        {
            "name": "Kai Yu",
            "typeEntity": "Person"
        },
        {
            "name": "Linhong Zhao",
            "typeEntity": "Person"
        },
        {
            "name": "Ze-Xian Liu",
            "typeEntity": "Person"
        }
    ],
    "description": "Precise Prediction of Calpain Cleavage Sites and Their Aberrance Caused by Mutations in Cancer | SWISS-MODEL is a fully automated protein structure homology-modelling server. The purpose of this server is to make Protein Modelling accessible to all biochemists and molecular biologists worldwide | DeepCalpain is a web server developed for understanding the enzyme-specific cleavage for calpains including m-calpain and μ-calpain",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Post-translation modification site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Protein cleavage site prediction",
                    "uri": "http://edamontology.org/operation_0422"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                }
            ]
        }
    ],
    "homepage": "http://deepcalpain.cancerbio.info/",
    "lastUpdate": "2020-12-17T15:29:15Z",
    "name": "DeepCalpain",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FGENE.2019.00715",
            "metadata": {
                "abstract": "© 2019 Liu, Yu, Dong, Zhao, Liu, Zhang, Li, Du and Cheng. This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms.As a widespread post-translational modification of proteins, calpain-mediated cleavage regulates a broad range of cellular processes, including proliferation, differentiation, cytoskeletal reorganization, and apoptosis. The identification of proteins that undergo calpain cleavage in a site-specific manner is the necessary foundation for understanding the exact molecular mechanisms and regulatory roles of calpain-mediated cleavage. In contrast with time-consuming and labor-intensive experimental methods, computational approaches for detecting calpain cleavage sites have attracted wide attention due to their efficiency and convenience. In this study, we established a novel computational tool named DeepCalpain (http://deepcalpain.cancerbio.info/) for predicting the potential calpain cleavage sites by adopting deep neural network and the particle swarm optimization algorithm. Through critical evaluation and comparison, DeepCalpain exhibited superior performance against other existing tools. Meanwhile, we found that protein interactions could enrich the calpain-substrate regulatory relationship. Since calpain-mediated cleavage was critical for cancer development and progression, we comprehensively analyzed the calpain cleavage associated mutations across 11 cancers with the help of DeepCalpain, which demonstrated that the calpain-mediated cleavage events were affected by mutations and heavily implicated in the regulation of cancer cells. These prediction and analysis results might provide helpful information to reveal the regulatory mechanism of calpain cleavage in biological pathways and different cancer types, which might open new avenues for the diagnosis and treatment of cancers.",
                "authors": [
                    {
                        "name": "Cheng H."
                    },
                    {
                        "name": "Dong J."
                    },
                    {
                        "name": "Du Y."
                    },
                    {
                        "name": "Li S."
                    },
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Liu Z.-X."
                    },
                    {
                        "name": "Yu K."
                    },
                    {
                        "name": "Zhang Q."
                    },
                    {
                        "name": "Zhao L."
                    }
                ],
                "citationCount": 6,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "Precise prediction of calpain cleavage sites and their aberrance caused by mutations in cancer"
            },
            "pmcid": "PMC6694742",
            "pmid": "31440276"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ],
    "validated": 1
}
