{
    "accessibility": "Open access",
    "additionDate": "2023-03-19T11:16:41.041729Z",
    "biotoolsCURIE": "biotools:mecddi",
    "biotoolsID": "mecddi",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Haibin Dai"
        },
        {
            "name": "Wei Hu"
        },
        {
            "name": "Ying Zhou"
        },
        {
            "name": "Feng Zhu",
            "orcidid": "https://orcid.org/0000-0001-8069-0053"
        }
    ],
    "description": "Clarified Drug-Drug Interaction Mechanism Facilitating Rational Drug Use and Potential Drug-Drug Interaction Prediction.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://idrblab.org/mecddi/",
    "lastUpdate": "2024-11-24T14:52:57.275575Z",
    "name": "MecDDI",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1021/acs.jcim.2c01656",
            "metadata": {
                "abstract": "Drug-drug interactions (DDIs) are a major concern in clinical practice and have been recognized as one of the key threats to public health. To address such a critical threat, many studies have been conducted to clarify the mechanism underlying each DDI, based on which alternative therapeutic strategies are successfully proposed. Moreover, artificial intelligence-based models for predicting DDIs, especially multilabel classification models, are highly dependent on a reliable DDI data set with clear mechanistic information. These successes highlight the imminent necessity to have a platform providing mechanistic clarifications for a large number of existing DDIs. However, no such platform is available yet. In this study, a platform entitled “MecDDI” was therefore introduced to systematically clarify the mechanisms underlying the existing DDIs. This platform is unique in (a) clarifying the mechanisms underlying over 1,78,000 DDIs by explicit descriptions and graphic illustrations and (b) providing a systematic classification for all collected DDIs based on the clarified mechanisms. Due to the long-lasting threats of DDIs to public health, MecDDI could offer medical scientists a clear clarification of DDI mechanisms, support healthcare professionals to identify alternative therapeutics, and prepare data for algorithm scientists to predict new DDIs. MecDDI is now expected as an indispensable complement to the available pharmaceutical platforms and is freely accessible at: https://idrblab.org/mecddi/.",
                "authors": [
                    {
                        "name": "Dai H."
                    },
                    {
                        "name": "Hu W."
                    },
                    {
                        "name": "Li T."
                    },
                    {
                        "name": "Luo Y."
                    },
                    {
                        "name": "Qiu Y."
                    },
                    {
                        "name": "Shi S."
                    },
                    {
                        "name": "Sun X."
                    },
                    {
                        "name": "Xu H."
                    },
                    {
                        "name": "Xu Y."
                    },
                    {
                        "name": "Yang Q."
                    },
                    {
                        "name": "Zhang W."
                    },
                    {
                        "name": "Zhou Y."
                    },
                    {
                        "name": "Zhu F."
                    }
                ],
                "citationCount": 6,
                "date": "2023-03-13T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "MecDDI: Clarified Drug-Drug Interaction Mechanism Facilitating Rational Drug Use and Potential Drug-Drug Interaction Prediction"
            },
            "pmid": "36802582"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
