{
    "additionDate": "2021-01-18T12:23:44Z",
    "biotoolsCURIE": "biotools:gene-prober",
    "biotoolsID": "gene-prober",
    "confidence_flag": "tool",
    "description": "A tool to design polynucleotide probes for targeting microbial genes.\n\nprobe designer for geneFISH and phageFISH.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Primer and probe design",
                    "uri": "http://edamontology.org/operation_2419"
                }
            ]
        }
    ],
    "homepage": "http://gene-prober.icbm.de/",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-18T07:17:42Z",
    "name": "Gene-PROBER",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/J.SYAPM.2020.126173",
            "metadata": {
                "abstract": "© 2020 Elsevier GmbHRecent developments in fluorescence in situ hybridization (FISH) methods allow the detection and visualization of the genes/genomic regions of bacteria, archaea and infecting viruses at the single cell level. These methods use mixtures of polynucleotides as probes to specifically detect the target of interest. Gene-PROBER enables the design of polynucleotide mixtures for targeting genes or genomic regions in microorganisms. It has four workflows, depending on the availability of non-target sequences and the choice of probe synthesis, either by chemical synthesis or by PCR. It outputs polynucleotides that are spread along the target sequence and have similar melting properties. Therefore, such a polynucleotide mixture can be used as a single probe, in a single hybridization reaction. Gene-PROBER is a freely available web service that can be accessed at http://gene-prober.icbm.de/, and is implemented in the R language using the Shiny package.",
                "authors": [
                    {
                        "name": "Moraru C."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Systematic and Applied Microbiology",
                "title": "Gene-PROBER – a tool to design polynucleotide probes for targeting microbial genes"
            },
            "pmid": "33352459"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        }
    ]
}
