{
    "additionDate": "2021-01-18T07:59:54Z",
    "biotoolsCURIE": "biotools:dsplmf",
    "biotoolsID": "dsplmf",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Ch-Eslahchi@sbu.ac.ir",
            "name": "Changiz Eslahchi",
            "typeEntity": "Person"
        }
    ],
    "description": "DSPLMF is a method for Cancer drug sensitivity prediction using a novel regularization approach in Logistic Matrix Factorization.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic pathway prediction",
                    "uri": "http://edamontology.org/operation_3929"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                }
            ]
        }
    ],
    "homepage": "https://github.com/emdadi/DSPLMF",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-03T20:20:39Z",
    "name": "DSPLMF",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3389/FGENE.2020.00075",
            "metadata": {
                "abstract": "© Copyright © 2020 Emdadi and Eslahchi.The ability to predict the drug response for cancer disease based on genomics information is an essential problem in modern oncology, leading to personalized treatment. By predicting accurate anticancer responses, oncologists achieve a complete understanding of the effective treatment for each patient. In this paper, we present DSPLMF (Drug Sensitivity Prediction using Logistic Matrix Factorization) approach based on Recommender Systems. DSPLMF focuses on discovering effective features of cell lines and drugs for computing the probability of the cell lines are sensitive to drugs by logistic matrix factorization approach. Since similar cell lines and similar drugs may have similar drug responses and incorporating similarities between cell lines and drugs can potentially improve the drug response prediction, gene expression profile, copy number alteration, and single-nucleotide mutation information are used for cell line similarity and chemical structures of drugs are used for drug similarity. Evaluation of the proposed method on CCLE and GDSC datasets and comparison with some of the state-of-the-art methods indicates that the result of DSPLMF is significantly more accurate and more efficient than these methods. To demonstrate the ability of the proposed method, the obtained latent vectors are used to identify subtypes of cancer of the cell line and the predicted IC50 values are used to depict drug-pathway associations. The source code of DSPLMF method is available in https://github.com/emdadi/DSPLMF.",
                "authors": [
                    {
                        "name": "Emdadi A."
                    },
                    {
                        "name": "Eslahchi C."
                    }
                ],
                "citationCount": 9,
                "date": "2020-02-27T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "DSPLMF: A Method for Cancer Drug Sensitivity Prediction Using a Novel Regularization Approach in Logistic Matrix Factorization"
            },
            "pmcid": "PMC7056895",
            "pmid": "32174963"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        }
    ]
}