{
    "additionDate": "2021-01-18T07:37:45Z",
    "biotoolsCURIE": "biotools:structurly",
    "biotoolsID": "structurly",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "c.angelini@iac.cnr.it",
            "name": "Claudia Angelini",
            "orcidid": "https://orcid.org/0000-0001-8350-8464",
            "typeEntity": "Person"
        }
    ],
    "description": "A novel shiny app to produce comprehensive, detailed and interactive plots for population genetic analysis.\n\nStructuRly is an R package containing a shiny application to produce detailed and interactive graphs of the results of a Bayesian cluster analysis obtained with the most common population genetic software used to investigate population structure, such as STRUCTURE or ADMIXTURE.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Anonymisation",
                    "uri": "http://edamontology.org/operation_3283"
                }
            ]
        }
    ],
    "homepage": "https://nicocriscuolo.shinyapps.io/StructuRly/",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-24T10:49:35Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/nicocriscuolo/StructuRly"
        },
        {
            "type": [
                "Other"
            ],
            "url": "https://nicocriscuolo.shinyapps.io/StructuRly/"
        }
    ],
    "name": "StructuRly",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0229330",
            "metadata": {
                "abstract": "Copyright: © 2020 Criscuolo, Angelini. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Population genetics focuses on the analysis of genetic differences within and between-group of individuals and the inference of the populations' structure. These analyses are usually carried out using Bayesian clustering or maximum likelihood estimation algorithms that assign individuals to a given population depending on specific genetic patterns. Although several tools were developed to perform population genetics analysis, their standard graphical outputs may not be sufficiently informative for users lacking interactivity and complete information. StructuRly aims to resolve this problem by offering a complete environment for population analysis. In particular, StructuRly combines the statistical power of the R language with the friendly interfaces implemented using the shiny libraries to provide a novel tool for performing population clustering, evaluating several genetic indexes, and comparing results. Moreover, graphical representations are interactive and can be easily personalized. StructuRly is available either as R package on GitHub, with detailed information for its installation and use and as shinyapps.io servers for those users who are not familiar with R and the RStudio IDE. The application has been tested on Linux, macOS and Windows operative systems and can be launched as a shiny app in every web browser.",
                "authors": [
                    {
                        "name": "Criscuolo N.G."
                    },
                    {
                        "name": "Angelini C."
                    }
                ],
                "citationCount": 6,
                "date": "2020-02-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Structurly: A novel shiny app to produce comprehensive, detailed and interactive plots for population genetic analysis"
            },
            "pmcid": "PMC7029954",
            "pmid": "32074134"
        }
    ],
    "topic": [
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}