{
    "additionDate": "2018-07-04T14:00:48Z",
    "biotoolsCURIE": "biotools:allofinder",
    "biotoolsID": "allofinder",
    "credit": [
        {
            "email": "jian.zhang@sjtu.edu.cn",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "jzhang.dr@gmail.com",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://mdl.shsmu.edu.cn/"
        }
    ],
    "description": "Identifies potential endogenous or exogenous allosteric modulators as well as their characterization in human allosterome. Automatically amalgamates allosteric site identification, allosteric screening and allosteric scoring evaluation of modulator–protein complexes to identify allosteric modulators, followed by allosterome mapping analyses of predicted allosteric sites and modulators in human proteome. Enables identification of allosteric metabolites for metabolic enzymes and screening of potential allosteric compounds for disease-related targets.",
    "documentation": [
        {
            "type": [
                "General",
                "Training material"
            ],
            "url": "http://mdl.shsmu.edu.cn/ALF/module/help/help.jsp"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Natural product identification",
                    "uri": "http://edamontology.org/operation_3803"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Post-translation modification site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                }
            ]
        }
    ],
    "homepage": "http://mdl.shsmu.edu.cn/ALF/",
    "lastUpdate": "2024-11-25T14:46:00.628146Z",
    "name": "AlloFinder",
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.1093/nar/gky374",
            "metadata": {
                "abstract": "Allostery tweaks innumerable biological processes and plays a fundamental role in human disease and drug discovery. Exploration of allostery has thus been regarded as a crucial requirement for research on biological mechanisms and the development of novel therapeutics. Here, based on our previously developed allosteric data and methods, we present an interactive platform called AlloFinder that identifies potential endogenous or exogenous allosteric modulators and their involvement in human allosterome. AlloFinder automatically amalgamates allosteric site identification, allosteric screening and allosteric scoring evaluation of modulator-protein complexes to identify allosteric modulators, followed by allosterome mapping analyses of predicted allosteric sites and modulators in human proteome. This web server exhibits prominent performance in the reemergence of allosteric metabolites and exogenous allosteric modulators in known allosteric proteins. Specifically, AlloFinder enables identification of allosteric metabolites for metabolic enzymes and screening of potential allosteric compounds for disease-related targets. Significantly, the feasibility of AlloFinder to discover allosteric modulators was tested in a real case of signal transduction and activation of transcription 3 (STAT3) and validated by mutagenesis and functional experiments. Collectively, AlloFinder is expected to contribute to exploration of the mechanisms of allosteric regulation between metabolites and metabolic enzymes, and to accelerate allosteric drug discovery. The AlloFinder web server is freely available to all users at http://mdl.shsmu.edu.cn/ALF/.",
                "authors": [
                    {
                        "name": "Chen G."
                    },
                    {
                        "name": "Gao J."
                    },
                    {
                        "name": "Hong Y."
                    },
                    {
                        "name": "Huang M."
                    },
                    {
                        "name": "Li Q."
                    },
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Lu S."
                    },
                    {
                        "name": "Ni D."
                    },
                    {
                        "name": "Shen Q."
                    },
                    {
                        "name": "Song K."
                    },
                    {
                        "name": "Wang R."
                    },
                    {
                        "name": "Xu J."
                    },
                    {
                        "name": "Zhang J."
                    }
                ],
                "citationCount": 79,
                "date": "2018-07-02T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "AlloFinder: A strategy for allosteric modulator discovery and allosterome analyses"
            },
            "pmcid": "PMC6030990",
            "pmid": "29757429",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1,
    "version": [
        "1.01"
    ]
}
