{
    "additionDate": "2021-12-06T12:01:08.587491Z",
    "biotoolsCURIE": "biotools:sparsedossa2",
    "biotoolsID": "sparsedossa2",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "chuttenh@hsph.harvard.edu",
            "name": "Curtis Huttenhower",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "SparseDOSSA 2 is an upcoming software for the simulation of null and metadata-associated microbial abundance profiles. It has functionalities for a) fitting to user-provided microbial template datasets, b) synthesizing microbial abundances similar to either user-provided or pre-trained templates, and c) additionally simulating associations with sample metadata or among microbial features.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/biobakery/biobakery/wiki/SparseDOSSA2"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA barcoding",
                    "uri": "http://edamontology.org/operation_3200"
                },
                {
                    "term": "Ecological modelling",
                    "uri": "http://edamontology.org/operation_3946"
                },
                {
                    "term": "Statistical modelling",
                    "uri": "http://edamontology.org/operation_3664"
                }
            ]
        }
    ],
    "homepage": "http://huttenhower.sph.harvard.edu/sparsedossa2",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-12-06T12:01:43.398748Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/biobakery/sparseDOSSA2/issues"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/biobakery/sparseDOSSA2"
        }
    ],
    "name": "SparseDOSSA 2",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1371/journal.pcbi.1008913",
            "metadata": {
                "abstract": "Copyright: © 2021 Ma et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Many methods have been developed for statistical analysis of microbial community profiles, but due to the complex nature of typical microbiome measurements (e.g. sparsity, zero-inflation, non-independence, and compositionality) and of the associated underlying biology, it is difficult to compare or evaluate such methods within a single systematic framework. To address this challenge, we developed SparseDOSSA (Sparse Data Observations for the Simulation of Synthetic Abundances): a statistical model of microbial ecological population structure, which can be used to parameterize real-world microbial community profiles and to simulate new, realistic profiles of known structure for methods evaluation. Specifically, SparseDOSSA’s model captures marginal microbial feature abundances as a zero-inflated log-normal distribution, with additional model components for absolute cell counts and the sequence read generation process, microbe-microbe, and microbe-environment interactions. Together, these allow fully known covariance structure between synthetic features (i.e. “taxa”) or between features and “phenotypes” to be simulated for method benchmarking. Here, we demonstrate SparseDOSSA’s performance for 1) accurately modeling human-associated microbial population profiles; 2) generating synthetic communities with controlled population and ecological structures; 3) spiking-in true positive synthetic associations to benchmark analysis methods; and 4) recapitulating an end-to-end mouse microbiome feeding experiment. Together, these represent the most common analysis types in assessment of real microbial community environmental and epidemiological statistics, thus demonstrating SparseDOSSA’s utility as a general-purpose aid for modeling communities and evaluating quantitative methods. An open-source implementation is available at http://huttenhower.sph.harvard.edu/sparsedossa2.",
                "authors": [
                    {
                        "name": "Carmody R.N."
                    },
                    {
                        "name": "Franzosa E.A."
                    },
                    {
                        "name": "Huttenhower C."
                    },
                    {
                        "name": "Janson L."
                    },
                    {
                        "name": "Lu Y."
                    },
                    {
                        "name": "Ma S."
                    },
                    {
                        "name": "Maharjan S."
                    },
                    {
                        "name": "Mallick H."
                    },
                    {
                        "name": "Moon Y.S."
                    },
                    {
                        "name": "Ren B."
                    },
                    {
                        "name": "Schwager E."
                    },
                    {
                        "name": "Tickle T.L."
                    }
                ],
                "citationCount": 1,
                "date": "2021-09-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "A statistical model for describing and simulating microbial community profiles"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ]
}
