{
    "additionDate": "2021-09-27T05:56:51.313707Z",
    "biotoolsCURIE": "biotools:hisphossite",
    "biotoolsID": "hisphossite",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "xfsong@nuaa.edu.cn",
            "name": "Xiaofeng Song",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "guo_xuejiang@njmu.edu.cn",
            "name": "Xuejiang Guo",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "HisPhosSite is a comprehensive database of histidine phosphorylated proteins and sites.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "PTM localisation",
                    "uri": "http://edamontology.org/operation_3755"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://reprod.njmu.edu.cn/cgi-bin/HisPhosSite/HisPhosSite.php",
    "lastUpdate": "2021-09-27T05:56:51.316133Z",
    "name": "HisPhosSite",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.JPROT.2021.104262",
            "metadata": {
                "abstract": "© 2021 Elsevier B.V.Histidine phosphorylation is critically important in a variety of cellular processes including signal transduction, cell cycle, proliferation, differentiation, and apoptosis. It is estimated to account for 6% of all phosphorylated amino acids. However, due to the acid lability of the P–N bond, the study of pHis lags far behind that of pSer, pThr, and pTyr. Recently, the development and use of pHis-specific antibodies and methodologies have led to a resurgence in the study of histidine phosphorylation. Although a considerable number of pHis proteins and sites have been discovered, most of them have not been manually curated and integrated to any databases. There is a lack of a data repository for pHis, and such work is expected to help further systemic studies of pHis. Thus, we present a comprehensive resource database of histidine phosphorylation (HisPhosSite) by curating experimentally validated pHis proteins and sites and compiling putative pHis sites with ortholog search. HisPhosSite contains 776 verified pHis sites and 2702 verified pHis proteins in 38 eukaryotic and prokaryotic species and 15,378 putative pHis sites and 10,816 putative pHis proteins in 1366 species. HisPhosSite provides rich annotations of pHis sites and proteins and multiple search engines (including motif search and BLAST search) for users to locate pHis sites of interest. HisPhosSite is available at http://reprod.njmu.edu.cn/hisphossite. Significance: Histidine phosphorylation is involved in a variety of cellular processes as well as cancers, and it has been proved to be more common than previously thought. The HisPhosSite database was developed to collect pHis data from published literatures with experimental evidences. Unification of the identified pHis proteins and sites will give researchers an informative resource for histidine phosphorylation. HisPhosSite has a user-friendly interface with multiple search engines for users to locate pHis sites of interest. In addition, the database provides rich structural and functional annotations. HisPhosSite will help future studies and elucidation of the functions of histidine phosphorylation.",
                "authors": [
                    {
                        "name": "Zhao J."
                    },
                    {
                        "name": "Zou L."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Zeng C."
                    },
                    {
                        "name": "Xu C."
                    },
                    {
                        "name": "Jiang B."
                    },
                    {
                        "name": "Guo X."
                    },
                    {
                        "name": "Song X."
                    }
                ],
                "date": "2021-07-15T00:00:00Z",
                "journal": "Journal of Proteomics",
                "title": "HisPhosSite: A comprehensive database of histidine phosphorylated proteins and sites"
            },
            "pmid": "33984507",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ]
}