{
    "additionDate": "2017-08-03T18:52:44Z",
    "biotoolsCURIE": "biotools:netsplitter",
    "biotoolsID": "netsplitter",
    "credit": [
        {
            "email": "don.kulasiri@lincoln.ac.nz",
            "name": "Professor Don Kulasiri",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.lincoln.ac.nz/staff-profile?staffId=Wynand.Verwoerd"
        }
    ],
    "description": "Mathematica software application to split biochemical networks into functional subnetworks.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://www.bioinformatics.org/downloads/list.php?group_id=1067"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                }
            ]
        }
    ],
    "homepage": "http://www.bioinformatics.org/groups/?group_id=1067",
    "language": [
        "Mathematica"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/netsplitter-1-3-3-interactive-metabolic-subnets.html"
        }
    ],
    "name": "Netsplitter",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: Compared to more general networks, biochemical networks have some special features: while generally sparse, there are a small number of highly connected metabolite nodes; and metabolite nodes can also be divided into two classes: internal nodes with associated mass balance constraints and external ones without. Based on these features, reclassifying selected internal nodes (separators) to external ones can be used to divide a large complex metabolic network into simpler subnetworks. Selection of separators based on node connectivity is commonly used but affords little detailed control and tends to produce excessive fragmentation.The method proposed here (Netsplitter) allows the user to control separator selection. It combines local connection degree partitioning with global connectivity derived from random walks on the network, to produce a more even distribution of subnetwork sizes. Partitioning is performed progressively and the interactive visual matrix presentation used allows the user considerable control over the process, while incorporating special strategies to maintain the network integrity and minimise the information loss due to partitioning.Results: Partitioning of a genome scale network of 1348 metabolites and 1468 reactions for Arabidopsis thaliana encapsulates 66% of the network into 10 medium sized subnets. Applied to the flavonoid subnetwork extracted in this way, it is shown that Netsplitter separates this naturally into four subnets with recognisable functionality, namely synthesis of lignin precursors, flavonoids, coumarin and benzenoids. A quantitative quality measure called efficacy is constructed and shows that the new method gives improved partitioning for several metabolic networks, including bacterial, plant and mammal species.Conclusions: For the examples studied the Netsplitter method is a considerable improvement on the performance of connection degree partitioning, giving a better balance of subnet sizes with the removal of fewer mass balance constraints. In addition, the user can interactively control which metabolite nodes are selected for cutting and when to stop further partitioning as the desired granularity has been reached. Finally, the blocking transformation at the heart of the procedure provides a powerful visual display of network structure that may be useful for its exploration independent of whether partitioning is required. © 2011 Verwoerd; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Verwoerd W.S."
                    }
                ],
                "citationCount": 14,
                "date": "2011-02-07T00:00:00Z",
                "journal": "BMC Systems Biology",
                "title": "A new computational method to split large biochemical networks into coherent subnets"
            },
            "pmid": "21294924"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Biochemistry",
            "uri": "http://edamontology.org/topic_3292"
        }
    ],
    "validated": 1
}