{
    "additionDate": "2017-03-24T11:59:25Z",
    "biotoolsCURIE": "biotools:taro",
    "biotoolsID": "taro",
    "description": "Collection of tools for protein target optimization analysis. Tools include those for annotation of putative orthologues and homologues, searches against the PDB with PSIBLAST, generation of annotated multiple sequence alignments and presentation of integrated results.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                },
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                },
                {
                    "term": "Protein fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                }
            ]
        }
    ],
    "homepage": "http://www.compbio.dundee.ac.uk/taro",
    "lastUpdate": "2018-12-10T12:58:40Z",
    "name": "TarO",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "TarO (http://www.compbio.dundee.ac.uk/taro) offers a single point of reference for key bioinformatics analyses relevant to selecting proteins or domains for study by structural biology techniques. The protein sequence is analysed by 17 algorithms and compared to 8 databases. TarO gathers putative homologues, including orthologues, and then obtains predictions of properties for these sequences including crystallisation propensity, protein disorder and post-translational modifications. Analyses are run on a high-performance computing cluster, the results integrated, stored in a database and accessed through a web-based user interface. Output is in tabulated format and in the form of an annotated multiple sequence alignment (MSA) that may be edited interactively in the program Jalview. TarO also simplifies the gathering of additional annotations via the Distributed Annotation System, both from the MSA in Jalview and through links to Dasty2. Routes to other information gateways are included, for example to relevant pages from UniProt, COG and the Conserved Domains Database. Open access to TarO is available from a guest account with private accounts for academic use available on request. Future development of TarO will include further analysis steps and integration with the Protein Information Management System (PIMS), a sister project in the BBSRC 'Structural Proteomics of Rational Targets' initiative.",
                "authors": [
                    {
                        "name": "Overton I.M."
                    },
                    {
                        "name": "van Niekerk C.A."
                    },
                    {
                        "name": "Carter L.G."
                    },
                    {
                        "name": "Dawson A."
                    },
                    {
                        "name": "Martin D.M."
                    },
                    {
                        "name": "Cameron S."
                    },
                    {
                        "name": "McMahon S.A."
                    },
                    {
                        "name": "White M.F."
                    },
                    {
                        "name": "Hunter W.N."
                    },
                    {
                        "name": "Naismith J.H."
                    },
                    {
                        "name": "Barton G.J."
                    }
                ],
                "citationCount": 31,
                "date": "2008-01-01T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "TarO: a target optimisation system for structural biology."
            },
            "pmid": "18385152"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ],
    "validated": 1
}