{
    "additionDate": "2017-03-27T12:32:46Z",
    "biotoolsCURIE": "biotools:casnp",
    "biotoolsID": "casnp",
    "credit": [
        {
            "email": "xliu@hsph.harvard.edu",
            "name": "X. Shirley Liu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Database for storing and interrogating quantitative copy number alterations (CNA) data from SNP arrays on 34 different cancer types in 104 studies. With a user input of region or gene of interest, it will return the CNA information summarizing the frequencies of gain/loss and averaged copy number for each study. It also displays the heatmap showing copy numbers estimated at each SNP marker around the query region across all studies for a more comprehensive visualization.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://en.wikipedia.org/wiki/CaSNP"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Copy number estimation",
                    "uri": "http://edamontology.org/operation_3233"
                }
            ]
        }
    ],
    "homepage": "http://cistrome.dfci.harvard.edu/CaSNP/",
    "homepage_status": 1,
    "language": [
        "SQL"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "name": "CaSNP",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Cancer is known to have abundant copy number alterations (CNAs) that greatly contribute to its pathogenesis and progression. Investigation of CNA regions could potentially help identify oncogenes and tumor suppressor genes and infer cancer mechanisms. Although single-nucleotide polymorphism (SNP) arrays have strengthened our ability to identify CNAs with unprecedented resolution, a comprehensive collection of CNA information from SNP array data is still lacking. We developed a web-based CaSNP (http://cistrome .dfci.harvard.edu/ CaSNP/) database for storing and interrogating quantitative CNA data, which curated ̃11 500 SNP arrays on 34 different cancer types in 104 studies. With a user input of region or gene of interest, CaSNP will return the CNA information summarizing the frequencies of gain/loss and averaged copy number for each study, and provide links to download the data or visualize it in UCSC Genome Browser. CaSNP also displays the heatmap showing copy numbers estimated at each SNP marker around the query region across all studies for a more comprehensive visualization. Finally, we used CaSNP to study the CNA of protein-coding genes as well as LincRNA genes across all cancer SNP arrays, and found putative regions harboring novel oncogenes and tumor suppressors. In summary, CaSNP is a useful tool for cancer CNA association studies, with the potential to facilitate both basic science and translational research on cancer. © The Author(s) 2010.",
                "authors": [
                    {
                        "name": "Cao Q."
                    },
                    {
                        "name": "Zhou M."
                    },
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Meyer C.A."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Chen Z."
                    },
                    {
                        "name": "Li C."
                    },
                    {
                        "name": "Liu X.S."
                    }
                ],
                "citationCount": 22,
                "date": "2011-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "CaSNP: A database for interrogating copy number alterations of cancer genome from SNP array data"
            },
            "pmid": "20972221"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Experimental design and studies",
            "uri": "http://edamontology.org/topic_3678"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ],
    "validated": 1
}