{
    "additionDate": "2020-01-09T18:00:12Z",
    "biotoolsCURIE": "biotools:NMF-RI",
    "biotoolsID": "NMF-RI",
    "confidence_flag": "tool",
    "description": "Blind spectral unmixing of highly mixed multispectral flow and image cytometry data.\n\nMatlab code to spectrally unmix highly mixed multispectral flow and image cytometry data.\n\nTo use NMF-RI on new data (tissue or flow cytometry) we recommend to use the ´main.m´ code distributed and load new cytometry data to the existing folder hierarchy.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Spectrum calculation",
                    "uri": "http://edamontology.org/operation_3860"
                }
            ]
        }
    ],
    "homepage": "https://github.com/djimenezsanchez/Blind_Unmixing_NMF_RI/",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-01-04T08:31:16Z",
    "name": "NMF-RI",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ751",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press.Motivation: Recent advances in multiplex immunostaining and multispectral cytometry have opened the door to simultaneously visualizing an unprecedented number of biomarkers both in liquid and solid samples. Properly unmixing fluorescent emissions is a challenging task, which normally requires the characterization of the individual fluorochromes from control samples. As the number of fluorochromes increases, the cost in time and use of reagents becomes prohibitively high. Here, we present a fully unsupervised blind spectral unmixing method for the separation of fluorescent emissions in highly mixed spectral data, without the need for control samples. To this end, we extend an existing method based on non-negative Matrix Factorization, and introduce several critical improvements: initialization based on the theoretical spectra, automated selection of 'sparse' data and use of a re-initialized multilayer optimizer. Results: Our algorithm is exhaustively tested using synthetic data to study its robustness against different levels of colocalization, signal to noise ratio, spectral resolution and the effect of errors in the initialization of the algorithm. Then, we compare the performance of our method to that of traditional spectral unmixing algorithms using novel multispectral flow and image cytometry systems. In all cases, we show that our blind unmixing algorithm performs robust unmixing of highly spatially and spectrally mixed data with an unprecedently low computational cost. In summary, we present the first use of a blind unmixing method in multispectral flow and image cytometry, opening the door to the widespread use of our method to efficiently pre-process multiplex immunostaining samples without the need of experimental controls.",
                "authors": [
                    {
                        "name": "Jimenez-Sanchez D."
                    },
                    {
                        "name": "Ariz M."
                    },
                    {
                        "name": "Morgado J.M."
                    },
                    {
                        "name": "Cortes-Dominguez I."
                    },
                    {
                        "name": "Ortiz-De-Solorzano C."
                    }
                ],
                "citationCount": 1,
                "date": "2020-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "NMF-RI: Blind spectral unmixing of highly mixed multispectral flow and image cytometry data"
            },
            "pmid": "31593222"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        }
    ],
    "validated": 1
}