{
    "additionDate": "2021-01-18T08:01:56Z",
    "biotoolsCURIE": "biotools:camere",
    "biotoolsID": "camere",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "xin.gao@kaust.edu.sa",
            "name": "Xin Gao",
            "typeEntity": "Person"
        },
        {
            "name": "Ying Xu",
            "typeEntity": "Person"
        }
    ],
    "description": "CaMeRe is a novel tool for inference of cancer metabolic reprogramming. CaMeRe identifies metabolic pathways connecting the two compounds via collection of compatible enzymes, which are most consistent with the provided gene-expression data. In addition, cancer-specific knowledge, such as the expression level of bottleneck enzymes in the pathways, is incorporated into the search process, to enable accurate inference of cancer-specific metabolic pathways.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                },
                {
                    "term": "Metabolic pathway prediction",
                    "uri": "http://edamontology.org/operation_3929"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://csbl.bmb.uga.edu/CaMeRe/",
    "lastUpdate": "2021-02-06T21:17:10Z",
    "name": "CaMeRe",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3389/FONC.2020.00207",
            "metadata": {
                "abstract": "© Copyright © 2020 Li, Zhou, Sun, Qiu, Gao and Xu.Metabolic reprogramming is prevalent in cancer, largely due to its altered chemical environments such as the distinct intracellular concentrations of O2, H2O2 and H+, compared to those in normal tissue cells. The reprogrammed metabolisms are believed to play essential roles in cancer formation and progression. However, it is highly challenging to elucidate how individual normal metabolisms are altered in a cancer-promoting environment; hence for many metabolisms, our knowledge about how they are changed is limited. We present a novel method, CaMeRe (CAncer MEtabolic REprogramming), for identifying metabolic pathways in cancer tissues. Based on the specified starting and ending compounds, along with gene expression data of given cancer tissue samples, CaMeRe identifies metabolic pathways connecting the two compounds via collection of compatible enzymes, which are most consistent with the provided gene-expression data. In addition, cancer-specific knowledge, such as the expression level of bottleneck enzymes in the pathways, is incorporated into the search process, to enable accurate inference of cancer-specific metabolic pathways. We have applied this tool to predict the altered sugar-energy metabolism in cancer, referred to as the Warburg effect, and found the prediction result is highly accurate by checking the appearance and ranking of those key pathways in the results of CaMeRe. Computational evaluation indicates that the tool is fast and capable of handling large metabolic network inference in cancer tissues. Hence, we believe that CaMeRe offers a powerful tool to cancer researchers for their discovery of reprogrammed metabolisms in cancer. The URL of CaMeRe is http://csbl.bmb.uga.edu/CaMeRe/.",
                "authors": [
                    {
                        "name": "Gao X."
                    },
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "Qiu Z."
                    },
                    {
                        "name": "Sun H."
                    },
                    {
                        "name": "Xu Y."
                    },
                    {
                        "name": "Zhou J."
                    }
                ],
                "citationCount": 2,
                "date": "2020-02-25T00:00:00Z",
                "journal": "Frontiers in Oncology",
                "title": "CaMeRe: A Novel Tool for Inference of Cancer Metabolic Reprogramming"
            },
            "pmcid": "PMC7052490",
            "pmid": "32161720"
        }
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
