{"credit":[{"email":"Borbala.Mifsud@cancer.org.uk","name":"Borbala Mifsud","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"url":"http://bioconductor.org/packages/release/bioc/html/GOTHiC.html"}],"download":[{"type":"Source code","url":"http://bioconductor/packages/release/bioc/src/contrib/GOTHiC_1.10.0.tar.gz"}],"function":[{"operation":[{"term":"Transcriptional regulatory element prediction","uri":"http://edamontology.org/operation_0438"},{"term":"cis-regulatory element prediction","uri":"http://edamontology.org/operation_0441"}]}],"labels":{"collectionID":["BioConductor"],"language":["R"],"license":"GPL-3.0","operatingSystem":["Windows","Mac"],"toolType":["Command-line tool","Library"],"topic":[{"term":"Mapping","uri":"http://edamontology.org/topic_0102"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"},{"term":"Epigenetics","uri":"http://edamontology.org/topic_3295"},{"term":"Transcription factors and regulatory sites","uri":"http://edamontology.org/topic_0749"}]},"publication":[{"abstract":"© 2015 Schoenfelder et al. The mammalian genome harbors up to one million regulatory elements often located at great distances from their target genes. Long-range elements control genes through physical contact with promoters and can be recognized by the presence of specific histone modifications and transcription factor binding. Linking regulatory elements to specific promoters genome-wide is currently impeded by the limited resolution of high-throughput chromatin interaction assays. Here we apply a sequence capture approach to enrich Hi-C libraries for >22,000 annotated mouse promoters to identify statistically significant, long-range interactions at restriction fragment resolution, assigning long-range interacting elements to their target genes genome-wide in embryonic stem cells and fetal liver cells. The distal sites contacting active genes are enriched in active histone modifications and transcription factor occupancy, whereas inactive genes contact distal sites with repressive histone marks, demonstrating the regulatory potential of the distal elements identified. Furthermore, we find that coregulated genes cluster nonrandomly in spatial interaction networks correlated with their biological function and expression level. Interestingly, we find the strongest gene clustering in ES cells between transcription factor genes that control key developmental processes in embryogenesis. The results provide the first genome-wide catalog linking gene promoters to their longrange interacting elements and highlight the complex spatial regulatory circuitry controlling mammalian gene expression.","authors":["Schoenfelder S.","Furlan-Magaril M.","Mifsud B.","Tavares-Cadete F.","Sugar R.","Javierre B.-M.","Nagano T.","Katsman Y.","Sakthidevi M.","Wingett S.W.","Dimitrova E.","Dimond A.","Edelman L.B.","Elderkin S.","Tabbada K.","Darbo E.","Andrews S.","Herman B.","Higgs A.","LeProust E.","Osborne C.S.","Mitchell J.A.","Luscombe N.M.","Fraser P."],"cit_count":121,"doi":"10.1101/gr.185272.114","journal":"Genome Research","title":"The pluripotent regulatory circuitry connecting promoters to their long-range interacting elements","type":"Primary","year":"2015-01-01"}],"summary":{"biotoolsCURIE":"biotools:gothic","biotoolsID":"gothic","description":"This is a Hi-C analysis package using a cumulative binomial test to detect interactions between distal genomic loci that have significantly more reads than expected by chance in Hi-C experiments. It takes mapped paired NGS reads as input and gives back the list of significant interactions for a given bin size in the genome.","homepage":"http://bioconductor.org/packages/release/bioc/html/GOTHiC.html","name":"GOTHiC","version":["1.10.0"]}}