{
    "additionDate": "2021-01-18T07:44:59Z",
    "biotoolsCURIE": "biotools:2dkd",
    "biotoolsID": "2dkd",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "atilla.sit@eku.edu",
            "name": "Atilla Sit",
            "orcidid": "https://orcid.org/0000-0002-7840-6348",
            "typeEntity": "Person"
        }
    ],
    "description": "A toolkit for content-based local image search.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "http://github.com/kiharalab/2DKD",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-01-19T10:35:17Z",
    "license": "GPL-3.0",
    "name": "2DKD",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S13029-020-0077-1",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Direct comparison of 2D images is computationally inefficient due to the need for translation, rotation, and scaling of the images to evaluate their similarity. In many biological applications, such as digital pathology and cryo-EM, often identifying specific local regions of images is of particular interest. Therefore, finding invariant descriptors that can efficiently retrieve local image patches or subimages becomes necessary. Results: We present a software package called Two-Dimensional Krawtchouk Descriptors that allows to perform local subimage search in 2D images. The new toolkit uses only a small number of invariant descriptors per image for efficient local image retrieval. This enables querying an image and comparing similar patterns locally across a potentially large database. We show that these descriptors appear to be useful for searching local patterns or small particles in images and demonstrate some test cases that can be helpful for both assembly software developers and their users. Conclusions: Local image comparison and subimage search can prove cumbersome in both computational complexity and runtime, due to factors such as the rotation, scaling, and translation of the object in question. By using the 2DKD toolkit, relatively few descriptors are developed to describe a given image, and this can be achieved with minimal memory usage.",
                "authors": [
                    {
                        "name": "Deville J.S."
                    },
                    {
                        "name": "Kihara D."
                    },
                    {
                        "name": "Sit A."
                    }
                ],
                "date": "2020-02-10T00:00:00Z",
                "journal": "Source Code for Biology and Medicine",
                "title": "2DKD: A toolkit for content-based local image search"
            },
            "pmcid": "PMC7011505",
            "pmid": "32064000"
        }
    ],
    "toolType": [
        "Suite"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        }
    ],
    "validated": 1
}
