{
    "additionDate": "2017-01-13T13:15:28Z",
    "biotoolsCURIE": "biotools:mirspring",
    "biotoolsID": "mirspring",
    "credit": [
        {
            "email": "d.humphreys@victorchang.edu.au",
            "name": "David T. Humphreys",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The product of this pipeline creates a miRspring document, which essentiallyis a small HTML javascript file. Each miRspring document has been developed in such a way that it reproduces miRNA sequencing data from a BAM file. Additionally it provides unique analysis tools, and does not need internet connectivity for these processes.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/davhum/miRspring/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                }
            ]
        }
    ],
    "homepage": "https://github.com/davhum/miRspring",
    "language": [
        "JavaScript",
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:53Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "MiRspring",
    "owner": "seqwiki_import",
    "publication": [
        {
            "doi": "10.1093/nar/gkt485",
            "metadata": {
                "abstract": "High-throughput sequencing for microRNA (miRNA) profiling has revealed a vast complexity of miRNA processing variants, but these are difficult to discern for those without bioinformatics expertise and large computing capability. In this article, we present miRNA Sequence Profiling (miRspring) (http://mirspring.victorchang.edu.au), a software solution that creates a small portable research document that visualizes, calculates and reports on the complexities of miRNA processing. We designed an index-compression algorithm that allows the miRspring document to reproduce a complete miRNA sequence data set while retaining a small file size (typically <3 MB). Through analysis of 73 public data sets, we demonstrate miRspring's features in assessing quality parameters, miRNA cluster expression levels and miRNA processing. Additionally, we report on a new class of miRNA variants, which we term seed-isomiRs, identified through the novel visualization tools of the miRspring document. Further investigation identified that ∼30% of human miRBase entries are likely to have a seed-isomiR. We believe that miRspring will be a highly useful research tool that will enhance the analysis of miRNA data sets and thus increase our understanding of miRNA biology. © 2013 The Author(s).",
                "authors": [
                    {
                        "name": "Humphreys D.T."
                    },
                    {
                        "name": "Suter C.M."
                    }
                ],
                "citationCount": 25,
                "date": "2013-08-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "MiRspring: A compact standalone research tool for analyzing miRNA-seq data"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Data management",
            "uri": "http://edamontology.org/topic_3071"
        }
    ],
    "validated": 1
}