{
    "additionDate": "2017-05-02T07:18:56Z",
    "biotoolsCURIE": "biotools:nci_flicker",
    "biotoolsID": "nci_flicker",
    "collectionID": [
        "Proteomics"
    ],
    "description": "Provides the means to compare images from different internet sources using a java-enabled web browser. It was originally designed for the comparison of 2D gels.",
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database comparison",
                    "uri": "http://edamontology.org/operation_3561"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Protein comparison",
                    "uri": "http://edamontology.org/operation_2997"
                }
            ]
        }
    ],
    "homepage": "http://www.lecb.ncifcrf.gov/flicker/",
    "lastUpdate": "2019-03-26T08:28:02Z",
    "name": "NCI Flicker",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "authors": [
                    {
                        "name": "Lemkin P.F."
                    }
                ],
                "citationCount": 5,
                "date": "1999-01-01T00:00:00Z",
                "journal": "Methods in molecular biology (Clifton, N.J.)",
                "title": "Comparing 2-D electrophoretic gels across Internet databases."
            },
            "pmid": "10027264"
        },
        {
            "metadata": {
                "abstract": "Scientists around the world often work on similar data so the need to share results and compare data arises periodically. We describe a method of comparing two two-dimensional (2-D) protein gels of similar samples created in different laboratories to help identify or suggest protein spot identification. Now that 2-D gels and associated databases frequently appear on the Internet, this opens up the possibility of visually comparing one's own experimental 2-D gel image data with data from another gel in a remote Internet database. In general, there are a few ways to compare images: (i) slide one gel (autoradiograph or stained gel) over the other while back-illuminated, or (ii) build a 2-D gel computer database from both gels after scanning and analyzing these gels. These are impractical since in the first case the gel from the Internet database is not locally available. In the second, the costs of building a multi-gel database solely to answer the question of whether a spot is the same spot may be excessive if only a single visual comparison is needed. We describe a distributed gel comparison program (URL: http://www-lmmb.ncifcrf.gov/flicker) which runs on any World Wide Web (WWW) connected computer and is invoked from a Java-capable web browser. One gel image is read from any Internet 2-D gel database (e.g. SWISS-2DPAGE) and the other may reside on the investigator's computer. Images may be more easily compared by first applying spatial warping or other transforms interactively on the user's computer. First, regions of interest are 'landmarked' with several corresponding points in each gel image, then one gel image is warped to the geometry of the other. As the two gels are rapidly alternated, or flickered, in the same window, the user can slide one gel past the other to visually align corresponding spots by matching local morphology. This flicker-comparison technique may be applied to analyzing other types of one-dimensional and 2-D biomedical images.",
                "authors": [
                    {
                        "name": "Lemkin P.F."
                    }
                ],
                "citationCount": 63,
                "date": "1997-03-01T00:00:00Z",
                "journal": "Electrophoresis",
                "title": "Comparing two-dimensional electrophoretic gel images across the Internet"
            },
            "pmid": "9150925"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}