{"credit":[{"email":"Joerg.Schultz@biozentrum.uni-wuerzburg.de","name":"Prof. Dr. Jörg Schultz","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"Matthias.Wolf@biozentrum.uni-wuerzburg.de","name":"Dr. Matthias Wolf","typeEntity":"Person","typeRoles":["Primary contact"]}],"function":[{"operation":[{"term":"RNA secondary structure prediction","uri":"http://edamontology.org/operation_0278"},{"term":"Protein secondary structure prediction","uri":"http://edamontology.org/operation_0267"},{"term":"RNA structure prediction","uri":"http://edamontology.org/operation_2441"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Structure prediction","uri":"http://edamontology.org/topic_0082"},{"term":"Nucleic acid structure analysis","uri":"http://edamontology.org/topic_0097"},{"term":"RNA","uri":"http://edamontology.org/topic_0099"},{"term":"Protein secondary structure","uri":"http://edamontology.org/topic_3542"}]},"publication":[{"abstract":"The ongoing characterization of novel species creates the need for a molecular marker which can be used for species- and, simultaneously, for mega-systematics. Recently, the use of the internal transcribed spacer 2 (ITS2) sequence was suggested, as it shows a high divergence in sequence with an assumed conservation in structure. This hypothesis was mainly based on small-scale analyses, comparing a limited number of sequences. Here, we report a large-scale analysis of more than 54,000 currently known ITS2 sequences with the goal to evaluate the hypothesis of a conserved structural core and to assess its use for automated large-scale phylogenetics. Structure prediction revealed that the previously described core structure can be found for more than 5000 sequences in a wide variety of taxa within the eukaryotes, indicating that the core secondary structure is indeed conserved. This conserved structure allowed an automated alignment of extremely divergent sequences as exemplified for the ITS2 sequences of a ctenophorean eumetazoon and a volvocalean green alga. All classified sequences, together with their structures can be accessed at http://www.biozentrum.uni-wyerzburg.de/bioinformatik/projects/ITS2.html. Furthermore, we found that, although sample sequences are known for most major taxa, there exists a profound divergence in coverage, which might become a hindrance for general usage. In summary, our analysis strengthens the potential of ITS2 as a general phylogenetic marker and provides a data source for further ITS2-based analyses. Copyright © 2005 RNA Society.","authors":["Schultz J.","Maisel S.","Gerlach D.","Muller T.","Wolf M."],"cit_count":217,"journal":"RNA","pmid":"15769870","title":"A common core of secondary structure of the internal transcribed spacer 2 (ITS2) throughout the Eukaryota","year":"2005-04-01"},{"abstract":"Structural genomics meets phylogenetics and vice versa: Knowing rRNA secondary structures is a prerequisite for constructing rRNA alignments for inferring phylogenies, and inferring phylogenies is a precondition to understand the evolution of such rRNA secondary structures. Here, both scientific worlds go together. The rRNA internal transcribed spacer 2 (ITS2) region is a widely used phylogenetic marker. Because of its high variability at the sequence level, correct alignments have to take into account structural information. In this study, we examine the extent of the conservation in structure. We present (1) the homology modeled secondary structure of more than 20,000 ITS2 covering about 14,000 species; (2) a computational approach for homology modeling of rRNA structures, which additionally can be applied to other RNA families; and (3) a database providing about 25,000 ITS2 sequences with their associated secondary structures, a refined ITS2 specific general time reversible (GTR) substitution model, and a scoring matrix, available at http://its2.bioapps.biozentrum.uni- wuerzburg.de. Published by Cold Spring Harbor Laboratory Press. Copyright © 2005 RNA Society.","authors":["Wolf M.","Achtziger M.","Schultz J.","Dandekar T.","Muller T."],"cit_count":131,"journal":"RNA","pmid":"16244129","title":"Homology modeling revealed more than 20,000 rRNA internal transcribed spacer 2 (ITS2) secondary structures","year":"2005-11-01"},{"abstract":"The internal transcribed spacer 2 (ITS2) is a phylogenetic marker which has been of broad use in generic and infrageneric level classifications, as its sequence evolves comparably fast. Only recently, it became clear, that the ITS2 might be useful even for higher level systematic analyses.Asthe secondary structure is highly conserved within all eukaryotes it serves as a valuable template for the construction of highly reliable sequence-structure alignments, which build a fundament for subsequent analyses. Thus, any phylogenetic study using ITS2 has to consider both sequence and structure. We have integrated a homology based RNA structure prediction algorithm into a webserver, which allowsthe detectionand secondary structure prediction for ITS2 in any given sequence. Furthermore, the resource contains more than 25 000 pre-calculated secondary structures for the currently known ITS2 sequences. These can be taxonomically searched and browsed. Thus, our resource could become a starting point for ITS2-based phylogenetic analyses and is therefore complementary to databases of other phylogenetic markers, which focus on higher level analyses. The current version of the ITS2 database can be accessed via http://its2.bioapps.biozentrum.uni-wuerzburg.de. © The Author 2006. Published by Oxford University Press. All rights reserved.","authors":["Schultz J.","Muller T.","Achtziger M.","Seibel P.N.","Dandekar T.","Wolf M."],"cit_count":119,"journal":"Nucleic Acids Research","pmid":"16845103","title":"The internal transcribed spacer 2 database - A web server for (not only) low level phylogenetic analyses","year":"2006-07-01"},{"abstract":"The internal transcribed spacer 2 (ITS2) is a widely used phylogenetic marker. In the past, it has mainly been used for species level classifications. Nowadays, a wider applicability becomes apparent. Here, the conserved structure of the RNA molecule plays a vital role. We have developed the ITS2 Database (http://its2.bioapps.biozentrum.uni-wuerzburg.de) which holds information about sequence, structure and taxonomic classification of all ITS2 in GenBank. In the new version, we use Hidden Markov models (HMMs) for the identification and delineation of the ITS2 resulting in a major redesign of the annotation pipeline. This allowed the identification of more than 160 000 correct full length and more than 50 000 partial structures. In the web interface, these can now be searched with a modified BLAST considering both sequence and structure, enabling rapid taxon sampling. Novel sequences can be annotated using the HMM based approach and modelled according to multiple template structures. Sequences can be searched for known and newly identified motifs. Together, the database and the web server build an exhaustive resource for ITS2 based phylogenetic analyses. © The Author(s) 2009. Published by Oxford University Press.","authors":["Koetschan C.","Forster F.","Keller A.","Schleicher T.","Ruderisch B.","Schwarz R.","Muller T.","Wolf M.","Schultz J."],"cit_count":172,"journal":"Nucleic Acids Research","pmid":"19920122","title":"The ITS2 Database III Sequences and structures for phylogeny","year":"2009-11-17"}],"summary":{"biotoolsCURIE":"biotools:its2","biotoolsID":"its2","description":"The Internal Transcribed Spacer 2 Database (ITS2) includes a homology based RNA structure prediction algorithm which allows the detection and secondary structure prediction of ITS2 sequences. This resource also contains more than 25,000 pre-calculated secondary structures for currently known ITS2 sequences that can be searched and browsed via taxonomy.","homepage":"http://its2.bioapps.biozentrum.uni-wuerzburg.de/","name":"ITS2"}}