{
    "additionDate": "2020-01-09T18:22:01Z",
    "biotoolsCURIE": "biotools:rptR",
    "biotoolsID": "rptR",
    "confidence_flag": "tool",
    "description": "The rptR package offers easy-to-use functions for estimating R and its uncertainty. The package includes estimates of the repeatability (and also raw variances and marginal R2) for Gaussian traits, binomial and Poisson-distributed traits. The theory for the quantification of the repeatability for non-Gaussian traits.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/rptR/vignettes/rptR.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-15T19:53:58Z",
    "name": "rptR",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3382/PS/PEZ410",
            "metadata": {
                "abstract": "© 2019 Poultry Science Association Inc.Assessing keel bone damage reliably and accurately is a requirement for all research on this topic. Most commonly, assessment is done on live birds by palpation and is therefore prone to bias. A 2-day Training School of the COST Action “Identifying causes and solutions of keel bone damage in laying hens” with 16 participants of variable experience was held where palpation of live hens was followed by consulting corresponding radiographic images of keel bones. We hypothesized that the inter-observer and intra-observer repeatabilities as well as the agreement between palpation and assessment from the radiograph (considered as the accuracy) would increase from day 1 to 2. Repeatability estimates were calculated using the R-package rptR and the change in level of accuracy on day 1 and 2 was analyzed with generalized linear models. As predicted, the inter-observer repeatabilities of the assessments of the fractures and deviations were improved by training, but this improvement differed for fractures and deviations between the cranial, middle, and caudal parts of the keel bone. Intra-observer repeatabilities before training also differed between the different parts of the keel bone and were highest for fractures at the caudal part of the keel bone. The training affected the accuracy of palpation to different degrees for the different parts of the keel bone. A training effect was found for the caudal part of the keel bone in regard to fractures and deviations, but for fractures the training effect was missing for the cranial part and for deviations it was missing for the middle part of the keel bone. In conclusion, the training school involving radiographs improved inter-observer repeatabilities in the diagnosis of fractures and deviations of keel bones and thus had the potential to lead to more comparable results among research groups.",
                "authors": [
                    {
                        "name": "Gebhardt-Henrich S.G."
                    },
                    {
                        "name": "Rufener C."
                    },
                    {
                        "name": "Stratmann A."
                    }
                ],
                "citationCount": 5,
                "date": "2019-11-01T00:00:00Z",
                "journal": "Poultry Science",
                "title": "Improving intra- and inter-observer repeatability and accuracy of keel bone assessment by training with radiographs"
            },
            "pmid": "31581757"
        }
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ],
    "validated": 1
}