{
    "additionDate": "2018-07-31T10:58:13Z",
    "biotoolsCURIE": "biotools:merit",
    "biotoolsID": "merit",
    "credit": [
        {
            "email": "h.khiabanian@rutgers.edu",
            "name": "Hossein Khiabanian",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Mutation Error Rare Identification Toolkit is a comprehensive   pipeline designed for in-depth quantification of erroneous substitutions and small indels in high-throughput sequencing data, specifically, for ultra-deep applications.\nIt considers the genomic context of the errors, including the nucleotides immediately at their 5’ and 3’, and establishes error rates at 96 possible substitutions as well as four single-base and 16 double-base indels.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/KhiabanianLab/MERIT/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Optimisation and refinement",
                    "uri": "http://edamontology.org/operation_2425"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "DNA substitution modelling",
                    "uri": "http://edamontology.org/operation_0550"
                }
            ]
        }
    ],
    "homepage": "http://www.khiabanian-lab.org/pages/software.html",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "link": [
        {
            "type": [
                "Mirror"
            ],
            "url": "https://github.com/KhiabanianLab/MERIT"
        }
    ],
    "name": "MERIT",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "shadi.m",
    "publication": [
        {
            "doi": "10.1186/s12859-018-2223-1",
            "metadata": {
                "abstract": "© 2018 The Author(s).Background: Rapid progress in high-throughput sequencing (HTS) and the development of novel library preparation methods have improved the sensitivity of detecting mutations in heterogeneous samples, specifically in high-depth (> 500×) clinical applications. However, HTS methods are bounded by their technical and theoretical limitations and sequencing errors cannot be completely eliminated. Comprehensive quantification of the background noise can highlight both the efficiency and the limitations of any HTS methodology, and help differentiate true mutations at low abundance from artifacts. Results: We introduce MERIT (Mutation Error Rate Inference Toolkit), designed for in-depth quantification of erroneous substitutions and small insertions and deletions. MERIT incorporates an all-inclusive variant caller and considers genomic context, including the nucleotides immediately at 5 'and 3 ', thereby establishing error rates for 96 possible substitutions as well as four single-base and 16 double-base indels. We applied MERIT to ultra-deep sequencing data (1,300,000 ×) obtained from the amplification of multiple clinically relevant loci, and showed a significant relationship between error rates and genomic contexts. In addition to observing significant difference between transversion and transition rates, we identified variations of more than 100-fold within each error type at high sequencing depths. For instance, T >G transversions in trinucleotide GTCs occurred 133.5 ± 65.9 more often than those in ATAs. Similarly, C >T transitions in GCGs were observed at 73.8 ± 10.5 higher rate than those in TCTs. We also devised an in silico approach to determine the optimal sequencing depth, where errors occur at rates similar to those of expected true mutations. Our analyses showed that increasing sequencing depth might improve sensitivity for detecting some mutations based on their genomic context. For example, T >G rate of error in GTCs did not change when sequenced beyond 10,000 ×; in contrast, T >G rate in TTAs consistently improved even at above 500,000 ×. Conclusions: Our results demonstrate significant variation in nucleotide misincorporation rates, and suggest that genomic context should be considered for comprehensive profiling of specimen-specific and sequencing artifacts in high-depth assays. This data provide strong evidence against assigning a single allele frequency threshold to call mutations, for it can result in substantial false positive as well as false negative variants, with important clinical consequences.",
                "authors": [
                    {
                        "name": "Hadigol M."
                    },
                    {
                        "name": "Khiabanian H."
                    }
                ],
                "citationCount": 2,
                "date": "2018-06-08T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "MERIT reveals the impact of genomic context on sequencing error rate in ultra-deep applications"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1
}