{
    "additionDate": "2016-07-18T12:02:43Z",
    "biotoolsCURIE": "biotools:gecko",
    "biotoolsID": "gecko",
    "collectionID": [
        "ELIXIR-ES"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "name": "uma.es",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "estebanpw@uma.es",
            "name": "Esteban Pérez-Wohlfeil",
            "typeRole": [
                "Support"
            ]
        },
        {
            "email": "estebanpw@uma.es",
            "name": "Esteban Pérez-Wohlfeil",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Software aimed at pairwise sequence comparison generating high quality results (equivalent to MUMmer) with controlled memory consumption and comparable or faster execution times particularly with long sequences.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://chirimoyo.ac.uma.es/gecko/documents/GuidedExercise-fromGENOMES2Visualization-reduced-v0.2.pdf"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://sourceforge.net/projects/gecko-aligner/"
        },
        {
            "type": "Binaries",
            "url": "http://chirimoyo.ac.uma.es/gecko/files/gecko-1.2x64.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "DNA sequence",
                        "uri": "http://edamontology.org/data_3494"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "DNA sequence",
                        "uri": "http://edamontology.org/data_3494"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "note": "Pairwise sequence comparison Reference sequence Query sequence High-scoring Segment Pairs (HSPs) in custom binary format",
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Sequence alignment (pair)",
                        "uri": "http://edamontology.org/data_1381"
                    },
                    "format": [
                        {
                            "term": "Binary format",
                            "uri": "http://edamontology.org/format_2333"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://bitlab-es.com/gecko/",
    "language": [
        "C"
    ],
    "lastUpdate": "2019-01-15T02:30:22Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "GECKO",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "oscart@uma.es",
    "publication": [
        {
            "doi": "10.1186/s12859-015-0679-9",
            "metadata": {
                "abstract": "© 2015 Torreno and Trelles; licensee BioMed Central.Background: Conventional pairwise sequence comparison software algorithms are being used to process much larger datasets than they were originally designed for. This can result in processing bottlenecks that limit software capabilities or prevent full use of the available hardware resources. Overcoming the barriers that limit the efficient computational analysis of large biological sequence datasets by retrofitting existing algorithms or by creating new applications represents a major challenge for the bioinformatics community. Results: We have developed C libraries for pairwise sequence comparison within diverse architectures, ranging from commodity systems to high performance and cloud computing environments. Exhaustive tests were performed using different datasets of closely- and distantly-related sequences that span from small viral genomes to large mammalian chromosomes. The tests demonstrated that our solution is capable of generating high quality results with a linear-time response and controlled memory consumption, being comparable or faster than the current state-of-the-art methods. Conclusions: We have addressed the problem of pairwise and all-versus-all comparison of large sequences in general, greatly increasing the limits on input data size. The approach described here is based on a modular out-of-core strategy that uses secondary storage to avoid reaching memory limits during the identification of High-scoring Segment Pairs (HSPs) between the sequences under comparison. Software engineering concepts were applied to avoid intermediate result re-calculation, to minimise the performance impact of input/output (I/O) operations and to modularise the process, thus enhancing application flexibility and extendibility. Our computationally-efficient approach allows tasks such as the massive comparison of complete genomes, evolutionary event detection, the identification of conserved synteny blocks and inter-genome distance calculations to be performed more effectively.",
                "authors": [
                    {
                        "name": "Torreno O."
                    },
                    {
                        "name": "Trelles O."
                    }
                ],
                "citationCount": 14,
                "date": "2015-08-11T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Breaking the computational barriers of pairwise genome comparison"
            },
            "pmcid": "PMC4531504",
            "pmid": "26260162",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}