{
    "additionDate": "2021-01-18T12:19:16Z",
    "biotoolsCURIE": "biotools:kvarpreddb",
    "biotoolsID": "kvarpreddb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "chenli2012@zju.edu.cn",
            "name": "Chen Li",
            "orcidid": "https://orcid.org/0000-0002-8014-6848",
            "typeEntity": "Person"
        },
        {
            "email": "qinjiale@zju.edu.cn",
            "name": "Jiale Qin",
            "typeEntity": "Person"
        }
    ],
    "description": "A database for predicting pathogenicity of missense sequence variants of keratin genes associated with genodermatoses.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                },
                {
                    "term": "Variant effect prediction",
                    "uri": "http://edamontology.org/operation_0331"
                },
                {
                    "term": "Virulence prediction",
                    "uri": "http://edamontology.org/operation_3461"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.zju.edu.cn/KVarPredDB",
    "language": [
        "Java",
        "SQL"
    ],
    "lastUpdate": "2021-02-12T11:05:43Z",
    "name": "KVarPredDB",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.21203/RS.3.RS-68420/V3"
        },
        {
            "doi": "10.1186/S40246-020-00295-Z",
            "metadata": {
                "abstract": "© 2020, The Author(s).Background: Germline variants of ten keratin genes (K1, K2, K5, K6A, K6B, K9, K10, K14, K16, and K17) have been reported for causing different types of genodermatoses with an autosomal dominant mode of inheritance. Among all the variants of these ten keratin genes, most of them are missense variants. Unlike pathogenic and likely pathogenic variants, understanding the clinical importance of novel missense variants or variants of uncertain significance (VUS) is the biggest challenge for clinicians or medical geneticists. Functional characterization is the only way to understand the clinical association of novel missense variants or VUS but it is time consuming, costly, and depends on the availability of patient’s samples. Existing databases report the pathogenic variants of the keratin genes, but never emphasize the systematic effects of these variants on keratin protein structure and genotype-phenotype correlation. Results: To address this need, we developed a comprehensive database KVarPredDB, which contains information of all ten keratin genes associated with genodermatoses. We integrated and curated 400 reported pathogenic missense variants as well as 4629 missense VUS. KVarPredDB predicts the pathogenicity of novel missense variants as well as to understand the severity of disease phenotype, based on four criteria; firstly, the difference in physico-chemical properties between the wild type and substituted amino acids; secondly, the loss of inter/intra-chain interactions; thirdly, evolutionary conservation of the wild type amino acids and lastly, the effect of the substituted amino acids in the heptad repeat. Molecular docking simulations based on resolved crystal structures were adopted to predict stability changes and get the binding energy to compare the wild type protein with the mutated one. We use this basic information to determine the structural and functional impact of novel missense variants on the keratin coiled-coil heterodimer. KVarPredDB was built under the integrative web application development framework SSM (SpringBoot, Spring MVC, MyBatis) and implemented in Java, Bootstrap, React-mutation-mapper, MySQL, Tomcat. The website can be accessed through http://bioinfo.zju.edu.cn/KVarPredDB. The genomic variants and analysis results are freely available under the Creative Commons license. Conclusions: KVarPredDB provides an intuitive and user-friendly interface with computational analytical investigation for each missense variant of the keratin genes associated with genodermatoses.",
                "authors": [
                    {
                        "name": "Banerjee S."
                    },
                    {
                        "name": "Li C."
                    },
                    {
                        "name": "Li R."
                    },
                    {
                        "name": "Lu L."
                    },
                    {
                        "name": "Neculai D."
                    },
                    {
                        "name": "Qin J."
                    },
                    {
                        "name": "Wu H."
                    },
                    {
                        "name": "Xi Y."
                    },
                    {
                        "name": "Xu L."
                    },
                    {
                        "name": "Xu X."
                    },
                    {
                        "name": "Yang F."
                    },
                    {
                        "name": "Ying Y."
                    },
                    {
                        "name": "Yu H."
                    },
                    {
                        "name": "Zhao Q."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "Human Genomics",
                "title": "KVarPredDB: a database for predicting pathogenicity of missense sequence variants of keratin genes associated with genodermatoses"
            },
            "pmcid": "PMC7720490",
            "pmid": "33287903"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
