{
    "additionDate": "2021-10-25T07:47:50.424354Z",
    "biotoolsCURIE": "biotools:nibna",
    "biotoolsID": "nibna",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mandar.chaudhary@gmail.com",
            "name": "Mandar S Chaudhary",
            "orcidid": "https://orcid.org/0000-0003-1687-2471",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "thuc.le@unisa.edu.au",
            "name": "Thuc D. Le",
            "orcidid": "https://orcid.org/0000-0002-9732-4313",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "NIBNA is a network-based node importance approach for identifying breast cancer drivers.  Specifically, the well-known Louvain algorithm is used for detecting communities, and a centrality-based metric is used to compute node importance by measuring the distortion in the community structure upon the node's removal from the network.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://github.com/mandarsc/NIBNA",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-10-25T07:47:50.426783Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/mandarsc/NIBNA/issues"
        }
    ],
    "name": "NIBNA",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAB145",
            "metadata": {
                "abstract": "© 2021 The Author(s). Published by Oxford University Press. All rights reserved.Motivation: Identifying meaningful cancer driver genes in a cohort of tumors is a challenging task in cancer genomics. Although existing studies have identified known cancer drivers, most of them focus on detecting coding drivers with mutations. It is acknowledged that non-coding drivers can regulate driver mutations to promote cancer growth. In this work, we propose a novel node importance-based network analysis (NIBNA) framework to detect coding and non-coding cancer drivers. We hypothesize that cancer drivers are crucial to the formation of community structures in cancer network, and removing them from the network greatly perturbs the network structure thereby critically affecting the functioning of the network. NIBNA detects cancer drivers using a three-step process: first, a condition-specific network is built by incorporating gene expression data and gene networks; second, the community structures in the network are estimated; and third, a centrality-based metric is applied to compute node importance. Results: We apply NIBNA to the BRCA dataset, and it outperforms existing state-of-art methods in detecting coding cancer drivers. NIBNA also predicts 265 miRNA drivers, and majority of these drivers have been validated in literature. Further we apply NIBNA to detect cancer subtype-specific drivers, and several predicted drivers have been validated to be associated with cancer subtypes. Lastly, we evaluate NIBNA's performance in detecting epithelial-mesenchymal transition drivers, and we confirmed 8 coding and 13 miRNA drivers in the list of known genes.",
                "authors": [
                    {
                        "name": "Chaudhary M.S."
                    },
                    {
                        "name": "Pham V.V.H."
                    },
                    {
                        "name": "Le T.D."
                    }
                ],
                "date": "2021-09-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "NIBNA: A network-based node importance approach for identifying breast cancer drivers"
            },
            "pmid": "33677485",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}