{
    "name": "miR_Path", 
    "description": "Software for inferring cancer-related miRNAs based on gene expression data. It is a novel computational framework to identify the cancer-related miRNAs based solely on gene expression profiles which can effectively identify cancer-related miRNAs with higher precision compared with other popular approaches.", 
    "homepage": "http://comp-sysbio.org/miR_Path/", 
    "biotoolsID": "mir_path", 
    "biotoolsCURIE": "biotools:mir_path", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2495", 
                    "term": "Gene expression analysis"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_2640", 
            "term": "Oncology"
        }, 
        {
            "uri": "http://edamontology.org/topic_0203", 
            "term": "Gene expression"
        }, 
        {
            "uri": "http://edamontology.org/topic_0659", 
            "term": "Functional, regulatory and non-coding RNA"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "R"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/mir_path-inferring-cancer-related-mirnas-based-on-gene-expression-data.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://comp-sysbio.org/miR_Path/", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "25505085", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Identifying cancer-related microRNAs based on gene expression data", 
                "abstract": "© 2014 The Author. Motivation: MicroRNAs (miRNAs) are short non-coding RNAs that play important roles in post-transcriptional regulations as well as other important biological processes. Recently, accumulating evidences indicate that miRNAs are extensively involved in cancer. However, it is a big challenge to identify which miRNAs are related to which cancer considering the complex processes involved in tumors, where one miRNA may target hundreds or even thousands of genes and one gene may regulate multiple miRNAs. Despite integrative analysis of matched gene and miRNA expression data can help identify cancer-associated miRNAs, such kind of data is not commonly available. On the other hand, there are huge amount of gene expression data that are publicly accessible. It will significantly improve the efficiency of characterizing miRNA' s function in cancer if we can identify cancer miRNAs directly from gene expression data. Results: We present a novel computational framework to identify the cancer-related miRNAs based solely on gene expression profiles without requiring either miRNA expression data or the matched gene and miRNA expression data. The results on multiple cancer datasets show that our proposed method can effectively identify cancer-related miRNAs with higher precision compared with other popular approaches. Furthermore, some of our novel predictions are validated by both differentially expressed miRNAs and evidences from literature, implying the predictive power of our proposed method. In addition, we construct a cancer-miRNA-pathway network, which can help explain how miRNAs are involved in cancer. Availability and implementation: The R code and data files for the proposed method are available at http://comp-sysbio.org/miR-Path/.", 
                "date": "2015-04-15T00:00:00Z", 
                "citationCount": 33, 
                "authors": [
                    {
                        "name": "Zhao X.-M."
                    }, 
                    {
                        "name": "Liu K.-Q."
                    }, 
                    {
                        "name": "Zhu G."
                    }, 
                    {
                        "name": "He F."
                    }, 
                    {
                        "name": "Duval B."
                    }, 
                    {
                        "name": "Richer J.-M."
                    }, 
                    {
                        "name": "Huang D.-S."
                    }, 
                    {
                        "name": "Jiang C.-J."
                    }, 
                    {
                        "name": "Hao J.-K."
                    }, 
                    {
                        "name": "Chen L."
                    }
                ], 
                "journal": "Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": "xm_zhao@tongji.edu.cn", 
            "url": "http://comp-sysbio.org/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T19:07:05Z", 
    "lastUpdate": "2018-12-10T12:58:49Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}