{
    "additionDate": "2021-01-20T10:51:38Z",
    "biotoolsCURIE": "biotools:pbrit",
    "biotoolsID": "pbrit",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "geert.vandeweyer@uantwerpen.be",
            "name": "Geert Vandeweyer",
            "typeEntity": "Person"
        }
    ],
    "description": "Gene prioritization by correlating functional and phenotypic annotations through integrative data fusion.\n\npBRIT : Gene prioritization tool.\n\npBRIT candiate gene prioritization.\n\npBRIT stands for priortization of candidate genes using Bayesian Ridge Regression and Information Theoretic Model. It is an adaptive and scalable prioritzation tool that integrates Pubmed Abstracts, Gene Ontology, Pathways (Biocarta, EHMN, HumanCyc, INOH, KEGG, NetPath, PharmGKB, PID, Reactome, Signalink, SMPDB, WikiPathways), Protein-Protein Interactions (PhosphoPOINT, PDZBase, NetPath, PINdb, BIND, CORUM, Biogrid, InnateDB, MIPS-MPPI, Spike, Manual upload, MatrixDB, DIP, IntAct, MINT, PDB, HPRD), Protein sequence similarities (BLAST), Mouse Phenotype Ontologies (MPO), Human Phenotype Ontology (HPO), Disease Ontology (DO), Genetic association database (GAD), HuGe. pBRIT is available as web-interface for single exome prioritization or as an API for >1000 exomes in batch mode.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Gene functional annotation",
                    "uri": "http://edamontology.org/operation_3672"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "http://biomina.be/apps/pbrit/",
    "lastUpdate": "2021-05-18T05:47:42Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://bitbucket.org/medgenua/pbrit"
        }
    ],
    "name": "pBRIT",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTY079",
            "metadata": {
                "abstract": "© The Author(s) 2018. Published by Oxford University Press. All rights reserved.Motivation: Computational gene prioritization can aid in disease gene identification. Here, we propose pBRIT (prioritization using Bayesian Ridge regression and Information Theoretic model), a novel adaptive and scalable prioritization tool, integrating Pubmed abstracts, Gene Ontology, Sequence similarities, Mammalian and Human Phenotype Ontology, Pathway, Interactions, Disease Ontology, Gene Association database and Human Genome Epidemiology database, into the prediction model. We explore and address effects of sparsity and inter-feature dependencies within annotation sources, and the impact of bias towards specific annotations. Results: pBRIT models feature dependencies and sparsity by an Information-Theoretic (data driven) approach and applies intermediate integration based data fusion. Following the hypothesis that genes underlying similar diseases will share functional and phenotype characteristics, it incorporates Bayesian Ridge regression to learn a linear mapping between functional and phenotype annotations. Genes are prioritized on phenotypic concordance to the training genes. We evaluated pBRIT against nine existing methods, and on over 2000 HPO-gene associations retrieved after construction of pBRIT data sources. We achieve maximum AUC scores ranging from 0.92 to 0.96 against benchmark datasets and of 0.80 against the time-stamped HPO entries, indicating good performance with high sensitivity and specificity. Our model shows stable performance with regard to changes in the underlying annotation data, is fast and scalable for implementation in routine pipelines.",
                "authors": [
                    {
                        "name": "Alaerts M."
                    },
                    {
                        "name": "Ardeshirdavani A."
                    },
                    {
                        "name": "Kumar A.A."
                    },
                    {
                        "name": "Laukens K."
                    },
                    {
                        "name": "Loeys B."
                    },
                    {
                        "name": "Moreau Y."
                    },
                    {
                        "name": "Van Laer L."
                    },
                    {
                        "name": "Vandeweyer G."
                    }
                ],
                "citationCount": 6,
                "date": "2018-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "PBRIT: Gene prioritization by correlating functional and phenotypic annotations through integrative data fusion"
            },
            "pmcid": "PMC6022555",
            "pmid": "29452392"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
