{"credit":[{"email":"han@cdfd.org.in","name":"Hampapathalu A. Nagarajaram","typeEntity":"Person","typeRoles":["Primary contact"]}],"function":[{"operation":[{"term":"Phasing","uri":"http://edamontology.org/operation_3454"},{"term":"Repeat sequence detection","uri":"http://edamontology.org/operation_0379"},{"term":"PCR primer design","uri":"http://edamontology.org/operation_0308"},{"term":"Repeat sequence analysis","uri":"http://edamontology.org/operation_0237"},{"term":"Genetic variation analysis","uri":"http://edamontology.org/operation_3197"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Database portal"],"topic":[{"term":"Genetic variation","uri":"http://edamontology.org/topic_0199"},{"term":"DNA polymorphism","uri":"http://edamontology.org/topic_2885"},{"term":"Sequence composition, complexity and repeats","uri":"http://edamontology.org/topic_0157"},{"term":"Immunoproteins, genes and antigens","uri":"http://edamontology.org/topic_2830"}]},"publication":[{"abstract":"PSSRdb (Polymorphic Simple Sequence Repeats database) (http://www.cdfd.org. in/PSSRdb/) is a relational database of polymorphic simple sequence repeats (PSSRs) extracted from 85 different species of prokaryotes. Simple sequence repeats (SSRs) are the tandem repeats of nucleotide motifs of the sizes 1-6 bp and are highly polymorphic. SSR mutations in and around coding regions affect transcription and translation of genes. Such changes underpin phase variations and antigenic variations seen in some bacteria. Although SSR-mediated phase variation and antigenic variations have been well-studied in some bacteria there seems a lot of other species of prokaryotes yet to be investigated for SSR mediated adaptive and other evolutionary advantages. As a part of our on-going studies on SSR polymorphism in prokaryotes we compared the genome sequences of various strains and isolates available for 85 different species of prokaryotes and extracted a number of SSRs showing length variations and created a relational database called PSSRdb. This database gives useful information such as location of PSSRs in genomes, length variation across genomes, the regions harboring PSSRs, etc. The information provided in this database is very useful for further research and analysis of SSRs in prokaryotes. © The Author(s) 2010.","authors":["Kumar P.","Chaitanya P.S.","Nagarajaram H.A."],"cit_count":7,"journal":"Nucleic Acids Research","pmid":"21112874","title":"PSSRdb: A relational database of polymorphic simple sequence repeats extracted from prokaryotic genomes","year":"2011-01-01"}],"summary":{"biotoolsCURIE":"biotools:pssrdb","biotoolsID":"pssrdb","description":"Relational database of polymorphic simple sequence repeats (PSSRs) extracted from different species of prokaryotes. This database gives useful information such as location of PSSRs in genomes, length variation across genomes, the regions harboring PSSRs, etc.","homepage":"http://www.cdfd.org.in/PSSRdb/","name":"PSSRdb"}}