{"credit":[{"email":"dshuang@tongji.edu.cn","name":"De-Shuang Huang","typeEntity":"Person","typeRoles":["Primary contact"]}],"function":[{"operation":[{"term":"Pathway or network prediction","uri":"http://edamontology.org/operation_3439"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Microbial ecology","uri":"http://edamontology.org/topic_3697"},{"term":"Machine learning","uri":"http://edamontology.org/topic_3474"},{"term":"Pathology","uri":"http://edamontology.org/topic_0634"}]},"publication":[{"abstract":"© 2017 The Author(s). Background: Accumulating biological and clinical reports have indicated that imbalance of microbial community is closely associated with occurrence and development of various complex human diseases. Identifying potential microbe-disease associations, which could provide better understanding of disease pathology and further boost disease diagnostic and prognostic, has attracted more and more attention. However, hardly any computational models have been developed for large scale microbe-disease association prediction. Results: In this article, based on the assumption that microbes with similar functions tend to share similar association or non-association patterns with similar diseases and vice versa, we proposed the model of Network Consistency Projection for Human Microbe-Disease Association prediction (NCPHMDA) by integrating known microbe-disease associations and Gaussian interaction profile kernel similarity for microbes and diseases. NCPHMDA yielded outstanding AUCs of 0.9039, 0.7953 and average AUC of 0.8918 in global leave-one-out cross validation, local leave-one-out cross validation and 5-fold cross validation, respectively. Furthermore, colon cancer, asthma and type 2 diabetes were taken as independent case studies, where 9, 9 and 8 out of the top 10 predicted microbes were successfully confirmed by recent published clinical literature. Conclusion: NCPHMDA is a non-parametric universal network-based method which can simultaneously predict associated microbes for investigated diseases but does not require negative samples. It is anticipated that NCPHMDA would become an effective biological resource for clinical experimental guidance.","authors":["Bao W.","Jiang Z.","Huang D.-S."],"cit_count":6,"doi":"10.1186/s12859-017-1968-2","journal":"BMC Bioinformatics","title":"Novel human microbe-disease association prediction using network consistency projection","type":"Primary","year":"2017-12-28"}],"summary":{"biotoolsCURIE":"biotools:hmdad","biotoolsID":"hmdad","description":"Human microbe-disease association prediction using network consistency projection.","homepage":"http://www.cuilab.cn/hmdad","name":"Human Microbe-Disease Association Database (HMDAD)"}}