
{
    "credit": [
        {
            "email": "jeff.xia@mcgill.ca",
            "name": "Jeff Xia",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://www.networkanalyst.ca/faces/docs/Tutorial.xhtml"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression profile clustering",
                    "uri": "http://edamontology.org/operation_0313"
                },
                {
                    "term": "Over-representation analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Metabolomics",
                "uri": "http://edamontology.org/topic_3172"
            },
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "Experimental design and studies",
                "uri": "http://edamontology.org/topic_3678"
            },
            {
                "term": "Small molecules",
                "uri": "http://edamontology.org/topic_0154"
            },
            {
                "term": "Microarray experiment",
                "uri": "http://edamontology.org/topic_3518"
            }
        ]
    },
    "publication": [
        {
            "abstract": "The widespread applications of various 'omics' technologies in biomedical research together with the emergence of public data repositories have resulted in a plethora of data sets for almost any given physiological state or disease condition. Properly combining or integrating these data sets with similar basic hypotheses can help reduce study bias, increase statistical power and improve overall biological understanding. However, the difficulties in data management and the complexities of analytical approaches have significantly limited data integration to enable meta-analysis. Here, we introduce integrative meta-analysis of expression data (INMEX), a user-friendly web-based tool designed to support meta-analysis of multiple gene-expression data sets, as well as to enable integration of data sets from gene expression and metabolomics experiments. INMEX contains three functional modules. The data preparation module supports flexible data processing, annotation and visualization of individual data sets. The statistical analysis module allows researchers to combine multiple data sets based on P-values, effect sizes, rank orders and other features. The significant genes can be examined in functional analysis module for enriched Gene Ontology terms or Kyoto Encyclopedia of Genes and Genomes (KEGG) pathways, or expression profile visualization. INMEX has built-in support for common gene/metabolite identifiers (IDs), as well as 45 popular microarray platforms for human, mouse and rat. Complex operations are performed through a user-friendly web interface in a step-by-step manner. INMEX is freely available at http://www.inmex.ca.",
            "authors": [
                "Xia J.",
                "Fjell C.D.",
                "Mayer M.L.",
                "Pena O.M.",
                "Wishart D.S.",
                "Hancock R.E."
            ],
            "cit_count": 71,
            "journal": "Nucleic acids research",
            "pmid": "23766290",
            "title": "INMEX--a web-based tool for integrative meta-analysis of expression data.",
            "year": "2013-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:inmex",
        "biotoolsID": "inmex",
        "description": "Web based tool designed to support meta-analysis of multiple gene-expression data sets, as well as to enable integration of data sets from gene expression and metabolomics experiments.",
        "homepage": "http://www.inmex.ca",
        "name": "INMEX"
    }
}