{
    "additionDate": "2023-02-20T17:17:04.822580Z",
    "biotoolsCURIE": "biotools:endhic",
    "biotoolsID": "endhic",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "fanwei@caas.cn",
            "name": "Wei Fan",
            "orcidid": "https://orcid.org/0000-0001-5036-8733",
            "typeEntity": "Person"
        },
        {
            "email": "milrazhang@163.com",
            "name": "Yan Zhang",
            "typeEntity": "Person"
        }
    ],
    "description": "EndHic is a fast and easy-to-use Hi-C scaffolding tool, using the Hi-C links from contig end regions instead of whole contig regions to assemble large contigs into chromosomal-level scaffolds.",
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/fanagislab/EndHiC/tree/master/z.testing_data"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                },
                {
                    "term": "Mapping assembly",
                    "uri": "http://edamontology.org/operation_0523"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "homepage": "https://github.com/fanagislab/EndHiC",
    "language": [
        "Perl",
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:59:23.287140Z",
    "license": "GPL-1.0",
    "name": "EndHiC",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/s12859-022-05087-x",
            "metadata": {
                "abstract": "Background: The application of PacBio HiFi and ultra-long ONT reads have enabled huge progress in the contig-level assembly, but it is still challenging to assemble large contigs into chromosomes with available Hi-C scaffolding tools, which count Hi-C links between contigs using the whole or a large part of contig regions. As the Hi-C links of two adjacent contigs concentrate only at the neighbor ends of the contigs, larger contig size will reduce the power to differentiate adjacent (signal) and non-adjacent (noise) contig linkages, leading to a higher rate of mis-assembly. Results: We design and develop a novel Hi-C based scaffolding tool EndHiC, which is suitable to assemble large contigs into chromosomal-level scaffolds. The core idea behind EndHiC, which distinguishes it from other Hi-C scaffolding tools, is using Hi-C links only from the most effective regions of contig ends. By this way, the signal neighbor contig linkages and noise non-neighbor contig linkages are separated more clearly. Benefiting from the increased signal to noise ratio, the reciprocal best requirement, as well as the robustness evaluation, EndHiC achieves higher accuracy for scaffolding large contigs compared to existing tools. EndHiC has been successfully applied in the Hi-C scaffolding of simulated data from human, rice and Arabidopsis, and real data from human, great burdock, water spinach, chicory, endive, yacon, and Ipomoea cairica, suggesting that EndHiC can be applied to a broad range of plant and animal genomes. Conclusions: EndHiC is a novel Hi-C scaffolding tool, which is suitable for scaffolding of contig assemblies with contig N50 size near or over 10 Mb and N90 size near or over 1 Mb. EndHiC is efficient both in time and memory, and it is interface-friendly to the users. As more genome projects have been launched and the contig continuity constantly improved, we believe EndHiC has the potential to make a great contribution to the genomics field and liberate the scientists from labor-intensive manual curation works.",
                "authors": [
                    {
                        "name": "Fan W."
                    },
                    {
                        "name": "Jiang F."
                    },
                    {
                        "name": "Liu H."
                    },
                    {
                        "name": "Wang A."
                    },
                    {
                        "name": "Wang H."
                    },
                    {
                        "name": "Wang S."
                    },
                    {
                        "name": "Xu D."
                    },
                    {
                        "name": "Yang B."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Zhao H."
                    }
                ],
                "citationCount": 14,
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "EndHiC: assemble large contigs into chromosome-level scaffolds using the Hi-C links from contig ends"
            },
            "pmcid": "PMC9730666",
            "pmid": "36482318"
        }
    ],
    "toolType": [
        "Script",
        "Workflow"
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ]
}
