{
    "additionDate": "2020-01-09T18:02:46Z",
    "biotoolsCURIE": "biotools:LiSep_LSTM",
    "biotoolsID": "LiSep_LSTM",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "josef.fagerstrom@liu.se",
            "name": "Josef Fagerström",
            "typeEntity": "Person"
        }
    ],
    "description": "A Machine Learning Algorithm for Early Detection of Septic Shock.\n\nSepsis is a major health concern with global estimates of 31.5 million cases per year. Case fatality rates are still unacceptably high, and early detection and treatment is vital since it significantly reduces mortality rates for this condition. Appropriately designed automated detection tools have the potential to reduce the morbidity and mortality of sepsis by providing early and accurate identification of patients who are at risk of developing sepsis. In this paper, we present \"LiSep LSTM\"; a Long Short-Term Memory neural network designed for early identification of septic shock. LSTM networks are typically well-suited for detecting long-term dependencies in time series data. LiSep LSTM was developed using the machine learning framework Keras with a Google TensorFlow back end.\n\n||| HOMEPAGE MISSING!",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31641162",
    "lastUpdate": "2020-01-09T18:02:46Z",
    "name": "LiSep LSTM",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1038/S41598-019-51219-4",
            "metadata": {
                "abstract": "© 2019, The Author(s).Sepsis is a major health concern with global estimates of 31.5 million cases per year. Case fatality rates are still unacceptably high, and early detection and treatment is vital since it significantly reduces mortality rates for this condition. Appropriately designed automated detection tools have the potential to reduce the morbidity and mortality of sepsis by providing early and accurate identification of patients who are at risk of developing sepsis. In this paper, we present “LiSep LSTM”; a Long Short-Term Memory neural network designed for early identification of septic shock. LSTM networks are typically well-suited for detecting long-term dependencies in time series data. LiSep LSTM was developed using the machine learning framework Keras with a Google TensorFlow back end. The model was trained with data from the Medical Information Mart for Intensive Care database which contains vital signs, laboratory data, and journal entries from approximately 59,000 ICU patients. We show that LiSep LSTM can outperform a less complex model, using the same features and targets, with an AUROC 0.8306 (95% confidence interval: 0.8236, 0.8376) and median offsets between prediction and septic shock onset up to 40 hours (interquartile range, 20 to 135 hours). Moreover, we discuss how our classifier performs at specific offsets before septic shock onset, and compare it with five state-of-the-art machine learning algorithms for early detection of sepsis.",
                "authors": [
                    {
                        "name": "Fagerstrom J."
                    },
                    {
                        "name": "Bang M."
                    },
                    {
                        "name": "Wilhelms D."
                    },
                    {
                        "name": "Chew M.S."
                    }
                ],
                "citationCount": 3,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "LiSep LSTM: A Machine Learning Algorithm for Early Detection of Septic Shock"
            },
            "pmcid": "PMC6805937",
            "pmid": "31641162"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Allergy, clinical immunology and immunotherapeutics",
            "uri": "http://edamontology.org/topic_3400"
        },
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        }
    ]
}