{
    "additionDate": "2019-11-14T19:34:44Z",
    "biotoolsCURIE": "biotools:MetaTOR",
    "biotoolsID": "MetaTOR",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Lyam Baudry",
            "typeEntity": "Person"
        },
        {
            "name": "Théo Foutel-Rodier",
            "typeEntity": "Person"
        },
        {
            "email": "romain.koszul@pasteur.fr",
            "name": "Romain Koszul",
            "typeEntity": "Person"
        },
        {
            "email": "martial.marbouty@pasteur.fr",
            "name": "Martial Marbouty",
            "typeEntity": "Person"
        }
    ],
    "description": "A Computational Pipeline to Recover High-Quality Metagenomic Bins From Mammalian Gut Proximity-Ligation (meta3C) Libraries | Metagenomic binning based on Hi-C data | pip3 install -e git+https://github.com/koszullab/metator.git@master#egg=metator | Metagenomic Tridimensional Organisation-based Reassembly - A set of scripts that streamline the processing and binning of metagenomic 3C datasets | Please refer to the tutorial in order to quickly get the pipeline up and running on example data (or your own), and the metaTOR manual for detailed explanations on the parameters",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Read binning",
                    "uri": "http://edamontology.org/operation_3798"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "https://github.com/koszullab/metaTOR",
    "language": [
        "Shell",
        "Python"
    ],
    "lastUpdate": "2020-12-28T09:33:58Z",
    "license": "GPL-3.0",
    "name": "MetaTOR",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FGENE.2019.00753",
            "metadata": {
                "abstract": "Copyright © 2019 Baudry, Foutel-Rodier, Thierry, Koszul and Marbouty. This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms.Characterizing the complete genomic structure of complex microbial communities would represent a key step toward the understanding of their diversity, dynamics, and evolution. Current metagenomics approaches aiming at this goal are typically done by analyzing millions of short DNA sequences directly extracted from the environment. New experimental and computational approaches are constantly sought for to improve the analysis and interpretation of such data. We developed MetaTOR, an open-source computational solution that bins DNA contigs into individual genomes according to their 3D contact frequencies. Those contacts are quantified by chromosome conformation capture experiments (3C, Hi-C), also known as proximity-ligation approaches, applied to metagenomics samples (meta3C). MetaTOR was applied on 20 meta3C libraries of mice gut microbiota. We quantified the program ability to recover high-quality metagenome-assembled genomes (MAGs) from metagenomic assemblies generated directly from the meta3C libraries. Whereas nine high-quality MAGs are identified in the 148-Mb assembly generated using a single meta3C library, MetaTOR identifies 82 high-quality MAGs in the 763-Mb assembly generated from the merged 20 meta3C libraries, corresponding to nearly a third of the total assembly. Compared to the hybrid binning softwares MetaBAT or CONCOCT, MetaTOR recovered three times more high-quality MAGs. These results underline the potential of 3C-/Hi-C-based approaches in metagenomic projects.",
                "authors": [
                    {
                        "name": "Baudry L."
                    },
                    {
                        "name": "Foutel-Rodier T."
                    },
                    {
                        "name": "Thierry A."
                    },
                    {
                        "name": "Koszul R."
                    },
                    {
                        "name": "Marbouty M."
                    }
                ],
                "citationCount": 2,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "MetaTor: A computational pipeline to recover high-quality metagenomic bins from mammalian gut proximity-ligation (Meta3C) libraries"
            },
            "pmcid": "PMC6710406",
            "pmid": "31481973"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ],
    "validated": 1
}