{
    "additionDate": "2017-12-18T00:12:52Z",
    "biotoolsCURIE": "biotools:svm-rne",
    "biotoolsID": "svm-rne",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://web.macam.ac.il/~myousef/"
        }
    ],
    "description": "Classification and biomarker identification using gene network modules and support vector machines. Uses the Gene Expression Network Analysis Tool (GXNA)  as clustering method to identify correlated gene clusters, and Support Vector Machines to identify and (rank) those gene networks (clusters) for accuracy of classification.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://web.macam.ac.il/~myousef/MyTools/SVM-RNE-Instruction.doc"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Classification",
                    "uri": "http://edamontology.org/operation_2990"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "http://web.macam.ac.il/~myousef/MyTools/SVM-RNE.htm",
    "language": [
        "MATLAB",
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/svm-rne-classification-and-biomarker-identification-using-gene-network-modules-and-support-vector-machines.html"
        }
    ],
    "name": "SVM-RNE",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-10-337",
            "metadata": {
                "abstract": "Background: Classification using microarray datasets is usually based on a small number of samples for which tens of thousands of gene expression measurements have been obtained. The selection of the genes most significant to the classification problem is a challenging issue in high dimension data analysis and interpretation. A previous study with SVM-RCE (Recursive Cluster Elimination), suggested that classification based on groups of correlated genes sometimes exhibits better performance than classification using single genes. Large databases of gene interaction networks provide an important resource for the analysis of genetic phenomena and for classification studies using interacting genes. Results: We now demonstrate that an algorithm which integrates network information with recursive feature elimination based on SVM exhibits good performance and improves the biological interpretability of the results. We refer to the method as SVM with Recursive Network Elimination (SVM-RNE). Conclusion: Initially, one thousand genes selected by t-test from a training set are filtered so that only genes that map to a gene network database remain. The Gene Expression Network Analysis Tool (GXNA) is applied to the remaining genes to form n clusters of genes that are highly connected in the network. Linear SVM is used to classify the samples using these clusters, and a weight is assigned to each cluster based on its importance to the classification. The least informative clusters are removed while retaining the remainder for the next classification step. This process is repeated until an optimal classification is obtained. More than 90% accuracy can be obtained in classification of selected microarray datasets by integrating the interaction network information with the gene expression information from the microarrays. The Matlab version of SVM-RNE can be downloaded from http://web.macam.ac.il/~myousef. © 2009 Yousef et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Yousef M."
                    },
                    {
                        "name": "Ketany M."
                    },
                    {
                        "name": "Manevitz L."
                    },
                    {
                        "name": "Showe L.C."
                    },
                    {
                        "name": "Showe M.K."
                    }
                ],
                "citationCount": 30,
                "date": "2009-10-15T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Classification and biomarker identification using gene network modules and support vector machines"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}