{
    "name": "Rankpep", 
    "description": "This server predicts peptide binders to MHCI and MHCII molecules from protein sequence/s or sequence alignments using Position Specific Scoring Matrices (PSSMs). In addition, it predicts those MHCI ligands whose C-terminal end is likely to be the result of proteasomal cleavage. A detailed explanation of the method can be found here.", 
    "homepage": "http://imed.med.ucm.es/Tools/rankpep.html", 
    "biotoolsID": "rankpep", 
    "biotoolsCURIE": "biotools:rankpep", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0416", 
                    "term": "Epitope mapping"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0121", 
            "term": "Proteomics"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [], 
    "license": null, 
    "collectionID": [
        "Proteomics"
    ], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "http://imed.med.ucm.es/Tools/rankpep.html", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1016/S0198-8859(02)00432-9", 
            "pmid": "12175724", 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "Prediction of MHC class I binding peptides using profile motifs", 
                "abstract": "Peptides that bind to a given major histocompatibility complex (MHC) molecule share sequence similarity. Therefore, a position specific scoring matrix (PSSM) or profile derived from a set of peptides known to bind to a specific MHC molecule would be a suitable predictor of whether other peptides might bind, thus anticipating possible T-cell epitopes within a protein. In this approach, the binding potential of any peptide sequence (query) to a given MHC molecule is linked to its similarity to a group of aligned peptides known to bind to that MHC, and can be obtained by comparing the query to the PSSM, This article describes the derivation of alignments and profiles from a collection of peptides known to bind a specific MHC, compatible with the structural and molecular basis of the peptide-MHC class I (MHCI) interaction. Moreover, in order to apply these profiles to the prediction of peptide-MHCI binding, we have developed a new search algorithm (RANKPEP) that ranks all possible peptides from an input protein using the PSSM coefficients. The predictive power of the method was evaluated by running RANKPEP on proteins known to bear MHCI Kb- and Db-restricted T-cell epitopes. Analysis of the results indicates that > 80% of these epitopes are among the top 2% of scoring peptides. Prediction of peptide-MHC binding using a variety of MHCI-specific PSSMs is available on line at our RANK-PEP web server (www.mifoundation.org/Tools/rank- pep.html). In addition, the RANKPEP server also allows the user to enter additional profiles, making the server a powerful and versatile computational biology benchmark for the prediction of peptide-MHC binding. © American Society for Histocompatibility and Immunogenetics, 2002. Published by Elsevier Science Inc.", 
                "date": "2002-09-01T00:00:00Z", 
                "citationCount": 228, 
                "authors": [
                    {
                        "name": "Reche P.A."
                    }, 
                    {
                        "name": "Glutting J.-P."
                    }, 
                    {
                        "name": "Reinherz E.L."
                    }
                ], 
                "journal": "Human Immunology"
            }
        }
    ], 
    "credit": [
        {
            "name": "SECRETARIA GENERAL DE CIENCIA, TECNOLOGIA E INNOVACION OF SPAIN", 
            "email": "sgcti@mineco.es", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }, 
        {
            "name": "Pedro Reche", 
            "email": null, 
            "url": null, 
            "orcidid": "https://orcid.org/0000-0003-3966-5838", 
            "typeEntity": null, 
            "typeRole": [], 
            "note": null
        }
    ], 
    "owner": "Roux", 
    "additionDate": "2017-12-06T18:14:51Z", 
    "lastUpdate": "2019-03-26T08:37:01Z", 
    "editPermission": {
        "type": "group", 
        "authors": [
            "Roux", 
            "proteomics.bio.tools"
        ]
    }, 
    "validated": 0, 
    "homepage_status": 0, 
    "elixir_badge": 0
}