
{
    "credit": [
        {
            "email": "rdpstaff@msu.edu",
            "name": "RDP Staff",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://pyro.cme.msu.edu/pyro/help.jsp"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                },
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Metagenomics",
                "uri": "http://edamontology.org/topic_3174"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Ribosomal Database Project (RDP; http://rdp.cme.msu.edu/) provides the research community with aligned and annotated rRNA gene sequence data, along with tools to allow researchers to analyze their own rRNA gene sequences in the RDP framework. RDP data and tools are utilized in fields as diverse as human health, microbial ecology, environmental microbiology, nucleic acid chemistry, taxonomy and phylogenetics. In addition to aligned and annotated collections of bacterial and archaeal small subunit rRNA genes, RDP now includes a collection of fungal large subunit rRNA genes. RDP tools, including Classifier and Aligner, have been updated to work with this new fungal collection. The use of high-throughput sequencing to characterize environmental microbial populations has exploded in the past several years, and as sequence technologies have improved, the sizes of environmental datasets have increased. With release 11, RDP is providing an expanded set of tools to facilitate analysis of high-throughput data, including both single-stranded and paired-end reads. In addition, most tools are now available as open source packages for download and local use by researchers with high-volume needs or who would like to develop custom analysis pipelines. © 2013 The Author(s). Published by Oxford University Press.",
            "authors": [
                "Cole J.R.",
                "Wang Q.",
                "Fish J.A.",
                "Chai B.",
                "McGarrell D.M.",
                "Sun Y.",
                "Brown C.T.",
                "Porras-Alfaro A.",
                "Kuske C.R.",
                "Tiedje J.M."
            ],
            "cit_count": 1076,
            "doi": "10.1093/nar/gkt1244",
            "journal": "Nucleic Acids Research",
            "title": "Ribosomal Database Project: Data and tools for high throughput rRNA analysis",
            "type": "Other",
            "year": "2014-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:rdp_pyrosequencing_pipeline",
        "biotoolsID": "rdp_pyrosequencing_pipeline",
        "description": "The Ribosomal Database Project's Pyrosequencing Pipeline aims to simplify the processing of large 16s rRNA sequence libraries obtained through pyrosequencing. This site processes and converts the data to formats suitable for common ecological and statistical packages such as SPADE, EstimateS, and R.",
        "homepage": "http://pyro.cme.msu.edu/index.jsp",
        "name": "RDP Pyrosequencing Pipeline"
    }
}