{
    "additionDate": "2019-11-14T19:51:11Z",
    "biotoolsCURIE": "biotools:LUCIDus",
    "biotoolsID": "LUCIDus",
    "confidence_flag": "tool",
    "description": "A Latent Unknown Clustering Integrating Multi-Omics Data (LUCID) with Phenotypic Traits | Latent Unknown Clustering with Integrated Data | An implementation for the 'LUCID' method to jointly estimate latent unknown clusters/subgroups with integrated data. An EM algorithm is used to obtain the latent cluster assignment and model parameter estimates. Feature selection is achieved by applying the regularization method",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "https://CRAN.R-project.org/package=LUCIDus",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T20:53:30.816817Z",
    "license": "GPL-2.0",
    "name": "LUCIDus",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btz667",
            "metadata": {
                "abstract": "Motivation: Epidemiologic, clinical and translational studies are increasingly generating multiplatform omics data. Methods that can integrate across multiple high-dimensional data types while accounting for differential patterns are critical for uncovering novel associations and underlying relevant subgroups. Results: We propose an integrative model to estimate latent unknown clusters (LUCID) aiming to both distinguish unique genomic, exposure and informative biomarkers/omic effects while jointly estimating subgroups relevant to the outcome of interest. Simulation studies indicate that we can obtain consistent estimates reflective of the true simulated values, accurately estimate subgroups and recapitulate subgroup-specific effects. We also demonstrate the use of the integrated model for future prediction of risk subgroups and phenotypes. We apply this approach to two real data applications to highlight the integration of genomic, exposure and metabolomic data.",
                "authors": [
                    {
                        "name": "Asante I."
                    },
                    {
                        "name": "Casey G."
                    },
                    {
                        "name": "Chatzi L."
                    },
                    {
                        "name": "Conti D.V."
                    },
                    {
                        "name": "Jin R."
                    },
                    {
                        "name": "Louie S."
                    },
                    {
                        "name": "Peng C."
                    },
                    {
                        "name": "Thomas D.C."
                    },
                    {
                        "name": "Wang J."
                    }
                ],
                "citationCount": 17,
                "date": "2020-02-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "A latent unknown clustering integrating multi-omics data (LUCID) with phenotypic traits"
            },
            "pmcid": "PMC7986585",
            "pmid": "31504184"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        }
    ],
    "validated": 1
}
