{
    "additionDate": "2019-11-14T18:40:13Z",
    "biotoolsCURIE": "biotools:GEO2R",
    "biotoolsID": "GEO2R",
    "confidence_flag": "low",
    "credit": [
        {
            "email": "wangqianwater1988@163.com",
            "name": "Wang Qian",
            "orcidid": "https://orcid.org/0000-0002-6014-7392",
            "typeEntity": "Person"
        },
        {
            "email": "linqiuning@126.com",
            "name": "Qiuning Lin",
            "typeEntity": "Person"
        },
        {
            "email": "wangyiliwenli@163.com",
            "name": "Wenli Li",
            "typeEntity": "Person"
        }
    ],
    "description": "> LOW CONFIDENCE! | > COMMON LINK WITH (PUB. & NAME DIFFERENT) bio.tools/ncbi_resources (NLM.NIH.GOV), bio.tools/ncbi_geo (NCBI.NLM.NIH.GOV/geo ; NLM.NIH.GOV/geo), bio.tools/genbank (NLM.NIH.GOV) | Screening and Bioinformatics Analysis of IgA Nephropathy Gene Based on GEO Databases | Discovery of core genes in colorectal cancer by weighted gene co-expression network analysis | Identifying miltefosine-resistant key genes in protein-protein interactions network and experimental verification in Iranian Leishmania major | Screening of potential biomarkers in hepatitis C virus-induced hepatocellular carcinoma using bioinformatic analysis | Identification of Key Biomarkers and Potential Molecular Mechanisms in Oral Squamous Cell Carcinoma by Bioinformatics Analysis | Gene Expression Omnibus (GEO) is a database repository of high throughput gene expression data and hybridization arrays, chips, microarrays",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                },
                {
                    "term": "Weighted correlation network analysis",
                    "uri": "http://edamontology.org/operation_3766"
                }
            ]
        }
    ],
    "homepage": "http://www.ncbi.nlm.nih.gov/geo/",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-11-14T18:40:13Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://www.ncbi.nlm.nih.gov/geo/geo2r"
        }
    ],
    "name": "GEO2R",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1155/2019/8794013",
            "pmcid": "PMC6662497",
            "pmid": "31392215"
        },
        {
            "doi": "10.3892/OL.2019.10605",
            "pmcid": "PMC6676736",
            "pmid": "31402962"
        },
        {
            "doi": "10.1007/S11033-019-04992-4",
            "metadata": {
                "abstract": "© 2019, Springer Nature B.V.Drug resistance is a complex phenomenon during leishmaniasis chemotherapy. In this study, the genes and pathways involved in miltefosine (MIL)-resistant Leishmania were identified using microarray data and in silico approaches. GSE30685 and GSE45496 were obtained from GEO database and analyzed with GEO2R tool to identify genes involved in MIL-resistant Leishmania. 177 differentially expressed genes (DEGs) were selected from these GSEs, which about half of them were uncharacterized/hypothetical proteins. The interactions between DEGs were investigated using STRING database and protein–protein interaction (PPI) networks. Five hub nodes were found in the PPI network. The gene ontology (GO) analysis of the resulting network revealed that DNA replication (GO:0006260) and ATP hydrolysis coupled proton transport (GO:0015991) were the most enriched GO term. Iranian MIL-resistant Leishmania major (L. major) parasites were generated by exposure of wild-type isolates to the increasing concentrations of MIL over a period of 5 months. Proof of mRNA expression levels of the obtained hub genes was assessed in Iranian wild-type and acquired resistant L. major parasites by real-time PCR. A significant higher expression level of LDBPK_150170 (encoding protein phosphatase 2C, PP2C), was only observed in Iranian L. major parasites resistance to MIL. Moreover, the RT-PCR results showed that the expression of metacyclic marker (small hydrophilic endoplasmic reticulum-associated protein, SHERP) and MIL-resistant marker (Leishmania MIL-transporter, LMT) was significantly increased and decreased, respectively, in Iranian MIL-resistant L. major parasites. Taken together, these data suggested that PP2C as well as SHERP and LMT genes may be prospective targets for the treatment of MIL-resistant Leishmania.",
                "authors": [
                    {
                        "name": "Lari N."
                    },
                    {
                        "name": "Jalal R."
                    },
                    {
                        "name": "Minuchehr Z."
                    },
                    {
                        "name": "Rajabian Noghondar M."
                    }
                ],
                "date": "2019-10-01T00:00:00Z",
                "journal": "Molecular Biology Reports",
                "title": "Identifying miltefosine-resistant key genes in protein–protein interactions network and experimental verification in Iranian Leishmania major"
            },
            "pmid": "31385238"
        },
        {
            "doi": "10.3892/OL.2019.10578",
            "pmcid": "PMC6676667",
            "pmid": "31452738"
        },
        {
            "doi": "10.1089/CMB.2019.0211",
            "pmid": "31424263"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ]
}