{
    "additionDate": "2021-10-04T12:10:24.644169Z",
    "biotoolsCURIE": "biotools:litsuggest",
    "biotoolsID": "litsuggest",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhiyong.lu@nih.gov",
            "name": "Zhiyong Lu",
            "orcidid": "https://orcid.org/0000-0001-9998-916X",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "LitSuggest is a web-based system for biomedical literature recommendation and curation.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Backbone modelling",
                    "uri": "http://edamontology.org/operation_0479"
                },
                {
                    "term": "Literature search",
                    "uri": "http://edamontology.org/operation_0305"
                },
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/research/litsuggest",
    "lastUpdate": "2021-10-04T12:10:24.646695Z",
    "name": "LitSuggest",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAB326",
            "metadata": {
                "abstract": "© 2021 Published by Oxford University Press on behalf of Nucleic Acids Research 2021.Searching and reading relevant literature is a routine practice in biomedical research. However, it is challenging for a user to design optimal search queries using all the keywords related to a given topic. As such, existing search systems such as PubMed often return suboptimal results. Several computational methods have been proposed as an effective alternative to keyword-based query methods for literature recommendation. However, those methods require specialized knowledge in machine learning and natural language processing, which can make them difficult for biologists to utilize. In this paper, we propose LitSuggest, a web server that provides an all-in-one literature recommendation and curation service to help biomedical researchers stay up to date with scientific literature. LitSuggest combines advanced machine learning techniques for suggesting relevant PubMed articles with high accuracy. In addition to innovative text-processing methods, LitSuggest offers multiple advantages over existing tools. First, LitSuggest allows users to curate, organize, and download classification results in a single interface. Second, users can easily fine-tune LitSuggest results by updating the training corpus. Third, results can be readily shared, enabling collaborative analysis and curation of scientific literature. Finally, LitSuggest provides an automated personalized weekly digest of newly published articles for each user's project. LitSuggest is publicly available at https://www.ncbi.nlm.nih.gov/research/litsuggest.",
                "authors": [
                    {
                        "name": "Allot A."
                    },
                    {
                        "name": "Chen Q."
                    },
                    {
                        "name": "Lee K."
                    },
                    {
                        "name": "Lu Z."
                    },
                    {
                        "name": "Luo L."
                    }
                ],
                "date": "2021-07-02T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "LitSuggest: A web-based system for literature recommendation and curation using machine learning"
            },
            "pmid": "33950204",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        }
    ]
}
