{
    "additionDate": "2021-01-18T09:55:14Z",
    "biotoolsCURIE": "biotools:mhcattnnet",
    "biotoolsID": "mhcattnnet",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Gopalakrishnan.V@iiitb.org",
            "name": "Gopalakrishnan Venkatesh",
            "typeEntity": "Person"
        },
        {
            "email": "Aayush.Grover@iiitb.org",
            "name": "Aayush Grover",
            "typeEntity": "Person"
        }
    ],
    "description": "Predicting MHC-peptide bindings for MHC alleles classes I and II using an attention-based deep neural model.\n\nMHCAttnNet uses a Bi-directional Long Short Term Memory (Bi-LSTM) styled encoder to deal with variable-length peptide sequences. This permits the model to handle a large variety of peptides, and hence makes it more general.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peptide immunogenicity prediction",
                    "uri": "http://edamontology.org/operation_0252"
                },
                {
                    "term": "Epitope mapping",
                    "uri": "http://edamontology.org/operation_0416"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "https://github.com/gopuvenkat/MHCAttnNet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-22T08:45:29Z",
    "name": "MHCAttnNet",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA479",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of the London Court of International Arbitration.Hybrid institutional arbitration clauses are situations in which parties choose one arbitral institution to administer a case but under the rules of another arbitral institution. This forces institutions to adapt their organs to the chosen set of rules, making procedures more cumbersome and increasing litigiousness. As a consequence, hybrid arbitration clauses are a prime example of something parties may choose to do under the principle of party autonomy, yet shouldn't do in the interest of safeguarding the principle of efficiency of arbitral procedure. This article analyses existing cases on the matter in order to extract conclusions as to how the interplay between party autonomy and efficiency operates in each case and at a broader level. While all decisions have upheld the validity of hybrid clauses, the analysed cases open up a whole set of additional questions, on which a consensus may not be reached: Does upholding the validity of hybrid arbitration really further party autonomy if institutions are heavily construing arbitration agreements? Should the choice of an administering institution or the choice of rules prevail? What weight should be attached to an institution's willingness to administer a case? These questions underscore the key tension between party autonomy and procedural efficiency.",
                "authors": [
                    {
                        "name": "Esteban C.M."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Hybrid (institutional) arbitration clauses: Party autonomy gone wild"
            },
            "pmcid": "PMC7355292",
            "pmid": "32657386"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ]
}