{
    "additionDate": "2021-01-18T09:55:14Z",
    "biotoolsCURIE": "biotools:mhcattnnet",
    "biotoolsID": "mhcattnnet",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Aayush.Grover@iiitb.org",
            "name": "Aayush Grover",
            "typeEntity": "Person"
        },
        {
            "email": "Gopalakrishnan.V@iiitb.org",
            "name": "Gopalakrishnan Venkatesh",
            "typeEntity": "Person"
        }
    ],
    "description": "Predicting MHC-peptide bindings for MHC alleles classes I and II using an attention-based deep neural model.\n\nMHCAttnNet uses a Bi-directional Long Short Term Memory (Bi-LSTM) styled encoder to deal with variable-length peptide sequences. This permits the model to handle a large variety of peptides, and hence makes it more general.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Epitope mapping",
                    "uri": "http://edamontology.org/operation_0416"
                },
                {
                    "term": "Peptide immunogenicity prediction",
                    "uri": "http://edamontology.org/operation_0252"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "https://github.com/gopuvenkat/MHCAttnNet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-22T08:45:29Z",
    "name": "MHCAttnNet",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA479",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press.MOTIVATION: Accurate prediction of binding between a major histocompatibility complex (MHC) allele and a peptide plays a major role in the synthesis of personalized cancer vaccines. The immune system struggles to distinguish between a cancerous and a healthy cell. In a patient suffering from cancer who has a particular MHC allele, only those peptides that bind with the MHC allele with high affinity, help the immune system recognize the cancerous cells. RESULTS: MHCAttnNet is a deep neural model that uses an attention mechanism to capture the relevant subsequences of the amino acid sequences of peptides and MHC alleles. It then uses this to accurately predict the MHC-peptide binding. MHCAttnNet achieves an AUC-PRC score of 94.18% with 161 class I MHC alleles, which outperforms the state-of-the-art models for this task. MHCAttnNet also achieves a better F1-score in comparison to the state-of-the-art models while covering a larger number of class II MHC alleles. The attention mechanism used by MHCAttnNet provides a heatmap over the amino acids thus indicating the important subsequences present in the amino acid sequence. This approach also allows us to focus on a much smaller number of relevant trigrams corresponding to the amino acid sequence of an MHC allele, from 9251 possible trigrams to about 258. This significantly reduces the number of amino acid subsequences that need to be clinically tested. AVAILABILITY AND IMPLEMENTATION: The data and source code are available at https://github.com/gopuvenkat/MHCAttnNet.",
                "authors": [
                    {
                        "name": "Grover A."
                    },
                    {
                        "name": "Rao S."
                    },
                    {
                        "name": "Srinivasaraghavan G."
                    },
                    {
                        "name": "Venkatesh G."
                    }
                ],
                "citationCount": 2,
                "date": "2020-07-01T00:00:00Z",
                "journal": "Bioinformatics (Oxford, England)",
                "title": "MHCAttnNet: predicting MHC-peptide bindings for MHC alleles classes I and II using an attention-based deep neural model"
            },
            "pmcid": "PMC7355292",
            "pmid": "32657386"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
