
{
    "credit": [
        {
            "email": "kaimueller@uni-muenster.de",
            "name": "Kai Müller",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://bioinfweb.info/People/Mueller"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://bioinfweb.info/Software/GRate"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid sequence analysis",
                    "uri": "http://edamontology.org/operation_2478"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Evolutionary biology",
                "uri": "http://edamontology.org/topic_3299"
            },
            {
                "term": "Taxonomy",
                "uri": "http://edamontology.org/topic_0637"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/grate-1-0-relative-rate-test-groups-taxa-general-dna-substitution-models-paup.html"
        }
    ],
    "publication": [
        {
            "abstract": "As a basis for analysing the evolution of the carnivorous syndrome in Lentibulariaceae (Lamiales), phylogenetic reconstructions were conducted based on coding and non-coding chloroplast DNA (matK gene and flanking trnK intron sequences, totalling about 2.4 kb). A dense taxon sampling including all other major lineages of Lamiales was needed since the closest relatives of Lentibulariaceae and the position of \"proto-carnivores\" were unknown. Tree inference using maximum parsimony, maximum likelihood, and Bayesian approaches resulted in fully congruent topologies within Lentibulariaceae, whereas relationships among the different lineages of Lamiales were only congruent between likelihood and Bayesian optimizations. Lentibulariaceae and their three genera (Pinguicula, Genlisea, and Utricularia) are monophyletic, with Pinguicula being sister to a Genlisea-Utricularia clade. Likelihood and Bayesian trees converge on Bignoniaceae as sister to Lentibulariaceae, albeit lacking good support. The \"proto-carnivores\" (Byblidaceae, Martyniaceae) are found in different positions among other Lamiales but not as sister to the carnivorous Lentibulariaceae, which is also supported by Khishino-Hasegawa tests. This implies that carnivory and its preliminary stages (\"proto-carnivores\") independently evolved more than once among Lamiales. Ancestral states of structural characters connected to the carnivorous syndrome are reconstructed using the molecular tree, and a hypothesis on the evolutionary pathway of the carnivorous syndrome in Lentibulariaceae is presented. Extreme DNA mutational rates found in Utricularia and Cenlisea are shown to correspond to their unusual nutritional specialization, thereby hinting at a marked degree of carnivory in these two genera.",
            "authors": [
                "Muller K.",
                "Borsch T.",
                "Legendre L.",
                "Porembski S.",
                "Theisen I.",
                "Barthlott W."
            ],
            "cit_count": 93,
            "journal": "Plant Biology",
            "pmid": "15248131",
            "title": "Evolution of carnivory in lentibulariaceae and the lamiales",
            "year": "2004-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:grate",
        "biotoolsID": "grate",
        "description": "Software for relative rate tests with groups supporting all models of nucleotide substitution known by PAUP*.",
        "homepage": "http://bioinfweb.info/Software/GRate",
        "name": "GRate"
    }
}