{
    "name": "COUGER", 
    "description": "Framework for identifying co-factors associated with uniquely-bound genomic regions.", 
    "homepage": "http://couger.oit.duke.edu", 
    "biotoolsID": "couger", 
    "biotoolsCURIE": "biotools:couger", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2403", 
                    "term": "Sequence analysis"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool", 
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0654", 
            "term": "DNA"
        }, 
        {
            "uri": "http://edamontology.org/topic_0749", 
            "term": "Transcription factors and regulatory sites"
        }, 
        {
            "uri": "http://edamontology.org/topic_3307", 
            "term": "Computational biology"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/couger-1-2-0-identifying-co-factors-uniquely-bound-genomic-regions.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://couger.oit.duke.edu/documentation/", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": null, 
            "pmcid": "PMC4086139", 
            "type": null, 
            "version": null, 
            "metadata": null
        }, 
        {
            "doi": "10.1007/978-3-642-37195-0_12", 
            "pmid": null, 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Distinguishing between genomic regions bound by paralogous transcription factors", 
                "abstract": "Transcription factors (TFs) regulate gene expression by binding to specific DNA sites in cis regulatory regions of genes. Most eukaryotic TFs are members of protein families that share a common DNA binding domain and often recognize highly similar DNA sequences. Currently, it is not well understood why closely related TFs are able to bind different genomic regions in vivo, despite having the potential to interact with the same DNA sites. Here, we use the Myc/Max/Mad family as a model system to investigate whether interactions with additional proteins (co-factors) can explain why paralogous TFs with highly similar DNA binding preferences interact with different genomic sites in vivo. We use a classification approach to distinguish between targets of c-Myc versus Mad2, using features that reflect the DNA binding specificities of putative co-factors. When applied to c-Myc/Mad2 DNA binding data, our algorithm can distinguish between genomic regions bound uniquely by c-Myc versus Mad2 with 87% accuracy. © 2013 Springer-Verlag.", 
                "date": "2013-04-03T00:00:00Z", 
                "citationCount": 3, 
                "authors": [
                    {
                        "name": "Munteanu A."
                    }, 
                    {
                        "name": "Gordan R."
                    }
                ], 
                "journal": "Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics)"
            }
        }, 
        {
            "doi": null, 
            "pmid": "24861628", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "COUGER - Co-factors associated with uniquely-bound genomic regions", 
                "abstract": "Most transcription factors (TFs) belong to protein families that share a common DNA binding domain and have very similar DNA binding preferences. However, many paralogous TFs (i.e. members of the same TF family) perform different regulatory functions and interact with different genomic regions in the cell. A potential mechanism for achieving this differential in vivo specificity is through interactions with protein co-factors. Computational tools for studying the genomic binding profiles of paralogous TFs and identifying their putative co-factors are currently lacking. Here, we present an interactive web implementation of COUGER, a classification-based framework for identifying protein co-factors that might provide specificity to paralogous TFs. COUGER takes as input two sets of genomic regions bound by paralogous TFs, and it identifies a small set of putative co-factors that best distinguish the two sets of sequences. To achieve this task, COUGER uses a classification approach, with features that reflect the DNA-binding specificities of the putative co-factors. The identified co-factors are presented in a user-friendly output page, together with information that allows the user to understand and to explore the contributions of individual co-factor features. COUGER can be run as a stand-alone tool or through a web interface: http://couger.oit.duke.edu. © 2014 The Author(s).", 
                "date": "2014-07-01T00:00:00Z", 
                "citationCount": 0, 
                "authors": [
                    {
                        "name": "Munteanu A."
                    }, 
                    {
                        "name": "Ohler U."
                    }, 
                    {
                        "name": "Gordan R."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }
    ], 
    "credit": [
        {
            "name": "Couger Support", 
            "email": "couger@info.uaic.ro", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }, 
        {
            "name": "RALUCA GORDÂN", 
            "email": "raluca.gordan@duke.edu", 
            "url": "http://www.genome.duke.edu/labs/gordan/index.php", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "ELIXIR-EE", 
    "additionDate": "2017-05-16T12:27:58Z", 
    "lastUpdate": "2018-12-10T12:58:44Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}