{
    "additionDate": "2018-05-23T15:00:33Z",
    "biotoolsCURIE": "biotools:comet_visualisation",
    "biotoolsID": "comet_visualisation",
    "credit": [
        {
            "email": "tiphaine.martin@kcl.ac.uk",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "jordana.bell@kcl.ac.uk",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Visualisation of regional epigenome-wide association scan results and DNA co-methylation patterns.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://epigen.kcl.ac.uk/comet/download.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome visualisation",
                    "uri": "http://edamontology.org/operation_3208"
                }
            ]
        }
    ],
    "homepage": "http://epigen.kcl.ac.uk/comet/",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "coMET",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/S12859-015-0568-2",
            "metadata": {
                "abstract": "© 2015 Martin et al.; licensee BioMed Central.Background: Epigenome-wide association scans (EWAS) are an increasingly powerful and widely-used approach to assess the role of epigenetic variation in human complex traits. However, this rapidly emerging field lacks dedicated visualisation tools that can display features specific to epigenetic datasets. Result: We developed coMET, an R package and online tool for visualisation of EWAS results in a genomic region of interest. coMET generates a regional plot of epigenetic-phenotype association results and the estimated DNA methylation correlation between CpG sites (co-methylation), with further options to visualise genomic annotations based on ENCODE data, gene tracks, reference CpG-sites, and user-defined features. The tool can be used to display phenotype association signals and correlation patterns of microarray or sequencing-based DNA methylation data, such as Illumina Infinium 450k, WGBS, or MeDIP-seq, as well as other types of genomic data, such as gene expression profiles. The software is available as a user-friendly online tool from http://epigen.kcl.ac.uk/comet and as an R Bioconductor package. Source code, examples, and full documentation are also available from GitHub. Conclusion: Our new software allows visualisation of EWAS results with functional genomic annotations and with estimation of co-methylation patterns. coMET is available to a wide audience as an online tool and R package, and can be a valuable resource to interpret results in the fast growing field of epigenetics. The software is designed for epigenetic data, but can also be applied to genomic and functional genomic datasets in any species.",
                "authors": [
                    {
                        "name": "Martin T.C."
                    },
                    {
                        "name": "Yet I."
                    },
                    {
                        "name": "Tsai P.-C."
                    },
                    {
                        "name": "Bell J.T."
                    }
                ],
                "citationCount": 53,
                "date": "2015-12-12T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "coMET: Visualisation of regional epigenome-wide association scan results and DNA co-methylation patterns"
            },
            "pmcid": "PMC4422463",
            "pmid": "25928765"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "Methylated DNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3674"
        },
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        }
    ],
    "validated": 1
}