{"credit":[{"email":"phuongtm@ptit.edu.vn","typeEntity":"Person","typeRoles":["Primary contact"]},{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://ai.stanford.edu/~chuongdo"},{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://ai.stanford.edu/~serafim"}],"documentation":[{"type":"GENERAL","url":"http://proda.stanford.edu/manual.pdf"}],"function":[{"operation":[{"term":"Protein sequence analysis","uri":"http://edamontology.org/operation_2479"}]}],"labels":{"operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"},{"term":"Protein structure analysis","uri":"http://edamontology.org/topic_2814"},{"term":"Protein folds and structural domains","uri":"http://edamontology.org/topic_0736"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/proda-1-0-protein-multiple-aligner.html"}],"publication":[{"abstract":"Multiple sequence alignments are the usual starting point for analyses of protein structure and evolution. For proteins with repeated, shuffled and missing domains, however, traditional multiple sequence alignment algorithms fail to provide an accurate view of homology between related proteins, because they either assume that the input sequences are globally alignable or require locally alignable regions to appear in the same order in all sequences. In this paper, we present ProDA, a novel system for automated detection and alignment of homologous regions in collections of proteins with arbitrary domain architectures. Given an input set of unaligned sequences, ProDA identifies all homologous regions appearing in one or more sequences, and returns a collection of local multiple alignments for these regions. On a subset of the BAliBASE benchmarking suite containing curated alignments of proteins with complicated domain architectures, ProDA performs well in detecting conserved domain boundaries and clustering domain segments, achieving the highest accuracy to date for this task. We conclude that ProDA is a practical tool for automated alignment of protein sequences with repeats and rearrangements in their domain architecture. © 2006 Oxford University Press.","authors":["Phuong T.M.","Do C.B.","Edgar R.C.","Batzoglou S."],"cit_count":33,"journal":"Nucleic Acids Research","pmid":"17068081","title":"Multiple alignment of protein sequences with repeats and rearrangements","year":"2006-11-01"}],"summary":{"biotoolsCURIE":"biotools:proda","biotoolsID":"proda","description":"Protein multiple aligner that automatically finds domain structures of sequences with shuffled and repeated domain architectures.","homepage":"http://proda.stanford.edu/","name":"ProDA"}}