
{
    "credit": [
        {
            "email": "adam.gudys@polsl.pl",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://sun.aei.polsl.pl/REFRESH/index.php?page=projects&project=quickprobs&subpage=about"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++",
            "Perl",
            "C"
        ],
        "operatingSystem": [
            "Linux",
            "Windows"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Gene and protein families",
                "uri": "http://edamontology.org/topic_0623"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/quickprobs-multiple-sequence-alignment-designed-especially-for-gpu.html"
        }
    ],
    "publication": [
        {
            "abstract": "Multiple sequence alignment is a crucial task in a number of biological analyses like secondary structure prediction, domain searching, phylogeny, etc. MSAProbs is currently the most accurate alignment algorithm, but its effectiveness is obtained at the expense of computational time. In the paper we present QuickProbs, the variant of MSAProbs customised for graphics processors. We selected the two most time consuming stages of MSAProbs to be redesigned for GPU execution: the posterior matrices calculation and the consistency transformation. Experiments on three popular benchmarks (BAliBASE, PREFAB, OXBench-X) on quad-core PC equipped with high-end graphics card show QuickProbs to be 5.7 to 9.7 times faster than original CPU-parallel MSAProbs. Additional tests performed on several protein families from Pfam database give overall speed-up of 6.7. Compared to other algorithms like MAFFT, MUSCLE, or ClustalW, QuickProbs proved to be much more accurate at similar speed. Additionally we introduce a tuned variant of QuickProbs which is significantly more accurate on sets of distantly related sequences than MSAProbs without exceeding its computation time. The GPU part of QuickProbs was implemented in OpenCL, thus the package is suitable for graphics processors produced by all major vendors. © 2014 Gudyś, Deorowicz.",
            "authors": [
                "Gudys A.",
                "Deorowicz S."
            ],
            "cit_count": 7,
            "journal": "PLoS ONE",
            "pmid": "24586435",
            "title": "QuickProbs - A fast multiple sequence alignment algorithm designed for graphics processors",
            "year": "2014-02-25"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:quickprobs",
        "biotoolsID": "quickprobs",
        "description": "Fast multiple sequence alignment algorithm designed for graphics processors.",
        "homepage": "http://sun.aei.polsl.pl/REFRESH/index.php?page=projects&project=quickprobs&subpage=about",
        "name": "QuickProbs"
    }
}