{
    "additionDate": "2021-01-18T10:02:57Z",
    "biotoolsCURIE": "biotools:gc-sms",
    "biotoolsID": "gc-sms",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "drzdzhang@njmu.edu.cn",
            "name": "Zhengdong Zhang",
            "orcidid": "https://orcid.org/0000-0002-6730-9251",
            "typeEntity": "Person"
        },
        {
            "email": "drdumulong@njmu.edu.cn",
            "name": "Mulong Du",
            "typeEntity": "Person"
        }
    ],
    "description": "A transcriptomic study for identifying cardia- and non-cardia-specific gastric cancer prognostic factors using genetic algorithm-based methods.\n\nGastric cancer (GC) is a heterogeneous tumour with numerous differences of epidemiologic and clinicopathologic features between cardia cancer and non-cardia cancer.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Incident curve plotting",
                    "uri": "http://edamontology.org/operation_3503"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://njmu-zhanglab.shinyapps.io/gc_sms/",
    "lastUpdate": "2021-01-22T17:51:30Z",
    "name": "GC-SMS",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1111/JCMM.15618",
            "metadata": {
                "abstract": "© 2020 The Authors. Journal of Cellular and Molecular Medicine published by Foundation for Cellular and Molecular Medicine and John Wiley & Sons LtdGastric cancer (GC) is a heterogeneous tumour with numerous differences of epidemiologic and clinicopathologic features between cardia cancer and non-cardia cancer. However, few studies were performed to construct site-specific GC prognostic models. In this study, we identified site-specific GC transcriptomic prognostic biomarkers using genetic algorithm (GA)-based support vector machine (GA-SVM) and GA-based Cox regression method (GA-Cox) in the Cancer Genome Atlas (TCGA) database. The area under time-dependent receive operating characteristic (ROC) curve (AUC) regarding 5-year survival and concordance index (C-index) was used to evaluate the predictive ability of Cox regression models. Finally, we identified 10 and 13 prognostic biomarkers for cardia cancer and non-cardia cancer, respectively. Compared to traditional models, the addition of these site-specific biomarkers could notably improve the model preference (cardia: AUCtraditional vs AUCcombined = 0.720 vs 0.899, P = 8.75E-08; non-cardia: AUCtraditional vs AUCcombined = 0.798 vs 0.994, P = 7.11E-16). The combined nomograms exhibited superior performance in cardia and non-cardia GC survival prediction (C-indexcardia = 0.816; C-indexnoncardia = 0.812). We also constructed a user-friendly GC site-specific molecular system (GC-SMS, https://njmu-zhanglab.shinyapps.io/gc_sms/), which is freely available for users. In conclusion, we developed site-specific GC prognostic models for predicting cardia cancer and non-cardia cancer survival, providing more support for the individualized therapy of GC patients.",
                "authors": [
                    {
                        "name": "Chu H."
                    },
                    {
                        "name": "Du M."
                    },
                    {
                        "name": "Li S."
                    },
                    {
                        "name": "Wang M."
                    },
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Wu Y."
                    },
                    {
                        "name": "Xin J."
                    },
                    {
                        "name": "Zhang Z."
                    }
                ],
                "citationCount": 1,
                "date": "2020-08-01T00:00:00Z",
                "journal": "Journal of Cellular and Molecular Medicine",
                "title": "A transcriptomic study for identifying cardia- and non–cardia-specific gastric cancer prognostic factors using genetic algorithm-based methods"
            },
            "pmcid": "PMC7417703",
            "pmid": "32649057"
        }
    ],
    "toolType": [
        "Library",
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
