{
    "accessibility": "Open access",
    "additionDate": "2021-11-24T15:33:24.068086Z",
    "biotoolsCURIE": "biotools:deepfilter",
    "biotoolsID": "deepfilter",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "xuan.guo@unt.edu",
            "name": "Xuan Guo",
            "typeEntity": "Person"
        }
    ],
    "description": "Deep learning for peptide identification from metaproteomics datasets.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Chromatographic alignment",
                    "uri": "http://edamontology.org/operation_3628"
                },
                {
                    "term": "Peptide identification",
                    "uri": "http://edamontology.org/operation_3631"
                },
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Biocomputing-Research-Group/DeepFilter",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-11-24T15:33:24.070726Z",
    "license": "GPL-3.0",
    "name": "DeepFilter",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.JPROT.2021.104316",
            "metadata": {
                "abstract": "© 2021 The AuthorsMetaproteomics is becoming widely used in microbiome research for gaining insights into the functional state of the microbial community. Current metaproteomics studies are generally based on high-throughput tandem mass spectrometry (MS/MS) coupled with liquid chromatography. In this paper, we proposed a deep-learning-based algorithm, named DeepFilter, for improving peptide identifications from a collection of tandem mass spectra. The key advantage of the DeepFilter is that it does not need ad hoc training or fine-tuning as in existing filtering tools. DeepFilter is freely available under the GNU GPL license at https://github.com/Biocomputing-Research-Group/DeepFilter. Significance: The identification of peptides and proteins from MS data involves the computational procedure of searching MS/MS spectra against a predefined protein sequence database and assigning top-scored peptides to spectra. Existing computational tools are still far from being able to extract all the information out of MS/MS data sets acquired from metaproteome samples. Systematical experiment results demonstrate that the DeepFilter identified up to 12% and 9% more peptide-spectrum-matches and proteins, respectively, compared with existing filtering algorithms, including Percolator, Q-ranker, PeptideProphet, and iProphet, on marine and soil microbial metaproteome samples with false discovery rate at 1%. The taxonomic analysis shows that DeepFilter found up to 7%, 10%, and 14% more species from marine, soil, and human gut samples compared with existing filtering algorithms. Therefore, DeepFilter was believed to generalize properly to new, previously unseen peptide-spectrum-matches and can be readily applied in peptide identification from metaproteomics data.",
                "authors": [
                    {
                        "name": "Feng S."
                    },
                    {
                        "name": "Guo X."
                    },
                    {
                        "name": "Sterzenbach R."
                    }
                ],
                "date": "2021-09-15T00:00:00Z",
                "journal": "Journal of Proteomics",
                "title": "Deep learning for peptide identification from metaproteomics datasets"
            },
            "pmcid": "PMC8435027",
            "pmid": "34246788"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
