{
    "additionDate": "2021-01-18T09:08:04Z",
    "biotoolsCURIE": "biotools:p-finder",
    "biotoolsID": "p-finder",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ellisjc@ornl.gov",
            "name": "J. Christopher Ellis",
            "orcidid": "https://orcid.org/0000-0002-2510-977X",
            "typeEntity": "Person"
        }
    ],
    "description": "Genomic and metagenomic annotation of RNase P RNA gene (rnpB).\n\nP Finder is a GUI software application for the fast identification of RNase P RNA in prokaryotes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                },
                {
                    "term": "RNA secondary structure alignment",
                    "uri": "http://edamontology.org/operation_0502"
                },
                {
                    "term": "RNA structure covariance model generation",
                    "uri": "http://edamontology.org/operation_3469"
                }
            ]
        }
    ],
    "homepage": "https://github.com/JChristopherEllis/P-Finder",
    "language": [
        "C#"
    ],
    "lastUpdate": "2021-03-15T14:26:55Z",
    "name": "P-Finder",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12864-020-6615-Z",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: The rnpB gene encodes for an essential catalytic RNA (RNase P). Like other essential RNAs, RNase P's sequence is highly variable. However, unlike other essential RNAs (i.e. tRNA, 16 S, 6 S,.) its structure is also variable with at least 5 distinct structure types observed in prokaryotes. This structural variability makes it labor intensive and challenging to create and maintain covariance models for the detection of RNase P RNA in genomic and metagenomic sequences. The lack of a facile and rapid annotation algorithm has led to the rnpB gene being the most grossly under annotated essential gene in completed prokaryotic genomes with only a 24% annotation rate. Here we describe the coupling of the largest RNase P RNA database with the local alignment scoring algorithm to create the most sensitive and rapid prokaryote rnpB gene identification and annotation algorithm to date. Results: Of the 2772 completed microbial genomes downloaded from GenBank only 665 genomes had an annotated rnpB gene. We applied P Finder to these genomes and were able to identify 2733 or nearly 99% of the 2772 microbial genomes examined. From these results four new rnpB genes that encode the minimal T-type P RNase P RNAs were identified computationally for the first time. In addition, only the second C-type RNase P RNA was identified in Sphaerobacter thermophilus. Of special note, no RNase P RNAs were detected in several obligate endosymbionts of sap sucking insects suggesting a novel evolutionary adaptation. Conclusions: The coupling of the largest RNase P RNA database and associated structure class identification with the P Finder algorithm is both sensitive and rapid, yielding high quality results to aid researchers annotating either genomic or metagenomic data. It is the only algorithm to date that can identify challenging RNAse P classes such as C-type and the minimal T-type RNase P RNAs. P Finder is written in C# and has a user-friendly GUI that can run on multiple 64-bit windows platforms (Windows Vista/7/8/10). P Finder is free available for download at https://github.com/JChristopherEllis/P-Finder as well as a small sample RNase P RNA file for testing.",
                "authors": [
                    {
                        "name": "Ellis J.C."
                    }
                ],
                "date": "2020-04-29T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "P finder: Genomic and metagenomic annotation of RNase P RNA gene (rnpB)"
            },
            "pmcid": "PMC7191817",
            "pmid": "32349659"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ]
}