{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:15:19Z",
    "biotoolsCURIE": "biotools:BacTag",
    "biotoolsID": "BacTag",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "l.khachatryan@lumc.nl",
            "name": "Lusine Khachatryan",
            "orcidid": "https://orcid.org/0000-0002-0218-9092",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Pipeline for fast and accurate gene and allele typing in bacterial sequencing data based on database preprocessing.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://git.lumc.nl/l.khachatryan/BacTag/wikis/home"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Multilocus sequence typing",
                    "uri": "http://edamontology.org/operation_3840"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://git.lumc.nl/l.khachatryan/BacTag",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:25Z",
    "license": "Unlicense",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://git.lumc.nl/l.khachatryan/BacTag/issues"
        }
    ],
    "maturity": "Mature",
    "name": "BacTag",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1186/S12864-019-5723-0",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Bacteria carry a wide array of genes, some of which have multiple alleles. These different alleles are often responsible for distinct types of virulence and can determine the classification at the subspecies levels (e.g., housekeeping genes for Multi Locus Sequence Typing, MLST). Therefore, it is important to rapidly detect not only the gene of interest, but also the relevant allele. Current sequencing-based methods are limited to mapping reads to each of the known allele reference, which is a time-consuming procedure. Results: To address this limitation, we developed BacTag - a pipeline that rapidly and accurately detects which genes are present in a sequencing dataset and reports the allele of each of the identified genes. We exploit the fact that different alleles of the same gene have a high similarity. Instead of mapping the reads to each of the allele reference sequences, we preprocess the database prior to the analysis, which makes the subsequent gene and allele identification efficient. During the preprocessing, we determine a representative reference sequence for each gene and store the differences between all alleles and this chosen reference. Throughout the analysis we estimate whether the gene is present in the sequencing data by mapping the reads to this reference sequence; if the gene is found, we compare the variants to those in the preprocessed database. This allows to detect which specific allele is present in the sequencing data. Our pipeline was successfully tested on artificial WGS E. coli, S. pseudintermedius, P. gingivalis, M. bovis, Borrelia spp. and Streptomyces spp. data and real WGS E. coli and K. pneumoniae data in order to report alleles of MLST house-keeping genes. Conclusions: We developed a new pipeline for fast and accurate gene and allele recognition based on database preprocessing and parallel computing and performed better or comparable to the current popular tools. We believe that our approach can be useful for a wide range of projects, including bacterial subspecies classification, clinical diagnostics of bacterial infections, and epidemiological studies.",
                "authors": [
                    {
                        "name": "Bernards A.T."
                    },
                    {
                        "name": "Khachatryan L."
                    },
                    {
                        "name": "Kraakman M.E.M."
                    },
                    {
                        "name": "Laros J.F.J."
                    }
                ],
                "citationCount": 1,
                "date": "2019-05-06T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "BacTag - A pipeline for fast and accurate gene and allele typing in bacterial sequencing data based on database preprocessing"
            },
            "pmcid": "PMC6501397",
            "pmid": "31060512",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ],
    "validated": 1
}
