{
    "accessibility": "Open access",
    "additionDate": "2022-07-04T09:23:14.888833Z",
    "biotoolsCURIE": "biotools:rwd-cockpit",
    "biotoolsID": "rwd-cockpit",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Enkelejda Miho"
        },
        {
            "name": "Eriberto Natali"
        },
        {
            "name": "Erik Schkommodau"
        }
    ],
    "description": "The RWD app provides a platform to view and search for quality-scored real-world datasets.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Keyword",
                        "uri": "http://edamontology.org/data_0968"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "http://rwd.aihealth.ch/",
    "lastUpdate": "2024-11-24T15:57:54.103056Z",
    "name": "RWD-Cockpit",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.2196/29920",
            "metadata": {
                "abstract": "Background: Digital technologies are transforming the health care system. A large part of information is generated as real-world data (RWD). Data from electronic health records and digital biomarkers have the potential to reveal associations between the benefits and adverse events of medicines, establish new patient-stratification principles, expose unknown disease correlations, and inform on preventive measures. The impact for health care payers and providers, the biopharmaceutical industry, and governments is massive in terms of health outcomes, quality of care, and cost. However, a framework to assess the preliminary quality of RWD is missing, thus hindering the conduct of population-based observational studies to support regulatory decision-making and real-world evidence. Objective: To address the need to qualify RWD, we aimed to build a web application as a tool to translate characterization of some quality parameters of RWD into a metric and propose a standard framework for evaluating the quality of the RWD. Methods: The RWD-Cockpit systematically scores data sets based on proposed quality metrics and customizable variables chosen by the user. Sleep RWD generated de novo and publicly available data sets were used to validate the usability and applicability of the web application. The RWD quality score is based on the evaluation of 7 variables: manageability specifies access and publication status; complexity defines univariate, multivariate, and longitudinal data; sample size indicates the size of the sample or samples; privacy and liability stipulates privacy rules; accessibility specifies how the data set can be accessed and to what granularity; periodicity specifies how often the data set is updated; and standardization specifies whether the data set adheres to any specific technical or metadata standard. These variables are associated with several descriptors that define specific characteristics of the data set. Results: To address the need to qualify RWD, we built the RWD-Cockpit web application, which proposes a framework and applies a common standard for a preliminary evaluation of RWD quality across data sets-molecular, phenotypical, and social-and proposes a standard that can be further personalized by the community retaining an internal standard. Applied to 2 different case studies-de novo-generated sleep data and publicly available data sets-the RWD-Cockpit could identify and provide researchers with variables that might increase quality. Conclusions: The results from the application of the framework of RWD metrics implemented in the RWD-Cockpit application suggests that multiple data sets can be preliminarily evaluated in terms of quality using the proposed metrics. The output scores-quality identifiers-provide a first quality assessment for the use of RWD. Although extensive challenges remain to be addressed to set RWD quality standards, our proposal can serve as an initial blueprint for community efforts in the characterization of RWD quality for regulated settings.",
                "authors": [
                    {
                        "name": "Agac T."
                    },
                    {
                        "name": "Asprion P.M."
                    },
                    {
                        "name": "Babrak L.M."
                    },
                    {
                        "name": "Brodbeck D."
                    },
                    {
                        "name": "Clay I."
                    },
                    {
                        "name": "Degen M."
                    },
                    {
                        "name": "Grimberg F."
                    },
                    {
                        "name": "Miho E."
                    },
                    {
                        "name": "Natali E.N."
                    },
                    {
                        "name": "Schkommodau E."
                    },
                    {
                        "name": "Smakaj E."
                    },
                    {
                        "name": "Tosoni D.D."
                    },
                    {
                        "name": "Van der Werf D."
                    },
                    {
                        "name": "van Ginkel E.W."
                    }
                ],
                "citationCount": 1,
                "date": "2022-10-01T00:00:00Z",
                "journal": "JMIR Formative Research",
                "title": "RWD-Cockpit: Application for Quality Assessment of Real-world Data"
            },
            "pmcid": "PMC9627468",
            "pmid": "35266872"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ],
    "validated": 1
}
