{
    "additionDate": "2021-12-06T13:03:59.350561Z",
    "biotoolsCURIE": "biotools:ssre",
    "biotoolsID": "ssre",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "limin@mail.csu.edu.cn",
            "name": "Min Li",
            "orcidid": "https://orcid.org/0000-0002-0188-1394",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "SSRE is a tool for cell type detection based on sparse subspace representation and similarity enhancement. Accurate identification of cell types from single-cell RNA sequencing (scRNA-seq) data plays a critical role in a variety of scRNA-seq analysis studies. This task corresponds to solving an unsupervised clustering problem, in which the similarity measurement between cells affects the result significantly.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                }
            ]
        }
    ],
    "homepage": "https://github.com/CSUBioGroup/SSRE",
    "language": [
        "Python",
        "MATLAB"
    ],
    "lastUpdate": "2021-12-06T13:03:59.353185Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/CSUBioGroup/SSRE/issues"
        }
    ],
    "name": "SSRE",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.GPB.2020.09.004",
            "metadata": {
                "abstract": "© 2021 Beijing Institute of GenomicsAccurate identification of cell types from single-cell RNA sequencing (scRNA-seq) data plays a critical role in a variety of scRNA-seq analysis studies. This task corresponds to solving an unsupervised clustering problem, in which the similarity measurement between cells affects the result significantly. Although many approaches for cell type identification have been proposed, the accuracy still needs to be improved. In this study, we proposed a novel single-cell clustering framework based on similarity learning, called SSRE. SSRE models the relationships between cells based on subspace assumption, and generates a sparse representation of the cell-to-cell similarity. The sparse representation retains the most similar neighbors for each cell. Besides, three classical pairwise similarities are incorporated with a gene selection and enhancement strategy to further improve the effectiveness of SSRE. Tested on ten real scRNA-seq datasets and five simulated datasets, SSRE achieved the superior performance in most cases compared to several state-of-the-art single-cell clustering methods. In addition, SSRE can be extended to visualization of scRNA-seq data and identification of differentially expressed genes. The matlab and python implementations of SSRE are available at https://github.com/CSUBioGroup/SSRE.",
                "authors": [
                    {
                        "name": "Liang Z."
                    },
                    {
                        "name": "Li M."
                    },
                    {
                        "name": "Zheng R."
                    },
                    {
                        "name": "Tian Y."
                    },
                    {
                        "name": "Yan X."
                    },
                    {
                        "name": "Chen J."
                    },
                    {
                        "name": "Wu F.-X."
                    },
                    {
                        "name": "Wang J."
                    }
                ],
                "citationCount": 1,
                "date": "2021-04-01T00:00:00Z",
                "journal": "Genomics, Proteomics and Bioinformatics",
                "title": "SSRE: Cell Type Detection Based on Sparse Subspace Representation and Similarity Enhancement"
            },
            "pmid": "33647482",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        }
    ]
}