{
    "additionDate": "2017-08-03T19:07:34Z",
    "biotoolsCURIE": "biotools:nucular",
    "biotoolsID": "nucular",
    "credit": [
        {
            "email": "mlemire@sdf.lonestar.org",
            "name": "Mathieu Lemire",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://mlemire.freeshell.org/"
        }
    ],
    "description": "Program that splits extended pedigrees into nuclear families, with the option of recoding all sibs as half-sibs with distinct mothers of fathers.",
    "documentation": [
        {
            "type": "General",
            "url": "http://mlemire.freeshell.org/nucular.README"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Linkage analysis",
                    "uri": "http://edamontology.org/operation_0283"
                }
            ]
        }
    ],
    "homepage": "http://mlemire.freeshell.org/nucular.README",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/nucular-20050222-splits-extended-pedigrees-nuclear-families.html"
        }
    ],
    "name": "nucular",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "A simple multipoint procedure to test for parent-of-origin effects in samples of affected siblings is discussed. The procedure consists of artificially changing all full sibs to half-sibs, with distinct mothers or fathers depending on the parental origin to be evaluated, then analyzing these families with commonly used statistics and software. The procedure leads to tests for linkage through mothers or fathers and also leads to a test for imprinting effects in the presence of linkage. Moreover, simulations illustrate that in regions unlinked to susceptibility genes this multipoint procedure does not have an inflated type I error if a sex-averaged genetic map is used, even when large differences exist between male-specific and female-specific maps. In regions linked with susceptibility genes, the test of imprinting is biased under the null hypothesis if differences exist between sex-specific maps, irrespective of the map used in the analysis. The procedure is applied to the Collaborative Study on the Genetics of Alcoholism dataset from the Genetic Analysis Workshop 14. Results indicate that brothers categorized as affected according to the DMS-III-R and Feighner classification show evidence of linkage through fathers to the 6q25 region (p = 0.00038) as well as modest evidence of imprinting (p = 0.018). This region harbors OPRM1, a candidate gene for substance dependence.",
                "authors": [
                    {
                        "name": "Lemire M."
                    }
                ],
                "citationCount": 3,
                "date": "2005-12-30T00:00:00Z",
                "journal": "BMC Genetics",
                "title": "A simple nonparametric multipoint procedure to test for linkage through mothers or fathers as well as imprinting effects in the presence of linkage"
            },
            "pmid": "16451620"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        }
    ],
    "validated": 1
}