{
    "additionDate": "2019-11-14T18:14:58Z",
    "biotoolsCURIE": "biotools:HD-GMCM",
    "biotoolsID": "HD-GMCM",
    "confidence_flag": "tool",
    "description": "Gaussian Mixture Copulas for High-Dimensional Clustering and Dependency-based Subtyping | MOTIVATION:The identification of sub-populations of patients with similar characteristics, called patient subtyping, is important for realizing the goals of Precision Medicine. Accurate subtyping is crucial for tailoring therapeutic strategies that can potentially lead to reduced mortality and morbidity. Model-based clustering, such as Gaussian mixture models, provides a principled and interpretable methodology that is widely used to identify subtypes. However, they impose identical marginal distributions on each variable; such assumptions restrict their modeling flexibility and deteriorates clustering performance. RESULTS:In this paper, we use the statistical framework of copulas to decouple the modeling of marginals from the dependencies between them. Current copula-based methods cannot scale to high dimensions due to challenges in parameter inference",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                }
            ]
        }
    ],
    "homepage": "https://bitbucket.org/cdal/hdgmcm/",
    "lastUpdate": "2020-12-07T09:25:40Z",
    "name": "HD-GMCM",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ599",
            "metadata": {
                "abstract": "© 2019 The Author(s) . Published by Oxford University Press. All rights reserved.The identification of sub-populations of patients with similar characteristics, called patient subtyping, is important for realizing the goals of precision medicine. Accurate subtyping is crucial for tailoring therapeutic strategies that can potentially lead to reduced mortality and morbidity. Model-based clustering, such as Gaussian mixture models, provides a principled and interpretable methodology that is widely used to identify subtypes. However, they impose identical marginal distributions on each variable; such assumptions restrict their modeling flexibility and deteriorates clustering performance. Results: In this paper, we use the statistical framework of copulas to decouple the modeling of marginals from the dependencies between them. Current copula-based methods cannot scale to high dimensions due to challenges in parameter inference. We develop HD-GMCM, that addresses these challenges and, to our knowledge, is the first copula-based clustering method that can fit high-dimensional data. Our experiments on real high-dimensional gene-expression and clinical datasets show that HD-GMCM outperforms state-of-the-art model-based clustering methods, by virtue of modeling non-Gaussian data and being robust to outliers through the use of Gaussian mixture copulas. We present a case study on lung cancer data from TCGA. Clusters obtained from HD-GMCM can be interpreted based on the dependencies they model, that offers a new way of characterizing subtypes. Empirically, such modeling not only uncovers latent structure that leads to better clustering but also meaningful clinical subtypes in terms of survival rates of patients.",
                "authors": [
                    {
                        "name": "Kasa S.R."
                    },
                    {
                        "name": "Bhattacharya S."
                    },
                    {
                        "name": "Rajan V."
                    }
                ],
                "citationCount": 3,
                "date": "2020-01-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Gaussian mixture copulas for high-dimensional clustering and dependency-based subtyping"
            },
            "pmid": "31368480"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        }
    ],
    "validated": 1
}