
{
    "credit": [
        {
            "email": "durrantj@pitt.edu",
            "name": "Jacob D. Durrant",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://durrantlab.pitt.edu/apps/scoria/docs/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "license": "Apache-2.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "Cheminformatics",
                "uri": "http://edamontology.org/topic_2258"
            },
            {
                "term": "Small molecules",
                "uri": "http://edamontology.org/topic_0154"
            },
            {
                "term": "Protein structure analysis",
                "uri": "http://edamontology.org/topic_2814"
            },
            {
                "term": "Data visualisation",
                "uri": "http://edamontology.org/topic_0092"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2017 The Author(s).Third-party packages have transformed the Python programming language into a powerful computational-biology tool. Package installation is easy for experienced users, but novices sometimes struggle with dependencies and compilers. This presents a barrier that can hinder the otherwise broad adoption of new tools. We present Scoria, a Python package for manipulating three-dimensional molecular data. Unlike similar packages, Scoria requires no dependencies, compilation, or system-wide installation. One can incorporate the Scoria source code directly into their own programs. But Scoria is not designed to compete with other similar packages. Rather, it complements them. Our package leverages others (e.g. NumPy, SciPy), if present, to speed and extend its own functionality. To show its utility, we use Scoria to analyze a molecular dynamics trajectory. Our FootPrint script colors the atoms of one chain by the frequency of their contacts with a second chain. We are hopeful that Scoria will be a useful tool for the computational-biology community. A copy is available for download free of charge (Apache License 2.0) at http://durrantlab.com/scoria/.[Figure not available: see fulltext.]",
            "authors": [
                "Ropp P.",
                "Friedman A.",
                "Durrant J.D."
            ],
            "cit_count": 0,
            "doi": "10.1186/s13321-017-0237-8",
            "journal": "Journal of Cheminformatics",
            "title": "Scoria: A Python module for manipulating 3D molecular data",
            "year": "2017-09-18"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:scoria",
        "biotoolsID": "scoria",
        "description": "Python package for manipulating three dimensional molecular data. Unlike similar packages, it is written in pure Python and so requires no dependencies or installation. One can incorporate the source code directly into their own programs. But it is not designed to compete with other similar packages.",
        "homepage": "http://durrantlab.com/scoria/",
        "name": "Scoria"
    }
}