{
    "additionDate": "2022-12-22T08:35:04.431635Z",
    "biotoolsCURIE": "biotools:bioviz_connect",
    "biotoolsID": "bioviz_connect",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "aloraine@uncc.edu",
            "name": "Ann E. Loraine",
            "typeEntity": "Person"
        }
    ],
    "description": "BioViz Connect, a middleware Web application that links CyVerse science gateway resources to the Integrated Genome Browser (IGB), a highly interactive native application implemented in Java that runs on the user’s personal computer.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome visualisation",
                    "uri": "http://edamontology.org/operation_3208"
                }
            ]
        }
    ],
    "homepage": "https://bioviz.org/connect.html",
    "lastUpdate": "2024-11-24T15:16:38.734080Z",
    "name": "BioViz Connect",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3389/fbinf.2022.764619",
            "metadata": {
                "abstract": "Genomics researchers do better work when they can interactively explore and visualize data. Due to the vast size of experimental datasets, researchers are increasingly using powerful, cloud-based systems to process and analyze data. These remote systems, called science gateways, offer user-friendly, Web-based access to high performance computing and storage resources, but typically lack interactive visualization capability. In this paper, we present BioViz Connect, a middleware Web application that links CyVerse science gateway resources to the Integrated Genome Browser (IGB), a highly interactive native application implemented in Java that runs on the user’s personal computer. Using BioViz Connect, users can 1) stream data from the CyVerse data store into IGB for visualization, 2) improve the IGB user experience for themselves and others by adding IGB specific metadata to CyVerse data files, including genome version and track appearance, and 3) run compute-intensive visual analytics functions on CyVerse infrastructure to create new datasets for visualization in IGB or other applications. To demonstrate how BioViz Connect facilitates interactive data visualization, we describe an example RNA-Seq data analysis investigating how heat and desiccation stresses affect gene expression in the model plant Arabidopsis thaliana. The RNA-Seq use case illustrates how interactive visualization with IGB can help a user identify problematic experimental samples, sanity-check results using a positive control, and create new data files for interactive visualization in IGB (or other tools) using a Docker image deployed to CyVerse via the Terrain API. Lastly, we discuss limitations of the technologies used and suggest opportunities for future work. BioViz Connect is available from https://bioviz.org.",
                "authors": [
                    {
                        "name": "Bole P."
                    },
                    {
                        "name": "Dias C."
                    },
                    {
                        "name": "Freese N.H."
                    },
                    {
                        "name": "Kintali C."
                    },
                    {
                        "name": "Loraine A.E."
                    },
                    {
                        "name": "Raveendran K."
                    },
                    {
                        "name": "Tiwari S."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Frontiers in Bioinformatics",
                "title": "BioViz Connect: Web Application Linking CyVerse Cloud Resources to Genomic Visualization in the Integrated Genome Browser"
            },
            "pmcid": "PMC9580933",
            "pmid": "36304269"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
