{
    "additionDate": "2021-01-18T07:01:00Z",
    "biotoolsCURIE": "biotools:aitl",
    "biotoolsID": "aitl",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ester@sfu.ca",
            "name": "Martin Ester",
            "typeEntity": "Person"
        }
    ],
    "description": "Adversarial Inductive Transfer Learning (AITL) is a deep neural network method for addressing discrepancies in input and output space between the pre-clinical and clinical datasets.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/hosseinshn/AITL",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T20:47:57.341383Z",
    "name": "AITL",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btaa442",
            "metadata": {
                "abstract": "Motivation: The goal of pharmacogenomics is to predict drug response in patients using their single- or multi-omics data. A major challenge is that clinical data (i.e. patients) with drug response outcome is very limited, creating a need for transfer learning to bridge the gap between large pre-clinical pharmacogenomics datasets (e.g. cancer cell lines), as a source domain, and clinical datasets as a target domain. Two major discrepancies exist between preclinical and clinical datasets: (i) in the input space, the gene expression data due to difference in the basic biology, and (ii) in the output space, the different measures of the drug response. Therefore, training a computational model on cell lines and testing it on patients violates the i.i.d assumption that train and test data are from the same distribution. Results: We propose Adversarial Inductive Transfer Learning (AITL), a deep neural network method for addressing discrepancies in input and output space between the pre-clinical and clinical datasets. AITL takes gene expression of patients and cell lines as the input, employs adversarial domain adaptation and multi-task learning to address these discrepancies, and predicts the drug response as the output. To the best of our knowledge, AITL is the first adversarial inductive transfer learning method to address both input and output discrepancies. Experimental results indicate that AITL outperforms state-of-the-art pharmacogenomics and transfer learning baselines and may guide precision oncology more accurately.",
                "authors": [
                    {
                        "name": "Collins C.C."
                    },
                    {
                        "name": "Ester M."
                    },
                    {
                        "name": "Peng S."
                    },
                    {
                        "name": "Sharifi-Noghabi H."
                    },
                    {
                        "name": "Zolotareva O."
                    }
                ],
                "citationCount": 32,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "AITL: Adversarial inductive transfer learning with input and output space adaptation for pharmacogenomics"
            },
            "pmcid": "PMC7355265",
            "pmid": "32657371",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1101/2020.01.24.918953",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pharmacogenomics",
            "uri": "http://edamontology.org/topic_0208"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ],
    "validated": 1
}
