{
    "additionDate": "2020-01-14T20:14:48Z",
    "biotoolsCURIE": "biotools:hipathia-gemomics",
    "biotoolsID": "hipathia-gemomics",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "joaquin.dopazo@juntadeandalucia.es",
            "name": "Joaquín Dopazo",
            "orcidid": "https://orcid.org/0000-0003-3318-120X",
            "typeEntity": "Person"
        }
    ],
    "description": "Using mechanistic models for the clinical interpretation of complex genomic variation.\n\nThe sustained generation of genomic data in the last decade has increased the knowledge on the causal mutations of a large number of diseases, especially for highly penetrant Mendelian diseases, typically caused by a unique or a few genes. However, the discovery of causal genes in complex diseases has been far less successful. Many complex diseases are actually a consequence of the failure of complex biological modules, composed by interrelated proteins, which can happen in many different ways, which conferring a multigenic nature to the condition that can hardly be attributed to one or a few genes.",
    "editPermission": {
        "authors": [
            "kinza"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression profile pathway mapping",
                    "uri": "http://edamontology.org/operation_0533"
                },
                {
                    "term": "Network simulation",
                    "uri": "http://edamontology.org/operation_3562"
                },
                {
                    "term": "Variant effect prediction",
                    "uri": "http://edamontology.org/operation_0331"
                }
            ]
        }
    ],
    "homepage": "http://hipathia.babelomics.org",
    "lastUpdate": "2023-02-17T10:51:17.316704Z",
    "name": "Hipathia-genomics",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1038/S41598-019-55454-7",
            "metadata": {
                "abstract": "© 2019, The Author(s).The sustained generation of genomic data in the last decade has increased the knowledge on the causal mutations of a large number of diseases, especially for highly penetrant Mendelian diseases, typically caused by a unique or a few genes. However, the discovery of causal genes in complex diseases has been far less successful. Many complex diseases are actually a consequence of the failure of complex biological modules, composed by interrelated proteins, which can happen in many different ways, which conferring a multigenic nature to the condition that can hardly be attributed to one or a few genes. We present a mechanistic model, Hipathia, implemented in a web server that allows estimating the effect that mutations, or changes in the expression of genes, have over the whole system of human signaling and the corresponding functional consequences. We show several use cases where we demonstrate how different the ultimate impact of mutations with similar loss-of-function potential can be and how the potential pathological role of a damaged gene can be inferred within the context of a signaling network. The use of systems biology-based approaches, such as mechanistic models, allows estimating the potential impact of loss-of-function mutations occurring in proteins that are part of complex biological interaction networks, such as signaling pathways. This holistic approach provides an elegant alternative to gene-centric approaches that can open new avenues in the interpretation of the genomic variability in complex diseases.",
                "authors": [
                    {
                        "name": "Dopazo J."
                    },
                    {
                        "name": "Esteban-Medina M."
                    },
                    {
                        "name": "Falco M.M."
                    },
                    {
                        "name": "Hidalgo M.R."
                    },
                    {
                        "name": "Loucera C."
                    },
                    {
                        "name": "Pena-Chilet M."
                    },
                    {
                        "name": "Rian K."
                    }
                ],
                "citationCount": 11,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "Using mechanistic models for the clinical interpretation of complex genomic variation"
            },
            "pmcid": "PMC6908734",
            "pmid": "31831811"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}
