{
    "additionDate": "2021-03-19T08:26:37Z",
    "biotoolsCURIE": "biotools:ihec-raac",
    "biotoolsID": "ihec-raac",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Yongchun Zuo",
            "typeEntity": "Person"
        }
    ],
    "description": "A online platform for identifying human enzyme classes via reduced amino acid cluster strategy.\n\nEnzyme, as a kind of biocatalyst, dominates many catalytic processes such as metabolism, nutrition and energy conversion, and most of the reactions closely related to human life process are also enzyme catalytic reactions.\n\nIdentifying the 2-level antimicrobial peptides using reduced acid amino composition.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                }
            ]
        }
    ],
    "homepage": "http://bioinfor.imu.edu.cn/ihecraac",
    "lastUpdate": "2021-03-31T18:24:33Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://bioinfor.imu.edu.cn/ihecraac/public/"
        }
    ],
    "name": "IHEC-RAAC",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1007/S00726-021-02941-9",
            "metadata": {
                "abstract": "© 2021, The Author(s), under exclusive licence to Springer-Verlag GmbH, AT part of Springer Nature.Enzymes have been proven to play considerable roles in disease diagnosis and biological functions. The feature extraction that truly reflects the intrinsic properties of protein is the most critical step for the automatic identification of enzymes. Although lots of feature extraction methods have been proposed, some challenges remain. In this study, we developed a predictor called IHEC_RAAC, which has the capability to identify whether a protein is a human enzyme and distinguish the function of the human enzyme. To improve the feature representation ability, protein sequences were encoded by a new feature-vector called ‘reduced amino acid cluster’. We calculated 673 amino acid reduction alphabets to determine the optimal feature representative scheme. The tenfold cross-validation test showed that the accuracy of IHEC_RAAC to identify human enzymes was 74.66% and further discriminate the human enzyme classes with an accuracy of 54.78%, which was 2.06% and 8.68% higher than the state-of-the-art predictors, respectively. Additionally, the results from the independent dataset indicated that IHEC_RAAC can effectively predict human enzymes and human enzyme classes to further provide guidance for protein research. A user-friendly web server, IHEC_RAAC, is freely accessible at http://bioinfor.imu.edu.cn/ihecraac.",
                "authors": [
                    {
                        "name": "Hong Y."
                    },
                    {
                        "name": "Liang P."
                    },
                    {
                        "name": "Wang H."
                    },
                    {
                        "name": "Xi Q."
                    },
                    {
                        "name": "Zheng L."
                    },
                    {
                        "name": "Zuo Y."
                    }
                ],
                "citationCount": 1,
                "date": "2021-02-01T00:00:00Z",
                "journal": "Amino Acids",
                "title": "IHEC_RAAC: a online platform for identifying human enzyme classes via reduced amino acid cluster strategy"
            },
            "pmid": "33486591"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Nutritional science",
            "uri": "http://edamontology.org/topic_3390"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
