
{
    "credit": [
        {
            "name": "IFB ELIXIR-FR",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "julie@igbmc.u-strasbg.fr",
            "name": "Julie Thompson",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://www.lbgi.fr/~julie/MACSIMS/Documentation/"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence alignment",
                        "uri": "http://edamontology.org/data_0863"
                    },
                    "format": [
                        {
                            "term": "ClustalW format",
                            "uri": "http://edamontology.org/format_1982"
                        },
                        {
                            "term": "GCG MSF",
                            "uri": "http://edamontology.org/format_1947"
                        },
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "note": "This function mines automatically structural and functional informations from the public databases. It identifies homologous regions and evaluates and propagates mined data from known to unknown sequences with these reliable regions.",
            "operation": [
                {
                    "term": "Sequence visualisation",
                    "uri": "http://edamontology.org/operation_0564"
                },
                {
                    "term": "Sequence annotation",
                    "uri": "http://edamontology.org/operation_0361"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Annotation track",
                        "uri": "http://edamontology.org/data_3002"
                    }
                },
                {
                    "data": {
                        "term": "Report",
                        "uri": "http://edamontology.org/data_2048"
                    }
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Data visualisation",
                "uri": "http://edamontology.org/topic_0092"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.lbgi.fr/~julie/MACSIMS/"
        }
    ],
    "publication": [
        {
            "abstract": "Background: In the post-genomic era, systems-level studies are being performed that seek to explain complex biological systems by integrating diverse resources from fields such as genomics, proteomics or transcriptomics. New information management systems are now needed for the collection, validation and analysis of the vast amount of heterogeneous data available. Multiple alignments of complete sequences provide an ideal environment for the integration of this information in the context of the protein family. Results: MACSIMS is a multiple alignment-based information management program that combines the advantages of both knowledge-based and ab initio sequence analysis methods. Structural and functional information is retrieved automatically from the public databases. In the multiple alignment, homologous regions are identified and the retrieved data is evaluated and propagated from known to unknown sequences with these reliable regions. In a large-scale evaluation, the specificity of the propagated sequence features is estimated to be ≥99%, i.e. very few false positive predictions are made. MACSIMS is then used to characterise mutations in a test set of 100 proteins that are known to be involved in human genetic diseases. The number of sequence features associated with these proteins was increased by 60%, compared to the features available in the public databases. An XML format output file allows automatic parsing of the MACSIM results, while a graphical display using the JalView program allows manual analysis. Conclusion: MACSIMS is a new information management system that incorporates detailed analyses of protein families at the structural, functional and evolutionary levels. MACSIMS thus provides a unique environment that facilitates knowledge extraction and the presentation of the most pertinent information to the biologist. A web server and the source code are available at http://bips.u-strasbg.fr/MACSIMS/. © 2006 Thompson et al; licensee BioMed Central Ltd.",
            "authors": [
                "Thompson J.D.",
                "Muller A.",
                "Waterhouse A.",
                "Procter J.",
                "Barton G.J.",
                "Plewniak F.",
                "Poch O."
            ],
            "cit_count": 34,
            "doi": "10.1186/1471-2105-7-318",
            "journal": "BMC Bioinformatics",
            "title": "MACSIMS : Multiple alignment of complete sequences information management system",
            "type": "Primary",
            "year": "2006-12-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:macsims",
        "biotoolsID": "macsims",
        "description": "Multiple alignment-based information management system that combines the advantages of both knowledge-based and ab initio sequence analysis methods.",
        "homepage": "http://www.lbgi.fr/~julie/MACSIMS/",
        "name": "MACSIMS",
        "version": [
            "MACSIMS"
        ]
    }
}