{
    "additionDate": "2017-12-18T00:13:33Z",
    "biotoolsCURIE": "biotools:tm-score",
    "biotoolsID": "tm-score",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://zhanglab.ccmb.med.umich.edu/"
        }
    ],
    "description": "Is an algorithm to calculate the similarity of topologies of two protein structures. It can be exploited to quantitatively access the quality of protein structure predictions relative to native. Because TM-score weights the close matches stronger than the distant matches, TM-score is more sensitive than root-mean-square deviation (RMSD).",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://zhanglab.ccmb.med.umich.edu/TM-score/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "homepage": "http://zhanglab.ccmb.med.umich.edu/TM-score/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/tm-score-calculate-similarity-topologies-protein-structures.html"
        }
    ],
    "name": "TM-score",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1002/prot.20264",
            "metadata": {
                "abstract": "We have developed a new scoring function, the template modeling score (TM-score), to assess the quality of protein structure templates and predicted full-length models by extending the approaches used in Global Distance Test (GDT) and MaxSub. First, a protein size-dependent scale is exploited to eliminate the inherent protein size dependence of the previous scores and appropriately account for random protein structure pairs. Second, rather than setting specific distance cutoffs and calculating only the fractions with errors below the cutoff, all residue pairs in alignment/modeling are evaluated in the proposed score. For comparison of various scoring functions, we have constructed a large-scale benchmark set of structure templates for 1489 small to medium size proteins using the threading program PROSPECTOR_3 and built the full-length models using MODELLER and TASSER. The TM-score of the initial threading alignments, compared to the GDT and MaxSub scoring functions, shows a much stronger correlation to the quality of the final full-length models. The TM-score is further exploited as an assessment of all 'new fold' targets in the recent CASP5 experiment and shows a close coincidence with the results of human-expert visual assessment. These data suggest that the TM-score is a useful complement to the fully automated assessment of protein structure predictions. © 2004 Wiley-Liss, Inc.",
                "authors": [
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Skolnick J."
                    }
                ],
                "citationCount": 1046,
                "date": "2004-12-01T00:00:00Z",
                "journal": "Proteins: Structure, Function and Genetics",
                "title": "Scoring function for automated assessment of protein structure template quality"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ],
    "validated": 1,
    "version": [
        "20130511"
    ]
}