{
    "additionDate": "2021-03-19T09:02:02Z",
    "biotoolsCURIE": "biotools:discbio",
    "biotoolsID": "discbio",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "salim.ghannoum@medisin.uio.no",
            "name": "Salim Ghannoum",
            "orcidid": "https://orcid.org/0000-0003-1455-5835",
            "typeEntity": "Person"
        },
        {
            "email": "alvaro.kohn-luque@medisin.uio.no",
            "name": "Alvaro Köhn-Luque",
            "typeEntity": "Person"
        }
    ],
    "description": "DIscBIO is a user-friendly pipeline for biomarker discovery in single-cell transcriptomics. An open, multi-algorithmic pipeline for easy, fast and efficient analysis of cellular sub-populations and the molecular signatures that characterize them.",
    "documentation": [
        {
            "type": [
                "Training material"
            ],
            "url": "https://nbviewer.jupyter.org/github/ocbe-uio/DIscBIO/tree/dev/notebook/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Expression profile clustering",
                    "uri": "http://edamontology.org/operation_0313"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ocbe-uio/DIscBIO",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-31T19:32:59Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/ocbe-uio/DIscBIO/issues"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://cran.r-project.org/package=DIscBIO"
        }
    ],
    "name": "DIscBIO",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3390/IJMS22031399",
            "metadata": {
                "abstract": "© 2021 by the authors. Licensee MDPI, Basel, Switzerland.The growing attention toward the benefits of single-cell RNA sequencing (scRNA-seq) is leading to a myriad of computational packages for the analysis of different aspects of scRNA-seq data. For researchers without advanced programing skills, it is very challenging to combine several packages in order to perform the desired analysis in a simple and reproducible way. Here we pre-sent DIscBIO, an open-source, multi-algorithmic pipeline for easy, efficient and reproducible analysis of cellular sub-populations at the transcriptomic level. The pipeline integrates multiple scRNA-seq packages and allows biomarker discovery with decision trees and gene enrichment analysis in a network context using single-cell sequencing read counts through clustering and differential anal-ysis. DIscBIO is freely available as an R package. It can be run either in command-line mode or through a user-friendly computational pipeline using Jupyter notebooks. We showcase all pipeline features using two scRNA-seq datasets. The first dataset consists of circulating tumor cells from patients with breast cancer. The second one is a cell cycle regulation dataset in myxoid liposarcoma. All analyses are available as notebooks that integrate in a sequential narrative R code with explan-atory text and output data and images. R users can use the notebooks to understand the different steps of the pipeline and will guide them to explore their scRNA-seq data. We also provide a cloud version using Binder that allows the execution of the pipeline without the need of downloading R, Jupyter or any of the packages used by the pipeline. The cloud version can serve as a tutorial for training purposes, especially for those that are not R users or have limited programing skills. How-ever, in order to do meaningful scRNA-seq analyses, all users will need to understand the imple-mented methods and their possible options and limitations.",
                "authors": [
                    {
                        "name": "Fantini D."
                    },
                    {
                        "name": "Farhan H."
                    },
                    {
                        "name": "Ghannoum S."
                    },
                    {
                        "name": "Jonasson E."
                    },
                    {
                        "name": "Kohn-Luque A."
                    },
                    {
                        "name": "Netto W.L."
                    },
                    {
                        "name": "Parizadeh A."
                    },
                    {
                        "name": "Ragan-Kelley B."
                    },
                    {
                        "name": "Stahlberg A."
                    }
                ],
                "date": "2021-02-02T00:00:00Z",
                "journal": "International Journal of Molecular Sciences",
                "title": "Discbio: A user-friendly pipeline for biomarker discovery in single-cell transcriptomics"
            },
            "pmcid": "PMC7866810",
            "pmid": "33573289"
        }
    ],
    "toolType": [
        "Library",
        "Workflow"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
