{
    "additionDate": "2019-11-14T18:08:55Z",
    "biotoolsCURIE": "biotools:scRNABatchQC",
    "biotoolsID": "scRNABatchQC",
    "confidence_flag": "tool",
    "description": "Multi-samples quality control for single cell RNA-seq data | scRNABatchQC is an R package for generating a HTML QC report to check and compare quality of multiple single cell RNA-seq datasets. scRNABatchQC supports multiple types of inputs, including gene-cell count matrices, 10x genomics, SingleCellExperiment or Seurat v3 objects. Please see the manual for the usage of scRNABatchQC and the explanation of the HTML report",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "https://github.com/liuqivandy/scRNABatchQC",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-18T08:15:52Z",
    "name": "scRNABatchQC",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ601",
            "metadata": {
                "abstract": "© 2019 The Author(s) . Published by Oxford University Press.Single cell RNA sequencing is a revolutionary technique to characterize inter-cellular transcriptomics heterogeneity. However, the data are noise-prone because gene expression is often driven by both technical artifacts and genuine biological variations. Proper disentanglement of these two effects is critical to prevent spurious results. While several tools exist to detect and remove low-quality cells in one single cell RNA-seq dataset, there is lack of approach to examining consistency between sample sets and detecting systematic biases, batch effects and outliers. We present scRNABatchQC, an R package to compare multiple sample sets simultaneously over numerous technical and biological features, which gives valuable hints to distinguish technical artifact from biological variations. scRNABatchQC helps identify and systematically characterize sources of variability in single cell transcriptome data. The examination of consistency across datasets allows visual detection of biases and outliers.",
                "authors": [
                    {
                        "name": "Liu Q."
                    },
                    {
                        "name": "Sheng Q."
                    },
                    {
                        "name": "Ping J."
                    },
                    {
                        "name": "Ramirez M.A."
                    },
                    {
                        "name": "Lau K.S."
                    },
                    {
                        "name": "Coffey R.J."
                    },
                    {
                        "name": "Shyr Y."
                    }
                ],
                "citationCount": 1,
                "date": "2019-12-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "ScRNABatchQC: Multi-samples quality control for single cell RNA-seq data"
            },
            "pmid": "31373345"
        }
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}