{
    "additionDate": "2021-01-18T07:06:10Z",
    "biotoolsCURIE": "biotools:clarite",
    "biotoolsID": "clarite",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mah546@psu.edu",
            "name": "Molly A. Hall",
            "typeEntity": "Person"
        },
        {
            "name": "Anastasia M. Lucas",
            "typeEntity": "Person"
        },
        {
            "name": "Nicole E. Palmiero",
            "typeEntity": "Person"
        }
    ],
    "description": "CLeaning to Analysis: Reproducibility-based Interface for Traits and Exposures (CLARITE) is as a tool to efficiently clean environmental data, perform regression analysis, and visualize results on a single platform through user-guided automation. It exists as both an R package and a Python package. Though CLARITE focuses on EWAS, it is intended to also improve the QC process for phenotypes and clinical lab measures for a variety of downstream analyses, including phenome-wide association studies and gene-environment interaction studies.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://clarite-python.readthedocs.io/en/stable/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/HallLab/clarite-python",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2021-02-11T20:00:59Z",
    "license": "BSD-3-Clause",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/HallLab/clarite"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/HallLab/clarite-python"
        }
    ],
    "name": "CLARITE",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3389/FGENE.2019.01240",
            "metadata": {
                "abstract": "© Copyright © 2019 Lucas, Palmiero, McGuigan, Passero, Zhou, Orie, Ritchie and Hall.While genome-wide association studies are an established method of identifying genetic variants associated with disease, environment-wide association studies (EWAS) highlight the contribution of nongenetic components to complex phenotypes. However, the lack of high-throughput quality control (QC) pipelines for EWAS data lends itself to analysis plans where the data are cleaned after a first-pass analysis, which can lead to bias, or are cleaned manually, which is arduous and susceptible to user error. We offer a novel software, CLeaning to Analysis: Reproducibility-based Interface for Traits and Exposures (CLARITE), as a tool to efficiently clean environmental data, perform regression analysis, and visualize results on a single platform through user-guided automation. It exists as both an R package and a Python package. Though CLARITE focuses on EWAS, it is intended to also improve the QC process for phenotypes and clinical lab measures for a variety of downstream analyses, including phenome-wide association studies and gene-environment interaction studies. With the goal of demonstrating the utility of CLARITE, we performed a novel EWAS in the National Health and Nutrition Examination Survey (NHANES) (N overall Discovery=9063, N overall Replication=9874) for body mass index (BMI) and over 300 environment variables post-QC, adjusting for sex, age, race, socioeconomic status, and survey year. The analysis used survey weights along with cluster and strata information in order to account for the complex survey design. Sixteen BMI results replicated at a Bonferroni corrected p < 0.05. The top replicating results were serum levels of g-tocopherol (vitamin E) (Discovery Bonferroni p: 8.67x10-12, Replication Bonferroni p: 2.70x10-9) and iron (Discovery Bonferroni p: 1.09x10-8, Replication Bonferroni p: 1.73x10-10). Results of this EWAS are important to consider for metabolic trait analysis, as BMI is tightly associated with these phenotypes. As such, exposures predictive of BMI may be useful for covariate and/or interaction assessment of metabolic-related traits. CLARITE allows improved data quality for EWAS, gene-environment interactions, and phenome-wide association studies by establishing a high-throughput quality control infrastructure. Thus, CLARITE is recommended for studying the environmental factors underlying complex disease.",
                "authors": [
                    {
                        "name": "Hall M.A."
                    },
                    {
                        "name": "Lucas A.M."
                    },
                    {
                        "name": "McGuigan J."
                    },
                    {
                        "name": "Orie D."
                    },
                    {
                        "name": "Palmiero N.E."
                    },
                    {
                        "name": "Passero K."
                    },
                    {
                        "name": "Ritchie M.D."
                    },
                    {
                        "name": "Zhou J."
                    }
                ],
                "citationCount": 4,
                "date": "2019-12-18T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "CLARITE Facilitates the Quality Control and Analysis Process for EWAS of Metabolic-Related Traits"
            },
            "pmcid": "PMC6930237",
            "pmid": "31921293"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Nutritional science",
            "uri": "http://edamontology.org/topic_3390"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
