
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://snp.toulouse.inra.fr/~servin/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://forge-dga.jouy.inra.fr/projects/hapflk/wiki"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Sequence feature detection",
                    "uri": "http://edamontology.org/operation_0253"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python",
            "C"
        ],
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Genotyping experiment",
                "uri": "http://edamontology.org/topic_3516"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Genotype and phenotype",
                "uri": "http://edamontology.org/topic_0625"
            },
            {
                "term": "Population genetics",
                "uri": "http://edamontology.org/topic_3056"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/hapflk-1-2-detection-selection-signatures-based-multiple-population-genotyping-data.html"
        }
    ],
    "publication": [
        {
            "abstract": "The detection of molecular signatures of selection is one of the major concerns of modern population genetics. A widely used strategy in this context is to compare samples from several populations and to look for genomic regions with outstanding genetic differentiation between these populations. Genetic differentiation is generally based on allele frequency differences between populations, which are measured by FST or related statistics. Here we introduce a new statistic, denoted hapFLK, which focuses instead on the differences of haplotype frequencies between populations. In contrast to most existing statistics, hapFLK accounts for the hierarchical structure of the sampled populations. Using computer simulations, we show that each of these two features-the use of haplotype information and of the hierarchical structure of populations-significantly improves the detection power of selected loci and that combining them in the hapFLK statistic provides even greater power. We also show that hapFLK is robust with respect to bottlenecks and migration and improves over existing approaches in many situations. Finally, we apply hapFLK to a set of six sheep breeds from Northern Europe and identify seven regions under selection, which include already reported regions but also several new ones. We propose a method to help identifying the population(s) under selection in a detected region, which reveals that in many of these regions selection most likely occurred in more than one population. Furthermore, several of the detected regions correspond to incomplete sweeps, where the favorable haplotype is only at intermediate frequency in the population(s) under selection. © 2013 by the Genetics Society of America.",
            "authors": [
                "Fariello M.I.",
                "Boitard S.",
                "Naya H.",
                "SanCristobal M.",
                "Servin B."
            ],
            "cit_count": 82,
            "doi": "10.1534/genetics.112.147231",
            "journal": "Genetics",
            "title": "Detecting signatures of selection through haplotype differentiation among hierarchically structured populations",
            "type": "Primary",
            "year": "2013-04-25"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:hapflk",
        "biotoolsID": "hapflk",
        "description": "Software for the detection of selection signatures based on multiple population genotyping data.",
        "homepage": "https://forge-dga.jouy.inra.fr/projects/hapflk",
        "name": "hapFLK",
        "version": [
            "1.2.1"
        ]
    }
}