{
    "accessibility": "Open access",
    "additionDate": "2021-11-21T15:28:20.247757Z",
    "biotoolsCURIE": "biotools:rgv",
    "biotoolsID": "rgv",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Evan Olawsky",
            "orcidid": "https://orcid.org/0000-0003-1948-0123"
        },
        {
            "name": "Yuan Zhang"
        },
        {
            "name": "Lynn E Eberly"
        },
        {
            "name": "Erika S Helgeson"
        },
        {
            "name": "Lisa S Chow",
            "orcidid": "https://orcid.org/0000-0002-6210-2307"
        }
    ],
    "description": "An Analysis Tool for Continuous Glucose Monitor Data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://shiny.biostat.umn.edu/GV/",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-11-21T15:29:32.667194Z",
    "license": "Not licensed",
    "name": "rGV",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1177/19322968211028909",
            "metadata": {
                "abstract": "© 2021 Diabetes Technology Society.Background: With the development of continuous glucose monitoring systems (CGMS), detailed glycemic data are now available for analysis. Yet analysis of this data-rich information can be formidable. The power of CGMS-derived data lies in its characterization of glycemic variability. In contrast, many standard glycemic measures like hemoglobin A1c (HbA1c) and self-monitored blood glucose inadequately describe glycemic variability and run the risk of bias toward overreporting hyperglycemia. Methods that adjust for this bias are often overlooked in clinical research due to difficulty of computation and lack of accessible analysis tools. Methods: In response, we have developed a new R package rGV, which calculates a suite of 16 glycemic variability metrics when provided a single individual’s CGM data. rGV is versatile and robust; it is capable of handling data of many formats from many sensor types. We also created a companion R Shiny web app that provides these glycemic variability analysis tools without prior knowledge of R coding. We analyzed the statistical reliability of all the glycemic variability metrics included in rGV and illustrate the clinical utility of rGV by analyzing CGM data from three studies. Results: In subjects without diabetes, greater glycemic variability was associated with higher HbA1c values. In patients with type 2 diabetes mellitus (T2DM), we found that high glucose is the primary driver of glycemic variability. In patients with type 1 diabetes (T1DM), we found that naltrexone use may potentially reduce glycemic variability. Conclusions: We present a new R package and accompanying web app to facilitate quick and easy computation of a suite of glycemic variability metrics.",
                "authors": [
                    {
                        "name": "Olawsky E."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Eberly L.E."
                    },
                    {
                        "name": "Helgeson E.S."
                    },
                    {
                        "name": "Chow L.S."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Journal of Diabetes Science and Technology",
                "title": "A New Analysis Tool for Continuous Glucose Monitor Data"
            },
            "pmid": "34282646"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        }
    ]
}