{
    "accessibility": "Open access",
    "additionDate": "2022-03-22T14:17:12.189960Z",
    "biotoolsCURIE": "biotools:modelgenerator",
    "biotoolsID": "modelgenerator",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "drtkeane@gmail.com",
            "name": "Thomas M Keane"
        },
        {
            "name": "Christopher J Creevey"
        },
        {
            "name": "James O Mclnerney"
        },
        {
            "name": "Melissa M Pentony"
        },
        {
            "name": "Thomas J Naughton"
        }
    ],
    "description": "Amino acid and nucleotide substitution model selection",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "homepage": "http://mcinerneylab.com/software/modelgenerator/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2022-03-22T14:17:12.192709Z",
    "license": "Not licensed",
    "name": "modelgenerator",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/1471-2148-6-29",
            "metadata": {
                "abstract": "Background: In recent years, model based approaches such as maximum likelihood have become the methods of choice for constructing phylogenies. A number of authors have shown the importance of using adequate substitution models in order to produce accurate phylogenies. In the past, many empirical models of amino acid substitution have been derived using a variety of different methods and protein datasets. These matrices are normally used as surrogates, rather than deriving the maximum likelihood model from the dataset being examined. With few exceptions, selection between alternative matrices has been carried out in an ad hoc manner. Results: We start by highlighting the potential dangers of arbitrarily choosing protein models by demonstrating an empirical example where a single alignment can produce two topologically different and strongly supported phylogenies using two different arbitrarily-chosen amino acid substitution models. We demonstrate that in simple simulations, statistical methods of model selection are indeed robust and likely to be useful for protein model selection. We have investigated patterns of amino acid substitution among homologous sequences from the three Domains of life and our results show that no single amino acid matrix is optimal for any of the datasets. Perhaps most interestingly, we demonstrate that for two large datasets derived from the proteobacteria and archaea, one of the most favored models in both datasets is a model that was originally derived from retroviral Pol proteins. Conclusion: This demonstrates that choosing protein models based on their source or method of construction may not be appropriate. © 2006Keane et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Creevey C.J."
                    },
                    {
                        "name": "Keane T.M."
                    },
                    {
                        "name": "McInerney J.O."
                    },
                    {
                        "name": "Naughton T.J."
                    },
                    {
                        "name": "Pentony M.M."
                    }
                ],
                "citationCount": 883,
                "date": "2006-03-24T00:00:00Z",
                "journal": "BMC Evolutionary Biology",
                "title": "Assessment of methods for amino acid matrix selection and their use on empirical data shows that ad hoc assumptions for choice of matrix are not justified"
            },
            "pmcid": "PMC1435933",
            "pmid": "16563161"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
