{
    "additionDate": "2018-04-25T21:59:23Z",
    "biotoolsCURIE": "biotools:microbiome",
    "biotoolsID": "microbiome",
    "collectionID": [
        "microbiome"
    ],
    "credit": [
        {
            "email": "leo.lahti@iki.fi",
            "name": "Leo Lahti",
            "note": "Main developer",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ],
            "url": "http://www.iki.fi/Leo.Lahti"
        },
        {
            "name": "Leo Lahti",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://microbiome.github.io/microbiome/"
        }
    ],
    "description": "Tools for the analysis of microbial community profiling data. Extends the phyloseq class.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/manuals/microbiome/man/microbiome.pdf"
        }
    ],
    "editPermission": {
        "authors": [
            "antagomir"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                }
            ]
        }
    ],
    "homepage": "http://microbiome.github.io/microbiome/",
    "lastUpdate": "2019-03-12T15:38:40Z",
    "license": "BSD-2-Clause",
    "link": [
        {
            "note": "microbiome R package home page",
            "type": [
                "Repository"
            ],
            "url": "http://microbiome.github.io/microbiome/"
        },
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/microbiome.html"
        }
    ],
    "name": "microbiome",
    "owner": "antagomir",
    "publication": [
        {
            "doi": "10.1038/ncomms5344",
            "metadata": {
                "abstract": "The microbial communities living in the human intestine can have profound impact on our well-being and health. However, we have limited understanding of the mechanisms that control this complex ecosystem. Here, based on a deep phylogenetic analysis of the intestinal microbiota in a thousand western adults, we identify groups of bacteria that exhibit robust bistable abundance distributions. These bacteria are either abundant or nearly absent in most individuals, and exhibit decreased temporal stability at the intermediate abundance range. The abundances of these bimodally distributed bacteria vary independently, and their abundance distributions are not affected by short-term dietary interventions. However, their contrasting alternative states are associated with host factors such as ageing and overweight. We propose that the bistable groups reflect tipping elements of the intestinal microbiota, whose critical transitions may have profound health implications and diagnostic potential. © 2014 Macmillan Publishers Limited. All rights reserved.",
                "authors": [
                    {
                        "name": "De Vos W.M."
                    },
                    {
                        "name": "Lahti L."
                    },
                    {
                        "name": "Salojarvi J."
                    },
                    {
                        "name": "Salonen A."
                    },
                    {
                        "name": "Scheffer M."
                    }
                ],
                "citationCount": 131,
                "date": "2014-07-08T00:00:00Z",
                "journal": "Nature Communications",
                "title": "Tipping elements in the human intestinal ecosystem"
            },
            "type": [
                "Other"
            ]
        },
        {
            "doi": "10.1093/femsre/fuw045",
            "metadata": {
                "abstract": "© FEMS 2017.High individuality, large complexity and limited understanding of the mechanisms underlying human intestinal microbiome function remain the major challenges for designing beneficial modulation strategies. Exemplified by the analysis of intestinal bacteria in a thousand Western adults, we discuss key concepts of the human intestinal microbiome landscape, i.e. the compositional and functional 'core', the presence of community types and the existence of alternative stable states. Genomic investigation of core taxa revealed functional redundancy, which is expected to stabilize the ecosystem, as well as taxa with specialized functions that have the potential to shape the microbiome landscape. The contrast between Prevotella- and Bacteroides-dominated systems has been well described. However, less known is the effect of not so abundant bacteria, for example, Dialister spp. that have been proposed to exhibit distinct bistable dynamics. Studies employing time-series analysis have highlighted the dynamical variation in the microbiome landscape with and without the effect of defined perturbations, such as the use of antibiotics or dietary changes. We incorporate ecosystem-level observations of the human intestinal microbiota and its keystone species to suggest avenues for designing microbiome modulation strategies to improve host health.",
                "authors": [
                    {
                        "name": "Hugenholtz F."
                    },
                    {
                        "name": "Lahti L."
                    },
                    {
                        "name": "Shetty S.A."
                    },
                    {
                        "name": "Smidt H."
                    },
                    {
                        "name": "de Vos W.M."
                    }
                ],
                "citationCount": 75,
                "date": "2017-03-01T00:00:00Z",
                "journal": "FEMS Microbiology Reviews",
                "title": "Intestinal microbiome landscaping: Insight in community assemblage and implications for microbial modulation strategies"
            },
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        }
    ],
    "validated": 1,
    "version": [
        "1.1.1"
    ]
}
