{
    "additionDate": "2021-01-18T11:18:49Z",
    "biotoolsCURIE": "biotools:rmvar",
    "biotoolsID": "rmvar",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "renjian.sysu@gmail.com",
            "name": "Jian Ren",
            "typeEntity": "Person"
        },
        {
            "email": "xieyb6@mail.sysu.edu.cn",
            "name": "Yubin Xie",
            "typeEntity": "Person"
        },
        {
            "email": "zuozhx@sysucc.org.cn",
            "name": "Zhixiang Zuo",
            "typeEntity": "Person"
        }
    ],
    "description": "RMVar-Database of functional variants involved in RNA modification.\n\n\n\nWe collected millions of variants, as well as thousands of RNA modification sites from 28 miCLIP experiments, 2 PA-m6A-Seq experiments, 2 m6ACE-Seq experiments, 3 DART-Seq experiments, 7 m6A-REF-Seq experiments, 4 MAZTER-seq experiments, 2 m1A-quant-seq experiments, 2 m1A-IP-Seq experiments, 2 m1A-MAP experiments, 5 m7G-seq, 10 BS-Seq experiments, 2 Nm-Seq experiments, 14 RiboMeth-Seq experiments, 2 ψ-Seq experiments, 1 DM-ψ-Seq experiment, 3 Ceu-Seq experiments, 3 RBS-Seq experiments, 2 m6A-Seal-Seq experiments and 507 MeRIP-Seq experiments, together with a large number of predicted RNA modification sites are involved.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Collapsing methods",
                    "uri": "http://edamontology.org/operation_3791"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                }
            ]
        }
    ],
    "homepage": "http://rmvar.renlab.org",
    "lastUpdate": "2024-11-24T20:45:05.883092Z",
    "name": "RMVar",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/nar/gkaa811",
            "metadata": {
                "abstract": "Distinguishing the few disease-related variants from a massive number of passenger variants is a major challenge. Variants affecting RNA modifications that play critical roles in many aspects of RNA metabolism have recently been linked to many human diseases, such as cancers. Evaluating the effect of genetic variants on RNA modifications will provide a new perspective for understanding the pathogenic mechanism of human diseases. Previously, we developed a database called 'm6AVar' to host variants associated with m6A, one of the most prevalent RNA modifications in eukaryotes. To host all RNA modification (RM)-associated variants, here we present an updated version of m6AVar renamed RMVar (http://rmvar.renlab.org). In this update, RMVar contains 1 678 126 RM-associated variants for 9 kinds of RNA modifications, namely m6A, m6Am, m1A, pseudouridine, m5C, m5U, 2′-O-Me, A-to-I and m7G, at three confidence levels. Moreover, RBP binding regions, miRNA targets, splicing events and circRNAs were integrated to assist investigations of the effects of RM-associated variants on posttranscriptional regulation. In addition, disease-related information was integrated from ClinVar and other genome-wide association studies (GWAS) to investigate the relationship between RM-associated variants and diseases. We expect that RMVar may boost further functional studies on genetic variants affecting RNA modifications.",
                "authors": [
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "Liang J."
                    },
                    {
                        "name": "Luo X."
                    },
                    {
                        "name": "Ren J."
                    },
                    {
                        "name": "Xie Y."
                    },
                    {
                        "name": "Zhao Q."
                    },
                    {
                        "name": "Zuo Z."
                    }
                ],
                "citationCount": 124,
                "date": "2021-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "RMVar: An updated database of functional variants involved in RNA modifications"
            },
            "pmcid": "PMC7779057",
            "pmid": "33021671"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Genetic engineering",
            "uri": "http://edamontology.org/topic_3912"
        },
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        }
    ]
}
