{
    "additionDate": "2021-01-18T10:23:03Z",
    "biotoolsCURIE": "biotools:sskm-succ",
    "biotoolsID": "sskm-succ",
    "confidence_flag": "tool",
    "description": "A novel succinylation sites prediction method incorprating K-means clustering with a new semi-supervised learning algorithm.\n\nThis package implements the SSKM_Succ algorithm incorporating K-means clustering with a new semi-supervised learning algorithm for predicting of the succinylation sites.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "PTM localisation",
                    "uri": "http://edamontology.org/operation_3755"
                }
            ]
        }
    ],
    "homepage": "https://github.com/yangyq505/SSKM_Succ.git",
    "language": [
        "C++",
        "MATLAB"
    ],
    "lastUpdate": "2021-02-21T15:50:11Z",
    "name": "SSKM Succ",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1109/TCBB.2020.3006144",
            "metadata": {
                "abstract": "IEEEProtein succinylation is a type of post-translational modification that occurs on lysine sites and plays a key role in protein conformation regulation and cellular function control. When training, it is difficult to designate negative samples because of the uncertainty of non-succinylation lysine sites, and if not handled properly, it may affect the performance of computational models dramatically. Therefore, we propose a new semi-supervised learning method to identify reliable non-succinylation lysine sites as negative samples. This method, named SSKM_Succ, also employs K-means clustering to divide data into 5 clusters. Besides, information of proximal PTMs and three kinds of sequence features are utilized to formulate protein. Then, we performe a two-step feature selection to remove redundant features and construct the optimization model for each cluster. Finally, support vector machine is applied to construct a prediction model for each cluster. Meanwhile, we compare the result with other existing tools, and it shows that our method is promising for predicting succinylation sites. Through analysis, we further verify that succinylated protein has potential effects on amino acid degradation and fatty acid metabolism, and speculate that protein succinylation may be closely related to neurodegenerative diseases. The code of SSKM_Succ is available on the web https://github.com/yangyq505/SSKM_Succ.git.",
                "authors": [
                    {
                        "name": "Ning Q."
                    },
                    {
                        "name": "Ma Z."
                    },
                    {
                        "name": "Zhao X."
                    },
                    {
                        "name": "Yin M."
                    }
                ],
                "citationCount": 2,
                "date": "2020-01-01T00:00:00Z",
                "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
                "title": "SSKM_Succ: A novel succinylation sites prediction method incorprating K-means clustering with a new semi-supervised learning algorithm"
            },
            "pmid": "32750881"
        }
    ],
    "topic": [
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Protein sites, features and motifs",
            "uri": "http://edamontology.org/topic_3510"
        }
    ]
}