{
    "additionDate": "2020-01-14T20:09:33Z",
    "biotoolsCURIE": "biotools:PG-HACKER",
    "biotoolsID": "PG-HACKER",
    "confidence_flag": "medium",
    "description": "Prediction of major adverse cardiac, cerebrovascular events in patients with diabetes after acute coronary syndrome.\n\nMACCE cumulative incidence for Diabetic Patients post-ACS.\n\nPeripheral artery disease No Yes.\n\nKillip class I (no CHF) II (rales and/or JVD) III (pulmonary edema) IV (cardiogenic shock).\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'adverse cardiac cerebrovascular', 'cardiac cerebrovascular', 'cerebrovascular'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Incident curve plotting",
                    "uri": "http://edamontology.org/operation_3503"
                }
            ]
        }
    ],
    "homepage": "http://medicalc.github.io/pghacker",
    "lastUpdate": "2020-01-14T20:09:33Z",
    "name": "PG-HACKER",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1177/1479164119892137",
            "metadata": {
                "abstract": "© The Author(s) 2019.Background and objectives: The risk of major adverse cardiac and cerebrovascular events following acute coronary syndrome is increased in people with diabetes. Predicting out-of-hospital outcomes upon follow-up remains difficult, and no simple, well-validated tools exist for this population at present. We aim to evaluate several factors in a competing risks model for actionable evaluation of the incidence of major adverse cardiac and cerebrovascular events in diabetic outpatients following acute coronary syndrome. Methods: Retrospective analysis of consecutive patients admitted for acute coronary syndrome in two centres. A Fine–Gray competing risks model was adjusted to predict major adverse cardiac and cerebrovascular events and all-cause mortality. A point-based score is presented that is based on this model. Results: Out of the 1400 patients, there were 783 (55.9%) with at least one major adverse cardiac and cerebrovascular event (417 deaths). Of them, 143 deaths were due to non-major adverse cardiac and cerebrovascular events. Predictive Fine–Gray models show that the ‘PG-HACKER’ risk factors (gender, age, peripheral arterial disease, left ventricle function, previous congestive heart failure, Killip class and optimal medical therapy) were associated to major adverse cardiac and cerebrovascular events. Conclusion: The PG-HACKER score is a simple and effective tool that is freely available and easily accessible to physicians and patients. The PG-HACKER score can predict major adverse cardiac and cerebrovascular events following acute coronary syndrome in patients with diabetes.",
                "authors": [
                    {
                        "name": "Baluja A."
                    },
                    {
                        "name": "Rodriguez-Manero M."
                    },
                    {
                        "name": "Cordero A."
                    },
                    {
                        "name": "Kreidieh B."
                    },
                    {
                        "name": "Iglesias-Alvarez D."
                    },
                    {
                        "name": "Garcia-Acuna J.M."
                    },
                    {
                        "name": "Martinez-Gomez A."
                    },
                    {
                        "name": "Agra-Bermejo R."
                    },
                    {
                        "name": "Alvarez-Rodriguez L."
                    },
                    {
                        "name": "Abou-Jokh C."
                    },
                    {
                        "name": "Lopez-Raton M."
                    },
                    {
                        "name": "Gude-Sampedro F."
                    },
                    {
                        "name": "Alvarez-Escudero J."
                    },
                    {
                        "name": "Gonzalez-Juanatey J.R."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Diabetes and Vascular Disease Research",
                "title": "Prediction of major adverse cardiac, cerebrovascular events in patients with diabetes after acute coronary syndrome"
            },
            "pmid": "31841030"
        }
    ],
    "topic": [
        {
            "term": "Cardiology",
            "uri": "http://edamontology.org/topic_3335"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}