
{
    "credit": [
        {
            "email": "bioinfoteam@fiocruz.br",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.dbbm.fiocruz.br/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://www.dbbm.fiocruz.br/BioParser.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence alignment comparison",
                    "uri": "http://edamontology.org/operation_0259"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Perl"
        ],
        "operatingSystem": [
            "Linux",
            "Windows"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Nucleic acid structure analysis",
                "uri": "http://edamontology.org/topic_0097"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/bioparser-1-2-3-parsing-sequence-similarity-analysis-reports.html"
        }
    ],
    "publication": [
        {
            "abstract": "The widely used programs BLAST (in this article, 'BLAST' includes both the National Center for Biotechnology Information [NCBI] BLAST® and the Washington University version WU BLAST) and FASTA for similarity searches in nucleotide and protein databases usually result in copious output. However, when large query sets are used, human inspection rapidly becomes impractical. BioParser is a Perl program for parsing BLAST and FASTA reports. Making extensive use of the BioPerl toolkit, the program filters, stores and returns components of these reports in either ASCII or HTML format. BioParser is also capable of automatically feeding a local MySQL® database with the parsed information, allowing subsequent filtering of hits and/or alignments with specific attributes. For this reason, BioParser is a valuable tool for large-scale similarity analyses by improving the access to the information present in BLAST or FASTA reports, facilitating extraction of useful information of large sets of sequence alignments, and allowing for easy handling and processing of the data. Availability: BioParser is licensed under the Creative Commons Attribution-NonCommercial-NoDerivs 2.0 license terms (http://creativecommons.org/licenses/by-nc-nd/2.0/) and is available upon request. Additional information can be found at the BioParser website (http://www.dbbm.fiocruz.br/BioParser.html). Contact: Bioinformatics Team at Fiocruz (bioinfoteam@fiocruz.br). © 2006 Adis Data Information BV. All rights reserved.",
            "authors": [
                "Catanho M.",
                "Mascarenhas D.",
                "Degrave W.",
                "De Miranda A.B."
            ],
            "cit_count": 11,
            "journal": "Applied Bioinformatics",
            "pmid": "16539538",
            "title": "BioParser: A tool for processing of sequence similarity analysis reports",
            "year": "2006-03-24"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:bioparser",
        "biotoolsID": "bioparser",
        "description": "Perl program for parsing sequence similarity analysis reports.",
        "homepage": "http://www.dbbm.fiocruz.br/BioParser.html",
        "name": "BioParser"
    }
}