
{
    "credit": [
        {
            "email": "shijieczheng@gmail.com",
            "name": "Shijie Charles Zheng",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "http://bioconductor.org/packages/release/bioc/manuals/EpiDISH/man/EpiDISH.pdf"
        }
    ],
    "download": [
        {
            "url": "http://bioconductor.org/packages/release/bioc/src/contrib/EpiDISH_1.2.0.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Differentially-methylated region identification",
                    "uri": "http://edamontology.org/operation_3809"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "language": [
            "R"
        ],
        "license": "GPL-2.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "Epigenetics",
                "uri": "http://edamontology.org/topic_3295"
            },
            {
                "term": "Microarray experiment",
                "uri": "http://edamontology.org/topic_3518"
            }
        ]
    },
    "link": [
        {
            "type": "MIRROR",
            "url": "https://github.com/sjczheng/EpiDISH"
        },
        {
            "type": "MIRROR",
            "url": "http://bioconductor.org/packages/EpiDISH/"
        },
        {
            "type": "REPOSITORY",
            "url": "https://git.bioconductor.org/packages/EpiDISH"
        }
    ],
    "publication": [
        {
            "abstract": "© 2017 The Author(s). Background: Intra-sample cellular heterogeneity presents numerous challenges to the identification of biomarkers in large Epigenome-Wide Association Studies (EWAS). While a number of reference-based deconvolution algorithms have emerged, their potential remains underexplored and a comparative evaluation of these algorithms beyond tissues such as blood is still lacking. Results: Here we present a novel framework for reference-based inference, which leverages cell-type specific DNAse Hypersensitive Site (DHS) information from the NIH Epigenomics Roadmap to construct an improved reference DNA methylation database. We show that this leads to a marginal but statistically significant improvement of cell-count estimates in whole blood as well as in mixtures involving epithelial cell-types. Using this framework we compare a widely used state-of-the-art reference-based algorithm (called constrained projection) to two non-constrained approaches including CIBERSORT and a method based on robust partial correlations. We conclude that the widely-used constrained projection technique may not always be optimal. Instead, we find that the method based on robust partial correlations is generally more robust across a range of different tissue types and for realistic noise levels. We call the combined algorithm which uses DHS data and robust partial correlations for inference, EpiDISH (Epigenetic Dissection of Intra-Sample Heterogeneity). Finally, we demonstrate the added value of EpiDISH in an EWAS of smoking. Conclusions: Estimating cell-type fractions and subsequent inference in EWAS may benefit from the use of non-constrained reference-based cell-type deconvolution methods.",
            "authors": [
                "Teschendorff A.E.",
                "Breeze C.E.",
                "Zheng S.C.",
                "Beck S."
            ],
            "cit_count": 27,
            "doi": "10.1186/s12859-017-1511-5",
            "journal": "BMC Bioinformatics",
            "title": "A comparison of reference-based algorithms for correcting cell-type heterogeneity in Epigenome-Wide Association Studies",
            "type": "Primary",
            "year": "2017-02-13"
        },
        {
            "abstract": "Background: There has been a long-standing need in biomedical research for a method that quantifies the normally mixed composition of leukocytes beyond what is possible by simple histological or flow cytometric assessments. The latter is restricted by the labile nature of protein epitopes, requirements for cell processing, and timely cell analysis. In a diverse array of diseases and following numerous immune-toxic exposures, leukocyte composition will critically inform the underlying immuno-biology to most chronic medical conditions. Emerging research demonstrates that DNA methylation is responsible for cellular differentiation, and when measured in whole peripheral blood, serves to distinguish cancer cases from controls.Results: Here we present a method, similar to regression calibration, for inferring changes in the distribution of white blood cells between different subpopulations (e.g. cases and controls) using DNA methylation signatures, in combination with a previously obtained external validation set consisting of signatures from purified leukocyte samples. We validate the fundamental idea in a cell mixture reconstruction experiment, then demonstrate our method on DNA methylation data sets from several studies, including data from a Head and Neck Squamous Cell Carcinoma (HNSCC) study and an ovarian cancer study. Our method produces results consistent with prior biological findings, thereby validating the approach.Conclusions: Our method, in combination with an appropriate external validation set, promises new opportunities for large-scale immunological studies of both disease states and noxious exposures. © 2012 Houseman et al.; licensee BioMed Central Ltd.",
            "authors": [
                "Houseman E.A.",
                "Accomando W.P.",
                "Koestler D.C.",
                "Christensen B.C.",
                "Marsit C.J.",
                "Nelson H.H.",
                "Wiencke J.K.",
                "Kelsey K.T."
            ],
            "cit_count": 898,
            "doi": "10.1186/1471-2105-13-86",
            "journal": "BMC Bioinformatics",
            "title": "DNA methylation arrays as surrogate measures of cell mixture distribution",
            "type": "Other",
            "year": "2012-05-08"
        },
        {
            "abstract": "© 2015 Nature America, Inc.We introduce CIBERSORT, a method for characterizing cell composition of complex tissues from their gene expression profiles. When applied to enumeration of hematopoietic subsets in RNA mixtures from fresh, frozen and fixed tissues, including solid tumors, CIBERSORT outperformed other methods with respect to noise, unknown mixture content and closely related cell types. CIBERSORT should enable large-scale analysis of RNA mixtures for cellular biomarkers and therapeutic targets (http://cibersort.stanford.edu/).",
            "authors": [
                "Newman A.M.",
                "Liu C.L.",
                "Green M.R.",
                "Gentles A.J.",
                "Feng W.",
                "Xu Y.",
                "Hoang C.D.",
                "Diehn M.",
                "Alizadeh A.A."
            ],
            "cit_count": 429,
            "doi": "10.1038/nmeth.3337",
            "journal": "Nature Methods",
            "title": "Robust enumeration of cell subsets from tissue expression profiles",
            "type": "Other",
            "year": "2015-04-29"
        },
        {
            "abstract": "© 2017 Andrew E Teschendorff. A major challenge faced by epigenome-wide association studies (EWAS) is cell-type heterogeneity. As many EWAS have already demonstrated, adjusting for changes in cell-type composition can be critical when analyzing and interpreting findings from such studies. Because of their importance, a great number of different statistical algorithms, which adjust for cell-type composition, have been proposed. Some of the methods are 'reference based' in that they require a priori defined reference DNA methylation profiles of cell types that are present in the tissue of interest, while other algorithms are 'reference free.' At present, however, it is unclear how best to adjust for cell-type heterogeneity, as this may also largely depend on the type of tissue and phenotype being considered. Here, we provide a critical review of the major existing algorithms for correcting cell-type composition in the context of Illumina Infinium Methylation Beadarrays, with the aim of providing useful recommendations to the EWAS community.",
            "authors": [
                "Teschendorff A.E.",
                "Zheng S.C."
            ],
            "cit_count": 18,
            "doi": "10.2217/epi-2016-0153",
            "journal": "Epigenomics",
            "title": "Cell-type deconvolution in epigenome-wide association studies: A review and recommendations",
            "type": "Other",
            "year": "2017-05-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:epidish",
        "biotoolsID": "epidish",
        "description": "It infers the proportions of a priori known cell subtypes present in a sample representing a mixture of such cell-types. Inference proceeds via one of 3 methods (Robust Partial Correlations-RPC, Cibersort (CBS), Constrained Projection (CP)), as determined by user.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/EpiDISH.html",
        "name": "EpiDISH",
        "version": [
            "1.2.0"
        ]
    }
}