{
    "additionDate": "2021-01-18T07:37:29Z",
    "biotoolsCURIE": "biotools:ckat",
    "biotoolsID": "ckat",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "nzhao10@jhu.edu",
            "name": "Ni Zhao",
            "typeEntity": "Person"
        },
        {
            "email": "judong.shen@merck.com",
            "name": "Judong Shen",
            "typeEntity": "Person"
        }
    ],
    "description": "Composite Kernel Association Test (CKAT) is a R package for flexible and robust kernel machine based approach to jointly test the genetic main effect and gene-treatment interaction effect for a set of single-nucleotide polymorphisms (SNPs) in pharmacogenetics (PGx) assessments embedded within randomized clinical trials.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "DNA testing",
                    "uri": "http://edamontology.org/operation_3920"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/package=CKAT",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-11T19:45:18Z",
    "license": "GPL-2.0",
    "name": "CKAT",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA125",
            "metadata": {
                "abstract": "© 2020 The Author(s). Published by Oxford University Press. All rights reserved.Motivation: It is of substantial interest to discover novel genetic markers that influence drug response in order to develop personalized treatment strategies that maximize therapeutic efficacy and safety. To help enable such discoveries, we focus on testing the association between the cumulative effect of multiple single nucleotide polymorphisms (SNPs) in a particular genomic region and a drug response of interest. However, the currently existing methods are either computational inefficient or not able to control type I error and provide decent power for whole exome or genome analysis in Pharmacogenetics (PGx) studies with small sample sizes. Results: In this article, we propose the Composite Kernel Association Test (CKAT), a flexible and robust kernel machine-based approach to jointly test the genetic main effect and SNP-treatment interaction effect for SNP-sets in Pharmacogenetics (PGx) assessments embedded within randomized clinical trials. An analytic procedure is developed to accurately calculate the P-value so that computationally extensive procedures (e.g. permutation or perturbation) can be avoided. We evaluate CKAT through extensive simulation studies and application to the gene-level association test of the reduction in Clostridium difficile infection recurrence in patients treated with bezlotoxumab. The results demonstrate that the proposed CKAT controls type I error well for PGx studies, is efficient for whole exome/genome association analysis and provides better power performance than existing methods across multiple scenarios.",
                "authors": [
                    {
                        "name": "Zhang H."
                    },
                    {
                        "name": "Zhao N."
                    },
                    {
                        "name": "Mehrotra D.V."
                    },
                    {
                        "name": "Shen J."
                    }
                ],
                "date": "2020-05-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Composite Kernel Association Test (CKAT) for SNP-set joint assessment of genotype and genotype-by-treatment interaction in Pharmacogenetics studies"
            },
            "pmid": "32101275"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Pharmacogenomics",
            "uri": "http://edamontology.org/topic_0208"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        }
    ]
}