{
    "additionDate": "2017-08-03T19:02:45Z",
    "biotoolsCURIE": "biotools:threader",
    "biotoolsID": "threader",
    "credit": [
        {
            "email": "d.jones@cs.ucl.ac.uk",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://bioinf.cs.ucl.ac.uk/"
        }
    ],
    "description": "A software of threading which is an approach to fold recognition which used a detailed 3-D representation of protein structure. The idea was to physically “thread” a sequence of amino acid side chains onto a backbone structure (a fold) and to evaluate this proposed 3-D structure using a set of pair potentials and (importantly) a separate solvation potential.",
    "documentation": [
        {
            "type": "User manual",
            "url": "http://bioinfadmin.cs.ucl.ac.uk/downloads/threader/manual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                }
            ]
        }
    ],
    "homepage": "http://bioinf.cs.ucl.ac.uk/?id=747",
    "lastUpdate": "2018-12-10T12:58:46Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/threader-3-51-protein-fold-recognition-threading.html"
        }
    ],
    "name": "THREADER",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Analysis of the results of the recent protein structure prediction experiment for our method shows that we achieved a high level of success, Of the 18 available prediction targets of known structure, the assessors have identified 11 chains which either entirely match a previously known fold, or which partially match a substantial region of a known fold. Of these 11 chains, we made predictions for 9, and correctly assigned the folds in 5 cases. We have also identified a further 2 chains which also partially match known folds, and both of these were correctly predicted. The success rate for our method under blind testing is therefore 7 out of 11 chains. A further 2 folds could have easily been recognized but failed due to either overzealous filtering of potential matches, or to simple human error on our part. One of the two targets for which we did not submit a prediction, prosubtilisin, would not have been recognized by our usual criteria, but even in this case, it is possible that a correct prediction could have been made by considerin a combination of pairwise energy and solvation energy Z‐scores. Inspection of the threading alignments for the (αβ) 8 barrels provides clues as to how fold recognition by threading works, in that these folds are recognized by parts rather than as a whole. The prospects for developing sequence threading technology further is discussed. © 1995 Wiley‐Liss, Inc. Copyright © 1995 Wiley‐Liss, Inc.",
                "authors": [
                    {
                        "name": "Jones D.T."
                    },
                    {
                        "name": "Miller R.T."
                    },
                    {
                        "name": "Thornton J.M."
                    }
                ],
                "citationCount": 72,
                "date": "1995-01-01T00:00:00Z",
                "journal": "Proteins: Structure, Function, and Bioinformatics",
                "title": "Successful protein fold recognition by optimal sequence threading validated by rigorous blind testing"
            },
            "pmid": "8710831"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        }
    ],
    "validated": 1
}