
{
    "credit": [
        {
            "email": "jhihrong.lin@gmail.com",
            "name": "Jhih-Rong Lin",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://mleg.cse.sc.edu/NIpredict/contact.htm"
        },
        {
            "email": "jianjunh@cse.sc.edu",
            "name": "Jianjun Hu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://mleg.cse.sc.edu/NIpredict/contact.htm"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://mleg.cse.sc.edu/NIpredict/Usage.htm"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Cell biology",
                "uri": "http://edamontology.org/topic_2229"
            },
            {
                "term": "Machine learning",
                "uri": "http://edamontology.org/topic_3474"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/nipredict-nuclear-import-activity-predictor-based-on-nls-import-receptor-interaction.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2014 Wiley Periodicals, Inc. The binding affinity between a nuclear localization signal (NLS) and its import receptor is closely related to corresponding nuclear import activity. PTM-based modulation of the NLS binding affinity to the import receptor is one of the most understood mechanisms to regulate nuclear import of proteins. However, identification of such regulation mechanisms is challenging due to the difficulty of assessing the impact of PTM on corresponding nuclear import activities. In this study we proposed NIpredict, an effective algorithm to predict nuclear import activity given its NLS, in which molecular interaction energy components (MIECs) were used to characterize the NLS-import receptor interaction, and the support vector regression machine (SVR) was used to learn the relationship between the characterized NLS-import receptor interaction and the corresponding nuclear import activity. Our experiments showed that nuclear import activity change due to NLS change could be accurately predicted by the NIpredict algorithm. Based on NIpredict, we developed a systematic framework to identify potential PTM-based nuclear import regulations for human and yeast nuclear proteins. Application of this approach has identified the potential nuclear import regulation mechanisms by phosphorylation of two nuclear proteins including SF1 and ORC6.",
            "authors": [
                "Lin J.-R.",
                "Liu Z.",
                "Hu J."
            ],
            "cit_count": 1,
            "journal": "Proteins: Structure, Function and Bioinformatics",
            "pmid": "25043850",
            "title": "Computational identification of post-translational modification-based nuclear import regulations by characterizing nuclear localization signal-import receptor interaction",
            "year": "2014-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:nipredict",
        "biotoolsID": "nipredict",
        "description": "Method to predict nuclear import activity based on characterization of NLS-import receptor interaction using molecular interaction energy components (MIECs).",
        "homepage": "http://mleg.cse.sc.edu/NIpredict/",
        "name": "NIpredict"
    }
}