{
    "additionDate": "2021-01-18T12:25:56Z",
    "biotoolsCURIE": "biotools:3d-rna-seq",
    "biotoolsID": "3d-rna-seq",
    "confidence_flag": "tool",
    "description": "3D RNA-seq appA powerful and flexible tool for rapid and accurate differential expression and alternative splicing analysis of RNA-seq data for biologists.\n\n3D RNA-seq is currently under a dual-licensing model.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Alternative splicing prediction",
                    "uri": "http://edamontology.org/operation_0264"
                },
                {
                    "term": "RNA-Seq analysis",
                    "uri": "http://edamontology.org/operation_3680"
                },
                {
                    "term": "RNA-Seq quantification",
                    "uri": "http://edamontology.org/operation_3800"
                },
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                }
            ]
        }
    ],
    "homepage": "https://3drnaseq.hutton.ac.uk/app_direct/3DRNAseq/",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-19T10:43:07Z",
    "name": "3D RNA-seq",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1080/15476286.2020.1858253",
            "metadata": {
                "abstract": "© 2020 The Author(s). Published by Informa UK Limited, trading as Taylor & Francis Group.RNA-sequencing (RNA-seq) analysis of gene expression and alternative splicing should be routine and robust but is often a bottleneck for biologists because of different and complex analysis programs and reliance on specialized bioinformatics skills. We have developed the ‘3D RNA-seq’ App, an R shiny App and web-based pipeline for the comprehensive analysis of RNA-seq data from any organism. It represents an easy-to-use, flexible and powerful tool for analysis of both gene and transcript-level gene expression to identify differential gene/transcript expression, differential alternative splicing and differential transcript usage (3D) as well as isoform switching from RNA-seq data. 3D RNA-seq integrates state-of-the-art differential expression analysis tools and adopts best practice for RNA-seq analysis. The program is designed to be run by biologists with minimal bioinformatics experience (or by bioinformaticians) allowing lab scientists to analyse their RNA-seq data. It achieves this by operating through a user-friendly graphical interface which automates the data flow through the programs in the pipeline. The comprehensive analysis performed by 3D RNA-seq is extremely rapid and accurate, can handle complex experimental designs, allows user setting of statistical parameters, visualizes the results through graphics and tables, and generates publication quality figures such as heat-maps, expression profiles and GO enrichment plots. The utility of 3D RNA-seq is illustrated by analysis of data from a time-series of cold-treated Arabidopsis plants and from dexamethasone-treated male and female mouse cortex and hypothalamus data identifying dexamethasone-induced sex- and brain region-specific differential gene expression and alternative splicing.",
                "authors": [
                    {
                        "name": "Guo W."
                    },
                    {
                        "name": "Tzioutziou N.A."
                    },
                    {
                        "name": "Stephen G."
                    },
                    {
                        "name": "Milne I."
                    },
                    {
                        "name": "Calixto C.P.G."
                    },
                    {
                        "name": "Waugh R."
                    },
                    {
                        "name": "Brown J.W.S."
                    },
                    {
                        "name": "Zhang R."
                    }
                ],
                "citationCount": 4,
                "date": "2020-01-01T00:00:00Z",
                "journal": "RNA Biology",
                "title": "3D RNA-seq: a powerful and flexible tool for rapid and accurate differential expression and alternative splicing analysis of RNA-seq data for biologists"
            },
            "pmid": "33345702"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ]
}