
{
    "credit": [
        {
            "name": "Contact Form",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://feedback.wishartlab.com/?site=small%20molecule%20pathway%20database"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://smpdb.ca/about"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                },
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Protein quaternary structure prediction",
                    "uri": "http://edamontology.org/operation_3350"
                },
                {
                    "term": "Gene to pathway mapping",
                    "uri": "http://edamontology.org/operation_0533"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Small molecules",
                "uri": "http://edamontology.org/topic_0154"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Endocrinology and metabolism",
                "uri": "http://edamontology.org/topic_3407"
            },
            {
                "term": "Metabolomics",
                "uri": "http://edamontology.org/topic_3172"
            },
            {
                "term": "Pathology",
                "uri": "http://edamontology.org/topic_0634"
            }
        ]
    },
    "publication": [
        {
            "abstract": "The Small Molecule Pathway Database (SMPDB) is an interactive, visual database containing more than 350 small-molecule pathways found in humans. More than 2/3 of these pathways (>280) are not found in any other pathway database. SMPDB is designed specifically to support pathway elucidation and pathway discovery in clinical metabolomics, transcriptomics, proteomics and systems biology. SMPDB provides exquisitely detailed, hyperlinked diagrams of human metabolic pathways, metabolic disease pathways, metabolite signaling pathways and drug-action pathways. All SMPDB pathways include information on the relevant organs, organelles, subcellular compartments, protein cofactors, protein locations, metabolite locations, chemical structures and protein quaternary structures. Each small molecule is hyperlinked to detailed descriptions contained in the Human Metabolome Database (HMDB) or DrugBank and each protein or enzyme complex is hyperlinked to UniProt. All SMPDB pathways are accompanied with detailed descriptions, providing an overview of the pathway, condition or processes depicted in each diagram. The database is easily browsed and supports full text searching. Users may query SMPDB with lists of metabolite names, drug names, genes/protein names, SwissProt IDs, GenBank IDs, Affymetrix IDs or Agilent microarray IDs. These queries will produce lists of matching pathways and highlight the matching molecules on each of the pathway diagrams. Gene, metabolite and protein concentration data can also be visualized through SMPDB's mapping interface. All of SMPDB's images, image maps, descriptions and tables are downloadable. SMPDB is available at: http://www.smpdb.ca. © The Author(s) 2009. Published by Oxford University Press.",
            "authors": [
                "Frolkis A.",
                "Knox C.",
                "Lim E.",
                "Jewison T.",
                "Law V.",
                "Hau D.D.",
                "Liu P.",
                "Gautam B.",
                "Ly S.",
                "Guo A.C.",
                "Xia J.",
                "Liang Y.",
                "Shrivastava S.",
                "Wishart D.S."
            ],
            "cit_count": 129,
            "journal": "Nucleic Acids Research",
            "pmid": "19948758",
            "title": "SMPDB: The small molecule pathway database",
            "year": "2009-11-30"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:smpdb",
        "biotoolsID": "smpdb",
        "description": "Interactive, visual database containing more than 350 small-molecule pathways found in humans. It is designed specifically to support pathway elucidation and pathway discovery in clinical metabolomics, transcriptomics, proteomics and systems biology. It provides exquisitely detailed, hyperlinked diagrams of human metabolic pathways, metabolic disease pathways, metabolite signaling pathways and drug-action pathways.",
        "homepage": "http://www.smpdb.ca",
        "name": "SMPDB"
    }
}