{
    "additionDate": "2018-07-30T09:59:16Z",
    "biotoolsCURIE": "biotools:mggp",
    "biotoolsID": "mggp",
    "credit": [
        {
            "email": "rafaelvalenteveiga@gmail.com",
            "name": "Rafael V. Veiga",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "It has shown that infections, psychosocial, nutritional, hygiene, and socioeconomic factors may be related in such an intricate way, that could be hardly detected using traditional regression based epidemiological techniques.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/ciml/ciml-lib/blob/master/README"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Classification",
                    "uri": "http://edamontology.org/operation_2990"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ciml/ciml-lib",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "MGGP",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "shadi.m",
    "publication": [
        {
            "doi": "10.1186/s12859-018-2233-z",
            "metadata": {
                "abstract": "© 2018 The Author(s).Background: Asthma and allergies prevalence increased in recent decades, being a serious global health problem. They are complex diseases with strong contextual influence, so that the use of advanced machine learning tools such as genetic programming could be important for the understanding the causal mechanisms explaining those conditions. Here, we applied a multiobjective grammar-based genetic programming (MGGP) to a dataset composed by 1047 subjects. The dataset contains information on the environmental, psychosocial, socioeconomics, nutritional and infectious factors collected from participating children. The objective of this work is to generate models that explain the occurrence of asthma, and two markers of allergy: presence of IgE antibody against common allergens, and skin prick test positivity for common allergens (SPT). Results: The average of the accuracies of the models for asthma higher in MGGP than C4.5. IgE were higher in MGGP than in both, logistic regression and C4.5. MGGP had levels of accuracy similar to RF, but unlike RF, MGGP was able to generate models that were easy to interpret. Conclusions: MGGP has shown that infections, psychosocial, nutritional, hygiene, and socioeconomic factors may be related in such an intricate way, that could be hardly detected using traditional regression based epidemiological techniques. The algorithm MGGP was implemented in c ++ and is available on repository: http://bitbucket.org/ciml-ufjf/ciml-lib.",
                "authors": [
                    {
                        "name": "Veiga R.V."
                    },
                    {
                        "name": "Barbosa H.J.C."
                    },
                    {
                        "name": "Bernardino H.S."
                    },
                    {
                        "name": "Freitas J.M."
                    },
                    {
                        "name": "Feitosa C.A."
                    },
                    {
                        "name": "Matos S.M.A."
                    },
                    {
                        "name": "Alcantara-Neves N.M."
                    },
                    {
                        "name": "Barreto M.L."
                    }
                ],
                "citationCount": 7,
                "date": "2018-06-26T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Multiobjective grammar-based genetic programming applied to the study of asthma and allergy epidemiology"
            },
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1016/j.jpdc.2017.06.017",
            "metadata": {
                "abstract": "© 2017 Elsevier Inc.Grammatical Evolution (GE) is a bio-inspired metaheuristic capable of evolving programs in an arbitrary language using a formal grammar. Among the major applications of the technique, the automatic inference of models from data can be highlighted. As with other genetic programming techniques, GE has a high computational cost. However, the algorithm has steps that can be computed independently, enabling the use of parallel computing to reduce the execution time and, consequently, making it possible its application to larger and more complex problems. Here, models of massively parallel computation for GE are studied and proposed using OpenCL, a framework for the creation of parallel algorithms in heterogeneous computing environments. Computational experiments were conducted to analyze the performance of an implementation using GPUs (Graphics Processing Units), when compared to a sequential implementation in CPUs (Central Processing Units). Finally, speedups of up to 528× were achieved, when all steps are performed in parallel in a GPU.",
                "authors": [
                    {
                        "name": "Russo I.L.S."
                    },
                    {
                        "name": "Bernardino H.S."
                    },
                    {
                        "name": "Barbosa H.J.C."
                    }
                ],
                "citationCount": 3,
                "date": "2017-11-01T00:00:00Z",
                "journal": "Journal of Parallel and Distributed Computing",
                "title": "A massively parallel Grammatical Evolution technique with OpenCL"
            },
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ],
    "validated": 1
}