{"credit":[{"email":"y-zheng@northwestern.edu","name":"Yinan Zheng","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"url":"http://bioconductor.org/packages/release/bioc/manuals/REMP/man/REMP.pdf"}],"download":[{"url":"http://bioconductor.org/packages/release/bioc/src/contrib/REMP_1.4.0.tar.gz"}],"function":[{"operation":[{"term":"Alignment","uri":"http://edamontology.org/operation_2928"}]},{"operation":[{"term":"Differentially-methylated region identification","uri":"http://edamontology.org/operation_3809"}]},{"operation":[{"term":"Gene prediction","uri":"http://edamontology.org/operation_2454"}]},{"operation":[{"term":"Standardisation and normalisation","uri":"http://edamontology.org/operation_3435"}]},{"operation":[{"term":"Validation","uri":"http://edamontology.org/operation_2428"}]}],"labels":{"collectionID":["BioConductor"],"language":["R"],"license":"GPL-3.0","operatingSystem":["Linux","Windows","Mac"],"toolType":["Library"],"topic":[{"term":"Epigenetics","uri":"http://edamontology.org/topic_3295"},{"term":"Microarray experiment","uri":"http://edamontology.org/topic_3518"},{"term":"Sequencing","uri":"http://edamontology.org/topic_3168"}]},"link":[{"type":"MIRROR","url":"http://bioconductor.org/packages/REMP/"},{"type":"MIRROR","url":"https://github.com/YinanZheng/REMP"},{"type":"ISSUE_TRACKER","url":"https://github.com/YinanZheng/REMP/issues"},{"type":"REPOSITORY","url":"https://git.bioconductor.org/packages/REMP"}],"publication":[{"abstract":"© The Author(s) 2017. DNA methylation in repetitive elements (RE) suppresses their mobility and maintains genomic stability, and decreases in it are frequently observed in tumor and/or surrogate tissues. Averaging methylation across RE in genome is widely used to quantify globalmethylation. However, methylation may vary in specific RE and play diverse roles in disease development, thus averaging methylation across RE may lose significant biological information. The ambiguous mapping of short reads by and high cost of current bisulfite sequencing platforms make them impractical for quantifying locus-specific RE methylation. Although microarray-based approaches (particularly Illumina's Infinium methylation arrays) provide cost-effective and robust genome-wide methylation quantification, the number of interrogated CpGs in RE remains limited.We report a random forest-based algorithm (and corresponding R package, REMP) that can accurately predict genome-wide locus-specific RE methylation based on Infinium array profiling data. We validated its prediction performance using alternative sequencing and microarray data. Testing its clinical utility with The Cancer Genome Atlas data demonstrated that our algorithm offers more comprehensively extended locus-specific RE methylation information that can be readily applied to large human studies in a cost-effective manner. Our work has the potential to improve our understanding of the role of global methylation in human diseases, especially cancer.","authors":["Zheng Y.","Joyce B.T.","Liu L.","Zhang Z.","Kibbe W.A.","Zhang W.","Hou L."],"cit_count":3,"doi":"10.1093/nar/gkx587","journal":"Nucleic Acids Research","title":"Prediction of genome-wide DNA methylation in repetitive elements","type":"Primary","year":"2017-09-01"}],"summary":{"biotoolsCURIE":"biotools:remp","biotoolsID":"remp","description":"Machine learning-based tools to predict DNA methylation of locus-specific repetitive elements (RE) by learning surrounding genetic and epigenetic information. These tools provide genomewide and single-base resolution of DNA methylation prediction on RE that are difficult to measure using array-based or sequencing-based platforms, which enables epigenome-wide association study (EWAS) and differentially methylated region (DMR) analysis on RE.","homepage":"http://bioconductor.org/packages/release/bioc/html/REMP.html","name":"REMP","version":["1.4.0"]}}