{
    "additionDate": "2020-01-14T19:49:10Z",
    "biotoolsCURIE": "biotools:aesthetic_damage",
    "biotoolsID": "aesthetic_damage",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "nsakagut@usp.br",
            "name": "Nelson Massanobu Sakaguti",
            "orcidid": "https://orcid.org/0000-0001-7053-0697",
            "typeEntity": "Person"
        }
    ],
    "description": "HOMEPAGE LINK BROKEN \nDevelopment of a computer-aided design software for the quantitative evaluation of aesthetic damage.\n\nDiagnosis reports AIPE (Aesthetic damage impact/impairment assessment).\n\nThis aesthetic damage assessment program is an open-access software ×.\n\nAttention! All fields are required!.\n\nThis aesthetic damage assessment program is an open-access software (the user may register online only). It was developed by University of São Paulo School of Dentistry in a partnership with University of São Paulo Engineering School - São Carlos campus.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'aesthetic damage evaluation'",
    "download": [
        {
            "type": "Source code",
            "url": "https://doi.org/10.1371/journal.pone.0226322.s001"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "DNA profiling",
                    "uri": "http://edamontology.org/operation_3894"
                }
            ]
        }
    ],
    "homepage": "https://www.aestheticdamage.com",
    "lastUpdate": "2020-12-09T12:31:31.256877Z",
    "name": "aesthetic damage",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0226322",
            "metadata": {
                "abstract": "© 2019 Sakaguti et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Concerns associated with the assessment of aesthetic damage or injury raise critical difficulties, such as the scarcity of methodology and standardization that may result in fundamental precepts to establish impartial forms of compensation and aiming the total reparation of bodily injury. The complexity of the aesthetic damage evaluation is associated with the confluence of legal and technical perspectives and expert subjectivity while conducting examination and writing a report. Experts face additional difficulties associated with the objectivity while assessing aesthetic damage, independently on its location or expert skills, due to complex details observed in these lesions. Another situation in the clinical area, doctors (mainly plastic surgeons) and dentists could show the improvement or not, of the aesthetic condition to the patients. In health related areas, the use of information technology has contributed to increase the number of appropriate diagnoses, besides promoting quality, efficiency and satisfaction to health care providers. In order to make this assessment more objective, a technological tool was developed to aid experts in the evaluation of aesthetic damage and report elaboration. The objective was to develop computer-aided design software for aesthetic damage quantification/evaluation that is accessible via internet to be applied as a complementary report on body aesthetic damage. The software uses as a parameter the AIPE method, translated transculturally from Spanish to Portuguese and English. The present study allowed the construction of open access auxiliary software for the evaluation of corporal aesthetic damage. Its use is facilitated by intuitive and interactive filling, and the text may be customized by the user. It transforms the report into PDF and saves all evaluations already done in its own file. Information is encrypted for added security and confidentiality.",
                "authors": [
                    {
                        "name": "Sakaguti N.M."
                    },
                    {
                        "name": "Fernandes M.M."
                    },
                    {
                        "name": "Mazzilli L.E.N."
                    },
                    {
                        "name": "Plana J.A.C."
                    },
                    {
                        "name": "Bouchardet F.C.H."
                    },
                    {
                        "name": "De Oliveira R.N."
                    }
                ],
                "date": "2019-12-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Development of a computer-aided design software for the quantitative evaluation of aesthetic damage"
            },
            "pmcid": "PMC6919621",
            "pmid": "31851712"
        }
    ],
    "topic": [
        {
            "term": "Dentistry",
            "uri": "http://edamontology.org/topic_3405"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        }
    ]
}