{
    "additionDate": "2019-11-14T18:12:50Z",
    "biotoolsCURIE": "biotools:AbLIFT",
    "biotoolsID": "AbLIFT",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "sarel@weizmann.ac.il",
            "name": "Sarel J. Fleishman",
            "orcidid": "https://orcid.org/0000-0003-3177-7560",
            "typeEntity": "Person"
        }
    ],
    "description": "An web application that designs multipoint core mutations to improve contacts between specific Fv light and heavy chains.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Polymorphism detection",
                    "uri": "http://edamontology.org/operation_3202"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "homepage": "http://AbLIFT.weizmann.ac.il",
    "lastUpdate": "2021-01-11T14:47:27Z",
    "name": "AbLIFT",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1007207",
            "metadata": {
                "abstract": "© 2019 Warszawski et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Antibodies developed for research and clinical applications may exhibit suboptimal stability, expressibility, or affinity. Existing optimization strategies focus on surface mutations, whereas natural affinity maturation also introduces mutations in the antibody core, simultaneously improving stability and affinity. To systematically map the mutational tolerance of an antibody variable fragment (Fv), we performed yeast display and applied deep mutational scanning to an anti-lysozyme antibody and found that many of the affinity-enhancing mutations clustered at the variable light-heavy chain interface, within the antibody core. Rosetta design combined enhancing mutations, yielding a variant with tenfold higher affinity and substantially improved stability. To make this approach broadly accessible, we developed AbLIFT, an automated web server that designs multipoint core mutations to improve contacts between specific Fv light and heavy chains (http://AbLIFT.weizmann.ac.il). We applied AbLIFT to two unrelated antibodies targeting the human antigens VEGF and QSOX1. Strikingly, the designs improved stability, affinity, and expression yields. The results provide proof-of-principle for bypassing laborious cycles of antibody engineering through automated computational affinity and stability design.",
                "authors": [
                    {
                        "name": "Warszawski S."
                    },
                    {
                        "name": "Katz A.B."
                    },
                    {
                        "name": "Lipsh R."
                    },
                    {
                        "name": "Khmelnitsky L."
                    },
                    {
                        "name": "Nissan G.B."
                    },
                    {
                        "name": "Javitt G."
                    },
                    {
                        "name": "Dym O."
                    },
                    {
                        "name": "Unger T."
                    },
                    {
                        "name": "Knop O."
                    },
                    {
                        "name": "Albeck S."
                    },
                    {
                        "name": "Diskin R."
                    },
                    {
                        "name": "Fass D."
                    },
                    {
                        "name": "Sharon M."
                    },
                    {
                        "name": "Fleishman S.J."
                    }
                ],
                "citationCount": 6,
                "date": "2019-01-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Optimizing antibody affinity and stability by the automated design of the variable light-heavy chain interfaces"
            },
            "pmcid": "PMC6728052",
            "pmid": "31442220"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        }
    ],
    "validated": 1
}