
{
    "credit": [
        {
            "email": "mtmorgan@fhcrc.org",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://med.stanford.edu/tanglab/software/saber.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Ancestral reconstruction",
                    "uri": "http://edamontology.org/operation_3745"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R",
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Statistics and probability",
                "uri": "http://edamontology.org/topic_2269"
            },
            {
                "term": "Phylogenomics",
                "uri": "http://edamontology.org/topic_0194"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/saber-1-5-inferring-locus-specific-ancestry-in-admixed-individuals.html"
        }
    ],
    "publication": [
        {
            "abstract": "A chromosome in an individual of recently admixed ancestry resembles a mosaic of chromosomal segments, or ancestry blocks, each derived from a particular ancestral population. We consider the problem of inferring ancestry along the chromosomes in an admixed individual and thereby delineating the ancestry blocks. Using a simple population model, we infer gene-flow history in each individual. Compared with existing methods, which are based on a hidden Markov model, the Markov-hidden Markov model (MHMM) we propose has the advantage of accounting for the background linkage disequilibrium (LD) that exists in ancestral populations. When there are more than two ancestral groups, we allow each ancestral population to admix at a different time in history. We use simulations to illustrate the accuracy of the inferred ancestry as well as the importance of modeling the background LD; not accounting for background LD between markers may mislead us to false inferences about mixed ancestry in an indigenous population. The MHMM makes it possible to identify genomic blocks of a particular ancestry by use of any high-density single-nucleotide-polymorphism panel. One application of our method is to perform admixture mapping without genotyping special ancestry-informative-marker panels. © 2006 by The American Society of Human Genetics. All rights reserved.",
            "authors": [
                "Tang H.",
                "Coram M.",
                "Wang P.",
                "Zhu X.",
                "Risch N."
            ],
            "cit_count": 163,
            "journal": "American Journal of Human Genetics",
            "pmid": "16773560",
            "title": "Reconstructing genetic ancestry blocks in admixed individuals",
            "year": "2006-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:saber",
        "biotoolsID": "saber",
        "description": "The tool implements a Markov-Hidden Markov Model for inferring locus-specific ancestry in admixed individuals",
        "homepage": "http://med.stanford.edu/tanglab/software/saber.html",
        "name": "SABER"
    }
}