{
    "additionDate": "2022-10-11T06:40:47.506045Z",
    "biotoolsCURIE": "biotools:g-dirt",
    "biotoolsID": "g-dirt",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Kuldeep Singh"
        },
        {
            "name": "Tanmaya Kumar Sahu"
        }
    ],
    "description": "A web server for identification and removal of duplicate germplasms based on identity-by-state analysis using single nucleotide polymorphism genotyping data.",
    "download": [
        {
            "type": "Downloads page",
            "url": "http://webtools.nbpgr.ernet.in/gdirt/downloads.php"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dendrogram visualisation",
                    "uri": "http://edamontology.org/operation_2938"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                }
            ]
        }
    ],
    "homepage": "http://webtools.nbpgr.ernet.in/gdirt/",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T15:27:39.269545Z",
    "name": "G-DIRT",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/bib/bbac348",
            "metadata": {
                "abstract": "Maintaining duplicate germplasms in genebanks hampers effective conservation and utilization of genebank resources. The redundant germplasm adds to the cost of germplasm conservation by requiring a large proportion of the genebank financial resources towards conservation rather than enriching the diversity. Besides, genome-wide-association analysis using an association panel with over-represented germplasms can be biased resulting in spurious marker-trait associations. The conventional methods of germplasm duplicate removal using passport information suffer from incomplete or missing passport information and data handling errors at various stages of germplasm enrichment. This limitation is less likely in the case of genotypic data. Therefore, we developed a web-based tool, Germplasm Duplicate Identification and Removal Tool (G-DIRT), which allows germplasm duplicate identification based on identity-by-state analysis using single-nucleotide polymorphism genotyping information along with pre-processing of genotypic data. A homozygous genotypic difference threshold of 0.1% for germplasm duplicates has been determined using tetraploid wheat genotypic data with 94.97% of accuracy. Based on the genotypic difference, the tool also builds a dendrogram that can visually depict the relationship between genotypes. To overcome the constraint of high-dimensional genotypic data, an offline version of G-DIRT in the interface of R has also been developed. The G-DIRT is expected to help genebank curators, breeders and other researchers across the world in identifying germplasm duplicates from the global genebank collections by only using the easily sharable genotypic data instead of physically exchanging the seeds or propagating materials. The web server will complement the existing methods of germplasm duplicate identification based on passport or phenotypic information being freely accessible at http://webtools.nbpgr.ernet.in/gdirt/.",
                "authors": [
                    {
                        "name": "Jacob S.R."
                    },
                    {
                        "name": "Jha S.K."
                    },
                    {
                        "name": "Kumar S."
                    },
                    {
                        "name": "Mittal S."
                    },
                    {
                        "name": "Sahu T.K."
                    },
                    {
                        "name": "Singh A.K."
                    },
                    {
                        "name": "Singh K."
                    }
                ],
                "citationCount": 4,
                "date": "2022-09-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "G-DIRT: A web server for identification and removal of duplicate germplasms based on identity-by-state analysis using single nucleotide polymorphism genotyping data"
            },
            "pmid": "36040109"
        }
    ],
    "toolType": [
        "Library",
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ],
    "validated": 1
}
