{
    "additionDate": "2021-01-18T09:19:47Z",
    "biotoolsCURIE": "biotools:mtl-bc-lbc-bioner",
    "biotoolsID": "mtl-bc-lbc-bioner",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhangyang07@hit.edu.cn",
            "name": "Yang Zhang",
            "typeEntity": "Person"
        }
    ],
    "description": "Dataset-aware multi-task learning approaches for biomedical named entity recognition.\n\nNamed entity recognition is a critical and fundamental task for biomedical text mining. Recently, researchers have focused on exploiting deep neural networks for biomedical named entity recognition (Bio-NER). The performance of deep neural networks on a single dataset mostly depends on data quality and quantity while high-quality data tends to be limited in size. To alleviate task-specific data limitation, some studies explored the multi-task learning (MTL) for Bio-NER and achieved state-of-the-art performance. However, these MTL methods did not make full use of information from various datasets of Bio-NER. The performance of state-of-the-art MTL method was significantly limited by the number of training datasets",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "homepage": "https://github.com/zmmzGitHub/MTL-BC-LBC-BioNER",
    "lastUpdate": "2021-02-04T12:50:47Z",
    "name": "MTL-BC-LBC-BioNER",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA515",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.comMotivation: Named entity recognition is a critical and fundamental task for biomedical text mining. Recently, researchers have focused on exploiting deep neural networks for biomedical named entity recognition (Bio-NER). The performance of deep neural networks on a single dataset mostly depends on data quality and quantity while high-quality data tends to be limited in size. To alleviate task-specific data limitation, some studies explored the multi-task learning (MTL) for Bio-NER and achieved state-of-the-art performance. However, these MTL methods did not make full use of information from various datasets of Bio-NER. The performance of state-of-the-art MTL method was significantly limited by the number of training datasets. Results: We propose two dataset-aware MTL approaches for Bio-NER which jointly train all models for numerous Bio-NER datasets, thus each of these models could discriminatively exploit information from all of related training datasets. Both of our two approaches achieve substantially better performance compared with the state-of-the-art MTL method on 14 out of 15 Bio-NER datasets. Furthermore, we implemented our approaches by incorporating Bio-NER and biomedical part-of-speech (POS) tagging datasets. The results verify Bio-NER and POS can significantly enhance one another. Availability and implementation: Our source code is available at https://github.com/zmmzGitHub/MTL-BC-LBCBioNER and all datasets are publicly available at https://github.com/cambridgeltl/MTL-Bioinformatics-2016.",
                "authors": [
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Zuo M."
                    }
                ],
                "date": "2020-08-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Dataset-aware multi-task learning approaches for biomedical named entity recognition"
            },
            "pmid": "32415963"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        }
    ]
}
