
{
    "credit": [
        {
            "email": "dibernardo@tigem.it",
            "name": "Diego di Bernardo",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://dibernardo.tigem.it/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://dibernardo.tigem.it/softwares/network-inference-by-reverse-engineering-nir"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "MATLAB"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Systems biology",
                "uri": "http://edamontology.org/topic_2259"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "RNA",
                "uri": "http://edamontology.org/topic_0099"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/nir-network-inference-reverse-engineering.html"
        }
    ],
    "publication": [
        {
            "abstract": "Temporal and spatial gene expression, together with the concentration of proteins and metabolites, is tightly controlled in the cell. This is possible thanks to complex regulatory networks between these different elements. The identification of these networks would be extremely valuable. We developed a novel algorithm to identify a large genetic network, as a set of linear differential equations, starting from measurements of gene expression at steady state following transcriptional perturbations. Experimentally, it is possible to overexpress each of the genes in the network using an episomal expression plasmid and measure the change in mRNA concentration of all the genes, following the perturbation. Computationally, we reduced the identification problem to a multiple linear regression, assuming that the network is sparse. We implemented a heuristic search method in order to apply the algorithm to large networks. The algorithm can correctly identify the network, even in the presence of large noise in the data, and can be used to predict the genes that directly mediate the action of a compound. Our novel approach is experimentally feasible and it is readily applicable to large genetic networks.",
            "authors": [
                "Di Bernardo D.",
                "Gardner T.S.",
                "Collins J.J."
            ],
            "cit_count": 53,
            "journal": "Pacific Symposium on Biocomputing. Pacific Symposium on Biocomputing",
            "pmid": "14992527",
            "title": "Robust identification of large genetic networks.",
            "year": "2004-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:nir",
        "biotoolsID": "nir",
        "description": "In order to estimate the coefficient of the gene interactions NIR solves a linear regression problem for each gene considering a fixed number of k regressors. The regressor set is chosen according the residual sum of square error (RSS) minimization criterion. In this version, this tool exhaustively searches the best regressors in the space of all the possible k-tuples of genes.",
        "homepage": "http://dibernardo.tigem.it/softwares/network-inference-by-reverse-engineering-nir",
        "name": "NIR"
    }
}