{
    "accessibility": "Open access",
    "additionDate": "2022-11-29T22:12:34.976471Z",
    "biotoolsCURIE": "biotools:prot2prot",
    "biotoolsID": "prot2prot",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Jacob D. Durrant",
            "orcidid": "http://orcid.org/0000-0002-5808-4097"
        }
    ],
    "description": "A Deep Learning Model for Rapid, Photorealistic Macromolecular Visualization.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "PDB ID",
                        "uri": "http://edamontology.org/data_1127"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://durrantlab.com/prot2prot",
    "lastUpdate": "2024-11-24T15:20:06.809900Z",
    "license": "Apache-2.0",
    "name": "Prot2Prot",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1007/s10822-022-00471-4",
            "metadata": {
                "abstract": "Molecular visualization is a cornerstone of structural biology, providing insights into the form and function of biomolecules that are difficult to achieve any other way. Scientific analysis, publication, education, and outreach often benefit from photorealistic molecular depictions rendered using advanced computer-graphics programs such as Maya, 3ds Max, and Blender. However, setting up molecular scenes in these programs is laborious even for expert users, and rendering often requires substantial time and computer resources. We have created a deep-learning model called Prot2Prot that quickly imitates photorealistic visualization styles, given a much simpler, easy-to-generate molecular representation. The resulting images are often indistinguishable from images rendered using industry-standard 3D graphics programs, but they can be created in a fraction of the time, even when running in a web browser. To the best of our knowledge, Prot2Prot is the first example of image-to-image translation applied to macromolecular visualization. Prot2Prot is available free of charge, released under the terms of the Apache License, Version 2.0. Users can access a Prot2Prot-powered web app without registration at http://durrantlab.com/prot2prot.",
                "authors": [
                    {
                        "name": "Durrant J.D."
                    }
                ],
                "citationCount": 2,
                "date": "2022-09-01T00:00:00Z",
                "journal": "Journal of Computer-Aided Molecular Design",
                "title": "Prot2Prot: a deep learning model for rapid, photorealistic macromolecular visualization"
            },
            "pmcid": "PMC9512884",
            "pmid": "36008698"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ],
    "validated": 1
}
