{
    "name": "CellNetAnalyzer", 
    "description": "CellNetAnalyzer (CNA) is a MATLAB toolbox providing various computational methods for analyzing structure and function of metabolic, signaling, and regulatory networks. \n\nMetabolic networks can be analyzed by means of stoichiometric and constraint-based modeling techniques while signal transduction and (gene) regulatory networks can be represented and analyzed as logical networks (Boolean or multivalued logic) or as interaction graphs. Computations can be started within a GUI (interactive network maps) or from command line (via API functions).", 
    "homepage": "https://www2.mpi-magdeburg.mpg.de/projects/cna/cna.html", 
    "biotoolsID": "cellnetanalyzer", 
    "biotoolsCURIE": "biotools:cellnetanalyzer", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2497", 
                    "term": "Pathway or network analysis"
                }, 
                {
                    "uri": "http://edamontology.org/operation_3562", 
                    "term": "Network simulation"
                }, 
                {
                    "uri": "http://edamontology.org/operation_3660", 
                    "term": "Metabolic network modelling"
                }, 
                {
                    "uri": "http://edamontology.org/operation_1781", 
                    "term": "Gene regulatory network analysis"
                }, 
                {
                    "uri": "http://edamontology.org/operation_3083", 
                    "term": "Pathway or network visualisation"
                }, 
                {
                    "uri": "http://edamontology.org/operation_2426", 
                    "term": "Modelling and simulation"
                }
            ], 
            "input": [
                {
                    "data": {
                        "uri": "http://edamontology.org/data_0950", 
                        "term": "Mathematical model"
                    }, 
                    "format": [
                        {
                            "uri": "http://edamontology.org/format_2585", 
                            "term": "SBML"
                        }
                    ]
                }
            ], 
            "output": [
                {
                    "data": {
                        "uri": "http://edamontology.org/data_0950", 
                        "term": "Mathematical model"
                    }, 
                    "format": [
                        {
                            "uri": "http://edamontology.org/format_2585", 
                            "term": "SBML"
                        }
                    ]
                }
            ], 
            "note": "Stoichiometric and constraint-based modeling, Boolean modeling, interaction graphs", 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool", 
        "Desktop application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3307", 
            "term": "Computational biology"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "MATLAB"
    ], 
    "license": null, 
    "collectionID": [
        "de.NBI", 
        "denbi-sysbio"
    ], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [
        {
            "url": "https://www2.mpi-magdeburg.mpg.de/projects/cna/download.html", 
            "type": "Downloads page", 
            "note": null, 
            "version": null
        }
    ], 
    "documentation": [
        {
            "url": "https://www2.mpi-magdeburg.mpg.de/projects/cna/manual_cellnetanalyzer.pdf", 
            "type": "Manual", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1186/1752-0509-1-2", 
            "pmid": "17408509", 
            "pmcid": "PMC1847467", 
            "type": "Primary", 
            "version": null, 
            "metadata": null
        }, 
        {
            "doi": null, 
            "pmid": "21315797", 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "An application programming interface for CellNetAnalyzer", 
                "abstract": "CellNetAnalyzer (CNA) is a MATLAB toolbox providing computational methods for studying structure and function of metabolic and cellular signaling networks. In order to allow non-experts to use these methods easily, CNA provides GUI-based interactive network maps as a means of parameter input and result visualization. However, with the availability of high-throughput data, there is a need to make CNA's functionality also accessible in batch mode for automatic data processing. Furthermore, as some algorithms of CNA are of general relevance for network analysis it would be desirable if they could be called as sub-routines by other applications. For this purpose, we developed an API (application programming interface) for CNA allowing users (i) to access the content of network models in CNA, (ii) to use CNA's network analysis capabilities independent of the GUI, and (iii) to interact with the GUI to facilitate the development of graphical plugins.Here we describe the organization of network projects in CNA and the application of the new API functions to these projects. This includes the creation of network projects from scratch, loading and saving of projects and scenarios, and the application of the actual analysis methods. Furthermore, API functions for the import/export of metabolic models in SBML format and for accessing the GUI are described. Lastly, two example applications demonstrate the use and versatile applicability of CNA's API. CNA is freely available for academic use and can be downloaded from http://www.mpi-magdeburg.mpg.de/projects/cna/cna.html. © 2011 Elsevier Ireland Ltd.", 
                "date": "2011-08-01T00:00:00Z", 
                "citationCount": 32, 
                "authors": [
                    {
                        "name": "Klamt S."
                    }, 
                    {
                        "name": "von Kamp A."
                    }
                ], 
                "journal": "BioSystems"
            }
        }, 
        {
            "doi": null, 
            "pmid": "28499817", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Use of CellNetAnalyzer in biotechnology and metabolic engineering", 
                "abstract": "© 2017 The Author(s) Mathematical models of the cellular metabolism have become an essential tool for the optimization of biotechnological processes. They help to obtain a systemic understanding of the metabolic processes in the used microorganisms and to find suitable genetic modifications maximizing the production performance. In particular, methods of stoichiometric and constraint-based modeling are frequently used in the context of metabolic and bioprocess engineering. Since metabolic networks can be complex and comprise hundreds or even thousands of metabolites and reactions, dedicated software tools are required for an efficient analysis. One such software suite is CellNetAnalyzer, a MATLAB package providing, among others, various methods for analyzing stoichiometric and constraint-based metabolic models. CellNetAnalyzer can be used via command-line based operations or via a graphical user interface with embedded network visualizations. Herein we will present key functionalities of CellNetAnalyzer for applications in biotechnology and metabolic engineering and thereby review constraint-based modeling techniques such as metabolic flux analysis, flux balance analysis, flux variability analysis, metabolic pathway analysis (elementary flux modes) and methods for computational strain design.", 
                "date": "2017-11-10T00:00:00Z", 
                "citationCount": 5, 
                "authors": [
                    {
                        "name": "von Kamp A."
                    }, 
                    {
                        "name": "Thiele S."
                    }, 
                    {
                        "name": "Hadicke O."
                    }, 
                    {
                        "name": "Klamt S."
                    }
                ], 
                "journal": "Journal of Biotechnology"
            }
        }
    ], 
    "credit": [
        {
            "name": "Steffen Klamt", 
            "email": "klamt@mpi-magdeburg.mpg.de", 
            "url": "https://www2.mpi-magdeburg.mpg.de/projects/cna/cna.html", 
            "orcidid": "http://orcid.org/0000-0003-2563-7561", 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "klamt", 
    "additionDate": "2017-01-25T12:19:06Z", 
    "lastUpdate": "2019-02-26T13:58:07Z", 
    "editPermission": {
        "type": "group", 
        "authors": [
            "klamt"
        ]
    }, 
    "validated": 0, 
    "homepage_status": 0, 
    "elixir_badge": 0
}