{
    "accessibility": "Open access",
    "additionDate": "2019-05-17T09:09:51Z",
    "biotoolsCURIE": "biotools:eNetXplorer",
    "biotoolsID": "eNetXplorer",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "julian.candia@nih.gov",
            "name": "Julian Candia",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "R package for the quantitative exploration of elastic net families for generalized linear models.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/juliancandia/eNetXplorer"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/package=eNetXplorer",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-06-16T10:55:21Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "eNetXplorer",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12859-019-2778-5",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Regularized generalized linear models (GLMs) are popular regression methods in bioinformatics, particularly useful in scenarios with fewer observations than parameters/features or when many of the features are correlated. In both ridge and lasso regularization, feature shrinkage is controlled by a penalty parameter λ. The elastic net introduces a mixing parameter α to tune the shrinkage continuously from ridge to lasso. Selecting α objectively and determining which features contributed significantly to prediction after model fitting remain a practical challenge given the paucity of available software to evaluate performance and statistical significance. Results: eNetXplorer builds on top of glmnet to address the above issues for linear (Gaussian), binomial (logistic), and multinomial GLMs. It provides new functionalities to empower practical applications by using a cross validation framework that assesses the predictive performance and statistical significance of a family of elastic net models (as α is varied) and of the corresponding features that contribute to prediction. The user can select which quality metrics to use to quantify the concordance between predicted and observed values, with defaults provided for each GLM. Statistical significance for each model (as defined by α) is determined based on comparison to a set of null models generated by random permutations of the response; the same permutation-based approach is used to evaluate the significance of individual features. In the analysis of large and complex biological datasets, such as transcriptomic and proteomic data, eNetXplorer provides summary statistics, output tables, and visualizations to help assess which subset(s) of features have predictive value for a set of response measurements, and to what extent those subset(s) of features can be expanded or reduced via regularization. Conclusions: This package presents a framework and software for exploratory data analysis and visualization. By making regularized GLMs more accessible and interpretable, eNetXplorer guides the process to generate hypotheses based on features significantly associated with biological phenotypes of interest, e.g. to identify biomarkers for therapeutic responsiveness. eNetXplorer is also generally applicable to any research area that may benefit from predictive modeling and feature identification using regularized GLMs. The package is available under GPL-3 license at the CRAN repository, https://CRAN.R-project.org/package=eNetXplorer.",
                "authors": [
                    {
                        "name": "Candia J."
                    },
                    {
                        "name": "Tsang J.S."
                    }
                ],
                "citationCount": 9,
                "date": "2019-04-16T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "ENetXplorer: An R package for the quantitative exploration of elastic net families for generalized linear models"
            },
            "pmcid": "PMC6469092",
            "pmid": "30991955",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ],
    "validated": 1,
    "version": [
        "1.0.2"
    ]
}
