
{
    "credit": [
        {
            "email": "soontide6825@163.com",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.cuilab.cn/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://www.cuilab.cn/sramp"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Methylation analysis",
                    "uri": "http://edamontology.org/operation_3204"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Perl"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Web application"
        ],
        "topic": [
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            },
            {
                "term": "RNA",
                "uri": "http://edamontology.org/topic_0099"
            },
            {
                "term": "Transcriptomics",
                "uri": "http://edamontology.org/topic_3308"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/sramp-sequence-based-rna-adenosine-methylation-site-predictor.html"
        }
    ],
    "publication": [
        {
            "abstract": "© The Author(s) 2016. N6-methyladenosine (m6A) is a prevalent RNA methylation modification involved in the regulation of degradation, subcellular localization, splicing and local conformation changes of RNA transcripts. High-throughput experiments have demonstrated that only a small fraction of the m6A consensus motifs in mammalian transcriptomes are modified. Therefore, accurate identification of RNA m6A sites becomes emergently important. For the above purpose, here a computational predictor of mammalian m6A site named SRAMP is established. To depict the sequence context around m6A sites, SRAMP combines three random forest classifiers that exploit the positional nucleotide sequence pattern, the K-nearest neighbor information and the position-independent nucleotide pair spectrum features, respectively. SRAMP uses either genomic sequences or cDNA sequences as its input. With either kind of input sequence, SRAMP achieves competitive performance in both cross-validation tests and rigorous independent benchmarking tests. Analyses of the informative features and overrepresented rules extracted from the random forest classifiers demonstrate that nucleotide usage preferences at the distal positions, in addition to those at the proximal positions, contribute to the classification. As a public prediction server, SRAMP is freely available at http://www.cuilab.cn/sramp/.",
            "authors": [
                "Zhou Y.",
                "Zeng P.",
                "Li Y.-H.",
                "Zhang Z.",
                "Cui Q."
            ],
            "cit_count": 36,
            "journal": "Nucleic Acids Research",
            "pmid": "26896799",
            "title": "SRAMP: Prediction of mammalian N6-methyladenosine (m6A) sites based on sequence-derived features",
            "year": "2016-06-02"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:sramp",
        "biotoolsID": "sramp",
        "description": "A useful tool to predict m6A modification sites on the RNA sequences",
        "homepage": "http://www.cuilab.cn/sramp",
        "name": "SRAMP"
    }
}