{
    "accessibility": "Open access",
    "additionDate": "2022-07-26T10:18:29.515712Z",
    "biotoolsCURIE": "biotools:pandemoncat",
    "biotoolsID": "pandemoncat",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "antonia.barcelo@udg.edu",
            "name": "Maria A. Barceló",
            "orcidid": "https://orcid.org/0000-0001-9720-690X",
            "typeEntity": "Person"
        },
        {
            "name": "Gerard Giménez-Adsuar"
        },
        {
            "name": "Marc Saez",
            "orcidid": "https://orcid.org/0000-0003-1882-0157"
        },
        {
            "name": "Somnath Chaudhuri",
            "orcidid": "https://orcid.org/0000-0003-4899-1870"
        }
    ],
    "description": "Monitoring the COVID-19 Pandemic in Catalonia, Spain.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Scatter plot plotting",
                    "uri": "http://edamontology.org/operation_2940"
                }
            ]
        }
    ],
    "homepage": "https://www.udg.edu/pandemoncat",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T15:52:31.786220Z",
    "license": "Not licensed",
    "name": "PandemonCAT",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3390/ijerph19084783",
            "metadata": {
                "abstract": "Background: The principal objective of this paper is to introduce an online interactive application that helps in real-time monitoring of the COVID-19 pandemic in Catalonia, Spain (Pan-demonCAT). Methods: This application is designed as a collection of user-friendly dashboards using open-source R software supported by the Shiny package. Results: PandemonCAT reports accumulated weekly updates of COVID-19 dynamics in a geospatial interactive platform for individual basic health areas (ABSs) of Catalonia. It also shows on a georeferenced map the evolution of vaccination campaigns representing the share of population with either one or two shots of the vaccine, for populations of different age groups. In addition, the application reports information about environmental and socioeconomic variables and also provides an interactive interface to visu-alize monthly public mobility before, during, and after the lockdown phases. Finally, we report the smoothed standardized COVID-19 infected cases and mortality rates on maps of basic health areas ABSs and regions of Catalonia. These smoothed rates allow the user to explore geographic patterns in incidence and mortality rates. The visualization of the variables that could have some influence on the spatiotemporal dynamics of the pandemic is demonstrated. Conclusions: We believe the addition of these new dimensions, which is the key innovation of our project, will improve the current understanding of the spread and the impact of COVID-19 in the community. This application can be used as an open tool for consultation by the public of Catalonia and Spain in general. It could also have implications in facilitating the visualization of public health data, allowing timely interpretation due to the unpredictable nature of the pandemic.",
                "authors": [
                    {
                        "name": "Barcelo M.A."
                    },
                    {
                        "name": "Chaudhuri S."
                    },
                    {
                        "name": "Gimenez-Adsuar G."
                    },
                    {
                        "name": "Saez M."
                    }
                ],
                "citationCount": 2,
                "date": "2022-04-01T00:00:00Z",
                "journal": "International Journal of Environmental Research and Public Health",
                "title": "PandemonCAT: Monitoring the COVID-19 Pandemic in Catalonia, Spain"
            },
            "pmcid": "PMC9029369",
            "pmid": "35457649"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ],
    "validated": 1
}
