{
    "additionDate": "2018-05-21T15:05:51Z",
    "biotoolsCURIE": "biotools:solgs",
    "biotoolsID": "solgs",
    "credit": [
        {
            "name": "Contact form",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://cassavabase.org/contact/form"
        }
    ],
    "description": "A web-based tool for genomic selection.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://solgenomics.github.io/sgn/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree generation",
                    "uri": "http://edamontology.org/operation_0323"
                }
            ]
        }
    ],
    "homepage": "https://cassavabase.org/solgs",
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "solGS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/S12859-014-0398-7",
            "metadata": {
                "abstract": "© Tecle et al.; licensee BioMed Central Ltd.Background: Genomic selection (GS) promises to improve accuracy in estimating breeding values and genetic gain for quantitative traits compared to traditional breeding methods. Its reliance on high-throughput genome-wide markers and statistical complexity, however, is a serious challenge in data management, analysis, and sharing. A bioinformatics infrastructure for data storage and access, and user-friendly web-based tool for analysis and sharing output is needed to make GS more practical for breeders. Results: We have developed a web-based tool, called solGS, for predicting genomic estimated breeding values (GEBVs) of individuals, using a Ridge-Regression Best Linear Unbiased Predictor (RR-BLUP) model. It has an intuitive web-interface for selecting a training population for modeling and estimating genomic estimated breeding values of selection candidates. It estimates phenotypic correlation and heritability of traits and selection indices of individuals. Raw data is stored in a generic database schema, Chado Natural Diversity, co-developed by multiple database groups. Analysis output is graphically visualized and can be interactively explored online or downloaded in text format. An instance of its implementation can be accessed at the NEXTGEN Cassava breeding database, . Conclusions: solGS enables breeders to store raw data and estimate GEBVs of individuals online, in an intuitive and interactive workflow. It can be adapted to any breeding program.",
                "authors": [
                    {
                        "name": "Edwards J.D."
                    },
                    {
                        "name": "Egesi C."
                    },
                    {
                        "name": "Jannink J.-L."
                    },
                    {
                        "name": "Kawuki R."
                    },
                    {
                        "name": "Kulakow P."
                    },
                    {
                        "name": "Menda N."
                    },
                    {
                        "name": "Mueller L.A."
                    },
                    {
                        "name": "Rabbi I.Y."
                    },
                    {
                        "name": "Tecle I.Y."
                    }
                ],
                "citationCount": 8,
                "date": "2014-12-14T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "solGS: A web-based tool for genomic selection"
            },
            "pmcid": "PMC4269960",
            "pmid": "25495537"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        }
    ],
    "validated": 1
}
