{
    "additionDate": "2020-01-09T18:03:09Z",
    "biotoolsCURIE": "biotools:R-BIND",
    "biotoolsID": "R-BIND",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "amanda.hargrove@duke.edu",
            "name": "Amanda E. Hargrove",
            "orcidid": "https://orcid.org/0000-0003-1536-6753",
            "typeEntity": "Person"
        }
    ],
    "description": "An Interactive Database for Exploring and Developing RNA-Targeted Chemical Probes.\n\nR-BIND: The RNA-Targeted BIoactive ligaNd Database. The dataset includes only bioactive ligands with demonstrated activity in cell culture and/or animal models. This database is expected to expedite the discovery of RNA chemical probes. R-BIND was created by the Hargrove Lab at Duke University",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://rbind.chem.duke.edu",
    "lastUpdate": "2020-12-11T15:12:10Z",
    "name": "R-BIND",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/ACSCHEMBIO.9B00631",
            "metadata": {
                "abstract": "Copyright © 2019 American Chemical Society.While the opportunities available for targeting RNA with small molecules have been widely appreciated, the challenges associated with achieving specific RNA recognition in biological systems have hindered progress and prevented many researchers from entering the field. To facilitate the discovery of RNA-targeted chemical probes and their subsequent applications, we curated the RNA-targeted BIoactive ligaNd Database (R-BIND). This collection contains an array of information on reported chemical probes that target non-rRNA and have biological activity, and analysis has led to the discovery of RNA-privileged properties. Herein, we developed an online platform to make this information freely available to the community, offering search options, a suite of tools for probe development, and an updated R-BIND data set with detailed experimental information for each probe. We repeated the previous cheminformatics analysis on the updated R-BIND list and found that the distinguishing physicochemical, structural, and spatial properties remained unchanged, despite an almost 50% increase in the database size. Further, we developed several user-friendly tools, including queries based on cheminformatic parameters, experimental details, functional groups, and substructures. In addition, a nearest neighbor algorithm can assess the similarity of user-uploaded molecules to R-BIND ligands. These tools and resources can be used to design small molecule libraries, optimize lead ligands, or select targets, probes, assays, and control experiments. Chemical probes are critical to the study and discovery of novel functions for RNA, and we expect this resource to greatly assist researchers in exploring and developing successful RNA-targeted probes.",
                "authors": [
                    {
                        "name": "Donlic A."
                    },
                    {
                        "name": "Forte J.E."
                    },
                    {
                        "name": "Hargrove A.E."
                    },
                    {
                        "name": "Karloff D.B."
                    },
                    {
                        "name": "Morgan B.S."
                    },
                    {
                        "name": "Sanaba B.G."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "citationCount": 15,
                "date": "2019-12-20T00:00:00Z",
                "journal": "ACS Chemical Biology",
                "title": "R-BIND: An Interactive Database for Exploring and Developing RNA-Targeted Chemical Probes"
            },
            "pmcid": "PMC6925312",
            "pmid": "31589399"
        }
    ],
    "topic": [
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
