
{
    "credit": [
        {
            "email": "hchen@utmem.edu",
            "name": "Hao Chen",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://www.chilibot.net"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                },
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Natural language processing",
                "uri": "http://edamontology.org/topic_0218"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Literature and language",
                "uri": "http://edamontology.org/topic_3068"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Background: The integration of the rapidly expanding corpus of information about the genome, transcriptome, and proteome, engendered by powerful technological advances, such as microarrays, and the availability of genomic sequence from multiple species, challenges the grasp and comprehension of the scientific community. Despite the existence of text-mining methods that identify biological relationships based on the textual co-occurrence of gene/protein terms or similarities in abstract texts, knowledge of the underlying molecular connections on a large scale, which is prerequisite to understanding novel biological processes, lags far behind the accumulation of data. While computationally efficient, the co-occurrence-based approaches fail to characterize (e.g., inhibition or stimulation, directionality) biological interactions. Programs with natural language processing (NLP) capability have been created to address these limitations, however, they are in general not readily accessible to the public. Results: We present a NLP-based text-mining approach, Chilibot, which constructs content-rich relationship networks among biological concepts, genes, proteins, or drugs. Amongst its features, suggestions for new hypotheses can be generated. Lastly, we provide evidence that the connectivity of molecular networks extracted from the biological literature follows the power-law distribution, indicating scale-free topologies consistent with the results of previous experimental analyses. Conclusions: Chilibot distills scientific relationships from knowledge available throughout a wide range of biological domains and presents these in a content-rich graphical format, thus integrating general biomedical knowledge with the specialized knowledge and interests of the user. Chilibot http://www.chilibot.net can be accessed free of charge to academic users. © 2004 Chen and Sharp; licensee BioMed Central Ltd.",
            "authors": [
                "Chen H.",
                "Sharp B.M."
            ],
            "cit_count": 219,
            "journal": "BMC Bioinformatics",
            "pmid": "15473905",
            "title": "Content-rich biological network constructed by mining PubMed abstracts",
            "year": "2004-10-08"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:chilibot",
        "biotoolsID": "chilibot",
        "description": "Chilibot searches the PubMed literature database based on specific relationships between proteins, genes, or keywords. The results are returned as a graph.",
        "homepage": "http://www.chilibot.net/",
        "name": "Chilibot"
    }
}