{
    "additionDate": "2020-01-14T09:17:47Z",
    "biotoolsCURIE": "biotools:TYGRESS",
    "biotoolsID": "TYGRESS",
    "confidence_flag": "tool",
    "description": "In situ structure determination at nanometer resolution using TYGRESS.\n\nTYGRESS:Tomography-Guided 3D Reconstruction of Subcellular Structures.\n\nTomography-Guided 3D Reconstruction of Subcellular Structures (TYGRESS) is a hybrid method, which combines the advantageous features of both cryo-electron tomography and single particle cryo-EM to achieve higher resolution than before of complex subcellular structures within their native environment.\n\nBack to UT Southwestern Back to UTSW Labs",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Single particle alignment and classification",
                    "uri": "http://edamontology.org/operation_3458"
                },
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                }
            ]
        }
    ],
    "homepage": "https://www.utsouthwestern.edu/labs/nicastro/tygress/",
    "lastUpdate": "2020-12-31T13:36:41Z",
    "name": "TYGRESS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1038/S41592-019-0651-0",
            "metadata": {
                "abstract": "© 2019, The Author(s), under exclusive licence to Springer Nature America, Inc.The resolution of subtomogram averages calculated from cryo-electron tomograms (cryo-ET) of crowded cellular environments is often limited owing to signal loss in, and misalignment of, the subtomograms. By contrast, single-particle cryo-electron microscopy (SP-cryo-EM) routinely reaches near-atomic resolution of isolated complexes. We report a method called ‘tomography-guided 3D reconstruction of subcellular structures’ (TYGRESS) that is a hybrid of cryo-ET and SP-cryo-EM, and is able to achieve close-to-nanometer resolution of complexes inside crowded cellular environments. TYGRESS combines the advantages of SP-cryo-EM (images with good signal-to-noise ratio and contrast, as well as minimal radiation damage) and subtomogram averaging (three-dimensional alignment of macromolecules in a complex sample). Using TYGRESS, we determined the structure of the intact ciliary axoneme with up to resolution of 12 Å. These results reveal many structural details that were not visible by cryo-ET alone. TYGRESS is generally applicable to cellular complexes that are amenable to subtomogram averaging.",
                "authors": [
                    {
                        "name": "Song K."
                    },
                    {
                        "name": "Shang Z."
                    },
                    {
                        "name": "Fu X."
                    },
                    {
                        "name": "Lou X."
                    },
                    {
                        "name": "Grigorieff N."
                    },
                    {
                        "name": "Nicastro D."
                    }
                ],
                "citationCount": 11,
                "date": "2020-02-01T00:00:00Z",
                "journal": "Nature Methods",
                "title": "In situ structure determination at nanometer resolution using TYGRESS"
            },
            "pmid": "31768058"
        }
    ],
    "topic": [
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        },
        {
            "term": "Electron microscopy",
            "uri": "http://edamontology.org/topic_0611"
        },
        {
            "term": "Light microscopy",
            "uri": "http://edamontology.org/topic_3385"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        }
    ],
    "validated": 1
}