{
    "accessibility": "Open access",
    "additionDate": "2022-09-04T12:55:08.849875Z",
    "biotoolsCURIE": "biotools:psupertime",
    "biotoolsID": "psupertime",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "manfred.claassen@med.uni-tuebingen.de",
            "name": "Manfred Claassen",
            "typeEntity": "Person"
        },
        {
            "name": "Revant Gupta"
        },
        {
            "name": "Will Macnair"
        }
    ],
    "description": "Supervised pseudotime analysis for time-series single-cell RNA-seq data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "RNA-seq time series data analysis",
                    "uri": "http://edamontology.org/operation_3565"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "http://github.com/wmacnair/psupertime",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-09-04T12:55:08.852561Z",
    "license": "GPL-3.0",
    "name": "psupertime",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAC227",
            "metadata": {
                "abstract": "© 2022 The Author(s) 2022. Published by Oxford University Press.Motivation: Improvements in single-cell RNA-seq technologies mean that studies measuring multiple experimental conditions, such as time series, have become more common. At present, few computational methods exist to infer time series-specific transcriptome changes, and such studies have therefore typically used unsupervised pseudotime methods. While these methods identify cell subpopulations and the transitions between them, they are not appropriate for identifying the genes that vary coherently along the time series. In addition, the orderings they estimate are based only on the major sources of variation in the data, which may not correspond to the processes related to the time labels. Results: We introduce psupertime, a supervised pseudotime approach based on a regression model, which explicitly uses time-series labels as input. It identifies genes that vary coherently along a time series, in addition to pseudotime values for individual cells, and a classifier that can be used to estimate labels for new data with unknown or differing labels. We show that psupertime outperforms benchmark classifiers in terms of identifying time-varying genes and provides better individual cell orderings than popular unsupervised pseudotime techniques. psupertime is applicable to any single-cell RNA-seq dataset with sequential labels (e.g. principally time series but also drug dosage and disease progression), derived from either experimental design and provides a fast, interpretable tool for targeted identification of genes varying along with specific biological processes.",
                "authors": [
                    {
                        "name": "Claassen M."
                    },
                    {
                        "name": "Gupta R."
                    },
                    {
                        "name": "Macnair W."
                    }
                ],
                "date": "2022-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Psupertime: Supervised pseudotime analysis for time-series single-cell RNA-seq data"
            },
            "pmcid": "PMC9235474",
            "pmid": "35758781"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Cytometry",
            "uri": "http://edamontology.org/topic_3934"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
