{
    "additionDate": "2021-03-19T09:17:19Z",
    "biotoolsCURIE": "biotools:etumormetastasis",
    "biotoolsID": "etumormetastasis",
    "confidence_flag": "tool",
    "description": "A Network-based Algorithm Predicts Clinical Outcomes Using Whole-exome Sequencing Data of Cancer Patients.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "homepage": "https://github.com/WangEdwinLab/eTumorMetastasis",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T20:27:16.554258Z",
    "name": "eTumorMetastasis",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/j.gpb.2020.06.009",
            "metadata": {
                "abstract": "Continual reduction in sequencing cost is expanding the accessibility of genome sequencing data for routine clinical applications. However, the lack of methods to construct machine learning-based predictive models using these datasets has become a crucial bottleneck for the application of sequencing technology in clinics. Here, we develop a new algorithm, eTumorMetastasis, which transforms tumor functional mutations into network-based profiles and identifies network operational gene (NOG) signatures. NOG signatures model the tipping point at which a tumor cell shifts from a state that doesn't favor recurrence to one that does. We show that NOG signatures derived from genomic mutations of tumor founding clones (i.e., the ‘most recent common ancestor’ of the cells within a tumor) significantly distinguish the recurred and non-recurred breast tumors as well as outperform the most popular genomic test (i.e., Oncotype DX). These results imply that mutations of the tumor founding clones are associated with tumor recurrence and can be used to predict clinical outcomes. As such, predictive tools could be used in clinics to guide treatment routes. Finally, the concepts underlying the eTumorMetastasis pave the way for the application of genome sequencing in predictions for other complex genetic diseases. eTumorMetastasis pseudocode and related data used in this study are available at https://github.com/WangEdwinLab/eTumorMetastasis.",
                "authors": [
                    {
                        "name": "Droit A."
                    },
                    {
                        "name": "Han P."
                    },
                    {
                        "name": "Meng Z."
                    },
                    {
                        "name": "Milanese J.-S."
                    },
                    {
                        "name": "Nantel A."
                    },
                    {
                        "name": "Tibiche C."
                    },
                    {
                        "name": "Wang E."
                    },
                    {
                        "name": "Zaman N."
                    },
                    {
                        "name": "Zou J."
                    }
                ],
                "citationCount": 4,
                "date": "2021-12-01T00:00:00Z",
                "journal": "Genomics, Proteomics and Bioinformatics",
                "title": "eTumorMetastasis: A Network-based Algorithm Predicts Clinical Outcomes Using Whole-exome Sequencing Data of Cancer Patients"
            },
            "pmcid": "PMC9402585",
            "pmid": "33581336"
        }
    ],
    "toolType": [
        "Library",
        "Script"
    ],
    "topic": [
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        }
    ]
}
