{
    "additionDate": "2019-11-14T18:47:48Z",
    "biotoolsCURIE": "biotools:BIRD",
    "biotoolsID": "BIRD",
    "confidence_flag": "tool",
    "description": "Bayesian Estimation of Genetic Regulatory Effects in High-throughput Reporter Assays | Bayesian Inference of Regulatory Differences | Photo by Bill Majoros. Used with permission | [6/16/2018] First version of BIRD released - The first version of BIRD has been released on GitHub at https://github.com/bmajoros/BIRD | [8/23/2018] Experiment design web tool released - A web tool is now available for power and sample size estimation: http://67.159.92.22:8080/ | BIRD (Bayesian Inference of Regulatory Differences) is a software suite for identifying regulatory variants in data from STARR-seq and other massively parallel reporter assays (MPRAs)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Linkage disequilibrium calculation",
                    "uri": "http://edamontology.org/operation_0488"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "http://www.geneprediction.org/bird",
    "lastUpdate": "2020-12-09T14:08:18Z",
    "name": "BIRD",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ545",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press. All rights reserved.Motivation: High-throughput reporter assays dramatically improve our ability to assign function to noncoding genetic variants, by measuring allelic effects on gene expression in the controlled setting of a reporter gene. Unlike genetic association tests, such assays are not confounded by linkage disequilibrium when loci are independently assayed. These methods can thus improve the identification of causal disease mutations. While work continues on improving experimental aspects of these assays, less effort has gone into developing methods for assessing the statistical significance of assay results, particularly in the case of rare variants captured from patient DNA. Results: We describe a Bayesian hierarchical model, called Bayesian Inference of Regulatory Differences, which integrates prior information and explicitly accounts for variability between experimental replicates. The model produces substantially more accurate predictions than existing methods when allele frequencies are low, which is of clear advantage in the search for disease-causing variants in DNA captured from patient cohorts. Using the model, we demonstrate a clear tradeoff between variant sequencing coverage and numbers of biological replicates, and we show that the use of additional biological replicates decreases variance in estimates of effect size, due to the properties of the Poisson-binomial distribution. We also provide a power and sample size calculator, which facilitates decision making in experimental design parameters.",
                "authors": [
                    {
                        "name": "Allen A.S."
                    },
                    {
                        "name": "Barrera A."
                    },
                    {
                        "name": "Cunningham S.J."
                    },
                    {
                        "name": "Guo C."
                    },
                    {
                        "name": "Hayes M.G."
                    },
                    {
                        "name": "Johnson G.D."
                    },
                    {
                        "name": "Kim Y.-S."
                    },
                    {
                        "name": "Li F."
                    },
                    {
                        "name": "Lowe W.L."
                    },
                    {
                        "name": "Majoros W.H."
                    },
                    {
                        "name": "Reddy T.E."
                    },
                    {
                        "name": "Scholtens D.M."
                    },
                    {
                        "name": "Wang X."
                    }
                ],
                "date": "2020-01-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Bayesian estimation of genetic regulatory effects in high-throughput reporter assays"
            },
            "pmid": "31368479"
        }
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
