
{
    "credit": [
        {
            "email": "neil.swainston@manchester.ac.uk",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.mcisb.org/index.html"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://www.mcisb.org/resources/subliminal/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "JIB.tools"
        ],
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Systems biology",
                "uri": "http://edamontology.org/topic_2259"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/subliminal-toolbox-reconstruction-of-metabolic-networks.html"
        },
        {
            "note": "SuBliMinaL@JIB.tools - a web registry of tools published in the Journal of Integrative Bioinformatics",
            "type": "SOFTWARE_CATALOGUE",
            "url": "https://jib.tools/details.php?id=20"
        }
    ],
    "publication": [
        {
            "abstract": "The generation and use of metabolic network reconstructions has increased over recent years. The development of such reconstructions has typically involved a time-consuming, manual process. Recent work has shown that steps undertaken in reconstructing such metabolic networks are amenable to automation. The SuBliMinaL Toolbox (http://www.mcisb.org/subliminal/) facilitates the reconstruction process by providing a number of independent modules to perform common tasks, such as generating draft reconstructions, determining metabolite protonation state, mass and charge balancing reactions, suggesting intracellular compartmentalisation, adding transport reactions and a biomass function, and formatting the reconstruction to be used in third-party analysis packages. The individual modules manipulate reconstructions encoded in Systems Biology Markup Language (SBML), and can be chained to generate a reconstruction pipeline, or used individually during a manual curation process. This work describes the individual modules themselves, and a study in which the modules were used to develop a metabolic reconstruction of Saccharomyces cerevisiae from the existing data resources KEGG and MetaCyc. The automatically generated reconstruction is analysed for blocked reactions, and suggestions for future improvements to the toolbox are discussed.",
            "authors": [
                "Swainston N.",
                "Smallbone K.",
                "Mendes P.",
                "Kell D.",
                "Paton N."
            ],
            "cit_count": 62,
            "journal": "Journal of integrative bioinformatics",
            "pmid": "22095399",
            "title": "The SuBliMinaL Toolbox: automating steps in the reconstruction of metabolic networks.",
            "year": "2011-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:subliminal_toolbox",
        "biotoolsID": "subliminal_toolbox",
        "description": "The software comprises of a number of independent tools that can be used to automate steps in the development of genome-scale metabolic reconstructions.",
        "homepage": "http://www.mcisb.org/resources/subliminal/",
        "name": "SuBliMinaL Toolbox"
    }
}