
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.lx.it.pt/~asmc/"
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://www.lx.it.pt/~asmc/software/riso.html#An-example"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Motif discovery",
                    "uri": "http://edamontology.org/operation_0238"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequences",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/riso-motif-discovery-tool.html"
        }
    ],
    "publication": [
        {
            "abstract": "We propose a new algorithm for identifying cis-regulatory modules in genomic sequences. The proposed algorithm, named RISO, uses a new data structure, called box-link, to store the information about conserved regions that occur in a well-ordered and regularly spaced manner in the data set sequences. This type of conserved regions, called structured motifs, is extremely relevant in the research of gene regulatory mechanisms since it can effectively represent promoter models. The complexity analysis shows a time and space gain over the best known exact algorithms that is exponential in the spacings between binding sites. A full implementation of the algorithm was developed and made available online. Experimental results show that the algorithm is much faster than existing ones, sometimes by more than four orders of magnitude. The application of the method to biological data sets shows its ability to extract relevant consensi. © 2006 IEEE.",
            "authors": [
                "Carvalho A.M.",
                "Freitas A.T.",
                "Oliveira A.L.",
                "Sagot M.-F."
            ],
            "cit_count": 38,
            "doi": "10.1109/TCBB.2006.16",
            "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
            "title": "An efficient algorithm for the identification of structured motifs in DNA promoter sequences",
            "type": "Primary",
            "year": "2006-04-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:riso",
        "biotoolsID": "riso",
        "description": "Extract conserved regions that occur in a well-ordered and regularly spaced manner in a set of DNA sequences.",
        "homepage": "http://www.lx.it.pt/~asmc/software/riso.html",
        "name": "RISO"
    }
}