{
    "additionDate": "2017-09-26T08:16:28Z",
    "biotoolsCURIE": "biotools:centomd",
    "biotoolsID": "centomd",
    "collectionID": [
        "Rare Disease"
    ],
    "cost": "Commercial",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.centogene.com/contact.html"
        }
    ],
    "description": "Genetic mutation database for rare diseases that enables to search, sort and filter genetic variants from clinically diagnosed individuals worldwide and make symptoms-based queries.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://www.centogene.com/mutation-database-centomd.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "SNP annotation",
                    "uri": "http://edamontology.org/operation_3661"
                },
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "homepage": "https://www.centogene.com/mutation-database-centomd.html",
    "lastUpdate": "2020-01-19T17:48:06Z",
    "license": "Proprietary",
    "maturity": "Mature",
    "name": "CentoMD",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": "10.1002/mgg3.262",
            "metadata": {
                "abstract": "© 2016 The Authors. Molecular Genetics & Genomic Medicine published by Wiley Periodicals, Inc.Background: The ability to discover genetic variants in a patient runs far ahead of the ability to interpret them. Databases with accurate descriptions of the causal relationship between the variants and the phenotype are valuable since these are critical tools in clinical genetic diagnostics. Here, we introduce a comprehensive and global genotype–phenotype database focusing on rare diseases. Methods: This database (CentoMD®) is a browser-based tool that enables access to a comprehensive, independently curated system utilizing stringent high-quality criteria and a quickly growing repository of genetic and human phenotype ontology (HPO)-based clinical information. Its main goals are to aid the evaluation of genetic variants, to enhance the validity of the genetic analytical workflow, to increase the quality of genetic diagnoses, and to improve evaluation of treatment options for patients with hereditary diseases. The database software correlates clinical information from consented patients and probands of different geographical backgrounds with a large dataset of genetic variants and, when available, biomarker information. An automated follow-up tool is incorporated that informs all users whenever a variant classification has changed. These unique features fully embedded in a CLIA/CAP-accredited quality management system allow appropriate data quality and enhanced patient safety. Results: More than 100,000 genetically screened individuals are documented in the database, resulting in more than 470 million variant detections. Approximately, 57% of the clinically relevant and uncertain variants in the database are novel. Notably, 3% of the genetic variants identified and previously reported in the literature as being associated with a particular rare disease were reclassified, based on internal evidence, as clinically irrelevant. Conclusions: The database offers a comprehensive summary of the clinical validity and causality of detected gene variants with their associated phenotypes, and is a valuable tool for identifying new disease genes through the correlation of novel genetic variants with specific, well-defined phenotypes.",
                "authors": [
                    {
                        "name": "Trujillano D."
                    },
                    {
                        "name": "Oprea G.-E."
                    },
                    {
                        "name": "Schmitz Y."
                    },
                    {
                        "name": "Bertoli-Avella A.M."
                    },
                    {
                        "name": "Abou Jamra R."
                    },
                    {
                        "name": "Rolfs A."
                    }
                ],
                "citationCount": 32,
                "date": "2017-01-01T00:00:00Z",
                "journal": "Molecular Genetics and Genomic Medicine",
                "title": "A comprehensive global genotype–phenotype database for rare diseases"
            },
            "pmcid": "PMC5241210",
            "pmid": "28116331",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application",
        "Database portal"
    ],
    "topic": [
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1,
    "version": [
        "5.3"
    ]
}