{
    "accessibility": "Open access",
    "additionDate": "2024-03-27T12:55:23.440425Z",
    "biotoolsCURIE": "biotools:lampprimerbank",
    "biotoolsID": "lampprimerbank",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "fa.javadi@sci.ui.ac.ir",
            "name": "Fatemeh Javadi-Zarnaghi",
            "typeEntity": "Person"
        },
        {
            "name": "Fatemeh Arabi-Jeshvaghani",
            "typeEntity": "Person"
        }
    ],
    "description": "Manually curated database of experimentally validated loop-mediated isothermal amplification primers for detection of respiratory pathogens.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Amplification detection",
                    "uri": "http://edamontology.org/operation_3965"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                }
            ]
        }
    ],
    "homepage": "https://lampprimerbank.mathematik.uni-marburg.de",
    "lastUpdate": "2024-03-27T12:55:23.443140Z",
    "name": "LAMPPrimerBank",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/S15010-023-02100-0",
            "metadata": {
                "abstract": "Purpose and methods: The emergence of coronavirus disease 2019 (COVID-19) has once again affirmed the significant threat of respiratory infections to global public health and the utmost importance of prompt diagnosis in managing and mitigating any pandemic. The nucleic acid amplification test (NAAT) is the primary detection method for most pathogens. Loop‐mediated isothermal amplification (LAMP) is a rapid, simple, sensitive, and specific epitome of isothermal NAAT performed using a set of four to six primers. Primer design is a fundamental step in LAMP assays, with several complexities and experimental screening requirements. To address this challenge, an online database is presented here. Its workflow comprises three steps: literature aggregation, data curation, and database and website implementation. Results: LAMPPrimerBank (https://lampprimerbank.mathematik.uni-marburg.de) is a manually curated database dedicated to experimentally validated LAMP primers, their peculiarities of assays, and accompanying literature, with a primary emphasis on respiratory pathogens. LAMPPrimerBank, with its user-friendly web interface and an open application programming interface, enables the accelerated and facile exploration, comparison, and exportation of LAMP primer sequences and their respective information from the massively scattered literature. LAMPPrimerBank currently comprises LAMP primers for diagnosing viral, bacterial, and fungal respiratory pathogens. Additionally, to address the challenge of false-positive results generated by nonspecific amplifications, LAMPPrimerBank computationally predicted and visualized the sizes of LAMP products for recorded primer sets in the database. Conclusion: LAMPPrimerBank, as a pioneering database in the rapidly expanding field of isothermal NAAT, endeavors to confront the two challenges of the LAMP: primer design and discrimination of false-positive results.",
                "authors": [
                    {
                        "name": "Arabi-Jeshvaghani F."
                    },
                    {
                        "name": "Heider D."
                    },
                    {
                        "name": "Javadi-Zarnaghi F."
                    },
                    {
                        "name": "Lochel H.F."
                    },
                    {
                        "name": "Martin R."
                    }
                ],
                "date": "2023-12-01T00:00:00Z",
                "journal": "Infection",
                "title": "LAMPPrimerBank, a manually curated database of experimentally validated loop-mediated isothermal amplification primers for detection of respiratory pathogens"
            },
            "pmid": "37828369"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Data submission, annotation and curation",
            "uri": "http://edamontology.org/topic_0219"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Respiratory medicine",
            "uri": "http://edamontology.org/topic_3322"
        }
    ]
}
