{
    "accessibility": "Open access",
    "additionDate": "2016-12-19T14:21:37Z",
    "biotoolsCURIE": "biotools:bcftools_view-ip",
    "biotoolsID": "bcftools_view",
    "collectionID": [
        "BCFtools",
        "SAMtools",
        "galaxyPasteur"
    ],
    "credit": [
        {
            "email": "galaxy@pasteur.fr",
            "name": "Galaxy Support Team",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Convert BCF format to VCF format.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.htslib.org/doc/samtools.html#4"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Data",
                        "uri": "http://edamontology.org/data_0006"
                    },
                    "format": [
                        {
                            "term": "TSV",
                            "uri": "http://edamontology.org/format_3475"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Sequence variations",
                        "uri": "http://edamontology.org/data_3498"
                    },
                    "format": [
                        {
                            "term": "BCF",
                            "uri": "http://edamontology.org/format_3020"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Data",
                        "uri": "http://edamontology.org/data_0006"
                    },
                    "format": [
                        {
                            "term": "TSV",
                            "uri": "http://edamontology.org/format_3475"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://www.htslib.org/",
    "language": [
        "C"
    ],
    "lastUpdate": "2020-06-16T10:55:20Z",
    "link": [
        {
            "type": [
                "Galaxy service"
            ],
            "url": "https://galaxy.pasteur.fr/tool_runner?tool_id=toolshed.pasteur.fr/repos/fmareuil/bcftools/bcftools_view/1.0.0"
        }
    ],
    "maturity": "Mature",
    "name": "bcftools_view",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "hmenager",
    "publication": [
        {
            "doi": "10.1093/nar/gkw343",
            "metadata": {
                "abstract": "© The Author(s) 2016. Published by Oxford University Press on behalf of Nucleic Acids Research.High-throughput data production technologies, particularly 'next-generation' DNA sequencing, have ushered in widespread and disruptive changes to biomedical research. Making sense of the large datasets produced by these technologies requires sophisticated statistical and computational methods, as well as substantial computational power. This has led to an acute crisis in life sciences, as researchers without informatics training attempt to perform computation-dependent analyses. Since 2005, the Galaxy project has worked to address this problem by providing a framework that makes advanced computational tools usable by non experts. Galaxy seeks to make data-intensive research more accessible, transparent and reproducible by providing a Web-based environment in which users can perform computational analyses and have all of the details automatically tracked for later inspection, publication, or reuse. In this report we highlight recently added features enabling biomedical analyses on a large scale.",
                "authors": [
                    {
                        "name": "Afgan E."
                    },
                    {
                        "name": "Baker D."
                    },
                    {
                        "name": "Blankenberg D."
                    },
                    {
                        "name": "Bouvier D."
                    },
                    {
                        "name": "Cech M."
                    },
                    {
                        "name": "Chilton J."
                    },
                    {
                        "name": "Clements D."
                    },
                    {
                        "name": "Coraor N."
                    },
                    {
                        "name": "Eberhard C."
                    },
                    {
                        "name": "Goecks J."
                    },
                    {
                        "name": "Gruning B."
                    },
                    {
                        "name": "Guerler A."
                    },
                    {
                        "name": "Hillman-Jackson J."
                    },
                    {
                        "name": "Nekrutenko A."
                    },
                    {
                        "name": "Rasche E."
                    },
                    {
                        "name": "Soranzo N."
                    },
                    {
                        "name": "Taylor J."
                    },
                    {
                        "name": "Turaga N."
                    },
                    {
                        "name": "Von Kuster G."
                    },
                    {
                        "name": "van den Beek M."
                    }
                ],
                "citationCount": 1025,
                "date": "2016-07-08T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "The Galaxy platform for accessible, reproducible and collaborative biomedical analyses: 2016 update"
            },
            "type": [
                "Other"
            ]
        },
        {
            "doi": "10.1534/genetics.112.144204",
            "metadata": {
                "abstract": "Whole genome sequencing (WGS) allows researchers to pinpoint genetic differences between individuals and significantly shortcuts the costly and time-consuming part of forward genetic analysis in model organism systems. Currently, the most effortintensive part of WGS is the bioinformatic analysis of the relatively short reads generated by second generation sequencing platforms. We describe here a novel, easily accessible and cloud-based pipeline, called CloudMap, which greatly simplifies the analysis of mutant genome sequences. Available on the Galaxy web platform, CloudMap requires no software installation when run on the cloud, but it can also be run locally or via Amazon's Elastic Compute Cloud (EC2) service. CloudMap uses a series of predefined workflows to pinpoint sequence variations in animal genomes, such as those of premutagenized and mutagenized Caenorhabditis elegans strains. In combination with a variant-based mapping procedure, CloudMap allows users to sharply define genetic map intervals graphically and to retrieve very short lists of candidate variants with a few simple clicks. Automated workflows and extensive video user guides are available to detail the individual analysis steps performed (http://usegalaxy.org/cloudmap). We demonstrate the utility of CloudMap for WGS analysis of C. elegans and Arabidopsis genomes and describe how other organisms (e.g., Zebrafish and Drosophila) can easily be accommodated by this software platform. To accommodate rapid analysis of many mutants from large-scale genetic screens, Cloud- Map contains an in silico complementation testing tool that allows users to rapidly identify instances where multiple alleles of the same gene are present in the mutant collection. Lastly, we describe the application of a novel mapping/WGS method (\"Variant Discovery Mapping\") that does not rely on a defined polymorphic mapping strain, and we integrate the application of this method into CloudMap. CloudMap tools and documentation are continually updated at http://usegalaxy.org/cloudmap. © 2012 by the Genetics Society of America.",
                "authors": [
                    {
                        "name": "Blankenberg D."
                    },
                    {
                        "name": "Hobert O."
                    },
                    {
                        "name": "Minevich G."
                    },
                    {
                        "name": "Park D.S."
                    },
                    {
                        "name": "Poole R.J."
                    }
                ],
                "citationCount": 157,
                "date": "2012-12-01T00:00:00Z",
                "journal": "Genetics",
                "title": "CloudMap: A cloud-based pipeline for analysis of mutant genome sequences"
            },
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.7490/f1000research.1114334.1",
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1,
    "version": [
        "1.0.0"
    ]
}
