{
    "additionDate": "2024-02-23T09:18:08.763098Z",
    "biotoolsCURIE": "biotools:pia_d",
    "biotoolsID": "pia_d",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "fh12355@rjh.com.cn",
            "name": "Hai Fang",
            "orcidid": "https://orcid.org/0000-0003-3961-8572"
        }
    ],
    "description": "In silico discovery of shared and distinct drug targets for adult- and childhood-onset disease.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://www.genetictargets.com/PIA",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T14:13:43.383108Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/hfang-bristol/PIA"
        }
    ],
    "name": "PIA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/j.compbiomed.2023.107095",
            "metadata": {
                "abstract": "Asthma is a chronic disease that is caused by a combination of genetic risks and environmental triggers and can affect both adults and children. Genome-wide association studies have revealed partly distinct genetic architectures for its two age-of-onset subtypes (namely, adult-onset and childhood-onset). We reason that identifying shared and distinct drug targets between these subtypes may inform the development of subtype-specific therapeutic strategies. In attempting this, we here introduce Priority Index for Asthma or PIA, a genetics-led and network-driven drug target prioritisation tool for asthma. We demonstrate the validity of the tool in improving drug target prioritisation for asthma compared to the status quo methods, as well as in capturing the underlying etiology and existing therapeutics for the disease. We also illustrate how PIA can be used to prioritise drug targets for adult- and childhood-onset asthma, as well as to identify shared and distinct pathway crosstalk genes. Shared crosstalk genes are mostly involved in JAK-STAT signaling, with clinical evidence supporting that targeting this pathway may be a promising drug repurposing opportunity for both subtypes. Crosstalk genes specific to childhood-onset asthma are enriched for PI3K-AKT-mTOR signaling, and we identify genes that are already targeted by licensed medications as repurposed drug candidates for this subtype. We make all our results accessible and reproducible at http://www.genetictargets.com/PIA. Collectively, our study has significant implications for asthma computational medicine research and can guide the future development of subtype-specific therapeutic strategies for the disease.",
                "authors": [
                    {
                        "name": "Bao C."
                    },
                    {
                        "name": "Chen L."
                    },
                    {
                        "name": "Fang H."
                    },
                    {
                        "name": "Gu L."
                    },
                    {
                        "name": "Jiang L."
                    },
                    {
                        "name": "Wang S."
                    },
                    {
                        "name": "Zhang Z."
                    },
                    {
                        "name": "Zou K."
                    }
                ],
                "citationCount": 4,
                "date": "2023-08-01T00:00:00Z",
                "journal": "Computers in Biology and Medicine",
                "title": "Priority index for asthma (PIA): In silico discovery of shared and distinct drug targets for adult- and childhood-onset disease"
            },
            "pmid": "37285660"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
