{
    "additionDate": "2017-05-02T07:18:28Z",
    "biotoolsCURIE": "biotools:mulan",
    "biotoolsID": "mulan",
    "credit": [
        {
            "email": "ovcharenko1@llnl.gov",
            "name": "Ovcharenko I.",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.ncbi.nlm.nih.gov/CBBresearch/Ovcharenko/"
        }
    ],
    "description": "Performs local multiple DNA sequence alignments of finished and draft-quality sequences. It identifies transcription factor binding sites evolutionarily conserved across multiple species.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://mulan.dcode.org/mulanInstructions.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Local alignment",
                    "uri": "http://edamontology.org/operation_0495"
                },
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                }
            ]
        }
    ],
    "homepage": "http://mulan.dcode.org/",
    "lastUpdate": "2018-12-10T12:58:44Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/mulan-multiple-sequence-alignment-tool.html"
        }
    ],
    "name": "Mulan",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Multiple sequence alignment analysis is a powerful approach for translating the evolutionary selective power into phylogenetic relationships to localize functional coding and noncoding genomic elements. The tool Mulan (http://mulan.dcode.org/) has been designed to effectively perform multiple comparisons of genomic sequences necessary to facilitate bioinformatic-driven biological discoveries. The Mulan network server is capable of comparing both closely and distantly related genomes to identify conserved elements over a broad range of evolutionary time. Several novel algorithms are brought together in this tool: the tba multisequence aligner program used to rapidly identify local sequence conservation and the multiTF program to detect evolutionarily conserved transcription factor binding sites in alignments. Mulan is integrated with the ERC Browser, the UCSC Genome Browser for quick uploads of available sequences and supports two-way communication with the GALA database to overlay GALA functional genome annotation with sequence conservation profiles. Local multiple alignments computed by Mulan ensure reliable representation of short- and large-scale genomic rearrangements in distant organisms. Recently, we have also introduced the ability to handle duplications to permit the reliable reconstruction of evolutionary events that underlie the genome sequence data. Here, we describe the main features of the Mulan tool that include the interactive modification of critical conservation parameters, visualization options, and dynamic access to sequence data from visual graphs for flexible and easy-to-perform analysis of differentially evolving genomic regions. © Humana Press Inc.",
                "authors": [
                    {
                        "name": "Loots G.G."
                    },
                    {
                        "name": "Ovcharenko I."
                    }
                ],
                "citationCount": 21,
                "date": "2007-01-11T00:00:00Z",
                "journal": "Methods in Molecular Biology",
                "title": "Mulan: Multiple-sequence alignment to predict functional elements in genomic sequences"
            },
            "pmid": "17993678"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
