{
    "additionDate": "2020-01-09T18:13:32Z",
    "biotoolsCURIE": "biotools:HVint2.0",
    "biotoolsID": "HVint2.0",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "kay.gruenewald@cssb-hamburg.de",
            "name": "Kay Grünewald",
            "typeEntity": "Person"
        },
        {
            "email": "m.topf@cryst.bbk.ac.uk",
            "name": "Maya Topf",
            "typeEntity": "Person"
        }
    ],
    "description": "Conserved Central Intraviral Protein Interactome of the Herpesviridae Family.\n\na repository for human herpesvirus interactomics.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Pathway or network comparison",
                    "uri": "http://edamontology.org/operation_0277"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                }
            ]
        }
    ],
    "homepage": "http://topf-group.ismb.lon.ac.uk/hvint2",
    "lastUpdate": "2020-12-11T07:49:59Z",
    "name": "HVint2.0",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1128/MSYSTEMS.00295-19",
            "metadata": {
                "abstract": "© 2019 Hernández Durán et al.Protein interactions are major driving forces behind the functional phenotypes of biological processes. As such, evolutionary footprints are reflected in systemlevel collections of protein-protein interactions (PPIs), i.e., protein interactomes. We conducted a comparative analysis of intraviral protein interactomes for representative species of each of the three subfamilies of herpesviruses (herpes simplex virus 1, human cytomegalovirus, and Epstein-Barr virus), which are highly prevalent etiologic agents of important human diseases. The intraviral interactomes were reconstructed by combining experimentally supported and computationally predicted protein-protein interactions. Using cross-species network comparison, we then identified family-wise conserved interactions and protein complexes, which we defined as a herpesviral \"central\" intraviral protein interactome. A large number of widely accepted conserved herpesviral protein complexes are present in this central intraviral interactome, encouragingly supporting the biological coherence of our results. Importantly, these protein complexes represent most, if not all, of the essential steps required during a productive life cycle. Hence the central intraviral protein interactome could plausibly represent a minimal infectious interactome of the herpesvirus family across a variety of hosts. Our data, which have been integrated into our herpesvirus interactomics database, HVint2.0, could assist in creating comprehensive system-level computational models of this viral lineage. IMPORTANCE Herpesviruses are an important socioeconomic burden for both humans and livestock. Throughout their long evolutionary history, individual herpesvirus species have developed remarkable host specificity, while collectively the Herpesviridae family has evolved to infect a large variety of eukaryotic hosts. The development of approaches to fight herpesvirus infections has been hampered by the complexity of herpesviruses' genomes, proteomes, and structural features. The data and insights generated by our study add to the understanding of the functional organization of herpesvirus-encoded proteins, specifically of family-wise conserved features defining essential components required for a productive infectious cycle across different hosts, which can contribute toward the conceptualization of antiherpetic infection strategies with an effect on a broader range of target species. All of the generated data have been made freely available through our HVint2.0 database, a dedicated resource of curated herpesvirus interactomics purposely created to promote and assist future studies in the field.",
                "authors": [
                    {
                        "name": "Duran A.H."
                    },
                    {
                        "name": "Grunewald K."
                    },
                    {
                        "name": "Topf M."
                    }
                ],
                "citationCount": 2,
                "date": "2019-01-01T00:00:00Z",
                "journal": "mSystems",
                "title": "Conserved central intraviral protein interactome of the herpesviridae family"
            },
            "pmcid": "PMC6774017",
            "pmid": "31575665"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Protein interaction experiment",
            "uri": "http://edamontology.org/topic_3957"
        },
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        }
    ],
    "validated": 1
}