{
    "additionDate": "2018-06-03T18:41:18Z",
    "biotoolsCURIE": "biotools:genease",
    "biotoolsID": "genease",
    "credit": [
        {
            "email": "tesfaye.mersha@cchmc.org",
            "name": "Tesfaye B Mersha",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Real time bioinformatics tool for multi-omics and disease ontology exploration, analysis and visualization.",
    "documentation": [
        {
            "type": "General",
            "url": "http://research.cchmc.org/mershalab/GENEASE/login.html#"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Ontology visualisation",
                    "uri": "http://edamontology.org/operation_3559"
                }
            ]
        }
    ],
    "homepage": "http://research.cchmc.org/mershalab/GENEASE/login.html",
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "GENEASE",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/bty182",
            "metadata": {
                "abstract": "© The Author(s) 2018. Published by Oxford University Press. All rights reserved. Motivation: Advances in high-throughput sequencing technologies have made it possible to generate multiple omics data at an unprecedented rate and scale. The accumulation of these omics data far outpaces the rate at which biologists can mine and generate new hypothesis to test experimentally. There is an urgent need to develop a myriad of powerful tools to efficiently and effectively search and filter these resources to address specific post-GWAS functional genomics questions. However, to date, these resources are scattered across several databases and often lack a unified portal for data annotation and analytics. In addition, existing tools to analyze and visualize these databases are highly fragmented, resulting researchers to access multiple applications and manual interventions for each gene or variant in an ad hoc fashion until all the questions are answered. Results: In this study, we present GENEASE, a web-based one-stop bioinformatics tool designed to not only query and explore multi-omics and phenotype databases (e.g. GTEx, ClinVar, dbGaP, GWAS Catalog, ENCODE, Roadmap Epigenomics, KEGG, Reactome, Gene and Phenotype Ontology) in a single web interface but also to perform seamless post genome-wide association downstream functional and overlap analysis for non-coding regulatory variants. GENEASE accesses over 50 different databases in public domain including model organism-specific databases to facilitate gene/variant and disease exploration, enrichment and overlap analysis in real time. It is a user-friendly tool with point- and-click interface containing links for support information including user manual and examples.",
                "authors": [
                    {
                        "name": "Ghandikota S."
                    },
                    {
                        "name": "Khurana Hershey G.K."
                    },
                    {
                        "name": "Mersha T.B."
                    }
                ],
                "citationCount": 1,
                "date": "2018-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "GENEASE: Real time bioinformatics tool for multi-omics and disease ontology exploration, analysis and visualization"
            }
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Omics",
            "uri": "http://edamontology.org/topic_3391"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        }
    ],
    "validated": 1
}