{
    "additionDate": "2021-01-18T09:41:28Z",
    "biotoolsCURIE": "biotools:crisprpredseq",
    "biotoolsID": "crisprpredseq",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "msrahman@cse.buet.ac.bd",
            "name": "M. Sohel Rahman",
            "orcidid": "https://orcid.org/0000-0001-9419-6478",
            "typeEntity": "Person"
        }
    ],
    "description": "CRISPRpred(SEQ) is a method for sgRNA on-target activity prediction that leverages only traditional machine learning techniques and hand-crafted features extracted from sgRNA sequences. We compare the results of CRISPRpred(SEQ) with that of DeepCRISPR, the current state-of-the-art, which uses a deep learning pipeline.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Rafid013/CRISPRpredSEQ",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-18T15:39:19Z",
    "name": "CRISPRpred(SEQ)",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-020-3531-9",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: The latest works on CRISPR genome editing tools mainly employs deep learning techniques. However, deep learning models lack explainability and they are harder to reproduce. We were motivated to build an accurate genome editing tool using sequence-based features and traditional machine learning that can compete with deep learning models. Results: In this paper, we present CRISPRpred(SEQ), a method for sgRNA on-target activity prediction that leverages only traditional machine learning techniques and hand-crafted features extracted from sgRNA sequences. We compare the results of CRISPRpred(SEQ) with that of DeepCRISPR, the current state-of-the-art, which uses a deep learning pipeline. Despite using only traditional machine learning methods, we have been able to beat DeepCRISPR for the three out of four cell lines in the benchmark dataset convincingly (2.174%, 6.905% and 8.119% improvement for the three cell lines). Conclusion: CRISPRpred(SEQ) has been able to convincingly beat DeepCRISPR in 3 out of 4 cell lines. We believe that by exploring further, one can design better features only using the sgRNA sequences and can come up with a better method leveraging only traditional machine learning algorithms that can fully beat the deep learning models.",
                "authors": [
                    {
                        "name": "Muhammad Rafid A.H."
                    },
                    {
                        "name": "Rahman M.S."
                    },
                    {
                        "name": "Rahman M.S."
                    },
                    {
                        "name": "Toufikuzzaman M."
                    }
                ],
                "citationCount": 4,
                "date": "2020-06-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "CRISPRpred(SEQ): A sequence-based method for sgRNA on target activity prediction using traditional machine learning"
            },
            "pmcid": "PMC7268231",
            "pmid": "32487025"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Genetic engineering",
            "uri": "http://edamontology.org/topic_3912"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
