{
    "additionDate": "2021-01-18T12:03:32Z",
    "biotoolsCURIE": "biotools:mad-unet",
    "biotoolsID": "mad-unet",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "liws@cqupt.edu.cn",
            "name": "Weisheng Li",
            "typeEntity": "Person"
        }
    ],
    "description": "A deep U-shaped network combined with an attention mechanism for pancreas segmentation in CT images.\n\nDeep Learning Tutorial for Kaggle Ultrasound Nerve Segmentation competition, using Keras.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Mrqins/pancreas-segmentation",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-19T08:31:22Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/yihui-he/u-net"
        }
    ],
    "name": "MAD-UNet",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1002/MP.14617",
            "metadata": {
                "abstract": "© 2020 American Association of Physicists in MedicinePurpose: Pancreas segmentation is a difficult task because of the high intrapatient variability in the shape, size, and location of the organ, as well as the low contrast and small footprint of the CT scan. At present, the U-Net model is likely to lead to the problems of intraclass inconsistency and interclass indistinction in pancreas segmentation. To solve this problem, we improved the contextual and semantic feature information acquisition method of the biomedical image segmentation model (U-Net) based on a convolutional network and proposed an improved segmentation model called the multiscale attention dense residual U-shaped network (MAD-UNet). Methods: There are two aspects considered in this method. First, we adopted dense residual blocks and weighted binary cross-entropy to enhance the semantic features to learn the details of the pancreas. Using such an approach can reduce the effects of intraclass inconsistency. Second, we used an attention mechanism and multiscale convolution to enrich the contextual information and suppress learning in unrelated areas. We let the model be more sensitive to pancreatic marginal information and reduced the impact of interclass indistinction. Results: We evaluated our model using fourfold cross-validation on 82 abdominal enhanced three-dimensional (3D) CT scans from the National Institutes of Health (NIH-82) and 281 3D CT scans from the 2018 MICCAI segmentation decathlon challenge (MSD). The experimental results showed that our method achieved state-of-the-art performance on the two pancreatic datasets. The mean Dice coefficients were 86.10% ± 3.52% and 88.50% ± 3.70%. Conclusions: Our model can effectively solve the problems of intraclass inconsistency and interclass indistinction in the segmentation of the pancreas, and it has value in clinical application. Code is available at https://github.com/Mrqins/pancreas-segmentation.",
                "authors": [
                    {
                        "name": "Li F."
                    },
                    {
                        "name": "Li W."
                    },
                    {
                        "name": "Qin S."
                    },
                    {
                        "name": "Wang L."
                    }
                ],
                "citationCount": 1,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Medical Physics",
                "title": "MAD-UNet: A deep U-shaped network combined with an attention mechanism for pancreas segmentation in CT images"
            },
            "pmid": "33222222"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Echography",
            "uri": "http://edamontology.org/topic_3954"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ]
}
