{
    "additionDate": "2017-08-03T19:07:14Z",
    "biotoolsCURIE": "biotools:missequel",
    "biotoolsID": "missequel",
    "credit": [
        {
            "email": "sequel.help@gmail.com",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.cs.colostate.edu/seq/people/"
        }
    ],
    "description": "Software that enhances the quality of draft genomes by identifying misassembly errors and their breakpoints using paired-end sequence reads and optical mapping data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.cs.colostate.edu/seq/missequel/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                }
            ]
        }
    ],
    "homepage": "http://www.cs.colostate.edu/seq/missequel/",
    "language": [
        "Java",
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/missequel-misassembly-detection-in-draft-genomes.html"
        }
    ],
    "name": "misSEQuel",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© The Author 2015. Published by Oxford University Press.Motivation: A crucial problem in genome assembly is the discovery and correction of misassembly errors in draft genomes. We develop a method called misSEQuel that enhances the quality of draft genomes by identifying misassembly errors and their breakpoints using paired-end sequence reads and optical mapping data. Our method also fulfills the critical need for open source computational methods for analyzing optical mapping data. We apply our method to various assemblies of the loblolly pine, Francisella tularensis, rice and budgerigar genomes. We generated and used stimulated optical mapping data for loblolly pine and F.tularensis and used real optical mapping data for rice and budgerigar. Results: Our results demonstrate that we detect more than 54% of extensively misassembled contigs and more than 60% of locally misassembled contigs in assemblies of F.tularensis and between 31% and 100% of extensively misassembled contigs and between 57% and 73% of locally misassembled contigs in assemblies of loblolly pine. Using the real optical mapping data, we correctly identified 75% of extensively misassembled contigs and 100% of locally misassembled contigs in rice, and 77% of extensively misassembled contigs and 80% of locally misassembled contigs in budgerigar.",
                "authors": [
                    {
                        "name": "Muggli M.D."
                    },
                    {
                        "name": "Puglisi S.J."
                    },
                    {
                        "name": "Ronen R."
                    },
                    {
                        "name": "Boucher C."
                    }
                ],
                "citationCount": 26,
                "date": "2015-06-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Misassembly detection using paired-end sequence reads and optical mapping data"
            },
            "pmid": "26072512"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Data quality management",
            "uri": "http://edamontology.org/topic_3572"
        }
    ],
    "validated": 1
}