{
    "accessibility": "Open access",
    "additionDate": "2022-01-02T19:03:29.269671Z",
    "biotoolsCURIE": "biotools:deepred-mt",
    "biotoolsID": "deepred-mt",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "mvsanchezpuerta@fca.uncu.edu.ar",
            "name": "M. Virginia Sanchez-Puerta"
        }
    ],
    "description": "Deepred-Mt is a novel method to predict C-to-U editing sites in angiosperm mitochondrial RNA. Given an RNA sequence consisting of a central cytidine flanked by 20 nucleotides on each side, Deepred-Mt scores if the central cytidine is edited.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Sequence classification",
                    "uri": "http://edamontology.org/operation_2995"
                },
                {
                    "term": "Homology-based gene prediction",
                    "uri": "http://edamontology.org/operation_3663"
                }
            ]
        }
    ],
    "homepage": "https://github.com/aedera/deepredmt",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-01-02T19:03:29.272408Z",
    "license": "MIT",
    "name": "Deepred-Mt",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.COMPBIOMED.2021.104682",
            "metadata": {
                "abstract": "© 2021 Elsevier LtdIn land plant mitochondria, C-to-U RNA editing converts cytidines into uridines at highly specific RNA positions called editing sites. This editing step is essential for the correct functioning of mitochondrial proteins. When using sequence homology information, edited positions can be computationally predicted with high precision. However, predictions based on the sequence contexts of such edited positions often result in lower precision, which is limiting further advances on novel genetic engineering techniques for RNA regulation. Here, a deep convolutional neural network called Deepred-Mt is proposed. It predicts C-to-U editing events based on the 40 nucleotides flanking a given cytidine. Unlike existing methods, Deepred-Mt was optimized by using editing extent information, novel strategies of data augmentation, and a large-scale training dataset, constructed with deep RNA sequencing data of 21 plant mitochondrial genomes. In comparison to predictive methods based on sequence homology, Deepred-Mt attains significantly better predictive performance, in terms of average precision as well as F1 score. In addition, our approach is able to recognize well-known sequence motifs linked to RNA editing, and shows that the local RNA structure surrounding editing sites may be a relevant factor regulating their editing. These results demonstrate that Deepred-Mt is an effective tool for predicting C-to-U RNA editing in plant mitochondria. Source code, datasets, and detailed use cases are freely available at https://github.com/aedera/deepredmt.",
                "authors": [
                    {
                        "name": "Edera A.A."
                    },
                    {
                        "name": "Small I."
                    },
                    {
                        "name": "Milone D.H."
                    },
                    {
                        "name": "Sanchez-Puerta M.V."
                    }
                ],
                "date": "2021-09-01T00:00:00Z",
                "journal": "Computers in Biology and Medicine",
                "title": "Deepred-Mt: Deep representation learning for predicting C-to-U RNA editing in plant mitochondria"
            },
            "pmid": "34343887"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}