{
    "additionDate": "2021-01-18T08:41:21Z",
    "biotoolsCURIE": "biotools:quadmutnetex",
    "biotoolsID": "quadmutnetex",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "tarodz@vcu.edu",
            "name": "Tomasz Arodz",
            "orcidid": "https://orcid.org/0000-0002-9215-5522",
            "typeEntity": "Person"
        }
    ],
    "description": "a method for detecting cancer driver genes with low mutation frequency.\n\nCancer is caused by genetic mutations, but not all somatic mutations in human DNA drive the emergence or growth of cancers. While many frequently-mutated cancer driver genes have already been identified and are being utilized for diagnostic, prognostic, or therapeutic purposes, identifying driver genes that harbor mutations occurring with low frequency in human cancers is an ongoing endeavor. Typically, mutations that do not confer growth advantage to tumors - passenger mutations - dominate the mutation landscape of tumor cell genome, making identification of low-frequency driver mutations a challenge. The leading approach for discovering new putative driver genes involves analyzing patterns of mutations in large cohorts of patients and using statistical methods to discriminate driver from passenger mutations",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bokhariy/QuaDMutNetEx",
    "lastUpdate": "2021-01-31T13:17:37Z",
    "license": "GPL-3.0",
    "name": "QuaDMutNetEx",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12859-020-3449-2",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Cancer is caused by genetic mutations, but not all somatic mutations in human DNA drive the emergence or growth of cancers. While many frequently-mutated cancer driver genes have already been identified and are being utilized for diagnostic, prognostic, or therapeutic purposes, identifying driver genes that harbor mutations occurring with low frequency in human cancers is an ongoing endeavor. Typically, mutations that do not confer growth advantage to tumors-passenger mutations-dominate the mutation landscape of tumor cell genome, making identification of low-frequency driver mutations a challenge. The leading approach for discovering new putative driver genes involves analyzing patterns of mutations in large cohorts of patients and using statistical methods to discriminate driver from passenger mutations. Results: We propose a novel cancer driver gene detection method, QuaDMutNetEx. QuaDMutNetEx discovers cancer drivers with low mutation frequency by giving preference to genes encoding proteins that are connected in human protein-protein interaction networks, and that at the same time show low deviation from the mutual exclusivity pattern that characterizes driver mutations occurring in the same pathway or functional gene group across a cohort of cancer samples. Conclusions: Evaluation of QuaDMutNetEx on four different tumor sample datasets show that the proposed method finds biologically-connected sets of low-frequency driver genes, including many genes that are not found if the network connectivity information is not considered. Improved quality and interpretability of the discovered putative driver gene sets compared to existing methods shows that QuaDMutNetEx is a valuable new tool for detecting driver genes. QuaDMutNetEx is available for download from https://github.com/bokhariy/QuaDMutNetEx under the GNU GPLv3 license.",
                "authors": [
                    {
                        "name": "Bokhari Y."
                    },
                    {
                        "name": "Alhareeri A."
                    },
                    {
                        "name": "Arodz T."
                    }
                ],
                "date": "2020-03-23T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "QuaDMutNetEx: A method for detecting cancer driver genes with low mutation frequency"
            },
            "pmcid": "PMC7092414",
            "pmid": "32293263"
        }
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}