
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://github.com/phrh/BackCLIP"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/phrh/BackCLIP"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "RNA",
                "uri": "http://edamontology.org/topic_0099"
            },
            {
                "term": "RNA immunoprecipitation",
                "uri": "http://edamontology.org/topic_3794"
            },
            {
                "term": "Transcriptomics",
                "uri": "http://edamontology.org/topic_3308"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/backclip-tool-to-identify-common-rna-background-in-par-clip-datasets.html"
        }
    ],
    "publication": [
        {
            "abstract": "© The Author 2015. Published by Oxford University Press. All rights reserved. Motivation: PAR-CLIP, a CLIP-seq protocol, derives a transcriptome wide set of binding sites for RNA-binding proteins. Even though the protocol uses stringent washing to remove experimental noise, some of it remains. A recent study measured three sets of non-specific RNA backgrounds which are present in several PAR-CLIP datasets. However, a tool to identify the presence of common background in PAR-CLIP datasets is not yet available. Results: We used the measured sets of non-specific RNA backgrounds to build a common background set. Each element from the common background set has a score that reflects its presence in several PAR-CLIP datasets. We present a tool that uses this score to identify the amount of common backgrounds present in a PAR-CLIP dataset, and we provide the user the option to use or remove it. We used the proposed strategy in 30 PAR-CLIP datasets from nine proteins. It is possible to identify the presence of common backgrounds in a dataset and identify differences in datasets for the same protein. This method is the first step in the process of completely removing such backgrounds. Availability: The tool was implemented in python. The common background set and the supplementary data are available at https://github.com/phrh/BackCLIP.",
            "authors": [
                "Reyes-Herrera P.H.",
                "Speck-Hernandez C.A.",
                "Sierra C.A.",
                "Herrera S."
            ],
            "cit_count": 7,
            "journal": "Bioinformatics",
            "pmid": "26227145",
            "title": "BackCLIP: A tool to identify common background presence in PAR-CLIP datasets",
            "year": "2015-05-25"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:backclip",
        "biotoolsID": "backclip",
        "description": "Tool to identify the presence of common RNA background in a PAR-CLIP dataset.",
        "homepage": "https://github.com/phrh/BackCLIP",
        "name": "BackCLIP"
    }
}