
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://sourceforge.net/u/martinbennetzen/profile/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://sourceforge.net/p/phosphosite/wiki/Home/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Proteomics"
        ],
        "language": [
            "R",
            "C#"
        ],
        "operatingSystem": [
            "Windows"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Proteomics",
                "uri": "http://edamontology.org/topic_0121"
            },
            {
                "term": "Protein interaction experiment",
                "uri": "http://edamontology.org/topic_3557"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/phosphositeanalyzer-bioinformatical-tool-for-analyzing-quantitative-phosphoproteome-datasets.html"
        }
    ],
    "publication": [
        {
            "abstract": "Phosphoproteomic experiments are routinely conducted in laboratories worldwide, and because of the fast development of mass spectrometric techniques and efficient phosphopeptide enrichment methods, researchers frequently end up having lists with tens of thousands of phosphorylation sites for further interrogation. To answer biologically relevant questions from these complex data sets, it becomes essential to apply computational, statistical, and predictive analytical methods. Here we provide an advanced bioinformatic platform termed \"PhosphoSiteAnalyzer\" to explore large phosphoproteomic data sets that have been subjected to kinase prediction using the previously published NetworKIN algorithm. NetworKIN applies sophisticated linear motif analysis and contextual network modeling to obtain kinase-substrate associations with high accuracy and sensitivity. PhosphoSiteAnalyzer provides an algorithm to retrieve kinase predictions from the public NetworKIN webpage in a semiautomated way and applies hereafter advanced statistics to facilitate a user-tailored in-depth analysis of the phosphoproteomic data sets. The interface of the software provides a high degree of analytical flexibility and is designed to be intuitive for most users. PhosphoSiteAnalyzer is a freeware program available at http://phosphosite.sourceforge.net. © 2012 American Chemical Society.",
            "authors": [
                "Bennetzen M.V.",
                "Cox J.",
                "Mann M.",
                "Andersen J.S."
            ],
            "cit_count": 14,
            "journal": "Journal of Proteome Research",
            "pmid": "22471441",
            "title": "PhosphoSiteAnalyzer: A bioinformatic platform for deciphering phospho proteomes using kinase predictions retrieved from networkin",
            "year": "2012-06-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:phosphositeanalyzer",
        "biotoolsID": "phosphositeanalyzer",
        "description": "Novel bioinformatical tool for analyzing (quantitative) phosphoproteome datasets. The program retrieves kinase-substrate predictions from NetworKIN (Linding et al) and contains various statistical modules for futher analysis.",
        "homepage": "http://sourceforge.net/projects/phosphosite/",
        "name": "PhosphoSiteAnalyzer"
    }
}