{"credit":[],"function":[{"operation":[{"term":"Nucleic acid curvature calculation","uri":"http://edamontology.org/operation_0461"},{"term":"Molecular dynamics","uri":"http://edamontology.org/operation_2476"},{"term":"Protein hydrophobic moment plotting","uri":"http://edamontology.org/operation_0407"}]}],"labels":{"topic":[{"term":"Small molecules","uri":"http://edamontology.org/topic_0154"},{"term":"NMR","uri":"http://edamontology.org/topic_0593"},{"term":"Molecular dynamics","uri":"http://edamontology.org/topic_0176"},{"term":"X-ray diffraction","uri":"http://edamontology.org/topic_2828"},{"term":"Lipids","uri":"http://edamontology.org/topic_0153"}]},"publication":[{"abstract":"© 2019 Federation of European Biochemical Societiesα-Helical membrane-active antimicrobial peptides (AMPs) are known to act via a range of mechanisms, including the formation of barrel-stave and toroidal pores and the micellisation of the membrane (carpet mechanism). Different mechanisms imply that the peptides adopt different 3D structures when bound at the water–membrane interface, a highly amphipathic environment. Here, an evolutionary algorithm is used to predict the 3D structure of a range of α-helical membrane-active AMPs at the water–membrane interface by optimising amphipathicity. This amphipathic structure prediction (ASP) is capable of distinguishing between curved and linear peptides solved experimentally, potentially allowing the activity and mechanism of action of different membrane-active AMPs to be predicted. The ASP algorithm is accessible via a web interface at http://atb.uq.edu.au/asp/.","authors":["van den Bergen G.","Stroet M.","Caron B.","Poger D.","Mark A.E."],"cit_count":0,"doi":"10.1002/1873-3468.13705","journal":"FEBS Letters","pmid":"31794050","title":"Curved or linear? Predicting the 3-dimensional structure of α-helical antimicrobial peptides in an amphipathic environment","year":"2019-01-01"}],"summary":{"biotoolsCURIE":"biotools:atb","biotoolsID":"atb","description":"Curved or linear? Predicting the 3-dimensional structure of α-helical antimicrobial peptides in an amphipathic environment.\n\nThe Automated Topology Builder (ATB) and Repository is intended to facilitate the development of molecular force fields for Molecular Dynamics or Monte Carlo simulations of biomolecular systems. Applications include the study of biomolecule:ligand complexes, free energy calculations, structure-based drug design and refinement of x-ray crystal complexes.\n\nAutomated Topology Builder (ATB) and Repository.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'ASP', 'membrane-active AMPs', 'water-membrane', 'membrane-active'","homepage":"http://atb.uq.edu.au/","name":"atb"}}