{
    "additionDate": "2021-04-21T22:31:10Z",
    "biotoolsCURIE": "biotools:lofreq",
    "biotoolsID": "lofreq",
    "description": "LoFreq* (i.e. LoFreq version 2) is a fast and sensitive variant-caller for inferring SNVs and indels from next-generation sequencing data. It makes full use of base-call qualities and other sources of errors inherent in sequencing (e.g. mapping or base/indel alignment uncertainty), which are usually ignored by other methods or only used for filtering.",
    "editPermission": {
        "authors": [
            "alexcorm"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://csb5.github.io/lofreq/",
    "language": [
        "C",
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:17:08.811937Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/CSB5/lofreq"
        }
    ],
    "name": "lofreq",
    "owner": "leipzig",
    "publication": [
        {
            "doi": "10.1093/nar/gks918",
            "metadata": {
                "abstract": "The study of cell-population heterogeneity in a range of biological systems, from viruses to bacterial isolates to tumor samples, has been transformed by recent advances in sequencing throughput. While the high-coverage afforded can be used, in principle, to identify very rare variants in a population, existing ad hoc approaches frequently fail to distinguish true variants from sequencing errors. We report a method (LoFreq) that models sequencing run-specific error rates to accurately call variants occurring in <0.05% of a population. Using simulated and real datasets (viral, bacterial and human), we show that LoFreq has near-perfect specificity, with significantly improved sensitivity compared with existing methods and can efficiently analyze deep Illumina sequencing datasets without resorting to approximations or heuristics. We also present experimental validation for LoFreq on two different platforms (Fluidigm and Sequenom) and its application to call rare somatic variants from exome sequencing datasets for gastric cancer. Source code and executables for LoFreq are freely available at http://sourceforge.net/projects/ lofreq/. © 2012 The Author(s).",
                "authors": [
                    {
                        "name": "Aw P.P.K."
                    },
                    {
                        "name": "Bertrand D."
                    },
                    {
                        "name": "Hibberd M.L."
                    },
                    {
                        "name": "Khor C.C."
                    },
                    {
                        "name": "Nagarajan N."
                    },
                    {
                        "name": "Ong S.H."
                    },
                    {
                        "name": "Petric R."
                    },
                    {
                        "name": "Wilm A."
                    },
                    {
                        "name": "Wong C.H."
                    },
                    {
                        "name": "Yeo G.H.T."
                    }
                ],
                "citationCount": 873,
                "date": "2012-12-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "LoFreq: A sequence-quality aware, ultra-sensitive variant caller for uncovering cell-population heterogeneity from high-throughput sequencing datasets"
            },
            "pmcid": "PMC3526318",
            "pmid": "23066108"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "version": [
        "v2.1.5"
    ]
}
