{
    "additionDate": "2021-01-18T07:40:56Z",
    "biotoolsCURIE": "biotools:mtpa",
    "biotoolsID": "mtpa",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Tai-Li Chou",
            "typeEntity": "Person"
        }
    ],
    "description": "A time course analysis with functional near-infrared spectroscopy.\n\nIn the data analysis of functional near-infrared spectroscopy (fNIRS), linear model frameworks, especially the mass univariate analysis (MUA), are often performed when researchers consider examining the difference between conditions at each sampled time point.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Statistical inference",
                    "uri": "http://edamontology.org/operation_3658"
                }
            ]
        }
    ],
    "homepage": "https://github.com/PsyChiLin/MTPAinR",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-02T08:08:14Z",
    "license": "MIT",
    "name": "MTPA",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.3758/S13428-019-01344-9",
            "metadata": {
                "abstract": "© 2020, The Psychonomic Society, Inc.In the data analysis of functional near-infrared spectroscopy (fNIRS), linear model frameworks, in particular mass univariate analysis, are often used when researchers consider examining the difference between conditions at each sampled time point. However, some statistical issues, such as assumptions of linearity, autocorrelation and multiple comparison problems, influence statistical inferences when mass univariate analysis is used on fNIRS time course data. In order to address these issues, the present study proposes a novel perspective, multi-time-point analysis (MTPA), to discriminate signal differences between conditions by combining temporal information from multiple time points in fNIRS. In addition, MTPA adopts the random forest algorithm from the statistical learning domain, followed by a series of cross-validation procedures, providing reasonable power for detecting significant time points and ensuring generalizability. Using a real fNIRS data set, the proposed MTPA outperformed mass univariate analysis in detecting more time points, showing significant differences between experimental conditions. Finally, MTPA was also able to make comparisons between different areas, leading to a novel viewpoint of fNIRS time course analysis and providing additional theoretical implications for future fNIRS studies. The data set and all source code are available for researchers to replicate the analyses and to adapt the program for their own needs in future fNIRS studies.",
                "authors": [
                    {
                        "name": "Chen H.-C."
                    },
                    {
                        "name": "Chou T.-L."
                    },
                    {
                        "name": "Yang Z.-Y."
                    },
                    {
                        "name": "Yu C.-L."
                    }
                ],
                "citationCount": 1,
                "date": "2020-08-01T00:00:00Z",
                "journal": "Behavior Research Methods",
                "title": "Multi-time-point analysis: A time course analysis with functional near-infrared spectroscopy"
            },
            "pmid": "32026386"
        }
    ],
    "toolType": [
        "Library",
        "Script"
    ],
    "topic": [
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ]
}
