{
    "accessibility": "Open access",
    "additionDate": "2022-01-12T22:49:22.541802Z",
    "biotoolsCURIE": "biotools:ml4vis",
    "biotoolsID": "ml4vis",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "huamin@cse.ust.hk",
            "name": "Huamin Qu"
        },
        {
            "email": "yongwang@smu.edu.sg",
            "name": "Yong Wang"
        },
        {
            "email": "zhutian@ucsd.edu",
            "name": "Zhutian Chen"
        },
        {
            "email": "qianwen_wang@hms.harvard.edu",
            "name": "Qianwen Wang"
        }
    ],
    "description": "A web-based interactive browser of a survey on ML4VIS studies",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://ml4vis.github.io",
    "lastUpdate": "2022-01-12T22:49:22.544613Z",
    "license": "Not licensed",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/ML4VIS/ML4VIS.github.io"
        }
    ],
    "name": "ML4VIS",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1109/TVCG.2021.3106142",
            "metadata": {
                "abstract": "IEEEInspired by the great success of machine learning (ML), researchers have applied ML techniques to visualizations to achieve a better design, development, and evaluation of visualizations. This branch of studies, known as ML4VIS, is gaining increasing research attention in recent years. To successfully adapt ML techniques for visualizations, a structured understanding of the integration of ML4VISis needed. In this paper, we systematically survey 88 ML4VIS studies, aiming to answer two motivating questions:what visualization processes can be assisted by MLandhow ML techniques can be used to solve visualization problemsThis survey reveals seven main processes where the employment of ML techniques can benefit visualizations:Data Processing4VIS, Data-VIS Mapping, InsightCommunication, Style Imitation, VIS Interaction, VIS Reading, and User Profiling. The seven processes are related to existing visualization theoretical models in an ML4VIS pipeline, aiming to illuminate the role of ML-assisted visualization in general visualizations.Meanwhile, the seven processes are mapped into main learning tasks in ML to align the capabilities of ML with the needs in visualization. Current practices and future opportunities of ML4VIS are discussed in the context of the ML4VIS pipeline and the ML-VIS mapping. While more studies are still needed in the area of ML4VIS, we hope this paper can provide a stepping-stone for future exploration. A web-based interactive browser of this survey is available at https://ml4vis.github.io",
                "authors": [
                    {
                        "name": "Wang Q."
                    },
                    {
                        "name": "Chen Z."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Qu H."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Visualization and Computer Graphics",
                "title": "A Survey on ML4VIS: Applying MachineLearning Advances to Data Visualization"
            },
            "pmid": "34437063"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        }
    ]
}