
{
    "credit": [
        {
            "email": "helenacarenlab@gmail.com",
            "name": "Helena Carén",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "http://bioconductor.org/packages/release/bioc/html/MethPed.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/MethPed_1.2.0.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Classification",
                    "uri": "http://edamontology.org/operation_2990"
                },
                {
                    "term": "Methylation analysis",
                    "uri": "http://edamontology.org/operation_3204"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "language": [
            "R"
        ],
        "license": "GPL-2.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "Oncology",
                "uri": "http://edamontology.org/topic_2640"
            },
            {
                "term": "Cell biology",
                "uri": "http://edamontology.org/topic_2229"
            },
            {
                "term": "Epigenetics",
                "uri": "http://edamontology.org/topic_3295"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2015, Danielsson et al.Background: Classification of pediatric tumors into biologically defined subtypes is challenging, and multifaceted approaches are needed. For this aim, we developed a diagnostic classifier based on DNA methylation profiles. Results: Methylation data generated by the Illumina Infinium HumanMethylation 450 BeadChip arrays were downloaded from the Gene Expression Omnibus (n = 472). Using the data, we built MethPed, which is a multiclass random forest algorithm, based on DNA methylation profiles from nine subgroups of pediatric brain tumors. DNA from 18 regional samples was used to validate MethPed. MethPed was additionally applied to a set of 28 publically available tumors with the heterogeneous diagnosis PNET. MethPed could successfully separate individual histology tumor types at a very high accuracy (κ = 0.98). Analysis of a regional cohort demonstrated the clinical benefit of MethPed, as confirmation of diagnosis of tumors with clear histology but also identified possible differential diagnoses in tumors with complicated and mixed type morphology. Conclusions: We demonstrate the utility of methylation profiling of pediatric brain tumors and offer MethPed as an easy-to-use toolbox that allows researchers and clinical diagnosticians to test single samples as well as large cohorts for subclass prediction of pediatric brain tumors. This will immediately aid clinical practice and importantly increase our molecular knowledge of these tumors for further therapeutic development.",
            "authors": [
                "Danielsson A.",
                "Nemes S.",
                "Tisell M.",
                "Lannering B.",
                "Nordborg C.",
                "Sabel M.",
                "Caren H."
            ],
            "cit_count": 11,
            "doi": "10.1186/s13148-015-0103-3",
            "journal": "Clinical Epigenetics",
            "title": "MethPed: a DNA methylation classifier tool for the identification of pediatric brain tumor subtypes",
            "type": "Primary",
            "year": "2015-07-09"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:methped",
        "biotoolsID": "methped",
        "description": "Classification of pediatric tumors into biologically defined subtypes is challenging and multifaceted approaches are needed. We developed a diagnostic classifier based on DNA methylation profiles. This tool is a toolbox that allows researchers and clinical diagnosticians to test single samples as well as large cohorts for subclass prediction of pediatric brain tumors. The current version can classify the following: DIPG, Ependymoma, ETMR, GBM, MB3 and 4, MB_WNT, MB_SHH, and PiloAstro.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/MethPed.html",
        "name": "MethPed",
        "version": [
            "1.2.0"
        ]
    }
}