{
    "additionDate": "2021-01-18T10:05:29Z",
    "biotoolsCURIE": "biotools:tara",
    "biotoolsID": "tara",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "tmilenko@nd.edu",
            "name": "Tijana Milenković",
            "orcidid": "https://orcid.org/0000-0002-8023-6907",
            "typeEntity": "Person"
        }
    ],
    "description": "Data-driven network alignment.\n\nNetwork alignment (NA) aims to find a node mapping between compared networks that uncovers regions of high topological similarity, thus allowing for the transfer of functional knowledge between aligned nodes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "homepage": "http://www.nd.edu/~cone/TARA/",
    "lastUpdate": "2021-02-26T16:02:34Z",
    "name": "TARA",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0234978",
            "metadata": {
                "abstract": "© 2020 Gu, Milenković. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.In this study, we deal with the problem of biological network alignment (NA), which aims to find a node mapping between species’ molecular networks that uncovers similar network regions, thus allowing for the transfer of functional knowledge between the aligned nodes. We provide evidence that current NA methods, which assume that topologically similar nodes (i.e., nodes whose network neighborhoods are isomorphic-like) have high functional relatedness, do not actually end up aligning functionally related nodes. That is, we show that the current topological similarity assumption does not hold well. Consequently, we argue that a paradigm shift is needed with how the NA problem is approached. So, we redefine NA as a data-driven framework, called TARA (data-driven NA), which attempts to learn the relationship between topological relatedness and functional relatedness without assuming that topological relatedness corresponds to topological similarity. TARA makes no assumptions about what nodes should be aligned, distinguishing it from existing NA methods. Specifically, TARA trains a classifier to predict whether two nodes from different networks are functionally related based on their network topological patterns (features). We find that TARA is able to make accurate predictions. TARA then takes each pair of nodes that are predicted as related to be part of an alignment. Like traditional NA methods, TARA uses this alignment for the across-species transfer of functional knowledge. TARA as currently implemented uses topological but not protein sequence information for functional knowledge transfer. In this context, we find that TARA outperforms existing state-of-the-art NA methods that also use topological information, WAVE and SANA, and even outperforms or complements a state-of-the-art NA method that uses both topological and sequence information, PrimAlign. Hence, adding sequence information to TARA, which is our future work, is likely to further improve its performance. The software and data are available at http://www.nd.edu/~cone/TARA/.",
                "authors": [
                    {
                        "name": "Gu S."
                    },
                    {
                        "name": "Milenkovic T."
                    }
                ],
                "citationCount": 1,
                "date": "2020-07-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Data-driven network alignment"
            },
            "pmcid": "PMC7331999",
            "pmid": "32614833"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ]
}
