{
    "accessibility": "Open access",
    "additionDate": "2017-02-14T09:36:42Z",
    "biotoolsCURIE": "biotools:dali",
    "biotoolsID": "dali",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "liisa.holm@helsinki.fi",
            "name": "Liisa Holm",
            "orcidid": "https://orcid.org/0000-0002-7807-2966",
            "typeEntity": "Person"
        },
        {
            "email": "holmgroup-webmaster@helsinki.fi",
            "name": "Dali Webmaster",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The Dali server compares newly solved structures against structures in the PDB, allows browsing of pre-computed structural neighborhoods and generates suboptimal alignments from pairwise structure comparisons.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://ekhidna2.biocenter.helsinki.fi/dali/DaliTutorial.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pairwise structure alignment",
                    "uri": "http://edamontology.org/operation_0503"
                },
                {
                    "term": "Protein structure comparison",
                    "uri": "http://edamontology.org/operation_2487"
                },
                {
                    "term": "Structure comparison",
                    "uri": "http://edamontology.org/operation_2483"
                }
            ]
        }
    ],
    "homepage": "http://ekhidna.biocenter.helsinki.fi/dali_server",
    "language": [
        "Java"
    ],
    "lastUpdate": "2022-08-15T10:38:43.836041Z",
    "license": "Not licensed",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://ekhidna2.biocenter.helsinki.fi/dali"
        }
    ],
    "name": "Dali",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_013433"
        }
    ],
    "owner": "liisa",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAC387",
            "metadata": {
                "abstract": "© 2022 The Author(s). Published by Oxford University Press on behalf of Nucleic Acids Research.Protein structure is key to understanding biological function. Structure comparison deciphers deep phylogenies, providing insight into functional conservation and functional shifts during evolution. Until recently, structural coverage of the protein universe was limited by the cost and labour involved in experimental structure determination. Recent breakthroughs in deep learning revolutionized structural bioinformatics by providing accurate structural models of numerous protein families for which no structural information existed. The Dali server for 3D protein structure comparison is widely used by crystallographers to relate new structures to pre-existing ones. Here, we report two most recent upgrades to the web server: (i) the foldomes of key organisms in the AlphaFold Database (version 1) are searchable by Dali, (ii) structural alignments are annotated with protein families. Using these new features, we discovered a novel functionally diverse subgroup within the WRKY/GCM1 clan. This was accomplished by linking the structurally characterized SWI/SNF and NAM families as well as the structural models of the CG-1 family and uncharacterized proteins to the structure of Gti1/Pac2, a previously known member of the WRKY/GCM1 clan. The Dali server is available at http://ekhidna2.biocenter.helsinki.fi/dali. This website is free and open to all users and there is no login requirement.",
                "authors": [
                    {
                        "name": "Holm L."
                    }
                ],
                "date": "2022-07-05T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Dali server: structural unification of protein families"
            },
            "pmcid": "PMC9252788",
            "pmid": "35610055"
        },
        {
            "metadata": {
                "abstract": "Our web site (http://ekhidna.biocenter.helsinki.fi/dali_server) runs the Dali program for protein structure comparison. The web site consists of three parts: (i) the Dali server compares newly solved structures against structures in the Protein Data Bank (PDB), (ii) the Dali database allows browsing precomputed structural neighbourhoods and (iii) the pairwise comparison generates suboptimal alignments for a pair of structures. Each part has its own query form and a common format for the results page. The inputs are either PDB identifiers or novel structures uploaded by the user. The results pages are hyperlinked to aid interactive analysis. The web interface is simple and easy to use. The key purpose of interactive analysis is to check whether conserved residues line up in multiple structural alignments and how conserved residues and ligands cluster together in multiple structure superimpositions. In favourable cases, protein structure comparison can lead to evolutionary discoveries not detected by sequence analysis. © The Author(s) 2010. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Holm L."
                    },
                    {
                        "name": "Rosenstrom P."
                    }
                ],
                "citationCount": 2996,
                "date": "2010-05-10T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Dali server: Conservation mapping in 3D"
            },
            "pmid": "20457744"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        }
    ],
    "validated": 1
}
