{
    "additionDate": "2017-01-13T13:17:02Z",
    "biotoolsCURIE": "biotools:virushunter",
    "biotoolsID": "virushunter",
    "description": "This is a tool for the identification of viruses and their integration sites in host genomes using any type of NGS data. Its unique features include the characterization of insertion loci of any type of virus in the host genome and high accuracy and computational efficiency because of its well-designed pipeline.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "homepage": "http://pathology.wustl.edu/VirusHunter/",
    "lastUpdate": "2021-04-25T12:36:39Z",
    "name": "VirusHunter",
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_001198"
        }
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0078470",
            "metadata": {
                "abstract": "Quick and accurate identification of microbial pathogens is essential for both diagnosis and response to emerging infectious diseases. The advent of next-generation sequencing technology offers an unprecedented platform for rapid sequencing-based identification of novel viruses. We have developed a customized bioinformatics data analysis pipeline, VirusHunter, for the analysis of Roche/454 and other long read Next generation sequencing platform data. To illustrate the utility of VirusHunter, we performed Roche/454 GS FLX titanium sequencing on two unclassified virus isolates from the World Reference Center for Emerging Viruses and Arboviruses (WRCEVA). VirusHunter identified sequences derived from a novel bunyavirus and a novel reovirus in the two samples respectively. Further sequence analysis demonstrated that the viruses were novel members of the Phlebovirus and Orbivirus genera. Both Phlebovirus and Orbivirus genera include many economic important viruses or serious human pathogens. © 2013 Zhao et al.",
                "authors": [
                    {
                        "name": "Zhao G."
                    },
                    {
                        "name": "Krishnamurthy S."
                    },
                    {
                        "name": "Cai Z."
                    },
                    {
                        "name": "Popov V.L."
                    },
                    {
                        "name": "Travassos da Rosa A.P."
                    },
                    {
                        "name": "Guzman H."
                    },
                    {
                        "name": "Cao S."
                    },
                    {
                        "name": "Virgin H.W."
                    },
                    {
                        "name": "Tesh R.B."
                    },
                    {
                        "name": "Wang D."
                    }
                ],
                "citationCount": 57,
                "date": "2013-10-22T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Identification of Novel Viruses Using VirusHunter -- an Automated Data Analysis Pipeline"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Virology",
            "uri": "http://edamontology.org/topic_0781"
        }
    ],
    "validated": 1
}