{
    "additionDate": "2021-01-18T11:54:21Z",
    "biotoolsCURIE": "biotools:mal-prec",
    "biotoolsID": "mal-prec",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "changshui@hotmail.com",
            "name": "Xiao Zhang",
            "typeEntity": "Person"
        },
        {
            "email": "flyinsky6@gmail.com",
            "name": "Xin Liu",
            "typeEntity": "Person"
        }
    ],
    "description": "Computational prediction of protein Malonylation sites via machine learning based feature integration.\n\nMal-Prec is a supervised machine learning classification to predict malonylated sites. In Mal-Prec, three encoding method including One-hot encoding, physiochemical properties (AAindex), and composition of k-spaced acid pairs (CKSAAP) were initially performed to extract sequence features. PCA was then applied to select optimal feature subsets while SVM was adopted to predict the malonylation sites. Five-fold cross-validation test and independent test results showed that Mal-Prec can achieve better prediction performance compared with other approaches.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "PTM identification",
                    "uri": "http://edamontology.org/operation_3645"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                }
            ]
        }
    ],
    "homepage": "https://github.com/flyinsky6/Mal-Prec",
    "language": [
        "C",
        "MATLAB"
    ],
    "lastUpdate": "2021-02-19T09:16:10Z",
    "name": "Mal-Prec",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12864-020-07166-W",
            "metadata": {
                "abstract": "© 2020, The Author(s).Background: Malonylation is a recently discovered post-translational modification that is associated with a variety of diseases such as Type 2 Diabetes Mellitus and different types of cancers. Compared with experimental identification of malonylation sites, computational method is a time-effective process with comparatively low costs. Results: In this study, we proposed a novel computational model called Mal-Prec (Malonylation Prediction) for malonylation site prediction through the combination of Principal Component Analysis and Support Vector Machine. One-hot encoding, physio-chemical properties, and composition of k-spaced acid pairs were initially performed to extract sequence features. PCA was then applied to select optimal feature subsets while SVM was adopted to predict malonylation sites. Five-fold cross-validation results showed that Mal-Prec can achieve better prediction performance compared with other approaches. AUC (area under the receiver operating characteristic curves) analysis achieved 96.47 and 90.72% on 5-fold cross-validation of independent data sets, respectively. Conclusion: Mal-Prec is a computationally reliable method for identifying malonylation sites in protein sequences. It outperforms existing prediction tools and can serve as a useful tool for identifying and discovering novel malonylation sites in human proteins. Mal-Prec is coded in MATLAB and is publicly available at https://github.com/flyinsky6/Mal-Prec, together with the data sets used in this study.",
                "authors": [
                    {
                        "name": "Hu J."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Wang L."
                    },
                    {
                        "name": "Zhang X."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Mal-Prec: computational prediction of protein Malonylation sites via machine learning based feature integration: Malonylation site prediction"
            },
            "pmcid": "PMC7682087",
            "pmid": "33225896"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        }
    ]
}
