{
    "additionDate": "2021-01-18T07:56:27Z",
    "biotoolsCURIE": "biotools:lipidr",
    "biotoolsID": "lipidr",
    "confidence_flag": "tool",
    "description": "A Software Tool for Data Mining and Analysis of Lipidomics Datasets.\n\nData Mining and Analysis of Lipidomics Datasets.\n\nlipidr: Data Mining and Analysis of Lipidomics Datasets in R.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Box-Whisker plot plotting",
                    "uri": "http://edamontology.org/operation_2943"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                }
            ]
        }
    ],
    "homepage": "https://www.lipidr.org/",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-17T06:58:15Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/ahmohamed/lipidr"
        }
    ],
    "name": "lipidr",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1021/ACS.JPROTEOME.0C00082",
            "metadata": {
                "abstract": "Copyright © 2020 American Chemical Society.The rapid evolution of mass spectrometry (MS)-based lipidomics has enabled the simultaneous measurement of numerous lipid classes. With lipidomics datasets becoming increasingly available, lipidomic-focused software tools are required to facilitate data analysis as well as mining of public datasets, integrating lipidomics-unique molecular information such as lipid class, chain length, and unsaturation. To address this need, we developed lipidr, an open-source R/Bioconductor package for data mining and analysis of lipidomics datasets. lipidr implements a comprehensive lipidomic-focused analysis workflow for targeted and untargeted lipidomics. lipidr imports numerical matrices, Skyline exports, and Metabolomics Workbench files directly into R, automatically inferring lipid class and chain information from lipid names. Through integration with the Metabolomics Workbench API, users can search, download, and reanalyze public lipidomics datasets seamlessly. lipidr allows thorough data inspection, normalization, and uni-and multivariate analyses, displaying results as interactive visualizations. To enable interpretation of lipid class, chain length, and total unsaturation data, we also developed and implemented a novel lipid set enrichment analysis. A companion online guide with two live example datasets is presented at https://www.lipidr.org/. We expect that the ease of use and innovative features of lipidr will allow the lipidomics research community to gain novel detailed insights from lipidomics data.",
                "authors": [
                    {
                        "name": "Mohamed A."
                    },
                    {
                        "name": "Molendijk J."
                    },
                    {
                        "name": "Hill M.M."
                    }
                ],
                "citationCount": 15,
                "date": "2020-07-02T00:00:00Z",
                "journal": "Journal of Proteome Research",
                "title": "Lipidr: A Software Tool for Data Mining and Analysis of Lipidomics Datasets"
            },
            "pmid": "32168452"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Lipids",
            "uri": "http://edamontology.org/topic_0153"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}