{
    "additionDate": "2021-01-18T12:04:05Z",
    "biotoolsCURIE": "biotools:scool",
    "biotoolsID": "scool",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "wolffj@informatik.uni-freiburg.de",
            "name": "Joachim Wolff",
            "typeEntity": "Person"
        }
    ],
    "description": "a new data storage format for single-cell Hi-C data.\n\nSingle-cell Hi-C research currently lacks an efficient, easy to use and shareable data storage format. Recent studies have used a variety of sub-optimal solutions: publishing raw data only, text based interaction matrices, or reusing established Hi-C storage formats for single interaction matrices. These approaches are storage and pre-processing intensive, require long labour time and are often error-prone. RESULTS:The single-cell cooler file format (scool) provides an efficient, user-friendly and storage-saving approach for single-cell Hi-C data. It is a flavour of the established cooler format and guarantees stable API support. AVAILABILITY:The single-cell cooler format is part of the cooler file format as of API version 0.8.9. It is available via pip, conda and github.\n\n\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'cooler'",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                }
            ]
        }
    ],
    "homepage": "https://github.com/open2c/cooler",
    "lastUpdate": "2021-02-13T14:41:01Z",
    "name": "scool",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA924",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press.Motivation: Single-cell Hi-C research currently lacks an efficient, easy to use and shareable data storage format. Recent studies have used a variety of sub-optimal solutions: publishing raw data only, text-based interaction matrices, or reusing established Hi-C storage formats for single interaction matrices. These approaches are storage and pre-processing intensive, require long labour time and are often error-prone. Results: The single-cell cooler file format (scool) provides an efficient, user-friendly and storage-saving approach for single-cell Hi-C data. It is a flavour of the established cooler format and guarantees stable API support.",
                "authors": [
                    {
                        "name": "Abdennur N."
                    },
                    {
                        "name": "Backofen R."
                    },
                    {
                        "name": "Gruning B."
                    },
                    {
                        "name": "Wolff J."
                    }
                ],
                "date": "2021-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Scool: A new data storage format for single-cell Hi-C data"
            },
            "pmid": "33135074"
        }
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        }
    ]
}
