{
    "additionDate": "2022-12-23T08:29:47.017283Z",
    "biotoolsCURIE": "biotools:ccs-net",
    "biotoolsID": "ccs-net",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Shuo Zhang"
        }
    ],
    "description": "Cascade Detection Network with the Convolution Kernel Switch Block and Statistics Optimal Anchors Block in Hypopharyngeal Cancer MRI.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/zhongqiu1245/CCS-Net",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-12-23T08:29:47.020105Z",
    "license": "Not licensed",
    "name": "CCS-Net",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1109/JBHI.2022.3217174",
            "metadata": {
                "abstract": "IEEEMagnetic resonance imaging (MRI) is a common diagnostic method for hypopharyngeal cancer (HPC). It is a challenge to automatically detect HPC tumors and swollen lymph nodes (HPC risk areas) from MRI slices because of the small size and irregular shape of HPC risk areas. Herein, we propose a cascade detection network with Convolution Kernel Switch (CKS) Block and Statistics Optimal Anchors (SOA) Block in HPC MRI (CCS-Net). CKS Block can adaptively switch standard convolution to deformable convolution in some appropriate layers to detect irregular objects more efficiently without taking up too much computing resources. SOA Block can automatically generate the optimal anchors based on the size distribution of objects. Compared with other methods, our method achieves splendid detection performance and outperforms other methods on the HPC dataset (more than 1800 T2 MRI slices), achieving the highest AP<sub>50</sub> of 78.90&#x0025;. Experiments show that the proposed network can be the basis of a computer aided diagnosis utility that helps achieve faster and more accurate diagnostic decisions for HPC. The code is available at: https:&#x002F;&#x002F;github.com&#x002F;zhongqiu1245&#x002F;CCS-Net.",
                "authors": [
                    {
                        "name": "An C."
                    },
                    {
                        "name": "Chen J."
                    },
                    {
                        "name": "Han L."
                    },
                    {
                        "name": "Huang Z."
                    },
                    {
                        "name": "Liu H."
                    },
                    {
                        "name": "Miao Y."
                    },
                    {
                        "name": "Pei N."
                    },
                    {
                        "name": "Zhang S."
                    },
                    {
                        "name": "Zhang X."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "IEEE Journal of Biomedical and Health Informatics",
                "title": "CCS-Net: Cascade Detection Network with the Convolution Kernel Switch Block and Statistics Optimal Anchors Block in Hypopharyngeal Cancer MRI"
            },
            "pmid": "36282819"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Computer science",
            "uri": "http://edamontology.org/topic_3316"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ],
    "validated": 1
}
