{
    "additionDate": "2017-08-03T19:05:59Z",
    "biotoolsCURIE": "biotools:hot_scan",
    "biotoolsID": "hot_scan",
    "credit": [
        {
            "name": "Rafael Rosales",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://dcm.ffclrp.usp.br/~rrosales/"
        }
    ],
    "description": "Free software to detect genomic regions unusually rich (hotspot) in a given pattern via scan statistics.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/itojal/hot_scan/blob/master/hot_scan_man.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence motif recognition",
                    "uri": "http://edamontology.org/operation_0239"
                }
            ]
        }
    ],
    "homepage": "https://github.com/itojal/hot_scan",
    "language": [
        "R",
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:55Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/hot_scan-detect-genomic-regions-unusually-rich-in-translocation-breakpoints.html"
        }
    ],
    "name": "hot_scan",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2014 The Author.Motivation: The detection of genomic regions unusually rich in a given pattern is an important undertaking in the analysis of next-generation sequencing data. Recent studies of chromosomal translocations in activated B lymphocytes have identified regions that are frequently translocated to c-myc oncogene. A quantitative method for the identification of translocation hotspots was crucial to this study. Here we improve this analysis by using a simple probabilistic model and the framework provided by scan statistics to define the number and location of translocation breakpoint hotspots. A key feature of our method is that it provides a global chromosome-wide nominal control level to clustering, as opposed to previous methods based on local criteria. While being motivated by a specific application, the detection of unusual clusters is a widespread problem in bioinformatics. We expect ourmethod to be useful in the analysis of data from other experimental approaches such as of ChIP-seq and 4C-seq.Results: The analysis of translocations from B lymphocytes with the method described here reveals the presence of longer hotspots when compared with those defined previously. Further, we show that the hotspot size changes substantially in the absence of DNA repair protein 53BP1. When 53BP1 deficiency is combined with overexpression of activation-induced cytidine deaminase, the hotspot length increases even further. These changes are not detected by previous methods that use local significance criteria for clustering. Our method is also able to identify several exclusive translocation hotspots located in genes of known tumor supressors.Availability and implementation: The detection of translocation hotspots is done with hot-scan, a program implemented in R and Perl. Source code and documentation are freely available for download at https://github.com/itojal/hot-scan.",
                "authors": [
                    {
                        "name": "Silva I.T."
                    },
                    {
                        "name": "Rosales R.A."
                    },
                    {
                        "name": "Holanda A.J."
                    },
                    {
                        "name": "Nussenzweig M.C."
                    },
                    {
                        "name": "Jankovic M."
                    }
                ],
                "citationCount": 3,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Identification of chromosomal translocation hotspots via scan statistics"
            },
            "pmid": "24860160"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}