{
    "additionDate": "2020-01-14T09:00:03Z",
    "biotoolsCURIE": "biotools:SBML2Modelica",
    "biotoolsID": "SBML2Modelica",
    "confidence_flag": "tool",
    "description": "SBML2Modelica is a tool which translates biochemical models written in System Biology Markup Language (SBML) Version 3 Level 2 into well-structured, user-intelligible, easily-modifiable Modelica models.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Network simulation",
                    "uri": "http://edamontology.org/operation_3562"
                }
            ]
        }
    ],
    "homepage": "https://bitbucket.org/mclab/sbml2modelica",
    "language": [
        "Java"
    ],
    "lastUpdate": "2021-01-16T12:53:13Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://www.sbml.org"
        },
        {
            "type": [
                "Other"
            ],
            "url": "http://www.modelica.org"
        }
    ],
    "name": "SBML2Modelica",
    "owner": "tmancini",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ860",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press.Motivation: SBML is the most widespread language for the definition of biochemical models. Although dozens of SBML simulators are available, there is a general lack of support to the integration of SBML models within open-standard general-purpose simulation ecosystems. This hinders co-simulation and integration of SBML models within larger model networks, in order to, e.g. enable in silico clinical trials of drugs, pharmacological protocols, or engineering artefacts such as biomedical devices against Virtual Physiological Human models. Modelica is one of the most popular existing open-standard general-purpose simulation languages, supported by many simulators. Modelica models are especially suited for the definition of complex networks of heterogeneous models from virtually all application domains. Models written in Modelica (and in 100+ other languages) can be readily exported into black-box Functional Mock-Up Units (FMUs), and seamlessly co-simulated and integrated into larger model networks within open-standard language-independent simulation ecosystems. Results: In order to enable SBML model integration within heterogeneous model networks, we present SBML2Modelica, a software system translating SBML models into well-structured, user-intelligible, easily modifiable Modelica models. SBML2Modelica is SBML Level 3 Version 2-compliant and succeeds on 96.47% of the SBML Test Suite Core (with a few rare, intricate and easily avoidable combinations of constructs unsupported and cleanly signalled to the user). Our experimental campaign on 613 models from the BioModels database (with up to 5438 variables) shows that the major open-source (general-purpose) Modelica and FMU simulators achieve performance comparable to state-of-the-art specialized SBML simulators.",
                "authors": [
                    {
                        "name": "Maggioli F."
                    },
                    {
                        "name": "Mancini T."
                    },
                    {
                        "name": "Tronci E."
                    }
                ],
                "citationCount": 8,
                "date": "2020-04-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "SBML2Modelica: Integrating biochemical models within open-standard simulation ecosystems"
            },
            "pmid": "31738386"
        }
    ],
    "topic": [
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        }
    ],
    "validated": 1
}