{
    "additionDate": "2020-01-14T09:53:07Z",
    "biotoolsCURIE": "biotools:scale-up",
    "biotoolsID": "scale-up",
    "confidence_flag": "very low",
    "credit": [
        {
            "email": "heather.mckay@ubc.ca",
            "name": "Heather McKay",
            "orcidid": "https://orcid.org/0000-0002-5158-8006",
            "typeEntity": "Person"
        }
    ],
    "description": "Implementation and scale-up of physical activity and behavioural nutrition interventions.\n\nBACKGROUND:Interventions that work must be effectively delivered at scale to achieve population level benefits. Researchers must choose among a vast array of implementation frameworks (> 60) that guide design and evaluation of implementation and scale-up processes. Therefore, we sought to recommend conceptual frameworks that can be used to design, inform, and evaluate implementation of physical activity (PA) and nutrition interventions at different stages of the program life cycle. We also sought to recommend a minimum data set of implementation outcome and determinant variables (indicators) as well as measures and tools deemed most relevant for PA and nutrition researchers. METHODS:We adopted a five-round modified Delphi methodology.\n\n||| HOMEPAGE MISSING!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'frameworks'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31699095",
    "language": [
        "Delphi"
    ],
    "lastUpdate": "2020-01-14T09:53:07Z",
    "name": "scale-up",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12966-019-0868-4",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Interventions that work must be effectively delivered at scale to achieve population level benefits. Researchers must choose among a vast array of implementation frameworks (> 60) that guide design and evaluation of implementation and scale-up processes. Therefore, we sought to recommend conceptual frameworks that can be used to design, inform, and evaluate implementation of physical activity (PA) and nutrition interventions at different stages of the program life cycle. We also sought to recommend a minimum data set of implementation outcome and determinant variables (indicators) as well as measures and tools deemed most relevant for PA and nutrition researchers. Methods: We adopted a five-round modified Delphi methodology. For rounds 1, 2, and 3 we administered online surveys to PA and nutrition implementation scientists to generate a rank order list of most commonly used; i) implementation and scale-up frameworks, ii) implementation indicators, and iii) implementation and scale-up measures and tools. Measures and tools were excluded after round 2 as input from participants was very limited. For rounds 4 and 5, we conducted two in-person meetings with an expert group to create a shortlist of implementation and scale-up frameworks, identify a minimum data set of indicators and to discuss application and relevance of frameworks and indicators to the field of PA and nutrition. Results: The two most commonly referenced implementation frameworks were the Framework for Effective Implementation and the Consolidated Framework for Implementation Research. We provide the 25 most highly ranked implementation indicators reported by those who participated in rounds 1-3 of the survey. From these, the expert group created a recommended minimum data set of implementation determinants (n = 10) and implementation outcomes (n = 5) and reconciled differences in commonly used terms and definitions. Conclusions: Researchers are confronted with myriad options when conducting implementation and scale-up evaluations. Thus, we identified and prioritized a list of frameworks and a minimum data set of indicators that have potential to improve the quality and consistency of evaluating implementation and scale-up of PA and nutrition interventions. Advancing our science is predicated upon increased efforts to develop a common 'language' and adaptable measures and tools.",
                "authors": [
                    {
                        "name": "McKay H."
                    },
                    {
                        "name": "Naylor P.-J."
                    },
                    {
                        "name": "Lau E."
                    },
                    {
                        "name": "Gray S.M."
                    },
                    {
                        "name": "Wolfenden L."
                    },
                    {
                        "name": "Milat A."
                    },
                    {
                        "name": "Bauman A."
                    },
                    {
                        "name": "Race D."
                    },
                    {
                        "name": "Nettlefold L."
                    },
                    {
                        "name": "Sims-Gould J."
                    }
                ],
                "citationCount": 1,
                "date": "2019-11-07T00:00:00Z",
                "journal": "International Journal of Behavioral Nutrition and Physical Activity",
                "title": "Implementation and scale-up of physical activity and behavioural nutrition interventions: An evaluation roadmap"
            },
            "pmcid": "PMC6839114",
            "pmid": "31699095"
        }
    ],
    "topic": [
        {
            "term": "Nutritional science",
            "uri": "http://edamontology.org/topic_3390"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ]
}