
{
    "credit": [
        {
            "email": "info@baseclear.com",
            "name": "SSPACE Support",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Perl"
        ],
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Summary: De novo assembly tools play a main role in reconstructing genomes from next-generation sequencing (NGS) data and usually yield a number of contigs. Using paired-read sequencing data it is possible to assess the order, distance and orientation of contigs and combine them into so-called scaffolds. Although the latter process is a crucial step in finishing genomes, scaffolding algorithms are often built-in functions in de novo assembly tools and cannot be independently controlled. We here present a new tool, called SSPACE, which is a stand-alone scaffolder of pre-assembled contigs using paired-read data. Main features are: a short runtime, multiple library input of paired-end and/or mate pair datasets and possible contig extension with unmapped sequence reads. SSPACE shows promising results on both prokaryote and eukaryote genomic testsets where the amount of initial contigs was reduced by at least 75%. © The Author 2010. Published by Oxford University Press.",
            "authors": [
                "Boetzer M.",
                "Henkel C.V.",
                "Jansen H.J.",
                "Butler D.",
                "Pirovano W."
            ],
            "cit_count": 1063,
            "journal": "Bioinformatics",
            "pmid": "21149342",
            "title": "Scaffolding pre-assembled contigs using SSPACE",
            "year": "2011-02-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:sspace",
        "biotoolsID": "sspace",
        "description": "Stand-alone scaffolder of pre-assembled contigs using paired-read data.",
        "homepage": "https://www.baseclear.com/genomics/bioinformatics/basetools/SSPACE",
        "name": "SSPACE"
    }
}