{
    "additionDate": "2021-01-18T10:09:09Z",
    "biotoolsCURIE": "biotools:rasco",
    "biotoolsID": "rasco",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "dbandyop@vcu.edu",
            "name": "Dipankar Bandyopadhyay",
            "typeEntity": "Person"
        }
    ],
    "description": "Assessing spatial confounding in cancer disease mapping using R.\n\nRASCO: An R package to Alleviate the Spatial Confounding.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/douglasmesquita/RASCO",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-03T14:45:02Z",
    "name": "RASCO",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1002/CNR2.1263",
            "metadata": {
                "abstract": "© 2020 Wiley Periodicals LLC.Background: Exploring spatial patterns in the context of cancer disease mapping (DM) is a decisive approach to bring evidence of geographical tendencies in assessing disease status and progression. However, this framework is not insulated from spatial confounding, a topic of significant interest in cancer epidemiology, where the latent correlation between the spatial random effects and fixed effects (such as covariates), often lead to misleading interpretation. Aims: To introduce three popular approaches (RHZ, HH and SPOCK; details in paper) often employed to tackle spatial confounding, and illustrate their implementation in cancer research via the popular statistical software R. Methods: As a solution to alleviate spatial confounding, restricted spatial regressions are constructed by either projecting the latent effect onto the orthogonal space of covariates, or by displacing the spatial locations. Popular parametric count data models, such as the Poisson, generalized Poisson and negative binomial, were considered for the areal count responses, while the spatial association is quantified via the conditional autoregressive (CAR) model. Our method of inference in Bayesian, sometimes aided by the integrated nested Laplace approximation (INLA) to accelerate computing. The methods are implemented in the R package RASCO available from the first author's GitHub page. Results: The results reveal that all three methods perform well in alleviating the bias and variance inflation present in the spatial models. The effects of spatial confounding were also explored, which, if ignored in practice, may lead to wrong conclusions. Conclusion: Spatial confounding continues to remain a critical bottleneck in deriving precise inference from spatial DM models. Hence, its effects must be investigated, and mitigated. Several approaches are available in the literature, and they produce trustworthy results. The central contribution of this paper is providing the practitioners the R package RASCO, capable of fitting a large number of spatial models, as well as their restricted versions.",
                "authors": [
                    {
                        "name": "Abdel-Salam A.-S.G."
                    },
                    {
                        "name": "Azevedo D.R.M."
                    },
                    {
                        "name": "Bandyopadhyay D."
                    },
                    {
                        "name": "Garcia D."
                    },
                    {
                        "name": "Prates M.O."
                    }
                ],
                "citationCount": 1,
                "date": "2020-08-01T00:00:00Z",
                "journal": "Cancer Reports",
                "title": "Assessing spatial confounding in cancer disease mapping using R"
            },
            "pmid": "32721138"
        }
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
