{
    "additionDate": "2017-08-03T18:59:02Z",
    "biotoolsCURIE": "biotools:sana",
    "biotoolsID": "sana",
    "credit": [
        {
            "email": "zxs@amt.ac.cn",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.aporc.org/"
        }
    ],
    "description": "An algorithm for the alignment of two proteins. Specifically, core regions in two protein structures are first aligned by identifying connected components in a network of neighboring, geometrically compatible aligned fragment pairs (AFPs). The initial alignments then are refined through a multi-objective optimization method. The algorithm can produce both sequential and non-sequential alignments.",
    "documentation": [
        {
            "type": "General",
            "url": "http://doc.aporc.org/wiki/SANA"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Structure alignment",
                    "uri": "http://edamontology.org/operation_0295"
                }
            ]
        }
    ],
    "homepage": "http://doc.aporc.org/wiki/SANA",
    "homepage_status": 1,
    "lastUpdate": "2019-02-05T13:36:31Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/sana-protein-structure-alignment-neighborhood-alignment.html"
        }
    ],
    "name": "SANA",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Protein structure alignment algorithms play an important role in the studies of protein structure and function. In this paper, a novel approach for structure alignment is presented. Specifically, core regions in two protein structures are first aligned by identifying connected components in a network of neighboring geometrically compatible aligned fragment pairs. The initial alignments then are refined through a multi-objective optimization method. The algorithm can produce both sequential and non-sequential alignments. We show the superior performance of the proposed algorithm by the computational experiments on several benchmark datasets and the comparisons with the well-known structure alignment algorithms such as DALI, CE and MATT. The proposed method can obtain accurate and biologically significant alignment results for the case with occurrence of internal repeats or indels, identify the circular permutations, and reveal conserved functional sites. A ranking criterion of our algorithm for fold similarity is presented and found to be comparable or superior to the Z-score of CE in most cases from the numerical experiments. The software and supplementary data of computational results are available at http://zhangroup.aporc.org/bioinfo/SANA. © Springer-Verlag 2010.",
                "authors": [
                    {
                        "name": "Wang L."
                    },
                    {
                        "name": "Wu L.-Y."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Zhang X.-S."
                    },
                    {
                        "name": "Chen L."
                    }
                ],
                "citationCount": 3,
                "date": "2010-07-01T00:00:00Z",
                "journal": "Amino Acids",
                "title": "SANA: An algorithm for sequential and non-sequential protein structure alignment"
            },
            "pmid": "20127263"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        }
    ],
    "validated": 1
}