{
    "additionDate": "2017-08-03T18:55:02Z",
    "biotoolsCURIE": "biotools:parfr",
    "biotoolsID": "parfr",
    "credit": [
        {
            "email": "g.montana@imperial.ac.uk",
            "name": "Giovanni Montana",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www2.imperial.ac.uk/~gmontana/"
        }
    ],
    "description": "Parallel version of RF for regression tasks with both univariate and multivariate responses  to support multivariate quantitative trait loci mapping in unrelated subjects.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://wwwf.imperial.ac.uk/~gmontana/software/parfr/PaRFR_Manual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Classification",
                    "uri": "http://edamontology.org/operation_2990"
                }
            ]
        }
    ],
    "homepage": "http://www2.imperial.ac.uk/~gmontana/parfr.htm",
    "homepage_status": 1,
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/parfr-parallel-random-forest-regression-for-hadoop.html"
        }
    ],
    "name": "PaRFR",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: Multivariate quantitative traits arise naturally in recent neuroimaging genetics studies, in which both structural and functional variability of the human brain is measured non-invasively through techniques such as magnetic resonance imaging (MRI). There is growing interest in detecting genetic variants associated with such multivariate traits, especially in genome-wide studies. Random forests (RFs) classifiers, which are ensembles of decision trees, are amongst the best performing machine learning algorithms and have been successfully employed for the prioritisation of genetic variants in case-control studies. RFs can also be applied to produce gene rankings in association studies with multivariate quantitative traits, and to estimate genetic similarities measures that are predictive of the trait. However, in studies involving hundreds of thousands of SNPs and high-dimensional traits, a very large ensemble of trees must be inferred from the data in order to obtain reliable rankings, which makes the application of these algorithms computationally prohibitive.Results: We have developed a parallel version of the RF algorithm for regression and genetic similarity learning tasks in large-scale population genetic association studies involving multivariate traits, called PaRFR (Parallel Random Forest Regression). Our implementation takes advantage of the MapReduce programming model and is deployed on Hadoop, an open-source software framework that supports data-intensive distributed applications. Notable speed-ups are obtained by introducing a distance-based criterion for node splitting in the tree estimation process. PaRFR has been applied to a genome-wide association study on Alzheimer's disease (AD) in which the quantitative trait consists of a high-dimensional neuroimaging phenotype describing longitudinal changes in the human brain structure. PaRFR provides a ranking of SNPs associated to this trait, and produces pair-wise measures of genetic proximity that can be directly compared to pair-wise measures of phenotypic proximity. Several known AD-related variants have been identified, including APOE4 and TOMM40. We also present experimental evidence supporting the hypothesis of a linear relationship between the number of top-ranked mutated states, or frequent mutation patterns, and an indicator of disease severity.Availability: The Java codes are freely available at http://www2.imperial.ac.uk/~gmontana. © 2013 Wang et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Goh W."
                    },
                    {
                        "name": "Montana G."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Wong L."
                    }
                ],
                "citationCount": 39,
                "date": "2013-10-22T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Random forests on Hadoop for genome-wide association studies of multivariate neuroimaging phenotypes"
            },
            "pmid": "24564704"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        }
    ],
    "validated": 1
}
