{
    "additionDate": "2020-01-09T17:31:16Z",
    "biotoolsCURIE": "biotools:ProCarbDB",
    "biotoolsID": "ProCarbDB",
    "confidence_flag": "tool",
    "description": "a database of carbohydrate-binding proteins.\n\nAn open access database ready to answer your sweetest queries.\n\nCarbohydrate-binding proteins play crucial roles across all viruses and organisms",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                }
            ]
        }
    ],
    "homepage": "http://www.procarbdb.science/procarb",
    "lastUpdate": "2020-12-06T10:45:18.582947Z",
    "name": "ProCarbDB",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/NAR/GKZ860",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press on behalf of Nucleic Acids Research.Carbohydrate-binding proteins play crucial roles across all organisms and viruses. The complexity of carbohydrate structures, together with inconsistencies in how their 3D structures are reported, has led to difficulties in characterizing the protein-carbohydrate interfaces. In order to better understand protein-carbohydrate interactions, we have developed an open-access database, ProCarbDB, which, unlike the Protein Data Bank (PDB), clearly distinguishes between the complete carbohydrate ligands and their monomeric units. ProCarbDB is a comprehensive database containing over 5200 3D X-ray crystal structures of protein-carbohydrate complexes. In ProCarbDB, the complete carbohydrate ligands are annotated and all their interactions are displayed. Users can also select any protein residue in the proximity of the ligand to inspect its interactions with the carbohydrate ligand and with other neighbouring protein residues. Where available, additional curated information on the binding affinity of the complex and the effects of mutations on the binding have also been provided in the database. We believe that ProCarbDB will be an invaluable resource for understanding protein-carbohydrate interfaces. The ProCarbDB web server is freely available at http://www.procarbdb.science/procarb.",
                "authors": [
                    {
                        "name": "Copoiu L."
                    },
                    {
                        "name": "Torres P.H.M."
                    },
                    {
                        "name": "Ascher D.B."
                    },
                    {
                        "name": "Blundell T.L."
                    },
                    {
                        "name": "Malhotra S."
                    }
                ],
                "citationCount": 4,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "ProCarbDB: A database of carbohydrate-binding proteins"
            },
            "pmid": "31598690"
        }
    ],
    "topic": [
        {
            "term": "Carbohydrates",
            "uri": "http://edamontology.org/topic_0152"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}