
{
    "credit": [
        {
            "email": "lxie@iscb.org",
            "name": "Lei Xie",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/jijiadong/JDINAC"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Script"
        ],
        "topic": [
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Pathology",
                "uri": "http://edamontology.org/topic_0634"
            },
            {
                "term": "Biomarkers",
                "uri": "http://edamontology.org/topic_3360"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Motivation A complex disease is usually driven by a number of genes interwoven into networks, rather than a single gene product. Network comparison or differential network analysis has become an important means of revealing the underlying mechanism of pathogenesis and identifying clinical biomarkers for disease classification. Most studies, however, are limited to network correlations that mainly capture the linear relationship among genes, or rely on the assumption of a parametric probability distribution of gene measurements. They are restrictive in real application. Results We propose a new Joint density based non-parametric Differential Interaction Network Analysis and Classification (JDINAC) method to identify differential interaction patterns of network activation between two groups. At the same time, JDINAC uses the network biomarkers to build a classification model. The novelty of JDINAC lies in its potential to capture non-linear relations between molecular interactions using high-dimensional sparse data as well as to adjust confounding factors, without the need of the assumption of a parametric probability distribution of gene measurements. Simulation studies demonstrate that JDINAC provides more accurate differential network estimation and lower classification error than that achieved by other state-of-the-art methods. We apply JDINAC to a Breast Invasive Carcinoma dataset, which includes 114 patients who have both tumor and matched normal samples. The hub genes and differential interaction patterns identified were consistent with existing experimental studies. Furthermore, JDINAC discriminated the tumor and normal sample with high accuracy by virtue of the identified biomarkers. JDINAC provides a general framework for feature selection and classification using high-dimensional sparse omics data.",
            "authors": [
                "Ji J.",
                "He D.",
                "Feng Y.",
                "He Y.",
                "Xue F.",
                "Xie L."
            ],
            "cit_count": 3,
            "doi": "10.1093/bioinformatics/btx360",
            "journal": "Bioinformatics",
            "title": "JDINAC: Joint density-based non-parametric differential interaction network analysis and classification using high-dimensional sparse omics data",
            "year": "2017-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:jdinac",
        "biotoolsID": "jdinac",
        "description": "Joint density-based non-parametric differential interaction network analysis and classification using high-dimensional sparse omics data .",
        "homepage": "https://github.com/jijiadong/JDINAC",
        "name": "JDINAC"
    }
}