{
    "additionDate": "2021-06-14T12:30:48Z",
    "biotoolsCURIE": "biotools:cartmath",
    "biotoolsID": "cartmath",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "gestor.redcap@hc.fm.usp.br",
            "name": "Luciana R. C. Barros",
            "orcidid": "https://orcid.org/0000-0002-8633-716X",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "CARTmath is a mathematical model of CAR-T immunotherapy in preclinical models. It simulates a three-cell mathematical model to describe tumor response to CAR T cell immunotherapy in immunodeficient mouse models.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                }
            ]
        }
    ],
    "homepage": "http://github.com/tmglncc/CARTmath",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-08-19T18:50:37.894054Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "http://github.com/tmglncc/CARTmath/issues"
        }
    ],
    "name": "CARTmath",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3390/cancers13122941",
            "metadata": {
                "abstract": "© 2021 by the authors. Licensee MDPI, Basel, Switzerland.Immunotherapy has gained great momentum with chimeric antigen receptor T cell (CAR-T) therapy, in which patient’s T lymphocytes are genetically manipulated to recognize tumor-specific antigens, increasing tumor elimination efficiency. In recent years, CAR-T cell immunotherapy for hematological malignancies achieved a great response rate in patients and is a very promising therapy for several other malignancies. Each new CAR design requires a preclinical proof-of-concept experiment using immunodeficient mouse models. The absence of a functional immune system in these mice makes them simple and suitable for use as mathematical models. In this work, we develop a three-population mathematical model to describe tumor response to CAR-T cell immunotherapy in immunodeficient mouse models, encompassing interactions between a non-solid tumor and CAR-T cells (effector and long-term memory). We account for several phenomena, such as tumor-induced immunosuppression, memory pool formation, and conversion of memory into effector CAR-T cells in the presence of new tumor cells. Individual donor and tumor specificities are considered uncertainties in the model parameters. Our model is able to reproduce several CAR-T cell immunotherapy scenarios, with different CAR receptors and tumor targets reported in the literature. We found that therapy effectiveness mostly depends on specific parameters such as the differentiation of effector to memory CAR-T cells, CAR-T cytotoxic capacity, tumor growth rate, and tumor-induced immunosuppression. In summary, our model can contribute to reducing and optimizing the number of in vivo experiments with in silico tests to select specific scenarios that could be tested in experimental research. Such an in silico laboratory is an easy-to-run open-source simulator, built on a Shiny R-based platform called CARTmath. It contains the results of this manuscript as examples and documentation. The developed model together with the CARTmath platform have potential use in assessing different CAR-T cell immunotherapy protocols and its associated efficacy, becoming an accessory for in silico trials.",
                "authors": [
                    {
                        "name": "Barros L.R.C."
                    },
                    {
                        "name": "Paixao E.A."
                    },
                    {
                        "name": "Valli A.M.P."
                    },
                    {
                        "name": "Naozuka G.T."
                    },
                    {
                        "name": "Fassoni A.C."
                    },
                    {
                        "name": "Almeida R.C."
                    }
                ],
                "citationCount": 1,
                "date": "2021-06-02T00:00:00Z",
                "journal": "Cancers",
                "title": "Cartmath—a mathematical model of car-t immunotherapy in preclinical studies of hematological cancers"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ]
}