{
    "additionDate": "2021-01-18T09:55:40Z",
    "biotoolsCURIE": "biotools:thd",
    "biotoolsID": "thd",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "wirth@mnhn.fr",
            "name": "Thierry Wirth",
            "orcidid": "https://orcid.org/0000-0002-7371-0172",
            "typeEntity": "Person"
        },
        {
            "email": "jean-philippe.rasigade@univ-lyon1.fr",
            "name": "Jean‐Philippe Rasigade",
            "orcidid": "https://orcid.org/0000-0002-8264-0452",
            "typeEntity": "Person"
        }
    ],
    "description": "Detecting drivers of pathogen transmission from genomic signatures using density measures.\n\nTime-scaled haplotypic density (THD) for R.\n\nTHD is an R package for estimating and comparing the evolutionary success of individuals in a population based on genetic distances.\n\nThe primary application of THD is the quantitative analysis and identification of factors that influence the epidemic success of pathogens. The approach assigns a index of epidemic success to each individual in a population. This index is then typically used as the response variable in multivariate models including potential predictors of success. See the publication list below for applications.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://github.com/rasigadelab/thd",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-27T09:08:33Z",
    "license": "MIT",
    "name": "THD",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1111/EVA.12991",
            "metadata": {
                "abstract": "© 2020 The Authors. Evolutionary Applications published by John Wiley & Sons LtdUnderstanding the driving forces of an epidemic is key to inform intervention strategies against it. Correlating measures of the epidemic success of a pathogen with ancillary parameters such as its drug resistance profile provides a flexible tool to identify such driving forces. The recently described time-scaled haplotypic density (THD) method facilitates the inference of a pathogen's epidemic success from genetic data. Contrary to demogenetic approaches that define success in an aggregated fashion, the THD computes an independent index of success for each isolate in a collection. Modeling this index using multivariate regression, thus, allows us to control for various sources of bias and to identify independent predictors of success. We illustrate the use of THD to address key questions regarding three exemplary epidemics of multidrug-resistant (MDR) bacterial lineages, namely Mycobacterium tuberculosis Beijing, Salmonella Typhi H58, and Staphylococcus aureus ST8 (including ST8-USA300 MRSA), based on previously published, international genetic datasets. In each case, THD analysis allowed to identify the impact, or lack thereof, of various factors on the epidemic success, independent of confounding by population structure and geographic distribution. Our results suggest that rifampicin resistance drives the MDR Beijing epidemic and that fluoroquinolone resistance drives the S. aureus ST8/USA300 epidemic, in line with previous evidence of a lack of resistance-associated fitness cost in these pathogens. Conversely, fluoroquinolone resistance measurably hampered the success of S. Typhi H58 and non-H58. These findings illustrate how THD can help leverage the massive genomic datasets generated by molecular epidemiology studies to address new questions. THD implementation for the R platform is available at https://github.com/rasigadelab/thd.",
                "authors": [
                    {
                        "name": "Wirth T."
                    },
                    {
                        "name": "Wong V."
                    },
                    {
                        "name": "Vandenesch F."
                    },
                    {
                        "name": "Rasigade J.-P."
                    }
                ],
                "citationCount": 2,
                "date": "2020-07-01T00:00:00Z",
                "journal": "Evolutionary Applications",
                "title": "Applied phyloepidemiology: Detecting drivers of pathogen transmission from genomic signatures using density measures"
            },
            "pmcid": "PMC7359849",
            "pmid": "32684973"
        }
    ],
    "topic": [
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        }
    ]
}