{
    "additionDate": "2019-11-14T18:42:28Z",
    "biotoolsCURIE": "biotools:decision-tree",
    "biotoolsID": "decision-tree",
    "confidence_flag": "tool",
    "description": "A decision-tree approach for the differential diagnosis of chronic lymphoid leukemias and peripheral B-cell lymphomas | BACKGROUND AND OBJECTIVE:Here we propose a decision-tree approach for the differential diagnosis of distinct WHO categories B-cell chronic lymphoproliferative disorders using flow cytometry data. Flow cytometry is the preferred method for the immunophenotypic characterization of leukemia and lymphoma, being able to process and register multiparametric data about tens of thousands of cells per second. METHODS:The proposed decision-tree is composed by logistic function nodes that branch throughout the tree into sets of (possible) distinct leukemia lymphoma diagnoses. To avoid overfitting, regularization via the Lasso algorithm was used",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://codeocean.com/2018/03/08/a-decision-tree-approach-for-the-differential-diagnosis-of-chronic-lymphoid-leukemias-and-peripheral-b-cell-lymphomas/",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2020-12-17T14:45:36Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/lauramoraes/lymphomas-decision-tree-sourcecode"
        }
    ],
    "name": "decision-tree",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.CMPB.2019.06.014",
            "metadata": {
                "abstract": "© 2019 Elsevier B.V.Background and Objective: Here we propose a decision-tree approach for the differential diagnosis of distinct WHO categories B-cell chronic lymphoproliferative disorders using flow cytometry data. Flow cytometry is the preferred method for the immunophenotypic characterization of leukemia and lymphoma, being able to process and register multiparametric data about tens of thousands of cells per second. Methods: The proposed decision-tree is composed by logistic function nodes that branch throughout the tree into sets of (possible) distinct leukemia/lymphoma diagnoses. To avoid overfitting, regularization via the Lasso algorithm was used. The code can be run online at https://codeocean.com/2018/03/08/a-decision-tree-approach-for-the-differential-diagnosis-of-chronic-lymphoid-leukemias-and-peripheral-b-cell-lymphomas/ or downloaded from https://github.com/lauramoraes/bioinformatics-sourcecode to be executed in Matlab. Results: The proposed approach was validated in diagnostic peripheral blood and bone marrow samples from 283 mature lymphoid leukemias/lymphomas patients. The proposed approach achieved 95% correctness in the cross-validation test phase (100% in-sample), 61% giving a single diagnosis and 34% (possible) multiple disease diagnoses. Similar results were obtained in an out-of-sample validation dataset. The generated tree reached the final diagnoses after up to seven decision nodes. Conclusions: Here we propose a decision-tree approach for the differential diagnosis of mature lymphoid leukemias/lymphomas which proved to be accurate during out-of-sample validation. The full process is accomplished through seven binary transparent decision nodes.",
                "authors": [
                    {
                        "name": "Barrena S."
                    },
                    {
                        "name": "Lopez A."
                    },
                    {
                        "name": "Moraes L.O."
                    },
                    {
                        "name": "Orfao A."
                    },
                    {
                        "name": "Pedreira C.E."
                    }
                ],
                "citationCount": 7,
                "date": "2019-09-01T00:00:00Z",
                "journal": "Computer Methods and Programs in Biomedicine",
                "title": "A decision-tree approach for the differential diagnosis of chronic lymphoid leukemias and peripheral B-cell lymphomas"
            },
            "pmid": "31416565"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}
