{
    "additionDate": "2017-01-17T15:05:36Z",
    "biotoolsCURIE": "biotools:targetscore",
    "biotoolsID": "targetscore",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "yueli@cs.toronto.edu",
            "name": "Yue Li",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Infers the posterior distributions of microRNA targets by probabilistically modelling the likelihood microRNA-overexpression fold-changes and sequence-based scores. Variational Bayesian Gaussian mixture model (VB-GMM) is applied to log fold-changes and sequence scores to obtain the posteriors of latent variable being the miRNA targets. The final score is computed as the sigmoid-transformed fold-change weighted by the averaged posteriors of target components over all of the features.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/TargetScore.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/TargetScore_1.12.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical inference",
                    "uri": "http://edamontology.org/operation_3658"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/TargetScore.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:55Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Mirror"
            ],
            "url": "http://www.cs.utoronto.ca/~yueli/software.html"
        }
    ],
    "name": "TargetScore",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btt599",
            "metadata": {
                "abstract": "Motivation: Systematic identification of microRNA (miRNA) targets remains a challenge. The miRNA overexpression coupled with genome-wide expression profiling is a promising new approach and calls for a new method that integrates expression and sequence information.Results: We developed a probabilistic scoring method called targetScore. TargetScore infers miRNA targets as the transformed fold-changes weighted by the Bayesian posteriors given observed target features. To this end, we compiled 84 datasets from Gene Expression Omnibus corresponding to 77 human tissue or cells and 113 distinct transfected miRNAs. Comparing with other methods, targetScore achieves significantly higher accuracy in identifying known targets in most tests. Moreover, the confidence targets from targetScore exhibit comparable protein downregulation and are more significantly enriched for Gene Ontology terms. Using targetScore, we explored oncomir-oncogenes network and predicted several potential cancer-related miRNA-messenger RNA interactions. © 2013 The Author 2013. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Goldenberg A."
                    },
                    {
                        "name": "Wong K.-C."
                    },
                    {
                        "name": "Zhang Z."
                    }
                ],
                "citationCount": 22,
                "date": "2014-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "A probabilistic approach to explore human miRNA targetome by integrating miRNA-overexpression data and sequence information"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        }
    ],
    "validated": 1,
    "version": [
        "1.12.0"
    ]
}