{
    "additionDate": "2021-01-18T09:14:29Z",
    "biotoolsCURIE": "biotools:tactics-stereotactic",
    "biotoolsID": "tactics-stereotactic",
    "confidence_flag": "tool",
    "description": "an open-source platform for planning, simulating and validating stereotactic surgery.\n\nTactics is a prototype application for assigning target coordinates to locations within the brain, so that neurosurgeons can easily and precisely target those locations with electrodes that stimulate the brain in order to provide therapy for certain brain disorders.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/atamai/tactics",
    "language": [
        "C++"
    ],
    "lastUpdate": "2021-02-25T13:25:22Z",
    "license": "BSD-3-Clause",
    "name": "Tactics",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1080/24699322.2020.1760354",
            "metadata": {
                "abstract": "© 2020, © 2020 The Author(s). Published by Informa UK Limited, trading as Taylor & Francis Group.Frame-based stereotaxy is widely used for planning and implanting deep-brain electrodes. In 2013, as part of a clinical study on deep-brain stimulation for treatment-resistant depression, our group identified a need for software to simulate and plan stereotactic procedures. Shortcomings in extant commercial systems encouraged us to develop Tactics. Tactics is purpose-designed for frame-based stereotactic placement of electrodes. The workflow is far simpler than commercial systems. By simulating specific electrode placement, immediate in-context view of each electrode contact, and the cortical entry site are available within seconds. Post implantation, electrode placement is verified by linearly registering post-operative images. Tactics has been particularly helpful for invasive electroencephalography electrodes where as many as 20 electrodes are planned and placed within minutes. Currently, no commercial system has a workflow supporting the efficient placement of this many electrodes. Tactics includes a novel implementation of automated frame localization and a user-extensible mechanism for importing electrode specifications for visualization of individual electrode contacts. The system was systematically validated, through comparison against gold-standard techniques and quantitative analysis of targeting accuracy using a purpose-built imaging phantom mountable by a stereotactic frame. Internal to our research group, Tactics has been used to plan over 300 depth-electrode targets and trajectories in over 50 surgical cases, and to plan dozens of stereotactic biopsies. Source code and pre-built binaries for Tactics are public and open-source, enabling use and contribution by the extended community.",
                "authors": [
                    {
                        "name": "Adair D.S.P."
                    },
                    {
                        "name": "Gobbi D.G."
                    },
                    {
                        "name": "Gomes K.S."
                    },
                    {
                        "name": "Kiss Z.H.T."
                    },
                    {
                        "name": "Starreveld Y.P."
                    }
                ],
                "citationCount": 1,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Computer Assisted Surgery",
                "title": "Tactics: an open-source platform for planning, simulating and validating stereotactic surgery"
            },
            "pmid": "32401082"
        }
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
