{
    "additionDate": "2021-01-18T11:54:18Z",
    "biotoolsCURIE": "biotools:repeatfs",
    "biotoolsID": "repeatfs",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "anthony.westbrook@unh.edu",
            "name": "Anthony Westbrook",
            "typeEntity": "Person"
        }
    ],
    "description": "a file system providing reproducibility through provenance and automation.\n\nRepeatFS is a Python, FUSE-based file system with the goal of promoting scientific informatics reproducibility by recording all file and IO operations during analysis. This provenance record can then be exported and used to replicate the analysis on other systems. During replication, RepeatFS will verify that all software versions, command line parameters, and other relevant attributes match, and will report out any deviation from the original record. While other provenance software often involves learning scripting languages or migrating your workflow to a confined platform, RepeatFS operates invisibily at the file system level, and is compatible with virtually all Linux command-line software.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ToniWestbrook/repeatfs",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-06T13:07:54Z",
    "license": "GPL-3.0",
    "name": "RepeatFS",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA950",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press.Motivation: Reproducibility is of central importance to the scientific process. The difficulty of consistently replicating and verifying experimental results is magnified in the era of big data, in which bioinformatics analysis often involves complex multi-application pipelines operating on terabytes of data. These processes result in thousands of possible permutations of data preparation steps, software versions and command-line arguments. Existing reproducibility frameworks are cumbersome and involve redesigning computational methods. To address these issues, we developed RepeatFS, a file system that records, replicates and verifies informatics workflows with no alteration to the original methods. RepeatFS also provides several other features to help promote analytical transparency and reproducibility, including provenance visualization and task automation. Results: We used RepeatFS to successfully visualize and replicate a variety of bioinformatics tasks consisting of over a million operations with no alteration to the original methods. RepeatFS correctly identified all software inconsistencies that resulted in replication differences. Availabilityand implementation: RepeatFS is implemented in Python 3. Its source code and documentation are available at https://github.com/ToniWestbrook/repeatfs.",
                "authors": [
                    {
                        "name": "Westbrook A."
                    },
                    {
                        "name": "Varki E."
                    },
                    {
                        "name": "Kelley Thomas W."
                    }
                ],
                "date": "2021-05-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "RepeatFS: A file system providing reproducibility through provenance and automation"
            },
            "pmid": "33230554"
        }
    ],
    "topic": [
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ]
}