{
    "additionDate": "2024-01-26T13:10:59.903502Z",
    "biotoolsCURIE": "biotools:meva_x",
    "biotoolsID": "meva_x",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "smavroudi@upatras.gr",
            "name": "Seferina Mavroudi",
            "orcidid": "https://orcid.org/0000-0003-0612-1009",
            "typeEntity": "Person"
        }
    ],
    "description": "Hybrid multiobjective evolutionary tool using an XGBoost classifier for biomarkers discovery on biomedical datasets.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                }
            ]
        }
    ],
    "homepage": "https://github.com/PanKonstantinos/MEvA-X",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-01-26T13:10:59.906320Z",
    "license": "Apache-2.0",
    "name": "MEvA-X",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAD384",
            "metadata": {
                "abstract": "Motivation: Biomarker discovery is one of the most frequent pursuits in bioinformatics and is crucial for precision medicine, disease prognosis, and drug discovery. A common challenge of biomarker discovery applications is the low ratio of samples over features for the selection of a reliable not-redundant subset of features, but despite the development of efficient tree-based classification methods, such as the extreme gradient boosting (XGBoost), this limitation is still relevant. Moreover, existing approaches for optimizing XGBoost do not deal effectively with the class imbalance nature of the biomarker discovery problems, and the presence of multiple conflicting objectives, since they focus on the training of a single-objective model. In the current work, we introduce MEvA-X, a novel hybrid ensemble for feature selection (FS) and classification, combining a niche-based multiobjective evolutionary algorithm (EA) with the XGBoost classifier. MEvA-X deploys a multiobjective EA to optimize the hyperparameters of the classifier and perform FS, identifying a set of Pareto-optimal solutions and optimizing multiple objectives, including classification and model simplicity metrics. Results: The performance of the MEvA-X tool was benchmarked using one omics dataset coming from a microarray gene expression experiment, and one clinical questionnaire-based dataset combined with demographic information. MEvA-X tool outperformed the state-of-the-art methods in the balanced categorization of classes, creating multiple low-complexity models and identifying important nonredundant biomarkers. The best-performing run of MEvA-X for the prediction of weight loss using gene expression data yields a small set of blood circulatory markers which are sufficient for this precision nutrition application but need further validation.",
                "authors": [
                    {
                        "name": "Deriu M.A."
                    },
                    {
                        "name": "Hurwitz P."
                    },
                    {
                        "name": "Korfiati A."
                    },
                    {
                        "name": "Mavroudi S."
                    },
                    {
                        "name": "Panagiotopoulos K."
                    },
                    {
                        "name": "Theofilatos K."
                    }
                ],
                "citationCount": 1,
                "date": "2023-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "MEvA-X: a hybrid multiobjective evolutionary tool using an XGBoost classifier for biomarkers discovery on biomedical datasets"
            },
            "pmcid": "PMC10354005",
            "pmid": "37326976"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Nutritional science",
            "uri": "http://edamontology.org/topic_3390"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        }
    ]
}
