{
    "additionDate": "2021-05-27T09:16:34Z",
    "biotoolsCURIE": "biotools:squeezemeta",
    "biotoolsID": "squeezemeta",
    "credit": [
        {
            "email": "jtamames@cnb.csic.es",
            "name": "Javier Tamames",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "email": "fernando.puente.sanchez@slu.se",
            "name": "Fernando Puente-Sánchez",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        }
    ],
    "description": "SqueezeMeta is a fully automated metagenomics pipeline, from reads to bins.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/jtamames/SqueezeMeta/wiki"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Read binning",
                    "uri": "http://edamontology.org/operation_3798"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jtamames/SqueezeMeta",
    "language": [
        "C",
        "C++",
        "Python",
        "Perl"
    ],
    "lastUpdate": "2021-08-04T11:04:07Z",
    "license": "GPL-3.0",
    "name": "SqueezeMeta",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3389/fmicb.2018.03349",
            "metadata": {
                "abstract": "© 2019 Tamames and Puente-Sánchez.The improvement of sequencing technologies has facilitated generalization of metagenomic sequencing, which has become a standard procedure for analyzing the structure and functionality of microbiomes. Bioinformatic analysis of sequencing results poses a challenge because it involves many different complex steps. SqueezeMeta is a fully automatic pipeline for metagenomics/metatranscriptomics, covering all steps of the analysis. SqueezeMeta includes multi-metagenome support that enables co-assembly of related metagenomes and retrieval of individual genomes via binning procedures. SqueezeMeta features several unique characteristics: Co-assembly procedure or co-assembly of unlimited number of metagenomes via merging of individual assembled metagenomes, both with read mapping for estimation of the abundances of genes in each metagenome. It also includes binning and bin checking for retrieving individual genomes. Internal checks for the assembly and binning steps provide information about the consistency of contigs and bins. Moreover, results are stored in a MySQL database, where they can be easily exported and shared, and can be inspected anywhere using a flexible web interface that allows simple creation of complex queries. We illustrate the potential of SqueezeMeta by analyzing 32 gut metagenomes in a fully automatic way, enabling retrieval of several million genes and several hundreds of genomic bins. One of the motivations in the development of SqueezeMeta was producing a software capable of running in small desktop computers and thus amenable to all users and settings. We were also able to co-assemble two of these metagenomes and complete the full analysis in less than one day using a simple laptop computer. This reveals the capacity of SqueezeMeta to run without high-performance computing infrastructure and in absence of any network connectivity. It is therefore adequate for in situ, real time analysis of metagenomes produced by nanopore sequencing.",
                "authors": [
                    {
                        "name": "Tamames J."
                    },
                    {
                        "name": "Puente-Sanchez F."
                    }
                ],
                "citationCount": 34,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Frontiers in Microbiology",
                "title": "SqueezeMeta, a highly portable, fully automatic metagenomic analysis pipeline"
            },
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1186/s12859-020-03703-2",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: The dramatic decrease in sequencing costs over the last decade has boosted the adoption of high-throughput sequencing applications as a standard tool for the analysis of environmental microbial communities. Nowadays even small research groups can easily obtain raw sequencing data. After that, however, non-specialists are faced with the double challenge of choosing among an ever-increasing array of analysis methodologies, and navigating the vast amounts of results returned by these approaches. Results: Here we present a workflow that relies on the SqueezeMeta software for the automated processing of raw reads into annotated contigs and reconstructed genomes (bins). A set of custom scripts seamlessly integrates the output into the anvi'o analysis platform, allowing filtering and visual exploration of the results. Furthermore, we provide a software package with utility functions to expose the SqueezeMeta results to the R analysis environment. Conclusions: Altogether, our workflow allows non-expert users to go from raw sequencing reads to custom plots with only a few powerful, flexible and well-documented commands.",
                "authors": [
                    {
                        "name": "Puente-Sanchez F."
                    },
                    {
                        "name": "Garcia-Garcia N."
                    },
                    {
                        "name": "Tamames J."
                    }
                ],
                "citationCount": 1,
                "date": "2020-08-14T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SQMtools: Automated processing and visual analysis of 'omics data with R and anvi'o"
            },
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Metatranscriptomics",
            "uri": "http://edamontology.org/topic_3941"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        }
    ]
}