{
    "additionDate": "2022-12-22T09:29:35.777041Z",
    "biotoolsCURIE": "biotools:branenet",
    "biotoolsID": "branenet",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "fragkiskos.malliaros@centralesupelec.fr",
            "name": "Fragkiskos D. Malliaros",
            "typeEntity": "Person"
        }
    ],
    "description": "BRANEnet is  a novel multi-omics integration framework for multilayer heterogeneous networks. In particular, it embeds graph-based information from multi-omics data in a lower-dimensional space.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Gene regulatory network prediction",
                    "uri": "http://edamontology.org/operation_2437"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Surabhivj/BRANEnet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:56:03.803297Z",
    "license": "CC-BY-4.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://zenodo.org/record/7007534"
        }
    ],
    "name": "BRANENET",
    "owner": "laurent.duval",
    "publication": [
        {
            "doi": "10.1186/s12859-022-04955-w",
            "metadata": {
                "abstract": "Background: Gene expression is regulated at different molecular levels, including chromatin accessibility, transcription, RNA maturation, and transport. These regulatory mechanisms have strong connections with cellular metabolism. In order to study the cellular system and its functioning, omics data at each molecular level can be generated and efficiently integrated. Here, we propose BRANEnet, a novel multi-omics integration framework for multilayer heterogeneous networks. BRANEnet is an expressive, scalable, and versatile method to learn node embeddings, leveraging random walk information within a matrix factorization framework. Our goal is to efficiently integrate multi-omics data to study different regulatory aspects of multilayered processes that occur in organisms. We evaluate our framework using multi-omics data of Saccharomyces cerevisiae, a well-studied yeast model organism. Results: We test BRANEnet on transcriptomics (RNA-seq) and targeted metabolomics (NMR) data for wild-type yeast strain during a heat-shock time course of 0, 20, and 120 min. Our framework learns features for differentially expressed bio-molecules showing heat stress response. We demonstrate the applicability of the learned features for targeted omics inference tasks: transcription factor (TF)-target prediction, integrated omics network (ION) inference, and module identification. The performance of BRANEnet is compared to existing network integration methods. Our model outperforms baseline methods by achieving high prediction scores for a variety of downstream tasks.",
                "authors": [
                    {
                        "name": "Bidard F."
                    },
                    {
                        "name": "Duval L."
                    },
                    {
                        "name": "Jagtap S."
                    },
                    {
                        "name": "Malliaros F.D."
                    },
                    {
                        "name": "Pirayre A."
                    }
                ],
                "citationCount": 2,
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "BRANEnet: embedding multilayer networks for omics data integration"
            },
            "pmcid": "PMC9575224",
            "pmid": "36245002"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
