{
    "name": "Pseudomonas Genome Database", 
    "description": "This is a comprehensive database on all Pseudomonas species genomes providing primarily access to Pseudomonas aeruginosa genomic data and annotation. Its interface faciliates comparative analyses of genes, proteins, annotations and gene orders, and contains a wealth of additional data including pathway-based, operon-based, protein-localization based, gene function category and ortholog/paralog-based information.", 
    "homepage": "http://pseudomonas.com/", 
    "biotoolsID": "pseudomonas_genome_project", 
    "biotoolsCURIE": "biotools:pseudomonas_genome_project", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3431", 
                    "term": "Deposition"
                }, 
                {
                    "uri": "http://edamontology.org/operation_3482", 
                    "term": "Antimicrobial resistance prediction"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0224", 
                    "term": "Query and retrieval"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0362", 
                    "term": "Genome annotation"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Database portal"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0634", 
            "term": "Pathology"
        }, 
        {
            "uri": "http://edamontology.org/topic_0199", 
            "term": "Genetic variation"
        }, 
        {
            "uri": "http://edamontology.org/topic_0622", 
            "term": "Genomics"
        }, 
        {
            "uri": "http://edamontology.org/topic_0621", 
            "term": "Model organisms"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "http://pseudomonas.com/faqs", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "15608211", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Pseudomonas aeruginosa Genome Database and PseudoCAP: Facilitating community-based, continually updated, genome annotation", 
                "abstract": "Using the Pseudomonas aeruginosa Genome Project as a test case, we have developed a database and submission system to facilitate a community-based approach to continually updated genome annotation (http://www.pseudomonas.com). Researchers submit proposed annotation updates through one of three web-based form options which are then subjected to review, and if accepted, entered into both the database and log file of updates with author acknowledgement. In addition, a coordinator continually reviews literature for suitable updates, as we have found such reviews to be the most efficient. Both the annotations database and updates-log database have Boolean search capability with the ability to sort results and download all data or search results as tab-delimited files. To complement this peer-reviewed genome annotation, we also provide a linked GBrowse view which displays alternate annotations. Additional tools and analyses are also integrated, including PseudoCyc, and knockout mutant information. We propose that this database system, with its focus on facilitating flexible queries of the data and providing access to both peer-reviewed annotations as well as alternate annotation information, may be a suitable model for other genome projects wishing to use a continually updated, community-based annotation approach. The source code is freely available under GNU General Public Licence. © Oxford University Press 2005; all rights reserved.", 
                "date": "2005-01-01T00:00:00Z", 
                "citationCount": 103, 
                "authors": [
                    {
                        "name": "Winsor G.L."
                    }, 
                    {
                        "name": "Lo R."
                    }, 
                    {
                        "name": "Ho Sui S.J."
                    }, 
                    {
                        "name": "Ung K.S.E."
                    }, 
                    {
                        "name": "Huang S."
                    }, 
                    {
                        "name": "Cheng D."
                    }, 
                    {
                        "name": "Ching W.-K.H."
                    }, 
                    {
                        "name": "Hancock R.E.W."
                    }, 
                    {
                        "name": "Brinkman F.S.L."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }, 
        {
            "doi": null, 
            "pmid": "10984043", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Complete genome sequence of Pseudomonas aeruginosa PAO1, an opportunistic pathogen", 
                "abstract": "Pseudomonas aeruginosa is a ubiquitous environmental bacterium that is one of the top three causes of opportunistic human infections. A major factor in its prominence as a pathogen is its intrinsic resistance to antibiotics and disinfectants. Here we report the complete sequence of P. aeruginosa strain PAO1. At 6.3 million base pairs, this is the largest bacterial genome sequenced, and the sequence provides insights into the basis of the versatility and intrinsic drug resistance of P. aeruginosa. Consistent with its larger genome size and environmental adaptability, P. aeruginosa contains the highest proportion of regulatory genes observed for a bacterial genome and a large number of genes involved in the catabolism, transport and efflux of organic compounds as well as four potential chemotaxis systems. We propose that the size and complexity of the P. aeruginosa genome reflect an evolutionary adaptation permitting it to thrive in diverse environments and resist the effects of a variety of antimicrobial substances.", 
                "date": "2000-08-31T00:00:00Z", 
                "citationCount": 2704, 
                "authors": [
                    {
                        "name": "Stover C.K."
                    }, 
                    {
                        "name": "Pham X.Q."
                    }, 
                    {
                        "name": "Erwin A.L."
                    }, 
                    {
                        "name": "Mizoguchi S.D."
                    }, 
                    {
                        "name": "Warrener P."
                    }, 
                    {
                        "name": "Hickey M.J."
                    }, 
                    {
                        "name": "Brinkman F.S.L."
                    }, 
                    {
                        "name": "Hufnagle W.O."
                    }, 
                    {
                        "name": "Kowallk D.J."
                    }, 
                    {
                        "name": "Lagrou M."
                    }, 
                    {
                        "name": "Garber R.L."
                    }, 
                    {
                        "name": "Goltry L."
                    }, 
                    {
                        "name": "Tolentino E."
                    }, 
                    {
                        "name": "Westbrock-Wadman S."
                    }, 
                    {
                        "name": "Yuan Y."
                    }, 
                    {
                        "name": "Brody L.L."
                    }, 
                    {
                        "name": "Coulter S.N."
                    }, 
                    {
                        "name": "Folger K.R."
                    }, 
                    {
                        "name": "Kas A."
                    }, 
                    {
                        "name": "Larbig K."
                    }, 
                    {
                        "name": "Lim R."
                    }, 
                    {
                        "name": "Smith K."
                    }, 
                    {
                        "name": "Spencer D."
                    }, 
                    {
                        "name": "Wong G.K.-S."
                    }, 
                    {
                        "name": "Wu Z."
                    }, 
                    {
                        "name": "Paulsen I.T."
                    }, 
                    {
                        "name": "Relzer J."
                    }, 
                    {
                        "name": "Saler M.H."
                    }, 
                    {
                        "name": "Hancock R.E.W."
                    }, 
                    {
                        "name": "Lory S."
                    }, 
                    {
                        "name": "Olson M.V."
                    }
                ], 
                "journal": "Nature"
            }
        }, 
        {
            "doi": null, 
            "pmid": "20929876", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Pseudomonas Genome Database: Improved comparative analysis and population genomics capability for Pseudomonas genomes", 
                "abstract": "Pseudomonas is a metabolically-diverse genus of bacteria known for its flexibility and leading free living to pathogenic lifestyles in a wide range of hosts. The Pseudomonas Genome Database (http:// www.pseudomonas.com) integrates completelysequenced Pseudomonas genome sequences and their annotations with genome-scale, high-precision computational predictions and manually curated annotation updates. The latest release implements an ability to view sequence polymorphisms in P. aeruginosa PAO1 versus other reference strains, incomplete genomes and single gene sequences. This aids analysis of phenotypic variation between closely related isolates and strains, as well as wider population genomics and evolutionary studies. The wide range of tools for comparing Pseudomonas annotations and sequences now includes a strain-specific access point for viewing high precision computational predictions including updated, more accurate, protein subcellular localization and genomic island predictions. Views link to genome-scale experimental data as well as comparative genomics analyses that incorporate robust genera-geared methods for predicting and clustering orthologs. These analyses can be exploited for identifying putative essential and core Pseudomonas genes or identifying large-scale evolutionary events. The Pseudomonas Genome Database aims to provide a continually updated, high quality source of genome annotations, specifically tailored for Pseudomonas researchers, but using an approach that may be implemented for other genera-level research communities. © The Author(s) 2010.", 
                "date": "2011-01-01T00:00:00Z", 
                "citationCount": 429, 
                "authors": [
                    {
                        "name": "Winsor G.L."
                    }, 
                    {
                        "name": "Lam D.K.W."
                    }, 
                    {
                        "name": "Fleming L."
                    }, 
                    {
                        "name": "Lo R."
                    }, 
                    {
                        "name": "Whiteside M.D."
                    }, 
                    {
                        "name": "Yu N.Y."
                    }, 
                    {
                        "name": "Hancock R.E.W."
                    }, 
                    {
                        "name": "Brinkman F.S.L."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }
    ], 
    "credit": [
        {
            "name": "Pseudomonas Genome DB Support", 
            "email": "pseudocap-mail@sfu.ca", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "ELIXIR-EE", 
    "additionDate": "2017-03-30T22:04:42Z", 
    "lastUpdate": "2018-12-10T12:58:55Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}