{
    "additionDate": "2017-02-10T14:15:20Z",
    "biotoolsCURIE": "biotools:kobas",
    "biotoolsID": "kobas",
    "credit": [
        {
            "email": "weilp@mail.cbi.edu.pku.cn",
            "name": "Liping Wei",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "KEGG Orthology-Based Annotation System (KOBAS) annotates sequences with KEGG Orthology terms and identifies the frequently occurring (or significantly enriched) pathways among the queried sequences compared against a background distribution. 5 pathway databases are used (KEGG Pathway, PID, BioCyc, Reactome, Panther) and 5 human databases (OMIM, KEGG Disease, FunDO, GAD, NHGRI GWAS).",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://kobas.cbi.pku.edu.cn/help.php"
        }
    ],
    "editPermission": {
        "authors": [
            "ShihChengWang"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://kobas.cbi.pku.edu.cn",
    "lastUpdate": "2020-06-05T12:25:38Z",
    "name": "KOBAS",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: High-throughput technologies such as DNA sequencing and microarrays have created the need for automated annotation of large sets of genes, including whole genomes, and automated identification of pathways. Ontologies, such as the popular Gene Ontology (GO), provide a common controlled vocabulary for these types of automated analysis. Yet, while GO offers tremendous value, it also has certain limitations such as the lack of direct association with pathways. Results: We demonstrated the use of the KEGG Orthology (KO), part of the KEGG suite of resources, as an alternative controlled vocabulary for automated annotation and pathway identification. We developed a KO-Based Annotation System (KOBAS) that can automatically annotate a set of sequences with KO terms and identify both the most frequent and the statistically significantly enriched pathways. Results from both whole genome and microarray gene cluster annotations with KOBAS are comparable and complementary to known annotations. KOBAS is a freely available standalone Python program that can contribute significantly to genome annotation and microarray analysis. © The Author 2005. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Mao X."
                    },
                    {
                        "name": "Cai T."
                    },
                    {
                        "name": "Olyarchuk J.G."
                    },
                    {
                        "name": "Wei L."
                    }
                ],
                "citationCount": 741,
                "date": "2005-10-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Automated genome annotation and pathway identification using the KEGG Orthology (KO) as a controlled vocabulary"
            },
            "pmid": "15817693"
        },
        {
            "metadata": {
                "abstract": "There is an increasing need to automatically annotate a set of genes or proteins (from genome sequencing, DNA microarray analysis or protein 2D gel experiments) using controlled vocabularies and identify the pathways involved, especially the statistically enriched pathways. We have previously demonstrated the KEGG Orthology (KO) as an effective alternative controlled vocabulary and developed a standalone KO-Based Annotation System (KOBAS). Here we report a KOBAS server with a friendly web-based user interface and enhanced functionalities. The server can support input by nucleotide or amino acid sequences or by sequence identifiers in popular databases and can annotate the input with KO terms and KEGG pathways by BLAST sequence similarity or directly ID mapping to genes with known annotations. The server can then identify both frequent and statistically enriched pathways, offering the choices of four statistical tests and the option of multiple testing correction. The server also has a 'User Space' in which frequent users may store and manage their data and results online. We demonstrate the usability of the server by finding statistically enriched pathways in a set of upregulated genes in Alzheimer's Disease (AD) hippocampal cornu ammonis 1 (CA1). KOBAS server can be accessed at http://kobas.cbi.pku.edu.cn. © The Author 2006. Published by Oxford University Press. All rights reserved. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Wu J."
                    },
                    {
                        "name": "Mao X."
                    },
                    {
                        "name": "Cai T."
                    },
                    {
                        "name": "Luo J."
                    },
                    {
                        "name": "Wei L."
                    }
                ],
                "citationCount": 229,
                "date": "2006-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "KOBAS server: A web-based platform for automated annotation and pathway identification"
            },
            "pmid": "16845106"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}