
{
    "credit": [
        {
            "email": "bioSequence@tauex.tau.ac.il",
            "name": "Server Administrator",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://quasimotifinder.tau.ac.il/overview_QMF.htm"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence motif discovery",
                    "uri": "http://edamontology.org/operation_0238"
                },
                {
                    "term": "Sequence feature detection",
                    "uri": "http://edamontology.org/operation_0253"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Sequence sites, features and motifs",
                "uri": "http://edamontology.org/topic_0160"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Protein structural motifs and surfaces",
                "uri": "http://edamontology.org/topic_0166"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Sequence signature databases such as PROSITE, which include amino acid segments that are indicative of a protein's function, are useful for protein annotation. Lamentably, the annotation is not always accurate. A signature may be falsely detected in a protein that does not carry out the associated function (false positive prediction, FP) or may be overlooked in a protein that does carry out the function (false negative prediction, FN). A new approach has emerged in which a signature is replaced with a sequence profile, calculated based on multiple sequence alignment (MSA) of homologous proteins that share the same function. This approach, which is superior to the simple pattern search, essentially searches with the sequence of the query protein against an MSA library. We suggest here an alternative approach, implemented in the QuasiMotiFinder web server (http://quasimotifinder.tau.ac.il/), which is based on a search with an MSA of homologous query proteins against the original PROSITE signatures. The explicit use of the average evolutionary conservation of the signature in the query proteins significantly reduces the rate of FP prediction compared with the simple pattern search. QuasiMotiFinder also has a reduced rate of FN prediction compared with simple pattern searches, since the traditional search for precise signatures has been replaced by a permissive search for signature-like patterns that are physicochemically similar to known signatures. Overall, QuasiMotiFinder and the profile search are comparable to each other in terms of performance. They are also complementary to each other in that signatures that are falsely detected in (or overlooked by) one may be correctly detected by the other. © 2005 Oxford University Press.",
            "authors": [
                "Gutman R.",
                "Berezin C.",
                "Wollman R.",
                "Rosenberg Y.",
                "Ben-Tal N."
            ],
            "cit_count": 31,
            "journal": "Nucleic Acids Research",
            "pmid": "15980465",
            "title": "QuasiMotiFinder: Protein annotation by searching for evolutionarily conserved motif-like patterns",
            "year": "2005-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:quasimotifinder",
        "biotoolsID": "quasimotifinder",
        "description": "QuasiMotiFinder uses physicochemical similarity to PROSITE motifs and evolutionary conservation to predict sequence locations with possible function (pseudo-motifs).",
        "homepage": "http://quasimotifinder.tau.ac.il/",
        "name": "QuasiMotiFinder"
    }
}