{
    "additionDate": "2017-12-18T00:14:00Z",
    "biotoolsCURIE": "biotools:utopia",
    "biotoolsID": "utopia",
    "credit": [
        {
            "email": "info@utopiadocs.com",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "User-friendly Tools for Operating Informatics Applications visualizes and analyzes bioinformatics data in a user-friendly way. Based on an ontology-driven data model, it allows to view and align protein sequences, to render complex molecular structures in 3D, and to find and use resources such as web services and data objects.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein analysis",
                    "uri": "http://edamontology.org/operation_2502"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://utopia.cs.man.ac.uk/utopia/",
    "lastUpdate": "2018-12-10T12:58:58Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/utopia-1-4-5-protein-analysis-suite.html"
        }
    ],
    "name": "Utopia",
    "operatingSystem": [
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1002/cfg.359",
            "metadata": {
                "abstract": "Bioinformaticians routinely analyse vast amounts of information held both in large remote databases and in flat data files hosted on local machines. The contemporary toolkit available for this purpose consists of an ad hoc collection of data manipulation tools, scripting languages and visualization systems; these must often be combined in complex and bespoke ways, the result frequently being an unwieldy artefact capable of one specific task, which cannot easily be exploited or extended by other practitioners. Owing to the sizes of current databases and the scale of the analyses necessary, routine bioinformatics tasks are often automated, but many still require the unique experience and intuition of human researchers: this requires tools that support real-time interaction with complex datasets. Many existing tools have poor user interfaces and limited real-time performance when applied to realistically large datasets; much of the user's cognitive capacity is therefore focused on controlling the tool rather than on performing the research. The UTOPIA project is addressing some of these issues by building reusable software components that can be combined to make useful applications in the field of bioinformatics. Expertise in the fields of human computer interaction, high-performance rendering, and distributed systems is being guided by bioinformaticians and end-user biologists to create a toolkit that is both architecturally sound from a computing point of view, and directly addresses end-user and application-developer requirements. Copyright © 2004 John Wiley & Sons, Ltd.",
                "authors": [
                    {
                        "name": "Pettifer S.R."
                    },
                    {
                        "name": "Sinnott J.R."
                    },
                    {
                        "name": "Attwood T.K."
                    }
                ],
                "citationCount": 24,
                "date": "2004-02-01T00:00:00Z",
                "journal": "Comparative and Functional Genomics",
                "title": "UTOPIA - User-friendly tools for operating informatics applications"
            },
            "type": "Primary"
        },
        {
            "doi": "10.1007/978-3-540-73255-6_8",
            "type": "Primary"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        }
    ],
    "validated": 1,
    "version": [
        "1.4.5"
    ]
}