{
    "accessibility": "Open access",
    "additionDate": "2022-07-06T14:22:58.489150Z",
    "biotoolsCURIE": "biotools:pdfdataextractor",
    "biotoolsID": "pdfdataextractor",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jmc61@cam.ac.uk",
            "name": "Jacqueline M. Cole",
            "orcidid": "https://orcid.org/0000-0002-1552-8743",
            "typeEntity": "Person"
        },
        {
            "name": "Miao Zhu"
        }
    ],
    "description": "A Tool for Reading Scientific Text and Interpreting Metadata from the Typeset Literature in the Portable Document Format.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://pdfdataextractor.readthedocs.io/en/latest/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Information extraction",
                    "uri": "http://edamontology.org/operation_3907"
                },
                {
                    "term": "Relation extraction",
                    "uri": "http://edamontology.org/operation_3625"
                }
            ]
        }
    ],
    "homepage": "https://github.com/cat-lemonade/PDFDataExtractor",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-07-06T14:22:58.492977Z",
    "license": "MIT",
    "name": "PDFDataExtractor",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.1C01198",
            "metadata": {
                "abstract": "© 2022 American Chemical Society.The layout of portable document format (PDF) files is constant to any screen, and the metadata therein are latent, compared to mark-up languages such as HTML and XML. No semantic tags are usually provided, and a PDF file is not designed to be edited or its data interpreted by software. However, data held in PDF files need to be extracted in order to comply with open-source data requirements that are now government-regulated. In the chemical domain, related chemical and property data also need to be found, and their correlations need to be exploited to enable data science in areas such as data-driven materials discovery. Such relationships may be realized using text-mining software such as the \"chemistry-aware\"natural-language-processing tool, ChemDataExtractor; however, this tool has limited data-extraction capabilities from PDF files. This study presents the PDFDataExtractor tool, which can act as a plug-in to ChemDataExtractor. It outperforms other PDF-extraction tools for the chemical literature by coupling its functionalities to the chemical-named entity-recognition capabilities of ChemDataExtractor. The intrinsic PDF-reading abilities of ChemDataExtractor are much improved. The system features a template-based architecture. This enables semantic information to be extracted from the PDF files of scientific articles in order to reconstruct the logical structure of articles. While other existing PDF-extracting tools focus on quantity mining, this template-based system is more focused on quality mining on different layouts. PDFDataExtractor outputs information in JSON and plain text, including the metadata of a PDF file, such as paper title, authors, affiliation, email, abstract, keywords, journal, year, document object identifier (DOI), reference, and issue number. With a self-created evaluation article set, PDFDataExtractor achieved promising precision for all key assessed metadata areas of the document text.",
                "authors": [
                    {
                        "name": "Cole J.M."
                    },
                    {
                        "name": "Zhu M."
                    }
                ],
                "date": "2022-04-11T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "PDFDataExtractor: A Tool for Reading Scientific Text and Interpreting Metadata from the Typeset Literature in the Portable Document Format"
            },
            "pmcid": "PMC9049592",
            "pmid": "35349259"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        },
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        }
    ],
    "validated": 1
}
