
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://github.com/shaoweinuaa"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/shaoweinuaa/S-PSorter"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "MATLAB"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Cell biology",
                "uri": "http://edamontology.org/topic_2229"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/s-psorter-predicting-image-based-protein-subcellular-location.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2015 The Author 2015. Published by Oxford University Press. All rights reserved.Motivation: The systematic study of subcellular location pattern is very important for fully characterizing the human proteome. Nowadays, with the great advances in automated microscopic imaging, accurate bioimage-based classification methods to predict protein subcellular locations are highly desired. All existing models were constructed on the independent parallel hypothesis, where the cellular component classes are positioned independently in a multi-class classification engine. The important structural information of cellular compartments is missed. To deal with this problem for developing more accurate models, we proposed a novel cell structure-driven classifier construction approach (SC-PSorter) by employing the prior biological structural information in the learning model. Specifically, the structural relationship among the cellular components is reflected by a new codeword matrix under the error correcting output coding framework. Then, we construct multiple SC-PSorter-based classifiers corresponding to the columns of the error correcting output coding codeword matrix using a multi-kernel support vector machine classification approach. Finally, we perform the classifier ensemble by combining those multiple SC-PSorter-based classifiers via majority voting. Results: We evaluate our method on a collection of 1636 immunohistochemistry images from the Human Protein Atlas database. The experimental results show that our method achieves an overall accuracy of 89.0%, which is 6.4% higher than the state-of-the-art method. Availability and implementation: The dataset and code can be downloaded from https://github.com/shaoweinuaa/.",
            "authors": [
                "Shao W.",
                "Liu M.",
                "Zhang D."
            ],
            "cit_count": 5,
            "journal": "Bioinformatics",
            "pmid": "26363175",
            "title": "Human cell structure-driven model construction for predicting protein subcellular location from biological images",
            "year": "2015-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:s-psorter",
        "biotoolsID": "s-psorter",
        "description": "A novel cell structure-driven classifier construction approach for predicting image-based protein subcellular location by employing the prior biological structural information.",
        "homepage": "https://github.com/shaoweinuaa/S-PSorter",
        "name": "S-PSorter"
    }
}