{
    "additionDate": "2017-01-17T15:01:14Z",
    "biotoolsCURIE": "biotools:crisprseek",
    "biotoolsID": "crisprseek",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "julie.zhu@umassmed.edu",
            "name": "Lihua Julie Zhu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The package includes functions to find potential guide RNAs for input target sequences, optionally filter guide RNAs without restriction enzyme cut site, or without paired guide RNAs, genome-wide search for off-targets, score, rank, fetch flank sequence and indicate whether the target and off-targets are located in exon region or not.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/CRISPRseek.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/CRISPRseek_1.14.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid design",
                    "uri": "http://edamontology.org/operation_3095"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/CRISPRseek.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-10T15:33:28Z",
    "license": "GPL-2.0",
    "name": "CRISPRseek",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0108424",
            "metadata": {
                "abstract": "© 2014 Zhu et al.CRISPR-Cas systems are a diverse family of RNA-protein complexes in bacteria that target foreign DNA sequences for cleavage. Derivatives of these complexes have been engineered to cleave specific target sequences depending on the sequence of a CRISPR-derived guide RNA (gRNA) and the source of the Cas9 protein. Important considerations for the design of gRNAs are to maximize aimed activity at the desired target site while minimizing off-target cleavage. Because of the rapid advances in the understanding of existing CRISPR-Cas9-derived RNA-guided nucleases and the development of novel RNA-guided nuclease systems, it is critical to have computational tools that can accommodate a wide range of different parameters for the design of target-specific RNA-guided nuclease systems. We have developed CRISPRseek, a highly flexible, open source software package to identify gRNAs that target a given input sequence while minimizing offtarget cleavage at other sites within any selected genome. CRISPRseek will identify potential gRNAs that target a sequence of interest for CRISPR-Cas9 systems from different bacterial species and generate a cleavage score for potential off-target sequences utilizing published or user-supplied weight matrices with position-specific mismatch penalty scores. Identified gRNAs may be further filtered to only include those that occur in paired orientations for increased specificity and/or those that overlap restriction enzyme sites. For applications where gRNAs are desired to discriminate between two related sequences, CRISPRseek can rank gRNAs based on the difference between predicted cleavage scores in each input sequence. CRISPRseek is implemented as a Bioconductor package within the R statistical programming environment, allowing it to be incorporated into computational pipelines to automate the design of gRNAs for target sequences identified in a wide variety of genome-wide analyses. CRISPRseek is available under the GNU General Public Licence v3.0 at http://www. bioconductor.org.",
                "authors": [
                    {
                        "name": "Zhu L.J."
                    },
                    {
                        "name": "Holmes B.R."
                    },
                    {
                        "name": "Aronin N."
                    },
                    {
                        "name": "Brodsky M.H."
                    }
                ],
                "citationCount": 86,
                "date": "2014-09-23T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "CRISPRseek: A Bioconductor package to identify target-specific guide RNAs for CRISPR-Cas9 genome-editing systems"
            },
            "pmcid": "PMC4172692",
            "pmid": "25247697",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1,
    "version": [
        "1.14.0"
    ]
}