{
    "additionDate": "2021-10-10T15:37:46.907607Z",
    "biotoolsCURIE": "biotools:mlho",
    "biotoolsID": "mlho",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hestiri@mgh.harvard.edu",
            "name": "Hossein Estiri",
            "orcidid": "https://orcid.org/0000-0002-0204-8978",
            "typeEntity": "Person",
            "typeRole": [
                "Developer",
                "Maintainer",
                "Primary contact"
            ]
        }
    ],
    "description": "MLHO (pronounced as melo) is an end-to-end Machine Learning pipeline that implements iterative sequential representation mining, and feature and model selection to predict health outcomes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://hestiri.github.io/mlho",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-10-10T15:39:21.631052Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/hestiri/mlho/issues"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/hestiri/mlho/"
        }
    ],
    "name": "MLHO",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1038/S41598-021-84781-X",
            "metadata": {
                "abstract": "© 2021, The Author(s).The COVID-19 pandemic has devastated the world with health and economic wreckage. Precise estimates of adverse outcomes from COVID-19 could have led to better allocation of healthcare resources and more efficient targeted preventive measures, including insight into prioritizing how to best distribute a vaccination. We developed MLHO (pronounced as melo), an end-to-end Machine Learning framework that leverages iterative feature and algorithm selection to predict Health Outcomes. MLHO implements iterative sequential representation mining, and feature and model selection, for predicting patient-level risk of hospitalization, ICU admission, need for mechanical ventilation, and death. It bases this prediction on data from patients’ past medical records (before their COVID-19 infection). MLHO’s architecture enables a parallel and outcome-oriented model calibration, in which different statistical learning algorithms and vectors of features are simultaneously tested to improve prediction of health outcomes. Using clinical and demographic data from a large cohort of over 13,000 COVID-19-positive patients, we modeled the four adverse outcomes utilizing about 600 features representing patients’ pre-COVID health records and demographics. The mean AUC ROC for mortality prediction was 0.91, while the prediction performance ranged between 0.80 and 0.81 for the ICU, hospitalization, and ventilation. We broadly describe the clusters of features that were utilized in modeling and their relative influence for predicting each outcome. Our results demonstrated that while demographic variables (namely age) are important predictors of adverse outcomes after a COVID-19 infection, the incorporation of the past clinical records are vital for a reliable prediction model. As the COVID-19 pandemic unfolds around the world, adaptable and interpretable machine learning frameworks (like MLHO) are crucial to improve our readiness for confronting the potential future waves of COVID-19, as well as other novel infectious diseases that may emerge.",
                "authors": [
                    {
                        "name": "Estiri H."
                    },
                    {
                        "name": "Murphy S.N."
                    },
                    {
                        "name": "Strasser Z.H."
                    }
                ],
                "citationCount": 3,
                "date": "2021-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "Individualized prediction of COVID-19 adverse outcomes with MLHO"
            },
            "pmcid": "PMC7935934",
            "pmid": "33674708",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library",
        "Workflow"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        },
        {
            "term": "Urology and nephrology",
            "uri": "http://edamontology.org/topic_3422"
        }
    ]
}
