{
    "additionDate": "2020-01-09T18:27:15Z",
    "biotoolsCURIE": "biotools:CLN3",
    "biotoolsID": "CLN3",
    "confidence_flag": "low",
    "credit": [
        {
            "email": "dkerkovich@beyondbatten.org",
            "name": "Danielle M. Kerkovich",
            "orcidid": "https://orcid.org/0000-0002-0215-2054",
            "typeEntity": "Person"
        }
    ],
    "description": "The CLN3 gene and protein.\n\nError: the hgg_gene parameter is missing from the cart and the CGI params.\n\nNCL RESOURCE - A GATEWAY FOR BATTEN DISEASE.\n\nThe Genotype-Tissue Expression (GTEx) project is an ongoing effort to build a comprehensive public resource to study tissue-specific gene expression and regulation. Samples were collected from 53 non-diseased tissue sites across nearly 1000 individuals, primarily for molecular assays including WGS, WES and RNA-seq. Remaining samples are stored in the GTEx Biobank. The GTEx Portal provides open access to data including gene expression, QTLs, and histology images.\n\nCLN3 mutation table in excel format to download.\n\nPa-cln3.001-80, Pa-cln3.081-139, Pa-cln3.178-190,.\n\np.[Gly154Alafs*29, Val155_Gly264del].\n\nThe International Batten Disease Consortium, 1995 Munroe et al., 1997.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'protein'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant effect prediction",
                    "uri": "http://edamontology.org/operation_0331"
                },
                {
                    "term": "Frameshift detection",
                    "uri": "http://edamontology.org/operation_0265"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://genome.ucsc.edu/cgi-bin/hgGene?db=hg19%26hgg_gene=CLN3",
    "lastUpdate": "2020-01-09T18:27:15Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://www.ucl.ac.uk/ncl/CLN3mutationtable.htm"
        },
        {
            "type": [
                "Other"
            ],
            "url": "http://www.ucl.ac.uk/ncl/cln3.shtml"
        },
        {
            "type": [
                "Other"
            ],
            "url": "http://www.gtexportal.org/home/gene/CLN3"
        }
    ],
    "name": "CLN3",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/MGG3.859",
            "metadata": {
                "abstract": "© 2019 The Authors. Molecular Genetics & Genomic Medicine published by Wiley Periodicals, Inc.Background: One of the most important steps taken by Beyond Batten Disease Foundation in our quest to cure juvenile Batten (CLN3) disease is to understand the State of the Science. We believe that a strong understanding of where we are in our experimental understanding of the CLN3 gene, its regulation, gene product, protein structure, tissue distribution, biomarker use, and pathological responses to its deficiency, lays the groundwork for determining therapeutic action plans. Objectives: To present an unbiased comprehensive reference tool of the experimental understanding of the CLN3 gene and gene product of the same name. Methods: BBDF compiled all of the available CLN3 gene and protein data from biological databases, repositories of federally and privately funded projects, patent and trademark offices, science and technology journals, industrial drug and pipeline reports as well as clinical trial reports and with painstaking precision, validated the information together with experts in Batten disease, lysosomal storage disease, lysosome/endosome biology. Results: The finished product is an indexed review of the CLN3 gene and protein which is not limited in page size or number of references, references all available primary experiments, and does not draw conclusions for the reader. Conclusions: Revisiting the experimental history of a target gene and its product ensures that inaccuracies and contradictions come to light, long-held beliefs and assumptions continue to be challenged, and information that was previously deemed inconsequential gets a second look. Compiling the information into one manuscript with all appropriate primary references provides quick clues to which studies have been completed under which conditions and what information has been reported. This compendium does not seek to replace original articles or subtopic reviews but provides an historical roadmap to completed works.",
                "authors": [
                    {
                        "name": "Mirza M."
                    },
                    {
                        "name": "Vainshtein A."
                    },
                    {
                        "name": "DiRonza A."
                    },
                    {
                        "name": "Chandrachud U."
                    },
                    {
                        "name": "Haslett L.J."
                    },
                    {
                        "name": "Palmieri M."
                    },
                    {
                        "name": "Storch S."
                    },
                    {
                        "name": "Groh J."
                    },
                    {
                        "name": "Dobzinski N."
                    },
                    {
                        "name": "Napolitano G."
                    },
                    {
                        "name": "Schmidtke C."
                    },
                    {
                        "name": "Kerkovich D.M."
                    }
                ],
                "citationCount": 6,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Molecular Genetics and Genomic Medicine",
                "title": "The CLN3 gene and protein: What we know"
            },
            "pmcid": "PMC6900386",
            "pmid": "31568712"
        }
    ],
    "topic": [
        {
            "term": "Biobank",
            "uri": "http://edamontology.org/topic_3337"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ]
}