{"credit":[{"email":"ahalees@zlab.bu.edu","name":"PromoSer Team","typeEntity":"Person","typeRoles":["Primary contact"]}],"function":[{"operation":[{"term":"Bisulfite mapping","uri":"http://edamontology.org/operation_3186"},{"term":"Sequence tagged site (STS) mapping","uri":"http://edamontology.org/operation_2871"},{"term":"Promoter prediction","uri":"http://edamontology.org/operation_0440"},{"term":"Mapping","uri":"http://edamontology.org/operation_2429"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Gene transcripts","uri":"http://edamontology.org/topic_3512"},{"term":"Transcription factors and regulatory sites","uri":"http://edamontology.org/topic_0749"},{"term":"Gene expression","uri":"http://edamontology.org/topic_0203"},{"term":"Mapping","uri":"http://edamontology.org/topic_0102"},{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"}]},"publication":[{"abstract":"PromoSer is a web service that provides an easy and efficient approach to the batch retrieval of a large number of proximal promoters. Since its introduction last year, it has undergone continued development and expansion. At the core, there have been improvements in the filtering of the raw mRNA/EST sequences upon which all predictions are built, improvements in the alignments clustering and transcription start site prediction algorithms, and improvements in the backing database for increased performance. At the user interface level, improvements include enhanced functionality and user options, better integration with other resources on the web and a new visualization tool. PromoSer now also supports queries using a SOAP-based interface and XML-based responses. The service is publicly available at http://biowulf.bu.edu/zlab/PromoSer. © Oxford University Press 2004; all rights reserved.","authors":["Halees A.S.","Weng Z."],"cit_count":21,"journal":"Nucleic Acids Research","pmid":"15215378","title":"PromoSer: Improvements to the algorithm, visualization and accessibility","year":"2004-07-01"},{"abstract":"Proximal promoters have a major impact on transcriptional regulation. Studies of the sequence-based nature of this regulation usually require collection of proximal promoter sequences for large sets of co-regulated genes. We report a newly implemented web service that facilitates extraction of user specified regions around the transcription start site of all annotated human, mouse or rat genes. The transcription start sites have been identified computationally by considering alignments of a large number of partial and full-length mRNA sequences to genomic DNA, with provision for alternative promoters. The service is publicly available at http://biowulf.bu.edu/zlab/PromoSer/.","authors":["Halees A.S.","Leyfer D.","Weng Z."],"cit_count":58,"journal":"Nucleic Acids Research","pmid":"12824364","title":"PromoSer: A large-scale mammalian promoter and transcription start site identification service","year":"2003-07-01"}],"summary":{"biotoolsCURIE":"biotools:promoser","biotoolsID":"promoser","description":"Server which aims to extract proximal promoter sequences from mammalian genomes.  Does so by mapping mRNA and EST sequences and tracking overlapping alignments to find the transcription start site.","homepage":"http://biowulf.bu.edu/zlab/PromoSer/","name":"PromoSer"}}