{
    "additionDate": "2021-01-18T07:06:14Z",
    "biotoolsCURIE": "biotools:ncgtw",
    "biotoolsID": "ncgtw",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "yug@vt.edu",
            "name": "Guoqiang Yu",
            "orcidid": "https://orcid.org/0000-0002-6743-7413",
            "typeEntity": "Person"
        },
        {
            "email": "dherring@wakehealth.edu",
            "name": "David M Herrington",
            "typeEntity": "Person"
        },
        {
            "email": "yuewang@vt.edu",
            "name": "Yue Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "Targeted realignment of LC-MS profiles by neighbor-wise compound-specific graphical time warping with misalignment detection.\n\nThe purpose of ncGTW is to detect and fix the bad alignments in the LC-MS data. Currently, ncGTW is implemented in a R-package as a plug-in for XCMS. That is, ncGTW can detect the misaligned feature groups from XCMS and realign them. After that, XCMS can use the realigned data from XCMS for more accurate grouping and peak-filling.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pairwise sequence alignment",
                    "uri": "http://edamontology.org/operation_0491"
                },
                {
                    "term": "Pairwise structure alignment",
                    "uri": "http://edamontology.org/operation_0503"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ChiungTingWu/ncGTW",
    "language": [
        "C++",
        "R"
    ],
    "lastUpdate": "2021-03-08T09:45:54Z",
    "name": "ncGTW",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA037",
            "metadata": {
                "abstract": "© 2020 The Author(s). Published by Oxford University Press. All rights reserved.Motivation: Liquid chromatography-mass spectrometry (LC-MS) is a standard method for proteomics and metabolomics analysis of biological samples. Unfortunately, it suffers from various changes in the retention times (RT) of the same compound in different samples, and these must be subsequently corrected (aligned) during data processing. Classic alignment methods such as in the popular XCMS package often assume a single time-warping function for each sample. Thus, the potentially varying RT drift for compounds with different masses in a sample is neglected in these methods. Moreover, the systematic change in RT drift across run order is often not considered by alignment algorithms. Therefore, these methods cannot effectively correct all misalignments. For a large-scale experiment involving many samples, the existence of misalignment becomes inevitable and concerning. Results: Here, we describe an integrated reference-free profile alignment method, neighbor-wise compound-specific Graphical Time Warping (ncGTW), that can detect misaligned features and align profiles by leveraging expected RT drift structures and compound-specific warping functions. Specifically, ncGTW uses individualized warping functions for different compounds and assigns constraint edges on warping functions of neighboring samples. Validated with both realistic synthetic data and internal quality control samples, ncGTW applied to two large-scale metabolomics LC-MS datasets identifies many misaligned features and successfully realigns them. These features would otherwise be discarded or uncorrected using existing methods. The ncGTW software tool is developed currently as a plug-in to detect and realign misaligned features present in standard XCMS output.",
                "authors": [
                    {
                        "name": "Ebbels T."
                    },
                    {
                        "name": "Graca G."
                    },
                    {
                        "name": "Herrington D.M."
                    },
                    {
                        "name": "Karaman I."
                    },
                    {
                        "name": "Karaman I."
                    },
                    {
                        "name": "Pinto R."
                    },
                    {
                        "name": "Pinto R."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Wu C.-T."
                    },
                    {
                        "name": "Yu G."
                    }
                ],
                "citationCount": 1,
                "date": "2020-05-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Targeted realignment of LC-MS profiles by neighbor-wise compound-specific graphical time warping with misalignment detection"
            },
            "pmcid": "PMC7203744",
            "pmid": "31950989"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ]
}
