
{
    "credit": [
        {
            "email": "hsun@pusan.ac.kr",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.columbia.edu/~sw2206/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://www.columbia.edu/~sw2206/softwares/rvsel-manual.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            },
            {
                "term": "Genetic variation",
                "uri": "http://edamontology.org/topic_0199"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/rvsel-0-1-rare-variants-selection-with-sequence-data.html"
        }
    ],
    "publication": [
        {
            "abstract": "Motivation: Existing association methods for rare variants from sequencing data have focused on aggregating variants in a gene or a genetic region because of the fact that analysing individual rare variants is underpowered. However, these existing rare variant detection methods are not able to identify which rare variants in a gene or a genetic region of all variants are associated with the complex diseases or traits. Once phenotypic associations of a gene or a genetic region are identified, the natural next step in the association study with sequencing data is to locate the susceptible rare variants within the gene or the genetic region. Results: In this article, we propose a power set-based statistical selection procedure that is able to identify the locations of the potentially susceptible rare variants within a disease-related gene or a genetic region. The selection performance of the proposed selection procedure was evaluated through simulation studies, where we demonstrated the feasibility and superior power over several comparable existing methods. In particular, the proposed method is able to handle the mixed effects when both risk and protective variants are present in a gene or a genetic region. The proposed selection procedure was also applied to the sequence data on the ANGPTL gene family from the Dallas Heart Study to identify potentially susceptible rare variants within the trait-related genes. © The Author 2014.",
            "authors": [
                "Sun H.",
                "Wang S."
            ],
            "cit_count": 4,
            "journal": "Bioinformatics",
            "pmid": "24755303",
            "title": "A power set-based statistical selection procedure to locate susceptible rare variants associated with complex traits with sequencing data",
            "year": "2014-08-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:rvsel",
        "biotoolsID": "rvsel",
        "description": "A R package for rare variants selection with sequence data. The most outome-related rare variants are selected within a gene or a genetic region. The selection procedure is based on the power set of the subset of the rare variants.",
        "homepage": "http://www.columbia.edu/~sw2206/softwares.htm",
        "name": "rvsel"
    }
}