{"credit":[{"email":"yu.he@wustl.edu","name":"Yu He","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://epigenome.wustl.edu/EpiCompare3/"},{"type":"GENERAL","url":"https://github.com/hcharles14/EpiCompare/blob/master/Command_Line_EpiCompare/README.md"}],"function":[{"operation":[{"term":"Enrichment analysis","uri":"http://edamontology.org/operation_3501"},{"term":"Read binning","uri":"http://edamontology.org/operation_3798"},{"term":"Transcriptional regulatory element prediction","uri":"http://edamontology.org/operation_0438"}]}],"labels":{"accessibility":["Open access"],"cost":"Free of charge","language":["R"],"license":"Unlicense","maturity":"Mature","operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool","Web application"],"topic":[{"term":"Epigenomics","uri":"http://edamontology.org/topic_3173"},{"term":"Transcription factors and regulatory sites","uri":"http://edamontology.org/topic_0749"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"}]},"link":[{"type":"REPOSITORY","url":"https://github.com/hcharles14/EpiCompare"},{"type":"ISSUE_TRACKER","url":"https://github.com/hcharles14/EpiCompare/issues"}],"publication":[{"abstract":"© The Author 2017. Published by Oxford University Press. All rights reserved. Motivation The Human Reference Epigenome Map, generated by the Roadmap Epigenomics Consortium, contains thousands of genome-wide epigenomic datasets that describe epigenomes of a variety of different human tissue and cell types. This map has allowed investigators to obtain a much deeper and more comprehensive view of our regulatory genome, e.g. defining regulatory elements including all promoters and enhancers for a given tissue or cell type. An outstanding task is to combine and compare different epigenomes in order to identify regions with epigenomic features specific to certain types of tissues or cells, e.g. lineage-specific regulatory elements. Currently available tools do not directly address this question. This need motivated us to develop a tool that allows investigators to easily identify regions with epigenetic features unique to specific epigenomes that they choose, making detection of common regulatory elements and/or cell type-specific regulatory elements an interactive and dynamic experience. Results An online tool EpiCompare was developed to assist investigators in exploring the specificity of epigenomic features across selected tissue and cell types. Investigators can design their test by choosing different combinations of epigenomes, and choosing different classification algorithms provided by our tool. EpiCompare will then identify regions with specified epigenomic features, and provide a quality assessment of the predictions. Investigators can interact with EpiCompare by investigating Roadmap Epigenomics data, or uploading their own data for comparison. We demonstrate that by using specific combinations of epigenomes we can detect developmental lineage-specific enhancers. Finally, prediction results can be readily visualized and further explored in the WashU Epigenome Browser. Availability and implementation EpiCompare is freely available on the web at http://epigenome.wustl.edu/EpiCompare/. Contact twang@genetics.wustl.edu Supplementary informationSupplementary dataare available at Bioinformatics online.","authors":["He Y.","Wang T."],"cit_count":2,"doi":"10.1093/bioinformatics/btx371","journal":"Bioinformatics","title":"EpiCompare: An online tool to define and explore genomic regions with tissue or cell type-specific epigenomic features","type":"Primary","year":"2017-10-15"}],"summary":{"biotoolsCURIE":"biotools:EpiCompare","biotoolsID":"EpiCompare","description":"Tool to define and explore genomic regions with tissue or cell type-specific epigenomic features.","homepage":"https://epigenome.wustl.edu/EpiCompare/","name":"EpiCompare"}}