{
    "additionDate": "2019-11-14T19:48:23Z",
    "biotoolsCURIE": "biotools:ChIPseqSpikeInFree",
    "biotoolsID": "ChIPseqSpikeInFree",
    "confidence_flag": "tool",
    "description": "> CORRECT NAME OF TOOL COULD ALSO BE 'RESULTS:ChIPseqSpikeInFree' | A ChIP-seq normalization approach to reveal global changes in histone modifications without spike-in | A Spike-in Free ChIP-Seq Normalization Approach for Detecting Global Changes in Histone Modifications | We develop ChIPseqSpikeInFree, a novel ChIP-seq normalization method to effectively determine scaling factors for samples across various conditions and treatments, which does not rely on exogenous spike-in chromatin or peak detection to reveal global changes in histone modification occupancy. This method is capable of revealing the similar magnitude of global changes as the spike-in method | Traditional reads per million (RPM) normalization method is inappropriate for the evaluation of ChIP-seq data when the treatment or mutation has the global effect",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Read binning",
                    "uri": "http://edamontology.org/operation_3798"
                }
            ]
        }
    ],
    "homepage": "https://pecan.stjude.cloud/permalink/spikefree",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-11T20:03:39Z",
    "license": "Apache-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/stjude/ChIPseqSpikeInFree"
        }
    ],
    "name": "ChIPseqSpikeInFree",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ720",
            "metadata": {
                "abstract": "© 2020 Oxford University Press. All rights reserved.Motivation: The traditional reads per million normalization method is inappropriate for the evaluation of ChIP-seq data when treatments or mutations have global effects. Changes in global levels of histone modifications can be detected with exogenous reference spike-in controls. However, most ChIP-seq studies overlook the normalization that must be corrected with spike-in. A method that retrospectively renormalizes datasets without spike-in is lacking. Results: ChIPseqSpikeInFree is a novel ChIP-seq normalization method to effectively determine scaling factors for samples across various conditions and treatments, which does not rely on exogenous spike-in chromatin or peak detection to reveal global changes in histone modification occupancy. Application of ChIPseqSpikeInFree on five datasets demonstrates that this in silico approach reveals a similar magnitude of global changes as the spike-in method does. Availability and implementation: St. Jude Cloud (https://pecan.stjude.cloud/permalink/spikefree) and St. Jude Github (https://github.com/stjude/ChIPseqSpikeInFree).",
                "authors": [
                    {
                        "name": "Jin H."
                    },
                    {
                        "name": "Kasper L.H."
                    },
                    {
                        "name": "Larson J.D."
                    },
                    {
                        "name": "Wu G."
                    },
                    {
                        "name": "Baker S.J."
                    },
                    {
                        "name": "Zhang J."
                    },
                    {
                        "name": "Fan Y."
                    }
                ],
                "citationCount": 4,
                "date": "2020-02-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "ChIPseqSpikeInFree: A ChIP-seq normalization approach to reveal global changes in histone modifications without spike-in"
            },
            "pmcid": "PMC7523640",
            "pmid": "31566663"
        }
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "ChIP-on-chip",
            "uri": "http://edamontology.org/topic_3179"
        }
    ],
    "validated": 1
}