{
    "additionDate": "2021-01-18T07:10:23Z",
    "biotoolsCURIE": "biotools:tg-lasso",
    "biotoolsID": "tg-lasso",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "amin.emad@mcgill.ca",
            "name": "Amin Emad",
            "orcidid": "https://orcid.org/0000-0002-5108-4887",
            "typeEntity": "Person"
        },
        {
            "email": "sinhas@illinois.edu",
            "name": "Saurabh Sinha",
            "orcidid": "https://orcid.org/0000-0001-6033-7746",
            "typeEntity": "Person"
        }
    ],
    "description": "Tissue-guided LASSO for prediction of clinical drug response using preclinical samples.\n\nThen, we developed a new algorithm called TG-LASSO (Tissue-Guided LASSO) that explicitly integrates information on samples’ tissue of origin with samples gene expression profiles to improve prediction performance (see figure below).\n\nCancer is one of the leading causes of death globally and is expected to be the most important obstacle in increasing the life expectancy in the 21st century.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/emad2/TG-LASSO",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-27T09:04:39Z",
    "name": "TG-LASSO",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1007607",
            "metadata": {
                "abstract": "© 2020 Huang et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Prediction of clinical drug response (CDR) of cancer patients, based on their clinical and molecular profiles obtained prior to administration of the drug, can play a significant role in individualized medicine. Machine learning models have the potential to address this issue but training them requires data from a large number of patients treated with each drug, limiting their feasibility. While large databases of drug response and molecular profiles of preclinical in-vitro cancer cell lines (CCLs) exist for many drugs, it is unclear whether preclinical samples can be used to predict CDR of real patients. We designed a systematic approach to evaluate how well different algorithms, trained on gene expression and drug response of CCLs, can predict CDR of patients. Using data from two large databases, we evaluated various linear and non-linear algorithms, some of which utilized information on gene interactions. Then, we developed a new algorithm called TG-LASSO that explicitly integrates information on samples’ tissue of origin with gene expression profiles to improve prediction performance. Our results showed that regularized regression methods provide better prediction performance. However, including the network information or common methods of including information on the tissue of origin did not improve the results. On the other hand, TG-LASSO improved the predictions and distinguished resistant and sensitive patients for 7 out of 13 drugs. Additionally, TG-LASSO identified genes associated with the drug response, including known targets and pathways involved in the drugs’ mechanism of action. Moreover, genes identified by TG-LASSO for multiple drugs in a tissue were associated with patient survival. In summary, our analysis suggests that preclinical samples can be used to predict CDR of patients and identify biomarkers of drug sensitivity and survival.",
                "authors": [
                    {
                        "name": "Bhope A."
                    },
                    {
                        "name": "Emad A."
                    },
                    {
                        "name": "Huang E.W."
                    },
                    {
                        "name": "Lim J."
                    },
                    {
                        "name": "Sinha S."
                    }
                ],
                "citationCount": 5,
                "date": "2020-01-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Tissue-guided LASSO for prediction of clinical drug response using preclinical samples"
            },
            "pmcid": "PMC6975549",
            "pmid": "31967990"
        }
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pharmacogenomics",
            "uri": "http://edamontology.org/topic_0208"
        }
    ]
}
