{
    "additionDate": "2019-11-14T18:44:16Z",
    "biotoolsCURIE": "biotools:CMap",
    "biotoolsID": "CMap",
    "confidence_flag": "very low",
    "credit": [
        {
            "email": "chwang0525@whu.edu.cn",
            "name": "Changhua Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "> VERY_LOW CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'diabetes', 'IRO', 'DEGs', 'omental' | Identification of biomarkers, pathways and potential therapeutic agents for white adipocyte insulin resistance using bioinformatics analysis | Update September 12, 2017: A new version of the Connectivity Map using the L1000 assay has been accepted for publication, and is currently available as a pre-print (see Subramanian et. al). Tools for analysis of these data are at clue.io | The earlier Affymetrix-microarray based Connectivity Map data (build02) is available in archive mode on this page (see below) | The Connectivity Map (also known as cmap) is a collection of genome-wide transcriptional expression data from cultured human cells treated with bioactive small molecules and simple pattern-matching algorithms that together enable the discovery of functional connections between drugs, genes and diseases through the transitory feature of common gene-expression changes",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                }
            ]
        }
    ],
    "homepage": "https://portals.broadinstitute.org/cmap",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-11-14T18:44:16Z",
    "name": "CMap",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1080/21623945.2019.1649578",
            "metadata": {
                "abstract": "© 2019, © 2019 The Author(s). Published by Informa UK Limited, trading as Taylor & Francis Group.For the better understanding of insulin resistance (IR), the molecular biomarkers in IR white adipocytes and its potential mechanism, we downloaded two mRNA expression profiles from Gene Expression Omnibus (GEO). The white adipocyte samples in two databases were collected from the human omental adipose tissue of IR obese (IRO) subjects and insulin-sensitive obese (ISO) subjects, respectively. We identified 86 differentially expressed genes (DEGs) between the IRO and ISO subjects using limma package in R software. Gene Set Enrichment Analysis (GSEA) provided evidence that the most gene sets enriched in kidney mesenchyme development in the ISO subjects, as compared with the IRO subjects. The Gene Ontology (GO) analysis indicated that the most significantly enriched in cellular response to interferon-gamma. The Kyoto Encyclopedia of Genes and Genomes (KEGG) pathway analysis revealed that the DEGs were most significantly enriched in cytokine-cytokine receptor interaction. Protein–Protein Interaction (PPI) network was performed with the STRING, and the top 10 hub genes were identified with the Cytohubba. CMap analysis found several small molecular compounds to reverse the altered DEGs, including dropropizine, aceclofenac, melatonin, and so on. Our outputs could empower the novel potential targets to treat omental white adipocyte insulin resistance, diabetes, and diabetes-related diseases.",
                "authors": [
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Zheng Y."
                    },
                    {
                        "name": "Fu Y."
                    },
                    {
                        "name": "Wang C."
                    }
                ],
                "citationCount": 4,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Adipocyte",
                "title": "Identification of biomarkers, pathways and potential therapeutic agents for white adipocyte insulin resistance using bioinformatics analysis"
            },
            "pmcid": "PMC6768254",
            "pmid": "31407623"
        }
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ]
}