
{
    "credit": [
        {
            "name": "Abhishek Tiwari",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://abhishek-tiwari.com/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://sourceforge.net/projects/hbat/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein structure analysis",
                    "uri": "http://edamontology.org/operation_2406"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Perl"
        ],
        "operatingSystem": [
            "Windows"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Protein structure analysis",
                "uri": "http://edamontology.org/topic_2814"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/hbat-1-1-hydrogen-bond-analysis-tool.html"
        }
    ],
    "publication": [
        {
            "abstract": "The program HBAT is a tool to automate the analysis of potential hydrogen bonds and similar type of weak interactions like halogen bonds and non-canonical interactions in macromolecular structures, available in Brookhaven Protein Database (PDB) file format. HBAT is written using PERL and TK languages. The program generates an MSOFFICE Excel compatible output file for statistical analysis. HBAT identify potential interactions based on geometrical criteria. A series of analysis reports like frequency tables, geometry distribution tables, furcations list are generated. A user friendly GUI offers freedom to select several parameters and options. Graphviz based visualization of hydrogen bond networks in 2D helps to study the cooperativity and anticooperativity geometry in hydrogen bond. HBAT supports post docking interaction analysis between PDB files for any target/receptor (in PDB files) and docked ligands/poses (in SDF). This tool can be implemented in active site interaction analysis, structure based drug design and molecular dynamics simulations. © 2007 IOS Press. All rights reserved.",
            "authors": [
                "Tiwari A.",
                "Panigrahi S.K."
            ],
            "cit_count": 57,
            "journal": "In Silico Biology",
            "pmid": "18467777",
            "title": "HBAT: A complete package for analysing strong and weak hydrogen bonds in macromolecular crystal structures",
            "year": "2007-12-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:hbat",
        "biotoolsID": "hbat",
        "description": "Tool to automate the analysis of hydrogen bonds present in a PDB Structure file. Other related tools available are PDIA(Post Docking Interaction Analysis) and HBNG(Hydrogen Bond Network Graph).",
        "homepage": "http://sourceforge.net/projects/hbat/",
        "name": "HBAT"
    }
}