{"collectionID": ["BioConductor"], "accessibility": [], "topic": [{"term": "Molecular interactions, pathways and networks", "uri": "http://edamontology.org/topic_0602"}], "owner": "bioconductor_import", "cost": null, "relation": [], "download": [{"url": "http://bioconductor/packages/release/bioc/src/contrib/TDARACNE_1.24.0.tar.gz", "note": null, "version": null, "type": "Source code"}], "validated": 1, "publication": [{"doi": "10.1186/1471-2105-11-154", "note": null, "version": null, "pmid": null, "type": "Primary", "pmcid": null, "metadata": {"title": "TimeDelay-ARACNE: Reverse engineering of gene networks from time-course data by an information theoretic approach", "abstract": "Background: One of main aims of Molecular Biology is the gain of knowledge about how molecular components interact each other and to understand gene function regulations. Using microarray technology, it is possible to extract measurements of thousands of genes into a single analysis step having a picture of the cell gene expression. Several methods have been developed to infer gene networks from steady-state data, much less literature is produced about time-course data, so the development of algorithms to infer gene networks from time-series measurements is a current challenge into bioinformatics research area. In order to detect dependencies between genes at different time delays, we propose an approach to infer gene regulatory networks from time-series measurements starting from a well known algorithm based on information theory.Results: In this paper we show how the ARACNE (Algorithm for the Reconstruction of Accurate Cellular Networks) algorithm can be used for gene regulatory network inference in the case of time-course expression profiles. The resulting method is called TimeDelay-ARACNE. It just tries to extract dependencies between two genes at different time delays, providing a measure of these dependencies in terms of mutual information. The basic idea of the proposed algorithm is to detect time-delayed dependencies between the expression profiles by assuming as underlying probabilistic model a stationary Markov Random Field. Less informative dependencies are filtered out using an auto calculated threshold, retaining most reliable connections. TimeDelay-ARACNE can infer small local networks of time regulated gene-gene interactions detecting their versus and also discovering cyclic interactions also when only a medium-small number of measurements are available. We test the algorithm both on synthetic networks and on microarray expression profiles. Microarray measurements concern S. cerevisiae cell cycle, E. coli SOS pathways and a recently developed network for in vivo assessment of reverse engineering algorithms. Our results are compared with ARACNE itself and with the ones of two previously published algorithms: Dynamic Bayesian Networks and systems of ODEs, showing that TimeDelay-ARACNE has good accuracy, recall and F-score for the network reconstruction task.Conclusions: Here we report the adaptation of the ARACNE algorithm to infer gene regulatory networks from time-course data, so that, the resulting network is represented as a directed graph. The proposed algorithm is expected to be useful in reconstruction of small biological directed networks from time course data. © 2010 Zoppoli et al; licensee BioMed Central Ltd.", "citationCount": 149, "authors": [{"name": "Zoppoli P."}, {"name": "Morganella S."}, {"name": "Ceccarelli M."}], "date": "2010-03-25T00:00:00Z", "journal": "BMC Bioinformatics"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": "Zoppoli Pietro", "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "zoppoli.pietro@gmail.com"}], "biotoolsCURIE": "biotools:tdaracne", "elixirPlatform": [], "elixirNode": [], "version": ["1.24.0"], "elixir_badge": 0, "homepage": "http://bioconductor.org/packages/release/bioc/html/TDARACNE.html", "function": [{"note": null, "input": [], "operation": [{"term": "Pathway or network analysis", "uri": "http://edamontology.org/operation_2497"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:55Z", "otherID": [], "description": "To infer gene networks from time-series measurements is a current challenge into bioinformatics research area. In order to detect dependencies between genes at different time delays, we propose an approach to infer gene regulatory networks from time-series measurements starting from a well known algorithm based on information theory. The proposed algorithm is expected to be useful in reconstruction of small biological directed networks from time course data.", "toolType": ["Command-line tool", "Library"], "editPermission": {"type": "private", "authors": []}, "language": ["R"], "link": [], "biotoolsID": "tdaracne", "additionDate": "2017-01-17T15:05:30Z", "name": "TDARACNE", "license": "GPL-2.0", "documentation": [{"url": "http://bioconductor.org/packages/release/bioc/html/TDARACNE.html", "note": null, "type": "User manual"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux", "Windows", "Mac"]}