{
    "additionDate": "2020-01-14T19:58:15Z",
    "biotoolsCURIE": "biotools:RE-AIM_autogenerated",
    "biotoolsID": "RE-AIM_autogenerated",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "bethany.kwan@cuanschutz.edu",
            "name": "Bethany M. Kwan",
            "typeEntity": "Person"
        }
    ],
    "description": "Use of the RE-AIM Framework for Program Planning and Evaluation in Clinical and Community Settings.\n\nRE-AIM – Reach Effectiveness Adoption Implementation Maintenance.\n\nThis webinar, titled “Using the RE-AIM Model in Faith-based Dissemination & Implementation Study”, was presented by Dr. Sara Wilcox from the Arnold School of Public Health, at the University of South Carolina. Dr. Wilcox’s unique and engaging talk gave insight into an intervention that is being both disseminated and implemented within faith-based communities in South Carolina. Dr. Wilcox discusses her use of RE-AIM and how the framework was able to both help in the planning, evaluation, and aid in the development of future steps in her work.\n\nFor this month, we are bringing you our most recent webinar that occurred in December 2019. The last webinar of the decade!.\n\n||| NAME EQUAL TO (PUB. DIFFERENT) bio.tools/RE-AIM.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'RE-AIM Real World'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "http://www.re-aim.org",
    "lastUpdate": "2020-01-14T19:58:15Z",
    "name": "RE-AIM_autogenerated",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FPUBH.2019.00345",
            "metadata": {
                "abstract": "© Copyright © 2019 Kwan, McGinnes, Ory, Estabrooks, Waxmonsky and Glasgow.Background: The RE-AIM framework has been widely used in health research but it is unclear the extent to which this framework is also used for planning and evaluating health-related programs in clinical and community settings. Our objective was to evaluate how RE-AIM is used in the “real-world” and identify opportunities for improving use outside of research contexts. Methods: We used purposive and snowball sampling to identify clinical and community health programs that used RE-AIM for planning and/or evaluation. Recruitment methods included surveys with email follow-up to funders, implementers, and RE-AIM working group members. We identified 17 programs and conducted structured in-depth interviews with key informants (n = 18). Across RE-AIM dimensions, respondents described motivations, uses, and measures; rated understandability and usefulness; discussed benefits and challenges, strategies to overcome challenges, and resources used. We used descriptive statistics for quantitative ratings, and content analysis for qualitative data. Results: Program content areas included chronic disease management and prevention, healthy aging, mental health, or multiple, often behavioral health-related topics. During planning, most programs considered reach (n = 9), adoption (n = 11), and implementation (n = 12) while effectiveness (n = 7) and maintenance (n = 6) were considered less frequently. In contrast, most programs evaluated all RE-AIM dimensions, ranging from 13 programs assessing maintenance to 15 programs assessing implementation and effectiveness. On five-point scales, all RE-AIM dimensions were rated as easy to understand (Overall M = 4.7 ± 0.5), but obtaining data was rated as somewhat challenging (Overall M = 3.4 ± 0.9). Implementation was the most frequently used dimension to inform program design (M = 4.7 ± 0.6) relative to the other dimensions (3.0–3.9). All dimensions were considered similarly important for decision-making (average M = 4.1 ± 1.4), with the exception of maintenance (M = 3.4 ± 1.7). Qualitative corresponded to the quantitative findings in that RE-AIM was reported to be a practical, easy to understand, and well-established implementation science framework. Challenges included understanding differences among RE-AIM dimensions and data acquisition. Valuable resources included the RE-AIM website and collaborating with an expert. Discussion: RE-AIM is an efficient framework for planning and evaluation of clinical and community-based projects. It provides structure to systematically evaluate health program impact. Programs found planning for and assessing maintenance difficult, providing opportunities for further refinement.",
                "authors": [
                    {
                        "name": "Kwan B.M."
                    },
                    {
                        "name": "McGinnes H.L."
                    },
                    {
                        "name": "Ory M.G."
                    },
                    {
                        "name": "Estabrooks P.A."
                    },
                    {
                        "name": "Waxmonsky J.A."
                    },
                    {
                        "name": "Glasgow R.E."
                    }
                ],
                "citationCount": 3,
                "date": "2019-11-22T00:00:00Z",
                "journal": "Frontiers in Public Health",
                "title": "RE-AIM in the Real World: Use of the RE-AIM Framework for Program Planning and Evaluation in Clinical and Community Settings"
            },
            "pmcid": "PMC6883916",
            "pmid": "31824911"
        }
    ],
    "topic": [
        {
            "term": "Psychiatry",
            "uri": "http://edamontology.org/topic_3419"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Data acquisition",
            "uri": "http://edamontology.org/topic_3077"
        }
    ]
}