{"credit":[],"function":[{"operation":[{"term":"Gene expression analysis","uri":"http://edamontology.org/operation_2495"},{"term":"Query and retrieval","uri":"http://edamontology.org/operation_0224"},{"term":"Differential gene expression analysis","uri":"http://edamontology.org/operation_3223"},{"term":"Gene expression profiling","uri":"http://edamontology.org/operation_0314"}]}],"labels":{"toolType":["Web application"],"topic":[{"term":"Gene expression","uri":"http://edamontology.org/topic_0203"},{"term":"Model organisms","uri":"http://edamontology.org/topic_0621"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"},{"term":"Pathology","uri":"http://edamontology.org/topic_0634"}]},"publication":[{"abstract":"The enormous amount of data available in public gene expression repositories such as Gene Expression Omnibus (GEO) offers an inestimable resource to explore gene expression programs across several organisms and conditions. This information can be used to discover experiments that induce similar or opposite gene expression patterns to a given query, which in turn may lead to the discovery of new relationships among diseases, drugs or pathways, as well as the generation of new hypotheses. In this work, we present MARQ, a web-based application that allows researchers to compare a query set of genes, e.g. a set of over- and under-expressed genes, against a signature database built from GEO datasets for different organisms and platforms. MARQ offers an easy-to-use and integrated environment to mine GEO, in order to identify conditions that induce similar or opposite gene expression patterns to a given experimental condition. MARQ also includes additional functionalities for the exploration of the results, including a meta-analysis pipeline to find genes that are differentially expressed across different experiments. The application is freely available at http://marq.dacya.ucm.es. © The Author(s) 2010. Published by Oxford University Press.","authors":["Vazquez M.","Nogales-Cadenas R.","Arroyo J.","Botias P.","Garcia R.","Carazo J.M.","Tirado F.","Pascual-Montano A.","Carmona-Saez P."],"cit_count":19,"journal":"Nucleic Acids Research","pmid":"20513648","title":"MARQ: An online tool to mine GEO for experiments with similar or opposite gene expression signatures","year":"2010-05-29"}],"summary":{"biotoolsCURIE":"biotools:marq","biotoolsID":"marq","description":"Web based application that allows users to compare a query set of genes (query signature) against a gene signature database built from GEO datasets for different organisms and platforms.","homepage":"http://marq.dacya.ucm.es","name":"MARQ"}}