{
    "additionDate": "2023-02-19T11:29:22.508609Z",
    "biotoolsCURIE": "biotools:dfinder",
    "biotoolsID": "dfinder",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jiajiepeng@nwpu.edu.cn",
            "name": "Jiajie Peng",
            "orcidid": "https://orcid.org/0000-0002-3857-7927",
            "typeEntity": "Person"
        }
    ],
    "description": "A end-to-end graph embedding-based method named DFinder to identify DFIs. DFinder combines node attribute features and topological structure features to learn the representations of drugs and food constituents.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "homepage": "https://github.com/23AIBox/23AIBox-DFinder",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-02-19T11:29:22.511118Z",
    "license": "Not licensed",
    "name": "DFinder",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAC837",
            "metadata": {
                "abstract": "© The Author(s) 2022. Published by Oxford University Press.MOTIVATION: Drug-food interactions (DFIs) occur when some constituents of food affect the bioaccessibility or efficacy of the drug by involving in drug pharmacodynamic and/or pharmacokinetic processes. Many computational methods have achieved remarkable results in link prediction tasks between biological entities, which show the potential of computational methods in discovering novel DFIs. However, there are few computational approaches that pay attention to DFI identification. This is mainly due to the lack of DFI data. In addition, food is generally made up of a variety of chemical substances. The complexity of food makes it difficult to generate accurate feature representations for food. Therefore, it is urgent to develop effective computational approaches for learning the food feature representation and predicting DFIs. RESULTS: In this article, we first collect DFI data from DrugBank and PubMed, respectively, to construct two datasets, named DrugBank-DFI and PubMed-DFI. Based on these two datasets, two DFI networks are constructed. Then, we propose a novel end-to-end graph embedding-based method named DFinder to identify DFIs. DFinder combines node attribute features and topological structure features to learn the representations of drugs and food constituents. In topology space, we adopt a simplified graph convolution network-based method to learn the topological structure features. In feature space, we use a deep neural network to extract attribute features from the original node attributes. The evaluation results indicate that DFinder performs better than other baseline methods. AVAILABILITY AND IMPLEMENTATION: The source code is available at https://github.com/23AIBox/23AIBox-DFinder. SUPPLEMENTARY INFORMATION: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Peng J."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Wang T."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Xiao Y."
                    },
                    {
                        "name": "Yang J."
                    },
                    {
                        "name": "Zeng X."
                    }
                ],
                "date": "2023-01-01T00:00:00Z",
                "journal": "Bioinformatics (Oxford, England)",
                "title": "DFinder: a novel end-to-end graph embedding-based method to identify drug-food interactions"
            },
            "pmcid": "PMC9828147",
            "pmid": "36579885"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Biotherapeutics",
            "uri": "http://edamontology.org/topic_3374"
        },
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
