{
    "accessibility": "Open access",
    "additionDate": "2023-08-24T08:08:05.281256Z",
    "biotoolsCURIE": "biotools:intellisleepscorer",
    "biotoolsID": "intellisleepscorer",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jpan@broadinstitute.org",
            "name": "Jen Q. Pan",
            "typeEntity": "Person"
        },
        {
            "name": "Eunah Yu",
            "typeEntity": "Person"
        },
        {
            "name": "Lei A. Wang",
            "typeEntity": "Person"
        },
        {
            "name": "Ryan Kern",
            "typeEntity": "Person"
        },
        {
            "name": "Soonwook Choi",
            "typeEntity": "Person"
        }
    ],
    "description": "Software package with a graphic user interface for automated sleep stage scoring in mice based on a light gradient boosting machine algorithm.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://sites.broadinstitute.org/pan-lab/resources",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-08-24T08:08:05.284058Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/broadinstitute/IntelliSleepScorer"
        }
    ],
    "name": "IntelliSleepScorer",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1038/S41598-023-31288-2",
            "metadata": {
                "abstract": "Machine learning has been applied in recent years to categorize sleep stages (NREM, REM, and wake) using electroencephalogram (EEG) recordings; however, a well-validated sleep scoring automatic pipeline in rodent research is still not publicly available. Here, we present IntelliSleepScorer, a software package with a graphic user interface to score sleep stages automatically in mice. IntelliSleepScorer uses the light gradient boosting machine (LightGBM) to score sleep stages for each epoch of recordings. We developed LightGBM models using a large cohort of data, which consisted of 5776 h of sleep EEG and electromyogram (EMG) signals across 519 unique recordings from 124 mice. The LightGBM model achieved an overall accuracy of 95.2% and a Cohen’s kappa of 0.91, which outperforms the baseline models such as the logistic regression model (accuracy = 93.3%, kappa = 0.88) and the random forest model (accuracy = 94.3%, kappa = 0.89). The overall performance of the LightGBM model as well as the performance across different sleep stages are on par with that of the human experts. Most importantly, we validated the generalizability of the LightGBM models: (1) The LightGBM model performed well on two publicly available, independent datasets (kappa > = 0.80), which have different sampling frequency and epoch lengths; (2) The LightGBM model performed well on data recorded at a lower sampling frequency (kappa = 0.90); (3) The performance of the LightGBM model is not affected by the light/dark cycle; and (4) A modified LightGBM model performed well on data containing only one EEG and one EMG electrode (kappa > = 0.89). Taken together, the LightGBM models offer state-of-the-art performance for automatic sleep stage scoring in mice. Last, we implemented the IntelliSleepScorer software package based on the validated model to provide an out-of-box solution to sleep researchers (available for download at https://sites.broadinstitute.org/pan-lab/resources).",
                "authors": [
                    {
                        "name": "Choi S."
                    },
                    {
                        "name": "Kern R."
                    },
                    {
                        "name": "Pan J.Q."
                    },
                    {
                        "name": "Wang L.A."
                    },
                    {
                        "name": "Yu E."
                    }
                ],
                "date": "2023-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "IntelliSleepScorer, a software package with a graphic user interface for automated sleep stage scoring in mice based on a light gradient boosting machine algorithm"
            },
            "pmcid": "PMC10017698",
            "pmid": "36922536"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
