{
    "accessibility": "Open access",
    "additionDate": "2024-03-26T23:53:30.900328Z",
    "biotoolsCURIE": "biotools:physher",
    "biotoolsID": "physher",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "mathieu.fourment@uts.edu.au",
            "name": "Mathieu Fourment",
            "orcidid": "https://orcid.org/0000-0001-8153-9822",
            "typeEntity": "Person",
            "typeRole": [
                "Developer",
                "Maintainer",
                "Primary contact",
                "Support"
            ],
            "url": "https://github.com/4ment"
        }
    ],
    "description": "A multi-algorithmic framework for phylogenetic inference",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Nucleic acid sequence alignment",
                        "uri": "http://edamontology.org/data_1383"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Phylogenetic inference (maximum likelihood and Bayesian methods)",
                    "uri": "http://edamontology.org/operation_0547"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Phylogenetic tree",
                        "uri": "http://edamontology.org/data_0872"
                    },
                    "format": [
                        {
                            "term": "newick",
                            "uri": "http://edamontology.org/format_1910"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "https://github.com/4ment/physher",
    "language": [
        "C",
        "C++"
    ],
    "lastUpdate": "2024-11-24T14:06:37.770200Z",
    "license": "GPL-2.0",
    "name": "physher",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "4ment",
    "publication": [
        {
            "doi": "10.1093/sysbio/syz046",
            "metadata": {
                "abstract": "The marginal likelihood of a model is a key quantity for assessing the evidence provided by the data in support of a model. The marginal likelihood is the normalizing constant for the posterior density, obtained by integrating the product of the likelihood and the prior with respect to model parameters. Thus, the computational burden of computing the marginal likelihood scales with the dimension of the parameter space. In phylogenetics, where we work with tree topologies that are high-dimensional models, standard approaches to computing marginal likelihoods are very slow. Here, we study methods to quickly compute the marginal likelihood of a single fixed tree topology. We benchmark the speed and accuracy of 19 different methods to compute the marginal likelihood of phylogenetic topologies on a suite of real data sets under the JC69 model. These methods include several new ones that we develop explicitly to solve this problem, as well as existing algorithms that we apply to phylogenetic models for the first time. Altogether, our results show that the accuracy of these methods varies widely, and that accuracy does not necessarily correlate with computational burden. Our newly developed methods are orders of magnitude faster than standard approaches, and in some cases, their accuracy rivals the best established estimators.",
                "authors": [
                    {
                        "name": "Bilge A."
                    },
                    {
                        "name": "Fourment M."
                    },
                    {
                        "name": "Magee A.F."
                    },
                    {
                        "name": "Matsen F.A."
                    },
                    {
                        "name": "Minin V.N."
                    },
                    {
                        "name": "Whidden C."
                    }
                ],
                "citationCount": 32,
                "date": "2020-03-01T00:00:00Z",
                "journal": "Systematic Biology",
                "title": "19 Dubious Ways to Compute the Marginal Likelihood of a Phylogenetic Tree Topology"
            },
            "pmcid": "PMC7571498",
            "pmid": "31504998",
            "type": [
                "Usage"
            ]
        },
        {
            "doi": "10.1186/s12862-014-0163-6",
            "metadata": {
                "abstract": "Background: Early methods for estimating divergence times from gene sequence data relied on the assumption of a molecular clock. More sophisticated methods were created to model rate variation and used auto-correlation of rates, local clocks, or the so called \"uncorrelated relaxed clock\" where substitution rates are assumed to be drawn from a parametric distribution. In the case of Bayesian inference methods the impact of the prior on branching times is not clearly understood, and if the amount of data is limited the posterior could be strongly influenced by the prior. Results: We develop a maximum likelihood method - Physher - that uses local or discrete clocks to estimate evolutionary rates and divergence times from heterochronous sequence data. Using two empirical data sets we show that our discrete clock estimates are similar to those obtained by other methods, and that Physher outperformed some methods in the estimation of the root age of an influenza virus data set. A simulation analysis suggests that Physher can outperform a Bayesian method when the real topology contains two long branches below the root node, even when evolution is strongly clock-like. Conclusions: These results suggest it is advisable to use a variety of methods to estimate evolutionary rates and divergence times from heterochronous sequence data. Physher and the associated data sets used here are available online at. © 2014 Fourment and Holmes; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Fourment M."
                    },
                    {
                        "name": "Holmes E.C."
                    }
                ],
                "citationCount": 20,
                "date": "2014-07-24T00:00:00Z",
                "journal": "BMC Evolutionary Biology",
                "title": "Novel non-parametric models to estimate evolutionary rates and divergence times from heterochronous sequence data"
            },
            "pmcid": "PMC4222489",
            "pmid": "25055743",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        }
    ],
    "version": [
        "2.0.0"
    ]
}
