{
    "additionDate": "2021-01-18T11:50:53Z",
    "biotoolsCURIE": "biotools:obelisc",
    "biotoolsID": "obelisc",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "yokada@sg.med.osaka-u.ac.jp",
            "name": "Yukinori Okada",
            "typeEntity": "Person"
        }
    ],
    "description": "An identical-by-descent mapping tool based on SNP streak.\n\nobelisc (Observational linkage scan) is an identical-by-descent (IBD) mapping tool based on the SNP streak approach.\n\nobelisc is a command line tool to perform two effective nonparametric linkage analyses (i.e., SNP streak-based IBD mapping and runs of homozygosity (ROH) mapping). obelisc also supports an intuitive visualization of the analytical results.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                }
            ]
        }
    ],
    "homepage": "https://github.com/qsonehara/Obelisc",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T20:39:13.346294Z",
    "name": "Obelisc",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btaa940",
            "metadata": {
                "abstract": "Motivation: Genetic linkage analysis has made a huge contribution to the genetic mapping of Mendelian diseases. However, most previously available linkage analysis methods have limited applicability. Since parametric linkage analysis requires predefined model of inheritance with a fixed set of parameters, it is inapplicable without fully structured pedigree information. Furthermore, the analytical results are dependent on the specification of model parameters. While non-parametric linkage analysis can avoid these problems, the runs of homozygosity (ROH) mapping, a widely used non-parametric linkage analysis method, can only deal with recessive inheritance. The implementation of non-parametric linkage analyses capable of dealing with both dominant and recessive inheritance has been required. Results: We have developed the Obelisc (Observational linkage scan), a flexibly applicable user-friendly non-parametric linkage analysis tool, which also provides an intuitive visualization of the analytical results. Obelisc is based on the SNP streak approach, which does not require any predefined inheritance model with parameters. In contrast to the ROH mapping, the SNP streak approach is applicable to both dominant and recessive traits. To illustrate the performance of Obelisc, we generated a pseudo-pedigree from the publicly available BioBank Japan Project genome-wide genotype dataset (n > 180 000). By applying Obelisc to this pseudo-pedigree, we successfully identified the regions with inherited identical-by-descent haplotypes shared among the members of the pseudo-pedigree, which was validated by the population-based haplotype phasing approach.",
                "authors": [
                    {
                        "name": "Okada Y."
                    },
                    {
                        "name": "Sonehara K."
                    }
                ],
                "citationCount": 1,
                "date": "2020-12-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Obelisc: An identical-by-descent mapping tool based on SNP streak"
            },
            "pmcid": "PMC8023673",
            "pmid": "33135050"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Biobank",
            "uri": "http://edamontology.org/topic_3337"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ]
}
