
{
    "credit": [
        {
            "email": "LGarmire@cc.hawaii.edu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www2.hawaii.edu/~lgarmire/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://www2.hawaii.edu/~lgarmire/RNASeqPowerCalculator.htm"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "RNA-Seq analysis",
                    "uri": "http://edamontology.org/operation_3680"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "RNA-Seq",
                "uri": "http://edamontology.org/topic_3170"
            },
            {
                "term": "RNA",
                "uri": "http://edamontology.org/topic_0099"
            },
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/rnaseqpowercalculator-calculate-the-power-and-sample-size-for-rna-seq-differential-expression.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2014 Ching et al.It is crucial for researchers to optimize RNA-seq experimental designs for differential expression detection. Currently, the field lacks general methods to estimate power and sample size for RNA-Seq in complex experimental designs, under the assumption of the negative binomial distribution. We simulate RNA-Seq count data based on parameters estimated from six widely different public data sets (including cell line comparison, tissue comparison, and cancer data sets) and calculate the statistical power in paired and unpaired sample experiments. We comprehensively compare five differential expression analysis packages (DESeq, edgeR, DESeq2, sSeq, and EBSeq) and evaluate their performance by power, receiver operator characteristic (ROC) curves, and other metrics including areas under the curve (AUC), Matthews correlation coefficient (MCC), and F-measures. DESeq2 and edgeR tend to give the best performance in general. Increasing sample size or sequencing depth increases power; however, increasing sample size is more potent than sequencing depth to increase power, especially when the sequencing depth reaches 20 million reads. Long intergenic noncoding RNAs (lincRNA) yields lower power relative to the protein coding mRNAs, given their lower expression level in the same RNA-Seq experiment. On the other hand, paired-sample RNA-Seq significantly enhances the statistical power, confirming the importance of considering the multifactor experimental design. Finally, a local optimal power is achievable for a given budget constraint, and the dominant contributing factor is sample size rather than the sequencing depth. In conclusion, we provide a power analysis tool (http://www2.hawaii.edu/∼lgarmire/RNASeqPowerCalculator.htm) that captures the dispersion in the data and can serve as a practical reference under the budget constraint of RNA-Seq experiments.",
            "authors": [
                "Ching T.",
                "Huang S.",
                "Garmire L.X."
            ],
            "cit_count": 60,
            "journal": "RNA",
            "pmid": "25246651",
            "title": "Power analysis and sample size estimation for RNA-Seq differential expression",
            "year": "2014-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:rnaseqpowercalculator",
        "biotoolsID": "rnaseqpowercalculator",
        "description": "The tool captures the dispersion in the data and can serve as a practical reference under the budget constraint of RNA-Seq experiments.",
        "homepage": "http://www2.hawaii.edu/~lgarmire/RNASeqPowerCalculator.htm",
        "name": "RNASeqPowerCalculator"
    }
}