{
    "additionDate": "2022-10-22T17:30:08.819976Z",
    "biotoolsCURIE": "biotools:kpp",
    "biotoolsID": "kpp",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "liuchengcheng519@163.com",
            "name": "Chengcheng Liu",
            "typeEntity": "Person"
        },
        {
            "email": "yangyi528@scu.edu.cn",
            "name": "Yi Yang",
            "typeEntity": "Person"
        }
    ],
    "description": "The KPP (Kmer Phylogenetic Profile) is a new algorithm for constructing phylogenetic profile by compressing sequences to contig and generating evolutionary information features. Using this feature or concatenating other features with the ML framework for the prediction of PHI (pathogen-host interaction).",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Phylogenetic analysis",
                    "uri": "http://edamontology.org/operation_0324"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                }
            ]
        }
    ],
    "homepage": "https://github.com/yangfangs/KPP",
    "language": [
        "Java"
    ],
    "lastUpdate": "2022-10-22T17:30:08.822592Z",
    "license": "Not licensed",
    "name": "KPP",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3389/FCIMB.2022.931072",
            "metadata": {
                "abstract": "Copyright © 2022 Fang, Yang and Liu.Motivation: The understanding of pathogen-host interactions (PHIs) is essential and challenging research because this potentially provides the mechanism of molecular interactions between different organisms. The experimental exploration of PHI is time-consuming and labor-intensive, and computational approaches are playing a crucial role in discovering new unknown PHIs between different organisms. Although it has been proposed that most machine learning (ML)–based methods predict PHI, these methods are all based on the structure-based information extracted from the sequence for prediction. The selection of feature values is critical to improving the performance of predicting PHI using ML. Results: This work proposed a new method to extract features from phylogenetic profiles as evolutionary information for predicting PHI. The performance of our approach is better than that of structure-based and ML-based PHI prediction methods. The five different extract models proposed by our approach combined with structure-based information significantly improved the performance of PHI, suggesting that combining phylogenetic profile features and structure-based methods could be applied to the exploration of PHI and discover new unknown biological relativity. Availability and implementation: The KPP method is implemented in the Java language and is available at https://github.com/yangfangs/KPP.",
                "authors": [
                    {
                        "name": "Fang Y."
                    },
                    {
                        "name": "Liu C."
                    },
                    {
                        "name": "Yang Y."
                    }
                ],
                "date": "2022-08-02T00:00:00Z",
                "journal": "Frontiers in Cellular and Infection Microbiology",
                "title": "New feature extraction from phylogenetic profiles improved the performance of pathogen-host interactions"
            },
            "pmcid": "PMC9378789",
            "pmid": "35982784"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Protein interaction experiment",
            "uri": "http://edamontology.org/topic_3957"
        }
    ]
}
