{
    "additionDate": "2019-11-14T19:51:29Z",
    "biotoolsCURIE": "biotools:EventEpi",
    "biotoolsID": "EventEpi",
    "confidence_flag": "tool",
    "description": "EventEpi - A Natural Language Processing Framework for Event-Based Surveillance  - is a tool to extract the most important entites from a epidemiological text and to analyze them.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Named-entity and concept recognition",
                    "uri": "http://edamontology.org/operation_3280"
                }
            ]
        }
    ],
    "homepage": "https://github.com/aauss/EventEpi",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-28T13:43:24Z",
    "name": "EventEpi",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/19006395"
        },
        {
            "doi": "10.1371/journal.pcbi.1008277",
            "metadata": {
                "abstract": "© 2020 Abbood et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.According to the World Health Organization (WHO), around 60% of all outbreaks are detected using informal sources. In many public health institutes, including the WHO and the Robert Koch Institute (RKI), dedicated groups of public health agents sift through numerous articles and newsletters to detect relevant events. This media screening is one important part of event-based surveillance (EBS). Reading the articles, discussing their relevance, and putting key information into a database is a time-consuming process. To support EBS, but also to gain insights into what makes an article and the event it describes relevant, we developed a natural language processing framework for automated information extraction and relevance scoring. First, we scraped relevant sources for EBS as done at the RKI (WHO Disease Outbreak News and ProMED) and automatically extracted the articles' key data: disease, country, date, and confirmed-case count. For this, we performed named entity recognition in two steps: EpiTator, an open-source epidemiological annotation tool, suggested many different possibilities for each. We extracted the key country and disease using a heuristic with good results. We trained a naive Bayes classifier to find the key date and confirmed-case count, using the RKI's EBS database as labels which performed modestly. Then, for relevance scoring, we defined two classes to which any article might belong: The article is relevant if it is in the EBS database and irrelevant otherwise. We compared the performance of different classifiers, using bag-of-words, document and word embeddings. The best classifier, a logistic regression, achieved a sensitivity of 0.82 and an index balanced accuracy of 0.61. Finally, we integrated these functionalities into a web application called EventEpi where relevant sources are automatically analyzed and put into a database. The user can also provide any URL or text, that will be analyzed in the same way and added to the database. Each of these steps could be improved, in particular with larger labeled datasets and fine-tuning of the learning algorithms. The overall framework, however, works already well and can be used in production, promising improvements in EBS. The source code and data are publicly available under open licenses.",
                "authors": [
                    {
                        "name": "Abbood A."
                    },
                    {
                        "name": "Busche R."
                    },
                    {
                        "name": "Ghozzi S."
                    },
                    {
                        "name": "Ullrich A."
                    }
                ],
                "citationCount": 1,
                "date": "2020-11-20T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "EventEpi-A natural language processing framework for event-based surveillance"
            }
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ],
    "validated": 1
}
