{
    "accessibility": [],
    "additionDate": "2017-08-03T18:43:34Z",
    "biotoolsCURIE": "biotools:flowerpower",
    "biotoolsID": "flowerpower",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": "nandinik@berkeley.edu",
            "gridid": null,
            "name": null,
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        }
    ],
    "description": "Clustering algorithm designed for the identification of global homologs. It employs an iterative approach to clustering sequences. However, rather than using a single HMM or profile to expand the cluster, this tool identifies subfamilies using the SCI-PHY algorithm and then selects and aligns new homologs using subfamily hidden Markov models. It is shown to outperform BLAST, PSI-BLAST and the UCSC SAM-Target 2K methods.",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "http://phylogenomics.berkeley.edu/software"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Sequence clustering",
                    "uri": "http://edamontology.org/operation_0291"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://phylogenomics.berkeley.edu/software",
    "homepage_status": 0,
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "license": null,
    "link": [
        {
            "note": null,
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/flowerpower-clustering-algorithm-identification-global-homologs.html"
        }
    ],
    "maturity": null,
    "name": "FlowerPower",
    "operatingSystem": [
        "Linux"
    ],
    "otherID": [],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": null,
            "metadata": {
                "abstract": "Background. Function prediction by transfer of annotation from the top database hit in a homology search has been shown to be prone to systematic error. Phylogenomic analysis reduces these errors by inferring protein function within the evolutionary context of the entire family. However, accuracy of function prediction for multi-domain proteins depends on all members having the same overall domain structure. By contrast, most common homolog detection methods are optimized for retrieving local homologs, and do not address this requirement. Results. We present FlowerPower, a novel clustering algorithm designed for the identification of global homologs as a precursor to structural phylogenomic analysis. Similar to methods such as PSIBLAST, FlowerPower employs an iterative approach to clustering sequences. However, rather than using a single HMM or profile to expand the cluster, FlowerPower identifies subfamilies using the SCI-PHY algorithm and then selects and aligns new homologs using subfamily hidden Markov models. FlowerPower is shown to outperform BLAST, PSI-BLAST and the UCSC SAM-Target 2K methods at discrimination between proteins in the same domain architecture class and those having different overall domain structures. Conclusion. Structural phylogenomic analysis enables biologists to avoid the systematic errors associated with annotation transfer; clustering sequences based on sharing the same domain architecture is a critical first step in this process. FlowerPower is shown to consistently identify homologous sequences having the same domain architecture as the query. Availability. FlowerPower is available as a webserver at http://phylogenomics.berkeley.edu/ flowerpower/. © 2007 Krishnamurthy et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Krishnamurthy N."
                    },
                    {
                        "name": "Brown D."
                    },
                    {
                        "name": "Sjolander K."
                    }
                ],
                "citationCount": 42,
                "date": "2007-12-01T00:00:00Z",
                "journal": "BMC Evolutionary Biology",
                "title": "FlowerPower: Clustering proteins into domain architecture classes for phylogenomic inference of protein function"
            },
            "note": null,
            "pmcid": null,
            "pmid": "17288570",
            "type": null,
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        }
    ],
    "validated": 1,
    "version": []
}