{
    "accessibility": "Open access",
    "additionDate": "2023-02-17T13:17:27.058896Z",
    "biotoolsCURIE": "biotools:nlm-chem-bc7",
    "biotoolsID": "nlm-chem-bc7",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "zhiyong.lu@nih.gov",
            "name": "Zhiyong Lu",
            "orcidid": "https://orcid.org/0000-0001-9998-916X",
            "typeEntity": "Person"
        },
        {
            "name": "Robert Leaman"
        },
        {
            "name": "Susan Schmidt"
        },
        {
            "name": "Rezarta Islamaj",
            "orcidid": "https://orcid.org/0000-0001-5651-1860"
        }
    ],
    "description": "Manually annotated full-text resources for chemical entity annotation and indexing in biomedical articles.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Named-entity and concept recognition",
                    "uri": "http://edamontology.org/operation_3280"
                },
                {
                    "term": "Text annotation",
                    "uri": "http://edamontology.org/operation_3778"
                }
            ]
        }
    ],
    "homepage": "https://ftp.ncbi.nlm.nih.gov/pub/lu/NLM-Chem-BC7-corpus/",
    "lastUpdate": "2023-02-17T13:17:27.061532Z",
    "name": "NLM-Chem-BC7",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAAC102",
            "metadata": {
                "abstract": "© 2022 Published by Oxford University Press. This work is written by (a) US Government employee(s) and is in the public domain in the US.The automatic recognition of chemical names and their corresponding database identifiers in biomedical text is an important first step for many downstream text-mining applications. The task is even more challenging when considering the identification of these entities in the article's full text and, furthermore, the identification of candidate substances for that article's metadata [Medical Subject Heading (MeSH) article indexing]. The National Library of Medicine (NLM)-Chem track at BioCreative VII aimed to foster the development of algorithms that can predict with high quality the chemical entities in the biomedical literature and further identify the chemical substances that are candidates for article indexing. As a result of this challenge, the NLM-Chem track produced two comprehensive, manually curated corpora annotated with chemical entities and indexed with chemical substances: The chemical identification corpus and the chemical indexing corpus. The NLM-Chem BioCreative VII (NLM-Chem-BC7) Chemical Identification corpus consists of 204 full-Text PubMed Central (PMC) articles, fully annotated for chemical entities by 12 NLM indexers for both span (i.e. named entity recognition) and normalization (i.e. entity linking) using MeSH. This resource was used for the training and testing of the Chemical Identification task to evaluate the accuracy of algorithms in predicting chemicals mentioned in recently published full-Text articles. The NLM-Chem-BC7 Chemical Indexing corpus consists of 1333 recently published PMC articles, equipped with chemical substance indexing by manual experts at the NLM. This resource was used for the evaluation of the Chemical Indexing task, which evaluated the accuracy of algorithms in predicting the chemicals that should be indexed, i.e. appear in the listing of MeSH terms for the document. This set was further enriched after the challenge in two ways: (i) 11 NLM indexers manually verified each of the candidate terms appearing in the prediction results of the challenge participants, but not in the MeSH indexing, and the chemical indexing terms appearing in the MeSH indexing list, but not in the prediction results, and (ii) the challenge organizers algorithmically merged the chemical entity annotations in the full text for all predicted chemical entities and used a statistical approach to keep those with the highest degree of confidence. As a result, the NLM-Chem-BC7 Chemical Indexing corpus is a gold-standard corpus for chemical indexing of journal articles and a silver-standard corpus for chemical entity identification in full-Text journal articles. Together, these resources are currently the most comprehensive resources for chemical entity recognition, and we demonstrate improvements in the chemical entity recognition algorithms. We detail the characteristics of these novel resources and make them available for the community. Database URL: https://ftp.ncbi.nlm.nih.gov/pub/lu/NLM-Chem-BC7-corpus/",
                "authors": [
                    {
                        "name": "Cissel D."
                    },
                    {
                        "name": "Coss C."
                    },
                    {
                        "name": "Denicola J."
                    },
                    {
                        "name": "Fisher C."
                    },
                    {
                        "name": "Guzman R."
                    },
                    {
                        "name": "Islamaj R."
                    },
                    {
                        "name": "Kochar P.G."
                    },
                    {
                        "name": "Leaman R."
                    },
                    {
                        "name": "Lu Z."
                    },
                    {
                        "name": "Miliaras N."
                    },
                    {
                        "name": "Punske Z."
                    },
                    {
                        "name": "Schmidt S."
                    },
                    {
                        "name": "Sekiya K."
                    },
                    {
                        "name": "Trinh D."
                    },
                    {
                        "name": "Whitman D."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Database",
                "title": "NLM-Chem-BC7: Manually annotated full-Text resources for chemical entity annotation and indexing in biomedical articles"
            },
            "pmcid": "PMC9716560",
            "pmid": "36458799"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Biochemistry",
            "uri": "http://edamontology.org/topic_3292"
        },
        {
            "term": "Compound libraries and screening",
            "uri": "http://edamontology.org/topic_3343"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Toxicology",
            "uri": "http://edamontology.org/topic_2840"
        }
    ]
}
