{
    "additionDate": "2020-01-09T17:35:25Z",
    "biotoolsCURIE": "biotools:MD-LOVIs",
    "biotoolsID": "MD-LOVIs",
    "confidence_flag": "tool",
    "description": "When global and local molecular descriptors are more than the sum of its parts.\n\nMD-LOVIs (acronym for Molecular Descriptors from LOcal Vertex Invariants and Related Maps) is a multi-platform software developed in the Java programming.\n\n…methods and tools for Chem-Bio-Med-Informatic Studies.\n\nMD-LOVIs (acronym for Molecular Descriptors from LOcal Vertex Invariants and Related Maps) is a multi-platform software developed in the Java programming language",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Hydrogen bond calculation",
                    "uri": "http://edamontology.org/operation_0394"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "homepage": "http://tomocomd.com/md-lovis",
    "language": [
        "Java"
    ],
    "lastUpdate": "2020-12-23T08:12:52Z",
    "name": "MD-LOVIs",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/S11030-019-10002-3",
            "metadata": {
                "abstract": "© 2019, Springer Nature Switzerland AG.Abstract: In this report, we introduce a set of aggregation operators (AOs) to calculate global and local (group and atom type) molecular descriptors (MDs) as a generalization of the classical approach of molecular encoding using the sum of the atomic (or fragment) contributions. These AOs are implemented in a new and free software denominated MD-LOVIs (http://tomocomd.com/md-lovis), which allows for the calculation of MDs from atomic weights vector and LOVIs (local vertex invariants). This software was developed in Java programming language and employed the Chemical Development Kit (CDK) library for handling chemical structures and the calculation of atomic weights. An analysis of the complexities of the algorithms presented herein demonstrates that these aspects were efficiently implemented. The calculation speed experiments show that the MD-LOVIs software has satisfactory behavior when compared to software such as Padel, CDKDescriptor, DRAGON and Bluecal software. Shannon’s entropy (SE)-based variability studies demonstrate that MD-LOVIs yields indices with greater information content when compared to those of popular academic and commercial software. A principal component analysis reveals that our approach captures chemical information orthogonal to that codified by the DRAGON, Padel and Mold2 software, as a result of the several generalizations in MD-LOVIs not used in other programs. Lastly, three QSARs were built using multiple linear regression with genetic algorithms, and the statistical parameters of these models demonstrate that the MD-LOVIs indices obtained with AOs yield better performance than those obtained when the summation operator is used exclusively. Moreover, it is also revealed that the MD-LOVIs indices yield models with comparable to superior performance when compared to other QSAR methodologies reported in the literature, despite their simplicity. The studies performed herein collectively demonstrated that MD-LOVIs software generates indices as simple as possible, but not simpler and that use of AOs enhances the diversity of the chemical information codified, which consequently improves the performance of traditional MDs. Graphic abstract: [Figure not available: see fulltext.]",
                "authors": [
                    {
                        "name": "Martinez-Lopez Y."
                    },
                    {
                        "name": "Marrero-Ponce Y."
                    },
                    {
                        "name": "Barigye S.J."
                    },
                    {
                        "name": "Teran E."
                    },
                    {
                        "name": "Martinez-Santiago O."
                    },
                    {
                        "name": "Zambrano C.H."
                    },
                    {
                        "name": "Torres F.J."
                    }
                ],
                "citationCount": 5,
                "date": "2020-11-01T00:00:00Z",
                "journal": "Molecular Diversity",
                "title": "When global and local molecular descriptors are more than the sum of its parts: Simple, But Not Simpler?"
            },
            "pmid": "31659696"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        }
    ],
    "validated": 1
}