{
    "additionDate": "2017-01-13T13:16:23Z",
    "biotoolsCURIE": "biotools:sequedex",
    "biotoolsID": "sequedex",
    "credit": [
        {
            "email": "sequedex@lanl.gov",
            "name": "Sequedex Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Sequedex classifies short reads for phylogeny and function at high speed",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://sequedex.readthedocs.io/en/latest/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                },
                {
                    "term": "Sequence annotation",
                    "uri": "http://edamontology.org/operation_0361"
                }
            ]
        }
    ],
    "homepage": "http://sequedex.lanl.gov",
    "language": [
        "Java",
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "maturity": "Mature",
    "name": "Sequedex",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: Classification is difficult for shotgun metagenomics data from environments such as soils, where the diversity of sequences is high and where reference sequences from close relatives may not exist. Approaches based on sequence-similarity scores must deal with the confounding effects that inheritance and functional pressures exert on the relation between scores and phylogenetic distance, while approaches based on sequence alignment and tree-building are typically limited to a small fraction of gene families. We describe an approach based on finding one or more exact matches between a read and a precomputed set of peptide 10-mers. Results: At even the largest phylogenetic distances, thousands of 10-mer peptide exact matches can be found between pairs of bacterial genomes. Genes that share one or more peptide 10-mers typically have high reciprocal BLAST scores. Among a set of 403 representative bacterial genomes, some 20 million 10-mer peptides were found to be shared. We assign each of these peptides as a signature of a particular node in a phylogenetic reference tree based on the RNA polymerase genes. We classify the phylogeny of a genomic fragment (e.g., read) at the most specific node on the reference tree that is consistent with the phylogeny of observed signature peptides it contains. Using both synthetic data from four newly-sequenced soil-bacterium genomes and ten real soil metagenomics data sets, we demonstrate a sensitivity and specificity comparable to that of the MEGAN metagenomics analysis package using BLASTX against the NR database. Phylogenetic and functional similarity metrics applied to real metagenomics data indicates a signal-to-noise ratio of approximately 400 for distinguishing among environments. Our method assigns ∼6.6 Gbp/hr on a single CPU, compared with 25 kbp/hr for methods based on BLASTX against the NR database. Conclusions: Classification by exact matching against a precomputed list of signature peptides provides comparable results to existing techniques for reads longer than about 300 bp and does not degrade severely with shorter reads. Orders of magnitude faster than existing methods, the approach is suitable now for inclusion in analysis pipelines and appears to be extensible in several different directions. © 2012 Berendzen et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Berendzen J."
                    },
                    {
                        "name": "Bruno W.J."
                    },
                    {
                        "name": "Cohn J.D."
                    },
                    {
                        "name": "Hengartner N.W."
                    },
                    {
                        "name": "Kuske C.R."
                    },
                    {
                        "name": "McMahon B.H."
                    },
                    {
                        "name": "Wolinsky M.A."
                    },
                    {
                        "name": "Xie G."
                    }
                ],
                "citationCount": 18,
                "date": "2012-08-30T00:00:00Z",
                "journal": "BMC Research Notes",
                "title": "Rapid phylogenetic and functional classification of short genomic fragments with signature peptides"
            },
            "pmid": "22925230"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1
}