{
    "additionDate": "2024-05-23T23:15:53.984643Z",
    "biotoolsCURIE": "biotools:treeviewer",
    "biotoolsID": "treeviewer",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "giorgio.bianchini@bristol.ac.uk",
            "name": "Giorgio Bianchini",
            "orcidid": "https://orcid.org/0000-0003-0223-0339",
            "typeEntity": "Person"
        }
    ],
    "description": "Flexible, modular software to visualise and manipulate phylogenetic trees.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic inference",
                    "uri": "http://edamontology.org/operation_0323"
                },
                {
                    "term": "Phylogenetic tree annotation",
                    "uri": "http://edamontology.org/operation_0558"
                },
                {
                    "term": "Phylogenetic tree editing",
                    "uri": "http://edamontology.org/operation_0326"
                },
                {
                    "term": "Phylogenetic tree visualisation",
                    "uri": "http://edamontology.org/operation_0567"
                }
            ]
        }
    ],
    "homepage": "https://treeviewer.org",
    "language": [
        "C#"
    ],
    "lastUpdate": "2024-05-23T23:15:53.986638Z",
    "license": "AGPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/arklumpus/TreeViewer"
        }
    ],
    "name": "TreeViewer",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/ece3.10873",
            "metadata": {
                "abstract": "Phylogenetic trees illustrate evolutionary relationships between taxa or genes. Tree figures are crucial when presenting results and data, and by creating clear and effective plots, researchers can describe many kinds of evolutionary patterns. However, producing tree plots can be a time-consuming task, especially as multiple different programs are often needed to adjust and illustrate all data associated with a tree. We present TreeViewer, a new software to draw phylogenetic trees. TreeViewer is flexible, modular, and user-friendly. Plots are produced as the result of a user-defined pipeline, which can be finely customised and easily applied to different trees. Every feature of the program is documented and easily accessible, either in the online manual or within the program's interface. We show how TreeViewer can be used to produce publication-ready figures, saving time by not requiring additional graphical post-processing tools. TreeViewer is freely available for Windows, macOS, and Linux operating systems and distributed under an AGPLv3 licence from https://treeviewer.org. It has a graphical user interface (GUI), as well as a command-line interface, which is useful to work with very large trees and for automated pipelines. A detailed user manual with examples and tutorials is also available. TreeViewer is mainly aimed at users wishing to produce highly customised, publication-quality tree figures using a single GUI software tool. Compared to other GUI tools, TreeViewer offers a richer feature set and a finer degree of customisation. Compared to command-line-based tools and software libraries, TreeViewer's graphical interface is more accessible. The flexibility of TreeViewer's approach to phylogenetic tree plotting enables the program to produce a wide variety of publication-ready figures. Users are encouraged to create their own custom modules to expand the functionalities of the program. This sets the scene for an ever-expanding and ever-adapting software framework that can easily adjust to respond to new challenges.",
                "authors": [
                    {
                        "name": "Bianchini G."
                    },
                    {
                        "name": "Sanchez-Baracaldo P."
                    }
                ],
                "citationCount": 2,
                "date": "2024-02-01T00:00:00Z",
                "journal": "Ecology and Evolution",
                "title": "TreeViewer: Flexible, modular software to visualise and manipulate phylogenetic trees"
            },
            "pmcid": "PMC10834882",
            "pmid": "38314311"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
