{
    "accessibility": "Open access",
    "additionDate": "2020-01-14T20:13:19Z",
    "biotoolsCURIE": "biotools:iedb-v2",
    "biotoolsID": "iedb-v2",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "andreas.lopata@jcu.edu.au",
            "name": "Andreas L. Lopata",
            "typeEntity": "Person"
        }
    ],
    "description": "Conservation Analysis of B-Cell Allergen Epitopes to Predict Clinical Cross-Reactivity Between Shellfish and Inhalant Invertebrate Allergens.\n\nFree epitope database and prediction resource.\n\nFree resource for searching and exporting immune epitopes. Includes more than 95% of all published infectious disease, allergy, autoimmune, and transplant epitope data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peptide immunogenicity prediction",
                    "uri": "http://edamontology.org/operation_0252"
                },
                {
                    "term": "Epitope mapping",
                    "uri": "http://edamontology.org/operation_0416"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://www.iedb.org/",
    "lastUpdate": "2020-12-14T08:44:10Z",
    "name": "IEDB",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.3389/FIMMU.2019.02676",
            "metadata": {
                "abstract": "© Copyright © 2019 Nugraha, Kamath, Johnston, Karnaneedi, Ruethers and Lopata.Understanding and predicting an individual's clinical cross-reactivity to related allergens is a key to better management, treatment and progression of novel therapeutics for food allergy. In food allergy, clinical cross-reactivity is observed in patients reacting to unexpected allergen sources containing the same allergenic protein or antibody binding patches (epitopes), often resulting in severe allergic reactions. Shellfish allergy affects up to 2% of the world population and persists for life in most patients. The diagnosis of shellfish allergy is however often challenging due to reported clinical cross-reactivity to other invertebrates including mites and cockroaches. Prediction of cross-reactivity can be achieved utilizing an in-depth analysis of a few selected IgE-antibody binding epitopes. We combined available experimentally proven IgE-binding epitopes with informatics-based cross-reactivity prediction modeling to assist in the identification of clinical cross-reactive biomarkers on shellfish allergens. This knowledge can be translated into prevention and treatment of allergic diseases. To overcome the problem of predicting IgE cross-reactivity of shellfish allergens we developed an epitope conservation model using IgE binding epitopes available in the Immune Epitope Database and Analysis Resource (http://www.iedb.org/). We applied this method to a set of four different shrimp allergens, and successfully identified several non-cross-reactive as well as cross-reactive epitopes, which have been experimentally established to cross-react. Based on these findings we suggest that this method can be used for advanced component-resolved-diagnosis to identify patients sensitized to a specific shellfish group and distinguish from patients with extensive cross-reactivity to ingested and inhaled allergens from invertebrate sources.",
                "authors": [
                    {
                        "name": "Nugraha R."
                    },
                    {
                        "name": "Kamath S.D."
                    },
                    {
                        "name": "Johnston E."
                    },
                    {
                        "name": "Karnaneedi S."
                    },
                    {
                        "name": "Ruethers T."
                    },
                    {
                        "name": "Lopata A.L."
                    }
                ],
                "citationCount": 11,
                "date": "2019-11-19T00:00:00Z",
                "journal": "Frontiers in Immunology",
                "title": "Conservation Analysis of B-Cell Allergen Epitopes to Predict Clinical Cross-Reactivity Between Shellfish and Inhalant Invertebrate Allergens"
            },
            "pmcid": "PMC6877653",
            "pmid": "31803189"
        }
    ],
    "relation": [
        {
            "biotoolsID": "iedb",
            "type": "isNewVersionOf"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Allergy, clinical immunology and immunotherapeutics",
            "uri": "http://edamontology.org/topic_3400"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        },
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        }
    ],
    "validated": 1
}