{
    "accessibility": "Open access",
    "additionDate": "2024-06-18T17:05:43.655107Z",
    "biotoolsCURIE": "biotools:mm_db",
    "biotoolsID": "mm_db",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "guimingdeng2014@163.com",
            "name": "Guiming Deng",
            "typeEntity": "Person"
        },
        {
            "email": "manosh24@yahoo.com",
            "name": "Manosh Kumar Biswas",
            "typeEntity": "Person"
        }
    ],
    "description": "Genomic Resource for the Improvement of the Family Musaceae.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                },
                {
                    "term": "Nucleic acid feature detection",
                    "uri": "http://edamontology.org/operation_0415"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                }
            ]
        }
    ],
    "homepage": "http://www.genomicsres.org/mmdb/",
    "language": [
        "JavaScript",
        "PHP",
        "SQL"
    ],
    "lastUpdate": "2024-06-18T17:05:43.657875Z",
    "name": "MMdb",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3390/agronomy14040838",
            "metadata": {
                "abstract": "Molecular markers, including Simple Sequence Repeat (SSR), Single Nucleotide Polymorphism (SNP), and Intron Length Polymorphism (ILP), are widely utilized in crop improvement and population genetics studies. However, these marker resources remain insufficient for Musa species. In this study, we developed genome-wide SSR, SNP, and ILP markers from Musa and its sister species, creating a comprehensive molecular marker repository for the improvement of Musa species. This database contains 2,115,474 SSR, 63,588 SNP, and 91,547 ILP markers developed from thirteen Musa species and two of its relative species. We found that 77% of the SSR loci are suitable for marker development; 38% of SNP markers originated from the genic region, and transition mutations (C↔T; A↔G) were more frequent than transversion. The database is freely accessible and follows a ‘three-tier architecture,’ organizing marker information in MySQL tables. It has a user-friendly interface, written in JavaScript, PHP, and HTML code. Users can employ flexible search parameters, including marker location in the chromosome, transferability, polymorphism, and functional annotation, among others. These distinctive features distinguish the Musa Marker Database (MMdb) from existing marker databases by offering a novel approach that is tailored to the precise needs of the Musa research community. Despite being an in silico method, searching for markers based on various attributes holds promise for Musa research. These markers serve various purposes, including germplasm characterization, gene discovery, population structure analysis, and QTL mapping.",
                "authors": [
                    {
                        "name": "Biswas D."
                    },
                    {
                        "name": "Biswas M.K."
                    },
                    {
                        "name": "Deng G."
                    },
                    {
                        "name": "Yi G."
                    }
                ],
                "date": "2024-04-01T00:00:00Z",
                "journal": "Agronomy",
                "title": "The Musa Marker Database: A Comprehensive Genomic Resource for the Improvement of the Musaceae Family"
            }
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Mobile genetic elements",
            "uri": "http://edamontology.org/topic_0798"
        }
    ]
}
