{
    "accessibility": "Open access",
    "additionDate": "2022-05-17T20:45:14.059203Z",
    "biotoolsCURIE": "biotools:psoel-pseu",
    "biotoolsID": "psoel-pseu",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Lijun Han",
            "orcidid": "https://orcid.org/0000-0002-1832-3057"
        },
        {
            "name": "Xiao Wang",
            "orcidid": "https://orcid.org/0000-0002-3113-5149"
        },
        {
            "name": "Zhaoyuan Ding",
            "orcidid": "https://orcid.org/0000-0003-0965-2446"
        }
    ],
    "description": "A Feature Fusion Predictor for RNA Pseudouridine Sites with Particle Swarm Optimizer Based Feature Selection and Ensemble Learning Approach.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "RNA sequence",
                        "uri": "http://edamontology.org/data_3495"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                }
            ]
        }
    ],
    "homepage": "http://www.xwanglab.com/PsoEL-PseU/Server",
    "lastUpdate": "2022-05-17T20:45:14.061901Z",
    "name": "PsoEL-PseU",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3390/CIMB43030129",
            "metadata": {
                "abstract": "© 2021 by the authors. Licensee MDPI, Basel, Switzerland.RNA pseudouridine modification is particularly important in a variety of cellular biological and physiological processes. It plays a significant role in understanding RNA functions, RNA structure stabilization, translation processes, etc. To understand its functional mechanisms, it is necessary to accurately identify pseudouridine sites in RNA sequences. Although some computational methods have been proposed for the identification of pseudouridine sites, it is still a challenge to improve the identification accuracy and generalization ability. To address this challenge, a novel feature fusion predictor, named PsoEL-PseU, is proposed for the prediction of pseudouridine sites. Firstly, this study systematically and comprehensively explored different types of feature descriptors and determined six feature descriptors with various properties. To improve the feature representation ability, a binary particle swarm optimizer was used to capture the optimal feature subset for six feature descriptors. Secondly, six individual predictors were trained by using the six optimal feature subsets. Finally, to fuse the effects of all six features, six individual predictors were fused into an ensemble predictor by a parallel fusion strategy. Ten-fold cross-validation on three benchmark datasets indicated that the PsoEL-PseU predictor significantly outperformed the current state-of-the-art predictors. Additionally, the new predictor achieved better accuracy in the independent dataset evaluation—accuracy which is significantly higher than that of its existing counterparts—and the user-friendly webserver developed by the PsoEL-PseU predictor has been made freely accessible.",
                "authors": [
                    {
                        "name": "Ding Z."
                    },
                    {
                        "name": "Fan K."
                    },
                    {
                        "name": "Han L."
                    },
                    {
                        "name": "Han N."
                    },
                    {
                        "name": "Lin X."
                    },
                    {
                        "name": "Wang R."
                    },
                    {
                        "name": "Wang X."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "Current Issues in Molecular Biology",
                "title": "A feature fusion predictor for rna pseudouridine sites with particle swarm optimizer based feature selection and ensemble learning approach"
            },
            "pmid": "34889887"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
