{
    "additionDate": "2019-11-14T18:44:42Z",
    "biotoolsCURIE": "biotools:Stripes",
    "biotoolsID": "Stripes",
    "confidence_flag": "very low",
    "credit": [
        {
            "email": "orjan.carlborg@imbim.uu.se",
            "name": "Örjan Carlborg",
            "orcidid": "https://orcid.org/0000-0002-2722-5264",
            "typeEntity": "Person"
        }
    ],
    "description": "> VERY_LOW CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'Genotyping low-coverage whole-genome sequencing intercross pedigrees from outbred founders' | Genotyping by low-coverage whole-genome sequencing in intercross pedigrees from outbred founders | Whole-genome genotyping in experimental pedigrees from outbred founders utilizing low coverage individual based sequencing | Carlborg's Lab (Yanjun Zan, Thibaut Payen, Örjan Carlborg) - BMC - Uppsala University | Experimental intercrosses of divergent lines are useful to map loci (quantitative trait loci; QTL) contributing to phenotypic variation using the recombinant founder mosaic genotypes in the F2 generation | git clone https://github.com/CarlborgGenomics/Stripes",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                }
            ]
        }
    ],
    "homepage": "https://github.com/CarlborgGenomics/Stripes",
    "language": [
        "R",
        "Perl",
        "Python"
    ],
    "lastUpdate": "2019-11-14T18:44:42Z",
    "license": "GPL-3.0",
    "name": "Stripes",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12711-019-0487-1",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Experimental intercrosses between outbred founder populations are powerful resources for mapping loci that contribute to complex traits i.e. quantitative trait loci (QTL). Here, we present an approach and its accompanying software for high-resolution reconstruction of founder mosaic genotypes in the intercross offspring from such populations using whole-genome high-coverage sequence data on founder individuals (~ 30×) and very low-coverage sequence data on intercross individuals (< 0.5×). Sets of founder-line informative markers were selected for each full-sib family and used to infer the founder mosaic genotypes of the intercross individuals. The application of this approach and the quality of the estimated genome-wide genotypes are illustrated in a large F2 pedigree between two divergently selected lines of chickens. Results: We describe how we obtained whole-genome genotype data for hundreds of individuals in a cost- and time-efficient manner by using a Tn5-based library preparation protocol and an imputation algorithm that was optimized for this application. In total, 7.6 million markers segregated in this pedigree and, within each full-sib family, between 10.0 and 13.7% of these were fully informative, i.e. fixed for alternative alleles in the founders from the divergent lines, and were used for reconstruction of the offspring mosaic genotypes. The genotypes that were estimated based on the low-coverage sequence data were highly consistent (> 95% agreement) with those obtained using individual single nucleotide polymorphism (SNP) genotyping. The estimated resolution of the inferred recombination breakpoints was relatively high, with 50% of them being defined on regions shorter than 10 kb. Conclusions: A method and software for inferring founder mosaic genotypes in intercross offspring from low-coverage whole-genome sequencing in pedigrees from heterozygous founders are described. They provide high-quality, high-resolution genotypes in a time- and cost-efficient manner. The software is freely available at https://github.com/CarlborgGenomics/Stripes.",
                "authors": [
                    {
                        "name": "Zan Y."
                    },
                    {
                        "name": "Payen T."
                    },
                    {
                        "name": "Lillie M."
                    },
                    {
                        "name": "Honaker C.F."
                    },
                    {
                        "name": "Siegel P.B."
                    },
                    {
                        "name": "Carlborg O."
                    }
                ],
                "citationCount": 1,
                "date": "2019-08-14T00:00:00Z",
                "journal": "Genetics Selection Evolution",
                "title": "Genotyping by low-coverage whole-genome sequencing in intercross pedigrees from outbred founders: A cost-efficient approach"
            },
            "pmcid": "PMC6694510",
            "pmid": "31412777"
        }
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ]
}