{
    "additionDate": "2022-12-20T08:42:27.891161Z",
    "biotoolsCURIE": "biotools:aiscea",
    "biotoolsID": "aiscea",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "yijwang@iu.edu",
            "name": "Yijie Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "AIscEA (Alignment-based Integration of single-cell gene Expression and chromatin Accessibility) a computational method that integrates single-cell gene expression and chromatin accessibility measurements using their biological consistency.",
    "download": [
        {
            "type": "Other",
            "url": "https://figshare.com/articles/software/AIscEA_zip/21291135"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Global alignment",
                    "uri": "http://edamontology.org/operation_0496"
                }
            ]
        }
    ],
    "homepage": "https://github.com/elhaam/AIscEA",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-12-20T08:42:27.894493Z",
    "license": "CC-BY-4.0",
    "name": "AIscEA",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAC683",
            "metadata": {
                "abstract": "© The Author(s) 2022. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.MOTIVATION: The integrative analysis of single-cell gene expression and chromatin accessibility measurements is essential for revealing gene regulation, but it is one of the key challenges in computational biology. Gene expression and chromatin accessibility are measurements from different modalities, and no common features can be directly used to guide integration. Current state-of-the-art methods lack practical solutions for finding heterogeneous clusters. However, previous methods might not generate reliable results when cluster heterogeneity exists. More importantly, current methods lack an effective way to select hyper-parameters under an unsupervised setting. Therefore, applying computational methods to integrate single-cell gene expression and chromatin accessibility measurements remains difficult. RESULTS: We introduce AIscEA-Alignment-based Integration of single-cell gene Expression and chromatin Accessibility-a computational method that integrates single-cell gene expression and chromatin accessibility measurements using their biological consistency. AIscEA first defines a ranked similarity score to quantify the biological consistency between cell clusters across measurements. AIscEA then uses the ranked similarity score and a novel permutation test to identify cluster alignment across measurements. AIscEA further utilizes graph alignment for the aligned cell clusters to align the cells across measurements. We compared AIscEA with the competing methods on several benchmark datasets and demonstrated that AIscEA is highly robust to the choice of hyper-parameters and can better handle the cluster heterogeneity problem. Furthermore, AIscEA significantly outperforms the state-of-the-art methods when integrating real-world SNARE-seq and scMultiome-seq datasets in terms of integration accuracy. AVAILABILITY AND IMPLEMENTATION: AIscEA is available at https://figshare.com/articles/software/AIscEA_zip/21291135 on FigShare as well as {https://github.com/elhaam/AIscEA} onGitHub. SUPPLEMENTARY INFORMATION: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Huang K."
                    },
                    {
                        "name": "Jafari E."
                    },
                    {
                        "name": "Johnson T."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Wang Y."
                    }
                ],
                "date": "2022-11-30T00:00:00Z",
                "journal": "Bioinformatics (Oxford, England)",
                "title": "AIscEA: unsupervised integration of single-cell gene expression and chromatin accessibility via their biological consistency"
            },
            "pmid": "36250795"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Chromosome conformation capture",
            "uri": "http://edamontology.org/topic_3940"
        },
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
