{
    "additionDate": "2020-01-14T19:30:00Z",
    "biotoolsCURIE": "biotools:Venn-diaNet",
    "biotoolsID": "Venn-diaNet",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "sunkim.bioinfo@snu.ac.kr",
            "name": "Sun Kim",
            "typeEntity": "Person"
        }
    ],
    "description": "venn diagram based network propagation analysis framework for comparing multiple biological experiments.\n\nBenjamin Hur, Dongwon Kang, Sangseon Lee, Ji Hwan Moon, Gung Lee and Sun Kim.\n\nHandles I/O between front-end & back-end.\n\nCurrently, Venn-diaNet uses String DB",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                }
            ]
        }
    ],
    "homepage": "http://biohealth.snu.ac.kr/software/venndianet",
    "language": [
        "JavaScript",
        "Python"
    ],
    "lastUpdate": "2021-01-02T14:52:36Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/hurben/VenndiaNet"
        }
    ],
    "name": "Venn-diaNet",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3302-7",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: The main research topic in this paper is how to compare multiple biological experiments using transcriptome data, where each experiment is measured and designed to compare control and treated samples. Comparison of multiple biological experiments is usually performed in terms of the number of DEGs in an arbitrary combination of biological experiments. This process is usually facilitated with Venn diagram but there are several issues when Venn diagram is used to compare and analyze multiple experiments in terms of DEGs. First, current Venn diagram tools do not provide systematic analysis to prioritize genes. Because that current tools generally do not fully focus to prioritize genes, genes that are located in the segments in the Venn diagram (especially, intersection) is usually difficult to rank. Second, elucidating the phenotypic difference only with the lists of DEGs and expression values is challenging when the experimental designs have the combination of treatments. Experiment designs that aim to find the synergistic effect of the combination of treatments are very difficult to find without an informative system. Results: We introduce Venn-diaNet, a Venn diagram based analysis framework that uses network propagation upon protein-protein interaction network to prioritizes genes from experiments that have multiple DEG lists. We suggest that the two issues can be effectively handled by ranking or prioritizing genes with segments of a Venn diagram. The user can easily compare multiple DEG lists with gene rankings, which is easy to understand and also can be coupled with additional analysis for their purposes. Our system provides a web-based interface to select seed genes in any of areas in a Venn diagram and then perform network propagation analysis to measure the influence of the selected seed genes in terms of ranked list of DEGs. Conclusions: We suggest that our system can logically guide to select seed genes without additional prior knowledge that makes us free from the seed selection of network propagation issues. We showed that Venn-diaNet can reproduce the research findings reported in the original papers that have experiments that compare two, three and eight experiments. Venn-diaNet is freely available at: http://biohealth.snu.ac.kr/software/venndianet.",
                "authors": [
                    {
                        "name": "Hur B."
                    },
                    {
                        "name": "Kang D."
                    },
                    {
                        "name": "Kim S."
                    },
                    {
                        "name": "Lee G."
                    },
                    {
                        "name": "Lee S."
                    },
                    {
                        "name": "Moon J.H."
                    }
                ],
                "citationCount": 5,
                "date": "2019-12-27T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Venn-diaNet: Venn diagram based network propagation analysis framework for comparing multiple biological experiments"
            },
            "pmcid": "PMC6941187",
            "pmid": "31881980"
        }
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
