
{
    "credit": [
        {
            "email": "miRNAkey@gmail.com",
            "name": "miRNAKey Support",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://ibis.tau.ac.il/miRNAkey/man.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "microRNA detection",
                    "uri": "http://edamontology.org/operation_0463"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java",
            "Perl"
        ],
        "maturity": "Legacy",
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Workbench"
        ],
        "topic": [
            {
                "term": "Functional, regulatory and non-coding RNA",
                "uri": "http://edamontology.org/topic_0659"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Motivation: MicroRNAs (miRNAs) are short abundant non-coding RNAs critical for many cellular processes. Deep sequencing (next-generation sequencing) technologies are being readily used to receive a more accurate depiction of miRNA expression profiles in living cells. This type of analysis is a key step towards improving our understanding of the complexity and mode of miRNA regulation.Results: miRNAkey is a software package designed to be used as a base-station for the analysis of miRNA deep sequencing data. The package implements common steps taken in the analysis of such data, as well as adds unique features, such as data statistics and multiple read determination, generating a novel platform for the analysis of miRNA expression. A user-friendly graphical interface is applied to determine the analysis steps. The tabular and graphical output contains general and detailed reports on the sequence reads and provides an accurate picture of the differentially expressed miRNAs in paired samples. © The Author 2010. Published by Oxford University Press. All rights reserved.",
            "authors": [
                "Ronen R.",
                "Gan I.",
                "Modai S.",
                "Sukacheov A.",
                "Dror G.",
                "Halperin E.",
                "Shomron N."
            ],
            "cit_count": 61,
            "journal": "Bioinformatics",
            "pmid": "20801911",
            "title": "miRNAkey: A software for microRNA deep sequencing analysis",
            "year": "2010-08-27"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:mirnakey",
        "biotoolsID": "mirnakey",
        "description": "A software pipeline for the analysis of microRNA Deep Sequencing data",
        "homepage": "http://ibis.tau.ac.il/miRNAkey",
        "name": "MiRNAkey"
    }
}