{
    "additionDate": "2018-05-21T19:14:33Z",
    "biotoolsCURIE": "biotools:svapls",
    "biotoolsID": "svapls",
    "credit": [
        {
            "email": "statistuta@gmail.com",
            "name": "Sutirtha Chakraborty",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Accurate identification of genes that are truly differentially expressed over two sample\nvarieties, after adjusting for hidden subject-specific effects of residual heterogeneity.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://cran.r-project.org/web/packages/svapls/svapls.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/svapls/index.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "svapls",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1186/1471-2105-14-236",
            "metadata": {
                "abstract": "Background: Hidden variability is a fundamentally important issue in the context of gene expression studies. Collected tissue samples may have a wide variety of hidden effects that may alter their transcriptional landscape significantly. As a result their actual differential expression pattern can be potentially distorted, leading to inaccurate results from a genome-wide testing for the important transcripts.Results: We present an R package svapls that can be used to identify several types of unknown sample-specific sources of heterogeneity in a gene expression study and adjust for them in order to provide a more accurate inference on the original expression pattern of the genes over different varieties of samples. The proposed method implements Partial Least Squares regression to extract the hidden signals of sample-specific heterogeneity in the data and uses them to find the genes that are actually correlated with the phenotype of interest. We also compare our package with three other popular softwares for testing differential gene expression along with a detailed illustration on the widely popular Golub dataset. Results from the sensitivity analyes on simulated data with widely different hidden variation patterns reveal the improved detection power of our R package compared to the other softwares along with reasonably smaller error rates. Application on the real-life dataset exhibits the efficacy of the R package in detecting potential batch effects from the dataset.Conclusions: Overall, Our R package provides the user with a simplified framework for analyzing gene expression data with a wide range of hidden variation patterns and delivering a differential gene expression analysis with substantially improved power and accuracy.The R package svapls is freely available at http://cran.r-project.org/web/packages/svapls/index.html. © 2013 Chakraborty et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Chakraborty S."
                    },
                    {
                        "name": "Datta S."
                    },
                    {
                        "name": "Datta S."
                    }
                ],
                "citationCount": 2,
                "date": "2013-07-24T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "svapls: An R package to correct for hidden factors of variability in gene expression studies"
            },
            "pmcid": "PMC3733742",
            "pmid": "23883280",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}