{
    "additionDate": "2018-05-22T19:41:59Z",
    "biotoolsCURIE": "biotools:codp",
    "biotoolsID": "codp",
    "credit": [
        {
            "email": "yura.kei@ocha.ac.jp",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Predicting the impact of unclassified genetic variants in MSH6 by the combination of different properties of the protein.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein modelling (mutation)",
                    "uri": "http://edamontology.org/operation_0331"
                }
            ]
        }
    ],
    "homepage": "http://cib.cf.ocha.ac.jp/CoDP/",
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "CoDP",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/1423-0127-20-25",
            "metadata": {
                "abstract": "Background: Lynch syndrome is a hereditary cancer predisposition syndrome caused by a mutation in one of the DNA mismatch repair (MMR) genes. About 24% of the mutations identified in Lynch syndrome are missense substitutions and the frequency of missense variants in MSH6 is the highest amongst these MMR genes. Because of this high frequency, the genetic testing was not effectively used in MSH6 so far. We, therefore, developed CoDP (Combination of the Different Properties), a bioinformatics tool to predict the impact of missense variants in MSH6. Methods. We integrated the prediction results of three methods, namely MAPP, PolyPhen-2 and SIFT. Two other structural properties, namely solvent accessibility and the change in the number of heavy atoms of amino acids in the MSH6 protein, were further combined explicitly. MSH6 germline missense variants classified by their associated clinical and molecular data were used to fit the parameters for the logistic regression model and to assess the prediction. The performance of CoDP was compared with those of other conventional tools, namely MAPP, SIFT, PolyPhen-2 and PON-MMR. Results: A total of 294 germline missense variants were collected from the variant databases and literature. Of them, 34 variants were available for the parameter training and the prediction performance test. We integrated the prediction results of MAPP, PolyPhen-2 and SIFT, and two other structural properties, namely solvent accessibility and the change in the number of heavy atoms of amino acids in the MSH6 protein, were further combined explicitly. Variants data classified by their associated clinical and molecular data were used to fit the parameters for the logistic regression model and to assess the prediction. The values of the positive predictive value (PPV), the negative predictive value (NPV), sensitivity, specificity and accuracy of the tools were compared on the whole data set. PPV of CoDP was 93.3% (14/15), NPV was 94.7% (18/19), specificity was 94.7% (18/19), sensitivity was 93.3% (14/15) and accuracy was 94.1% (32/34). Area under the curve of CoDP was 0.954, that of MAPP for MSH6 was 0.919, of SIFT was 0.864 and of PolyPhen-2 HumVar was 0.819. The power to distinguish between pathogenic and non-pathogenic variants of these methods was tested by Wilcoxon rank sum test (p < 8.9 × 10&-6 for CoDP, p < 3.3 × 10&-5 for MAPP, p < 3.1 × 10&-4 for SIFT and p < 1.2 × 10&-3 for PolyPhen-2 HumVar), and CoDP was shown to outperform other conventional methods. Conclusion: In this paper, we provide a human curated data set for MSH6 missense variants, and CoDP, the prediction tool, which achieved better accuracy for predicting the impact of missense variants in MSH6 than any other known tools. CoDP is available at. © 2013 Terui et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Akagi K."
                    },
                    {
                        "name": "Kawame H."
                    },
                    {
                        "name": "Terui H."
                    },
                    {
                        "name": "Yura K."
                    }
                ],
                "citationCount": 10,
                "date": "2013-04-30T00:00:00Z",
                "journal": "Journal of Biomedical Science",
                "title": "CoDP: Predicting the impact of unclassified genetic variants in MSH6 by the combination of different properties of the protein"
            },
            "pmcid": "PMC3651391",
            "pmid": "23621914"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ],
    "validated": 1
}
