{
    "additionDate": "2017-01-13T13:16:33Z",
    "biotoolsCURIE": "biotools:snver",
    "biotoolsID": "snver",
    "credit": [
        {
            "email": "ww42@njit.edu",
            "name": "Wei Wang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Tool for variant calling in pooled or individual sequence data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://snver.sourceforge.net/manual.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "http://snver.sourceforge.net/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:54Z",
    "name": "SNVer",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "metadata": {
                "abstract": "We develop a statistical tool SNVer for calling common and rare variants in analysis of pooled or individual next-generation sequencing (NGS) data. We formulate variant calling as a hypothesis testing problem and employ a binomial-binomial model to test the significance of observed allele frequency against sequencing error. SNVer reports one single overall P-value for evaluating the significance of a candidate locus being a variant based on which multiplicity control can be obtained. This is particularly desirable because tens of thousands loci are simultaneously examined in typical NGS experiments. Each user can choose the false-positive error rate threshold he or she considers appropriate, instead of just the dichotomous decisions of whether to 'accept or reject the candidates' provided by most existing methods. We use both simulated data and real data to demonstrate the superior performance of our program in comparison with existing methods. SNVer runs very fast and can complete testing 300 K loci within an hour. This excellent scalability makes it feasible for analysis of whole-exome sequencing data, or even whole-genome sequencing data using high performance computing cluster. SNVer is freely available at http://snver.sourceforge.net/. © The Author(s) 2011. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Hakonarson H."
                    },
                    {
                        "name": "Hu P."
                    },
                    {
                        "name": "Lyon G.J."
                    },
                    {
                        "name": "Wang W."
                    },
                    {
                        "name": "Wei Z."
                    }
                ],
                "citationCount": 168,
                "date": "2011-10-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "SNVer: A statistical tool for variant calling in analysis of pooled or individual next-generation sequencing data"
            },
            "pmid": "21813454"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        }
    ],
    "validated": 1
}
