{
    "accessibility": "Open access",
    "additionDate": "2022-07-26T22:38:16.356160Z",
    "biotoolsCURIE": "biotools:mhcroberta",
    "biotoolsID": "mhcroberta",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "huyang@hit.edu.cn",
            "name": "Yang Hu",
            "orcidid": "https://orcid.org/0000-0002-4508-5365"
        },
        {
            "name": "Tianyi Zang"
        },
        {
            "name": "Xinjun Zhang"
        },
        {
            "name": "Shizheng Qiu",
            "orcidid": "https://orcid.org/0000-0002-0047-4199"
        }
    ],
    "description": "Pan-specific peptide-MHC class I binding prediction through transfer learning with label-agnostic protein sequences.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Epitope mapping",
                    "uri": "http://edamontology.org/operation_0416"
                },
                {
                    "term": "Peptide immunogenicity prediction",
                    "uri": "http://edamontology.org/operation_0252"
                }
            ]
        }
    ],
    "homepage": "https://github.com/FuxuWang/MHCRoBERTa",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2024-11-24T15:52:00.764791Z",
    "license": "Not licensed",
    "name": "MHCRoBERTa",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/bib/bbab595",
            "metadata": {
                "abstract": "Predicting the binding of peptide and major histocompatibility complex (MHC) plays a vital role in immunotherapy for cancer. The success of Alphafold of applying natural language processing (NLP) algorithms in protein secondary struction prediction has inspired us to explore the possibility of NLP methods in predicting peptide–MHC class I binding. Based on the above motivations, we propose the MHCRoBERTa method, RoBERTa pre-training approach, for predicting the binding affinity between type I MHC and peptides. Analysis of the results on benchmark dataset demonstrates that MHCRoBERTa can outperform other state-of-art prediction methods with an increase of the Spearman rank correlation coefficient (SRCC) value. Notably, our model gave a significant improvement on IC50 value. Our method has achieved SRCC value and AUC value as 0.785 and 0.817, respectively. Our SRCC value is 14.3% higher than NetMHCpan3.0 (the second highest SRCC value on pan-specific) and is 3% higher than MHCf lurry (the second highest SRCC value on all methods). The AUC value is also better than any other pan-specific methods. Moreover, we visualize the multi-head self-attention for the token representation across the layers and heads by this method. Through the analysis of the representation of each layer and head, we can show whether the model has learned the syntax and semantics necessary to perform the prediction task well. All these results demonstrate that our model can accurately predict the peptide–MHC class I binding affinity and that MHCRoBERTa is a powerful tool for screening potential neoantigens for cancer immunotherapy. MHCRoBERTa is available as an open source software at github (https://github.com/FuxuWang/MHCRoBERTa).",
                "authors": [
                    {
                        "name": "Hu Y."
                    },
                    {
                        "name": "Lu H."
                    },
                    {
                        "name": "Qiu S."
                    },
                    {
                        "name": "Wang F."
                    },
                    {
                        "name": "Wang H."
                    },
                    {
                        "name": "Wang L."
                    },
                    {
                        "name": "Zang T."
                    },
                    {
                        "name": "Zhang X."
                    }
                ],
                "citationCount": 11,
                "date": "2022-05-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "MHCRoBERTa: pan-specific peptide–MHC class I binding prediction through transfer learning with label-agnostic protein sequences"
            },
            "pmid": "35443027"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
