{
    "additionDate": "2021-01-18T11:30:39Z",
    "biotoolsCURIE": "biotools:tobrfv",
    "biotoolsID": "tobrfv",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "b.t.l.h.vandevossenberg@nvwa.nl",
            "name": "Bart T. L. H. van de Vossenberg",
            "orcidid": "https://orcid.org/0000-0003-1205-6119",
            "typeEntity": "Person"
        }
    ],
    "description": "Real-time tracking of Tomato brown rugose fruit virus (ToBRFV) outbreaks in the Netherlands using Nextstrain.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Phylogenetic analysis",
                    "uri": "http://edamontology.org/operation_0324"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://nextstrain.nrcnvwa.nl/ToBRFV/20191231",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-01T09:15:58Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/NPPO-NL/nextstrain-ToBRFV"
        }
    ],
    "name": "ToBRFV",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0234671",
            "metadata": {
                "abstract": "Copyright: © 2020 van de Vossenberg et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Tomato brown rugose fruit virus (ToBRFV) is a Tobamovirus that was first observed in 2014 and 2015 on tomato plants in Israel and Jordan respectively. Since the first description, the virus has been reported from all continents except Oceania and Antarctica, and has been found infecting both tomato and pepper crops. In October 2019, the Dutch National Plant Protection Organization received a ToBRFV infected tomato sample as part of a generic survey targeting tomato pests. Presence of the virus was verified using Illumina sequencing. A follow-up survey was initiated to determine the extent of ToBRFV presence in the Dutch tomato horticulture and identify possible linkages between ToBRFV genotypes, companies and epidemiological traits. Nextstrain was used to visualize these potential connections. By November 2019, 68 companies had been visited of which 17 companies were found to be infected. The 50 ToBRFV genomes from these outbreak locations group in three main clusters, which are hypothesized to represent three original sources. No correlation was found between genotypes, companies and epidemiological traits, and the source(s) of the Dutch ToBRFV outbreak remain unknown. This paper describes a Nextstrain build containing ToBRFV genomes up to and including November 2019. Sharing data with this interactive online tool will enable the plant virology field to better understand and communicate the diversity and spread of this new virus. Organizations are invited to share data or materials for inclusion in the Nextstrain build, which can be accessed at https://nextstrain.nrcnvwa.nl/ToBRFV/20191231.",
                "authors": [
                    {
                        "name": "van de Vossenberg B.T.L.H."
                    },
                    {
                        "name": "Visser M."
                    },
                    {
                        "name": "Bruinsma M."
                    },
                    {
                        "name": "Koenraadt H.M.S."
                    },
                    {
                        "name": "Westenberg M."
                    },
                    {
                        "name": "Botermans M."
                    }
                ],
                "citationCount": 4,
                "date": "2020-10-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Real-time tracking of Tomato brown rugose fruit virus (ToBRFV) outbreaks in the Netherlands using Nextstrain"
            },
            "pmcid": "PMC7544112",
            "pmid": "33031371"
        }
    ],
    "topic": [
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}