{
    "additionDate": "2020-01-14T19:49:06Z",
    "biotoolsCURIE": "biotools:ASD-DiagNet",
    "biotoolsID": "ASD-DiagNet",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "fsaeed@fiu.edu",
            "name": "Fahad Saeed",
            "typeEntity": "Person"
        }
    ],
    "description": "A Hybrid Learning Approach for Detection of Autism Spectrum Disorder Using fMRI Data.\n\nThis repository contains the implementation of ASD-DiagNet algorithm",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "https://github.com/pcdslab/ASD-DiagNet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-02T15:14:48.002200Z",
    "license": "GPL-3.0",
    "name": "ASD-DiagNet",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FNINF.2019.00070",
            "metadata": {
                "abstract": "© Copyright © 2019 Eslami, Mirjalili, Fong, Laird and Saeed.Heterogeneous mental disorders such as Autism Spectrum Disorder (ASD) are notoriously difficult to diagnose, especially in children. The current psychiatric diagnostic process is based purely on the behavioral observation of symptomology (DSM-5/ICD-10) and may be prone to misdiagnosis. In order to move the field toward more quantitative diagnosis, we need advanced and scalable machine learning infrastructure that will allow us to identify reliable biomarkers of mental health disorders. In this paper, we propose a framework called ASD-DiagNet for classifying subjects with ASD from healthy subjects by using only fMRI data. We designed and implemented a joint learning procedure using an autoencoder and a single layer perceptron (SLP) which results in improved quality of extracted features and optimized parameters for the model. Further, we designed and implemented a data augmentation strategy, based on linear interpolation on available feature vectors, that allows us to produce synthetic datasets needed for training of machine learning models. The proposed approach is evaluated on a public dataset provided by Autism Brain Imaging Data Exchange including 1, 035 subjects coming from 17 different brain imaging centers. Our machine learning model outperforms other state of the art methods from 10 imaging centers with increase in classification accuracy up to 28% with maximum accuracy of 82%. The machine learning technique presented in this paper, in addition to yielding better quality, gives enormous advantages in terms of execution time (40 min vs. 7 h on other methods). The implemented code is available as GPL license on GitHub portal of our lab (https://github.com/pcdslab/ASD-DiagNet).",
                "authors": [
                    {
                        "name": "Eslami T."
                    },
                    {
                        "name": "Mirjalili V."
                    },
                    {
                        "name": "Fong A."
                    },
                    {
                        "name": "Laird A.R."
                    },
                    {
                        "name": "Saeed F."
                    }
                ],
                "citationCount": 9,
                "date": "2019-11-27T00:00:00Z",
                "journal": "Frontiers in Neuroinformatics",
                "title": "ASD-DiagNet: A Hybrid Learning Approach for Detection of Autism Spectrum Disorder Using fMRI Data"
            },
            "pmcid": "PMC6890833",
            "pmid": "31827430"
        }
    ],
    "topic": [
        {
            "term": "Psychiatry",
            "uri": "http://edamontology.org/topic_3419"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        }
    ]
}