{
    "additionDate": "2020-01-14T09:34:52Z",
    "biotoolsCURIE": "biotools:PQStat",
    "biotoolsID": "PQStat",
    "confidence_flag": "tool",
    "description": "PQStat is an application which enables users to carry out a statistical data analysis in a simple and accurate way.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Statistical inference",
                    "uri": "http://edamontology.org/operation_3658"
                }
            ]
        }
    ],
    "homepage": "http://www.pqstat.pl/en",
    "lastUpdate": "2021-01-13T17:15:06Z",
    "name": "PQStat",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.4081/GH.2019.791",
            "metadata": {
                "abstract": "© the Author(s), 2019 Licensee PAGEPress, Italy.Both epidemiology and health care planning require analytical tools, especially for cluster detection in cases with unusually high rates of disease incidence. The aim of this work was to extend the application of the CutL method, which is used for detecting spatial clusters of any shape, to detecting space-time clusters, and to show how the method works compared to Kulldorff’s scan statistic. In the CutL method, clusters with disease incidence rates higher than the one entered by the researcher are searched for. The way in which the space-time version of that method works is illustrated with the example of data simulating the distribution of people affected by health problems in Polish counties in the period 2013-2017. With respect to detection of irregularly shaped space-time clusters, the CutL method turned out to be more effective than Kulldorff’s scan statistic; for cylinder-shaped space-time clusters, the two methods produced similar results. The CutL method has also the important advantage of being widely accessible through the PQScut and PQStat programmes (PQStat Software Company, Poznan, Poland).",
                "authors": [
                    {
                        "name": "Gorna I."
                    },
                    {
                        "name": "Pruciak A."
                    },
                    {
                        "name": "Stawinska-Witoszynska B."
                    },
                    {
                        "name": "Trojanowski M."
                    },
                    {
                        "name": "Wieckowska B."
                    }
                ],
                "date": "2019-11-12T00:00:00Z",
                "journal": "Geospatial Health",
                "title": "Searching for space-time clusters: The cutl method compared to kulldorff’s scan statistic"
            },
            "pmid": "31724381"
        }
    ],
    "topic": [
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
