{
    "additionDate": "2017-08-03T19:06:59Z",
    "biotoolsCURIE": "biotools:mir2gene",
    "biotoolsID": "mir2gene",
    "credit": [
        {
            "email": "cuiqinghua@hsc.pku.edu.cn",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.cuilab.cn/"
        }
    ],
    "description": "For gene pattern discovery by enrichment analysis of their microRNA regulators is a web-accessible program, which is used to mine potential patterns for one single gene, multiple genes, and KEGG pathway genes based on miRNA set enrichment analysis of the miRNAs regulating given genes.",
    "documentation": [
        {
            "type": "User manual",
            "url": "http://www.cuilab.cn/mir2gene"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                }
            ]
        }
    ],
    "homepage": "http://www.cuilab.cn/mir2gene",
    "lastUpdate": "2018-12-10T12:58:46Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/mir2gene-201107-gene-pattern-discovery-by-enrichment-analysis-of-their-microrna-regulators.html"
        }
    ],
    "name": "miR2Gene",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: In recent years, a number of tools have been developed to explore microRNAs (miRNAs) by analyzing their target genes. However, a reverse problem, that is, inferring patterns of protein-coding genes through their miRNA regulators, has not been explored. As various miRNA annotation data become available, exploring gene patterns by analyzing the prior knowledge of their miRNA regulators is becoming more feasible.Results: In this study, we developed a tool, miR2Gene, for this purpose. Various sets of miRNAs, according to prior rules such as function, associated disease, tissue specificity, family, and cluster, were integrated with miR2Gene. For given genes, miR2Gene evaluates the enrichment of the predicted miRNAs that regulate them in each miRNA set. This tool can be used for single genes, multiple genes, and KEGG pathways. For the KEGG pathway, genes with enriched miRNA sets are highlighted according to various rules. We confirmed the usefulness of miR2Gene through case studies.Conclusions: miR2Gene represents a novel and useful tool that integrates miRNA knowledge for protein-coding gene analysis. miR2Gene is freely available at http://cmbi.hsc.pku.edu.cn/mir2gene. © 2011 Qiu et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Qiu C."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Cui Q."
                    }
                ],
                "citationCount": 7,
                "date": "2011-12-14T00:00:00Z",
                "journal": "BMC Systems Biology",
                "title": "MiR2Gene: pattern discovery of single gene, multiple genes, and pathways by enrichment analysis of their microRNA regulators"
            },
            "pmid": "22784580"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1
}