{
    "additionDate": "2021-01-18T09:41:15Z",
    "biotoolsCURIE": "biotools:gloxinia",
    "biotoolsID": "gloxinia",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "olivier.pieters@ugent.be",
            "name": "Olivier Pieters",
            "orcidid": "https://orcid.org/0000-0002-5473-4849",
            "typeEntity": "Person"
        }
    ],
    "description": "Open-Source Sensing Platform to Monitor the Dynamic Responses of Plants.\n\nOpen-source release of code and PCB-design files of the Gloxinia platform.\n\nIf you use this code for a scientific publication, please consider citing our paper Gloxinia—An Open-Source Sensing Platform to Monitor the Dynamic Responses of Plants.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://github.com/opieters/gloxinia",
    "language": [
        "C"
    ],
    "lastUpdate": "2021-01-23T10:15:33Z",
    "license": "GPL-3.0",
    "name": "Gloxinia",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.3390/S20113055",
            "metadata": {
                "abstract": "© 2020 by the authors. Licensee MDPI, Basel, Switzerland.The study of the dynamic responses of plants to short-term environmental changes is becoming increasingly important in basic plant science, phenotyping, breeding, crop management, and modelling. These short-term variations are crucial in plant adaptation to new environments and, consequently, in plant fitness and productivity. Scalable, versatile, accurate, and low-cost data-logging solutions are necessary to advance these fields and complement existing sensing platforms such as high-throughput phenotyping. However, current data logging and sensing platforms do not meet the requirements to monitor these responses. Therefore, a new modular data logging platform was designed, named Gloxinia. Different sensor boards are interconnected depending upon the needs, with the potential to scale to hundreds of sensors in a distributed sensor system. To demonstrate the architecture, two sensor boards were designed—one for single-ended measurements and one for lock-in amplifier based measurements, named Sylvatica and Planalta, respectively. To evaluate the performance of the system in small setups, a small-scale trial was conducted in a growth chamber. Expected plant dynamics were successfully captured, indicating proper operation of the system. Though a large scale trial was not performed, we expect the system to scale very well to larger setups. Additionally, the platform is open-source, enabling other users to easily build upon our work and perform application-specific optimisations.",
                "authors": [
                    {
                        "name": "Pieters O."
                    },
                    {
                        "name": "De Swaef T."
                    },
                    {
                        "name": "Lootens P."
                    },
                    {
                        "name": "Stock M."
                    },
                    {
                        "name": "Roldan-Ruiz I."
                    },
                    {
                        "name": "Wyffels F."
                    }
                ],
                "date": "2020-06-01T00:00:00Z",
                "journal": "Sensors (Switzerland)",
                "title": "Gloxinia—An open-source sensing platform to monitor the dynamic responses of plants"
            },
            "pmcid": "PMC7309107",
            "pmid": "32481619"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Data acquisition",
            "uri": "http://edamontology.org/topic_3077"
        }
    ],
    "validated": 1
}