{
    "additionDate": "2020-01-09T18:32:11Z",
    "biotoolsCURIE": "biotools:trial_designed",
    "biotoolsID": "trial_designed",
    "confidence_flag": "tool",
    "description": "A utility-based Bayesian optimal interval (U-BOIN) phase I/II design to identify the optimal biological dose for targeted and immune therapies.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "http://www.trialdesign.org",
    "lastUpdate": "2021-01-16T17:26:53Z",
    "name": "trial designed",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/SIM.8361",
            "metadata": {
                "abstract": "© 2019 John Wiley & Sons, Ltd.In the era of targeted therapy and immunotherapy, the objective of dose finding is often to identify the optimal biological dose (OBD), rather than the maximum tolerated dose. We develop a utility-based Bayesian optimal interval (U-BOIN) phase I/II design to find the OBD. We jointly model toxicity and efficacy using a multinomial-Dirichlet model, and employ a utility function to measure dose risk-benefit trade-off. The U-BOIN design consists of two seamless stages. In stage I, the Bayesian optimal interval design is used to quickly explore the dose space and collect preliminary toxicity and efficacy data. In stage II, we continuously update the posterior estimate of the utility for each dose after each cohort, using accumulating efficacy and toxicity from both stages I and II, and then use the posterior estimate to direct the dose assignment and selection. Compared to existing phase I/II designs, one prominent advantage of the U-BOIN design is its simplicity for implementation. Once the trial is designed, it can be easily applied using predetermined decision tables, without complex model fitting and estimation. Our simulation study shows that, despite its simplicity, the U-BOIN design is robust and has high accuracy to identify the OBD. We extend the design to accommodate delayed efficacy by leveraging the short-term endpoint (eg, immune activity or other biological activity of targeted agents), and using it to predict the delayed efficacy outcome to facilitate real-time decision making. A user-friendly software to implement the U-BOIN is freely available at www.trialdesign.org.",
                "authors": [
                    {
                        "name": "Zhou Y."
                    },
                    {
                        "name": "Lee J.J."
                    },
                    {
                        "name": "Yuan Y."
                    }
                ],
                "citationCount": 7,
                "date": "2019-12-10T00:00:00Z",
                "journal": "Statistics in Medicine",
                "title": "A utility-based Bayesian optimal interval (U-BOIN) phase I/II design to identify the optimal biological dose for targeted and immune therapies"
            },
            "pmid": "31621952"
        }
    ],
    "topic": [
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Safety sciences",
            "uri": "http://edamontology.org/topic_3377"
        }
    ],
    "validated": 1
}