{
    "additionDate": "2024-01-12T10:37:32.037628Z",
    "biotoolsCURIE": "biotools:ntpred",
    "biotoolsID": "ntpred",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "muhammad_nabeel.asim@dfki.de",
            "name": "Muhammad Nabeel Asim",
            "typeEntity": "Person"
        }
    ],
    "description": "Robust and precise machine learning framework for in silico identification of Tyrosine nitration sites in protein sequences.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "PTM identification",
                    "uri": "http://edamontology.org/operation_3645"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                }
            ]
        }
    ],
    "homepage": "http://opendfki.de/PredNTS/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:21:42.590031Z",
    "name": "NTpred",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bfgp/elad018",
            "metadata": {
                "abstract": "Post-translational modifications (PTMs) either enhance a protein’s activity in various sub-cellular processes, or degrade their activity which leads toward failure of intracellular processes. Tyrosine nitration (NT) modification degrades protein’s activity that initiates and propagates various diseases including neurodegenerative, cardiovascular, autoimmune diseases and carcinogenesis. Identification of NT modification supports development of novel therapies and drug discoveries for associated diseases. Identification of NT modification in biochemical labs is expensive, time consuming and error-prone. To supplement this process, several computational approaches have been proposed. However these approaches fail to precisely identify NT modification, due to the extraction of irrelevant, redundant and less discriminative features from protein sequences. This paper presents the NTpred framework that is competent in extracting comprehensive features from raw protein sequences using four different sequence encoders. To reap the benefits of different encoders, it generates four additional feature spaces by fusing different combinations of individual encodings. Furthermore, it eradicates irrelevant and redundant features from eight different feature spaces through a Recursive Feature Elimination process. Selected features of four individual encodings and four feature fusion vectors are used to train eight different Gradient Boosted Tree classifiers. The probability scores from the trained classifiers are utilized to generate a new probabilistic feature space, which is used to train a Logistic Regression classifier. On the BD1 benchmark dataset, the proposed framework outperforms the existing best-performing predictor in 5-fold cross validation and independent test evaluation with combined improvement of 13.7% in MCC and 20.1% in AUC. Similarly, on the BD2 benchmark dataset, the proposed framework outperforms the existing best-performing predictor with combined improvement of 5.3% in MCC and 1.0% in AUC. NTpred is publicly available for further experimentation and predictive use at: https:// sds_genetic_analysis.opendfki.de/PredNTS/.",
                "authors": [
                    {
                        "name": "Ahmed S."
                    },
                    {
                        "name": "Asim M.N."
                    },
                    {
                        "name": "Datta S."
                    },
                    {
                        "name": "Dengel A."
                    }
                ],
                "date": "2024-03-01T00:00:00Z",
                "journal": "Briefings in Functional Genomics",
                "title": "NTpred: a robust and precise machine learning framework for in silico identification of Tyrosine nitration sites in protein sequences"
            },
            "pmid": "37248673"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ]
}
