
{
    "credit": [
    ],
    "documentation": [
        {
            "url": "http://www.fluortools.com/software/ae/documentation/tools/FRET"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "labels": {
        "topic": [
            {
                "term": "NMR",
                "uri": "http://edamontology.org/topic_0593"
            },
            {
                "term": "Electron microscopy",
                "uri": "http://edamontology.org/topic_0611"
            },
            {
                "term": "Small molecules",
                "uri": "http://edamontology.org/topic_0154"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019, Springer Nature America, Inc.The applications of Förster resonance energy transfer (FRET) grow with each year. However, different FRET techniques are not applied consistently, nor are results uniformly presented, which makes implementing and reproducing FRET experiments challenging. We discuss important considerations for designing and evaluating ensemble FRET experiments. Alongside a primer on FRET basics, we provide guidelines for making experimental design choices such as the donor-acceptor pair, instrumentation and labeling chemistries; selecting control experiments to unambiguously demonstrate FRET and validate that the experiments provide meaningful data about the biomolecular process in question; analyzing raw data and assessing the results; and reporting data and experimental details in a manner that easily allows for reproducibility. Some considerations are also given for FRET assays and FRET imaging, especially with fluorescent proteins. Our goal is to motivate and empower all biologists to consider FRET for the powerful research tool it can be.",
            "authors": [
                "Algar W.R.",
                "Hildebrandt N.",
                "Vogel S.S.",
                "Medintz I.L."
            ],
            "cit_count": 0,
            "doi": "10.1038/S41592-019-0530-8",
            "journal": "Nature Methods",
            "pmid": "31471616",
            "title": "FRET as a biomolecular research tool — understanding its potential while avoiding pitfalls",
            "year": "2019-09-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:FRET",
        "biotoolsID": "FRET",
        "description": "> MEDIUM CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'FRET biomolecular research tool' | understanding its potential while avoiding pitfalls | Calculate Resonance Energy Transfer (FRET) Efficiencies | Addgene's collection of plasmids suitable for FRET experiments to measure protein interactions or conformation changes, as well as FRET standards | Addgene: Fluorescent Protein Guide: FRET | How to measure and calculate fluorescence resonance energy transfer (FRET) efficiency. FRET calculator. FRET measurement. FRET distance | Software > a:e - UV-Vis-IR Spectral Software > a:e Documentation Pages > a:e's Spectral Tools > | FRET, also known as Förster Resonance Energy Transfer or just Resonance Energy Transfer (RET), is a long-range non-radiative energy transfer process from an excited donor fluorophore, D, to an acceptor chromophore, A, located within a distance of approximately 1-10 nm",
        "homepage": "http://www.addgene.org/fluorescent-proteins/fret/",
        "name": "FRET"
    }
}