{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:06:53Z",
    "biotoolsCURIE": "biotools:VPAC",
    "biotoolsID": "VPAC",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ruijiang@tsinghua.edu.cn",
            "name": "Rui Jiang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Variational projection for accurate clustering of single-cell transcriptomic data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/ShengquanChen/VPAC/blob/master/README.md"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/ShengquanChen/VPAC/blob/master/vpac.py"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ShengquanChen/VPAC",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:26Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/ShengquanChen/VPAC/issues"
        }
    ],
    "maturity": "Mature",
    "name": "VPAC",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1186/S12859-019-2742-4",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Single-cell RNA-sequencing (scRNA-seq) technologies have advanced rapidly in recent years and enabled the quantitative characterization at a microscopic resolution. With the exponential growth of the number of cells profiled in individual scRNA-seq experiments, the demand for identifying putative cell types from the data has become a great challenge that appeals for novel computational methods. Although a variety of algorithms have recently been proposed for single-cell clustering, such limitations as low accuracy, inferior robustness, and inadequate stability greatly impede the scope of applications of these methods. Results: We propose a novel model-based algorithm, named VPAC, for accurate clustering of single-cell transcriptomic data through variational projection, which assumes that single-cell samples follow a Gaussian mixture distribution in a latent space. Through comprehensive validation experiments, we demonstrate that VPAC can not only be applied to datasets of discrete counts and normalized continuous data, but also scale up well to various data dimensionality, different dataset size and different data sparsity. We further illustrate the ability of VPAC to detect genes with strong unique signatures of a specific cell type, which may shed light on the studies in system biology. We have released a user-friendly python package of VPAC in Github (https://github.com/ShengquanChen/VPAC). Users can directly import our VPAC class and conduct clustering without tedious installation of dependency packages. Conclusions: VPAC enables highly accurate clustering of single-cell transcriptomic data via a statistical model. We expect to see wide applications of our method to not only transcriptome studies for fully understanding the cell identity and functionality, but also the clustering of more general data.",
                "authors": [
                    {
                        "name": "Chen S."
                    },
                    {
                        "name": "Hua K."
                    },
                    {
                        "name": "Cui H."
                    },
                    {
                        "name": "Jiang R."
                    }
                ],
                "date": "2019-05-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "VPAC: Variational projection for accurate clustering of single-cell transcriptomic data"
            },
            "pmcid": "PMC6509870",
            "pmid": "31074382",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}