{
    "accessibility": "Open access",
    "additionDate": "2024-03-22T16:29:25.628266Z",
    "biotoolsCURIE": "biotools:malbacr",
    "biotoolsID": "malbacr",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Damon T Leach",
            "typeEntity": "Person"
        },
        {
            "name": "Lisa M Bramer",
            "typeEntity": "Person"
        }
    ],
    "description": "Package for standardized implementation of batch correction methods for omics data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/pmartR/malbacR",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-03-22T16:29:25.631049Z",
    "name": "malbacR",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/ACS.ANALCHEM.3C01289",
            "metadata": {
                "abstract": "Mass spectrometry is a powerful tool for identifying and analyzing biomolecules such as metabolites and lipids in complex biological samples. Liquid chromatography and gas chromatography mass spectrometry studies quite commonly involve large numbers of samples, which can require significant time for sample preparation and analyses. To accommodate such studies, the samples are commonly split into batches. Inevitably, variations in sample handling, temperature fluctuation, imprecise timing, column degradation, and other factors result in systematic errors or biases of the measured abundances between the batches. Numerous methods are available via R packages to assist with batch correction for omics data; however, since these methods were developed by different research teams, the algorithms are available in separate R packages, each with different data input and output formats. We introduce the malbacR package, which consolidates 11 common batch effect correction methods for omics data into one place so users can easily implement and compare the following: pareto scaling, power scaling, range scaling, ComBat, EigenMS, NOMIS, RUV-random, QC-RLSC, WaveICA2.0, TIGER, and SERRF. The malbacR package standardizes data input and output formats across these batch correction methods. The package works in conjunction with the pmartR package, allowing users to seamlessly include the batch effect correction in a pmartR workflow without needing any additional data manipulation.",
                "authors": [
                    {
                        "name": "Bramer L.M."
                    },
                    {
                        "name": "Irvahn J."
                    },
                    {
                        "name": "Leach D.T."
                    },
                    {
                        "name": "Richardson R."
                    },
                    {
                        "name": "Stratton K.G."
                    },
                    {
                        "name": "Webb-Robertson B.M."
                    }
                ],
                "citationCount": 1,
                "date": "2023-08-22T00:00:00Z",
                "journal": "Analytical Chemistry",
                "title": "malbacR: A Package for Standardized Implementation of Batch Correction Methods for Omics Data"
            },
            "pmid": "37551970"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Lipids",
            "uri": "http://edamontology.org/topic_0153"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
