
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.informatics.indiana.edu/predrag"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://www.ubpred.org/help.html#usage"
        },
        {
            "type": "General",
            "url": "http://www.ubpred.org/README.txt"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein property calculation",
                    "uri": "http://edamontology.org/operation_0250"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "MATLAB"
        ],
        "operatingSystem": [
            "Linux",
            "Windows"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Protein sites, features and motifs",
                "uri": "http://edamontology.org/topic_3510"
            },
            {
                "term": "Protein structure analysis",
                "uri": "http://edamontology.org/topic_2814"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/ubpred-determine-lysine-residue-protein-ubiquitinate.html"
        }
    ],
    "publication": [
        {
            "abstract": "Ubiquitination plays an important role in many cellular processes and is implicated in many diseases. Experimental identification of ubiquitination sites is challenging due to rapid turnover of ubiquitinated proteins and the large size of the ubiquitin modifier. We identified 141 new ubiquitination sites using a combination of liquid chromatography, mass spectrometry, and mutant yeast strains. Investigation of the sequence biases and structural preferences around known ubiquitination sites indicated that their properties were similar to those of intrinsically disordered protein regions. Using a combined set of new and previously known ubiquitination sites, we developed a random forest predictor of ubiquitination sites, UbPred. The class-balanced accuracy of UbPred reached 72%, with the area under the ROC curve at 80%. The application of UbPred showed that high confidence Rsp5 ubiquitin ligase substrates and proteins with very short half-lives were significantly enriched in the number of predicted ubiquitination sites. Proteome-wide prediction of ubiquitination sites in Saccharomyces cerevisiae indicated that highly ubiquitinated substrates were prevalent among transcription/enzyme regulators and proteins involved in cell cycle control. In the human proteome, cytoskeletal, cell cycle, regulatory, and cancer-associated proteins display higher extent of ubiquitination than proteins from other functional categories. We show that gain and loss of predicted ubiquitination sites may likely represent a molecular mechanism behind a number of diseaseassociated mutations. UbPred is available at http://www.ubpred.org. © 2009 Wiley-Liss, Inc.",
            "authors": [
                "Radivojac P.",
                "Vacic V.",
                "Haynes C.",
                "Cocklin R.R.",
                "Mohan A.",
                "Heyen J.W.",
                "Goebl M.G.",
                "Iakoucheva L.M."
            ],
            "cit_count": 298,
            "doi": "10.1002/prot.22555",
            "journal": "Proteins: Structure, Function and Bioinformatics",
            "title": "Identification, analysis, and prediction of protein ubiquitination sites",
            "type": "Primary",
            "year": "2010-04-28"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:ubpred",
        "biotoolsID": "ubpred",
        "description": "Software package and web tool that probabilistically determines whether a lysine residue in a protein is ubiquitinated. It is a random forest-based predictor of potential ubiquitination sites in proteins.",
        "homepage": "http://www.ubpred.org/",
        "name": "UbPred"
    }
}