
{
    "credit": [
        {
            "email": "osprey@cs.duke.edu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.cs.duke.edu/donaldlab/index.php"
        }
    ],
    "documentation": [
        {
            "url": "http://www.cs.duke.edu/donaldlab/software/osprey/osprey.2.2/OSPREY2.2.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Design",
                    "uri": "http://edamontology.org/operation_2430"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Protein structure analysis",
                "uri": "http://edamontology.org/topic_2814"
            },
            {
                "term": "Genetic variation",
                "uri": "http://edamontology.org/topic_0199"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/osprey-1-0-computational-structure-based-protein-design.html"
        }
    ],
    "publication": [
        {
            "abstract": "Motivation: Structure-based computational protein design (SCPR) is an important topic in protein engineering. Under the assumption of a rigid backbone and a finite set of discrete conformations of side-chains, various methods have been proposed to address this problem. A popular method is to combine the dead-end elimination (DEE) and A* tree search algorithms, which provably finds the global minimum energy conformation (GMEC) solution. Results: In this article, we improve the efficiency of computing A* heuristic functions for protein design and propose a variant of A* algorithm in which the search process can be performed on a single GPU in a massively parallel fashion. In addition, we make some efforts to address the memory exceeding problem in A* search. As a result, our enhancements can achieve a significant speedup of the A*-based protein design algorithm by four orders of magnitude on large-scale test data through pre-computation and parallelization, while still maintaining an acceptable memory overhead. We also show that our parallel A* search algorithm could be successfully combined with iMinDEE, a state-of-the-art DEE criterion, for rotamer pruning to further improve SCPR with the consideration of continuous side-chain flexibility. © 2014 The Author. Published by Oxford University Press. All rights reserved.",
            "authors": [
                "Zhou Y.",
                "Xu W.",
                "Donald B.R.",
                "Zeng J."
            ],
            "cit_count": 13,
            "journal": "Bioinformatics",
            "pmid": "24931991",
            "title": "An efficient parallel algorithm for accelerating computational protein design",
            "year": "2014-06-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:osprey",
        "biotoolsID": "osprey",
        "description": "Suite of programs for computational structure-based protein design. It is specifically designed to identify protein mutants that possess desired target properties (e.g., improved stability, switch of substrate specificity, etc.).",
        "homepage": "http://www.cs.duke.edu/donaldlab/osprey.php",
        "name": "OSPREY"
    }
}