{
    "accessibility": [],
    "additionDate": "2017-01-17T15:02:26Z",
    "biotoolsCURIE": "biotools:mulcom",
    "biotoolsID": "mulcom",
    "collectionID": [
        "BioConductor"
    ],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": "claudio.isella@ircc.it",
            "gridid": null,
            "name": "Claudio Isella",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        }
    ],
    "description": "Identification of differentially expressed genes and false discovery rate (FDR) calculation by Multiple Comparison test.",
    "documentation": [
        {
            "note": null,
            "type": "User manual",
            "url": "http://bioconductor.org/packages/release/bioc/html/Mulcom.html"
        }
    ],
    "download": [
        {
            "note": null,
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/Mulcom_1.24.0.tar.gz",
            "version": null
        }
    ],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/Mulcom.html",
    "homepage_status": 0,
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "license": "GPL-2.0",
    "link": [],
    "maturity": null,
    "name": "Mulcom",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-12-382",
            "metadata": {
                "abstract": "Background: Many microarray experiments search for genes with differential expression between a common \"reference\" group and multiple \"test\" groups. In such cases currently employed statistical approaches based on t-tests or close derivatives have limited efficacy, mainly because estimation of the standard error is done on only two groups at a time. Alternative approaches based on ANOVA correctly capture within-group variance from all the groups, but then do not confront single test groups with the reference. Ideally, a t-test better suited for this type of data would compare each test group with the reference, but use within-group variance calculated from all the groups.Results: We implemented an R-Bioconductor package named Mulcom, with a statistical test derived from the Dunnett's t-test, designed to compare multiple test groups individually against a common reference. Interestingly, the Dunnett's test uses for the denominator of each comparison a within-group standard error aggregated from all the experimental groups. In addition to the basic Dunnett's t value, the package includes an optional minimal fold-change threshold, m. Due to the automated, permutation-based estimation of False Discovery Rate (FDR), the package also permits fast optimization of the test, to obtain the maximum number of significant genes at a given FDR value. When applied to a time-course experiment profiled in parallel on two microarray platforms, and compared with two commonly used tests, Mulcom displayed better concordance of significant genes in the two array platforms (39% vs. 26% or 15%), and higher enrichment in functional annotation to categories related to the biology of the experiment (p value < 0.001 in 4 categories vs. 3).Conclusions: The Mulcom package provides a powerful tool for the identification of differentially expressed genes when several experimental conditions are compared against a common reference. The results of the practical example presented here show that lists of differentially expressed genes generated by Mulcom are particularly consistent across microarray platforms and enriched in genes belonging to functionally significant groups. © 2011 Isella et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Isella C."
                    },
                    {
                        "name": "Renzulli T."
                    },
                    {
                        "name": "Cora D."
                    },
                    {
                        "name": "Medico E."
                    }
                ],
                "citationCount": 5,
                "date": "2011-09-28T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Mulcom: A multiple comparison statistical test for microarray data in Bioconductor"
            },
            "note": null,
            "pmcid": null,
            "pmid": null,
            "type": "Primary",
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Molecular genetics",
            "uri": "http://edamontology.org/topic_3321"
        }
    ],
    "validated": 1,
    "version": [
        "1.24.0"
    ]
}