{
    "additionDate": "2021-01-18T12:02:49Z",
    "biotoolsCURIE": "biotools:pub2tools2020__metatropismdb",
    "biotoolsID": "pub2tools2020__metatropismdb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "m.giulietti@univpm.it",
            "name": "Matteo Giulietti",
            "typeEntity": "Person"
        }
    ],
    "description": "A database of organ-specific metastasis induced by human cancer cell lines in mouse models.\n\nThe organotropism is the propensity of metastatic cancer cells to colonize preferably certain distant organs, resulting in a non-random distribution of metastases. In order to shed light on this behaviour, several studies were performed by the injection of human cancer cell lines into immunocompromised mouse models.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Text annotation",
                    "uri": "http://edamontology.org/operation_3778"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://www.introni.it/Metastasis/metastasis.html",
    "lastUpdate": "2021-02-22T08:07:45Z",
    "name": "MetaTropismDB",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAAA100",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press.The organotropism is the propensity of metastatic cancer cells to colonize preferably certain distant organs, resulting in a non-random distribution of metastases. In order to shed light on this behaviour, several studies were performed by the injection of human cancer cell lines into immunocompromised mouse models. However, the information about these experiments is spread in the literature. For each xenograft experiment reported in the literature, we annotated both the experimental conditions and outcomes, including details on inoculated human cell lines, mouse models, injection methods, sites of metastasis, organs not colonized, rate of metastasis, latency time, overall survival and the involved genes. We created MetaTropismDB, a freely available database collecting hand-curated data useful to highlight the mechanisms of organ-specific metastasis. Currently, it stores the results of 513 experiments in which injections of 219 human cell lines have been carried out in mouse models. Notably, 296 genes involved in organotropic metastases have been collected. This specialized database allows the researchers to compare the current results about organotropism and plan future experiments in order to identify which tumour molecular signatures establish if and where the metastasis will develop.",
                "authors": [
                    {
                        "name": "Giulietti M."
                    },
                    {
                        "name": "Bastianoni M."
                    },
                    {
                        "name": "Cecati M."
                    },
                    {
                        "name": "Ruzzo A."
                    },
                    {
                        "name": "Bracci M."
                    },
                    {
                        "name": "Malavolta M."
                    },
                    {
                        "name": "Piacenza F."
                    },
                    {
                        "name": "Giacconi R."
                    },
                    {
                        "name": "Piva F."
                    }
                ],
                "citationCount": 1,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Database",
                "title": "MetaTropismDB: A database of organ-specific metastasis induced by human cancer cell lines in mouse models"
            },
            "pmcid": "PMC7687678",
            "pmid": "33238004"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Mouse clinic",
            "uri": "http://edamontology.org/topic_3338"
        }
    ]
}