{
    "additionDate": "2017-08-03T18:47:06Z",
    "biotoolsCURIE": "biotools:infmod3dgen",
    "biotoolsID": "infmod3dgen",
    "credit": [
        {
            "email": "siyu.wang@duke.edu",
            "name": "Siyu Wang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/wangsy11/InfMod3DGen"
        }
    ],
    "description": "New Bayesian framework to derive the 3D architecture of a chromosome from 3C-based data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/wangsy11/InfMod3DGen"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid structure analysis",
                    "uri": "http://edamontology.org/operation_2481"
                }
            ]
        }
    ],
    "homepage": "https://github.com/wangsy11/InfMod3DGen",
    "language": [
        "MATLAB",
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/infmod3dgen-inferential-modeling-of-3d-chromatin-structure.html"
        }
    ],
    "name": "InfMod3DGen",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© The Author(s) 2015.For eukaryotic cells, the biological processes involving regulatory DNA elements play an important role in cell cycle. Understanding 3D spatial arrangements of chromosomes and revealing long-range chromatin interactions are critical to decipher these biological processes. In recent years, chromosome conformation capture (3C) related techniques have been developed to measure the interaction frequencies between long-range genome loci, which have provided a great opportunity to decode the 3D organization of the genome. In this paper, we develop a new Bayesian framework to derive the 3D architecture of a chromosome from 3C-based data. By modeling each chromosome as a polymer chain, we define the conformational energy based on our current knowledge on polymer physics and use it as prior information in the Bayesian framework. We also propose an expectation-maximization (EM) based algorithm to estimate the unknown parameters of the Bayesian model and infer an ensemble of chromatin structures based on interaction frequency data. We have validated our Bayesian inference approach through cross-validation and verified the computed chromatin conformations using the geometric constraints derived from fluorescence in situ hybridization (FISH) experiments. We have further confirmed the inferred chromatin structures using the known genetic interactions derived from other studies in the literature. Our test results have indicated that our Bayesian framework can compute an accurate ensemble of 3D chromatin conformations that best interpret the distance constraints derived from 3C-based data and also agree with other sources of geometric constraints derived from experimental evidence in the previous studies. The source code of our approach can be found in https://github.com/wangsy11/InfMod3DGen.",
                "authors": [
                    {
                        "name": "Wang S."
                    },
                    {
                        "name": "Xu J."
                    },
                    {
                        "name": "Zeng J."
                    }
                ],
                "citationCount": 49,
                "date": "2015-01-30T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Inferential modeling of 3D chromatin structure"
            },
            "pmid": "25690896"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        }
    ],
    "validated": 1
}