{"credit":[{"email":"jparkin@sickkids.ca","name":"John Parkinson","typeEntity":"Person","typeRoles":["Primary contact"]}],"function":[{"operation":[{"term":"Sequence tagged site (STS) mapping","uri":"http://edamontology.org/operation_2871"},{"term":"Gene expression profiling","uri":"http://edamontology.org/operation_0314"},{"term":"DNA vaccine design","uri":"http://edamontology.org/operation_0560"},{"term":"Query and retrieval","uri":"http://edamontology.org/operation_0224"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Gene transcripts","uri":"http://edamontology.org/topic_3512"},{"term":"Transcriptomics","uri":"http://edamontology.org/topic_3308"},{"term":"Gene expression","uri":"http://edamontology.org/topic_0203"},{"term":"Drug discovery","uri":"http://edamontology.org/topic_3336"},{"term":"Gene and protein families","uri":"http://edamontology.org/topic_0623"}]},"publication":[{"abstract":"The phylum Nematoda occupies a huge range of ecological niches, from free-living microbivores to human parasites. We analyzed the genomic biology of the phylum using 265,494 expressed-sequence tag sequences, corresponding to 93,645 putative genes, from 30 species, including 28 parasites. From 35% to 70% of each species' genes had significant similarity to proteins from the model nematode Caenorhabditis elegans. More than half of the putative genes were unique to the phylum, and 23% were unique to the species from which they were derived. We have not yet come close to exhausting the genomic diversity of the phylum. We identified more than 2,600 different known protein domains, some of which had differential abundances between major taxonomic groups of nematodes. We also defined 4,228 nematode-specific protein families from nematode-restricted genes: this class of genes probably underpins species- and higher-level taxonomic disparity. Nematode-specific families are particularly interesting as drug and vaccine targets.","authors":["Parkinson J.","Mitreva M.","Whitton C.","Thomson M.","Daub J.","Martin J.","Schmid R.","Hall N.","Barrell B.","Waterston R.H.","McCarter J.P.","Blaxter M.L."],"cit_count":191,"journal":"Nature Genetics","pmid":"15543149","title":"A transcriptomic analysis of the phylum Nematoda","year":"2004-01-01"},{"abstract":"NEMBASE (available at http://www.nematodes.org) is a publicly available online database providing access to the sequence and associated meta-data currently being generated as part of the Edinburgh-Wellcome Trust Sanger Institute parasitic nematode EST project. NEMBASE currently holds ∼100 000 sequences from 10 different species of nematode. To facilitate ease of use, sequences have been processed to generate a non-redundant set of gene objects ('partial genome') for each species. Users may query the database on the basis of BLAST annotation, sequence similarity or expression profiles. NEMBASE also features an interactive Java-based tool (SimiTri) which allows the simultaneous display and analysis of the relative similarity relationships of groups of sequences to three different databases. NEMBASE is currently being expanded to include sequence data from other nematode species. Other developments include access to accurate peptide predictions, improved functional annotation and incorporation of automated processes allowing rapid analysis of nematode-specific gene families.","authors":["Parkinson J.","Whitton C.","Schmid R.","Thomson M.","Blaxter M."],"cit_count":61,"journal":"Nucleic Acids Research","pmid":"14681449","title":"NEMBASE: A resource for parasitic nematode ESTs","year":"2004-01-01"},{"abstract":"Background: The genomes of an increasing number of species are being investigated through generation of expressed sequence tags (ESTs). However, ESTs are prone to sequencing errors and typically define incomplete transcripts, making downstream annotation difficult. Annotation would be greatly improved with robust polypeptide translations. Many current solutions for EST translation require a large number of full-length gene sequences for training purposes, a resource that is not available for the majority of EST projects. Results: As part of our ongoing EST programs investigating these \"neglected\" genomes, we have developed a polypeptide prediction pipeline, prot4EST. It incorporates freely available software to produce final translations that are more accurate than those derived from any single method. We show that this integrated approach goes a long way to overcoming the deficit in training data. Conclusions: prot4EST provides a portable EST translation solution and can be usefully applied to >95% of EST projects to improve downstream annotation. It is freely available from http://www.nematodes.org/PartiGene. © 2004 Wasmuth and Blaxter; licensee BioMed Central Ltd.","authors":["Wasmuth J.D.","Blaxter M.L."],"cit_count":106,"journal":"BMC Bioinformatics","pmid":"15571632","title":"prot4EST: Translating expressed sequence tags from neglected genomes","year":"2004-11-30"},{"abstract":"Global sequence comparisons between large datasets, such as those arising from genome projects, can be problematic to display and analyze. We have developed SimiTri, a Java/Perl-based application, which allows simultaneous display and analysis of relative similarity relationships of the dataset of interest to three different databases. We illustrate its utility in identifying Caenorhabditis elegans genes that have distinct patterns of phylogenetic affinity suggestive of horizontal gene transfer.","authors":["Parkinson J.","Blaxter M."],"cit_count":49,"journal":"Bioinformatics","pmid":"12584125","title":"SimiTri - Visualizing similarity relationships for groups of sequences","year":"2003-02-12"}],"summary":{"biotoolsCURIE":"biotools:nembase4","biotoolsID":"nembase4","description":"Resource for nematode transcriptome analysis, and a research tool for nematode biology, drug discovery and vaccine design.","homepage":"http://www.nematodes.org/nembase4/","name":"NEMBASE4"}}