{
    "additionDate": "2020-01-14T20:07:13Z",
    "biotoolsCURIE": "biotools:HmtVar",
    "biotoolsID": "HmtVar",
    "confidence_flag": "tool",
    "description": "A data and text mining pipeline to annotate human mitochondrial variants with functional and clinical information.\n\nThe main web resource to explore human mitochondrial variability data and their pathological correlation.\n\nHmtVar is a manually-curated database offering variability and pathogenicity information about mtDNA variants.\n\nData are gathered from HmtVar's twin database HmtDB, and further integrated with pathogenicity predictions as well as additional information from several online resources focused on mtDNA, such as MITOMAP, 1000 Genomes Project, MutPred, SNPs&GO and many others.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Text annotation",
                    "uri": "http://edamontology.org/operation_3778"
                },
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Virulence prediction",
                    "uri": "http://edamontology.org/operation_3461"
                }
            ]
        }
    ],
    "homepage": "https://www.hmtvar.uniba.it/",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-10T09:19:21Z",
    "name": "HmtVar",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/MGG3.1085",
            "metadata": {
                "abstract": "© 2019 The Authors. Molecular Genetics & Genomic Medicine published by Wiley Periodicals, Inc.Background: Human mitochondrial DNA has an important role in the cellular energy production through oxidative phosphorylation. Therefore, this process may be the cause and have an effect on mitochondrial DNA mutability, functional alteration, and disease onset related to a wide range of different clinical expressions and phenotypes. Although a large part of the observed variations is fixed in a population and hence expected to be benign, the estimation of the degree of the pathogenicity of any possible human mitochondrial DNA variant is clinically pivotal. Methods: In this scenario, the establishment of standard criteria based on functional studies is required. In this context, a “data and text mining” pipeline is proposed here, developed using the programming language R, capable of extracting information regarding mitochondrial DNA functional studies and related clinical assessments from the literature, thus improving the annotation of human mitochondrial variants reported in the HmtVar database. Results: The data mining pipeline has produced a list of 1,073 Pubmed IDs (PMIDs) from which the text mining pipeline has retrieved information on 932 human mitochondrial variants regarding experimental validation and clinical features. Conclusions: The application of the pipeline will contribute to supporting the interpretation of pathogenicity of human mitochondrial variants by facilitating diagnosis to clinicians and researchers faced with this task.",
                "authors": [
                    {
                        "name": "Attimonelli M."
                    },
                    {
                        "name": "Palmisano D."
                    },
                    {
                        "name": "Preste R."
                    },
                    {
                        "name": "Vitale O."
                    }
                ],
                "citationCount": 1,
                "date": "2020-02-01T00:00:00Z",
                "journal": "Molecular Genetics and Genomic Medicine",
                "title": "A data and text mining pipeline to annotate human mitochondrial variants with functional and clinical information"
            },
            "pmid": "31821723"
        }
    ],
    "toolType": [
        "Web API"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
