
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                }
            ]
        }
    ],
    "labels": {
        "topic": [
            {
                "term": "DNA polymorphism",
                "uri": "http://edamontology.org/topic_2885"
            },
            {
                "term": "Genotype and phenotype",
                "uri": "http://edamontology.org/topic_0625"
            },
            {
                "term": "Pathology",
                "uri": "http://edamontology.org/topic_0634"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019 John Wiley & Sons, Ltd.Background: Kashin–Beck disease (KBD) is a local, multiple and deformable osteoarthropathy, mostly occurring in Tibet. Type 2 iodothyronine deiodinase (DIO2) is implicated in the activation of thyroid hormones to which the bones are very sensitive. Therefore, it is necessary to explore the association between KBD and DIO2 in the Tibetan population. Methods: We carried out a case–control study among 316 cases and 320 controls from a Tibetan population. Seven single nucleotide polymorphisms in DIO2 were selected and genotyped using the Agena MassARRAY platform (Agena Bioscience, San Diego, CA, USA). Odds ratios (ORs) and 95% confidence intervals (CIs) were calculated by logistic regression analysis. HaploReg (https://pubs.broadinstitute.org/mammals/haploreg/haploreg.php) and GTEx (http://www.gtexportal.org) databases were applied for functional assessment of the polymorphisms. Results: The “A/C\" genotype of rs1352815 (OR = 3.18, 95% CI = 1.14–8.85, p = 0.027) and the “A/G\" genotype of rs1388382 (OR = 3.80, 95% CI = 1.30–11.11, p = 0.015) were associated with the susceptibility of KBD under the co-dominant model. With gender stratification analysis, rs1388382 showed obvious evidence for correlation with an elevated risk of KBD in females under the co-dominant model (OR = 3.32, 95% CI = 1.06–10.41, p = 0.039). Conclusions: The results obtained in the present study indicate that DIO2 polymorphisms rs1352815 and rs1388382 were correlated with KBD susceptibility among Tibetans, which also sheds new light on the role of DIO2 in the development of KBD.",
            "authors": [
                "Jin T.",
                "Wang L.",
                "He X.",
                "Liu M.",
                "Bai M.",
                "Rong H.",
                "He Y.",
                "Yuan D."
            ],
            "cit_count": 0,
            "doi": "10.1002/JGM.3123",
            "journal": "Journal of Gene Medicine",
            "pmid": "31433532",
            "title": "Association between DIO2 polymorphism and the risk of Kashin–Beck disease in the Tibetan population",
            "year": "2019-10-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:HaploReg",
        "biotoolsID": "HaploReg",
        "description": "> MEDIUM CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'GTEx' (bio.tools/gtex), 'HaploReg GTEx', 'DIO2' | Association between DIO2 polymorphism and the risk of Kashin-Beck disease in the Tibetan population | HaploReg is a tool for exploring annotations of the noncoding genome at variants on haplotype blocks, such as candidate regulatory SNPs at disease-associated loci. Using LD information from the 1000 Genomes Project, linked SNPs and small indels can be visualized along with chromatin state and protein binding annotation from the Roadmap Epigenomics and ENCODE projects, sequence conservation across mammals, the effect of SNPs on regulatory motifs, and the effect of SNPs on expression from eQTL studies. HaploReg is designed for researchers developing mechanistic hypotheses of the impact of non-coding variants on clinical phenotypes and normal variation",
        "homepage": "https://pubs.broadinstitute.org/mammals/haploreg/haploreg.php",
        "name": "HaploReg"
    }
}