{
    "accessibility": [],
    "additionDate": "2017-08-03T18:55:42Z",
    "biotoolsCURIE": "biotools:phos3d",
    "biotoolsID": "phos3d",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": null,
            "gridid": null,
            "name": null,
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://phos3d.mpimp-golm.mpg.de/cgi-bin/index.py?show=contact"
        }
    ],
    "description": "Web server for the prediction of phosphorylation sites (P-sites) in proteins. The approach is based on Support Vector Machines trained on sequence profiles enhanced by information from the spatial context of experimentally identified P-sites.",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "http://phos3d.mpimp-golm.mpg.de/cgi-bin/index.py?show=help"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Post-translation modification site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                }
            ],
            "output": []
        },
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://phos3d.mpimp-golm.mpg.de/",
    "homepage_status": 0,
    "language": [],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "license": null,
    "link": [
        {
            "note": null,
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/phos3d-prediction-phosphorylation-sites-p-sites-proteins.html"
        }
    ],
    "maturity": null,
    "name": "Phos3D",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": null,
            "metadata": {
                "abstract": "Background: Phosphorylation of proteins plays a crucial role in the regulation and activation of metabolic and signaling pathways and constitutes an important target for pharmaceutical intervention. Central to the phosphorylation process is the recognition of specific target sites by protein kinases followed by the covalent attachment of phosphate groups to the amino acids serine, threonine, or tyrosine. The experimental identification as well as computational prediction of phosphorylation sites (P-sites) has proved to be a challenging problem. Computational methods have focused primarily on extracting predictive features from the local, one-dimensional sequence information surrounding phosphorylation sites. Results: We characterized the spatial context of phosphorylation sites and assessed its usability for improved phosphorylation site predictions. We identified 750 non-redundant, experimentally verified sites with three-dimensional (3D) structural information available in the protein data bank (PDB) and grouped them according to their respective kinase family. We studied the spatial distribution of amino acids around phosphorserines, phosphothreonines, and phosphotyrosines to extract signature 3D-profiles. Characteristic spatial distributions of amino acid residue types around phosphorylation sites were indeed discernable, especially when kinase-family-specific target sites were analyzed. To test the added value of using spatial information for the computational prediction of phosphorylation sites, Support Vector Machines were applied using both sequence as well as structural information. When compared to sequence-only based prediction methods, a small but consistent performance improvement was obtained when the prediction was informed by 3D-context information. Conclusion: While local one-dimensional amino acid sequence information was observed to harbor most of the discriminatory power, spatial context information was identified as relevant for the recognition of kinases and their cognate target sites and can be used for an improved prediction of phosphorylation sites. A web-based service (Phos3D) implementing the developed structure-based P-site prediction method has been made available at http://phos3d.mpimp-golm.mpg.de. © 2009 Durek et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Durek P."
                    },
                    {
                        "name": "Schudoma C."
                    },
                    {
                        "name": "Weckwerth W."
                    },
                    {
                        "name": "Selbig J."
                    },
                    {
                        "name": "Walther D."
                    }
                ],
                "citationCount": 46,
                "date": "2009-04-21T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Detection and characterization of 3D-signature phosphorylation site motifs and their contribution towards improved phosphorylation site prediction in proteins"
            },
            "note": null,
            "pmcid": null,
            "pmid": "19383128",
            "type": null,
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Protein properties",
            "uri": "http://edamontology.org/topic_0123"
        }
    ],
    "validated": 1,
    "version": []
}