{
    "accessibility": [
        "Open access"
    ],
    "additionDate": "2019-06-11T17:15:30Z",
    "biotoolsCURIE": "biotools:mea",
    "biotoolsID": "mea",
    "cost": "Free of charge",
    "description": "A Methylomic and Epigenomic Allele-specific analysis pipeline",
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/julienrichardalbert/MEA/blob/master/README.md"
        },
        {
            "type": "User manual",
            "url": "https://github.com/julienrichardalbert/MEA/raw/master/doc/MEA_UserGuide_v1.0.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "RNA-Seq analysis",
                    "uri": "http://edamontology.org/operation_3680"
                }
            ]
        }
    ],
    "homepage": "https://github.com/julienrichardalbert/MEA",
    "language": [
        "Python"
    ],
    "lastUpdate": "2019-07-29T12:15:53Z",
    "license": "MIT",
    "link": [
        {
            "type": "Issue tracker",
            "url": "https://github.com/julienrichardalbert/MEA/issues"
        }
    ],
    "maturity": "Mature",
    "name": "MEA",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "hyounesy",
    "publication": [
        {
            "doi": "10.1186/s12864-018-4835-2",
            "metadata": {
                "abstract": "© 2018 The Author(s). Background: Allele-specific transcriptional regulation, including of imprinted genes, is essential for normal mammalian development. While the regulatory regions controlling imprinted genes are associated with DNA methylation (DNAme) and specific histone modifications, the interplay between transcription and these epigenetic marks at allelic resolution is typically not investigated genome-wide due to a lack of bioinformatic packages that can process and integrate multiple epigenomic datasets with allelic resolution. In addition, existing ad-hoc software only consider SNVs for allele-specific read discovery. This limitation omits potentially informative INDELs, which constitute about one fifth of the number of SNVs in mice, and introduces a systematic reference bias in allele-specific analyses. Results: Here, we describe MEA, an INDEL-aware Methylomic and Epigenomic Allele-specific analysis pipeline which enables user-friendly data exploration, visualization and interpretation of allelic imbalance. Applying MEA to mouse embryonic datasets yields robust allele-specific DNAme maps and low reference bias. We validate allele-specific DNAme at known differentially methylated regions and show that automated integration of such methylation data with RNA- and ChIP-seq datasets yields an intuitive, multidimensional view of allelic gene regulation. MEA uncovers numerous novel dynamically methylated loci, highlighting the sensitivity of our pipeline. Furthermore, processing and visualization of epigenomic datasets from human brain reveals the expected allele-specific enrichment of H3K27ac and DNAme at imprinted as well as novel monoallelically expressed genes, highlighting MEA's utility for integrating human datasets of distinct provenance for genome-wide analysis of allelic phenomena. Conclusions: Our novel pipeline for standardized allele-specific processing and visualization of disparate epigenomic and methylomic datasets enables rapid analysis and navigation with allelic resolution. MEA is freely available as a Docker container at https://github.com/julienrichardalbert/MEA.",
                "authors": [
                    {
                        "name": "Richard Albert J."
                    },
                    {
                        "name": "Koike T."
                    },
                    {
                        "name": "Younesy H."
                    },
                    {
                        "name": "Thompson R."
                    },
                    {
                        "name": "Bogutz A.B."
                    },
                    {
                        "name": "Karimi M.M."
                    },
                    {
                        "name": "Lorincz M.C."
                    }
                ],
                "citationCount": 1,
                "date": "2018-06-15T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Development and application of an integrated allele-specific pipeline for methylomic and epigenomic analysis (MEA)"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "Methylated DNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3674"
        },
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        }
    ],
    "version": [
        "1.0"
    ]
}