{
    "additionDate": "2015-01-22T11:49:03Z",
    "biotoolsCURIE": "biotools:maistas",
    "biotoolsID": "maistas",
    "credit": [
        {
            "name": "ELIXIR-ITA-SAPIENZA",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "domenico.raimondo@uniroma1.it",
            "name": "Domenico Raimondo",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "matteo.floris@gmail.com",
            "name": "Matteo Floris",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Fully automatic pipeline aimed at building and assessing three-dimensional models for alternative splicing isoforms.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Nucleic acid sequence",
                        "uri": "http://edamontology.org/data_2977"
                    }
                }
            ],
            "note": "Prediction of structure of alternative splicing isoforms in eukaryotic genomes.",
            "operation": [
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Protein structure",
                        "uri": "http://edamontology.org/data_1460"
                    }
                }
            ]
        }
    ],
    "homepage": "http://maistas.bioinformatica.crs4.it/",
    "lastUpdate": "2018-12-10T12:58:50Z",
    "name": "Maistas",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-ITA-SAPIENZA",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btr198",
            "metadata": {
                "abstract": "Motivation: Analysis of the human genome revealed that the amount of transcribed sequence is an order of magnitude greater than the number of predicted and well-characterized genes. A sizeable fraction of these transcripts is related to alternatively spliced forms of known protein coding genes. Inspection of the alternatively spliced transcripts identified in the pilot phase of the ENCODE project has clearly shown that often their structure might substantially differ from that of other isoforms of the same gene, and therefore that they might perform unrelated functions, or that they might even not correspond to a functional protein. Identifying these cases is obviously relevant for the functional assignment of gene products and for the interpretation of the effect of variations in the corresponding proteins. Results: Here we describe a publicly available tool that, given a gene or a protein, retrieves and analyses all its annotated isoforms, provides users with three-dimensional models of the isoform(s) of his/her interest whenever possible and automatically assesses whether homology derived structural models correspond to plausible structures. This information is clearly relevant. When the homology model of some isoforms of a gene does not seem structurally plausible, the implications are that either they assume a structure unrelated to that of the other isoforms of the same gene with presumably significant functional differences, or do not correspond to functional products. We provide indications that the second hypothesis is likely to be true for a substantial fraction of the cases. © The Author(s) 2011. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Floris M."
                    },
                    {
                        "name": "Raimondo D."
                    },
                    {
                        "name": "Leoni G."
                    },
                    {
                        "name": "Orsini M."
                    },
                    {
                        "name": "Marcatili P."
                    },
                    {
                        "name": "Tramontano A."
                    }
                ],
                "citationCount": 11,
                "date": "2011-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "MAISTAS: A tool for automatic structural evaluation of alternative splicing products"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}