{
    "additionDate": "2020-01-14T08:51:33Z",
    "biotoolsCURIE": "biotools:prodigy-cancer",
    "biotoolsID": "prodigy-cancer",
    "confidence_flag": "tool",
    "description": "Prodigy is an R package that offers personalized prioritization of driver genes in cancer.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Pathway or network comparison",
                    "uri": "http://edamontology.org/operation_0277"
                },
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Shamir-Lab/PRODIGY",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T20:49:41.081862Z",
    "name": "Prodigy",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btz815",
            "metadata": {
                "abstract": "Motivation: Evolution of cancer is driven by few somatic mutations that disrupt cellular processes, causing abnormal proliferation and tumor development, whereas most somatic mutations have no impact on progression. Distinguishing those mutated genes that drive tumorigenesis in a patient is a primary goal in cancer therapy: Knowledge of these genes and the pathways on which they operate can illuminate disease mechanisms and indicate potential therapies and drug targets. Current research focuses mainly on cohort-level driver gene identification but patient-specific driver gene identification remains a challenge. Methods: We developed a new algorithm for patient-specific ranking of driver genes. The algorithm, called PRODIGY, analyzes the expression and mutation profiles of the patient along with data on known pathways and protein–protein interactions. Prodigy quantifies the impact of each mutated gene on every deregulated pathway using the prize-collecting Steiner tree model. Mutated genes are ranked by their aggregated impact on all deregulated pathways. Results: In testing on five TCGA cancer cohorts spanning >2500 patients and comparison to validated driver genes, Prodigy outperformed extant methods and ranking based on network centrality measures. Our results pinpoint the pleiotropic effect of driver genes and show that Prodigy is capable of identifying even very rare drivers. Hence, Prodigy takes a step further toward personalized medicine and treatment. Availability and implementation: The Prodigy R package is available at: https://github.com/Shamir-Lab/PRODIGY.",
                "authors": [
                    {
                        "name": "Dinstag G."
                    },
                    {
                        "name": "Shamir R."
                    }
                ],
                "citationCount": 36,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "PRODIGY: Personalized prioritization of driver genes"
            },
            "pmcid": "PMC7703777",
            "pmid": "31681944"
        }
    ],
    "topic": [
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        }
    ],
    "validated": 1
}
