{"collectionID": [], "accessibility": [], "topic": [{"term": "Transcriptomics", "uri": "http://edamontology.org/topic_3308"}, {"term": "Genomics", "uri": "http://edamontology.org/topic_0622"}, {"term": "Phylogenomics", "uri": "http://edamontology.org/topic_0194"}], "owner": "mbs_import", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": "10.1186/1471-2105-14-330", "note": null, "version": null, "pmid": null, "type": "Primary", "pmcid": null, "metadata": {"title": "Agalma: An automated phylogenomics workflow", "abstract": "Background: In the past decade, transcriptome data have become an important component of many phylogenetic studies. They are a cost-effective source of protein-coding gene sequences, and have helped projects grow from a few genes to hundreds or thousands of genes. Phylogenetic studies now regularly include genes from newly sequenced transcriptomes, as well as publicly available transcriptomes and genomes. Implementing such a phylogenomic study, however, is computationally intensive, requires the coordinated use of many complex software tools, and includes multiple steps for which no published tools exist. Phylogenomic studies have therefore been manual or semiautomated. In addition to taking considerable user time, this makes phylogenomic analyses difficult to reproduce, compare, and extend. In addition, methodological improvements made in the context of one study often cannot be easily applied and evaluated in the context of other studies.Results: We present Agalma, an automated tool that constructs matrices for phylogenomic analyses. The user provides raw Illumina transcriptome data, and Agalma produces annotated assemblies, aligned gene sequence matrices, a preliminary phylogeny, and detailed diagnostics that allow the investigator to make extensive assessments of intermediate analysis steps and the final results. Sequences from other sources, such as externally assembled genomes and transcriptomes, can also be incorporated in the analyses. Agalma is built on the BioLite bioinformatics framework, which tracks provenance, profiles processor and memory use, records diagnostics, manages metadata, installs dependencies, logs version numbers and calls to external programs, and enables rich HTML reports for all stages of the analysis. Agalma includes a small test data set and a built-in test analysis of these data. In addition to describing Agalma, we here present a sample analysis of a larger seven-taxon data set. Agalma is available for download at https://bitbucket.org/caseywdunn/agalma.Conclusions: Agalma allows complex phylogenomic analyses to be implemented and described unambiguously as a series of high-level commands. This will enable phylogenomic studies to be readily reproduced, modified, and extended. Agalma also facilitates methods development by providing a complete modular workflow, bundled with test data, that will allow further optimization of each step in the context of a full phylogenomic analysis. © 2013 Dunn et al.; licensee BioMed Central Ltd.", "citationCount": 56, "authors": [{"name": "Dunn C.W."}, {"name": "Howison M."}, {"name": "Zapata F."}], "date": "2013-11-19T00:00:00Z", "journal": "BMC Bioinformatics"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": null, "url": "http://www.brown.edu/Faculty/Dunn_Lab/", "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": null}], "biotoolsCURIE": "biotools:agalma", "elixirPlatform": [], "elixirNode": [], "version": ["0.6.0"], "elixir_badge": 0, "homepage": "https://bitbucket.org/caseywdunn/agalma", "function": [{"note": null, "input": [], "operation": [{"term": "Sequence assembly", "uri": "http://edamontology.org/operation_0310"}], "cmd": null, "output": []}, {"note": null, "input": [], "operation": [{"term": "Transcriptome assembly", "uri": "http://edamontology.org/operation_3258"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:52Z", "otherID": [], "description": "Automated tool that constructs matrices for phylogenomic analyses.  It builds alignments of homologous genes and preliminary species trees from genomic and transcriptome data.", "toolType": ["Command-line tool"], "editPermission": {"type": "private", "authors": []}, "language": ["Python"], "link": [{"url": "http://www.mybiosoftware.com/agalma-0-3-5-a-transcriptome-assembly-and-phylogenetic-analysis-environment.html", "note": null, "type": "Software catalogue"}], "biotoolsID": "agalma", "additionDate": "2017-12-18T00:03:25Z", "name": "Agalma", "license": null, "documentation": [{"url": "https://bitbucket.org/caseywdunn/agalma", "note": null, "type": "User manual"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux"]}