{
    "additionDate": "2019-11-14T18:20:26Z",
    "biotoolsCURIE": "biotools:MGOB",
    "biotoolsID": "MGOB",
    "confidence_flag": "tool",
    "description": "The Methylotroph Gene Order Browser (MGOB) reveals conserved synteny and ancestral centromere locations in the yeast family Pichiaceae | The Methylotroph Gene Order Browser (MGOB) is an online tool for visualising the syntenic context of any gene from several yeast genomes - Copyright Kevin Byrne - ygob@ucd.ie - Wolfe Laboratory, Conway Institute, University College Dublin, Dublin 4, Ireland",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Genome visualisation",
                    "uri": "http://edamontology.org/operation_3208"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "homepage": "http://mgob.ucd.ie",
    "lastUpdate": "2020-12-28T10:13:02Z",
    "name": "MGOB",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/FEMSYR/FOZ058",
            "metadata": {
                "abstract": "© 2019 FEMS 2019.The yeast family Pichiaceae, also known as the 'methylotrophs clade', is a relatively little studied group of yeasts despite its economic and clinical relevance. To explore the genome evolution and synteny relationships within this family, we developed the Methylotroph Gene Order Browser (MGOB, http://mgob.ucd.ie) similar to our previous gene order browsers for other yeast families. The dataset contains genome sequences from nine Pichiaceae species, including our recent reference sequence of Pichia kudriavzevii. As an example, we demonstrate the conservation of synteny around the MOX1 locus among species both containing and lacking the MOX1 gene for methanol assimilation. We found ancient clusters of genes that are conserved as adjacent between Pichiaceae and Saccharomycetaceae. Surprisingly, we found evidence that the locations of some centromeres have been conserved among Pichiaceae species, and between Pichiaceae and Saccharomycetaceae, even though the centromeres fall into different structural categories - point centromeres, inverted repeats and retrotransposon cluster centromeres.",
                "authors": [
                    {
                        "name": "Byrne K.P."
                    },
                    {
                        "name": "Douglass A.P."
                    },
                    {
                        "name": "Wolfe K.H."
                    }
                ],
                "citationCount": 3,
                "date": "2019-08-22T00:00:00Z",
                "journal": "FEMS Yeast Research",
                "title": "The Methylotroph Gene Order Browser (MGOB) reveals conserved synteny and ancestral centromere locations in the yeast family Pichiaceae"
            },
            "pmid": "31397853"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        }
    ],
    "validated": 1
}
