{
    "additionDate": "2021-01-18T08:07:33Z",
    "biotoolsCURIE": "biotools:sris",
    "biotoolsID": "sris",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "nslin@sinica.edu.tw",
            "typeEntity": "Person"
        },
        {
            "email": "sarah321@mail.ncku.edu.tw",
            "typeEntity": "Person"
        }
    ],
    "description": "A Small RNA Illustration System for Plant Next-Generation Sequencing Data Analysis.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA structure prediction",
                    "uri": "http://edamontology.org/operation_2441"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                }
            ]
        }
    ],
    "homepage": "http://sris.itps.ncku.edu.tw/",
    "lastUpdate": "2021-02-21T15:17:54Z",
    "name": "sRIS",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/PCP/PCAA034",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press on behalf of Japanese Society of Plant Physiologists. All rights reserved.Small RNA (sRNA), such as microRNA (miRNA) and short interfering RNA, are well-known to control gene expression based on degradation of target mRNA in plants. A considerable amount of research has applied next-generation sequencing (NGS) to reveal the regulatory pathways of plant sRNAs. Consequently, numerous bioinformatics tools have been developed for the purpose of analyzing sRNA NGS data. However, most methods focus on the study of sRNA expression profiles or novel miRNAs predictions. The analysis of sRNA target genes is usually not integrated into their pipelines. As a result, there is still no means available for identifying the interaction mechanisms between host and virus or the synergistic effects between two viruses. For the present study, a comprehensive system, called the Small RNA Illustration System (sRIS), has been developed. This system contains two main components. The first is for sRNA overview analysis and can be used not only to identify miRNA but also to investigate virus-derived small interfering RNA. The second component is for sRNA target prediction, and it employs both bioinformatics calculations and degradome sequencing data to enhance the accuracy of target prediction. In addition, this system has been designed so that figures and tables for the outputs of each analysis can be easily retrieved and accessed, making it easier for users to quickly identify and quantify their results. sRIS is available at http://sris.itps.ncku.edu.tw/.",
                "authors": [
                    {
                        "name": "Chang S.-B."
                    },
                    {
                        "name": "Chang W.-C."
                    },
                    {
                        "name": "Chiang-Hsieh Y.-F."
                    },
                    {
                        "name": "Chow C.-N."
                    },
                    {
                        "name": "Lee T.-Y."
                    },
                    {
                        "name": "Lin N.-S."
                    },
                    {
                        "name": "Pai H."
                    },
                    {
                        "name": "Tseng K.-C."
                    },
                    {
                        "name": "Wu N.-Y."
                    },
                    {
                        "name": "Zheng H.-Q."
                    }
                ],
                "date": "2020-04-08T00:00:00Z",
                "journal": "Plant and Cell Physiology",
                "title": "SRIS: A Small RNA Illustration System for Plant Next-Generation Sequencing Data Analysis"
            },
            "pmid": "32181856"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
