
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "labels": {
        "topic": [
            {
                "term": "Machine learning",
                "uri": "http://edamontology.org/topic_3474"
            },
            {
                "term": "Cardiology",
                "uri": "http://edamontology.org/topic_3335"
            },
            {
                "term": "Biomarkers",
                "uri": "http://edamontology.org/topic_3360"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019, © 2019 Informa UK Limited, trading as Taylor & Francis Group.Objectives. In heart failure, invasive angiography is often employed to differentiate ischaemic from non-ischaemic cardiomyopathy. We aim to examine the predictive value of echocardiographic strain features alone and in combination with other features to differentiate ischaemic from non-ischaemic cardiomyopathy, using artificial neural network (ANN) and logistic regression modelling. Design. We retrospectively identified 204 consecutive patients with an ejection fraction <50% and a diagnostic angiogram. Patients were categorized as either ischaemic (n = 146) or non-ischaemic cardiomyopathy (n = 58). For each patient, left ventricular strain parameters were obtained. Additionally, regional wall motion abnormality, 13 electrocardiographic (ECG) features and six demographic features were retrieved for analysis. The entire cohort was randomly divided into a derivation and a validation cohort. Using the parameters retrieved, logistic regression and ANN models were developed in the derivation cohort to differentiate ischaemic from non-ischaemic cardiomyopathy, the models were then tested in the validation cohort. Results. A final strain-based ANN model, full feature ANN model and full feature logistic regression model were developed and validated, F1 scores were 0.82, 0.79 and 0.63, respectively. Conclusions. Both ANN models were more accurate at predicting cardiomyopathy type than the logistic regression model. The strain-based ANN model should be validated in other cohorts. This model or similar models could be used to aid the diagnosis of underlying heart failure aetiology in the form of the online calculator (https://cimti.usj.edu.lb/strain/index.html) or built into echocardiogram software.",
            "authors": [
                "Walsh J.L.",
                "AlJaroudi W.A.",
                "Lamaa N.",
                "Abou Hassan O.K.",
                "Jalkh K.",
                "Elhajj I.H.",
                "Sakr G.",
                "Isma'eel H."
            ],
            "cit_count": 0,
            "doi": "10.1080/14017431.2019.1678764",
            "journal": "Scandinavian Cardiovascular Journal",
            "pmid": "31623474",
            "title": "A speckle-tracking strain-based artificial neural network model to differentiate cardiomyopathy type",
            "year": "2019-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:cimti",
        "biotoolsID": "cimti",
        "description": "A speckle-tracking strain-based artificial neural network model to differentiate cardiomyopathy type.\n\nClick on the different areas to enter strain values.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'non-ischaemic cardiomyopathy', 'non-ischaemic', 'ischaemic', 'strain-based'",
        "homepage": "https://cimti.usj.edu.lb/strain/index.html",
        "name": "cimti"
    }
}