{
    "additionDate": "2017-08-03T18:48:45Z",
    "biotoolsCURIE": "biotools:magna",
    "biotoolsID": "magna",
    "credit": [
        {
            "email": "tmilenko@nd.edu",
            "name": "Tijana Milenkovic, Ph.D",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www3.nd.edu/~cone/group_members.html"
        },
        {
            "email": "vvijayan@nd.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www3.nd.edu/~cone/group_members.html"
        }
    ],
    "description": "Software tool for pairwise global network alignment. It is an extension of MAGNA. An example of an application domain where this tool is useful is computational biology – It can be used for biological network alignment.",
    "documentation": [
        {
            "type": "User manual",
            "url": "https://www3.nd.edu/~cone/MAGNA++/documentation.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Optimisation and refinement",
                    "uri": "http://edamontology.org/operation_2425"
                }
            ]
        }
    ],
    "homepage": "http://www3.nd.edu/~cone/MAGNA++/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:49Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/magna-maximizing-accuracy-in-global-network-alignment.html"
        }
    ],
    "name": "MAGNA++",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© The Author 2015. Published by Oxford University Press. All rights reserved.Motivation: Network alignment aims to find conserved regions between different networks. Existing methods aim to maximize total similarity over all aligned nodes (i.e. node conservation). Then, they evaluate alignment quality by measuring the amount of conserved edges, but only after the alignment is constructed. Thus, we recently introduced MAGNA (Maximizing Accuracy in Global Network Alignment) to directly maximize edge conservation while producing alignments and showed its superiority over the existing methods. Here, we extend the original MAGNA with several important algorithmic advances into a new MAGNA++ framework. Results: MAGNA++ introduces several novelties: (i) it simultaneously maximizes any one of three different measures of edge conservation (including our recent superior S3 measure) and any desired node conservation measure, which further improves alignment quality compared with maximizing only node conservation or only edge conservation; (ii) it speeds up the original MAGNA algorithm by parallelizing it to automatically use all available resources, as well as by reimplementing the edge conservation measures more efficiently; (iii) it provides a friendly graphical user interface for easy use by domain (e.g. biological) scientists; and (iv) at the same time, MAGNA++ offers source code for easy extensibility by computational scientists.",
                "authors": [
                    {
                        "name": "Vijayan V."
                    },
                    {
                        "name": "Saraph V."
                    },
                    {
                        "name": "Milenkovic T."
                    }
                ],
                "citationCount": 44,
                "date": "2015-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "MAGNA11: Maximizing accuracy in global network alignment via both node and edge conservation"
            },
            "pmid": "25792552"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        }
    ],
    "validated": 1
}