{
    "accessibility": "Open access",
    "additionDate": "2021-11-03T14:47:38.467956Z",
    "biotoolsCURIE": "biotools:dtu-dads-aqua",
    "biotoolsID": "dtu-dads-aqua",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "joao.fps.romero@gmail.com",
            "name": "João F. Romero",
            "typeEntity": "Person"
        }
    ],
    "description": "A simulation framework for modelling waterborne spread of highly infectious pathogens in marine aquaculture.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Pathway analysis",
                    "uri": "http://edamontology.org/operation_3928"
                }
            ]
        }
    ],
    "homepage": "https://github.com/upei-aqua/DTU-DADS-Aqua",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-11-03T14:47:38.471883Z",
    "license": "AGPL-3.0",
    "name": "DTU-DADS-Aqua",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1111/TBED.14195",
            "metadata": {
                "abstract": "© 2021 Wiley-VCH GmbHSimulation models are useful tools to predict and elucidate the effects of factors influencing the occurrence and spread of epidemics in animal populations, evaluate the effectiveness of different control strategies and ultimately inform decision-makers about mitigations to reduce risk. There is a paucity of simulation models to study waterborne transmission of viral and bacterial pathogens in marine environments. We developed a stochastic, spatiotemporal hybrid simulation model (DTU-DADS-Aqua) that incorporates a compartmental model for infection spread within net-pens, an agent-based model for infection spread between net-pens within and between sites and uses seaway distance to inform farm-site hydroconnectivity. The model includes processes to simulate infection transmission and control over surveillance, detection and depopulation measures. Different what-if scenarios can be explored according to the input data provided and user-defined parameter values, such as daily surveillance and depopulation capacities or increased animal mortality that triggers diagnostic testing to detect infection. The latter can be easily defined in a software application, in which results are summarized after each simulation. To demonstrate capabilities of the model, we simulated the spread of infectious salmon anaemia virus (ISAv) for realistic scenarios in a transboundary population of farmed Atlantic salmon (Salmo salar L.) in New Brunswick, Canada and Maine, United States. We assessed the progression of infection in the different simulated outbreak scenarios, allowing for variation in the control strategies adopted for ISAv. Model results showed that improved disease detection, coupled with increasing surveillance visits to farm-sites and increased culling capacity for depopulation of infected net-pens reduced the number of infected net-pens and outbreak duration but the number of ISA-infected farm sites was minimally affected. DTU-DADS-Aqua is a flexible modelling framework, which can be applied to study different infectious diseases in the aquatic environment, allowing the incorporation of alternative transmission and control dynamics. The framework is open-source and available at https://github.com/upei-aqua/DTU-DADS-Aqua.",
                "authors": [
                    {
                        "name": "Gardner I."
                    },
                    {
                        "name": "Halasa T."
                    },
                    {
                        "name": "Price D."
                    },
                    {
                        "name": "Romero J.F."
                    },
                    {
                        "name": "Thakur K."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Transboundary and Emerging Diseases",
                "title": "DTU-DADS-Aqua: A simulation framework for modelling waterborne spread of highly infectious pathogens in marine aquaculture"
            },
            "pmid": "34152091"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Veterinary medicine",
            "uri": "http://edamontology.org/topic_3397"
        }
    ],
    "validated": 1
}
