{
    "additionDate": "2019-11-14T19:29:11Z",
    "biotoolsCURIE": "biotools:SPeDE",
    "biotoolsID": "SPeDE",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "aurelien.carlier@ugent.be",
            "name": "Aurélien Carlier",
            "typeEntity": "Person"
        }
    ],
    "description": "High-Throughput Dereplication and Accurate Determination of Microbial Diversity from Matrix-Assisted Laser Desorption-Ionization Time of Flight Mass Spectrometry Data | A python application for MALDI-TOF MS dereplication | python SPeDE.py <Path\\to\\ppmc_interval_index.csv> <Project_directory> <Output_directory> [-d <density>] [-c <cluster>] [-l <local>] [-m <cutoff>] [ -o <output_format>\\] [-p <peak-count>] [-n <name>] [-q <validation_name>] [-v] [-e] | Command driven processing (Windows and Linux supported, MacOS unknown) | This program cannot be run on a Linux subsystem in Windows",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Spectral counting",
                    "uri": "http://edamontology.org/operation_3637"
                },
                {
                    "term": "Spectrum calculation",
                    "uri": "http://edamontology.org/operation_3860"
                },
                {
                    "term": "Mass spectra calibration",
                    "uri": "http://edamontology.org/operation_3627"
                }
            ]
        }
    ],
    "homepage": "https://github.com/LM-UGent/SPeDE",
    "language": [
        "Python"
    ],
    "lastUpdate": "2019-11-14T19:29:11Z",
    "license": "MIT",
    "name": "SPeDE",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1128/MSYSTEMS.00437-19",
            "metadata": {
                "abstract": "Copyright © 2019 Dumolin et al. This is an open-access article distributed under the terms of the Creative Commons Attribution 4.0 International license.The isolation of microorganisms from microbial community samples often yields a large number of conspecific isolates. Increasing the diversity covered by an isolate collection entails the implementation of methods and protocols to minimize the number of redundant isolates. Matrix-assisted laser desorption–ionization time-of-flight (MALDI-TOF) mass spectrometry methods are ideally suited to this dereplication problem because of their low cost and high throughput. However, the available software tools are cumbersome and rely either on the prior development of reference databases or on global similarity analyses, which are inconvenient and offer low taxonomic resolution. We introduce SPeDE, a user-friendly spectral data analysis tool for the dereplication of MALDI-TOF mass spectra. Rather than relying on global similarity approaches to classify spectra, SPeDE determines the number of unique spectral features by a mix of global and local peak comparisons. This approach allows the identification of a set of nonredundant spectra linked to operational isolation units. We evaluated SPeDE on a data set of 5,228 spectra representing 167 bacterial strains belonging to 132 genera across six phyla and on a data set of 312 spectra of 78 strains measured before and after lyophilization and subculturing. SPeDE was able to dereplicate with high efficiency by identifying redundant spectra while retrieving reference spectra for all strains in a sample. SPeDE can identify distinguishing features between spectra, and its performance exceeds that of established methods in speed and precision. SPeDE is open source under the MIT license and is available from https://github.com/LM-UGent/SPeDE. IMPORTANCE Estimation of the operational isolation units present in a MALDI-TOF mass spectral data set involves an essential dereplication step to identify redundant spectra in a rapid manner and without sacrificing biological resolution. We describe SPeDE, a new algorithm which facilitates culture-dependent clinical or environmental studies. SPeDE enables the rapid analysis and dereplication of isolates, a critical feature when long-term storage of cultures is limited or not feasible. We show that SPeDE can efficiently identify sets of similar spectra at the level of the species or strain, exceeding the taxonomic resolution of other methods. The high-throughput capacity, speed, and low cost of MALDI-TOF mass spectrometry and SPeDE dereplication over traditional gene marker-based sequencing approaches should facilitate adoption of the culturomics approach to bacterial isolation campaigns.",
                "authors": [
                    {
                        "name": "Dumolin C."
                    },
                    {
                        "name": "Aerts M."
                    },
                    {
                        "name": "Verheyde B."
                    },
                    {
                        "name": "Schellaert S."
                    },
                    {
                        "name": "Vandamme T."
                    },
                    {
                        "name": "Van der Jeugt F."
                    },
                    {
                        "name": "De Canck E."
                    },
                    {
                        "name": "Cnockaert M."
                    },
                    {
                        "name": "Wieme A.D."
                    },
                    {
                        "name": "Cleenwerck I."
                    },
                    {
                        "name": "Peiren J."
                    },
                    {
                        "name": "Dawyndt P."
                    },
                    {
                        "name": "Vandamme P."
                    },
                    {
                        "name": "Carlier A."
                    }
                ],
                "citationCount": 4,
                "date": "2019-01-01T00:00:00Z",
                "journal": "mSystems",
                "title": "Introducing SPEDE: High-throughput dereplication and accurate determination of microbial diversity from matrix-assisted laser desorption–ionization time of flight mass spectrometry data"
            },
            "pmcid": "PMC6739102",
            "pmid": "31506264"
        }
    ],
    "topic": [
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        }
    ]
}