{
    "additionDate": "2021-01-18T11:30:00Z",
    "biotoolsCURIE": "biotools:disnep",
    "biotoolsID": "disnep",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "sw2206@columbia.edu",
            "name": "Shuang Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "The DiSNEP package implemented the Disease-Specific Network Enhancement Prioritization (DiSNEP) framework. The DiSNEP framework first enhances a comprehensive gene network specifically for a disease through a diffusion process on a gene-gene similarity matrix derived from a disease omics data. The enhanced disease-specific gene network thus better reflects true gene interactions for the disease and may improve prioritizing disease-associated genes subsequently.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression profile comparison",
                    "uri": "http://edamontology.org/operation_0315"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/pfruan/DiSNEP",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-01T09:30:39Z",
    "name": "DiSNEP",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAA241",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.Biological network-based strategies are useful in prioritizing genes associated with diseases. Several comprehensive human gene networks such as STRING, GIANT and HumanNet were developed and used in network-assisted algorithms to identify disease-associated genes. However, none of these networks are disease-specific and may not accurately reflect gene interactions for a specific disease. Aiming to improve disease gene prioritization using networks, we propose a Disease-Specific Network Enhancement Prioritization (DiSNEP) framework. DiSNEP first enhances a comprehensive gene network specifically for a disease through a diffusion process on a gene-gene similarity matrix derived from disease omics data. The enhanced disease-specific gene network thus better reflects true gene interactions for the disease and may improve prioritizing disease-associated genes subsequently. In simulations, DiSNEP that uses an enhanced disease-specific network prioritizes more true signal genes than comparison methods using a general gene network or without prioritization. Applications to prioritize cancer-associated gene expression and DNA methylation signal genes for five cancer types from The Cancer Genome Atlas (TCGA) project suggest that more prioritized candidate genes by DiSNEP are cancer-related according to the DisGeNET database than those prioritized by the comparison methods, consistently across all five cancer types considered, and for both gene expression and DNA methylation signal genes.",
                "authors": [
                    {
                        "name": "Ruan P."
                    },
                    {
                        "name": "Wang S."
                    }
                ],
                "date": "2021-07-20T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "DiSNEP: a Disease-Specific gene Network Enhancement to improve Prioritizing candidate disease genes"
            },
            "pmid": "33064143"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
