{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"https://www.zsl.org/about-us/contact-us"}],"documentation":[{"type":"GENERAL","url":"https://www.zsl.org/science/software/microerroranalyzer"}],"function":[{"operation":[{"term":"Nucleic acid sequence analysis","uri":"http://edamontology.org/operation_2478"},{"term":"Genotyping","uri":"http://edamontology.org/operation_3196"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Genotyping experiment","uri":"http://edamontology.org/topic_3516"},{"term":"Genetics","uri":"http://edamontology.org/topic_3053"},{"term":"DNA polymorphism","uri":"http://edamontology.org/topic_2885"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/microerroranalyzer-1-0-analyse-genotyping-errors-microsatellites-parentage-exclusion-analysis.html"}],"publication":[{"abstract":"Genetic markers are widely used to determine the parentage of individuals in studies of mating systems, reproductive success, dispersals, quantitative genetic parameters and in the management of conservation populations. These markers are, however, imperfect for parentage analyses because of the presence of genotyping errors and undetectable alleles, which may cause incompatible genotypes (mismatches) between parents and offspring and thus result in false exclusions of true parentage. Highly polymorphic markers widely used in parentage analyses, such as microsatellites, are especially prone to genotyping errors. In this investigation, I derived the probabilities of excluding a random (related) individual from parentage and the probabilities of Mendelian-inconsistent errors (mismatches) and Mendelian-consistent errors (which do not cause mismatches) in parent-offspring dyads, when a marker having null alleles, allelic dropouts and false alleles is used in a parentage analysis. These probabilities are useful in evaluating the impact of various types of genotyping errors on the information content of a set of markers in and thus the power of a parentage analysis, in determining the threshold number of genetic mismatches that is appropriate for a parentage exclusion analysis and in estimating the rates of genotyping errors and frequencies of null alleles from observed mismatches between known parent-offspring dyads. These applications are demonstrated by numerical examples using both hypothetical and empirical data sets and discussed in the context of practical parentage exclusion analyses. © 2010 Blackwell Publishing Ltd.","authors":["Wang J."],"cit_count":20,"journal":"Molecular Ecology","pmid":"20964757","title":"Effects of genotyping errors on parentage exclusion analysis","year":"2010-11-24"}],"summary":{"biotoolsCURIE":"biotools:microerroranalyzer","biotoolsID":"microerroranalyzer","description":"Computer program  for analysing the genotyping errors of microsatellites in parentage exclusion analysis.","homepage":"http://www.zsl.org/science/software/microerroranalyzer","name":"MicroErrorAnalyzer"}}