{
    "additionDate": "2021-03-19T08:28:15Z",
    "biotoolsCURIE": "biotools:isomirmap",
    "biotoolsID": "isomirmap",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "isidore.rigoutsos@jefferson.edu",
            "name": "Isidore Rigoutsos",
            "typeEntity": "Person"
        }
    ],
    "description": "IsoMiRmap-fast, deterministic, and exhaustive mining of isomiRs from short RNA-seq datasets.\n\n\nIsoMiRmap is an open source python application for the fast, deterministic, and exhaustive mining of isomiRs. The tool produces output in HTML, miRGFF3, and in tab-delimited formats.\n\nisoMiRmap is a miRNA and isomiRs mining tool that let's you quickly, exhaustively and deterministically map your dataset.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                }
            ]
        }
    ],
    "homepage": "https://cm.jefferson.edu/isoMiRmap/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-04-05T08:17:03Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/TJU-CMC-Org/isoMiRmap/"
        }
    ],
    "name": "isoMiRmap",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAB016",
            "metadata": {
                "abstract": "©The Author(s) 2021. Published by Oxford University Press.Motivation: MicroRNA (miRNA) precursor arms give rise to multiple isoforms simultaneously called 'isomiRs.' IsomiRs from the same arm typically differ by a few nucleotides at either their 50 or 30 termini or both. In humans, the identities and abundances of isomiRs depend on a person's sex and genetic ancestry as well as on tissue type, tissue state and disease type/subtype. Moreover, nearly half of the time the most abundant isomiR differs from the miRNA sequence found in public databases. Accurate mining of isomiRs from deep sequencing data is thus important. Results: We developed isoMiRmap, a fast, standalone, user-friendly mining tool that identifies and quantifies all isomiRs by directly processing short RNA-seq datasets. IsoMiRmap is a portable 'plug-and-play' tool, requires minimal setup, has modest computing and storage requirements, and can process an RNA-seq dataset with 50 million reads in just a few minutes on an average laptop. IsoMiRmap deterministically and exhaustively reports all isomiRs in a given deep sequencing dataset and quantifies them accurately (no double-counting). IsoMiRmap comprehensively reports all miRNA precursor locations from which an isomiR may be transcribed, tags as 'ambiguous' isomiRs whose sequences exist both inside and outside of the space of known miRNA sequences and reports the public identifiers of common single-nucleotide polymorphisms and documented somatic mutations that may be present in an isomiR. IsoMiRmap also identifies isomiRs with 3' non-templated post-transcriptional additions. Compared to similar tools, isoMiRmap is the fastest, reports more bona fide isomiRs, and provides the most comprehensive information related to an isomiR's transcriptional origin. Availability and implementation: The codes for isoMiRmap are freely available at https://cm.jefferson.edu/ isoMiRmap/ and https://github.com/TJU-CMC-Org/isoMiRmap/. IsomiR profiles for the datasets of the 1000 Genomes Project, spanning five population groups, and The Cancer Genome Atlas (TCGA), spanning 33 cancer studies, are also available at https://cm.jefferson.edu/isoMiRmap/.",
                "authors": [
                    {
                        "name": "Bray P.F."
                    },
                    {
                        "name": "Karathanasis N."
                    },
                    {
                        "name": "Loher P."
                    },
                    {
                        "name": "Londin E."
                    },
                    {
                        "name": "Pliatsika V."
                    },
                    {
                        "name": "Rigoutsos I."
                    },
                    {
                        "name": "Telonis A.G."
                    }
                ],
                "date": "2021-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "IsoMiRmap: Fast, deterministic and exhaustive mining of isomiRs from short RNA-seq datasets"
            },
            "pmid": "33471076"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
