{
    "additionDate": "2021-03-19T08:28:11Z",
    "biotoolsCURIE": "biotools:hivid2",
    "biotoolsID": "hivid2",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zengxi@mail.hzau.edu.cn",
            "name": "Xi Zeng",
            "typeEntity": "Person"
        },
        {
            "email": "michael_yifan@126.com",
            "name": "Linghao Zhao",
            "typeEntity": "Person"
        }
    ],
    "description": "An accurate tool to detect virus integrations in the host genome.\n\nAfter obtaining the integration sites, HIVID2 allows the user to decide whether to automatically perform advanced analysis using the identified virus integrations.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                },
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://github.com/zengxi-hada/HIVID2/",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2021-03-31T17:32:48Z",
    "name": "HIVID2",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAB031",
            "metadata": {
                "abstract": "© 2021 The Author(s) 2021. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: Virus integration in the host genome is frequently reported to be closely associated with many human diseases, and the detection of virus integration is a critically challenging task. However, most existing tools show limited specificity and sensitivity. Therefore, the objective of this study is to develop a method for accurate detection of virus integration into host genomes. Results: Herein, we report a novel method termed HIVID2 that is a significant upgrade of HIVID. HIVID2 performs a paired-end combination (PE-combination) for potentially integrated reads. The resulting sequences are then remapped onto the reference genomes, and both split and discordant chimeric reads are used to identify accurate integration breakpoints with high confidence. HIVID2 represents a great improvement in specificity and sensitivity, and predicts breakpoints closer to the real integrations, compared with existing methods. The advantage of our method was demonstrated using both simulated and real datasets. HIVID2 uncovered novel integration breakpoints in well-known cervical cancer-related genes, including FHIT and LRP1B, which was verified using protein expression data. In addition, HIVID2 allows the user to decide whether to automatically perform advanced analysis using the identified virus integrations. By analyzing the simulated data and real data tests, we demonstrated that HIVID2 is not only more accurate than HIVID but also better than other existing programs with respect to both sensitivity and specificity. We believe that HIVID2 will help in enhancing future research associated with virus integration. Availabilityand implementation: HIVID2 can be accessed at https://github.com/zengxi-hada/HIVID2/.",
                "authors": [
                    {
                        "name": "Zeng X."
                    },
                    {
                        "name": "Zhao L."
                    },
                    {
                        "name": "Shen C."
                    },
                    {
                        "name": "Zhou Y."
                    },
                    {
                        "name": "Li G."
                    },
                    {
                        "name": "Sung W.-K."
                    }
                ],
                "date": "2021-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "HIVID2: An accurate tool to detect virus integrations in the host genome"
            },
            "pmid": "33453108"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}