{
    "additionDate": "2018-06-27T18:13:11Z",
    "biotoolsCURIE": "biotools:hmmerctter",
    "biotoolsID": "hmmerctter",
    "collectionID": [
        "HMMER"
    ],
    "credit": [
        {
            "email": "atenhave@mdp.edu.ar",
            "name": "Arjen ten Have",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Supervised classification of superfamily protein sequences with a reliable cut-off threshold.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/BBCMdP/HMMERCTTER/blob/master/Manual/HMMERCTTER_Manual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                },
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BBCMdP/HMMERCTTER",
    "language": [
        "C"
    ],
    "lastUpdate": "2019-03-13T13:01:24Z",
    "name": "HMMERCTTER",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0193757",
            "metadata": {
                "abstract": "© 2018 Pagnuco et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Background Protein superfamilies can be divided into subfamilies of proteins with different functional characteristics. Their sequences can be classified hierarchically, which is part of sequence function assignation. Typically, there are no clear subfamily hallmarks that would allow pattern-based function assignation by which this task is mostly achieved based on the similarity principle. This is hampered by the lack of a score cut-off that is both sensitive and specific. Results HMMER Cut-off Threshold Tool (HMMERCTTER) adds a reliable cut-off threshold to the popular HMMER. Using a high quality superfamily phylogeny, it clusters a set of training sequences such that the cluster-specific HMMER profiles show cluster or subfamily member detection with 100% precision and recall (P&R), thereby generating a specific threshold as inclusion cut-off. Profiles and thresholds are then used as classifiers to screen a target dataset. Iterative inclusion of novel sequences to groups and the corresponding HMMER profiles results in high sensitivity while specificity is maintained by imposing 100% P&R self detection. In three presented case studies of protein superfamilies, classification of large datasets with 100% precision was achieved with over 95% recall. Limits and caveats are presented and explained. Conclusions HMMERCTTER is a promising protein superfamily sequence classifier provided high quality training datasets are used. It provides a decision support system that aids in the difficult task of sequence function assignation in the twilight zone of sequence similarity. All relevant data and source codes are available from the Github repository at the following URL: https:// github.com/BBCMdP/HMMERCTTER.",
                "authors": [
                    {
                        "name": "Bondino H.G."
                    },
                    {
                        "name": "Brun M."
                    },
                    {
                        "name": "Pagnuco I.A."
                    },
                    {
                        "name": "Revuelta M.V."
                    },
                    {
                        "name": "Ten Have A."
                    }
                ],
                "citationCount": 6,
                "date": "2018-03-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "HMMER cut-off threshold tool (HMMERCTTER): Supervised classification of superfamily protein sequences with a reliable cut-off threshold"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}
