{
    "accessibility": "Open access",
    "additionDate": "2023-02-15T12:11:47.004249Z",
    "biotoolsCURIE": "biotools:poagnet",
    "biotoolsID": "poagnet",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "yip4002@med.cornell.edu",
            "name": "Yifan Peng",
            "typeEntity": "Person"
        },
        {
            "name": "Lei Liu PhD"
        },
        {
            "name": "Sarah H. Van Tassel MD"
        },
        {
            "name": "Mingquan Lin PhD",
            "orcidid": "https://orcid.org/0000-0003-0862-6588"
        }
    ],
    "description": "Primary Open-Angle Glaucoma Diagnosis from Optic Disc Photographs Using a Siamese Network.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bionlplab/poagnet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:00:46.564152Z",
    "license": "BSD-3-Clause",
    "name": "POAGNet",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/j.xops.2022.100209",
            "metadata": {
                "abstract": "Purpose: Primary open-angle glaucoma (POAG) is one of the leading causes of irreversible blindness in the United States and worldwide. Although deep learning methods have been proposed to diagnose POAG, these methods all used a single image as input. Contrastingly, glaucoma specialists typically compare the follow-up image with the baseline image to diagnose incident glaucoma. To simulate this process, we proposed a Siamese neural network, POAGNet, to detect POAG from optic disc photographs. Design: The POAGNet, an algorithm for glaucoma diagnosis, is developed using optic disc photographs. Participants: The POAGNet was trained and evaluated on 2 data sets: (1) 37 339 optic disc photographs from 1636 Ocular Hypertension Treatment Study (OHTS) participants and (2) 3684 optic disc photographs from the Sequential fundus Images for Glaucoma (SIG) data set. Gold standard labels were obtained using reading center grades. Methods: We proposed a Siamese network model, POAGNet, to simulate the clinical process of identifying POAG from optic disc photographs. The POAGNet consists of 2 side outputs for deep supervision and uses convolution to measure the similarity between 2 networks. Main Outcome Measures: The main outcome measures are the area under the receiver operating characteristic curve, accuracy, sensitivity, and specificity. Results: In POAG diagnosis, extensive experiments show that POAGNet performed better than the best state-of-the-art model on the OHTS test set (area under the curve [AUC] 0.9587 versus 0.8750). It also outperformed the baseline models on the SIG test set (AUC 0.7518 versus 0.6434). To assess the transferability of POAGNet, we also validated the impact of cross-data set variability on our model. The model trained on OHTS achieved an AUC of 0.7490 on SIG, comparable to the previous model trained on the same data set. When using the combination of SIG and OHTS for training, our model achieved superior AUC to the single-data model (AUC 0.8165 versus 0.7518). These demonstrate the relative generalizability of POAGNet. Conclusions: By simulating the clinical grading process, POAGNet demonstrated high accuracy in POAG diagnosis. These results highlight the potential of deep learning to assist and enhance clinical POAG diagnosis. The POAGNet is publicly available on https://github.com/bionlplab/poagnet.",
                "authors": [
                    {
                        "name": "Gordon M."
                    },
                    {
                        "name": "Kass M."
                    },
                    {
                        "name": "Lin M."
                    },
                    {
                        "name": "Liu L."
                    },
                    {
                        "name": "Peng Y."
                    },
                    {
                        "name": "Van Tassel S.H."
                    },
                    {
                        "name": "Wang F."
                    }
                ],
                "citationCount": 5,
                "date": "2022-12-01T00:00:00Z",
                "journal": "Ophthalmology Science",
                "title": "Primary Open-Angle Glaucoma Diagnosis From Optic Disc Photographs Using a Siamese Network"
            },
            "pmcid": "PMC9754976",
            "pmid": "36531584"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ]
}
