{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2020-01-30T13:54:45Z",
    "biotoolsCURIE": "biotools:PhylomeDB",
    "biotoolsID": "PhylomeDB",
    "collectionID": [
        "IMPaCT-Data"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "email": "toni.gabaldon@bsc.es",
            "name": "Toni Gabaldón",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "PhylomeDB is a public database for complete catalogs of gene phylogenie. It allows users to interactively explore the evolutionary history of genes through the visualization of phylogenetic trees and multiple sequence alignments. Moreover, phylomeDB provides genome-wide orthology and paralogy predictions which are based on the analysis of the phylogenetic trees. The automated pipeline used to reconstruct trees aims at providing a high-quality phylogenetic analysis of different genomes, including Maximum Likelihood tree inference, alignment trimming and evolutionary model testing.",
    "documentation": [
        {
            "note": "http://phylomedb.org/about",
            "type": [
                "Citation instructions"
            ],
            "url": "http://phylomedb.org/about"
        },
        {
            "type": [
                "FAQ"
            ],
            "url": "http://phylomedb.org/faq"
        },
        {
            "type": [
                "General"
            ],
            "url": "http://phylomedb.org/help"
        }
    ],
    "download": [
        {
            "type": "Biological data",
            "url": "ftp://phylomedb.org/phylomedb/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic reconstruction",
                    "uri": "http://edamontology.org/operation_3478"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Species tree construction",
                    "uri": "http://edamontology.org/operation_0544"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Tree-based sequence alignment",
                    "uri": "http://edamontology.org/operation_0499"
                }
            ]
        }
    ],
    "homepage": "http://phylomeDB.org",
    "language": [
        "JavaScript",
        "PHP",
        "Python"
    ],
    "lastUpdate": "2022-02-17T15:44:23.047140Z",
    "license": "Other",
    "maturity": "Mature",
    "name": "PhylomeDB",
    "operatingSystem": [
        "Linux"
    ],
    "otherID": [
        {
            "type": "biotoolsCURIE",
            "value": "biotools:phylomedb_v3.0",
            "version": "3.0"
        },
        {
            "value": "biotools:phylomedb_v3.0",
            "version": "3.0"
        }
    ],
    "owner": "Gabaldonlab",
    "publication": [
        {
            "doi": "10.1093/nar/gkm899",
            "metadata": {
                "abstract": "The complete collection of evolutionary histories of all genes in a genome, also known as phylome, constitutes a valuable source of information. The reconstruction of phylomes has been previously prevented by large demands of time and computer power, but is now feasible thanks to recent developments in computers and algorithms. To provide a publicly available repository of complete phylomes that allows researchers to access and store large-scale phylogenomic analyses, we have developed PhylomeDB. PhylomeDB is a database of complete phylomes derived for different genomes within a specific taxonomic range. All phylomes in the database are built using a high-quality phylogenetic pipeline that includes evolutionary model testing and alignment trimming phases. For each genome, PhylomeDB provides the alignments, phylogentic trees and tree-based orthology predictions for every single encoded protein. The current version of PhylomeDB includes the phylomes of Human, the yeast Saccharomyces cerevisiae and the bacterium Escherichia coli, comprising a total of 32 289 seed sequences with their corresponding alignments and 172 324 phylogenetic trees. PhylomeDB can be publicly accessed at http://phylomedb.bioinfo.cipf.es. © 2007 The Author(s).",
                "authors": [
                    {
                        "name": "Bueno A."
                    },
                    {
                        "name": "Dopazo J."
                    },
                    {
                        "name": "Gabaldon T."
                    },
                    {
                        "name": "Huerta-Cepas J."
                    }
                ],
                "citationCount": 79,
                "date": "2008-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PhylomeDB: A database for genome-wide collections of gene phylogenies"
            },
            "pmcid": "PMC2238872",
            "pmid": "17962297",
            "version": "V1"
        },
        {
            "doi": "10.1093/nar/gkq1109",
            "metadata": {
                "abstract": "The growing availability of complete genomic sequences from diverse species has brought about the need to scale up phylogenomic analyses, including the reconstruction of large collections of phylogenetic trees. Here, we present the third version of PhylomeDB (http://phylomeDB.org), a public database for genome-wide collections of gene phylogenies (phylomes). Currently, PhylomeDB is the largest phylogenetic repository and hosts 17 phylomes, comprising 416 093 trees and 165 840 alignments. It is also a major source for phylogeny-based orthology and paralogy predictions, covering about 5 million proteins in 717 fully-sequenced genomes. For each protein-coding gene in a seed genome, the database provides original and processed alignments, phylogenetic trees derived from various methods and phylogeny-based predictions of orthology and paralogy relationships. The new version of phylomeDB has been extended with novel data access and visualization features, including the possibility of programmatic access. Available seed species include model organisms such as human, yeast, Escherichia coli or Arabidopsis thaliana, but also alternative model species such as the human pathogen Candida albicans, or the pea aphid Acyrtosiphon pisum. Finally, PhylomeDB is currently being used by several genome sequencing projects that couple the genome annotation process with the reconstruction of the corresponding phylome, a strategy that provides relevant evolutionary insights. © The Author(s) 2010.",
                "authors": [
                    {
                        "name": "Capella-Gutierrez S."
                    },
                    {
                        "name": "Denisov I."
                    },
                    {
                        "name": "Gabaldon T."
                    },
                    {
                        "name": "Huerta-Cepas J."
                    },
                    {
                        "name": "Kormes D."
                    },
                    {
                        "name": "Marcet-Houben M."
                    },
                    {
                        "name": "Pryszcz L.P."
                    }
                ],
                "citationCount": 117,
                "date": "2011-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PhylomeDB v3.0: An expanding repository of genome-wide collections of trees, alignments and phylogeny-based orthology and paralogy predictions"
            },
            "pmcid": "PMC3013701",
            "pmid": "21075798",
            "version": "V3"
        },
        {
            "doi": "10.1093/nar/gkt1177",
            "metadata": {
                "abstract": "Phylogenetic trees representing the evolutionary relationships of homologous genes are the entry point for many evolutionary analyses. For instance, the use of a phylogenetic tree can aid in the inference of orthology and paralogy relationships, and in the detection of relevant evolutionary events such as gene family expansions and contractions, horizontal gene transfer, recombination or incomplete lineage sorting. Similarly, given the plurality of evolutionary histories among genes encoded in a given genome, there is a need for the combined analysis of genome-wide collections of phylogenetic trees (phylomes). Here, we introduce a new release of PhylomeDB (http://phylomedb.org) , a public repository of phylomes. Currently, PhylomeDB hosts 120 public phylomes, comprising >1.5 million maximum likelihood trees and multiple sequence alignments. In the current release, phylogenetic trees are annotated with taxonomic, protein-domain arrangement, functional and evolutionary information. PhylomeDB is also a major source for phylogeny-based predictions of orthology and paralogy, covering >10 million proteins across 1059 sequenced species. Here we describe newly implemented PhylomeDB features, and discuss a benchmark of the orthology predictions provided by the database, the impact of proteome updates and the use of the phylome approach in the analysis of newly sequenced genomes and transcriptomes. © 2013 The Author(s). Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Capella-Gutierrez S."
                    },
                    {
                        "name": "Gabaldon T."
                    },
                    {
                        "name": "Huerta-Cepas J."
                    },
                    {
                        "name": "Marcet-Houben M."
                    },
                    {
                        "name": "Pryszcz L.P."
                    }
                ],
                "citationCount": 152,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PhylomeDB v4: Zooming into the plurality of evolutionary histories of a genome"
            },
            "pmcid": "PMC3964985",
            "pmid": "24275491",
            "version": "V4"
        },
        {
            "doi": "10.1093/nar/gkab966",
            "note": "Current main publication",
            "pmcid": "PMC8728271",
            "pmid": "34718760",
            "version": "V5"
        }
    ],
    "relation": [
        {
            "biotoolsID": "metaphors",
            "type": "uses"
        },
        {
            "biotoolsID": "uniprotkb",
            "type": "usedBy"
        },
        {
            "biotoolsID": "uniprotkb",
            "type": "uses"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Phylogenomics",
            "uri": "http://edamontology.org/topic_0194"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        }
    ],
    "validated": 1,
    "version": [
        "5.0"
    ]
}
