{
    "additionDate": "2021-01-18T08:48:15Z",
    "biotoolsCURIE": "biotools:subhmm",
    "biotoolsID": "subhmm",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "bin.zhu@nih.gov",
            "name": "Bin Zhu",
            "typeEntity": "Person"
        }
    ],
    "description": "A hidden Markov modeling approach for identifying tumor subclones in next-generation sequencing studies.\n\nModel for Identifying Tumor Subclones R Package.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'subHMM hidden Markov model-based'",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Copy number estimation",
                    "uri": "http://edamontology.org/operation_3233"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                },
                {
                    "term": "Sequence profile generation",
                    "uri": "http://edamontology.org/operation_0296"
                }
            ]
        }
    ],
    "homepage": "https://dceg.cancer.gov/tools/analysis/subhmm",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T20:41:53.984652Z",
    "name": "subHMM",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/biostatistics/kxaa013",
            "metadata": {
                "abstract": "Allele-specific copy number alteration (ASCNA) analysis is for identifying copy number abnormalities in tumor cells. Unlike normal cells, tumor cells are heterogeneous as a combination of dominant and minor subclones with distinct copy number profiles. Estimating the clonal proportion and identifying mainclone and subclone genotypes across the genome are important for understanding tumor progression. Several ASCNA tools have recently been developed, but they have been limited to the identification of subclone regions, and not the genotype of subclones. In this article, we propose subHMM, a hidden Markov model-based approach that estimates both subclone region and region-specific subclone genotype and clonal proportion. We specify a hidden state variable representing the conglomeration of clonal genotype and subclone status. We propose a two-step algorithm for parameter estimation, where in the first step, a standard hidden Markov model with this conglomerated state variable is fit. Then, in the second step, region-specific estimates of the clonal proportions are obtained by maximizing region-specific pseudo-likelihoods. We apply subHMM to study renal cell carcinoma datasets in The Cancer Genome Atlas. In addition, we conduct simulation studies that show the good performance of the proposed approach. The R source code is available online at https://dceg.cancer.gov/tools/analysis/subhmm. Expectation-Maximization algorithm; Forward-backward algorithm; Somatic copy number alteration; Tumor subclones.",
                "authors": [
                    {
                        "name": "Albert P.S."
                    },
                    {
                        "name": "Choo-Wosoba H."
                    },
                    {
                        "name": "Zhu B."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Biostatistics",
                "title": "A hidden Markov modeling approach for identifying tumor subclones in next-generation sequencing studies"
            },
            "pmcid": "PMC9119345",
            "pmid": "32282873"
        }
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
