{
    "additionDate": "2021-03-19T09:01:44Z",
    "biotoolsCURIE": "biotools:cmm",
    "biotoolsID": "cmm",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "weiwu2@cs.cmu.edu",
            "name": "Wei Wu",
            "typeEntity": "Person"
        },
        {
            "email": "epxing@cs.cmu.edu",
            "name": "Eric P. Xing",
            "typeEntity": "Person"
        }
    ],
    "description": "CMM (Coupled Mixed Model) is used to simulnateously conduct genetic analysis for independently collected data sets of different related phenotypes. CMM aims to achieve this goal by inferring all the information enclosed by dashed lines in the following figure.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Service management",
                    "uri": "http://edamontology.org/operation_3760"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                }
            ]
        }
    ],
    "homepage": "https://github.com/HaohanWang/CMM",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-04-26T08:06:48Z",
    "license": "MIT",
    "name": "CMM",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-021-03959-2",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: In the last decade, Genome-wide Association studies (GWASs) have contributed to decoding the human genome by uncovering many genetic variations associated with various diseases. Many follow-up investigations involve joint analysis of multiple independently generated GWAS data sets. While most of the computational approaches developed for joint analysis are based on summary statistics, the joint analysis based on individual-level data with consideration of confounding factors remains to be a challenge. Results: In this study, we propose a method, called Coupled Mixed Model (CMM), that enables a joint GWAS analysis on two independently collected sets of GWAS data with different phenotypes. The CMM method does not require the data sets to have the same phenotypes as it aims to infer the unknown phenotypes using a set of multivariate sparse mixed models. Moreover, CMM addresses the confounding variables due to population stratification, family structures, and cryptic relatedness, as well as those arising during data collection such as batch effects that frequently appear in joint genetic studies. We evaluate the performance of CMM using simulation experiments. In real data analysis, we illustrate the utility of CMM by an application to evaluating common genetic associations for Alzheimer’s disease and substance use disorder using datasets independently collected for the two complex human disorders. Comparison of the results with those from previous experiments and analyses supports the utility of our method and provides new insights into the diseases. The software is available at https://github.com/HaohanWang/CMM.",
                "authors": [
                    {
                        "name": "Wang H."
                    },
                    {
                        "name": "Pei F."
                    },
                    {
                        "name": "Vanyukov M.M."
                    },
                    {
                        "name": "Bahar I."
                    },
                    {
                        "name": "Wu W."
                    },
                    {
                        "name": "Xing E.P."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Coupled mixed model for joint genetic analysis of complex disorders with two independently collected data sets"
            },
            "pmcid": "PMC7866684",
            "pmid": "33546598"
        },
        {
            "doi": "10.1016/J.SAPHARM.2021.01.006",
            "metadata": {
                "abstract": "© 2021 Elsevier Inc.Background: Comprehensive medication management (CMM) is a clinical service based on the theoretical and methodological framework of pharmaceutical care. Service blueprint is one of the most widespread visual tools of service design. It enables description of the processes involved in service provision that ultimately define patient experience. Although studies have shown the clinical, humanistic and economic benefits of CMM, its provision still involves several challenges, which can be minimized with the proper mapping of this service. However, this initiative has not yet been described in the literature using this specific tool. Objectives: To develop, apply and improve a blueprint for CMM services delivered in the ambulatory setting. Methods: This qualitative study was organized in two phases. In phase 1, two expert panels were carried out to jointly create a generic service blueprint-model for CMM on ambulatory care involving nine specialists with diverse experiences in the area. In phase 2, the generic model was applied and improved in a public rheumatology clinic. The outcome of phase 2 was defined as the final generic service blueprint-model for CMM in the ambulatory setting. Results: The final generic blueprint-model created has 21 customer actions, of which 2 are considered critical (with great potential for failure and to compromise the patient's experience with the service): “seeking and accepting the service invitation” and “accepting the care plan co-created with the pharmacist”. Fifteen backstage actions (without the patient's awareness) were identified, and the most critical occurred in the post-service, such as collection of indicators. The need for 7 support processes was also identified, and 3 of which were critical. Nineteen physical pieces of evidence for the user of CMM service were defined, with consultation room as the only physical piece of evidence considered critical. Conclusions: The developed service blueprint can improve the patient's experience with CMM and facilitate communication with decision makers and other stakeholders. The model is proposed as a reference that can be customized to different ambulatory care settings.",
                "authors": [
                    {
                        "name": "Silva H.M."
                    },
                    {
                        "name": "Gonzaga do Nascimento M.M."
                    },
                    {
                        "name": "de Morais Neves C."
                    },
                    {
                        "name": "Oliveira I.V."
                    },
                    {
                        "name": "Cipolla C.M."
                    },
                    {
                        "name": "Batista de Oliveira G.C."
                    },
                    {
                        "name": "de Almeida Nascimento Y."
                    },
                    {
                        "name": "Ramalho de Oliveira D."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Research in Social and Administrative Pharmacy",
                "title": "Service blueprint of comprehensive medication management: A mapping for outpatient clinics"
            },
            "pmid": "33558157"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Musculoskeletal medicine",
            "uri": "http://edamontology.org/topic_3416"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        }
    ]
}