
{
    "credit": [
        {
            "email": "bmorgen@gwdg.de",
            "name": "Prof. Dr. Burkhard Morgenstern",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.gobics.de/burkhard/index.php"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://dialign.gobics.de/chaos-dialign-submission"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Pairwise sequence alignment",
                    "uri": "http://edamontology.org/operation_0491"
                },
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                },
                {
                    "term": "Local alignment",
                    "uri": "http://edamontology.org/operation_0495"
                },
                {
                    "term": "Global alignment",
                    "uri": "http://edamontology.org/operation_0496"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Gene transcripts",
                "uri": "http://edamontology.org/topic_3512"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Cross-species sequence comparison is a powerful approach to analyze functional sites in genomic sequences and many discoveries have been made based on genomic alignments. Herein, we present a WWW-based software system for multiple alignment of large genomic sequences. Our server utilizes the previously developed combination of CHAOS and DIALIGN to achieve both speed and alignment accuracy. CHAOS is a fast database search tool that creates a list of local sequence similarities. These are used by DIALIGN as anchor points to speed up the final alignment procedure. The resulting alignment is returned to the user in different formats together with a list of anchor points found by CHAOS. The CHAOS/DIALIGN software is freely available at http://dialign.gobics.de/chaos-dialign-submission. © Oxford University Press 2004; all rights reserved.",
            "authors": [
                "Brudno M.",
                "Steinkamp R.",
                "Morgenstern B."
            ],
            "cit_count": 49,
            "journal": "Nucleic Acids Research",
            "pmid": "15215346",
            "title": "The CHAOS/DIALIGN WWW server for multiple alignment of genomic sequences",
            "year": "2004-07-01"
        },
        {
            "abstract": "Background: Genomic sequence alignment is a powerful method for genome analysis and annotation, as alignments are routinely used to identify functional sites such as genes or regulatory elements. With a growing number of partially or completely sequenced genomes, multiple alignment is playing an increasingly important role in these studies. In recent years, various tools for pair-wise and multiple genomic alignment have been proposed. Some of them are extremely fast, but often efficiency is achieved at the expense of sensitivity. One way of combining speed and sensitivity is to use an anchored-alignment approach. In a first step, a fast search program identifies a chain of strong local sequence similarities. In a second step, regions between these anchor points are aligned using a slower but more accurate method. Results: Herein, we present CHAOS, a novel algorithm for rapid identification of chains of local pair-wise sequence similarities. Local alignments calculated by CHAOS are used as anchor points to improve the running time of DIALIGN, a slow but sensitive multiple-alignment tool. We show that this way, the running time of DIALIGN can be reduced by more than 95% for BAC-sized and longer sequences, without affecting the quality of the resulting alignments. We apply our approach to a set of five genomic sequences around the stem-cell-leukemia (SCL) gene and demonstrate that exons and small regulatory elements can be identified by our multiple-alignment procedure. Conclusion: We conclude that the novel CHAOS local alignment tool is an effective way to significantly speed up global alignment tools such as DIALIGN without reducing the alignment quality. We likewise demonstrate that the DIALIGN/CHAOS combination is able to accurately align short regulatory sequences in distant orthologues. © 2003 Brudno et al; licensee BioMed Central Ltd.",
            "authors": [
                "Brudno M.",
                "Chapman M.",
                "Gottgens B.",
                "Batzoglou S.",
                "Morgenstern B."
            ],
            "cit_count": 112,
            "journal": "BMC Bioinformatics",
            "pmid": "14693042",
            "title": "Fast and sensitive multiple alignment of large genomic sequences",
            "year": "2003-12-23"
        },
        {
            "abstract": "Comparative analysis of genomic sequences is a powerful approach to discover functional sites in these sequences. Herein, we present a WWW-based software system for multiple alignment of genomic sequences. We use the local alignment tool CHAOS to rapidly identify chains of pairwise similarities. These similarities are used as anchor points to speed up the DIALIGN multiple-alignment program. Finally, the visualization tool ABC is used for interactive graphical representation of the resulting multiple alignments. Our software is available at Göttingen Bioinformatics Compute Server (GOBICS) at http:// dialign.gobics.de/chaos-dialign-submission. © 2005 Oxford University Press.",
            "authors": [
                "Pohler D.",
                "Werner N.",
                "Steinkamp R.",
                "Morgenstern B."
            ],
            "cit_count": 10,
            "journal": "Nucleic Acids Research",
            "pmid": "15980528",
            "title": "Multiple alignment of genomic sequences using CHAOS, DIALIGN and ABC",
            "year": "2005-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:chaos_dialign",
        "biotoolsID": "chaos_dialign",
        "description": "The CHAOS/DIALIGN WWW server is a multiple sequence alignment site which passes input sequences through CHAOS to create a list of local similarites. These similarities serve as anchor points, allowing DIALIGN to conduct global alignments faster. ABC can then be used for the interactive visualization of the alignment.",
        "homepage": "http://dialign.gobics.de/chaos-dialign-submission",
        "name": "CHAOS DIALIGN WWW server"
    }
}