{
    "additionDate": "2021-01-18T09:51:55Z",
    "biotoolsCURIE": "biotools:pdxgem",
    "biotoolsID": "pdxgem",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Youngchul.kim@moffitt.org",
            "name": "Youngchul Kim",
            "orcidid": "https://orcid.org/0000-0002-2307-0330",
            "typeEntity": "Person"
        }
    ],
    "description": "PDX based Multi-gene Expression Model for predicting cancer patient's response to anti-cancer drug.\n\nPDXGEM – multi-gene expression model.\n\nPDXGEM is a statistical genomics and bioinformatics pipeline to build a multi-gene expression model for predicting responses of cancer patients to anti-cancer therapeutics on the basis of data on mRNA expression profiles and drug-sensitivity of Patient-Derived tumor Xenograft models (PDXs).\n\nPDXGEM is a statistical bioinformatics and pharmacognomics pipeline to build a multi-gene expression model for predicting responses of cancer patients to anti-cancer therapeutics on the basis of data on mRNA expression profiles and drug-sensitivity of Patient-Derived tumor Xenograft models (PDXs).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                }
            ]
        }
    ],
    "homepage": "http://pdxgem.moffitt.org",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-23T07:38:18Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://pdxgem.moffitt.org/publications"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "http://github.com/ykim5g/PDXGEM"
        }
    ],
    "name": "PDXGEM",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03633-Z",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Cancer is a highly heterogeneous disease with varying responses to anti-cancer drugs. Although several attempts have been made to predict the anti-cancer therapeutic responses, there remains a great need to develop highly accurate prediction models of response to the anti-cancer drugs for clinical applications toward a personalized medicine. Patient derived xenografts (PDXs) are preclinical cancer models in which the tissue or cells from a patient's tumor are implanted into an immunodeficient or humanized mouse. In the present study, we develop a bioinformatics analysis pipeline to build a predictive gene expression model (GEM) for cancer patients' drug responses based on gene expression and drug activity data from PDX models. Results: Drug sensitivity biomarkers were identified by performing an association analysis between gene expression levels and post-treatment tumor volume changes in PDX models. We built a drug response prediction model (called PDXGEM) in a random-forest algorithm by using a subset of the drug sensitvity biomarkers with concordant co-expression patterns between the PDXs and pretreatment cancer patient tumors. We applied the PDXGEM to several cytotoxic chemotherapies as well as targeted therapy agents that are used to treat breast cancer, pancreatic cancer, colorectal cancer, or non-small cell lung cancer. Significantly accurate predictions of PDXGEM for pathological response or survival outcomes were observed in extensive independent validations on multiple cancer patient datasets obtained from retrospective observational studies and prospective clinical trials. Conclusion: Our results demonstrated the strong potential of using molecular profiles and drug activity data of PDX tumors in developing a clinically translatable predictive cancer biomarkers for cancer patients. The PDXGEM web application is publicly available at http://pdxgem.moffitt.org.",
                "authors": [
                    {
                        "name": "Kim Y."
                    },
                    {
                        "name": "Kim D."
                    },
                    {
                        "name": "Cao B."
                    },
                    {
                        "name": "Carvajal R."
                    },
                    {
                        "name": "Kim M."
                    }
                ],
                "citationCount": 2,
                "date": "2020-07-06T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "PDXGEM: Patient-derived tumor xenograft-based gene expression model for predicting clinical response to anticancer therapy in cancer patients"
            },
            "pmcid": "PMC7336455",
            "pmid": "32631229"
        }
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pharmacogenomics",
            "uri": "http://edamontology.org/topic_0208"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        }
    ],
    "validated": 1
}