{
    "additionDate": "2017-01-13T13:15:10Z",
    "biotoolsCURIE": "biotools:jointslm",
    "biotoolsID": "jointslm",
    "credit": [
        {
            "email": "albertomagi@gmail.com",
            "name": "Alberto Magi",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Copy number estimation from read depth information.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Copy number estimation",
                    "uri": "http://edamontology.org/operation_3233"
                }
            ]
        }
    ],
    "homepage": "https://github.com/inutano/docker-ngs-tools/tree/master/JointSLM",
    "homepage_status": 1,
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "JointSLM",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "metadata": {
                "abstract": "The discovery of genomic structural variants (SVs), such as copy number variants (CNVs), is essential to understand genetic variation of human populations and complex diseases. Over recent years, the advent of new high-throughput sequencing (HTS) platforms has opened many opportunities for SVs discovery, and a very promising approach consists in measuring the depth of coverage (DOC) of reads aligned to the human reference genome. At present, few computational methods have been developed for the analysis of DOC data and all of these methods allow to analyse only one sample at time. For these reasons, we developed a novel algorithm (JointSLM) that allows to detect common CNVs among individuals by analysing DOC data from multiple samples simultaneously. We test JointSLM performance on synthetic and real data and we show its unprecedented resolution that enables the detection of recurrent CNV regions as small as 500bp in size. When we apply JointSLM to analyse chromosome one of eight genomes with different ancestry, we identify 3000 regions with recurrent CNVs of different frequency and size: hierarchical clustering on these regions segregates the eight individuals in two groups that reflect their ancestry, demonstrating the potential utility of JointSLM for population genetics studies. © 2011 The Author(s).",
                "authors": [
                    {
                        "name": "Magi A."
                    },
                    {
                        "name": "Benelli M."
                    },
                    {
                        "name": "Yoon S."
                    },
                    {
                        "name": "Roviello F."
                    },
                    {
                        "name": "Torricelli F."
                    }
                ],
                "citationCount": 50,
                "date": "2011-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Detecting common copy number variants in high-throughput sequencing data by using JointSLM algorithm"
            },
            "pmid": "21321017"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "DNA structural variation",
            "uri": "http://edamontology.org/topic_3175"
        }
    ],
    "validated": 1
}