{
    "additionDate": "2017-08-03T18:46:17Z",
    "biotoolsCURIE": "biotools:hapmuc",
    "biotoolsID": "hapmuc",
    "credit": [
        {
            "email": "usuyama@hgc.jp",
            "name": "Naoto Usuyama",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Somatic mutation caller, which can utilize the information of heterozygous germline variants near candidate mutations.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/usuyama/hapmuc/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Polymorphism detection",
                    "uri": "http://edamontology.org/operation_3202"
                }
            ]
        }
    ],
    "homepage": "https://github.com/usuyama/hapmuc",
    "language": [
        "Ruby",
        "C++",
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/hapmuc-1-0-somatic-mutation-caller.html"
        }
    ],
    "name": "HapMuC",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© The Author 2014. Published by Oxford University Press.Motivation: Identifying somatic changes from tumor and matched normal sequences has become a standard approach in cancer research. More specifically, this requires accurate detection of somatic point mutations with low allele frequencies in impure and heterogeneous cancer samples. Although haplotype phasing information derived by using heterozygous germ line variants near candidate mutations would improve accuracy, no somatic mutation caller that uses such information is currently available. Results: We propose a Bayesian hierarchical method, termed HapMuC, in which power is increased by using available information on heterozygous germ line variants located near candidate mutations. We first constructed two generative models (the mutation model and the error model). In the generative models, we prepared candidate haplotypes, considering a heterozygous germ line variant if available, and the observed reads were realigned to the haplotypes. We then inferred the haplotype frequencies and computed the marginal likelihoods using a variational Bayesian algorithm. Finally, we derived a Bayes factor for evaluating the possibility of the existence of somatic mutations. We also demonstrated that our algorithm has superior specificity and sensitivity compared with existing methods, as determined based on a simulation, the TCGA Mutation Calling Benchmark 4 datasets and data from the COLO-829 cell line.",
                "authors": [
                    {
                        "name": "Usuyama N."
                    },
                    {
                        "name": "Shiraishi Y."
                    },
                    {
                        "name": "Sato Y."
                    },
                    {
                        "name": "Kume H."
                    },
                    {
                        "name": "Homma Y."
                    },
                    {
                        "name": "Ogawa S."
                    },
                    {
                        "name": "Miyano S."
                    },
                    {
                        "name": "Imoto S."
                    }
                ],
                "citationCount": 16,
                "date": "2014-12-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "HapMuC: Somatic mutation calling using heterozygous germ line variants near candidate mutations"
            },
            "pmid": "25123903"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA mutation",
            "uri": "http://edamontology.org/topic_2533"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1
}