{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:12:11Z",
    "biotoolsCURIE": "biotools:SleepEEGNet",
    "biotoolsID": "SleepEEGNet",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "SajadMousavi@nau.edu",
            "name": "Sajad Mousavi",
            "orcidid": "https://orcid.org/0000-0002-3806-8487",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Automated sleep stage scoring with sequence to sequence deep learning approach.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/SajadMo/SleepEEGNet/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/SajadMo/SleepEEGNet",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2020-06-16T10:55:26Z",
    "license": "Unlicense",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/SajadMo/SleepEEGNet/issues"
        }
    ],
    "maturity": "Mature",
    "name": "SleepEEGNet",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0216456",
            "metadata": {
                "abstract": "Copyright: © 2019 Mousavi et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Electroencephalogram (EEG) is a common base signal used to monitor brain activities and diagnose sleep disorders. Manual sleep stage scoring is a time-consuming task for sleep experts and is limited by inter-rater reliability. In this paper, we propose an automatic sleep stage annotation method called SleepEEGNet using a single-channel EEG signal. The SleepEEGNet is composed of deep convolutional neural networks (CNNs) to extract time-invariant features, frequency information, and a sequence to sequence model to capture the complex and long short-term context dependencies between sleep epochs and scores. In addition, to reduce the effect of the class imbalance problem presented in the available sleep datasets, we applied novel loss functions to have an equal misclassified error for each sleep stage while training the network. We evaluated the performance of the proposed method on different single-EEG channels (i.e., Fpz-Cz and Pz-Oz EEG channels) from the Physionet Sleep-EDF datasets published in 2013 and 2018. The evaluation results demonstrate that the proposed method achieved the best annotation performance compared to current literature, with an overall accuracy of 84.26%, a macro F1-score of 79.66% and κ = 0.79. Our developed model can be applied to other sleep EEG signals and aid the sleep specialists to arrive at an accurate diagnosis. The source code is available at https://github.com/SajadMo/SleepEEGNet.",
                "authors": [
                    {
                        "name": "Afghah F."
                    },
                    {
                        "name": "Mousavi S."
                    },
                    {
                        "name": "Rajendra Acharya U."
                    }
                ],
                "date": "2019-05-07T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Sleepeegnet: Automated sleep stage scoring with sequence to sequence deep learning approach"
            },
            "pmcid": "PMC6504038",
            "pmid": "31063501",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}
