{
    "additionDate": "2018-05-19T16:58:44Z",
    "biotoolsCURIE": "biotools:autosite",
    "biotoolsID": "autosite",
    "credit": [
        {
            "email": "sanner@scripps.edu",
            "name": "Michel F. Sanner",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Computational method for identifying and characterizing small molecules binding sites for receptors of known three-dimensional structure. Binding sites are identified using energetic aspects to select high affinity points in space around the receptor, and a clustering technique for segregating these points into clusters called fills and corresponding to potential binding pockets.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://adfr.scripps.edu/AutoDockFR/AutoSite_tutorial.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                }
            ]
        }
    ],
    "homepage": "http://adfr.scripps.edu/AutoDockFR/autosite.html",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "AutoSite",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTW367",
            "metadata": {
                "abstract": "© The Author 2016.Motivation: The identification of ligand-binding sites from a protein structure facilitates computational drug design and optimization, and protein function assignment. We introduce AutoSite: an efficient software tool for identifying ligand-binding sites and predicting pseudo ligand corresponding to each binding site identified. Binding sites are reported as clusters of 3D points called fills in which every point is labelled as hydrophobic or as hydrogen bond donor or acceptor. From these fills AutoSite derives feature points: a set of putative positions of hydrophobic-, and hydrogen-bond forming ligand atoms. Results: We show that AutoSite identifies ligand-binding sites with higher accuracy than other leading methods, and produces fills that better matches the ligand shape and properties, than the fills obtained with a software program with similar capabilities, AutoLigand. In addition, we demonstrate that for the Astex Diverse Set, the feature points identify 79% of hydrophobic ligand atoms, and 81% and 62% of the hydrogen acceptor and donor hydrogen ligand atoms interacting with the receptor, and predict 81.2% of water molecules mediating interactions between ligand and receptor. Finally, we illustrate potential uses of the predicted feature points in the context of lead optimization in drug discovery projects.",
                "authors": [
                    {
                        "name": "Ravindranath P.A."
                    },
                    {
                        "name": "Sanner M.F."
                    }
                ],
                "citationCount": 24,
                "date": "2016-10-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "AutoSite: An automated approach for pseudo-ligands prediction - From ligand-binding sites identification to predicting key ligand atoms"
            },
            "pmcid": "PMC5048065",
            "pmid": "27354702",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        },
        {
            "term": "Protein sites, features and motifs",
            "uri": "http://edamontology.org/topic_3510"
        }
    ],
    "validated": 1
}
