{
    "additionDate": "2021-01-18T10:29:17Z",
    "biotoolsCURIE": "biotools:apricot-platform",
    "biotoolsID": "apricot-platform",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "vicent.gimenez@i3m.upv.es",
            "name": "Vicent Giménez-Alventosa",
            "typeEntity": "Person"
        }
    ],
    "description": "APRICOT (Advanced Platform for Reproducible Infrastructures in the Cloud via Open Tools) is an open-source extension to support customised virtual infrastructure deployment and usage from Jupyter notebooks.\nScientific publications are meant to exchange knowledge among researchers but the inability to properly reproduce computational experiments limits the quality of scientific research. Furthermore, bibliography shows that irreproducible preclinical research exceeds 50%, which produces a huge waste of resources on nonprofitable research at Life Sciences field. As a consequence, scientific reproducibility is being fostered to promote Open Science through open databases and software tools that are typically deployed on existing computational resources. However, some computational experiments require complex virtual infrastructures, such as elastic clusters of PCs, that can be dynamically provided from multiple clouds",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/grycap/apricot",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-28T18:03:43Z",
    "license": "Apache-2.0",
    "name": "APRICOT",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1055/S-0040-1712460",
            "metadata": {
                "abstract": "© 2020 Royal Society Publishing. All rights reserved.Background â Scientific publications are meant to exchange knowledge among researchers but the inability to properly reproduce computational experiments limits the quality of scientific research. Furthermore, bibliography shows that irreproducible preclinical research exceeds 50%, which produces a huge waste of resources on nonprofitable research at Life Sciences field. As a consequence, scientific reproducibility is being fostered to promote Open Science through open databases and software tools that are typically deployed on existing computational resources. However, some computational experiments require complex virtual infrastructures, such as elastic clusters of PCs, that can be dynamically provided from multiple clouds. Obtaining these infrastructures requires not only an infrastructure provider, but also advanced knowledge in the cloud computing field. Objectives â The main aim of this paper is to improve reproducibility in life sciences to produce better and more cost-effective research. For that purpose, our intention is to simplify the infrastructure usage and deployment for researchers. Methods â This paper introduces Advanced Platform for Reproducible Infrastructures in the Cloud via Open Tools (APRICOT), an open source extension for Jupyter to deploy deterministic virtual infrastructures across multiclouds for reproducible scientific computational experiments. To exemplify its utilization and how APRICOT can improve the reproduction of experiments with complex computation requirements, two examples in the field of life sciences are provided. All requirements to reproduce both experiments are disclosed within APRICOT and, therefore, can be reproduced by the users. Results â To show the capabilities of APRICOT, we have processed a real magnetic resonance image to accurately characterize a prostate cancer using a Message Passing Interface cluster deployed automatically with APRICOT. In addition, the second example shows how APRICOT scales the deployed infrastructure, according to the workload, using a batch cluster. This example consists of a multiparametric study of a positron emission tomography image reconstruction. Conclusion â APRICOT's benefits are the integration of specific infrastructure deployment, the management and usage for Open Science, making experiments that involve specific computational infrastructures reproducible. All the experiment steps and details can be documented at the same Jupyter notebook which includes infrastructure specifications, data storage, experimentation execution, results gathering, and infrastructure termination. Thus, distributing the experimentation notebook and needed data should be enough to reproduce the experiment.",
                "authors": [
                    {
                        "name": "Gimenez-Alventosa V."
                    },
                    {
                        "name": "Segrelles J.D."
                    },
                    {
                        "name": "Molto G."
                    },
                    {
                        "name": "Roca-Sogorb M."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "Methods of Information in Medicine",
                "title": "APRICOT: Advanced Platform for Reproducible Infrastructures in the Cloud via Open Tools"
            },
            "pmcid": "PMC7746519",
            "pmid": "32777825"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Biology",
            "uri": "http://edamontology.org/topic_3070"
        },
        {
            "term": "Computer science",
            "uri": "http://edamontology.org/topic_3316"
        }
    ]
}