{
    "additionDate": "2022-11-15T08:14:27.417711Z",
    "biotoolsCURIE": "biotools:nddrf",
    "biotoolsID": "nddrf",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "bairong.shen@scu.edu.cn",
            "name": "Bairong Shen",
            "typeEntity": "Person"
        }
    ],
    "description": "A risk factor knowledgebase for personalized prevention of neurodegenerative diseases.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Information extraction",
                    "uri": "http://edamontology.org/operation_3907"
                }
            ]
        }
    ],
    "homepage": "http://sysbio.org.cn/NDDRF/",
    "lastUpdate": "2022-11-15T08:14:27.420170Z",
    "license": "Other",
    "name": "NDDRF",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.JARE.2021.06.015",
            "metadata": {
                "abstract": "© 2022Introduction: Neurodegenerative diseases (NDDs) are a series of chronic diseases, which are associated with progressive loss of neuronal structure or function. The complex etiologies of the NDDs remain unclear, thus the prevention and early diagnosis of NDDs are critical to reducing the mortality and morbidity of these diseases. Objectives: To provide a systematic understanding of the heterogeneity of the risk factors associated with different NDDs (pan-neurodegenerative diseases or pan-NDDs), the knowledgebase is established to facilitate the personalized and knowledge-guided diagnosis, prevention and prediction of NDDs. Methods: Before data collection, the medical, life science and informatics experts as well as the potential users of the database were consulted and discussed for the scope of data and the classification of risk factors. The PubMed database was used as the resource of the data and knowledge extraction. Risk factors of NDDs were manually collected from literature published between 1975 and 2020. Results: The comprehensive risk factors database for NDDs (NDDRF) was established including 998 single or combined risk factors, 2293 records and 1071 articles relevant to the 14 most common NDDs. The single risk factors are classified into 3 categories, i.e. epidemiological factors (469), genetic factors (324) and biochemical factors (153). Among all the factors, 179 factors are positive and protective, while 880 factors have negative influence for NDDs. The knowledgebase is available at http://sysbio.org.cn/NDDRF/. Conclusion: NDDRF provides the structured information and knowledge resource on risk factors of NDDs. It could benefit the future systematic and personalized investigation of pan-NDDs genesis and progression. Meanwhile it may be used for the future explainable artificial intelligence modeling for smart diagnosis and prevention of NDDs.",
                "authors": [
                    {
                        "name": "Bi C."
                    },
                    {
                        "name": "He H."
                    },
                    {
                        "name": "Lin Y."
                    },
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Shen B."
                    },
                    {
                        "name": "Shi M."
                    },
                    {
                        "name": "Wu R."
                    },
                    {
                        "name": "Yu J."
                    },
                    {
                        "name": "Zhan C."
                    },
                    {
                        "name": "Zhang X."
                    },
                    {
                        "name": "Zhou S."
                    },
                    {
                        "name": "Zhu Y."
                    }
                ],
                "date": "2022-09-01T00:00:00Z",
                "journal": "Journal of Advanced Research",
                "title": "NDDRF: A risk factor knowledgebase for personalized prevention of neurodegenerative diseases"
            },
            "pmcid": "PMC9481935",
            "pmid": "36100329"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ]
}
