{
    "accessibility": "Restricted access",
    "additionDate": "2022-09-09T08:43:40.686894Z",
    "biotoolsCURIE": "biotools:contignet",
    "biotoolsID": "contignet",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "fsun@usc.edu",
            "name": "Fengzhu Sun",
            "typeEntity": "Person"
        },
        {
            "name": "Tianqi Tang"
        }
    ],
    "description": "Phage-bacterial contig association prediction with a convolutional neural network.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Sample comparison",
                    "uri": "http://edamontology.org/operation_3731"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "https://github.com/tianqitang1/ContigNet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-09-09T08:43:40.689485Z",
    "license": "Other",
    "name": "ContigNet",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAC239",
            "metadata": {
                "abstract": "© 2022 The Author(s) 2022. Published by Oxford University Press.Motivation: Phage-host associations play important roles in microbial communities. But in natural communities, as opposed to culture-based lab studies where phages are discovered and characterized metagenomically, their hosts are generally not known. Several programs have been developed for predicting which phage infects which host based on various sequence similarity measures or machine learning approaches. These are often based on whole viral and host genomes, but in metagenomics-based studies, we rarely have whole genomes but rather must rely on contigs that are sometimes as short as hundreds of bp long. Therefore, we need programs that predict hosts of phage contigs on the basis of these short contigs. Although most existing programs can be applied to metagenomic datasets for these predictions, their accuracies are generally low. Here, we develop ContigNet, a convolutional neural network-based model capable of predicting phage-host matches based on relatively short contigs, and compare it to previously published VirHostMatcher (VHM) and WIsH. Results: On the validation set, ContigNet achieves 72-85% area under the receiver operating characteristic curve (AUROC) scores, compared to the maximum of 68% by VHM or WIsH for contigs of lengths between 200 bps to 50 kbps. We also apply the model to the Metagenomic Gut Virus (MGV) catalogue, a dataset containing a wide range of draft genomes from metagenomic samples and achieve 60-70% AUROC scores compared to that of VHM and WIsH of 52%. Surprisingly, ContigNet can also be used to predict plasmid-host contig associations with high accuracy, indicating a similar genetic exchange between mobile genetic elements and their hosts.",
                "authors": [
                    {
                        "name": "Fuhrman J.A."
                    },
                    {
                        "name": "Hou S."
                    },
                    {
                        "name": "Sun F."
                    },
                    {
                        "name": "Tang T."
                    }
                ],
                "date": "2022-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Phage-bacterial contig association prediction with a convolutional neural network"
            },
            "pmcid": "PMC9235506",
            "pmid": "35758806"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Mobile genetic elements",
            "uri": "http://edamontology.org/topic_0798"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
