{
    "additionDate": "2016-11-28T10:07:16Z",
    "biotoolsCURIE": "biotools:ppi",
    "biotoolsID": "ppi",
    "collectionID": [
        "de.NBI"
    ],
    "credit": [
        {
            "email": "rarey-office@zbh.uni-hamburg.de",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "University of Hamburg - Center for Bioinformatics",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        }
    ],
    "description": "HyPPI classifies a protein-protein complex concerning its interaction type into permanent, transient or crystal artifact. Permanent protein-protein complexes are only stable in their complexed state and the subunits would denature upon complex dissociation. Transient protein-protein complexes are stable in the complexed form as well as in the monomeric depending of the necessary function of the complex. Crystal artifacts have no biological function and are artifically formed during crystallization process. The discrimination is performed using two characteristics of the protein-protein complex, the hydrophobicity of the interface (ΔGHydrophobic) and the quotient of interface area ratios (IF-quotient). The IF-quotient takes the symmetry of the protein-protein interface into account.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://proteinsplus.zbh.uni-hamburg.de/help/index"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "elixirCommunity": [
        "3D-BioInfo"
    ],
    "elixirNode": [
        "Germany"
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein structure",
                        "uri": "http://edamontology.org/data_1460"
                    },
                    "format": [
                        {
                            "term": "PDB",
                            "uri": "http://edamontology.org/format_1476"
                        }
                    ]
                }
            ],
            "note": "Probability score for interface classification",
            "operation": [
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Protein structure analysis",
                    "uri": "http://edamontology.org/operation_2406"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Score",
                        "uri": "http://edamontology.org/data_1772"
                    }
                }
            ]
        }
    ],
    "homepage": "http://proteinsplus.zbh.uni-hamburg.de/#ppi",
    "lastUpdate": "2020-06-08T15:39:28Z",
    "name": "HyPPI",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "stierand",
    "publication": [
        {
            "doi": "10.1007/s10822-012-9626-2",
            "metadata": {
                "abstract": "The estimation of free energy of binding is a key problem in structure-based design. We developed the scoring function HYDE based on a consistent description of HYdrogen bond and DEhydration energies in protein-ligand complexes. HYDE is applicable to all types of protein targets since it is not calibrated on experimental binding affinity data or protein-ligand complexes. The comprehensible atom-based score of HYDE is visualized by applying a very intuitive coloring scheme, thereby facilitating the analysis of protein-ligand complexes in the lead optimization process. In this paper, we have revised several aspects of the former version of HYDE which was described in detail previously. The revised HYDE version was already validated in large-scale redocking and screening experiments which were performed in the course of the Docking and Scoring Symposium at 241st ACS National Meeting. In this study, we additionally evaluate the ability of the revised HYDE version to predict binding affinities. On the PDBbind 2007 coreset, HYDE achieves a correlation coefficient of 0.62 between the experimental binding constants and the predicted binding energy, performing second best on this dataset compared to 17 other well-established scoring functions. Further, we show that the performance of HYDE in large-scale redocking and virtual screening experiments on the Astex diverse set and the DUD dataset respectively, is comparable to the best methods in this field. © 2012 Springer Science+Business Media Dordrecht.",
                "authors": [
                    {
                        "name": "Hindle S."
                    },
                    {
                        "name": "Klein R."
                    },
                    {
                        "name": "Lange G."
                    },
                    {
                        "name": "Rarey M."
                    },
                    {
                        "name": "Schneider N."
                    }
                ],
                "citationCount": 123,
                "date": "2013-01-01T00:00:00Z",
                "journal": "Journal of Computer-Aided Molecular Design",
                "title": "A consistent description of HYdrogen bond and DEhydration energies in protein-ligand complexes: Methods behind the HYDE scoring function"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ],
    "validated": 1
}
