{
    "additionDate": "2022-11-03T07:03:20.553625Z",
    "biotoolsCURIE": "biotools:ebolapred",
    "biotoolsID": "ebolapred",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Joseph Adams"
        },
        {
            "name": "Samuel K Kwofie"
        }
    ],
    "description": "EBOLApred is a machine learning-based web application for predicting molecules capable of inhibiting the activities of glycoprotein (GP) and the matrix protein (VP40) of the Ebola virus.",
    "documentation": [
        {
            "type": [
                "FAQ"
            ],
            "url": "http://197.255.126.13:8000/FAQ"
        },
        {
            "type": [
                "Training material"
            ],
            "url": "http://197.255.126.13:8000/tutorials"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "http://197.255.126.13:8000/",
    "language": [
        "JavaScript",
        "Python"
    ],
    "lastUpdate": "2022-11-03T07:03:20.556789Z",
    "license": "Not licensed",
    "name": "EBOLApred",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.COMPBIOLCHEM.2022.107766",
            "metadata": {
                "abstract": "© 2022 Elsevier LtdEbola virus disease (EVD) is a highly virulent and often lethal illness that affects humans through contact with the body fluid of infected persons. Glycoprotein and matrix protein VP40 play essential roles in the virus life cycle within the host. Whilst glycoprotein mediates the entry and fusion of the virus with the host cell membrane, VP40 is also responsible for viral particle assembly and budding. This study aimed at developing machine learning models to predict small molecules as possible anti-Ebola virus compounds capable of inhibiting the activities of GP and VP40 using Ebola virus (EBOV) cell entry inhibitors from the PubChem database as training data. Predictive models were developed using five algorithms comprising random forest (RF), support vector machine (SVM), naïve Bayes (NB), k-nearest neighbor (kNN), and logistic regression (LR). The models were evaluated using a 10-fold cross-validation technique and the algorithm with the best performance was the random forest model with an accuracy of 89 %, an F1 score of 0.9, and a receiver operating characteristic curve (ROC curve) showing the area under the curve (AUC) score of 0.95. LR and SVM models also showed plausible performances with overall accuracy values of 0.84 and 0.86, respectively. The models, RF, LR, and SVM were deployed as a web server known as EBOLApred accessible via http://197.255.126.13:8000/.",
                "authors": [
                    {
                        "name": "Adams J."
                    },
                    {
                        "name": "Agyapong O."
                    },
                    {
                        "name": "Agyenkwa-Mawuli K."
                    },
                    {
                        "name": "Kwofie S.K."
                    },
                    {
                        "name": "Wilson M.D."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "Computational Biology and Chemistry",
                "title": "EBOLApred: A machine learning-based web application for predicting cell entry inhibitors of the Ebola virus"
            },
            "pmid": "36088668"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        }
    ],
    "validated": 1
}
