{
    "additionDate": "2019-11-14T18:41:29Z",
    "biotoolsCURIE": "biotools:OPEN_SCIENCE_BADGES",
    "biotoolsID": "OPEN_SCIENCE_BADGES",
    "confidence_flag": "low",
    "description": "> LOW CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'UPR transmission', 'UPR', 'cell-to-cell UPR transmission', 'cell-to-cell UPR' | No evidence for cell-to-cell transmission of the unfolded protein response in cell culture | Criteria and background information about open science badges | Help support open science today. Donate Now",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://cos.io/our-services/open-science-badges/",
    "lastUpdate": "2019-11-14T18:41:29Z",
    "name": "OPEN SCIENCE BADGES",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1111/JNC.14856",
            "metadata": {
                "abstract": "© 2019 The Authors. Journal of Neurochemistry published by John Wiley & Sons Ltd on behalf of International Society for NeurochemistryThe unfolded protein response (UPR) is one of the major cell-autonomous proteostatic stress responses. The UPR has been implicated in the pathogenesis of neurodegenerative diseases and is therefore actively investigated as therapeutic target. In this respect, cell non-autonomous effects of the UPR including the reported cell-to-cell transmission of UPR activity may be highly important. A pharmaca-based UPR induction was employed to generate conditioned media (CM) from CM-donating neuronal (‘donor’) cells (SK-N-SH and primary mouse neurons). As previously reported, upon subsequent transfer of CM to naive neuronal ‘acceptor’ cells, we confirmed UPR target mRNA and protein expression by qPCR and automated microscopy. However, UPR target gene expression was also induced in the absence of donor cells, indicating carry-over of pharmaca. Genetic induction of single pathways of the UPR in donor cells did not result in UPR transmission to acceptor cells. Moreover, no transmission was detected upon full UPR activation by nutrient deprivation or inducible expression of the heavy chain of immunoglobulin M in donor HeLa cells. In addition, in direct co-culture of donor cells expressing the immunoglobulin M heavy chain and fluorescent UPR reporter acceptor HeLa cells, UPR transmission was not observed. In conclusion, carry-over of pharmaca is a major confounding factor in pharmaca-based UPR transmission protocols that are therefore unsuitable to study cell-to-cell UPR transmission. In addition, the absence of UPR transmission in non-pharmaca-based models of UPR activation indicates that cell-to-cell UPR transmission does not occur in cell culture. Open science badges: This article has received a badge for *Open Materials* because it provided all relevant information to reproduce the study in the manuscript. The complete Open Science Disclosure form for this article can be found at the end of the article. More information about the Open Practices badges can be found at https://cos.io/our-services/open-science-badges/. (Figure presented.). Open Science: This manuscript was awarded with the Open Materials Badge. For more information see: https://cos.io/our-services/open-science-badges/.",
                "authors": [
                    {
                        "name": "van Ziel A.M."
                    },
                    {
                        "name": "Wolzak K."
                    },
                    {
                        "name": "Nolle A."
                    },
                    {
                        "name": "Hoetjes P.J."
                    },
                    {
                        "name": "Berenjeno-Correa E."
                    },
                    {
                        "name": "van Anken E."
                    },
                    {
                        "name": "Struys E.A."
                    },
                    {
                        "name": "Scheper W."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Journal of Neurochemistry",
                "title": "No evidence for cell-to-cell transmission of the unfolded protein response in cell culture"
            },
            "pmid": "31442299"
        }
    ],
    "topic": [
        {
            "term": "Electron microscopy",
            "uri": "http://edamontology.org/topic_0611"
        },
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        }
    ]
}