{
    "additionDate": "2021-01-18T08:10:03Z",
    "biotoolsCURIE": "biotools:deeppod",
    "biotoolsID": "deeppod",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "cul@aber.ac.uk",
            "name": "Chuan Lu",
            "orcidid": "https://orcid.org/0000-0002-4898-6679",
            "typeEntity": "Person"
        }
    ],
    "description": "DeepPod is a convolutional neural network based quantification of fruit number in Arabidopsis.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Image annotation",
                    "uri": "http://edamontology.org/operation_3553"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/AzmHmd/DeepPod.git",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-02-27T14:47:39Z",
    "license": "MIT",
    "name": "DeepPod",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/GIGASCIENCE/GIAA012",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020.Background: High-throughput phenotyping based on non-destructive imaging has great potential in plant biology and breeding programs. However, efficient feature extraction and quantification from image data remains a bottleneck that needs to be addressed. Advances in sensor technology have led to the increasing use of imaging to monitor and measure a range of plants including the model Arabidopsis thaliana. These extensive datasets contain diverse trait information, but feature extraction is often still implemented using approaches requiring substantial manual input. Results: The computational detection and segmentation of individual fruits from images is a challenging task, for which we have developed DeepPod, a patch-based 2-phase deep learning framework. The associated manual annotation task is simple and cost-effective without the need for detailed segmentation or bounding boxes. Convolutional neural networks (CNNs) are used for classifying different parts of the plant inflorescence, including the tip, base, and body of the siliques and the stem inflorescence. In a post-processing step, different parts of the same silique are joined together for silique detection and localization, whilst taking into account possible overlapping among the siliques. The proposed framework is further validated on a separate test dataset of 2,408 images. Comparisons of the CNN-based prediction with manual counting (R2 = 0.90) showed the desired capability of methods for estimating silique number. Conclusions: The DeepPod framework provides a rapid and accurate estimate of fruit number in a model system widely used by biologists to investigate many fundemental processes underlying growth and reproduction.",
                "authors": [
                    {
                        "name": "Corke F.M.K."
                    },
                    {
                        "name": "Doonan J.H."
                    },
                    {
                        "name": "Garzon-Martinez G.A."
                    },
                    {
                        "name": "Ghahremani M."
                    },
                    {
                        "name": "Hamidinekoo A."
                    },
                    {
                        "name": "Lu C."
                    },
                    {
                        "name": "Zwiggelaar R."
                    }
                ],
                "citationCount": 6,
                "date": "2020-03-12T00:00:00Z",
                "journal": "GigaScience",
                "title": "DeepPod: A convolutional neural network based quantification of fruit number in Arabidopsis"
            },
            "pmcid": "PMC7055469",
            "pmid": "32129846"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ]
}
