{
    "additionDate": "2021-01-18T09:42:35Z",
    "biotoolsCURIE": "biotools:bas-calc",
    "biotoolsID": "bas-calc",
    "confidence_flag": "tool",
    "description": "Breast Aesthetic Scale Calculator (BAS-Calc) is a platform for calculating Breast Aesthetic Scale (BAS) score, which is a quick and simple objective assessment of results in cosmetic breast surgery",
    "editPermission": {
        "authors": [
            "amunin"
        ],
        "type": "group"
    },
    "homepage": "https://www.breastsymmetry.com/",
    "lastUpdate": "2024-11-24T15:33:48.666923Z",
    "name": "BAS-Calc",
    "operatingSystem": [
        "Mac"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1097/sap.0000000000002440",
            "metadata": {
                "abstract": "Background Our work describes the concept of Breast Aesthetic Scale (BAS) as a score for quick and simple objective assessment of results in cosmetic breast surgery. It is obtained by running a software program that we created, based on the previous concept of Objective Breast Cosmesis Scale (OBCS). This was previously described to be used in the context of conservative breast cancer treatment to objectively assess the degree of asymmetry. We describe the implementation of BAS algorithm and study its reproducibility in a set of images. Methods A new multiplatform software was developed by us and named Breast Aesthetic Scale Calculator (BAS-Calc), which can be executed on Windows Mac, and Linux. A set of 25 photographs were studied with this software twice by 2 different surgeons. Intrarater and interrater variability were studied, as well as concordance with categorization by another symmetry assessment software available called Breast Analyzing Tool®. Results Concordance among raters was excellent (intraclass correlation coefficient = 0.953; Lin concordance and correlation coefficient = 0.950), as well as intrarater (0.952 and 0.965). Categorization of both systems (Breast Analyzing Tool and BAS-Calc) showed almost perfect concordance (Cohen κ = 0.920). Conclusions Objective estimation of symmetry after breast surgery can be assessed with BAS-Calc. The \"symmetric\"and \"asymmetric\"categories are accurately discriminated by this free software, and it can be used by surgeons as a simple method for objective assessment of results in cosmetic breast surgery.",
                "authors": [
                    {
                        "name": "Chang-Azancot L."
                    },
                    {
                        "name": "Insausti R."
                    },
                    {
                        "name": "Jordan J."
                    },
                    {
                        "name": "Kenig N."
                    },
                    {
                        "name": "Monton J."
                    }
                ],
                "citationCount": 4,
                "date": "2021-04-01T00:00:00Z",
                "journal": "Annals of Plastic Surgery",
                "title": "A Free Tool for Breast Aesthetic Scale Computation"
            },
            "pmid": "32568756"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        }
    ]
}
