{
    "additionDate": "2021-01-18T09:50:29Z",
    "biotoolsCURIE": "biotools:opus-tass",
    "biotoolsID": "opus-tass",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jpma@bcm.edu",
            "name": "Jianpeng Ma",
            "typeEntity": "Person"
        }
    ],
    "description": "A protein backbone torsion angles and secondary structure predictor based on ensemble neural networks.\n\nPredictions of protein backbone torsion angles (ϕ and ψ) and secondary structure from sequence are crucial subproblems in protein structure prediction. With the development of deep learning approaches, their accuracies have been significantly improved. To capture the long-range interactions, most of studies integrate bidirectional recurrent neural networks into their models.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein geometry calculation",
                    "uri": "http://edamontology.org/operation_0249"
                },
                {
                    "term": "Protein secondary structure comparison",
                    "uri": "http://edamontology.org/operation_2488"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ]
        }
    ],
    "homepage": "https://github.com/thuxugang/opus_tass",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-15T09:31:43Z",
    "name": "OPUS-TASS",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA629",
            "metadata": {
                "abstract": "© 2020 The Author(s).Motivation: Predictions of protein backbone torsion angles (φ and ψ) and secondary structure from sequence are crucial subproblems in protein structure prediction. With the development of deep learning approaches, their accuracies have been significantly improved. To capture the long-range interactions, most studies integrate bidirectional recurrent neural networks into their models. In this study, we introduce and modify a recently proposed architecture named Transformer to capture the interactions between the two residues theoretically with arbitrary distance. Moreover, we take advantage of multitask learning to improve the generalization of neural network by introducing related tasks into the training process. Similar to many previous studies, OPUS-TASS uses an ensemble of models and achieves better results. Results: OPUS-TASS uses the same training and validation sets as SPOT-1D. We compare the performance of OPUS-TASS and SPOT-1D on TEST2016 (1213 proteins) and TEST2018 (250 proteins) proposed in the SPOT-1D paper, CASP12 (55 proteins), CASP13 (32 proteins) and CASP-FM (56 proteins) proposed in the SAINT paper, and a recently released PDB structure collection from CAMEO (93 proteins) named as CAMEO93. On these six test sets, OPUS-TASS achieves consistent improvements in both backbone torsion angles prediction and secondary structure prediction. On CAMEO93, SPOT-1D achieves the mean absolute errors of 16.89 and 23.02 for φ and ψ predictions, respectively, and the accuracies for 3- and 8-state secondary structure predictions are 87.72 and 77.15%, respectively. In comparison, OPUS-TASS achieves 16.56 and 22.56 for φ and ψ predictions, and 89.06 and 78.87% for 3- and 8-state secondary structure predictions, respectively. In particular, after using our torsion angles refinement method OPUS-Refine as the post-processing procedure for OPUS-TASS, the mean absolute errors for final φ and ψ predictions are further decreased to 16.28 and 21.98, respectively.",
                "authors": [
                    {
                        "name": "Ma J."
                    },
                    {
                        "name": "Wang Q."
                    },
                    {
                        "name": "Xu G."
                    }
                ],
                "citationCount": 6,
                "date": "2020-10-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "OPUS-TASS: A protein backbone torsion angles and secondary structure predictor based on ensemble neural networks"
            },
            "pmid": "32678893"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein secondary structure",
            "uri": "http://edamontology.org/topic_3542"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ]
}
