{
    "additionDate": "2018-06-05T17:18:38Z",
    "biotoolsCURIE": "biotools:vcnet",
    "biotoolsID": "vcnet",
    "credit": [
        {
            "email": "dengmh@pku.edu.cn",
            "name": "Minghua Deng",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "nelsontang@cuhk.edu.hk",
            "name": "Nelson Leung-Sang Tang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Vector-based gene co-expression network construction and its application to RNA-seq data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/wangzengmiao/VCNet/blob/master/Readme.txt"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene co-expression network analysis",
                    "uri": "http://edamontology.org/operation_3463"
                }
            ]
        }
    ],
    "homepage": "https://github.com/wangzengmiao/VCNet",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "license": "GPL-3.0",
    "name": "VCNet",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btx131",
            "metadata": {
                "abstract": "© 2017 The Author. Published by Oxford University Press. All rights reserved.Motivation: Building gene co-expression network (GCN) from gene expression data is an important field of bioinformatic research. Nowadays, RNA-seq data provides high dimensional information to quantify gene expressions in term of read counts for individual exons of genes. Such an increase in the dimension of expression data during the transition from microarray to RNA-seq era made many previous co-expression analysis algorithms based on simple univariate correlation no longer applicable. Recently, two vector-based methods, SpliceNet and RNASeqNet, have been proposed to build GCN. However, they failed to work when sample size is less than the number of exons. Results: We develop an algorithm called VCNet to construct GCN from RNA-seq data to overcome this dimensional problem. VCNet performs a new statistical hypothesis test based on the correlation matrix of a gene-gene pair using the Frobenius norm. The asymptotic distribution of the new test is obtained under the null model. Simulation studies demonstrate that VCNet outperforms SpliceNet and RNASeqNet for detecting edges of GCN. We also apply VCNet to two expression datasets from TCGA database: The normal breast tissue and kidney tumour tissue, and the results show that the GCNs constructed by VCNet contain more biologically meaningful interactions than existing methods. Conclusion: VCNet is a useful tool to construct co-expression network.",
                "authors": [
                    {
                        "name": "Wang Z."
                    },
                    {
                        "name": "Fang H."
                    },
                    {
                        "name": "Tang N.L.-S."
                    },
                    {
                        "name": "Deng M."
                    }
                ],
                "citationCount": 4,
                "date": "2017-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "VCNet: Vector-based gene co-expression network construction and its application to RNA-seq data"
            }
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}