{
    "name": "MLbias", 
    "description": "R package to correct for machine learning bias when many classifiers are compared and the best is selected.", 
    "homepage": "http://tsenglab.biostat.pitt.edu/software.htm#MLbias", 
    "biotoolsID": "mlbias", 
    "biotoolsCURIE": "biotools:mlbias", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2424", 
                    "term": "Comparison"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3474", 
            "term": "Machine learning"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "R"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/mlbias-1-0-correct-machine-learning-bias.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://tsenglab.biostat.pitt.edu/software.htm#MLbias", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "25086004", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Bias correction for selecting the minimal-error classifier from many machine learning models", 
                "abstract": "© The Author 2014. Published by Oxford University Press.Motivation: Supervised machine learning is commonly applied in genomic research to construct a classifier from the training data that is generalizable to predict independent testing data. When test datasets are not available, cross-validation is commonly used to estimate the error rate. Many machine learning methods are available, and it is well known that no universally best method exists in general. It has been a common practice to apply many machine learning methods and report the method that produces the smallest cross-validation error rate. Theoretically, such a procedure produces a selection bias. Consequently, many clinical studies with moderate sample sizes (e.g. n = 30-60) risk reporting a falsely small cross-validation error rate that could not be validated later in independent cohorts.Results: In this article, we illustrated the probabilistic framework of the problem and explored the statistical and asymptotic properties. We proposed a new bias correction method based on learning curve fitting by inverse power law (IPL) and compared it with three existing methods: nested cross-validation, weighted mean correction and Tibshirani-Tibshirani procedure. All methods were compared in simulation datasets, five moderate size real datasets and two large breast cancer datasets. The result showed that IPL outperforms the other methods in bias correction with smaller variance, and it has an additional advantage to extrapolate error estimates for larger sample sizes, a practical feature to recommend whether more samples should be recruited to improve the classifier and accuracy. An R package 'MLbias' and all source files are publicly available.", 
                "date": "2014-01-01T00:00:00Z", 
                "citationCount": 9, 
                "authors": [
                    {
                        "name": "Ding Y."
                    }, 
                    {
                        "name": "Tang S."
                    }, 
                    {
                        "name": "Liao S.G."
                    }, 
                    {
                        "name": "Jia J."
                    }, 
                    {
                        "name": "Oesterreich S."
                    }, 
                    {
                        "name": "Lin Y."
                    }, 
                    {
                        "name": "Tseng G.C."
                    }
                ], 
                "journal": "Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": "Tseng GC", 
            "email": "ctseng@pitt.edu", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T18:49:45Z", 
    "lastUpdate": "2018-12-10T12:58:51Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}