{
    "additionDate": "2021-06-14T13:40:25Z",
    "biotoolsCURIE": "biotools:caen",
    "biotoolsID": "caen",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "2160090406@email.szu.edu.cn",
            "name": "Yan Zhou",
            "orcidid": "https://orcid.org/0000-0002-7489-9405",
            "typeEntity": "Person",
            "typeRole": [
                "Developer",
                "Maintainer"
            ]
        }
    ],
    "description": "Category encoding (CAEN) method is proposed to select feature genes for bulk and single-cell RNA-seq data classification. This novel method encodes categories by employing the rank of sequence samples for each gene in each class. Correlation coefficients are considered for gene and class with the rank of sample and a new rank of category. The highest gene correlation coefficients are considered feature genes, which are the most effective for classifying bulk and single-cell RNA-seq dataset.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence classification",
                    "uri": "http://edamontology.org/operation_2995"
                },
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                }
            ]
        }
    ],
    "homepage": "https://bioconductor.org/packages/devel/bioc/html/CAEN.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-08-18T11:17:23Z",
    "license": "GPL-2.0",
    "name": "CAEN",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1002/SIM.9015",
            "metadata": {
                "abstract": "© 2021 John Wiley & Sons Ltd.Bulk and single-cell RNA-seq (scRNA-seq) data are being used as alternatives to traditional technology in biology and medicine research. These data are used, for example, for the detection of differentially expressed (DE) genes. Several statistical methods have been developed for the classification of bulk and single-cell RNA-seq data. These feature genes are vitally important for the classification of bulk and single-cell RNA-seq data. The majority of genes are not DE and they are thus irrelevant for class distinction. To improve the classification performance and save the computation time, removal of irrelevant genes is necessary. Removal will aid the detection of the important feature genes. Widely used schemes in the literature, such as the BSS/WSS (BW) method, assume that data are normally distributed and may not be suitable for bulk and single-cell RNA-seq data. In this article, a category encoding (CAEN) method is proposed to select feature genes for bulk and single-cell RNA-seq data classification. This novel method encodes categories by employing the rank of sequence samples for each gene in each class. Correlation coefficients are considered for gene and class with the rank of sample and a new rank of category. The highest gene correlation coefficients are considered feature genes, which are the most effective for classifying bulk and single-cell RNA-seq dataset. The sure screening method was also established for rank consistency properties of the proposed CAEN method. Simulation studies show that the classifier using the proposed CAEN method performs better than, or at least as well as, the existing methods in most settings. Existing real datasets were analyzed, with the results demonstrating superior performance of the proposed method over current competitors. The application has been coded into an R package named “CAEN” to facilitate wide use.",
                "authors": [
                    {
                        "name": "Zhou Y."
                    },
                    {
                        "name": "Zhang L."
                    },
                    {
                        "name": "Xu J."
                    },
                    {
                        "name": "Zhang J."
                    },
                    {
                        "name": "Yan X."
                    }
                ],
                "date": "2021-08-15T00:00:00Z",
                "journal": "Statistics in Medicine",
                "title": "Category encoding method to select feature genes for the classification of bulk and single-cell RNA-seq data"
            },
            "pmid": "34028849"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ]
}