{
    "additionDate": "2017-01-17T15:05:57Z",
    "biotoolsCURIE": "biotools:ripseeker",
    "biotoolsID": "ripseeker",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "yueli@cs.toronto.edu",
            "name": "Yue Li",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Infers and discriminates RIP peaks from RIP-seq alignments using two-state HMM with negative binomial emission probability. While this tool is specifically tailored for RIP-seq data analysis, it also provides a suite of bioinformatics tools integrated within this self-contained software package comprehensively addressing issues ranging from post-alignments processing to visualization and annotation.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/RIPSeeker.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/RIPSeeker_1.14.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Transcriptional regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0438"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/RIPSeeker.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-09T16:38:31Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Mirror"
            ],
            "url": "http://www.cs.utoronto.ca/~yueli/software.html"
        }
    ],
    "name": "RIPSeeker",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1093/nar/gkt142",
            "metadata": {
                "abstract": "RIP-seq has recently been developed to discover genome-wide RNA transcripts that interact with a protein or protein complex. RIP-seq is similar to both RNA-seq and ChIP-seq, but presents unique properties and challenges. Currently, no statistical tool is dedicated to RIP-seq analysis. We developed RIPSeeker (http://www.bioconductor.org/packages/2.12/bioc/html/RIPSeeker.html), a free open-source Bioconductor/R package for de novo RIP peak predictions based on HMM. To demonstrate the utility of the software package, we applied RIPSeeker and six other published programs to three independent RIP-seq datasets and two PAR-CLIP datasets corresponding to six distinct RNA-binding proteins. Based on receiver operating curves, RIPSeeker demonstrates superior sensitivity and specificity in discriminating high-confidence peaks that are consistently agreed on among a majority of the comparison methods, and dominated 9 of the 12 evaluations, averaging 80% area under the curve. The peaks from RIPSeeker are further confirmed based on their significant enrichment for biologically meaningful genomic elements, published sequence motifs and association with canonical transcripts known to interact with the proteins examined. While RIPSeeker is specifically tailored for RIP-seq data analysis, it also provides a suite of bioinformatics tools integrated within a self-contained software package comprehensively addressing issues ranging from post-alignments' processing to visualization and annotation. © 2013 The Author(s).",
                "authors": [
                    {
                        "name": "Greenblatt J.F."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Zhang Z."
                    },
                    {
                        "name": "Zhao D.Y."
                    }
                ],
                "citationCount": 27,
                "date": "2013-04-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "RIPSeeker: A statistical package for identifying protein-associated transcripts from RIP-seq experiments"
            },
            "pmcid": "PMC3632129",
            "pmid": "23455476",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1,
    "version": [
        "1.14.0"
    ]
}
