{
    "additionDate": "2020-01-14T09:36:17Z",
    "biotoolsCURIE": "biotools:Oscillayers",
    "biotoolsID": "Oscillayers",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "alexandergamisch@gmx.at",
            "name": "Alexander Gamisch",
            "orcidid": "https://orcid.org/0000-0002-9698-4344",
            "typeEntity": "Person"
        }
    ],
    "description": "A dataset for the study of climatic oscillations over Plio-Pleistocene time-scales at high spatial-temporal resolution.\n\nMotivation:In order to understand how species evolutionarily responded to Plio-Pleistocene climate oscillations (e.g. in terms of speciation, extinction, migration and adaptation), it is first important to have a good understanding of those past climate changes per se. This, however, is currently limited due to the lack of global-scale climatic datasets with high temporal resolution spanning the Plio-Pleistocene. To fill this gap, I here present Oscillayers, a global-scale and region-specific bioclim dataset, facilitating the study of climatic oscillations during the last 5.4 million years at high spatial (2.5 arc-minutes) and temporal (10 kyr time periods) resolution.\n\n||| HOMEPAGE MISSING!",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Ancestral reconstruction",
                    "uri": "http://edamontology.org/operation_3745"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31762691",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-01-14T09:36:17Z",
    "name": "Oscillayers",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1111/GEB.12979",
            "metadata": {
                "abstract": "© 2019 The Authors. Global Ecology and Biogeography Published by John Wiley & Sons LtdMotivation: In order to understand how species evolutionarily responded to Plio-Pleistocene climate oscillations (e.g. in terms of speciation, extinction, migration and adaptation), it is first important to have a good understanding of those past climate changes per se. This, however, is currently limited due to the lack of global-scale climatic datasets with high temporal resolution spanning the Plio-Pleistocene. To fill this gap, I here present Oscillayers, a global-scale and region-specific bioclim dataset, facilitating the study of climatic oscillations during the last 5.4 million years at high spatial (2.5 arc-minutes) and temporal (10 kyr time periods) resolution. This dataset builds upon interpolated anomalies (Δ layers) between bioclim layers of the present and the Last Glacial Maximum (LGM) that are scaled relative to the Plio-Pleistocene global mean temperature curve, derived from benthic stable oxygen isotope ratios, to generate bioclim variables for 539 time periods. Evaluation of the scaled, interpolated estimates of palaeo-climates generated for the Holocene, Last Interglacial and Pliocene showed good agreement with independent general circulation models (GCMs) for respective time periods in terms of pattern correlation and absolute differences. Oscillayers thus provides a new tool for studying spatial-temporal patterns of evolutionary and ecological processes at high temporal and spatial resolution. Main types of variable contained: Nineteen bioclim variables for time periods throughout the Plio-Pleistocene. Input data and R script to recreate all 19 bioclim variables. Spatial location and grain: Global at 2.5 arc-minutes (4.65 x 4.65 = 21.62 km2 at the equator). Time period and grain: The last 5.4 million years. The grain is 10 kyr (= 539 time periods). Level of measurement: Data are for terrestrial climates (excluding Antarctica) taking sea level changes into account. Software format: All data are available as ASCII grid files.",
                "authors": [
                    {
                        "name": "Gamisch A."
                    }
                ],
                "citationCount": 4,
                "date": "2019-11-01T00:00:00Z",
                "journal": "Global Ecology and Biogeography",
                "title": "Oscillayers: A dataset for the study of climatic oscillations over Plio-Pleistocene time-scales at high spatial-temporal resolution"
            },
            "pmcid": "PMC6853231",
            "pmid": "31762691"
        }
    ],
    "topic": [
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}