{
    "additionDate": "2017-01-13T13:14:08Z",
    "biotoolsCURIE": "biotools:cnvkit",
    "biotoolsID": "cnvkit",
    "credit": [
        {
            "email": "boris.bastian@ucsf.edu",
            "name": "Boris C. Bastian",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "CNVkit is a software toolkit to infer and visualize copy number from targeted DNA sequencing data.",
    "documentation": [
        {
            "type": "General",
            "url": "http://cnvkit.readthedocs.io/en/stable/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://github.com/etal/cnvkit",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:53Z",
    "license": "BSD-3-Clause",
    "maturity": "Mature",
    "name": "CNVkit",
    "operatingSystem": [
        "Mac"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "doi": "10.1371/journal.pcbi.1004873",
            "metadata": {
                "abstract": "© 2016 Talevich et al. Germline copy number variants (CNVs) and somatic copy number alterations (SCNAs) are of significant importance in syndromic conditions and cancer. Massively parallel sequencing is increasingly used to infer copy number information from variations in the read depth in sequencing data. However, this approach has limitations in the case of targeted re-sequencing, which leaves gaps in coverage between the regions chosen for enrichment and introduces biases related to the efficiency of target capture and library preparation. We present a method for copy number detection, implemented in the software package CNVkit, that uses both the targeted reads and the nonspecifically captured off-target reads to infer copy number evenly across the genome. This combination achieves both exon-level resolution in targeted regions and sufficient resolution in the larger intronic and intergenic regions to identify copy number changes. In particular, we successfully inferred copy number at equivalent to 100-kilobase resolution genome-wide from a platform targeting as few as 293 genes. After normalizing read counts to a pooled reference, we evaluated and corrected for three sources of bias that explain most of the extraneous variability in the sequencing read depth: GC content, target footprint size and spacing, and repetitive sequences. We compared the performance of CNVkit to copy number changes identified by array comparative genomic hybridization. We packaged the components of CNVkit so that it is straightforward to use and provides visualizations, detailed reporting of significant features, and export options for integration into existing analysis pipelines. CNVkit is freely available from https://github.com/etal/cnvkit.",
                "authors": [
                    {
                        "name": "Talevich E."
                    },
                    {
                        "name": "Shain A.H."
                    },
                    {
                        "name": "Botton T."
                    },
                    {
                        "name": "Bastian B.C."
                    }
                ],
                "citationCount": 115,
                "date": "2016-04-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "CNVkit: Genome-Wide Copy Number Detection and Visualization from Targeted DNA Sequencing"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "DNA structural variation",
            "uri": "http://edamontology.org/topic_3175"
        }
    ],
    "validated": 1
}