{
    "additionDate": "2017-12-18T00:13:40Z",
    "biotoolsCURIE": "biotools:tpms",
    "biotoolsID": "tpms",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://doua.prabi.fr/"
        }
    ],
    "description": "Tree Pattern Matching Suite. It can manage phylogenetic tree collections, root them, query some peculiar pattern, and detect horizontal transfer.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://pbil.univ-lyon1.fr/software/tpms/documentation"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://pbil.univ-lyon1.fr/software/tpms/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/tpms-tree-pattern-matching-suite.html"
        }
    ],
    "name": "TPMS",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-14-109",
            "metadata": {
                "abstract": "Background: The information in large collections of phylogenetic trees is useful for many comparative genomic studies. Therefore, there is a need for flexible tools that allow exploration of such collections in order to retrieve relevant data as quickly as possible.Results: In this paper, we present TPMS (Tree Pattern-Matching Suite), a set of programs for handling and retrieving gene trees according to different criteria. The programs from the suite include utilities for tree collection building, specific tree-pattern search strategies and tree rooting. Use of TPMS is illustrated through three examples: systematic search for incongruencies in a large tree collection, a short study on the Coelomata/Ecdysozoa controversy and an evaluation of the level of support for a recently published Mammal phylogeny.Conclusion: TPMS is a powerful suite allowing to quickly retrieve sets of trees matching complex patterns in large collection or to root trees using more rigorous approaches than the classical midpoint method. As it is made of a set of command-line programs, it can be easily integrated in any sequence analysis pipeline for an automated use. © 2013 Bigot et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Bigot T."
                    },
                    {
                        "name": "Daubin V."
                    },
                    {
                        "name": "Lassalle F."
                    },
                    {
                        "name": "Perriere G."
                    }
                ],
                "citationCount": 4,
                "date": "2013-03-27T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "TPMS: A set of utilities for querying collections of gene trees"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        }
    ],
    "validated": 1
}