{
    "additionDate": "2019-11-14T18:29:33Z",
    "biotoolsCURIE": "biotools:Kankanet",
    "biotoolsID": "Kankanet",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "ariel.yang@stonybrookmedicine.edu",
            "name": "Ariel Yang",
            "orcidid": "https://orcid.org/0000-0003-3993-6087",
            "typeEntity": "Person"
        }
    ],
    "description": "> MEDIUM CONFIDENCE! | > HOMEPAGE MISSING! | An artificial neural network-based object detection smartphone application and mobile microscope as a point-of-care diagnostic aid for soil-transmitted helminthiases | BACKGROUND:Endemic areas for soil-transmitted helminthiases often lack the tools and trained personnel necessary for point-of-care diagnosis. This study pilots the use of smartphone microscopy and an artificial neural network-based (ANN) object detection application named Kankanet to address those two needs. METHODOLOGY PRINCIPAL FINDINGS:A smartphone was equipped with a USB Video Class (UVC) microscope attachment and Kankanet, which was trained to recognize eggs of Ascaris lumbricoides, Trichuris trichiura, and hookworm using a dataset of 2,078 images. It was evaluated for interpretive accuracy based on 185 new images. Fecal samples were processed using Kato-Katz (KK), spontaneous sedimentation technique in tube (SSTT), and Merthiolate-Iodine-Formaldehyde (MIF) techniques",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Microscope image visualisation",
                    "uri": "http://edamontology.org/operation_3552"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31381573",
    "lastUpdate": "2019-11-14T18:29:33Z",
    "name": "Kankanet",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PNTD.0007577",
            "metadata": {
                "abstract": "Copyright: © 2019 Yang et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Background Endemic areas for soil-transmitted helminthiases often lack the tools and trained personnel necessary for point-of-care diagnosis. This study pilots the use of smartphone microscopy and an artificial neural network-based (ANN) object detection application named Kankanet to address those two needs. Methodology/Principal findings A smartphone was equipped with a USB Video Class (UVC) microscope attachment and Kankanet, which was trained to recognize eggs of Ascaris lumbricoides, Trichuris trichiura, and hookworm using a dataset of 2,078 images. It was evaluated for interpretive accuracy based on 185 new images. Fecal samples were processed using Kato-Katz (KK), spontaneous sedimentation technique in tube (SSTT), and Merthiolate-Iodine-Formaldehyde (MIF) techniques. UVC imaging and ANN interpretation of these slides was compared to parasitologist interpretation of standard microscopy.Relative to a gold standard defined as any positive result from parasitologist reading of KK, SSTT, and MIF preparations through standard microscopy, parasitologists reading UVC imaging of SSTT achieved a comparable sensitivity (82.9%) and specificity (97.1%) in A. lumbricoides to standard KK interpretation (97.0% sensitivity, 96.0% specificity). The UVC could not accurately image T. trichiura or hookworm. Though Kankanet interpretation was not quite as sensitive as parasitologist interpretation, it still achieved high sensitivity for A. lumbricoides and hookworm (69.6% and 71.4%, respectively). Kankanet showed high sensitivity for T. trichiura in microscope images (100.0%), but low in UVC images (50.0%). Conclusions/Significance The UVC achieved comparable sensitivity to standard microscopy with only A. lumbricoides. With further improvement of image resolution and magnification, UVC shows promise as a point-of-care imaging tool. In addition to smartphone microscopy, ANN-based object detection can be developed as a diagnostic aid. Though trained with a limited dataset, Kankanet accurately interprets both standard microscope and low-quality UVC images. Kankanet may achieve sensitivity comparable to parasitologists with continued expansion of the image database and improvement of machine learning technology.",
                "authors": [
                    {
                        "name": "Yang A."
                    },
                    {
                        "name": "Bakhtari N."
                    },
                    {
                        "name": "Langdon-Embry L."
                    },
                    {
                        "name": "Redwood E."
                    },
                    {
                        "name": "Lapierre S.G."
                    },
                    {
                        "name": "Rakotomanga P."
                    },
                    {
                        "name": "Rafalimanantsoa A."
                    },
                    {
                        "name": "De Dios Santos J."
                    },
                    {
                        "name": "Vigan-Womas I."
                    },
                    {
                        "name": "Knoblauch A.M."
                    },
                    {
                        "name": "Marcos L.A."
                    }
                ],
                "citationCount": 1,
                "date": "2019-01-01T00:00:00Z",
                "journal": "PLoS Neglected Tropical Diseases",
                "title": "KankaNet: An artificial neural network-based object detection smartphone application and mobile microscope as a point-of-care diagnostic aid for soil-transmitted helminthiases"
            },
            "pmcid": "PMC6695198",
            "pmid": "31381573"
        }
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Parasitology",
            "uri": "http://edamontology.org/topic_3302"
        }
    ]
}