{"credit":[{"email":"hongyu.zhao@yale.edu","name":"Hongyu Zhao","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://zhaocenter.org/"}],"documentation":[{"type":"GENERAL","url":"http://zhaocenter.org/software/#Genetic_Linkage_Analysis"}],"function":[{"operation":[{"term":"Genetic mapping","uri":"http://edamontology.org/operation_0282"}]}],"labels":{"language":["C"],"operatingSystem":["Windows"],"toolType":["Command-line tool"],"topic":[{"term":"Pathology","uri":"http://edamontology.org/topic_0634"},{"term":"Genetics","uri":"http://edamontology.org/topic_3053"},{"term":"Genetic variation","uri":"http://edamontology.org/topic_0199"},{"term":"Mapping","uri":"http://edamontology.org/topic_0102"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/ldmhap-ld-mapping-haplotype-data.html"}],"publication":[{"abstract":"Linkage-disequilibrium (LD) mapping is a powerful tool for fine-mapping disease genes. Recently, McPeek and Strahs [(1999) Am J Hum Genet 65:858-875] proposed a multilocus model for LD mapping based on the decay of haplotype sharing. Here we extend their approach in two ways. First, instead of assuming each marker allele has an equal chance to mutate to one of the other marker alleles, we use the stepwise-mutation model to describe the mutation process for microsatellite markers. Second, in addition to the independence model and the constant population size model they considered, we model the dependence among observed haplotypes due to population structure by using a general conditional-coalescent model with variable population size. Through simulation studies, we study the effects of the stepwise-mutation model and variable population size on the estimates of disease gene location, mutation rate, and time to the most recent common ancestor of the sampled haplotypes. We then use this method to analyze progressive myoclonus epilepsy data. (C) 2000 Wiley-Liss, Inc.","authors":["Zhang S.","Zhao H."],"cit_count":7,"journal":"Genetic Epidemiology","pmid":"11055377","title":"Linkage disequilibrium mapping in populations of variable size using the decay of haplotype sharing and a stepwise-mutation model","year":"2000-10-19"}],"summary":{"biotoolsCURIE":"biotools:ldmhap","biotoolsID":"ldmhap","description":"Program of mapping disease genes (including location and confidence interval) by using haplotypes with disease mutation and the haplotypes without disease mutation (or allele frequencies in normal population).","homepage":"http://zhaocenter.org/software/#Genetic_Linkage_Analysis","name":"LDMhap"}}