{
    "additionDate": "2019-11-14T18:01:54Z",
    "biotoolsCURIE": "biotools:CALIMA",
    "biotoolsID": "CALIMA",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "e.a.l.raaijmakers@tue.nl",
            "name": "E.A.L. Raaijmakers",
            "typeEntity": "Person"
        }
    ],
    "description": "The semi-automated open-source calcium imaging analyzer | CalciumImagingAnalyser is free software for the extraction and analysis of calcium imaging footage. Designed to be fast, user-friendly and portable, it includes such functions as spatiotemporal and network analysis | CALciumIMagingAnalyser (CALIMA) is a free application for the extraction and analysis of calcium imaging data. Read more below or go straight to the download section",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                },
                {
                    "term": "Neurite measurement",
                    "uri": "http://edamontology.org/operation_3450"
                }
            ]
        }
    ],
    "homepage": "https://aethelraed.nl/calima",
    "lastUpdate": "2020-12-10T12:02:02Z",
    "name": "CALIMA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.CMPB.2019.104991",
            "metadata": {
                "abstract": "© 2019 The AuthorsBackground and objective: Ever since its discovery, calcium imaging has proven its worth in discovering new insights into the mechanisms of cellular communication. Yet, the analysis of the data generated by calcium imaging experiments demands a large amount of time from researchers. Tools enabling automated and semi-automated analysis are available, but often they allow automating only a part of the data analysis process. Therefore, we developed CALIMA (https://aethelraed.nl/calima), a free and open-source standalone software tool that provides an opportunity to quickly detect cells, to obtain the calcium spikes, and to determine the underlying network structure of neuronal cell cultures. Methods: Owing to the difference of Gaussians algorithm applied for the cell detection, CALIMA is able to detect regions of interest (ROIs) quickly. The z-scoring algorithm provides a means to set the requirements for spike detection, and the neuronal connections can be reconstructed by analyzing the cross-correlation between the cellular activity. We evaluated CALIMA's reliability, speed, and functionality with a special focus on neuronal cell detection and network reconstruction. The evaluation was performed by using real-life data such as a known example dataset (cultured primary rat cortical neurons, University of Pennsylvania) and by analyzing video graphic footage of in vitro brain cell samples (SH-SY5Y neuroblastoma cultures, one sample with synchronous neuron firing). The obtained results were compared to the corresponding outcomes observed on same datasets for other similar software solutions. Moreover, we compared the results of segmentation and peak detection analysis, the ones obtained using CALIMA and those acquired manually. Results: CALIMA was able to detect the cells in the cultures within seconds. The average sensitivity was 82% across the datasets checked, comparing favorably with the alternative software solutions. Using the correct parameters, CALIMA's Ca-spikes detection sensitivity reached 96%. Lastly, neuronal networks were reconstructed by combining the data on the ROI's activity and the cell's positions, finding the most likely inter-cell connections. Conclusions: We found that CALIMA proved to be a robust and fast tool to analyze the data of experiments for the digital reconstruction of the neuronal cellular network while being able to process the analysis steps with minimal user input required and in a time efficient manner.",
                "authors": [
                    {
                        "name": "Frimat J.P."
                    },
                    {
                        "name": "Luttge R."
                    },
                    {
                        "name": "Raaijmakers E.A.L."
                    },
                    {
                        "name": "Radstake F.D.W."
                    },
                    {
                        "name": "Zinger S."
                    }
                ],
                "citationCount": 3,
                "date": "2019-10-01T00:00:00Z",
                "journal": "Computer Methods and Programs in Biomedicine",
                "title": "CALIMA: The semi-automated open-source calcium imaging analyzer"
            },
            "pmcid": "PMC6718774",
            "pmid": "31443860"
        }
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}
