{
    "additionDate": "2020-01-14T19:30:57Z",
    "biotoolsCURIE": "biotools:LD-annot",
    "biotoolsID": "LD-annot",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Arnaud.Droit@crchudequebec.ulaval.ca",
            "name": "Arnaud Droit",
            "typeEntity": "Person"
        }
    ],
    "description": "A Bioinformatics Tool to Automatically Provide Candidate SNPs With Annotations for Genetically Linked Genes.\n\nPractical program to annotate candidate polymorphism using annotations for genes in genetic linkage in the specific experiment.\n\nA bioinformatics tool to automatically provide annotations for genes included in DNA blocks in linkage disequilibrium with candidate SNPs.\n\nLD-annot estimates experiment-specific linkage disequilibrium to delineate regions genetically linked to each genetic markers from a list of polymorphisms (most often candidate SNPs from GWAS) and provide coordinates and annotations for genes included or overlapping such regions.\n\nEmail: jprunier.1@gmail.com or arnaud.droit@crchudequebec.ulaval.ca",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Linkage disequilibrium calculation",
                    "uri": "http://edamontology.org/operation_0488"
                },
                {
                    "term": "SNP annotation",
                    "uri": "http://edamontology.org/operation_3661"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ArnaudDroitLab/LD-annot",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2020-12-22T10:29:30Z",
    "license": "GPL-3.0",
    "name": "LD-annot",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FGENE.2019.01192",
            "metadata": {
                "abstract": "© Copyright © 2019 Prunier, Lemaçon, Bastien, Jafarikia, Porth, Robert and Droit.A multitude of model and non-model species studies have now taken full advantage of powerful high-throughput genotyping advances such as SNP arrays and genotyping-by-sequencing (GBS) technology to investigate the genetic basis of trait variation. However, due to incomplete genome coverage by these technologies, the identified SNPs are likely in linkage disequilibrium (LD) with the causal polymorphisms, rather than be causal themselves. In addition, researchers could benefit from annotations for the identified candidate SNPs and, simultaneously, for all neighboring genes in genetic linkage. In such case, LD extent estimation surrounding the candidate SNPs is required to determine the regions encompassing genes of interest. We describe here an automated pipeline, “LD-annot,” designed to delineate specific regions of interest for a given experiment and candidate polymorphisms on the basis of LD extent, and furthermore, provide annotations for all genes within such regions. LD-annot uses standard file formats, bioinformatics tools, and languages to provide identifiers, coordinates, and annotations for genes in genetic linkage with each candidate polymorphism. Although the focus lies upon SNP arrays and GBS data as they are being routinely deployed, this pipeline can be applied to a variety of datasets as long as genotypic data are available for a high number of polymorphisms and formatted into a vcf file. A checkpoint procedure in the pipeline allows to test several threshold values for linkage without having to rerun the entire pipeline, thus saving the user computational time and resources. We applied this new pipeline to four different sample sets: two breeding populations GBS datasets, one within-pedigree SNP set coming from whole genome sequencing (WGS), and a very large multi-varieties SNP dataset obtained from WGS, representing variable sample sizes, and numbers of polymorphisms. LD-annot performed within minutes, even when very high numbers of polymorphisms are investigated and thus will efficiently assist research efforts aimed at identifying biologically meaningful genetic polymorphisms underlying phenotypic variation. LD-annot tool is available under a GPL license from https://github.com/ArnaudDroitLab/LD-annot.",
                "authors": [
                    {
                        "name": "Bastien A."
                    },
                    {
                        "name": "Droit A."
                    },
                    {
                        "name": "Jafarikia M."
                    },
                    {
                        "name": "Lemacon A."
                    },
                    {
                        "name": "Porth I."
                    },
                    {
                        "name": "Prunier J."
                    },
                    {
                        "name": "Robert C."
                    }
                ],
                "date": "2019-11-26T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "LD-annot: A Bioinformatics Tool to Automatically Provide Candidate SNPs With Annotations for Genetically Linked Genes"
            },
            "pmcid": "PMC6889475",
            "pmid": "31850063"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ],
    "validated": 1
}
