{
    "accessibility": "Open access",
    "additionDate": "2024-06-17T13:54:57.200400Z",
    "biotoolsCURIE": "biotools:scrank",
    "biotoolsID": "scrank",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "anastasioso@cing.ac.cy",
            "name": "Anastasis Oulas",
            "typeEntity": "Person"
        },
        {
            "name": "George M Spyrou",
            "typeEntity": "Person"
        }
    ],
    "description": "Ranking of cell clusters in a single-cell RNA-sequencing analysis framework using prior knowledge.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/aoulas/scRANK",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-06-17T13:54:57.203216Z",
    "name": "scRANK",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/journal.pcbi.1011550",
            "metadata": {
                "abstract": "Prioritization or ranking of different cell types in a Single-cell RNA Sequencing (scRNA-Seq) framework can be performed in a variety of ways, some of these include: i) obtaining an indication of the proportion of cell types between the different conditions under study, ii) counting the number of differentially expressed genes (DEGs) between cell types and conditions in the experiment or, iii) prioritizing cell types based on prior knowledge about the conditions under study (i.e., a specific disease). These methods have drawbacks and limitations thus novel methods for improving cell ranking are required. Here we present a novel methodology that exploits prior knowledge in combination with expert-user information to accentuate cell types from a scRNA-seq analysis that yield the most biologically meaningful results with respect to a disease under study. Our methodology allows for ranking and prioritization of cell-types based on how well their expression profiles relate to the molecular mechanisms and drugs associated with a disease. Molecular mechanisms, as well as drugs, are incorporated as prior knowledge in a standardized, structured manner. Cell-types are then ranked/ prioritized based on how well results from data-driven analysis of scRNA-seq data match the predefined prior knowledge. In additional cell-cell communication perturbations between disease and control networks are used to further prioritize/rank cell-types. Our methodology has substantial advantages to more traditional cell ranking techniques and provides an informative complementary methodology that utilizes prior knowledge in a rapid and automated manner, that has previously not been attempted by other studies. The current methodology is also implemented as an R package entitled Single Cell Ranking Analysis Toolkit (scRANK) and is available for download and installation via GitHub (https://#hub.com/ aoulas/scRANK).",
                "authors": [
                    {
                        "name": "Karathanasis N."
                    },
                    {
                        "name": "Oulas A."
                    },
                    {
                        "name": "Savva K."
                    },
                    {
                        "name": "Spyrou G.M."
                    }
                ],
                "date": "2024-04-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Ranking of cell clusters in a single-cell RNAsequencing analysis framework using prior knowledge"
            }
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
