{
    "accessibility": "Open access",
    "additionDate": "2022-02-20T16:36:32.925038Z",
    "biotoolsCURIE": "biotools:lncexplore",
    "biotoolsID": "lncexplore",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "182451@cch.org.tw",
            "name": "Ting-Yu Chang",
            "typeEntity": "Person"
        },
        {
            "email": "ifchung@nycu.edu.tw",
            "name": "I-Fang Chung",
            "typeEntity": "Person"
        },
        {
            "name": "Ming Chen"
        },
        {
            "name": "Yi-Wei Lee"
        }
    ],
    "description": "A database of pan-cancer analysis and systematic functional annotation for lncRNAs from RNA-sequencing data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://lncexplore.bmi.nycu.edu.tw/tutorial.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Ensembl gene ID",
                        "uri": "http://edamontology.org/data_1033"
                    }
                },
                {
                    "data": {
                        "term": "Gene symbol",
                        "uri": "http://edamontology.org/data_1026"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                }
            ]
        }
    ],
    "homepage": "http://lncexplore.bmi.nycu.edu.tw",
    "lastUpdate": "2022-02-20T16:36:32.927550Z",
    "name": "lncExplore",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAAB053",
            "metadata": {
                "abstract": "© 2021 The Author(s) 2021. Published by Oxford University Press.Over the past few years, with the rapid growth of deep-sequencing technology and the development of computational prediction algorithms, a large number of long non-coding RNAs (lncRNAs) have been identified in various types of human cancers. Therefore, it has become critical to determine how to properly annotate the potential function of lncRNAs from RNA-sequencing (RNA-seq) data and arrange the robust information and analysis into a useful system readily accessible by biological and clinical researchers. In order to produce a collective interpretation of lncRNA functions, it is necessary to integrate different types of data regarding the important functional diversity and regulatory role of these lncRNAs. In this study, we utilized transcriptomic sequencing data to systematically observe and identify lncRNAs and their potential functions from 5034 The Cancer Genome Atlas RNA-seq datasets covering 24 cancers. Then, we constructed the 'lncExplore' database that was developed to comprehensively integrate various types of genomic annotation data for collective interpretation. The distinctive features in our lncExplore database include (i) novel lncRNAs verified by both coding potential and translation efficiency score, (ii) pan-cancer analysis for studying the significantly aberrant expression across 24 human cancers, (iii) genomic annotation of lncRNAs, such as cis-regulatory information and gene ontology, (iv) observation of the regulatory roles as enhancer RNAs and competing endogenous RNAs and (v) the findings of the potential lncRNA biomarkers for the user-interested cancers by integrating clinical information and disease specificity score. The lncExplore database is to our knowledge the first public lncRNA annotation database providing cancer-specific lncRNA expression profiles for not only known but also novel lncRNAs, enhancer RNAs annotation and clinical analysis based on pan-cancer analysis. lncExplore provides a more complete pathway to highly efficient, novel and more comprehensive translation of laboratory discoveries into the clinical context and will assist in reinterpreting the biological regulatory function of lncRNAs in cancer research. Database URL http://lncexplore.bmi.nycu.edu.tw",
                "authors": [
                    {
                        "name": "Chang T.-Y."
                    },
                    {
                        "name": "Chen M."
                    },
                    {
                        "name": "Chung I.-F."
                    },
                    {
                        "name": "Lee Y.-W."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Database",
                "title": "LncExplore: A database of pan-cancer analysis and systematic functional annotation for lncRNAs from RNA-sequencing data"
            },
            "pmcid": "PMC8407485",
            "pmid": "34464437"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
