{"credit":[{"email":"zlatko.trajanoski@i-med.ac.at","name":"Zlatko Trajanoski (Director)","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://icbi.at/contact.html"}],"documentation":[{"url":"https://memosys.i-med.ac.at/MEMOSys/help.seam"}],"function":[{"operation":[{"term":"Metabolic network modelling","uri":"http://edamontology.org/operation_3660"}]}],"labels":{"language":["Java"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Systems biology","uri":"http://edamontology.org/topic_2259"},{"term":"Endocrinology and metabolism","uri":"http://edamontology.org/topic_3407"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/memosys-2-1-1-metabolic-model-system.html"}],"publication":[{"abstract":"© The Author(s) 2014. The MEtabolic MOdel research and development System (MEMOSys) is a versatile database for the management, storage and development of genome-scale models (GEMs). Since its initial release, the database has undergone major improvements, and the new version introduces several new features. First, the novel concept of derived models allows users to create model hierarchies that automatically propagate modifications along their order. Second, all stored components can now be easily enhanced with additional annotations that can be directly extracted from a supplied Systems Biology Markup Language (SBML) file. Third, the web application has been substantially revised and now features new query mechanisms, an easy search system for reactions and new link-out services to publicly available databases. Fourth, the updated database now contains 20 publicly available models, which can be easily exported into standardized formats for further analysis. Fifth, MEMOSys 2.0 is now also available as a fully configured virtual image and can be found online at http://www.icbi.at/memosys and http://memoys.i-med.ac.at.","authors":["Pabinger S.","Snajder R.","Hardiman T.","Willi M.","Dander A.","Trajanoski Z."],"cit_count":5,"journal":"Database","pmid":"24532766","title":"MEMOSys 2.0: An update of the bioinformatics database for genome-scale models and genomic data","year":"2014-01-01"}],"summary":{"biotoolsCURIE":"biotools:memosys","biotoolsID":"memosys","description":"Web based bioinformatics platform for the management, storage, and development of metabolic models. It supports the development of new models by providing a built in version control system which offers access to the complete reconstruction history.","homepage":"http://icbi.at/software/memosys/memosys.shtml","name":"MEMOSys"}}