{
    "additionDate": "2024-04-19T10:38:47.438759Z",
    "biotoolsCURIE": "biotools:hista",
    "biotoolsID": "hista",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "conradon@ohsu.edu",
            "name": "Donald F. Conrad",
            "typeEntity": "Person"
        }
    ],
    "description": "An interactive molecular scRNA-Seq reference of the human testis.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                }
            ]
        }
    ],
    "homepage": "https://conradlab.shinyapps.io/HISTA",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T14:02:52.261638Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://humantestisatlas.shinyapps.io/humantestisatlas1/"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/eisascience/HISTA"
        }
    ],
    "name": "HISTA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1111/andr.13637",
            "metadata": {
                "abstract": "Background: Single-cell RNA-seq (scRNA-Seq) has been widely adopted to study gene expression of the human testis. Several datasets of scRNA-Seq from human testis have been generated from different groups processed with different informatics pipelines. An integrated atlas of scRNA-Seq expression constructed from multiple donors, developmental ages, and fertility states would be widely useful for the testis research community. Objective: To describe the generation and use of the human infertility single-cell testis atlas (HISTA), an interactive web tool for understanding human spermatogenesis through scRNA-Seq analysis. Methods: We obtained scRNA-Seq datasets derived from 12 donors, including healthy adult controls, juveniles, and several infertility cases, and reprocessed these data using methods to remove batch effects. Using Shiny, an open-source environment for data visualization, we created numerous interactive tools for exploring the data, some of which support simple statistical hypothesis testing. We used the resulting HISTA browser and its underlying data to demonstrate HISTA's value for testis researchers. Results: A primary application of HISTA is to search by a single gene or a set of genes; thus, we present various analyses that quantify and visualize gene expression across the testis cells and pathology. HISTA also contains machine-learning-derived gene modules (“components”) that capture the entire transcriptional landscape of the testis tissue. We show how the use of these components can simplify the highly complex data in HISTA and assist with the interpretation of genes with unknown functions. Finally, we demonstrate the diverse ways HISTA can be used for new data analysis, including hypothesis testing. Discussion and conclusions: HISTA is a research environment that can help scientists organize and understand the high-dimensional transcriptional landscape of the human testis. HISTA has already contributed to published testis research and can be updated as needed with input from the research community or downloaded and modified for individual needs.",
                "authors": [
                    {
                        "name": "Aston K.I."
                    },
                    {
                        "name": "Carrell D.T."
                    },
                    {
                        "name": "Conrad D.F."
                    },
                    {
                        "name": "Daube C."
                    },
                    {
                        "name": "Guo J."
                    },
                    {
                        "name": "Hotaling J.M."
                    },
                    {
                        "name": "Lima A.C."
                    },
                    {
                        "name": "Mahyari E."
                    },
                    {
                        "name": "Vigh-Conrad K.A."
                    }
                ],
                "citationCount": 4,
                "date": "2024-01-01T00:00:00Z",
                "journal": "Andrology",
                "title": "The human infertility single-cell testis atlas (HISTA): an interactive molecular scRNA-Seq reference of the human testis"
            },
            "pmid": "38577799"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
