{
    "additionDate": "2019-11-14T19:38:15Z",
    "biotoolsCURIE": "biotools:Selfish",
    "biotoolsID": "Selfish",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "stelo@cs.ucr.edu",
            "name": "Stefano Lonardi",
            "orcidid": "https://orcid.org/0000-0002-2696-7274",
            "typeEntity": "Person"
        },
        {
            "email": "aroay001@ucr.edu",
            "name": "Abbas Roayaei Ardakany",
            "typeEntity": "Person"
        }
    ],
    "description": "discovery of differential chromatin interactions via a self-similarity measure | SELFISH (Discovery of Differential Chromatin Interactions via a Self-Similarity Measure) is a tool for finding differential chromatin interactions between two Hi-C contact maps. It uses self-similarity to model interactions in a robust way. For more information read the full paper: Selfish: Discovery of Differential Chromatin Interactions via a Self-Similarity Measure. A Python implementation of Selfish is available at Ay-lab",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Residue contact prediction",
                    "uri": "http://edamontology.org/operation_0272"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ucrbioinfo/Selfish",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2020-12-19T14:40:49Z",
    "name": "Selfish",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ362",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Motivation: High-throughput conformation capture experiments, such as Hi-C provide genome-wide maps of chromatin interactions, enabling life scientists to investigate the role of the three-dimensional structure of genomes in gene regulation and other essential cellular functions. A fundamental problem in the analysis of Hi-C data is how to compare two contact maps derived from Hi-C experiments. Detecting similarities and differences between contact maps are critical in evaluating the reproducibility of replicate experiments and for identifying differential genomic regions with biological significance. Due to the complexity of chromatin conformations and the presence of technology-driven and sequence-specific biases, the comparative analysis of Hi-C data is analytically and computationally challenging. Results: We present a novel method called Selfish for the comparative analysis of Hi-C data that takes advantage of the structural self-similarity in contact maps. We define a novel self-similarity measure to design algorithms for (i) measuring reproducibility for Hi-C replicate experiments and (ii) finding differential chromatin interactions between two contact maps. Extensive experimental results on simulated and real data show that Selfish is more accurate and robust than state-of-the-art methods.",
                "authors": [
                    {
                        "name": "Ardakany A.R."
                    },
                    {
                        "name": "Ay F."
                    },
                    {
                        "name": "Lonardi S."
                    }
                ],
                "citationCount": 9,
                "date": "2019-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Selfish: Discovery of differential chromatin interactions via a self-similarity measure"
            },
            "pmcid": "PMC6612869",
            "pmid": "31510653"
        }
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}
