{
    "accessibility": "Open access",
    "additionDate": "2022-07-05T08:58:51.248766Z",
    "biotoolsCURIE": "biotools:pss_r",
    "biotoolsID": "pss_r",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "flutzoni@duke.edu",
            "name": "François Lutzoni",
            "orcidid": "https://orcid.org/0000-0003-4849-7143",
            "typeEntity": "Person"
        },
        {
            "name": "Jolanta Miadlikowska",
            "orcidid": "https://orcid.org/0000-0002-5545-2130"
        },
        {
            "name": "Nicolas Magain",
            "orcidid": "https://orcid.org/0000-0001-5409-9518"
        },
        {
            "name": "Pierre-Luc Chagnon",
            "orcidid": "https://orcid.org/0000-0002-5054-5813"
        }
    ],
    "description": "A new approach that integrates partner availability and phylogenetic diversity to quantify biotic specialization in ecological networks.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic inference",
                    "uri": "http://edamontology.org/operation_0323"
                },
                {
                    "term": "Phylogenetic tree editing",
                    "uri": "http://edamontology.org/operation_0326"
                },
                {
                    "term": "Phylogenetic tree reconciliation",
                    "uri": "http://edamontology.org/operation_3947"
                }
            ]
        }
    ],
    "homepage": "https://github.com/cjpardodelahoz/pss",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-07-05T08:58:51.252041Z",
    "license": "MIT",
    "name": "PSS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1002/ECE3.8649",
            "metadata": {
                "abstract": "© 2022 The Authors. Ecology and Evolution published by John Wiley & Sons Ltd.Biotic specialization holds information about the assembly, evolution, and stability of biological communities. Partner availabilities can play an important role in enabling species interactions, where uneven partner availabilities can bias estimates of biotic specialization when using phylogenetic diversity indices. It is therefore important to account for partner availability when characterizing biotic specialization using phylogenies. We developed an index, phylogenetic structure of specialization (PSS), that avoids bias from uneven partner availabilities by uncoupling the null models for interaction frequency and phylogenetic distance. We incorporate the deviation between observed and random interaction frequencies as weights into the calculation of partner phylogenetic α-diversity. To calculate the PSS index, we then compare observed partner phylogenetic α-diversity to a null distribution generated by randomizing phylogenetic distances among the same number of partners. PSS quantifies the phylogenetic structure (i.e., clustered, overdispersed, or random) of the partners of a focal species. We show with simulations that the PSS index is not correlated with network properties, which allows comparisons across multiple systems. We also implemented PSS on empirical networks of host–parasite, avian seed-dispersal, lichenized fungi–cyanobacteria, and hummingbird pollination interactions. Across these systems, a large proportion of taxa interact with phylogenetically random partners according to PSS, sometimes to a larger extent than detected with an existing method that does not account for partner availability. We also found that many taxa interact with phylogenetically clustered partners, while taxa with overdispersed partners were rare. We argue that species with phylogenetically overdispersed partners have often been misinterpreted as generalists when they should be considered specialists. Our results highlight the important role of randomness in shaping interaction networks, even in highly intimate symbioses, and provide a much-needed quantitative framework to assess the role that evolutionary history and symbiotic specialization play in shaping patterns of biodiversity. PSS is available as an R package at https://github.com/cjpardodelahoz/pss.",
                "authors": [
                    {
                        "name": "Chagnon P.-L."
                    },
                    {
                        "name": "Gibert J.P."
                    },
                    {
                        "name": "Lutzoni F."
                    },
                    {
                        "name": "Magain N."
                    },
                    {
                        "name": "Medeiros I.D."
                    },
                    {
                        "name": "Miadlikowska J."
                    },
                    {
                        "name": "Pardo-De la Hoz C.J."
                    }
                ],
                "citationCount": 2,
                "date": "2022-03-01T00:00:00Z",
                "journal": "Ecology and Evolution",
                "title": "Phylogenetic structure of specialization: A new approach that integrates partner availability and phylogenetic diversity to quantify biotic specialization in ecological networks"
            },
            "pmcid": "PMC8888259",
            "pmid": "35261742"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ],
    "validated": 1
}
