{
    "additionDate": "2019-11-14T19:28:39Z",
    "biotoolsCURIE": "biotools:EMULSION",
    "biotoolsID": "EMULSION",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "sebastien.picault@inra.fr",
            "name": "Sébastien Picault",
            "orcidid": "https://orcid.org/0000-0001-9029-0555",
            "typeEntity": "Person"
        }
    ],
    "description": "Transparent and flexible multiscale stochastic models in human, animal and plant epidemiology | EMULSION Manual — EMULSION (Epidemiological Multi-Level Simulation framework) | Framework EMULSION is intended for modellers in epidemiology, to help them design, simulate, and revise complex mechanistic stochastic models, without having to write or rewrite huge amounts of code",
    "documentation": [
        {
            "type": [
                "Installation instructions"
            ],
            "url": "https://sourcesup.renater.fr/www/emulsion-public/pages/Install.html"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://sourcesup.renater.fr/www/emulsion-public",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-25T14:04:40Z",
    "license": "Apache-2.0",
    "name": "EMULSION",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1007342",
            "metadata": {
                "abstract": "© 2019 Picault et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Stochastic mechanistic epidemiological models largely contribute to better understand pathogen emergence and spread, and assess control strategies at various scales (from withinhost to transnational scale). However, developing realistic models which involve multi-disciplinary knowledge integration faces three major challenges in predictive epidemiology: Lack of readability once translated into simulation code, low reproducibility and reusability, and long development time compared to outbreak time scale. We introduce here EMULSION, an artificial intelligence-based software intended to address those issues and help modellers focus on model design rather than programming. EMULSION defines a domain-specific language to make all components of an epidemiological model (structure, processes, parameters) explicit as a structured text file. This file is readable by scientists from other fields (epidemiologists, biologists, economists), who can contribute to validate or revise assumptions at any stage of model development. It is then automatically processed by EMULSION generic simulation engine, preventing any discrepancy between model description and implementation. The modelling language and simulation architecture both rely on the combination of advanced artificial intelligence methods (knowledge representation and multi-level agent-based simulation), allowing several modelling paradigms (from compartment- to individual- based models) at several scales (up to metapopulation). The flexibility of EMULSION and its capability to support iterative modelling are illustrated here through examples of progressive complexity, including late revisions of core model assumptions. EMULSION is also currently used to model the spread of several diseases in real pathosystems. EMULSION provides a command-line tool for checking models, producing model diagrams, running simulations, and plotting outputs. Written in Python 3, EMULSION runs on Linux, MacOS, and Windows. It is released under Apache-2.0 license. A comprehensive documentation with installation instructions, a tutorial and many examples are available from: Https://sourcesup. renater.fr/www/emulsion-public.",
                "authors": [
                    {
                        "name": "Picault S."
                    },
                    {
                        "name": "Huang Y.-L."
                    },
                    {
                        "name": "Sicard V."
                    },
                    {
                        "name": "Arnoux S."
                    },
                    {
                        "name": "Beaunee G."
                    },
                    {
                        "name": "Ezanno P."
                    }
                ],
                "citationCount": 3,
                "date": "2019-01-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "EMULSION: Transparent and flexible multiscale stochastic models in human, animal and plant epidemiology"
            },
            "pmcid": "PMC6760811",
            "pmid": "31518349"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        }
    ],
    "validated": 1
}