{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://rnmr.nmrfam.wisc.edu/pages/contact/contact.html"}],"documentation":[{"type":"GENERAL","url":"http://rnmr.nmrfam.wisc.edu/pages/help/help.html"}],"function":[{"operation":[{"term":"Visualisation","uri":"http://edamontology.org/operation_0337"}]}],"labels":{"collectionID":["EBI Training Tools"],"language":["R"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool","Library"],"topic":[{"term":"NMR","uri":"http://edamontology.org/topic_0593"},{"term":"Data visualisation","uri":"http://edamontology.org/topic_0092"}]},"publication":[{"abstract":"Despite the extensive use of nuclear magnetic resonance (NMR) for metabolomics, no publicly available tools have been designed for identifying and quantifying metabolites across multiple spectra. We introduce here a new open source software tool, rNMR, which provides a simple graphics-based method for visualizing, identifying, and quantifying metabolites across multiple one-or two-dimensiona lNMR spectra. rNMR differs from existing software tools for NMR spectroscopy in that analyses are based on regions of interest (ROIs) rather than peak lists. ROIs contain all of the underlying NMR data within user-defined chemical shift ranges. ROIs can be inspected visually, and they support robust quantification of NMR signals. ROI-based analyses support simultaneous views of metabolite signals from up to hundreds of spectra, and ROI boundaries can be adjusted dynamically to ensure that signals corresponding to assigned atoms are analyzed consistently throughout the dataset. We describe how rNMR greatly reduces the time required for robust bioanalytical analysis of complex NMR data. An rNMR analysis yields a compact and transparent way of archiving the results from a metabolomics study so that it can be examined and evaluated by others. The rNMR website at http://rnmr.nmrfam.wisc.edu offers downloadable versions of rNMR for Windows, Macintosh, and Linux platforms alongwith extensive help documentation, instructional videos, and sample data. Copyright © 2009 John Wiley & Sons, Ltd.","authors":["Lewis I.A.","Schommer S.C.","Markley J.L."],"cit_count":103,"doi":"10.1002/mrc.2526","journal":"Magnetic Resonance in Chemistry","title":"rNMR: Open source software for identifying and quantifying metabolites in NMR spectra","year":"2009-12-01"}],"summary":{"biotoolsCURIE":"biotools:rnmr","biotoolsID":"rnmr","description":"Open source software package for visualizing and interpreting one and two dimensional NMR data.","homepage":"http://rnmr.nmrfam.wisc.edu/","name":"rNMR"}}