{
    "additionDate": "2018-08-17T18:48:05Z",
    "biotoolsCURIE": "biotools:optflux",
    "biotoolsID": "optflux",
    "credit": [
        {
            "email": "support@optflux.org",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Open-source and modular software to support in silico metabolic engineering tasks aimed at being the reference computational application in the field.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.optflux.org/wiki/index.php/HowTos:OptFlux3"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                }
            ]
        }
    ],
    "homepage": "http://www.optflux.org/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "name": "OptFlux",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/1752-0509-4-45",
            "metadata": {
                "abstract": "Background: Over the last few years a number of methods have been proposed for the phenotype simulation of microorganisms under different environmental and genetic conditions. These have been used as the basis to support the discovery of successful genetic modifications of the microbial metabolism to address industrial goals. However, the use of these methods has been restricted to bioinformaticians or other expert researchers. The main aim of this work is, therefore, to provide a user-friendly computational tool for Metabolic Engineering applications.Results: OptFlux is an open-source and modular software aimed at being the reference computational application in the field. It is the first tool to incorporate strain optimization tasks, i.e., the identification of Metabolic Engineering targets, using Evolutionary Algorithms/Simulated Annealing metaheuristics or the previously proposed OptKnock algorithm. It also allows the use of stoichiometric metabolic models for (i) phenotype simulation of both wild-type and mutant organisms, using the methods of Flux Balance Analysis, Minimization of Metabolic Adjustment or Regulatory on/off Minimization of Metabolic flux changes, (ii) Metabolic Flux Analysis, computing the admissible flux space given a set of measured fluxes, and (iii) pathway analysis through the calculation of Elementary Flux Modes.OptFlux also contemplates several methods for model simplification and other pre-processing operations aimed at reducing the search space for optimization algorithms.The software supports importing/exporting to several flat file formats and it is compatible with the SBML standard. OptFlux has a visualization module that allows the analysis of the model structure that is compatible with the layout information of Cell Designer, allowing the superimposition of simulation results with the model graph.Conclusions: The OptFlux software is freely available, together with documentation and other resources, thus bridging the gap from research in strain optimization algorithms and the final users. It is a valuable platform for researchers in the field that have available a number of useful tools. Its open-source nature invites contributions by all those interested in making their methods available for the community.Given its plug-in based architecture it can be extended with new functionalities. Currently, several plug-ins are being developed, including network topology analysis tools and the integration with Boolean network based regulatory models. © 2010 Rocha et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Rocha I."
                    },
                    {
                        "name": "Maia P."
                    },
                    {
                        "name": "Evangelista P."
                    },
                    {
                        "name": "Vilaca P."
                    },
                    {
                        "name": "Soares S."
                    },
                    {
                        "name": "Pinto J.P."
                    },
                    {
                        "name": "Nielsen J."
                    },
                    {
                        "name": "Patil K.R."
                    },
                    {
                        "name": "Ferreira E.C."
                    },
                    {
                        "name": "Rocha M."
                    }
                ],
                "citationCount": 251,
                "date": "2010-04-19T00:00:00Z",
                "journal": "BMC Systems Biology",
                "title": "OptFlux: An open-source software platform for in silico metabolic engineering"
            }
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        }
    ],
    "validated": 1
}