{
    "additionDate": "2021-01-18T07:11:20Z",
    "biotoolsCURIE": "biotools:es3",
    "biotoolsID": "es3",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "paige.newman@mq.edu.au",
            "name": "Paige Martin",
            "orcidid": "https://orcid.org/0000-0002-6157-4740",
            "typeEntity": "Person"
        }
    ],
    "description": "Combining machine learning and crowd-sourcing to create a shared space for updating systematic reviews.\n\nFormerly known as trial2rev.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "https://github.com/evidence-surveillance/trial2rev",
    "language": [
        "JavaScript",
        "Python",
        "SQL"
    ],
    "lastUpdate": "2021-03-04T09:10:52Z",
    "license": "MIT",
    "name": "Evidence Surveillance Synthesis and Sharing",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/JAMIAOPEN/OOY062",
            "metadata": {
                "abstract": "© 2019 The Author(s).Objectives: Systematic reviews of clinical trials could be updated faster by automatically monitoring relevant trials as they are registered, completed, and reported. Our aim was to provide a public interface to a database of curated links between systematic reviews and trial registrations. Materials and Methods: We developed the server-side system components in Python, connected them to a PostgreSQL database, and implemented the web-based user interface using Javascript, HTML, and CSS. All code is available on GitHub under an open source MIT license and registered users can access and download all available data. Results: The trial2rev system is a web-based interface to a database that collates and augments information from multiple sources including bibliographic databases, the ClinicalTrials.gov registry, and the actions of registered users. Users interact with the system by browsing, searching, or adding systematic reviews, verifying links to trials included in the review, and adding or voting on trials that they would expect to include in an update of the systematic review. The system can trigger the actions of software agents that add or vote on included and relevant trials, in response to user interactions or by scheduling updates from external resources. Discussion and Conclusion: We designed a publicly-accessible resource to help systematic reviewers make decisions about systematic review updates. Where previous approaches have sought to reactively filter published reports of trials for inclusion in systematic reviews, our approach is to proactively monitor for relevant trials as they are registered and completed.",
                "authors": [
                    {
                        "name": "Bashir R."
                    },
                    {
                        "name": "Bourgeois F.T."
                    },
                    {
                        "name": "Dunn A.G."
                    },
                    {
                        "name": "Martin P."
                    },
                    {
                        "name": "Surian D."
                    }
                ],
                "citationCount": 8,
                "date": "2019-01-11T00:00:00Z",
                "journal": "JAMIA Open",
                "title": "Trial2rev: Combining machine learning and crowd-sourcing to create a shared space for updating systematic reviews"
            },
            "pmcid": "PMC6951914",
            "pmid": "31984340"
        }
    ],
    "topic": [
        {
            "term": "Data submission, annotation and curation",
            "uri": "http://edamontology.org/topic_0219"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ]
}
