{
    "additionDate": "2021-01-18T10:58:11Z",
    "biotoolsCURIE": "biotools:ipsi",
    "biotoolsID": "ipsi",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mariateresa.mariucci@ingv.it",
            "name": "Maria Teresa Mariucci",
            "orcidid": "https://orcid.org/0000-0001-6029-1514",
            "typeEntity": "Person"
        }
    ],
    "description": "Database of Italian present-day stress indicators, IPSI 1.4.\n\nThe database IPSI is licensed under a.\n\nCreative Commons Attribution 4.0.\n\nIPSI database, \"Italian Present-day Stress Indicators\", is a georeferenced repository of information on the crustal present-day stress field maintained at INGV. It consists of horizontal stress orientations analysed and compiled in a standardized format and quality-ranked for reliability and comparability on a global scale. Nowadays the database contains 928 data records updated to January 2020. The next update will be until December 2020 and is scheduled to be released within the first months of 2021.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://ipsi.rm.ingv.it/",
    "lastUpdate": "2021-02-11T09:50:52Z",
    "name": "IPSI",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1038/S41597-020-00640-W",
            "metadata": {
                "abstract": "© 2020, The Author(s).The Italian Present-day Stress Indicators (IPSI) database is a freely available Italian georeferenced repository of information regarding the crustal stress field. It consists of horizontal stress orientations that have been analysed, compiled in a standardised format and quality-ranked for reliability and comparability on a global scale. The database contains a collection of information regarding contemporary stress within the shallow crust from the following main stress-indicator categories: borehole breakouts; earthquake focal mechanisms; seismic sequences and active fault-slip data. The present database (IPSI 1.4) released in January 2020 is accessible through a web interface which facilitates findability, accessibility, interoperability and reusability of the dataset. Moreover, it contains 928 records updated up until December 2019 with an increase of 10% with respect to the first one, and improved metadata information. The uniform spread of stress data over a given territory is relevant for earth crustal modelling or as starting point in many applied studies. It is therefore necessary to continue collecting new data and update present-day stress maps to obtain more reliable evaluations.",
                "authors": [
                    {
                        "name": "Mariucci M.T."
                    },
                    {
                        "name": "Montone P."
                    }
                ],
                "citationCount": 1,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Scientific Data",
                "title": "Database of Italian present-day stress indicators, IPSI 1.4"
            },
            "pmcid": "PMC7479623",
            "pmid": "32901031"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Biological databases",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        }
    ]
}