{
    "additionDate": "2018-05-22T16:47:57Z",
    "biotoolsCURIE": "biotools:polysearch2",
    "biotoolsID": "polysearch2",
    "credit": [
        {
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://feedback.wishartlab.com/?site=polysearch2"
        }
    ],
    "description": "Significantly improved text-mining system for discovering associations between human diseases, genes, drugs, metabolites, toxins and more.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://polysearch.cs.ualberta.ca/dochelp"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Relation extraction",
                    "uri": "http://edamontology.org/operation_3625"
                }
            ]
        }
    ],
    "homepage": "http://polysearch.cs.ualberta.ca/",
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "PolySearch2",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/NAR/GKV383",
            "metadata": {
                "abstract": "© 2015 The Author(s).PolySearch2 (http://polysearch.ca) is an online textmining system for identifying relationships between biomedical entities such as human diseases, genes, SNPs, proteins, drugs, metabolites, toxins, metabolic pathways, organs, tissues, subcellular organelles, positive health effects, negative health effects, drug actions, Gene Ontology terms, MeSH terms, ICD- 10 medical codes, biological taxonomies and chemical taxonomies. PolySearch2 supports a generalized 'Given X, find all associated Ys' query, where X and Y can be selected from the aforementioned biomedical entities. An example query might be: 'Find all diseases associated with Bisphenol A'. To find its answers, PolySearch2 searches for associations against comprehensive collections of free-text collections, including local versions of MEDLINE abstracts, PubMed Central full-text articles, Wikipedia full-text articles and US Patent application abstracts. PolySearch2 also searches 14 widely used, text-rich biological databases such as UniProt, DrugBank and Human Metabolome Database to improve its accuracy and coverage. PolySearch2 maintains an extensive thesaurus of biological terms and exploits the latest search engine technology to rapidly retrieve relevant articles and databases records. PolySearch2 also generates, ranks and annotates associative candidates and present results with relevancy statistics and highlighted key sentences to facilitate user interpretation.",
                "authors": [
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Liang Y."
                    },
                    {
                        "name": "Wishart D."
                    }
                ],
                "citationCount": 63,
                "date": "2015-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PolySearch2: A significantly improved text-mining system for discovering associations between human diseases, genes, drugs, metabolites, toxins and more"
            },
            "pmcid": "PMC4489268",
            "pmid": "25925572"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Toxicology",
            "uri": "http://edamontology.org/topic_2840"
        }
    ],
    "validated": 1
}