{"collectionID": [], "accessibility": [], "topic": [{"term": "Phylogenetics", "uri": "http://edamontology.org/topic_3293"}, {"term": "Genomics", "uri": "http://edamontology.org/topic_0622"}, {"term": "Cell biology", "uri": "http://edamontology.org/topic_2229"}], "owner": "mbs_import", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": null, "note": null, "version": null, "pmid": "25721538", "type": null, "pmcid": null, "metadata": {"title": "MitoPhAST, a new automated mitogenomic phylogeny tool in the post-genomic era with a case study of 89 decapod mitogenomes including eight new freshwater crayfish mitogenomes", "abstract": "© 2015 Elsevier Inc.The increased rate at which complete mitogenomes are being sequenced and their increasing use for phylogenetic studies have resulted in a bioinformatic bottleneck in preparing and utilising such data for phylogenetic analysis. Hence, we present MitoPhAST, an automated tool that (1) identifies annotated protein-coding gene features and generates a standardised, concatenated and partitioned amino acid alignment directly from complete/partial GenBank/EMBL-format mitogenome flat files, (2) generates a maximum likelihood phylogenetic tree using optimised protein models and (3) reports various mitochondrial genes and sequence information in a table format. To demonstrate the capacity of MitoPhAST in handling a large dataset, we used 81 publicly available decapod mitogenomes, together with eight new complete mitogenomes of Australian freshwater crayfishes, including the first for the genus Gramastacus, to undertake an updated test of the monophyly of the major groups of the order Decapoda and their phylogenetic relationships. The recovered phylogenetic trees using both Bayesian and ML methods support the results of studies using fragments of mtDNA and nuclear markers and other smaller-scale studies using whole mitogenomes. In comparison to the fragment-based phylogenies, nodal support values are generally higher despite reduced taxon sampling suggesting there is value in utilising more fully mitogenomic data. Additionally, the simple table output from MitoPhAST provides an efficient summary and statistical overview of the mitogenomes under study at the gene level, allowing the identification of missing or duplicated genes and gene rearrangements. The finding of new mtDNA gene rearrangements in several genera of Australian freshwater crayfishes indicates that this group has undergone an unusually high rate of evolutionary change for this organelle compared to other major families of decapod crustaceans. As a result, freshwater crayfishes are likely to be a useful model for studies designed to understand the evolution of mtDNA rearrangements. We anticipate that our bioinformatics pipeline will substantially help mitogenome-based studies increase the speed, accuracy and efficiency of phylogenetic studies utilising mitogenome information. MitoPhAST is available for download at https://github.com/mht85/MitoPhAST.", "citationCount": 16, "authors": [{"name": "Tan M.H."}, {"name": "Gan H.M."}, {"name": "Schultz M.B."}, {"name": "Austin C.M."}], "date": "2015-04-01T00:00:00Z", "journal": "Molecular Phylogenetics and Evolution"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": "Tan Mun Hua", "url": "https://github.com/mht85/MitoPhAST", "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "tan.mun.hua@monash.edu"}], "biotoolsCURIE": "biotools:mitophast", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "https://github.com/mht85/MitoPhAST", "function": [{"note": null, "input": [], "operation": [{"term": "Phylogenetic tree analysis", "uri": "http://edamontology.org/operation_0324"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:50Z", "otherID": [], "description": "New automated mitogenomic phylogeny tool in the post-genomic era with a case study of 89 decapod mitogenomes including eight new freshwater crayfish mitogenomes.", "toolType": ["Command-line tool"], "editPermission": {"type": "private", "authors": []}, "language": ["Perl", "Python"], "link": [{"url": "http://www.mybiosoftware.com/mitophast-1-0-mitogenome-phylogenetic-analysis-of-sequences-tool.html", "note": null, "type": "Software catalogue"}], "biotoolsID": "mitophast", "additionDate": "2017-08-03T18:51:34Z", "name": "MitoPhAST", "license": null, "documentation": [{"url": "https://github.com/mht85/MitoPhAST/blob/master/README.txt", "note": null, "type": "General"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux"]}