{
    "additionDate": "2021-01-18T10:33:10Z",
    "biotoolsCURIE": "biotools:pycurv",
    "biotoolsID": "pycurv",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "antonio.martnezsanchez@med.uni-goettingen.de",
            "name": "Antonio Martínez-Sánchez",
            "orcidid": "https://orcid.org/0000-0002-5865-2138",
            "typeEntity": "Person"
        }
    ],
    "description": "Reliable estimation of membrane curvature for cryo-electron tomography.\n\nThis Python-based software was developed mainly to analyse curvature of membranes in 3D originating from high-resolution, noisy cryo-electron tomograms. Additionally, the software was also applied to other volumetric data with segmented structures or directly surface data, e.g. brain or organs from MRI and cells from confocal light microscopy. Accepted image data formats are: MRC, EM, VTI, NII. Accepted surface data formats are: VTP, VTK, STL, PLY.\n\nMoreover, the software can be used to calculate distances between two adjacent membranes and thicknesses of a membrane organelle.\n\nFurthermore, the software enables to calculate density distribution of particles mapped on a membrane, e.g. membrane-bound ribosomes.\n\nThis package contains Python scripts applying the PyCurv package and combining different functions into the workflows described above, the main are:.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid curvature calculation",
                    "uri": "http://edamontology.org/operation_0461"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/kalemaria/pycurv",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-30T14:58:29Z",
    "license": "LGPL-3.0",
    "name": "PyCurv",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1007962",
            "metadata": {
                "abstract": "Copyright: © 2020 Salfer et al.Curvature is a fundamental morphological descriptor of cellular membranes. Cryo-electron tomography (cryo-ET) is particularly well-suited to visualize and analyze membrane morphology in a close-to-native state and molecular resolution. However, current curvature estimation methods cannot be applied directly to membrane segmentations in cryo-ET, as these methods cannot cope with some of the artifacts introduced during image acquisition and membrane segmentation, such as quantization noise and open borders. Here, we developed and implemented a Python package for membrane curvature estimation from tomogram segmentations, which we named PyCurv. From a membrane segmentation, a signed surface (triangle mesh) is first extracted. The triangle mesh is then represented by a graph, which facilitates finding neighboring triangles and the calculation of geodesic distances necessary for local curvature estimation. PyCurv estimates curvature based on tensor voting. Beside curvatures, this algorithm also provides robust estimations of surface normals and principal directions. We tested PyCurv and three well-established methods on benchmark surfaces and biological data. This revealed the superior performance of PyCurv not only for cryo-ET, but also for data generated by other techniques such as light microscopy and magnetic resonance imaging. Altogether, PyCurv is a versatile open-source software to reliably estimate curvature of membranes and other surfaces in a wide variety of applications.",
                "authors": [
                    {
                        "name": "Baumeister W."
                    },
                    {
                        "name": "Collado J.F."
                    },
                    {
                        "name": "FernandezBusnadiego R."
                    },
                    {
                        "name": "Martinez-Sanchez A."
                    },
                    {
                        "name": "Salfer M."
                    }
                ],
                "date": "2020-08-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Reliable estimation of membrane curvature for cryo-electron tomography"
            },
            "pmcid": "PMC7444595",
            "pmid": "32776920"
        }
    ],
    "topic": [
        {
            "term": "Electron microscopy",
            "uri": "http://edamontology.org/topic_0611"
        },
        {
            "term": "Light microscopy",
            "uri": "http://edamontology.org/topic_3385"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ]
}
