{
    "additionDate": "2021-10-12T14:08:00.659281Z",
    "biotoolsCURIE": "biotools:mofi",
    "biotoolsID": "mofi",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "wolfgang.esser-skala@plus.ac.at",
            "name": "Wolfgang Esser-Skala",
            "orcidid": "https://orcid.org/0000-0002-7350-4045",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://wolfgang.esser-skala.at"
        }
    ],
    "description": "MoFi annotates glycoprotein mass spectra by integrating hybrid data from the intact protein and glycopeptide level.",
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/cdl-biosimilars/mofi/releases/tag/v1.1",
            "version": "1.1"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/cdl-biosimilars/mofi/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-10-12T14:15:34.971531Z",
    "license": "MIT",
    "maturity": "Mature",
    "name": "MoFi",
    "operatingSystem": [
        "Windows",
        "Linux"
    ],
    "owner": "wolfgang.esser-skala",
    "publication": [
        {
            "doi": "10.1021/acs.analchem.8b00019",
            "metadata": {
                "abstract": "© 2018 American Chemical Society.Hybrid mass spectrometry (MS) is an emerging technique for characterizing glycoproteins, which typically display pronounced microheterogeneity. Since hybrid MS combines information from different experimental levels, it crucially depends on computational methods. Here, we describe a novel software tool, MoFi, which integrates hybrid MS data to assign glycans and other post-translational modifications (PTMs) in deconvoluted mass spectra of intact proteins. Its two-stage search algorithm first assigns monosaccharide/PTM compositions to each peak and then compiles a hierarchical list of glycan combinations compatible with these compositions. Importantly, the program only includes those combinations which are supported by a glycan library as derived from glycopeptide or released glycan analysis. By applying MoFi to mass spectra of rituximab, ado-trastuzumab emtansine, and recombinant human erythropoietin, we demonstrate how integration of bottom-up data may be used to refine information collected at the intact protein level. Accordingly, our software reveals that a single mass frequently can be explained by a considerable number of glycoforms. Yet, it simultaneously ranks proteoforms according to their probability, based on a score which is calculated from relative glycan abundances. Notably, glycoforms that comprise identical glycans may nevertheless differ in score if those glycans occupy different sites. Hence, MoFi exposes different layers of complexity that are present in the annotation of a glycoprotein mass spectrum.",
                "authors": [
                    {
                        "name": "Skala W."
                    },
                    {
                        "name": "Wohlschlager T."
                    },
                    {
                        "name": "Senn S."
                    },
                    {
                        "name": "Huber G.E."
                    },
                    {
                        "name": "Huber C.G."
                    }
                ],
                "citationCount": 14,
                "date": "2018-05-01T00:00:00Z",
                "journal": "Analytical Chemistry",
                "title": "MoFi: A Software Tool for Annotating Glycoprotein Mass Spectra by Integrating Hybrid Data from the Intact Protein and Glycopeptide Level"
            },
            "pmid": "29624378",
            "type": [
                "Primary"
            ],
            "version": "1.1"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "version": [
        "1.1"
    ]
}