
{
    "credit": [
        {
            "email": "patrice.duroux@igh.cnrs.fr",
            "name": "Patrice duroux",
            "typeRoles": [
            ]
        },
        {
            "email": "sofia.kossida@igh.cnrs.fr",
            "name": "Sofia Kossida",
            "typeRoles": [
            ]
        },
        {
            "email": "joumana.michaloud@igh.cnrs.fr",
            "name": "Joumana Michaloud",
            "typeRoles": [
            ]
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://www.imgt.org/GeneInfoServlets/htdocs/Documentation.html"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Keyword",
                        "uri": "http://edamontology.org/data_0968"
                    },
                    "format": [
                        {
                            "term": "HTML",
                            "uri": "http://edamontology.org/format_2331"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Genetic map",
                        "uri": "http://edamontology.org/data_1278"
                    },
                    "format": [
                        {
                            "term": "HTML",
                            "uri": "http://edamontology.org/format_2331"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Nucleic acid sequence",
                        "uri": "http://edamontology.org/data_2977"
                    },
                    "format": [
                        {
                            "term": "HTML",
                            "uri": "http://edamontology.org/format_2331"
                        }
                    ]
                }
            ]
        }
    ],
    "labels": {
        "topic": [
            {
                "term": "Immunoinformatics",
                "uri": "http://edamontology.org/topic_3948"
            },
            {
                "term": "Immunogenetics",
                "uri": "http://edamontology.org/topic_3930"
            }
        ]
    },
    "publication": [
        {
            "abstract": "IMGT/GeneInfo is a user-friendly online information system that provides information on data resulting from the complex mechanisms of immunoglobulin (IG) and T cell receptor (TR) V(D)J recombinations. For the first time, it is possible to visualize all the rearrangement parameters on a single page. IMGT/GeneInfo is part of the international ImMunoGeneTics information system® (IMGT), a high-quality integrated knowledge resource specializing in IG, TR, major histocompatibility complex (MHC), and related proteins of the immune system of human and other vertebrate species. The IMGT/GeneInfo system was developed by the TIMC and ICH laboratories (with the collaboration of LIGM), and is the first example of an external system being incorporated into IMGT. In this paper, we report the first part of this work. IMGT/GeneInfo deals with the human and mouse TRA/TRD and TRB loci of the TR. Data handling and visualization are complementary to the current data and tools in IMGT, and will subsequently allow the modelling of V(D)J gene use, and thus, to predict non-standard recombination profiles which may eventually be found in conditions such as leukaemias or lymphomas. Access to IMGT/GeneInfo is free and can be found at http://imgt.cines.fr/GeneInfo.",
            "authors": [
                "Baum T.-P.",
                "Pasqual N.",
                "Thuderoz F.",
                "Hierle V.",
                "Chaume D.",
                "Lefranc M.-P.",
                "Jouvin-Marche E.",
                "Marche P.-N.",
                "Demongeot J."
            ],
            "cit_count": 24,
            "journal": "Nucleic Acids Research",
            "pmid": "14681357",
            "title": "IMGT/GeneInfo: Enhancing V(D)J recombination database accessibility",
            "year": "2004-01-01"
        },
        {
            "abstract": "Background: Adaptative immune repertoire diversity in vertebrate species is generated by recombination of variable (V), diversity (D) and joining (J) genes in the immunoglobulin (IG) loci of B lymphocytes and in the T cell receptor (TR) loci of T lymphocytes. These V-J and V-D-J gene rearrangements at the DNA level involve recombination signal sequences (RSS). Whereas many data exist, they are scattered in non specialized resources with different nomenclatures (eg. flat files) and are difficult to extract. Description: IMGT/GeneInfo is an online information system that provides, through a user-friendly interface, exhaustive information resulting from the complex mechanisms of T cell receptor V-J and V-D-J recombinations. T cells comprise two populations which express the αβ and γδ TR, respectively. The first version of the system dealt with the Homo sapiens and Mus musculus TRA and TRB loci whose gene rearrangements allow the synthesis of the αβ TR chains. In this paper, we present the second version of IMGT/GeneInfo where we complete the database for the Homo sapiens and Mus musculus TRG and TRD loci along with the introduction of a quality control procedure for existing and new data. We also include new functionalities to the four loci analysis, giving, to date, a very informative tool which allows to work on V(D)J genes of all TR loci in both human and mouse species. IMGT/GeneInfo provides more than 59,000 rearrangement combinations with a full gene description which is freely available at http://imgt.cines.fr/GeneInfo. Conclusion: IMGT/GeneInfo allows all TR information sequences to be in the same spot, and are now available within two computer-mouse clicks. This is useful for biologists and bioinformaticians for the study of T lymphocyte V(D)J gene rearrangements and their applications in immune response analysis. © 2006 Baum et al; licensee BioMed Central Ltd.",
            "authors": [
                "Baum T.-P.",
                "Hierle V.",
                "Pasqual N.",
                "Bellahcene F.",
                "Chaume D.",
                "Lefranc M.-P.",
                "Jouvin-Marche E.",
                "Marche P.N.",
                "Demongeot J."
            ],
            "cit_count": 12,
            "journal": "BMC Bioinformatics",
            "pmid": "16640788",
            "title": "IMGT/GeneInfo: T cell receptor gamma TRG and delta TRD genes in database give access to all TR potential V(D)J recombinations",
            "year": "2006-04-26"
        },
        {
            "abstract": "© The Author(s) 2014. Published by Oxford University Press on behalf of Nucleic Acids Research.IMGT, the international ImMunoGeneTics information system (http://www.imgt.org) is the global reference in immunogenetics and immunoinformatics. By its creation in 1989 by Marie-Paule Lefranc (Université de Montpellier and CNRS), IMGT marked the advent of immunoinformatics, which emerged at the interface between immunogenetics and bioinformatics. IMGT is specialized in the immunoglobulins (IG) or antibodies, T cell receptors (TR), major histocompatibility (MH) and proteins of the IgSF and MhSF superfamilies. IMGT is built on the IMGTONTOLOGY axioms and concepts, which bridged the gap between genes, sequences and 3D structures. The concepts include the IMGTR standardized keywords (identification), IMGTR standardized labels (description), IMGTR standardized nomenclature (classification), IMGT unique numbering and IMGT Colliers de Perles (numerotation). IMGTR comprises 7 databases, 17 online tools and 15 000 pages of web resources, and provides a high-quality and integrated system for analysis of the genomic and expressed IG and TR repertoire of the adaptive immune responses, including NGS high-throughput data. Tools and databases are used in basic, veterinary and medical research, in clinical applications (mutation analysis in leukemia and lymphoma) and in antibody engineering and humanization. The IMGT/mAb-DB interface was developed for therapeutic antibodies and fusion proteins for immunological applications (FPIA). IMGTR is freely available at http://www.imgt.org.",
            "authors": [
                "Lefranc M.-P.",
                "Giudicelli V.",
                "Duroux P.",
                "Jabado-Michaloud J.",
                "Folch G.",
                "Aouinti S.",
                "Carillon E.",
                "Duvergey H.",
                "Houles A.",
                "Paysan-Lafosse T.",
                "Hadi-Saljoqi S.",
                "Sasorith S.",
                "Lefranc G.",
                "Kossida S."
            ],
            "cit_count": 149,
            "journal": "Nucleic Acids Research",
            "pmid": "25378316",
            "title": "IMGT R, the international ImMunoGeneTics information system R 25 years on",
            "year": "2015-01-28"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:IMGT_GeneInfo",
        "biotoolsID": "IMGT_GeneInfo",
        "description": "IMGT/GeneInfo is the IMGT® tool providing combination (V-J and V-V) information for the human and mouse T cell receptor (TR) loci. Analysis is based on the IMGT-ONTOLOGY concepts.",
        "homepage": "http://www.imgt.org/GeneInfoServlets/htdocs/",
        "name": "IMGT GeneInfo"
    }
}