{
    "additionDate": "2018-05-22T15:36:29Z",
    "biotoolsCURIE": "biotools:subpatcnv",
    "biotoolsID": "subpatcnv",
    "credit": [
        {
            "email": "kuang@cs.umn.edu",
            "name": "Kuang R.",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "njohnson@cs.umn.edu",
            "name": "Johnson N.",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Approximate subspace pattern mining for mapping copy-number variations.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://sourceforge.net/projects/subpatcnv/?source=navbar"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Copy number estimation",
                    "uri": "http://edamontology.org/operation_3233"
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/projects/subpatcnv/",
    "language": [
        "C++",
        "MATLAB"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "SubPatCNV",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/S12859-014-0426-7",
            "metadata": {
                "abstract": "© Johnson et al.Background: Many DNA copy-number variations (CNVs) are known to lead to phenotypic variations and pathogenesis. While CNVs are often only common in a small number of samples in the studied population or patient cohort, previous work has not focused on customized identification of CNV regions that only exhibit in subsets of samples with advanced data mining techniques to reliably answer questions such as \"Which are all the chromosomal fragments showing nearly identical deletions or insertions in more than 30% of the individuals?\". Results: We introduce a tool for mining CNV subspace patterns, namely SubPatCNV, which is capable of identifying all aberrant CNV regions specific to arbitrary sample subsets larger than a support threshold. By design, SubPatCNV is the implementation of a variation of approximate association pattern mining algorithm under a spatial constraint on the positional CNV probe features. In benchmark test, SubPatCNV was applied to identify population specific germline CNVs from four populations of HapMap samples. In experiments on the TCGA ovarian cancer dataset, SubPatCNV discovered many large aberrant CNV events in patient subgroups, and reported regions enriched with cancer relevant genes. In both HapMap data and TCGA data, it was observed that SubPatCNV employs approximate pattern mining to more effectively identify CNV subspace patterns that are consistent within a subgroup from high-density array data. Conclusions: SubPatCNV available through http://sourceforge.net/projects/subpatcnv/ is a unique scalable open-source software tool that provides the flexibility of identifying CNV regions specific to sample subgroups of different sizes from high-density CNV array data.",
                "authors": [
                    {
                        "name": "Fang G."
                    },
                    {
                        "name": "Johnson N."
                    },
                    {
                        "name": "Kuang R."
                    },
                    {
                        "name": "Kumar V."
                    },
                    {
                        "name": "Zhang H."
                    }
                ],
                "date": "2015-01-16T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SubPatCNV: Approximate subspace pattern mining for mapping copy-number variations"
            },
            "pmcid": "PMC4305219",
            "pmid": "25591662"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Nucleic acid sites, features and motifs",
            "uri": "http://edamontology.org/topic_3511"
        },
        {
            "term": "Nucleic acids",
            "uri": "http://edamontology.org/topic_0077"
        }
    ],
    "validated": 1
}
