{
    "additionDate": "2019-11-14T18:15:33Z",
    "biotoolsCURIE": "biotools:BISON-brain",
    "biotoolsID": "BISON-brain",
    "confidence_flag": "tool",
    "description": "Brain tISue segmentatiON pipeline using T1-weighted magnetic resonance images and a random forests classifier | Abstract Introduction Accurate differentiation of brain tissue types from T1-weighted magnetic resonance images (MRIs) is a critical requirement in many neuroscience and clinical applications. Accurate automated tissue segmentation is challenging due to the variabilities in the tissue intensity profiles caused by differences in scanner models and acquisition protocols, in addition to the varying age of the subjects and potential presence of pathology. In this paper, we present BISON (Brain tISue segmentatiON), a new pipeline for tissue segmentation. Methods BISON performs tissue segmentation using a random forests classifier and a set of intensity and location priors obtained based on T1-weighted images",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://nist.mni.mcgill.ca/?p=2148",
    "lastUpdate": "2020-12-09T14:14:12Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://www.dropbox.com/sh/3lla6vy8nubi49q/AAD5thGh2pmcycEEeHvn48Hza?dl=0"
        }
    ],
    "name": "BISON",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1101/747998"
        },
        {
            "doi": "10.1002/mrm.28547",
            "metadata": {
                "abstract": "© 2020 International Society for Magnetic Resonance in MedicinePurpose: Tissue segmentation from T1-weighted (T1W) MRI is a critical requirement in many neuroscience and clinical applications. However, accurate tissue segmentation is challenging because of the variabilities in tissue intensity profiles caused by differences in scanner models, acquisition protocols, and age. In addition, many methods assume healthy anatomy and fail in the presence of pathology such as white matter hyperintensities (WMHs). We present BISON (Brain tISsue segmentatiON), a new pipeline for tissue segmentation using a random forest classifier and a set of intensity and location priors based on T1W MRI. Methods: BISON was developed and cross-validated using multiscanner manual labels of 72 subjects aged 5 to 96 years. We also assessed the test–retest reliability of BISON on two data sets: 20 subjects with scan/rescan MR images and manual segmentations and 90 scans from a single individual. The results were compared against Atropos, a state-of-the-art commonly used tissue classification method from advanced normalization tools (ANTs). Results: BISON cross-validation dice kappa values against manual segmentations of 72 MRI volumes yielded κGM = 0.88, κWM = 0.85, κCSF = 0.77, outperforming Atropos (κGM = 0.79, κWM = 0.84, κCSF = 0.64), test–retest values on 20 subjects of κGM = 0.94, κWM = 0.92, κCSF = 0.77 outperforming both manual (κGM = 0.92, κWM = 0.91, κCSF =0.74) and Atropos (κGM = 0.87, κWM = 0.92, κCSF = 0.79). Finally, BISON outperformed Atropos, FAST (fast automated segmentation tool) from the FMRIB (Functional Magnetic Resonance Imaging of the Brain) Software Library, and SPM12 (statistical parametric mapping 12) in the presence of WMHs. Conclusion: BISON can provide accurate and robust segmentations in data from various age ranges and scanner models, making it ideal for performing tissue classification in large multicenter and multiscanner databases.",
                "authors": [
                    {
                        "name": "Dadar M."
                    },
                    {
                        "name": "Collins D.L."
                    }
                ],
                "date": "2021-04-01T00:00:00Z",
                "journal": "Magnetic Resonance in Medicine",
                "title": "BISON: Brain tissue segmentation pipeline using T1-weighted magnetic resonance images and a random forest classifier"
            },
            "pmid": "33040404"
        }
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        }
    ],
    "validated": 1
}