{
    "additionDate": "2017-08-03T19:00:25Z",
    "biotoolsCURIE": "biotools:sppider",
    "biotoolsID": "sppider",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://sable.cchmc.org/cgi-bin/contact_page.cgi?Server=SPPIDER"
        }
    ],
    "description": "The server can be used to: (1) predict residues to be at the putative protein interface(s) by considering single protein chain with resolved 3D structure; (2) analyse protein-protein complex with given 3D structural information and identify residues that are being in interchain contact.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://sppider.cchmc.org/sppider_doc.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ]
        }
    ],
    "homepage": "http://sppider.cchmc.org/",
    "lastUpdate": "2018-12-10T12:58:44Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/sppider-solvent-accessibility-based-protein-protein-interface-identification-and-recognition.html"
        }
    ],
    "name": "SPPIDER",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "The recognition of protein interaction sites is an important intermediate step toward identification of functionally relevant residues and understanding protein function, facilitating experimental efforts in that regard. Toward that goal, the authors propose a novel representation for the recognition of protein-protein interaction sites that integrates enhanced relative solvent accessibility (RSA) predictions with high resolution structural data. An observation that RSA predictions are biased toward the level of surface exposure consistent with protein complexes led the authors to investigate the difference between the predicted and actual (i.e., observed in an unbound structure) RSA of an amino acid residue as a fingerprint of interaction sites. The authors demonstrate that RSA prediction-based fingerprints of protein interactions significantly improve the discrimination between interacting and noninteracting sites, compared with evolutionary conservation, physicochemical characteristics, structure-derived and other features considered before. On the basis of these observations, the authors developed a new method for the prediction of protein-protein interaction sites, using machine learning approaches to combine the most informative features into the final predictor. For training and validation, the authors used several large sets of protein complexes and derived from them nonredundant representative chains, with interaction sites mapped from multiple complexes. Alternative machine learning techniques are used, including Support Vector Machines and Neural Networks, so as to evaluate the relative effects of the choice of a representation and a specific learning algorithm. The effects of induced fit and uncertainty of the negative (noninteracting) class assignment are also evaluated. Several representative methods from the literature are reimplemented to enable direct comparison of the results. Using rigorous validation protocols, the authors estimated that the new method yields the overall classification accuracy of about 74% and Matthews correlation coefficients of 0.42, as opposed to up to 70% classification accuracy and up to 0.3 Matthews correlation coefficient for methods that do not utilize RSA prediction-based fingerprints. The new method is available at http://sppider.cchmc.org. © 2006 Wiley-Liss, Inc.",
                "authors": [
                    {
                        "name": "Porollo A."
                    },
                    {
                        "name": "Meller J."
                    }
                ],
                "citationCount": 249,
                "date": "2007-02-15T00:00:00Z",
                "journal": "Proteins: Structure, Function and Genetics",
                "title": "Prediction-based fingerprints of protein-protein interactions"
            },
            "pmid": "17152079"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ],
    "validated": 1
}