
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://knightlab.ucsd.edu/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://tax2tree.sourceforge.net"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree generation",
                    "uri": "http://edamontology.org/operation_0323"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Taxonomy",
                "uri": "http://edamontology.org/topic_0637"
            },
            {
                "term": "Phylogenetics",
                "uri": "http://edamontology.org/topic_3293"
            },
            {
                "term": "Evolutionary biology",
                "uri": "http://edamontology.org/topic_3299"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/tax2tree-1-0-decorating-taxonomy-onto-a-phylogenetic-tree.html"
        }
    ],
    "publication": [
        {
            "abstract": "Reference phylogenies are crucial for providing a taxonomic framework for interpretation of marker gene and metagenomic surveys, which continue to reveal novel species at a remarkable rate. Greengenes is a dedicated full-length 16S rRNA gene database that provides users with a curated taxonomy based on de novo tree inference. We developed a taxonomy to tree approach for transferring group names from an existing taxonomy to a tree topology, and used it to apply the Greengenes, National Center for Biotechnology Information (NCBI) and cyanoDB (Cyanobacteria only) taxonomies to a de novo tree comprising 408 315 sequences. We also incorporated explicit rank information provided by the NCBI taxonomy to group names (by prefixing rank designations) for better user orientation and classification consistency. The resulting merged taxonomy improved the classification of 75% of the sequences by one or more ranks relative to the original NCBI taxonomy with the most pronounced improvements occurring in under-classified environmental sequences. We also assessed candidate phyla (divisions) currently defined by NCBI and present recommendations for consolidation of 34 redundantly named groups. All intermediate results from the pipeline, which includes tree inference, jackknifing and transfer of a donor taxonomy to a recipient tree (tax2tree) are available for download. The improved Greengenes taxonomy should provide important infrastructure for a wide range of megasequencing projects studying ecosystems on scales ranging from our own bodies (the Human Microbiome Project) to the entire planet (the Earth Microbiome Project). The implementation of the software can be obtained from http://sourceforge.net/projects/tax2tree/. © 2012 International Society for Microbial Ecology All rights reserved.",
            "authors": [
                "McDonald D.",
                "Price M.N.",
                "Goodrich J.",
                "Nawrocki E.P.",
                "Desantis T.Z.",
                "Probst A.",
                "Andersen G.L.",
                "Knight R.",
                "Hugenholtz P."
            ],
            "cit_count": 1637,
            "doi": "10.1038/ismej.2011.139",
            "journal": "ISME Journal",
            "title": "An improved Greengenes taxonomy with explicit ranks for ecological and evolutionary analyses of bacteria and archaea",
            "type": "Primary",
            "year": "2012-03-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:tax2tree",
        "biotoolsID": "tax2tree",
        "description": "Tool for automatically decorating taxonomy onto a phylogenetic tree. An improved Greengenes taxonomy with explicit ranks for ecological and evolutionary analyses of bacteria and archaea.",
        "homepage": "https://knightlab.ucsd.edu/wordpress/?p=194",
        "name": "tax2tree",
        "version": [
            "1.0"
        ]
    }
}