{
    "additionDate": "2018-08-12T11:37:40Z",
    "biotoolsCURIE": "biotools:crispulator",
    "biotoolsID": "crispulator",
    "credit": [
        {
            "email": "Martin.Kampmann@ucsf.edu",
            "name": "Martin Kampmann",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Discrete simulation tool for designing pooled genetic screens.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://tamasnagy.com/Crispulator.jl/latest/internals.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "note": "Simulation of screens relying on either CRISPR interference (CRISPRi) or CRISPR nuclease (CRISPRn). Pooled screens based on cell growth/survival, as well as fluorescence-activated cell sorting according to fluorescent reporter phenotypes are supported.",
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "http://crispulator.ucsf.edu/",
    "lastUpdate": "2018-12-10T12:59:01Z",
    "name": "CRISPulator",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1186/s12859-017-1759-9",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: The rapid adoption of CRISPR technology has enabled biomedical researchers to conduct CRISPR-based genetic screens in a pooled format. The quality of results from such screens is heavily dependent on the selection of optimal screen design parameters, which also affects cost and scalability. However, the cost and effort of implementing pooled screens prohibits experimental testing of a large number of parameters. Results: We present CRISPulator, a Monte Carlo method-based computational tool that simulates the impact of screen parameters on the robustness of screen results, thereby enabling users to build intuition and insights that will inform their experimental strategy. CRISPulator enables the simulation of screens relying on either CRISPR interference (CRISPRi) or CRISPR nuclease (CRISPRn). Pooled screens based on cell growth/survival, as well as fluorescence-activated cell sorting according to fluorescent reporter phenotypes are supported. CRISPulator is freely available online (http://crispulator.ucsf.edu). Conclusions: CRISPulator facilitates the design of pooled genetic screens by enabling the exploration of a large space of experimental parameters in silico, rather than through costly experimental trial and error. We illustrate its power by deriving non-obvious rules for optimal screen design.",
                "authors": [
                    {
                        "name": "Nagy T."
                    },
                    {
                        "name": "Kampmann M."
                    }
                ],
                "citationCount": 6,
                "date": "2017-07-21T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "CRISPulator: A discrete simulation tool for pooled genetic screens"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Simulation experiment",
            "uri": "http://edamontology.org/topic_3524"
        },
        {
            "term": "Functional genomics",
            "uri": "http://edamontology.org/topic_0085"
        }
    ],
    "validated": 1
}