{
    "additionDate": "2017-12-18T00:09:07Z",
    "biotoolsCURIE": "biotools:musa",
    "biotoolsID": "musa",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://kdbio.inesc-id.pt/~ndm/index.html"
        }
    ],
    "description": "MUSA (Motif finding using an UnSupervised Approach) is a new algorithm that can be used either to autonomously find over-represented complex motifs or to estimate search parameters for modern motif finders.",
    "documentation": [
        {
            "type": "General",
            "url": "http://kdbio.inesc-id.pt/~ndm/software/musa.html#usage"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Motif discovery",
                    "uri": "http://edamontology.org/operation_0238"
                }
            ]
        }
    ],
    "homepage": "http://kdbio.inesc-id.pt/~ndm/software/musa.html",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/musa-0-5-6-dna-motif-discovery-tool-simple-complex-motifs.html"
        }
    ],
    "name": "MUSA",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btl537",
            "metadata": {
                "abstract": "Motivation: The ability to identify complex motifs, i.e. non-contiguous nucleotide sequences, is a key feature of modern motif finders. Addressing this problem is extremely important, not only because these motifs can accurately model biological phenomena but because its extraction is highly dependent upon the appropriate selection of numerous search parameters. Currently available combinatorial algorithms have proved to be highly efficient in exhaustively enumerating motifs (including complex motifs), which fulfill certain extraction criteria. However, one major problem with these methods is the large number of parameters that need to be specified. Results: We propose a new algorithm, MUSA (Motif finding using an UnSupervised Approach), that can be used either to autonomously find over-represented complex motifs or to estimate search parameters for modern motif finders. This method relies on a biclustering algorithm that operates on a matrix of co-occurrences of small motifs. The performance of this method is independent of the composite structure of the motifs being sought, making few assumptions about their characteristics. The MUSA algorithm was applied to two datasets involving the bacterium Pseudomonas putida KT2440. The first one was composed of 70 σ54-dependent promoter sequences and the second dataset included 54 promoter sequences of up-regulated genes in response to phenol, as suggested by quantitative proteomics. The results obtained indicate that this approach is very effective at identifying complex motifs of biological significance. © 2006 Oxford University Press.",
                "authors": [
                    {
                        "name": "Mendes N.D."
                    },
                    {
                        "name": "Casimiro A.C."
                    },
                    {
                        "name": "Santos P.M."
                    },
                    {
                        "name": "Sa-Correia I."
                    },
                    {
                        "name": "Oliveira A.L."
                    },
                    {
                        "name": "Freitas A.T."
                    }
                ],
                "citationCount": 19,
                "date": "2006-12-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "MUSA: A parameter free algorithm for the identification of biologically significant motifs"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ],
    "validated": 1,
    "version": [
        "0.5.6"
    ]
}