{"credit":[{"email":"soap@genomics.org.cn","name":"SOAP Support","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://soap.genomics.org.cn/soapsnp.html"}],"function":[{"operation":[{"term":"Variant calling","uri":"http://edamontology.org/operation_3227"}]}],"labels":{"language":["C++","C"],"maturity":"Mature","operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"Sequence assembly","uri":"http://edamontology.org/topic_0196"},{"term":"DNA polymorphism","uri":"http://edamontology.org/topic_2885"},{"term":"Human biology","uri":"http://edamontology.org/topic_2815"}]},"publication":[{"abstract":"Next-generation massively parallel sequencing technologies provide ultrahigh throughput at two orders of magnitude lower unit cost than capillary Sanger sequencing technology. One of the key applications of next-generation sequencing is studying genetic variation between individuals using whole-genome or target region resequencing. Here, we have developed a consensus-calling and SNP-detection method for sequencing-by-synthesis Illumina Genome Analyzer technology. We designed this method by carefully considering the data quality, alignment, and experimental errors common to this technology. All of this information was integrated into a single quality score for each base under Bayesian theory to measure the accuracy of consensus calling. We tested this methodology using a large-scale human resequencing data set of 363coverage and assembled a high-quality nonrepetitive consensus sequence for 92.25% of the diploid autosomes and 88.07% of the haploid X chromosome. Comparison of the consensus sequence with Illumina human 1M BeadChip genotyped alleles from the same DNA sample showed that 98.6% of the 37,933 genotyped alleles on the X chromosome and 98% of 999,981 genotyped alleles on autosomes were covered at 99.97% and 99.84% consistency, respectively. At a low sequencing depth, we used prior probability of dbSNP alleles and were able to improve coverage of the dbSNP sites significantly as compared to that obtained using a nonimputation model. Our analyses demonstrate that our method has a very low false call rate at any sequencing depth and excellent genome coverage at a high sequencing depth. © 2009 by Cold Spring Harbor Laboratory Press.","authors":["Li R.","Li Y.","Fang X.","Yang H.","Wang J.","Kristiansen K.","Wang J."],"cit_count":634,"journal":"Genome Research","pmid":"19420381","title":"SNP detection for massively parallel whole-genome resequencing","year":"2009-06-01"}],"summary":{"biotoolsCURIE":"biotools:soapsnp","biotoolsID":"soapsnp","description":"Accurate consensus sequence builder based on soap1 and SOAPaligner/soap2's alignment output. It calculates a quality score for each consensus base, which can be used for any latter process to call SNPs.","homepage":"http://soap.genomics.org.cn/soapsnp.html","name":"SOAPsnp"}}