
{
    "credit": [
        {
            "email": "metscape-help@umich.edu",
            "name": "Support",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "http://metscape.med.umich.edu/manuals.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Plug-in"
        ],
        "topic": [
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Metabolomics",
                "uri": "http://edamontology.org/topic_3172"
            },
            {
                "term": "Data visualisation",
                "uri": "http://edamontology.org/topic_0092"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author 2017. Motivation: Recent technological advances in mass spectrometry, development of richer mass spectral libraries and data processing tools have enabled large scale metabolic profiling. Biological interpretation of metabolomics studies heavily relies on knowledge-based tools that contain information about metabolic pathways. Incomplete coverage of different areas of metabolism and lack of information about non-canonical connections between metabolites limits the scope of applications of such tools. Furthermore, the presence of a large number of unknown features, which cannot be readily identified, but nonetheless can represent bona fide compounds, also considerably complicates biological interpretation of the data. Results: Leveraging recent developments in the statistical analysis of high-dimensional data, we developed a new Debiased Sparse Partial Correlation algorithm (DSPC) for estimating partial correlation networks and implemented it as a Java-based CorrelationCalculator program. We also introduce a new version of our previously developed tool Metscape that enables building and visualization of correlation networks. We demonstrate the utility of these tools by constructing biologically relevant networks and in aiding identification of unknown compounds. Availability and Implementation: http://metscape.med.umich.edu Supplementary information: Supplementary data are available at Bioinformatics online .",
            "authors": [
                "Basu S.",
                "Duren W.",
                "Evans C.R.",
                "Burant C.F.",
                "Michailidis G.",
                "Karnovsky A."
            ],
            "cit_count": 13,
            "doi": "10.1093/bioinformatics/btx012",
            "journal": "Bioinformatics",
            "title": "Sparse network modeling and metscape-based visualization methods for the analysis of large-scale metabolomics data",
            "year": "2017-05-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:metscape_3",
        "biotoolsID": "metscape_3",
        "description": "Sparse network modeling and metscape-based visualization methods for the analysis of large-scale metabolomics data.",
        "homepage": "http://metscape.med.umich.edu/",
        "name": "MetScape 3"
    }
}