{
    "accessibility": "Open access",
    "additionDate": "2022-07-06T20:56:14.919328Z",
    "biotoolsCURIE": "biotools:sliman",
    "biotoolsID": "sliman",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Gilles Labesse",
            "orcidid": "https://orcid.org/0000-0002-6861-3300"
        },
        {
            "name": "Victor Reys",
            "orcidid": "https://orcid.org/0000-0001-5301-317X"
        }
    ],
    "description": "An integrative web server for exploring short linear motif-mediated interactions in interactomes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "UniProt accession",
                        "uri": "http://edamontology.org/data_3021"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Protein-protein interaction analysis",
                    "uri": "http://edamontology.org/operation_2949"
                }
            ]
        }
    ],
    "homepage": "http://sliman.cbs.cnrs.fr",
    "language": [
        "Elm"
    ],
    "lastUpdate": "2024-11-24T15:56:35.932835Z",
    "name": "SLiMAn",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1021/acs.jproteome.1c00964",
            "metadata": {
                "abstract": "Cells express thousands of macromolecules, and their functioning relies on multiple networks of intermolecular interactions. These interactions can be experimentally determined at different spatial and temporal resolutions. But, physical interfaces are not often delineated directly, especially in high-throughput experiments. A large fraction of protein-protein interactions involves domain and so-called SLiMs (for Short Linear Motifs). Often, SLiMs lie in disordered regions or loops. Their small size, limited sequence conservation, and loosely folded nature prevent straightforward detection. SLiMAn (Short Linear Motif Analysis), a new web server, is provided to help thorough analysis of interactomics data. From a list of putative interactants (e.g., output from an interactomics study), SLiMs (from ELM) and SLiM-recognition domains (from Pfam) are extracted, and putative pairings are displayed. Predicted results can be filtered using motif E-values, IUPred2 scores, or BioGRID interaction matches. When structural templates are available, a given SLiM and its recognition domain can be modeled using SCWRL. We illustrate here the use of SLiMAn on distinct examples, including one real-case study. We oversee wide-range applications for SLiMAn in the context of the massive analysis of protein-protein interactions. This new web server is made freely available at https://sliman.cbs.cnrs.fr. 2022 American Chemical Society.",
                "authors": [
                    {
                        "name": "Labesse G."
                    },
                    {
                        "name": "Reys V."
                    }
                ],
                "citationCount": 7,
                "date": "2022-07-01T00:00:00Z",
                "journal": "Journal of Proteome Research",
                "title": "SLiMAn: An Integrative Web Server for Exploring Short Linear Motif-Mediated Interactions in Interactomes"
            },
            "pmid": "35642445"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        }
    ],
    "validated": 1
}
