{
    "additionDate": "2019-11-14T18:36:30Z",
    "biotoolsCURIE": "biotools:VisANT_autogenerated",
    "biotoolsID": "VisANT_autogenerated",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "yfy@jsut.edu.cn",
            "name": "Fei-Yue Ye",
            "typeEntity": "Person"
        }
    ],
    "description": "> MEDIUM CONFIDENCE! | > NAME EQUAL TO (PUB. DIFFERENT) bio.tools/visant | A new grid- and modularity-based layout algorithm for complex biological networks | An integrative platform for network/pathway analysis",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Pathway or network comparison",
                    "uri": "http://edamontology.org/operation_0277"
                },
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                }
            ]
        }
    ],
    "homepage": "http://www.visantnet.org",
    "lastUpdate": "2019-11-14T18:36:30Z",
    "name": "VisANT_autogenerated",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0221620",
            "metadata": {
                "abstract": "© 2019 He et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.The visualization of biological networks is critically important to aid researchers in understanding complex biological systems and arouses interest in designing efficient layout algorithms to draw biological networks according to their topology structures, especially for those networks with potential modules. The algorithms of grid layout series have an advantage in generating compact layouts with overlap-free nodes compared to force-directed; however, extant grid layout algorithms have difficulty in drawing modular networks and often generate layouts of high visual complexity when applied to networks with dense or clustered connectivity structure. To specifically assist the study of modular networks, we propose a grid- and modularity-based layout algorithm (GML) that consists of three stages: network preprocessing, module layout and grid optimization. The algorithm can draw complex biological networks with or without predefined modules based on the grid layout algorithm. It also outperforms other existing grid-based algorithms in the measurement of computation performance, ratio of edge-edge/node-edge crossings, relative edge lengths, and connectivity F-measures. GML helps users to gain insight into the network global characteristics through module layout, as well as to discern network details with grid optimization. GML has been developed as a VisANT plugin (https://hscz.github.io/Biological-NetworkVisualization/) and is freely available to the research community.",
                "authors": [
                    {
                        "name": "He S."
                    },
                    {
                        "name": "Liu Y.-J."
                    },
                    {
                        "name": "Ye F.-Y."
                    },
                    {
                        "name": "Li R.-P."
                    },
                    {
                        "name": "Dai R.-J."
                    }
                ],
                "citationCount": 1,
                "date": "2019-08-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "A new grid- And modularity-based layout algorithm for complex biological networks"
            },
            "pmcid": "PMC6715240",
            "pmid": "31465473"
        }
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        }
    ]
}