{
    "additionDate": "2019-11-14T18:35:05Z",
    "biotoolsCURIE": "biotools:STEM",
    "biotoolsID": "STEM",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jhkauf@us.ibm.com",
            "name": "James H. Kaufman",
            "typeEntity": "Person"
        }
    ],
    "description": "An Open Source Tool for Disease Modeling | The Eclipse Foundation - home to a global community, the Eclipse IDE, Jakarta EE and over 350 open source projects, including runtimes, tools and frameworks | The Spatiotemporal Epidemiological Modeler (STEM) Project | Some Eclipse Foundation pages use cookies to better serve you when you return to the site. You can set your browser to notify you before you receive a cookie or turn off cookies. If you do so, however, some areas of some sites may not function properly. To read Eclipse Foundation Privacy Policy click here | The Spatiotemporal Epidemiological Modeler (STEM) tool is designed to help scientists and public health officials create and use spatial and temporal models of emerging infectious diseases. These models can aid in understanding and potentially preventing the spread of such diseases",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "http://www.eclipse.org/stem",
    "lastUpdate": "2020-12-26T19:24:45Z",
    "name": "STEM",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1089/HS.2019.0018",
            "metadata": {
                "abstract": "© Judith V. Douglas et al., 2019; Published by Mary Ann Liebert, Inc. 2019.The Spatiotemporal Epidemiologic Modeler STEM is an open source software project supported by the Eclipse Foundation and used by a global community of researchers and public health officials working to track and, when possible, control outbreaks of infectious disease in human and animal populations. STEM is not a model or a tool designed for a specific disease; it is a flexible, modular framework supporting exchange and integration of community models, reusable plug-in components, and denominator data, available to researchers worldwide at www.eclipse.org/stem. A review of multiple projects illustrates its capabilities. STEM has been used to study variations in transmission of seasonal influenza in Israel by strains; evaluate social distancing measures taken to curb the H1N1 epidemic in Mexico City; study measles outbreaks in part of London and inform local policy on immunization; and gain insights into H7N9 avian influenza transmission in China. A multistrain dengue fever model explored the roles of the mosquito vector, cross-strain immunity, and antibody response in the frequency of dengue outbreaks. STEM has also been used to study the impact of variations in climate on malaria incidence. During the Ebola epidemic, a weekly conference call supported the global modeling community; subsequent work modeled the impact of behavioral change and tested disease reintroduction via animal reservoirs. Work in Germany tracked salmonella in pork from farm to fork; and a recent doctoral dissertation used the air travel feature to compare the potential threats posed by weaponizing infectious diseases. Current projects include work in Great Britain to evaluate control strategies for parasitic disease in sheep, and in Germany and Hungary, to validate the model and inform policy decisions for African swine fever. STEM Version 4.0.0, released in early 2019, includes tools used in these projects and updates technical aspects of the framework to ease its use and re-use.",
                "authors": [
                    {
                        "name": "Douglas J.V."
                    },
                    {
                        "name": "Bianco S."
                    },
                    {
                        "name": "Edlund S."
                    },
                    {
                        "name": "Engelhardt T."
                    },
                    {
                        "name": "Filter M."
                    },
                    {
                        "name": "Gunther T."
                    },
                    {
                        "name": "Hu K.M."
                    },
                    {
                        "name": "Nixon E.J."
                    },
                    {
                        "name": "Sevilla N.L."
                    },
                    {
                        "name": "Swaid A."
                    },
                    {
                        "name": "Kaufman J.H."
                    }
                ],
                "citationCount": 2,
                "date": "2019-07-01T00:00:00Z",
                "journal": "Health Security",
                "title": "STEM: An open source tool for disease modeling"
            },
            "pmcid": "PMC6708268",
            "pmid": "31433284"
        }
    ],
    "topic": [
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Regenerative medicine",
            "uri": "http://edamontology.org/topic_3395"
        }
    ],
    "validated": 1
}