{
    "additionDate": "2021-01-18T11:57:19Z",
    "biotoolsCURIE": "biotools:h-racs",
    "biotoolsID": "h-racs",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zwcao@tongji.edu.cn",
            "name": "Zhiwei Cao",
            "typeEntity": "Person"
        }
    ],
    "description": "A handy tool to rank anti-cancer synergistic drugs.\n\nH-RACS is designed to predict synergistic drug combinations based on drug features and basal expression profiling of cancer context. The advantages of H-RACS lie in 1) excellent performance with minimum data input compared to peers; 2) abundant cancer context built-in covering 928 cell lines of 24 cancers; 3) unique and outstanding extendibility to new drug combinations and new cell lines.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://www.badd-cao.net/h-racs",
    "lastUpdate": "2021-03-18T09:00:54Z",
    "name": "H-RACS",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.18632/AGING.103925",
            "metadata": {
                "abstract": "© 2020 Yan et al. All Rights Reserved.Though promising, identifying synergistic combinations from a large pool of candidate drugs remains challenging for cancer treatment. Due to unclear mechanism and limited confirmed cases, only a few computational algorithms are able to predict drug synergy. Yet they normally require the drug-cell treatment results as an essential input, thus exclude the possibility to pre-screen those unexplored drugs without cell treatment profiling. Based on the largest dataset of 33,574 combinational scenarios, we proposed a handy webserver, H-RACS, to overcome the above problems. Being loaded with chemical structures and target information, H-RACS can recommend potential synergistic pairs between candidate drugs on 928 cell lines of 24 prevalent cancer types. A high model performance was achieved with AUC of 0.89 on independent combinational scenarios. On the second independent validation of DREAM dataset, H-RACS obtained precision of 67% among its top 5% ranking list. When being tested on new combinations and new cell lines, H-RACS showed strong extendibility with AUC of 0.84 and 0.81 respectively. As the first online server freely accessible at http://www.badd-cao.net/h-racs, H-RACS may promote the pre-screening of synergistic combinations for new chemical drugs on unexplored cancers.",
                "authors": [
                    {
                        "name": "Yan X."
                    },
                    {
                        "name": "Yang Y."
                    },
                    {
                        "name": "Chen Z."
                    },
                    {
                        "name": "Yin Z."
                    },
                    {
                        "name": "Deng Z."
                    },
                    {
                        "name": "Qiu T."
                    },
                    {
                        "name": "Tang K."
                    },
                    {
                        "name": "Cao Z."
                    }
                ],
                "citationCount": 2,
                "date": "2020-11-01T00:00:00Z",
                "journal": "Aging",
                "title": "H-RACS: a handy tool to rank anti-cancer synergistic drugs"
            },
            "pmcid": "PMC7695372",
            "pmid": "33173014"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        }
    ]
}