{
    "additionDate": "2016-10-15T04:26:48Z",
    "biotoolsCURIE": "biotools:slimsuite",
    "biotoolsID": "slimsuite",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Richard Edwards",
            "orcidid": "http://orcid.org/0000-0002-3645-5539",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "University of New South Wales",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "name": "unimelb.edu.au",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "richard.edwards@unsw.edu.au",
            "name": "Australia",
            "typeRole": [
                "Support"
            ]
        },
        {
            "email": "richard.edwards@unsw.edu.au",
            "name": "Australia",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Short Linear Motif discovery and molecular evolution is an open source suite of Python programs for sequence analysis, with a particular focus on the prediction and analysis of short linear motifs (SLiMs), which are are responsible for mediating domain-motif protein-protein interactions. It can be downloaded from GitHub, and some tools are available as REST servers.",
    "documentation": [
        {
            "note": "Getting help",
            "type": [
                "General"
            ],
            "url": "http://slimsuite.blogspot.dk/2013/07/getting-help.html"
        },
        {
            "type": [
                "General"
            ],
            "url": "http://slimsuite.blogspot.com/p/documentation.html"
        },
        {
            "type": [
                "Installation instructions"
            ],
            "url": "http://slimsuite.blogspot.com/2013/08/availability-installation-and-setup.html"
        },
        {
            "note": "Command-line options",
            "type": [
                "General"
            ],
            "url": "http://slimsuite.blogspot.com/2013/08/command-line-options.html"
        }
    ],
    "download": [
        {
            "note": "General downloads page",
            "type": "Source code",
            "url": "http://slimsuite.blogspot.com/p/downloads.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "homepage": "http://slimsuite.blogspot.com.au/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-21T10:49:31Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/slimsuite/SLiMSuite"
        }
    ],
    "maturity": "Mature",
    "name": "SLiMSuite",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "mv.schneider@unimelb.edu.au",
    "publication": [
        {
            "doi": "10.1007/978-1-4939-2285-7_6",
            "metadata": {
                "abstract": "© Springer Science+Business Media New York 2015. All rights reserved.Short Linear Motifs (SLiMs) are functional protein microdomains that typically mediate interactions between a short linear region in one protein and a globular domain in another. SLiMs usually occur in structurally disordered regions and mediate low affinity interactions. Most SLiMs are 3-15 amino acids in length and have 2-5 defined positions, making them highly likely to occur by chance and extremely difficult to identify. Nevertheless, our knowledge of SLiMs and capacity to predict them from protein sequence data using computational methods has advanced dramatically over the past decade. By considering the biological, structural, and evolutionary context of SLiM occurrences, it is possible to differentiate functional instances from chance matches in many cases and to identify new regions of proteins that have the features consistent with a SLiM-mediated interaction. Their simplicity also makes SLiMs evolutionarily labile and prone to independent origins on different sequence backgrounds through convergent evolution, which can be exploited for predicting novel SLiMs in proteins that share a function or interaction partner. In this review, we explore our current knowledge of SLiMs and how it can be applied to the task of predicting them computationally from protein sequences. Rather than focusing on specific SLiM prediction tools, we provide an overview of the methods available and concentrate on principles that should continue to be paramount even in the light of future developments. We consider the relative merits of using regular expressions or profiles for SLiM discovery and discuss the main considerations for both predicting new instances of known SLiMs, and de novo prediction of novel SLiMs. In particular, we highlight the importance of correctly modelling evolutionary relationships and the probability of false positive predictions.",
                "authors": [
                    {
                        "name": "Edwards R.J."
                    },
                    {
                        "name": "Palopoli N."
                    }
                ],
                "citationCount": 10,
                "date": "2015-01-02T00:00:00Z",
                "journal": "Computational Peptidology",
                "title": "Computational prediction of short linear motifs from protein sequences"
            },
            "pmid": "25555723",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1016/j.tibtech.2019.07.004",
            "metadata": {
                "abstract": "© 2019 The Author(s)Viral proteins evade host immune function by molecular mimicry, often achieved by short linear motifs (SLiMs) of three to ten consecutive amino acids (AAs). Motif mimicry tolerates mutations, evolves quickly to modify interactions with the host, and enables modular interactions with protein complexes. Host cells cannot easily coordinate changes to conserved motif recognition and binding interfaces under selective pressure to maintain critical signaling pathways. SLiMs offer potential for use in synthetic biology, such as better immunogens and therapies, but may also present biosecurity challenges. We survey viral uses of SLiMs to mimic host proteins, and information resources available for motif discovery. As the number of examples continues to grow, knowledge management tools are essential to help organize and compare new findings.",
                "authors": [
                    {
                        "name": "Hraber P."
                    },
                    {
                        "name": "O'Maille P.E."
                    },
                    {
                        "name": "Silberfarb A."
                    },
                    {
                        "name": "Davis-Anderson K."
                    },
                    {
                        "name": "Generous N."
                    },
                    {
                        "name": "McMahon B.H."
                    },
                    {
                        "name": "Fair J.M."
                    }
                ],
                "citationCount": 6,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Trends in Biotechnology",
                "title": "Resources to Discover and Use Short Linear Motifs in Viral Proteins"
            },
            "pmid": "31427097",
            "type": [
                "Usage"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Biology",
            "uri": "http://edamontology.org/topic_3070"
        },
        {
            "term": "Biomedical science",
            "uri": "http://edamontology.org/topic_3344"
        },
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}