{"credit":[{"email":"okd@sk.ritsumei.ac.jp","name":"Shujiro Okuda","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://operondb.jp/help"}],"function":[{"operation":[{"term":"Operon drawing","uri":"http://edamontology.org/operation_0579"},{"term":"Operon prediction","uri":"http://edamontology.org/operation_0435"},{"term":"Clustering","uri":"http://edamontology.org/operation_3432"},{"term":"Enrichment analysis","uri":"http://edamontology.org/operation_3501"},{"term":"PCR primer design","uri":"http://edamontology.org/operation_0308"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Database portal"],"topic":[{"term":"Gene structure","uri":"http://edamontology.org/topic_0114"},{"term":"Model organisms","uri":"http://edamontology.org/topic_0621"},{"term":"Database management","uri":"http://edamontology.org/topic_3489"},{"term":"Gene expression","uri":"http://edamontology.org/topic_0203"},{"term":"Genomics","uri":"http://edamontology.org/topic_0622"}]},"publication":[{"abstract":"ODB (Operon DataBase) aims to collect data of all known and conserved operons in completely sequenced genomes. Three newly updated features of this database have been added as follows: (i) Data from included operons were updated. The genomewide analysis of transcription and transcriptional units has become popular recently and ODB successfully integrates these high-throughput operon data, including genome-wide transcriptional units of five prokaryotes and two eukaryotes. The current version of our database contains information from about 10 000 known operons in more than 50 genomes, and more than 400 000 conserved operons obtained from more than 1000 bacterial genomes. (ii) ODB proposes the idea of reference operons as a new operon prediction tool. A reference operon, a set of possible orthologous genes that organize operons, is defined by clustering all known operons. A large number of known operons, including the recently added genome-wide analysis of operons, allowed us to define more reliable reference operons. (iii) ODB also provides new graphical interfaces. One is for comparative analyses of operon structures in multiple genomes. The other is for visualization of possible operons in multiple genomes obtained from the reference operons. The 2011 updated version of ODB is now available at http://operondb.jp/. © The Author(s) 2010.","authors":["Okuda S.","Yoshizawa A.C."],"cit_count":17,"journal":"Nucleic Acids Research","pmid":"21051344","title":"ODB: A database for operon organizations, 2011 update","year":"2011-01-01"}],"summary":{"biotoolsCURIE":"biotools:odb","biotoolsID":"odb","description":"Contains all known and conserved operons in completely sequenced genomes.","homepage":"http://operondb.jp/","name":"ODB"}}