
{
    "credit": [
        {
            "email": "citterich@uniroma2.it",
            "name": "Manuela Helmer Citterich",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://cbm.bio.uniroma2.it/ispot/documentation.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                },
                {
                    "term": "Protein binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                },
                {
                    "term": "siRNA binding specificity prediction",
                    "uri": "http://edamontology.org/operation_0465"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Small molecules",
                "uri": "http://edamontology.org/topic_0154"
            },
            {
                "term": "Structure prediction",
                "uri": "http://edamontology.org/topic_0082"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Protein folds and structural domains",
                "uri": "http://edamontology.org/topic_0736"
            }
        ]
    },
    "publication": [
        {
            "abstract": "We have developed a procedure to predict the peptide binding specificity of an SH3 domain from its sequence. The procedure utilizes information extracted from position-specific contacts derived from six SH3/peptide or SH3/protein complexes of known structure. The framework of SH3/peptide contacts defined on the structure of the complexes is used to build a residue-residue interaction database derived from ligands obtained by panning peptide libraries displayed on filamentous phage. The SH3-specific interaction database is a multidimensional array containing frequencies of position-specific contacts. As input, SH3-SPOT requires the sequence of an SH3 domain and of a query decapeptide ligand. The array, that we call the SH3-specific matrix, is then used to evaluate the probability that the peptide would bind the given SH3 domain. This procedure is fast enough to be applied to the entire protein sequence database. Panning experiments were performed to search putative specific ligands of different SH3 domains in a database of decapeptides, or in a database of protein sequences. The procedure ranked some of the natural partners of interaction of a number of SH3 domains among the best ligands of the ~5.6 x 109 different decapeptides in the SWISSPROT database. We expect the predictive power of the method to increase with the enrichment of the SH3-specific matrix by interaction data derived from new complex structures or from the characterization of new ligands. The procedure was developed using the SH3 domain family as test case but its application can easily be extended to other families of protein domains (such as, SH2, MHC, EH, PDZ, etc.). (C) 2000 Academic Press.",
            "authors": [
                "Brannetti B.",
                "Via A.",
                "Cestra G.",
                "Cesareni G.",
                "Citterich M.H."
            ],
            "cit_count": 69,
            "journal": "Journal of Molecular Biology",
            "pmid": "10764600",
            "title": "SH3-SPOT: An algorithm to predict preferred ligands to different members of the SH3 gene family",
            "year": "2000-04-28"
        },
        {
            "abstract": "iSPOT (http://cbm.bio.uniroma2.it/ispot) is a web tool developed to infer the recognition specificity of protein module families; it is based on the SPOT procedure that utilizes information from position-specific contacts, derived from the available domain/ligand complexes of known structure, and experimental interaction data to build a database of residue-residue contact frequencies. iSPOT is available to infer the interaction specificity of PDZ, SH3 and WW domains. For each family of protein domains, iSPOT evaluates the probability of interaction between a query domain of the specified families and an input protein/peptide sequence and makes it possible to search for potential binding partners of a given domain within the SWISS-PROT database. The experimentally derived interaction data utilized to build the PDZ, SH3 and WW databases of residue-residue contact frequencies are also accessible. Here we describe the application to the WW family of protein modules.",
            "authors": [
                "Brannetti B.",
                "Helmer-Citterich M."
            ],
            "cit_count": 31,
            "journal": "Nucleic Acids Research",
            "pmid": "12824399",
            "title": "iSPOT: A web tool to infer the interaction specificity of families of protein modules",
            "year": "2003-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:ispot",
        "biotoolsID": "ispot",
        "description": "iSPOT (Sequence Prediction Of Target) uses experimental interaction data combined with structural residue-residue contact information to predict the peptide binding specificity of SH3, PDZ, and WW domains.",
        "homepage": "http://cbm.bio.uniroma2.it/ispot/",
        "name": "iSPOT"
    }
}