{
    "additionDate": "2021-01-18T10:07:43Z",
    "biotoolsCURIE": "biotools:sequoia",
    "biotoolsID": "sequoia",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "giselle@cmu.edu",
            "name": "Giselle Reis",
            "orcidid": "https://orcid.org/0000-0002-5145-9829",
            "typeEntity": "Person"
        }
    ],
    "description": "A Playground for Logicians.\n\nSequent calculus proof construction tool.\n\ngit clone git@github.com:meta-logic/sequoia.git.\n\nThese instructions will get you a copy of the project up and running on your local machine for development and testing purposes.\n\nDesign, play with, and analyze sequent calculus proof systems.\n\nInvestigate meta-theoretical properties for your calculus systems (such as identity expansion, weakening admissibility, and permutability of rules). Sequoia is able to infer most of the trivial cases automatically.\n\nCreate, save, modify, and manage your own calculi.\n\nBower (note that Bower can be installed via npm once Node.js is installed).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/meta-logic/sequoia",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2021-03-20T16:59:51Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/meta-logic/sequoia"
        }
    ],
    "name": "Sequoia",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1007/978-3-030-51054-1_32",
            "metadata": {
                "abstract": "© 2020, Springer Nature Switzerland AG.Sequent calculus is a pervasive technique for studying logics and their properties due to the regularity of rules, proofs, and meta-property proofs across logics. However, even simple proofs can be large, and writing them by hand is often messy. Moreover, the combinatorial nature of the calculus makes it easy for humans to make mistakes or miss cases. Sequoia aims to alleviate these problems. Sequoia is a web-based application for specifying sequent calculi and performing basic reasoning about them. The goal is to be a user-friendly program, where logicians can specify and “play” with their calculi. For that purpose, we provide an intuitive interface where inference rules can be input inand are immediately rendered with the corresponding symbols. Users can then build proof trees in a streamlined and minimal-effort way, in whichever calculus they defined. In addition to that, we provide checks for some of the most important meta-theoretical properties, such as weakening admissibility and identity expansion, given that they proceed by the usual structural induction. In this sense, the logician is only left with the tricky and most interesting cases of each analysis.",
                "authors": [
                    {
                        "name": "Reis G."
                    },
                    {
                        "name": "Naeem Z."
                    },
                    {
                        "name": "Hashim M."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics)",
                "title": "Sequoia: A Playground for Logicians: (System Description)"
            },
            "pmcid": "PMC7324041"
        }
    ]
}