{
    "additionDate": "2017-05-01T15:56:20Z",
    "biotoolsCURIE": "biotools:webscipio",
    "biotoolsID": "webscipio",
    "credit": [
        {
            "email": "mako@nmr.mpibpc.mpg.de",
            "name": "Dr. Martin Kollmar",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Scipio is a tool to determine the precise exon-intron gene structure given a protein sequence and a genome. It identifies splice sites and is able to cope with sequencing errors and genes spanning several contigs. The output contains information about discrepancies that may result from sequencing errors. Scipio has also successfully been used to find homologous genes in related species. WebScipio, allows to search for mutually exclusive spliced exons and tandemly arrayed gene duplicates.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://www.webscipio.org/help/webscipio"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                },
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ]
        }
    ],
    "homepage": "http://www.webscipio.org",
    "language": [
        "Ruby"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "WebScipio",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: Alternative splicing of pre-mature RNA is an important process eukaryotes utilize to increase their repertoire of different protein products. Several types of different alternative splice forms exist including exon skipping, differential splicing of exons at their 3'- or 5'-end, intron retention, and mutually exclusive splicing. The latter term is used for clusters of internal exons that are spliced in a mutually exclusive manner.Results: We have implemented an extension to the WebScipio software to search for mutually exclusive exons. Here, the search is based on the precondition that mutually exclusive exons encode regions of the same structural part of the protein product. This precondition provides restrictions to the search for candidate exons concerning their length, splice site conservation and reading frame preservation, and overall homology. Mutually exclusive exons that are not homologous and not of about the same length will not be found. Using the new algorithm, mutually exclusive exons in several example genes, a dynein heavy chain, a muscle myosin heavy chain, and Dscam were correctly identified. In addition, the algorithm was applied to the whole Drosophila melanogaster X chromosome and the results were compared to the Flybase annotation and an ab initio prediction. Clusters of mutually exclusive exons might be subsequent to each other and might encode dozens of exons.Conclusions: This is the first implementation of an automatic search for mutually exclusive exons in eukaryotes. Exons are predicted and reconstructed in the same run providing the complete gene structure for the protein query of interest. WebScipio offers high quality gene structure figures with the clusters of mutually exclusive exons colour-coded, and several analysis tools for further manual inspection. The genome scale analysis of all genes of the Drosophila melanogaster X chromosome showed that WebScipio is able to find all but two of the 28 annotated mutually exclusive spliced exons and predicts 39 new candidate exons. Thus, WebScipio should be able to identify mutually exclusive spliced exons in any query sequence from any species with a very high probability. WebScipio is freely available to academics at http://www.webscipio.org. © 2011 Pillmann et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Pillmann H."
                    },
                    {
                        "name": "Hatje K."
                    },
                    {
                        "name": "Odronitz F."
                    },
                    {
                        "name": "Hammesfahr B."
                    },
                    {
                        "name": "Kollmar M."
                    }
                ],
                "citationCount": 19,
                "date": "2011-06-30T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Predicting mutually exclusive spliced exons based on exon length, splice site and reading frame conservation, and exon sequence homology"
            },
            "pmid": "21718515"
        },
        {
            "metadata": {
                "abstract": "Background: For many types of analyses, data about gene structure and locations of non-coding regions of genes are required. Although a vast amount of genomic sequence data is available, precise annotation of genes is lacking behind. Finding the corresponding gene of a given protein sequence by means of conventional tools is error prone, and cannot be completed without manual inspection, which is time consuming and requires considerable experience. Results: Scipio is a tool based on the alignment program BLAT to determine the precise gene structure given a protein sequence and a genome sequence. It identifies intron-exon borders and splice sites and is able to cope with sequencing errors and genes spanning several contigs in genomes that have not yet been assembled to supercontigs or chromosomes. Instead of producing a set of hits with varying confidence, Scipio gives the user a coherent summary of locations on the genome that code for the query protein. The output contains information about discrepancies that may result from sequencing errors. Scipio has also successfully been used to find homologous genes in closely related species. Scipio was tested with 979 protein queries against 16 arthropod genomes (intra species search). For cross-species annotation, Scipio was used to annotate 40 genes from Homo sapiens in the primates Pongo pygmaeus abelii and Callithrix jacchus. The prediction quality of Scipio was tested in a comparative study against that of BLAT and the well established program Exonerate. Conclusion: Scipio is able to precisely map a protein query onto a genome. Even in cases when there are many sequencing errors, or when incomplete genome assemblies lead to hits that stretch across multiple target sequences, it very often provides the user with the correct determination of intron-exon borders and splice sites, showing an improved prediction accuracy compared to BLAT and Exonerate. Apart from being able to find genes in the genome that encode the query protein, Scipio can also be used to annotate genes in closely related species. © 2008 Keller et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Keller O."
                    },
                    {
                        "name": "Odronitz F."
                    },
                    {
                        "name": "Stanke M."
                    },
                    {
                        "name": "Kollmar M."
                    },
                    {
                        "name": "Waack S."
                    }
                ],
                "citationCount": 80,
                "date": "2008-06-13T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Scipio: Using protein sequences to determine the precise exon/intron structures of genes and their orthologs in closely related species"
            },
            "pmid": "18554390"
        },
        {
            "pmid": "21798037"
        },
        {
            "metadata": {
                "abstract": "Background: Obtaining the gene structure for a given protein encoding gene is an important step in many analyses. A software suited for this task should be readily accessible, accurate, easy to handle and should provide the user with a coherent representation of the most probable gene structure. It should be rigorous enough to optimise features on the level of single bases and at the same time flexible enough to allow for cross-species searches. Results: WebScipio, a web interface to the Scipio software, allows a user to obtain the corresponding coding sequence structure of a here given a query protein sequence that belongs to an already assembled eukaryotic genome. The resulting gene structure is presented in various human readable formats like a schematic representation, and a detailed alignment of the query and the target sequence highlighting any discrepancies. WebScipio can also be used to identify and characterise the gene structures of homologs in related organisms. In addition, it offers a web service for integration with other programs. Conclusion: WebScipio is a tool that allows users to get a high-quality gene structure prediction from a protein query. It offers more than 250 eukaryotic genomes that can be searched and produces predictions that are close to what can be achieved by manual annotation, for in-species and cross-species searches alike. WebScipio is freely accessible at http://www.webscipio.org. © 2008 Odronitz et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Odronitz F."
                    },
                    {
                        "name": "Pillmann H."
                    },
                    {
                        "name": "Keller O."
                    },
                    {
                        "name": "Waack S."
                    },
                    {
                        "name": "Kollmar M."
                    }
                ],
                "citationCount": 19,
                "date": "2008-09-18T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "WebScipio: An online tool for the determination of gene structures using protein sequences"
            },
            "pmid": "18801164"
        },
        {
            "metadata": {
                "abstract": "Accurate exon-intron structures are essential prerequisites in genomics, proteomics and for many protein family and single gene studies. We originally developed Scipio and the corresponding web service WebScipio for the reconstruction of gene structures based on protein sequences and available genome assemblies. WebScipio also allows predicting mutually exclusive spliced exons and tandemly arrayed gene duplicates. The obtained gene structures are illustrated in graphical schemes and can be analysed down to the nucleotide level. The set of eukaryotic genomes available at the WebScipio server is updated on a daily basis. The current version of the web server provides access to ∼3400 genome assembly files of >1100 sequenced eukaryotic species. Here, we have also extended the functionality by adding a module with which expressed sequence tag (EST) and cDNA data can be mapped to the reconstructed gene structure for the identification of all types of alternative splice variants. WebScipio has a user-friendly web interface, and we believe that the improved web server will provide better service to biologists interested in the gene structure corresponding to their protein of interest, including all types of alternative splice forms and tandem gene duplicates. WebScipio is freely available at http://www.webscipio.org.",
                "authors": [
                    {
                        "name": "Hatje K."
                    },
                    {
                        "name": "Hammesfahr B."
                    },
                    {
                        "name": "Kollmar M."
                    }
                ],
                "citationCount": 11,
                "date": "2013-01-01T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "WebScipio: Reconstructing alternative splice variants of eukaryotic proteins."
            },
            "pmid": "23677611"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Gene structure",
            "uri": "http://edamontology.org/topic_0114"
        },
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ],
    "validated": 1
}