{
    "additionDate": "2019-11-14T18:04:22Z",
    "biotoolsCURIE": "biotools:DeepBindRG",
    "biotoolsID": "DeepBindRG",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "peng.yin@siat.ac.cn",
            "name": "Peng Yin",
            "typeEntity": "Person"
        },
        {
            "email": "yj.wei@siat.ac.cn",
            "name": "Yanjie Wei",
            "typeEntity": "Person"
        }
    ],
    "description": "A deep learning based method for estimating effective protein-ligand affinity.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                }
            ]
        }
    ],
    "homepage": "https://github.com/haiping1010/DeepBindRG",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-17T15:25:53Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/haiping1010/DeepBindRG/issues"
        }
    ],
    "name": "DeepBindRG",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.7717/PEERJ.7362",
            "metadata": {
                "abstract": "Copyright © 2019 Zhang et al.Proteins interact with small molecules to modulate several important cellular functions. Many acute diseases were cured by small molecule binding in the active site of protein either by inhibition or activation. Currently, there are several docking programs to estimate the binding position and the binding orientation of protein-ligand complex. Many scoring functions were developed to estimate the binding strength and predict the effective protein-ligand binding. While the accuracy of current scoring function is limited by several aspects, the solvent effect, entropy effect, and multibody effect are largely ignored in traditional machine learning methods. In this paper, we proposed a new deep neural network-based model named DeepBindRG to predict the binding affinity of protein-ligand complex, which learns all the effects, binding mode, and specificity implicitly by learning protein-ligand interface contact information from a large protein-ligand dataset. During the initial data processing step, the critical interface information was preserved to make sure the input is suitable for the proposed deep learning model. While validating our model on three independent datasets, DeepBindRG achieves root mean squared error (RMSE) value of pKa (-logKd or -logKi) about 1.6-1.8 and R value around 0.5-0.6, which is better than the autodock vina whose RMSE value is about 2.2-2.4 and R value is 0.42-0.57. We also explored the detailed reasons for the performance of DeepBindRG, especially for several failed cases by vina. Furthermore, DeepBindRG performed better for four challenging datasets from DUD.E database with no experimental protein-ligand complexes. The better performance of DeepBindRG than autodock vina in predicting protein-ligand binding affinity indicates that deep learning approach can greatly help with the drug discovery process. We also compare the performance of DeepBindRG with a 4D based deep learning method \"pafnucy\", the advantage and limitation of both methods have provided clues for improving the deep learning based protein-ligand prediction model in the future.",
                "authors": [
                    {
                        "name": "Zhang H."
                    },
                    {
                        "name": "Liao L."
                    },
                    {
                        "name": "Saravanan K.M."
                    },
                    {
                        "name": "Yin P."
                    },
                    {
                        "name": "Wei Y."
                    }
                ],
                "citationCount": 9,
                "date": "2019-01-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "DeepBindRG: A deep learning based method for estimating effective protein-ligand affinity"
            },
            "pmcid": "PMC6661145",
            "pmid": "31380152"
        }
    ],
    "topic": [
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}