{
    "name": "CarthaGene 1.3 beta", 
    "description": "Genetic/radiated hybrid mapping software that looks for multiple populations maximum likelihood consensus maps using a fast EM algorithm for maximum likelihood estimation and powerful ordering algorithms. It solves marker ordering problems and can also join maps (genetic or radiated hybrid) on various pedigrees: backcross, RI (ri self, ri sib), F2 intercross, phase known outbreds, haploid and diploid radiation hybrids up to now.", 
    "homepage": "https://forgemia.inra.fr/thomas.schiex/carthagene", 
    "biotoolsID": "carthagene", 
    "biotoolsCURIE": "biotools:carthagene", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2429", 
                    "term": "Mapping"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Desktop application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3053", 
            "term": "Genetics"
        }, 
        {
            "uri": "http://edamontology.org/topic_0102", 
            "term": "Mapping"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows"
    ], 
    "language": [
        "C++"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/carthagene-1-2-2-geneticradiated-hybrid-mapping-software.html", 
            "type": "Registry", 
            "note": null
        }, 
        {
            "url": "https://forgemia.inra.fr/thomas.schiex/carthagene", 
            "type": "Repository", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "https://mulcyber.toulouse.inra.fr/docman/?group_id=5&view=listfile&dirid=1", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "9322047", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "CARTHAGENE: constructing and joining maximum likelihood genetic maps.", 
                "abstract": "Genetic mapping is an important step in the study of any organism. An accurate genetic map is extremely valuable for locating genes or more generally either qualitative or quantitative trait loci (QTL). This paper presents a new approach to two important problems in genetic mapping: automatically ordering markers to obtain a multipoint maximum likelihood map and building a multipoint maximum likelihood map using pooled data from several crosses. The approach is embodied in an hybrid algorithm that mixes the statistical optimization algorithm EM with local search techniques which have been developed in the artificial intelligence and operations research communities. An efficient implementation of the EM algorithm provides maximum likelihood recombination fractions, while the local search techniques look for orders that maximize this maximum likelihood. The specificity of the approach lies in the neighborhood structure used in the local search algorithms which has been inspired by an analogy between the marker ordering problem and the famous traveling salesman problem. The approach has been used to build joined maps for the wasp Trichogramma brassicae and on random pooled data sets. In both cases, it compares quite favorably with existing softwares as far as maximum likelihood is considered as a significant criteria.", 
                "date": "1997-01-01T00:00:00Z", 
                "citationCount": 112, 
                "authors": [
                    {
                        "name": "Schiex T."
                    }, 
                    {
                        "name": "Gaspin C."
                    }
                ], 
                "journal": "Proceedings / ... International Conference on Intelligent Systems for Molecular Biology ; ISMB. International Conference on Intelligent Systems for Molecular Biology"
            }
        }
    ], 
    "credit": [
        {
            "name": "Patrick Chabrier", 
            "email": "patrick.chabrier@toulouse.inra.fr", 
            "url": "https://mulcyber.toulouse.inra.fr/projects/carthagene/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T18:39:18Z", 
    "lastUpdate": "2019-02-11T20:37:34Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 0, 
    "homepage_status": 0, 
    "elixir_badge": 0
}