{
    "additionDate": "2021-01-18T09:38:08Z",
    "biotoolsCURIE": "biotools:guip1",
    "biotoolsID": "guip1",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Caroline.Mollevi@icm.unicancer.fr",
            "name": "C. Mollevi",
            "orcidid": "https://orcid.org/0000-0003-4827-3684",
            "typeEntity": "Person"
        }
    ],
    "description": "a R package for dose escalation strategies in phase I cancer clinical trials.\n\nGraphical User Interfaces for Phase I Designs.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ddinart/GUIP1",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-30T10:16:47Z",
    "name": "GUIP1",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12911-020-01149-3",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: The main objective of phase I cancer clinical trials is to identify the maximum tolerated dose, usually defined as the highest dose associated with an acceptable level of severe toxicity during the first cycle of treatment. Several dose-escalation designs based on mathematical modeling of the dose-toxicity relationship have been developed. The main ones are: the continual reassessment method (CRM), the escalation with overdose control (EWOC) method and, for late-onset and cumulative toxicities, the time-to-event continual reassessment method (TITE-CRM) and the time-to-event escalation with overdose control (TITE-EWOC) methods. The objective of this work was to perform a user-friendly R package that combines the latter model-guided adaptive designs. Results: GUIP1 is an R Graphical User Interface for dose escalation strategies in Phase 1 cancer clinical trials. It implements the CRM (based on Bayesian or maximum likelihood estimation), EWOC and TITE-CRM methods using the dfcrm and bcrm R packages, while the TITE-EWOC method has been specifically developed. The program is built using the TCL/TK programming language, which can be compiled via R software libraries (tcltk, tkrplot, tcltk2). GUIP1 offers the possibility of simulating and/or conducting and managing phase I clinical trials in real-time using file management options with automatic backup of study and/or simulation results. Conclusions: GUIP1 is implemented using the software R, which is widely used by statisticians in oncology. This package simplifies the use of the main model-based dose escalation methods and is designed to be fairly simple for beginners in R. Furthermore, it offers multiple possibilities such as a full traceability of the study. By including multiple innovative adaptive methods in a free and user-friendly program, we hope that GUIP1 will promote and facilitate their use in designing future phase I cancer clinical trials.",
                "authors": [
                    {
                        "name": "Dinart D."
                    },
                    {
                        "name": "Fraisse J."
                    },
                    {
                        "name": "Tosi D."
                    },
                    {
                        "name": "Mauguen A."
                    },
                    {
                        "name": "Touraine C."
                    },
                    {
                        "name": "Gourgou S."
                    },
                    {
                        "name": "Le Deley M.C."
                    },
                    {
                        "name": "Le Deley M.C."
                    },
                    {
                        "name": "Bellera C."
                    },
                    {
                        "name": "Mollevi C."
                    },
                    {
                        "name": "Mollevi C."
                    }
                ],
                "date": "2020-06-24T00:00:00Z",
                "journal": "BMC Medical Informatics and Decision Making",
                "title": "GUIP1: A R package for dose escalation strategies in phase i cancer clinical trials"
            },
            "pmcid": "PMC7469913",
            "pmid": "32580715"
        }
    ],
    "toolType": [
        "Desktop application",
        "Library"
    ],
    "topic": [
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}