{
    "accessibility": [
        "Open access"
    ],
    "additionDate": "2019-11-05T14:23:24Z",
    "biotoolsCURIE": "biotools:NORINE",
    "biotoolsID": "NORINE",
    "collectionID": [
        "elixir-fr-sdp-2019"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "email": "norine@univ-lille.fr",
            "name": "Norine team"
        }
    ],
    "description": "NORINE is a platform that includes a database of nonribosomal peptides together with tools for their analysis.",
    "editPermission": {
        "type": "private"
    },
    "elixirNode": [
        "France"
    ],
    "elixirPlatform": [
        "Data"
    ],
    "homepage": "https://bioinfo.cristal.univ-lille.fr/norine/",
    "lastUpdate": "2020-02-28T16:43:35Z",
    "license": "CC-BY-NC-SA-4.0",
    "maturity": "Mature",
    "name": "NORINE",
    "owner": "Pupin",
    "publication": [
        {
            "doi": "10.1093/nar/gkz1000",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press on behalf of Nucleic Acids Research.Norine, the unique resource dedicated to nonribosomal peptides (NRPs), is now updated with a new pipeline to automate massive sourcing and enhance annotation. External databases are mined to extract NRPs that are not yet in Norine. To maintain a high data quality, successive filters are applied to automatically validate the NRP annotations and only validated data is inserted in the database. External databases were also used to complete annotations of NRPs already in Norine. Besides, annotation consistency inside Norine and between Norine and external sources have reported annotation errors. Some can be corrected automatically, while others need manual curation. This new approach led to the insertion of 539 new NRPs and the addition or correction of annotations of nearly all Norine entries. Two new tools to analyse the chemical structures of NRPs (rBAN) and to infer a molecular formula from the mass-to-charge ratio of an NRP (Kendrick Formula Predictor) were also integrated. Norine is freely accessible from the following URL: https://bioinfo.cristal.univ-lille.fr/norine/.",
                "authors": [
                    {
                        "name": "Flissi A."
                    },
                    {
                        "name": "Ricart E."
                    },
                    {
                        "name": "Campart C."
                    },
                    {
                        "name": "Chevalier M."
                    },
                    {
                        "name": "Dufresne Y."
                    },
                    {
                        "name": "Michalik J."
                    },
                    {
                        "name": "Jacques P."
                    },
                    {
                        "name": "Flahaut C."
                    },
                    {
                        "name": "Lisacek F."
                    },
                    {
                        "name": "Leclere V."
                    },
                    {
                        "name": "Pupin M."
                    }
                ],
                "date": "2020-01-08T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "Norine: update of the nonribosomal peptide resource"
            },
            "type": "Primary"
        },
        {
            "doi": "10.1093/nar/gkv1143",
            "metadata": {
                "abstract": "© The Author(s) 2015. Published by Oxford University Press on behalf of Nucleic Acids Research.Since its creation in 2006, Norine remains the unique knowledgebase dedicated to non-ribosomal peptides (NRPs). These secondary metabolites, produced by bacteria and fungi, harbor diverse interesting biological activities (such as antibiotic, antitumor, siderophore or surfactant) directly related to the diversity of their structures. The Norine team goal is to collect the NRPs and provide tools to analyze them efficiently. We have developed a user-friendly interface and dedicated tools to provide a complete bioinformatics platform. The knowledgebase gathers abundant and valuable annotations on more than 1100 NRPs. To increase the quantity of described NRPs and improve the quality of associated annotations, we are now opening Norine to crowdsourcing. We believe that contributors from the scientific community are the best experts to annotate the NRPs they work on. We have developed MyNorine to facilitate the submission of new NRPs or modifications of stored ones. This article presents MyNorine and other novelties of Norine interface released since the first publication. Norine is freely accessible from the following URL: http://bioinfo.lifl.fr/NRP.",
                "authors": [
                    {
                        "name": "Flissi A."
                    },
                    {
                        "name": "Dufresne Y."
                    },
                    {
                        "name": "Michalik J."
                    },
                    {
                        "name": "Tonon L."
                    },
                    {
                        "name": "Janot S."
                    },
                    {
                        "name": "Noe L."
                    },
                    {
                        "name": "Jacques P."
                    },
                    {
                        "name": "Leclere V."
                    },
                    {
                        "name": "Pupin M."
                    }
                ],
                "citationCount": 30,
                "date": "2016-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Norine, the knowledgebase dedicated to non-ribosomal peptides, is now open to crowdsourcing"
            },
            "type": "Other"
        },
        {
            "doi": "10.1093/nar/gkm792",
            "metadata": {
                "abstract": "Norine is the first database entirely dedicated to nonribosomal peptides (NRPs). In bacteria and fungi, in addition to the traditional ribosomal proteic biosynthesis, an alternative ribosome-independent pathway called NRP synthesis allows peptide production. It is performed by huge protein complexes called nonribosomal peptide synthetases (NRPSs). The molecules synthesized by NRPS contain a high proportion of nonproteogenic amino acids. The primary structure of these peptides is not always linear but often more complex and may contain cycles and branchings. In recent years, NRPs attracted a lot of attention because of their biological activities and pharmacological properties (antibiotic, immunosuppressor, antitumor, etc.). However, few computational resources and tools dedicated to those peptides have been available so far. Norine is focused on NRPs and contains more than 700 entries. The database is freely accessible at http://bioinfo.lifl.fr/norine/. It provides a complete computational tool for systematic study of NRPs in numerous species, and as such, should permit to obtain a better knowledge of these metabolic products and underlying biological mechanisms, and ultimately to contribute to the redesigning of natural products in order to obtain new bioactive compounds for drug discovery. © 2007 The Author(s).",
                "authors": [
                    {
                        "name": "Caboche S."
                    },
                    {
                        "name": "Pupin M."
                    },
                    {
                        "name": "Leclere V."
                    },
                    {
                        "name": "Fontaine A."
                    },
                    {
                        "name": "Jacques P."
                    },
                    {
                        "name": "Kucherov G."
                    }
                ],
                "citationCount": 170,
                "date": "2008-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "NORINE: A database of nonribosomal peptides"
            },
            "type": "Other"
        },
        {
            "doi": "10.1186/1472-6807-9-15",
            "metadata": {
                "abstract": "Background. Nonribosomal peptides (NRPs), bioactive secondary metabolites produced by many microorganisms, show a broad range of important biological activities (e.g. antibiotics, immunosuppressants, antitumor agents). NRPs are mainly composed of amino acids but their primary structure is not always linear and can contain cycles or branchings. Furthermore, there are several hundred different monomers that can be incorporated into NRPs. The NORINE database, the first resource entirely dedicated to NRPs, currently stores more than 700 NRPs annotated with their monomeric peptide structure encoded by undirected labeled graphs. This opens a way to a systematic analysis of structural patterns occurring in NRPs. Such studies can investigate the functional role of some monomeric chains, or analyse NRPs that have been computationally predicted from the synthetase protein sequence. A basic operation in such analyses is the search for a given structural pattern in the database. Results. We developed an efficient method that allows for a quick search for a structural pattern in the NORINE database. The method identifies all peptides containing a pattern substructure of a given size. This amounts to solving a variant of the maximum common subgraph problem on pattern and peptide graphs, which is done by computing cliques in an appropriate compatibility graph. Conclusion. The method has been incorporated into the NORINE database, available at http://bioinfo.lifl.fr/norine. Less than one second is needed to search for a pattern in the entire database.",
                "authors": [
                    {
                        "name": "Caboche S."
                    },
                    {
                        "name": "Pupin M."
                    },
                    {
                        "name": "Leclere V."
                    },
                    {
                        "name": "Jacques P."
                    },
                    {
                        "name": "Kucherov G."
                    }
                ],
                "citationCount": 17,
                "date": "2009-05-08T00:00:00Z",
                "journal": "BMC Structural Biology",
                "title": "Structural pattern matching of nonribosomal peptides"
            },
            "type": "Method"
        },
        {
            "doi": "10.1016/j.synbio.2015.11.001",
            "metadata": {
                "abstract": "© 2016 The Authors.Since its first release in 2008, Norine remains the unique resource completely devoted to nonribosomal peptides (NRPs). They are very attractive microbial secondary metabolites, displaying a remarkable diversity of structure and functions. Norine (. http://bioinfo.lifl.fr/NRP) includes a database now containing more than 1160 annotated peptides and user-friendly interfaces enabling the querying of the database, through the annotations or the structure of the peptides. Dedicated tools are associated for structural comparison of the compounds and prediction of their biological activities. In this paper, we start by describing the knowledgebase and the dedicated tools. We then present some user cases to show how useful Norine is for the discovery of novel nonribosomal peptides.",
                "authors": [
                    {
                        "name": "Pupin M."
                    },
                    {
                        "name": "Esmaeel Q."
                    },
                    {
                        "name": "Flissi A."
                    },
                    {
                        "name": "Dufresne Y."
                    },
                    {
                        "name": "Jacques P."
                    },
                    {
                        "name": "Leclere V."
                    }
                ],
                "citationCount": 13,
                "date": "2016-06-01T00:00:00Z",
                "journal": "Synthetic and Systems Biotechnology",
                "title": "Norine: A powerful resource for novel nonribosomal peptide discovery"
            },
            "type": "Usage"
        },
        {
            "doi": "10.1007/s10658-018-1544-2",
            "metadata": {
                "abstract": "© 2018, Koninklijke Nederlandse Planteziektenkundige Vereniging.As conventional or chemical pesticides have negative impact on environment and health of both farmer and consumers, it becomes relevant to develop alternative solutions to limit their use. In this context, innovative strategies to accelerate the development of biocontrol agents are welcome. For a decade of years, it has been demonstrated that lipopeptides are very efficient weapons against fungi responsible for crop diseases. Lipopeptides are secondary metabolites, produced by many microorganisms including beneficial rhizobacteria. The lipopeptide biosynthetic pathways include nonribosomal peptide synthetases. These modular enzymatic complexes work as assembly lines to build the peptides step by step, leading to the production of original peptide compounds with specific features as the presence of non proteinogenic monomers and cyclic and branched structures. In this paper, Florine and Norine bioinformatics tools, especially dedicated to non-ribosomal synthetases and their products are presented. Their use is mainly focused on the discovery of lipopeptides produced by Bacillus or Pseudomonas because they seem to represent a versatile reservoir of active secondary metabolites with promising activities for applications in phytosanitary area.",
                "authors": [
                    {
                        "name": "Pupin M."
                    },
                    {
                        "name": "Flissi A."
                    },
                    {
                        "name": "Jacques P."
                    },
                    {
                        "name": "Leclere V."
                    }
                ],
                "citationCount": 2,
                "date": "2018-12-15T00:00:00Z",
                "journal": "European Journal of Plant Pathology",
                "title": "Bioinformatics tools for the discovery of new lipopeptides with biocontrol applications"
            },
            "type": "Usage"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Computational chemistry",
            "uri": "http://edamontology.org/topic_3332"
        },
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        },
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Biological databases",
            "uri": "http://edamontology.org/topic_3071"
        }
    ]
}