{
    "accessibility": "Open access",
    "additionDate": "2023-02-13T19:12:51.898871Z",
    "biotoolsCURIE": "biotools:cdhgnn",
    "biotoolsID": "cdhgnn",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "duangh@csu.edu.cn",
            "name": "Guihua Duan",
            "typeEntity": "Person"
        }
    ],
    "description": "Inferring disease-associated circRNAs by multi-source aggregation based on heterogeneous graph neural network.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BioinformaticsCSU/CDHGNN",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-02-13T19:12:51.901633Z",
    "license": "MIT",
    "name": "CDHGNN",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAC549",
            "metadata": {
                "abstract": "© The Author(s) 2022. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.Emerging evidence has proved that circular RNAs (circRNAs) are implicated in pathogenic processes. They are regarded as promising biomarkers for diagnosis due to covalently closed loop structures. As opposed to traditional experiments, computational approaches can identify circRNA-disease associations at a lower cost. Aggregating multi-source pathogenesis data helps to alleviate data sparsity and infer potential associations at the system level. The majority of computational approaches construct a homologous network using multi-source data, but they lose the heterogeneity of the data. Effective methods that use the features of multi-source data are considered as a matter of urgency. In this paper, we propose a model (CDHGNN) based on edge-weighted graph attention and heterogeneous graph neural networks for potential circRNA-disease association prediction. The circRNA network, micro RNA network, disease network and heterogeneous network are constructed based on multi-source data. To reflect association probabilities between nodes, an edge-weighted graph attention network model is designed for node features. To assign attention weights to different types of edges and learn contextual meta-path, CDHGNN infers potential circRNA-disease association based on heterogeneous neural networks. CDHGNN outperforms state-of-the-art algorithms in terms of accuracy. Edge-weighted graph attention networks and heterogeneous graph networks have both improved performance significantly. Furthermore, case studies suggest that CDHGNN is capable of identifying specific molecular associations and investigating biomolecular regulatory relationships in pathogenesis. The code of CDHGNN is freely available at https://github.com/BioinformaticsCSU/CDHGNN.",
                "authors": [
                    {
                        "name": "Duan G."
                    },
                    {
                        "name": "Lan W."
                    },
                    {
                        "name": "Lu C."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Zeng M."
                    },
                    {
                        "name": "Zhang L."
                    }
                ],
                "date": "2023-01-19T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "Inferring disease-associated circRNAs by multi-source aggregation based on heterogeneous graph neural network"
            },
            "pmid": "36572658"
        }
    ],
    "toolType": [
        "Library",
        "Script"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
