{
    "additionDate": "2021-01-18T11:29:17Z",
    "biotoolsCURIE": "biotools:allcopol",
    "biotoolsID": "allcopol",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "christoph.oberprieler@ur.de",
            "name": "Christoph Oberprieler",
            "orcidid": "https://orcid.org/0000-0002-7134-501X",
            "typeEntity": "Person"
        }
    ],
    "description": "AllCoPol is a collection of tools for the analysis of polyploids, which allow to infer ancestral allele combinations as well as corresponding subgenome phylogenies.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic reconstruction",
                    "uri": "http://edamontology.org/operation_3478"
                },
                {
                    "term": "Multilocus sequence typing",
                    "uri": "http://edamontology.org/operation_3840"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "https://github.com/AGOberprieler/allcopol",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-23T14:02:33Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/agoberprieler/allcopol"
        }
    ],
    "name": "AllCoPol",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03750-9",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Inferring phylogenetic relationships of polyploid species and their diploid ancestors (leading to reticulate phylogenies in the case of an allopolyploid origin) based on multi-locus sequence data is complicated by the unknown assignment of alleles found in polyploids to diploid subgenomes. A parsimony-based approach to this problem has been proposed by Oberprieler et al. (Methods Ecol Evol 8:835-849, 2017), however, its implementation is of limited practical value. In addition to previously identified shortcomings, it has been found that in some cases, the obtained results barely satisfy the applied criterion. To be of better use to other researchers, a reimplementation with methodological refinement appears to be indispensable. Results: We present the AllCoPol package, which provides a heuristic method for assigning alleles from polyploids to diploid subgenomes based on the Minimizing Deep Coalescences (MDC) criterion in multi-locus sequence datasets. An additional consensus approach further allows to assess the confidence of phylogenetic reconstructions. Simulations of tetra-and hexaploids show that under simplifying assumptions such as completely disomic inheritance, the topological errors of reconstructed phylogenies are similar to those of MDC species trees based on the true allele partition. Conclusions: AllCoPol is a Python package for phylogenetic reconstructions of polyploids offering enhanced functionality as well as improved usability. The included methods are supplied as command line tools without the need for prior programming knowledge.",
                "authors": [
                    {
                        "name": "Lautenschlager U."
                    },
                    {
                        "name": "Wagner F."
                    },
                    {
                        "name": "Oberprieler C."
                    }
                ],
                "citationCount": 2,
                "date": "2020-10-07T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "AllCoPol: Inferring allele co-ancestry in polyploids"
            },
            "pmcid": "PMC7542712",
            "pmid": "33028201"
        }
    ],
    "toolType": [
        "Suite",
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Computer science",
            "uri": "http://edamontology.org/topic_3316"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}