{
    "additionDate": "2018-05-17T11:57:10Z",
    "biotoolsCURIE": "biotools:megante",
    "biotoolsID": "megante",
    "credit": [
        {
            "email": "megante@ml.affrc.go.jp",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Perform genomic sequence annotations by uploading a sequence and selecting the species to query. Automatically runs several analysis and integrates the results to select the appropriate consensus exon-intron structures and to predict open reading frames (ORFs) at each locus. Functional annotation and a functional domain search, are also performed for the predicted ORFs. The resultant annotation information is visualized with GBrowse and the results can be downloaded in Microsoft Excel format.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://megante.dna.affrc.go.jp/help"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Coding region prediction",
                    "uri": "http://edamontology.org/operation_0436"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "https://megante.dna.affrc.go.jp",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "MEGANTE",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.1093/pcp/pct157",
            "metadata": {
                "abstract": "The recent advancement of high-throughput genome sequencing technologies has resulted in a considerable increase in demands for large-scale genome annotation. While annotation is a crucial step for downstream data analyses and experimental studies, this process requires substantial expertise and knowledge of bioinformatics. Here we present MEGANTE, a web-based annotation system that makes plant genome annotation easy for researchers unfamiliar with bioinformatics. Without any complicated configuration, users can perform genomic sequence annotations simply by uploading a sequence and selecting the species to query. MEGANTE automatically runs several analysis programs and integrates the results to select the appropriate consensus exon-intron structures and to predict open reading frames (ORFs) at each locus. Functional annotation, including a similarity search against known proteins and a functional domain search, are also performed for the predicted ORFs. The resultant annotation information is visualized with a widely used genome browser, GBrowse. For ease of analysis, the results can be downloaded in Microsoft Excel format. All of the query sequences and annotation results are stored on the server side so that users can access their own data from virtually anywhere on the web. The current release of MEGANTE targets 24 plant species from the Brassicaceae, Fabaceae, Musaceae, Poaceae, Salicaceae, Solanaceae, Rosaceae and Vitaceae families, and it allows users to submit a sequence up to 10 Mb in length and to save up to 100 sequences with the annotation information on the server. The MEGANTE web service is available at https://megante.dna.affrc.go.jp/. © 2013 The Author.",
                "authors": [
                    {
                        "name": "Numa H."
                    },
                    {
                        "name": "Itoh T."
                    }
                ],
                "citationCount": 14,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Plant and Cell Physiology",
                "title": "MEGANTE: A web-based system for integrated plant genome annotation"
            },
            "pmcid": "PMC3894707",
            "pmid": "24253915"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1
}