{
    "additionDate": "2017-03-27T07:56:41Z",
    "biotoolsCURIE": "biotools:phosphat",
    "biotoolsID": "phosphat",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "email": "wschulze@mpimp-golm.mpg.de",
            "name": "Waltraud X. Schulze",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Contains information on Arabidopsis phosphorylation sites which were identified by mass spectrometry in large scale experiments by different research groups. Specific information about the peptide properties, their annotated biological function as well as the experimental and analytical context is given. For a majority of peptides, the actual annotated mass spectrum is displayed in interactive manner.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://phosphat.uni-hohenheim.de/background.html"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Post-translation modification site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                }
            ]
        }
    ],
    "homepage": "http://phosphat.mpimp-golm.mpg.de/",
    "language": [
        "SQL"
    ],
    "lastUpdate": "2019-03-26T08:31:57Z",
    "name": "PhosPhAt",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "The PhosPhAt database of Arabidopsis phosphorylation sites was initially launched in August 2007. Since then, along with 10-fold increase in database entries, functionality of PhosPhAt (phosphat.mpimp-golm.mpg.de) has been considerably upgraded and re-designed. PhosPhAt is now more of a web application with the inclusion of advanced search functions allowing combinatorial searches by Boolean terms. The results output now includes interactive visualization of annotated fragmentation spectra and the ability to export spectra and peptide sequences as text files for use in other applications. We have also implemented dynamic links to other web resources thus augmenting PhosPhAt-specific information with external protein-related data. For experimental phosphorylation sites with information about dynamic behavior in response to external stimuli, we display simple time-resolved diagrams. We have included predictions for pT and pY sites and updated pS predictions. Access to prediction algorithm now allows 'on-the-fly' prediction of phosphorylation of any user-uploaded protein sequence. Protein Pfam domain structures are now mapped onto the protein sequence display next to experimental and predicted phosphorylation sites. Finally, we have implemented functional annotation of proteins using MAPMAN ontology. These new developments make the PhosPhAt resource a useful and powerful tool for the scientific community as a whole beyond the plant sciences. © The Author(s) 2009. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Durek P."
                    },
                    {
                        "name": "Heazlewood J.L."
                    },
                    {
                        "name": "Jones A."
                    },
                    {
                        "name": "Kersten B."
                    },
                    {
                        "name": "MacLean D."
                    },
                    {
                        "name": "Nagel A."
                    },
                    {
                        "name": "Schmidt R."
                    },
                    {
                        "name": "Schulze W.X."
                    }
                ],
                "citationCount": 265,
                "date": "2009-10-30T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PhosPhAt: The Arabidopsis thaliana phosphorylation site database. An update"
            },
            "pmid": "19880383"
        },
        {
            "metadata": {
                "abstract": "The PhosPhAt database provides a resource consolidating our current knowledge of mass spectrometry-based identified phosphorylation sites in Arabidopsis and combines it with phosphorylation site prediction specifically trained on experimentally identified Arabidopsis phosphorylation motifs. The database currently contains 1187 unique tryptic peptide sequences encompassing 1053 Arabidopsis proteins. Among the characterized phosphorylation sites, there are over 1000 with unambiguous site assignments, and nearly 500 for which the precise phosphorylation site could not be determined. The database is searchable by protein accession number, physical peptide characteristics, as well as by experimental conditions (tissue sampled, phosphopeptide enrichment method). For each protein, a phosphorylation site overview is presented in tabular form with detailed information on each identified phosphopeptide. We have utilized a set of 802 experimentally validated serine phosphorylation sites to develop a method for prediction of serine phosphorylation (pSer) in Arabidopsis. An analysis of the current annotated Arabidopsis proteome yielded in 27 782 predicted phosphoserine sites distributed across 17 035 proteins. These prediction results are summarized graphically in the database together with the experimental phosphorylation sites in a whole sequence context. The Arabidopsis Protein Phosphorylation Site Database (PhosPhAt) provides a valuable resource to the plant science community and can be accessed through the following link http://phosphat.mpimp-golm.mpg.de. © 2007 The Author(s).",
                "authors": [
                    {
                        "name": "Durek P."
                    },
                    {
                        "name": "Heazlewood J.I."
                    },
                    {
                        "name": "Hummel J."
                    },
                    {
                        "name": "Schulze W.X."
                    },
                    {
                        "name": "Selbig J."
                    },
                    {
                        "name": "Walther D."
                    },
                    {
                        "name": "Weckwerth W."
                    }
                ],
                "citationCount": 248,
                "date": "2008-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PhosPhAt : A database of phosphorylation sites in Arabidopsis thaliana and a plant-specific phosphorylation site predictor"
            },
            "pmid": "17984086"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
