{
    "accessibility": [],
    "additionDate": "2017-08-03T18:59:37Z",
    "biotoolsCURIE": "biotools:silactor",
    "biotoolsID": "silactor",
    "collectionID": [
        "Proteomics"
    ],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": "jimbruce@uw.edu",
            "gridid": null,
            "name": null,
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://brucelab.gs.washington.edu/"
        }
    ],
    "description": "Software for automated protein turnover analysis and method refinement for SILAC data.",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "http://brucelab.gs.washington.edu/SILACtor/instructions.html"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "SILAC",
                    "uri": "http://edamontology.org/operation_3638"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://brucelab.gs.washington.edu/software.html",
    "homepage_status": 0,
    "language": [],
    "lastUpdate": "2019-03-26T08:38:32Z",
    "license": null,
    "link": [
        {
            "note": null,
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/silactor-1-0-dynamic-silac-studies.html"
        }
    ],
    "maturity": null,
    "name": "SILACtor",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "otherID": [],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": null,
            "metadata": {
                "abstract": "Protein interaction reporter (PIR) technology can enable identification of in vivo protein interactions with the use of specialized chemical cross-linkers, liquid chromatography, and high-resolution mass spectrometry. PIR-cross-linkers contain labile bonds that are specifically fragmented under low energy collision or photodissociation conditions in the mass spectrometer source, thus releasing cross-linked peptides. Successful analysis of PIR-cross-linked proteins requires the use of expected mathematical relationships between cross-linked complexes and released peptides after fragmentation of the labile PIR bonds. Presented here is a next-generation software tool, BLinks, for use in the analysis and identification of PIR-cross-linked proteins. BLinks is an advancement beyond our previous efforts by incorporation of chromatographic profiles that must match between cross-linked complexes and released peptides to enable estimation of p-values to help filter true relationships from complex data sets. Additionally, BLinks was used to incorporate Mascot database searching results from subsequent MS/MS analysis of the released peptides to facilitate identification of cross-linked proteins. BLinks was used in the analysis of human serum albumin, and 46 interpeptide relationships were found spanning 30 proximal residues with a 2.2% false discovery rate. BLinks was also used to track peptides involved in multiple, coeluting relationships that make accurate identification of protein interactions difficult. An additional 10 interpeptide relationships were identified despite poor correlation using the profiling tools provided with BLinks. Additionally, BLinks can be used to globally map all interpeptide relationships from the data analysis and customize subsequent analysis to target specific peptides of interest, thus making it a useful tool for both discovery of protein interactions and mapping protein topology. © 2010 American Chemical Society.",
                "authors": [
                    {
                        "name": "Hoopmann M.R."
                    },
                    {
                        "name": "Weisbrod C.R."
                    },
                    {
                        "name": "Bruce J.E."
                    }
                ],
                "citationCount": 24,
                "date": "2010-12-03T00:00:00Z",
                "journal": "Journal of Proteome Research",
                "title": "Improved strategies for rapid identification of chemically cross-linked peptides using protein interaction reporter technology"
            },
            "note": null,
            "pmcid": null,
            "pmid": "20886857",
            "type": null,
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ],
    "validated": 0,
    "version": []
}