{
    "accessibility": "Open access",
    "additionDate": "2024-02-05T15:02:04.274469Z",
    "biotoolsCURIE": "biotools:cbp60-db",
    "biotoolsID": "cbp60-db",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "dcastroverde@wlu.ca",
            "name": "Christian Danve M. Castroverde",
            "orcidid": "https://orcid.org/0000-0002-9982-8451",
            "typeEntity": "Person"
        },
        {
            "email": "aman5230@mylaurier.ca",
            "name": "Keaun Amani",
            "typeEntity": "Person"
        }
    ],
    "description": "An AlphaFold-predicted plant kingdom-wide database of the CALMODULIN-BINDING PROTEIN 60 protein family with a novel structural clustering algorithm.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "PTM localisation",
                    "uri": "http://edamontology.org/operation_3755"
                },
                {
                    "term": "Phylogenetic tree comparison",
                    "uri": "http://edamontology.org/operation_0325"
                },
                {
                    "term": "Phylogenetic tree visualisation",
                    "uri": "http://edamontology.org/operation_0567"
                },
                {
                    "term": "Structure clustering",
                    "uri": "http://edamontology.org/operation_2844"
                }
            ]
        }
    ],
    "homepage": "https://cbp60db.wlu.ca/",
    "lastUpdate": "2024-11-24T14:17:52.946045Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/KeaunAmani/cbp60db/"
        }
    ],
    "name": "CBP60-DB",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/pld3.509",
            "metadata": {
                "abstract": "Molecular genetic analyses in the model species Arabidopsis thaliana have demonstrated the major roles of different CALMODULIN-BINDING PROTEIN 60 (CBP60) proteins in growth, stress signaling, and immune responses. Prominently, CBP60g and SARD1 are paralogous CBP60 transcription factors that regulate numerous components of the immune system, such as cell surface and intracellular immune receptors, MAP kinases, WRKY transcription factors, and biosynthetic enzymes for immunity-activating metabolites salicylic acid (SA) and N-hydroxypipecolic acid (NHP). However, their function, regulation, and diversification in most species remain unclear. Here, we have created CBP60-DB (https://cbp60db.wlu.ca/), a structural and bioinformatic database that comprehensively characterized 1052 CBP60 gene homologs (encoding 2376 unique transcripts and 1996 unique proteins) across 62 phylogenetically diverse genomes in the plant kingdom. We have employed deep learning-predicted structural analyses using AlphaFold2 and then generated dedicated web pages for all plant CBP60 proteins. Importantly, we have generated a novel clustering visualization algorithm to interrogate kingdom-wide structural similarities for more efficient inference of conserved functions across various plant taxa. Because well-characterized CBP60 proteins in Arabidopsis are known to be transcription factors with putative calmodulin-binding domains, we have integrated external bioinformatic resources to analyze protein domains and motifs. Collectively, we present a plant kingdom-wide identification of this important protein family in a user-friendly AlphaFold-anchored database, representing a novel and significant resource for the broader plant biology community.",
                "authors": [
                    {
                        "name": "Amani K."
                    },
                    {
                        "name": "Castroverde C.D.M."
                    },
                    {
                        "name": "Shivnauth V."
                    }
                ],
                "citationCount": 2,
                "date": "2023-07-01T00:00:00Z",
                "journal": "Plant Direct",
                "title": "CBP60-DB: An AlphaFold-predicted plant kingdom-wide database of the CALMODULIN-BINDING PROTEIN 60 protein family with a novel structural clustering algorithm"
            },
            "pmcid": "PMC10331130",
            "pmid": "37435612"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        }
    ]
}
