{
    "additionDate": "2021-10-25T05:45:33.840295Z",
    "biotoolsCURIE": "biotools:mutvis",
    "biotoolsID": "mutvis",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "vidya.n@rvce.edu.in",
            "name": "Vidya Niranjan",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "MutVis is an automated framework for analysis and visualization of mutational signatures in pathogenic bacterial strains. MutVis is an open-source, user-friendly, automated framework for analysis and visualization of mutational signatures in pathogenic bacterial strains, regardless the number, origin or species. The current framework integrates various opensource tools and is scripted using Python, R programming and Snakemake workflow management software. MutVis supports variant calling, processing of VCF files, transition and transversion graphical representation, generation of mutational count matrix, graphical visualization of basepair substitution spectrum (BPS) and mutation signatures.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Virulence prediction",
                    "uri": "http://edamontology.org/operation_3461"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/AkshathaPrasanna/MutVis",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2021-10-25T05:45:33.843085Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/AkshathaPrasanna/MutVis/issues"
        }
    ],
    "name": "MutVis",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.MEEGID.2021.104805",
            "metadata": {
                "abstract": "© 2021 Elsevier B.V.In recent years, mutational signature analysis has become a routine practice in cancer genomics for classification and diagnosis. Characterizing mutational signatures across species or within genomes of a bacteria helps in understanding their evolution and adaptation. However, an integrated framework for analysis and visualization of mutational signatures in bacterial genome is lacking. Hence, we aim to develop an integrated, automated, open-source and user-friendly framework called MutVis to analyze mutational signatures from bacterial whole genome next generation sequencing data. The current framework integrates various publicly available packages using Snakemake workflow management software, Python and R scripting. MutVis supports variant calling, transition (Ti) and transversion (Tv) graphical representation, generation of mutational count matrix, graphical visualization of base-pair substitution spectrum (BPSs) and mutation signatures extraction. TvTi plots provide the 6 base substitution classification for both genome and gene level. Further resolution of base pair substitution classification is provided as 96-profile BPSs plot. Mutation signatures is derived based on the characteristic pattern observed in BPSs using non-negative matrix factorization. Relative contribution of signatures is given as hierarchically clustered heatmap. This provides information on active signatures in the individual given sample and classify samples according to signature contributions. We demonstrated the MutVis framework using geographically different strains of Mycobacterium tuberculosis, downloaded from PATRIC TB-ARC Antibiotic Resistance Catalog (n = 963). The current framework can be used to study mutation biases and characteristic mutational signatures in bacterial genomes and is freely available at https://github.com/AkshathaPrasanna/MutVis.",
                "authors": [
                    {
                        "name": "Niranjan V."
                    },
                    {
                        "name": "Prasanna A."
                    }
                ],
                "date": "2021-07-01T00:00:00Z",
                "journal": "Infection, Genetics and Evolution",
                "title": "MutVis: Automated framework for analysis and visualization of mutational signatures in pathogenic bacterial strains"
            },
            "pmid": "33689914",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
