{
    "additionDate": "2017-12-18T00:06:48Z",
    "biotoolsCURIE": "biotools:gigi-check",
    "biotoolsID": "gigi-check",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://faculty.washington.edu/wijsman/"
        }
    ],
    "description": "A C++ program to detect Mendelian consistent genotyping errors of dense markers in pedigree data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://faculty.washington.edu/wijsman/progdists/gigi/software/GIGI-Check/GIGI-Check_v1_06_Documentation.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://faculty.washington.edu/wijsman/progdists/gigi/software/GIGI-Check/GIGI-Check.html",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/gigi-check-detection-of-mendelian-consistent-genotyping-errors.html"
        }
    ],
    "name": "GIGI-Check",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1002/gepi.21806",
            "metadata": {
                "abstract": "Detection of genotyping errors is a necessary step to minimize false results in genetic analysis. This is especially important when the rate of genotyping errors is high, as has been reported for high-throughput sequence data. To detect genotyping errors in pedigrees, Mendelian inconsistent (MI) error checks exist, as do multi-point methods that flag Mendelian consistent (MC) errors for sparse multi-allelic markers. However, few methods exist for detecting MC genotyping errors, particularly for dense variants on large pedigrees. Here, we introduce an efficient method to detect MC errors even for very dense variants (e.g., SNPs and sequencing data) on pedigrees that may be large. Our method first samples inheritance vectors (IVs) using a moderately sparse but informative set of markers using a Markov chain Monte Carlo-based sampler. Using sampled IVs, we considered two test statistics to detect MC genotyping errors: the percentage of IVs inconsistent with observed genotypes (A1) or the posterior probability of error configurations (A2). Using simulations, we show that this method, even with the simpler A1 statistic, is effective for detecting MC genotyping errors in dense variants, with sensitivity almost as high as the theoretical best sensitivity possible. We also evaluate the effectiveness of this method as a function of parameters, when including the observed pattern for genotype, density of framework markers, error rate, allele frequencies, and number of sampled inheritance vectors. Our approach provides a line of defense against false findings based on the use of dense variants in pedigrees. © 2014 WILEY PERIODICALS, INC.",
                "authors": [
                    {
                        "name": "Cheung C.Y.K."
                    },
                    {
                        "name": "Thompson E.A."
                    },
                    {
                        "name": "Wijsman E.M."
                    }
                ],
                "citationCount": 8,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Genetic Epidemiology",
                "title": "Detection of mendelian consistent genotyping errors in pedigrees"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Genotyping experiment",
            "uri": "http://edamontology.org/topic_3516"
        }
    ],
    "validated": 1,
    "version": [
        "1.06"
    ]
}
