{
    "additionDate": "2017-05-01T17:08:41Z",
    "biotoolsCURIE": "biotools:cnver",
    "biotoolsID": "cnver",
    "credit": [
        {
            "email": "cnver@cs.toronto.edu",
            "name": "CNVer support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "CNVer is a method for CNV detection that supplements the depth-of-coverage with paired-end mapping information, where matepairs mapping discordantly to the reference serve to indicate the presence of variation. CNVer combines this information within a unified computational framework called the donor graph, allowing it to better mitigate the sequencing biases that cause uneven local coverage.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://compbio.cs.toronto.edu/cnver/README-0.8.1.txt"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Copy number estimation",
                    "uri": "http://edamontology.org/operation_3233"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "http://compbio.cs.toronto.edu/CNVer/",
    "lastUpdate": "2021-04-15T20:54:35Z",
    "name": "CNVer",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_010820"
        }
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "The development of high-throughput sequencing (HTS) technologies has opened the door to novel methods for detecting copy number variants (CNVs) in the human genome. While in the past CNVs have been detected based on array CGH data, recent studies have shown that depth-of-coverage information from HTS technologies can also be used for the reliable identification of large copy-variable regions. Such methods, however, are hindered by sequencing biases that lead certain regions of the genome to be over- or undersampled, lowering their resolution and ability to accurately identify the exact breakpoints of the variants. In this work, we develop a method for CNV detection that supplements the depth-ofcoverage with paired-end mapping information, where mate pairs mapping discordantly to the reference serve to indicate the presence of variation. Our algorithm, called CNVer, combines this information within a unified computational framework called the donor graph, allowing us to better mitigate the sequencing biases that cause uneven local coverage and accurately predict CNVs. We use CNVer to detect 4879 CNVs in the recently described genome of a Yoruban individual. Most of the calls (77%) coincide with previously known variants within the Database of Genomic Variants, while 81% of deletion copy number variants previously known for this individual coincide with one of our loss calls. Furthermore, we demonstrate that CNVer can reconstruct the absolute copy counts of segments of the donor genome and evaluate the feasibility of using CNVer with low coverage datasets. © 2010 by Cold Spring Harbor Laboratory Press.",
                "authors": [
                    {
                        "name": "Brudno M."
                    },
                    {
                        "name": "Dzamba M."
                    },
                    {
                        "name": "Fiume M."
                    },
                    {
                        "name": "Medvedev P."
                    },
                    {
                        "name": "Smith T."
                    }
                ],
                "citationCount": 119,
                "date": "2010-11-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "Detecting copy number variation with mated short reads"
            },
            "pmid": "20805290"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
