{
    "additionDate": "2020-01-14T19:45:21Z",
    "biotoolsCURIE": "biotools:CYBERTRACK",
    "biotoolsID": "CYBERTRACK",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "shimamura@med.nagoya-u.ac.jp",
            "name": "Teppei Shimamura",
            "typeEntity": "Person"
        }
    ],
    "description": "Model-based cell clustering and population tracking for time-series flow cytometry data.\nCYBERTRACK is an R package for CYtometry-Based Estimation and Reasoning for cell populatiomn TRACKing",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "RNA-seq time series data analysis",
                    "uri": "http://edamontology.org/operation_3565"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "https://github.com/kodaim1115/CYBERTRACK",
    "language": [
        "C++",
        "R"
    ],
    "lastUpdate": "2020-12-17T11:52:46Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/kodaim1115/CYBERTRACK/issues"
        }
    ],
    "name": "CYBERTRACK",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3294-3",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Modern flow cytometry technology has enabled the simultaneous analysis of multiple cell markers at the single-cell level, and it is widely used in a broad field of research. The detection of cell populations in flow cytometry data has long been dependent on \"manual gating\" by visual inspection. Recently, numerous software have been developed for automatic, computationally guided detection of cell populations; however, they are not designed for time-series flow cytometry data. Time-series flow cytometry data are indispensable for investigating the dynamics of cell populations that could not be elucidated by static time-point analysis. Therefore, there is a great need for tools to systematically analyze time-series flow cytometry data. Results: We propose a simple and efficient statistical framework, named CYBERTRACK (CYtometry-Based Estimation and Reasoning for TRACKing cell populations), to perform clustering and cell population tracking for time-series flow cytometry data. CYBERTRACK assumes that flow cytometry data are generated from a multivariate Gaussian mixture distribution with its mixture proportion at the current time dependent on that at a previous timepoint. Using simulation data, we evaluate the performance of CYBERTRACK when estimating parameters for a multivariate Gaussian mixture distribution, tracking time-dependent transitions of mixture proportions, and detecting change-points in the overall mixture proportion. The CYBERTRACK performance is validated using two real flow cytometry datasets, which demonstrate that the population dynamics detected by CYBERTRACK are consistent with our prior knowledge of lymphocyte behavior. Conclusions: Our results indicate that CYBERTRACK offers better understandings of time-dependent cell population dynamics to cytometry users by systematically analyzing time-series flow cytometry data.",
                "authors": [
                    {
                        "name": "Abe K."
                    },
                    {
                        "name": "Maeda Y."
                    },
                    {
                        "name": "Minoura K."
                    },
                    {
                        "name": "Nishikawa H."
                    },
                    {
                        "name": "Shimamura T."
                    }
                ],
                "citationCount": 1,
                "date": "2019-12-27T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Model-based cell clustering and population tracking for time-series flow cytometry data"
            },
            "pmcid": "PMC6933651",
            "pmid": "31881827"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Regenerative medicine",
            "uri": "http://edamontology.org/topic_3395"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
