{
    "additionDate": "2020-01-09T17:56:57Z",
    "biotoolsCURIE": "biotools:FHIR",
    "biotoolsID": "FHIR",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "epfaff@email.unc.edu",
            "name": "Emily Rose Pfaff",
            "orcidid": "https://orcid.org/0000-0002-6840-9756",
            "typeEntity": "Person"
        },
        {
            "email": "Jiang.Guoqian@mayo.edu",
            "name": "Guoqian Jiang",
            "typeEntity": "Person"
        }
    ],
    "description": "FHIR is a standard for health care data exchange. It is a platform specification that defines a set of capabilities use across the healthcare process, in all jurisdictions, and in lots of different contexts.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://www.hl7.org/fhir/modules.html"
        },
        {
            "type": [
                "General"
            ],
            "url": "https://www.hl7.org/fhir/documentation.html"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                }
            ]
        }
    ],
    "homepage": "https://www.hl7.org/fhir/index.html",
    "lastUpdate": "2021-01-07T19:21:58Z",
    "name": "FHIR",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.2196/15199",
            "metadata": {
                "abstract": "© 2019 JMIR Publications Inc.. All right reserved.Background: In a multisite clinical research collaboration, institutions may or may not use the same common data model (CDM) to store clinical data. To overcome this challenge, we proposed to use Health Level 7's Fast Healthcare Interoperability Resources (FHIR) as a meta-CDM-a single standard to represent clinical data. Objective: In this study, we aimed to create an open-source application termed the Clinical Asset Mapping Program for FHIR (CAMP FHIR) to efficiently transform clinical data to FHIR for supporting source-agnostic CDM-to-FHIR mapping. Methods: Mapping with CAMP FHIR involves (1) mapping each source variable to its corresponding FHIR element and (2) mapping each item in the source data's value sets to the corresponding FHIR value set item for variables with strict value sets. To date, CAMP FHIR has been used to transform 108 variables from the Informatics for Integrating Biology & the Bedside (i2b2) and Patient-Centered Outcomes Research Network data models to fields across 7 FHIR resources. It is designed to allow input from any source data model and will support additional FHIR resources in the future. Results: We have used CAMP FHIR to transform data on approximately 23,000 patients with asthma from our institution's i2b2 database. Data quality and integrity were validated against the origin point of the data, our enterprise clinical data warehouse. Conclusions: We believe that CAMP FHIR can serve as an alternative to implementing new CDMs on a project-by-project basis. Moreover, the use of FHIR as a CDM could support rare data sharing opportunities, such as collaborations between academic medical centers and community hospitals. We anticipate adoption and use of CAMP FHIR to foster sharing of clinical data across institutions for downstream applications in translational research.",
                "authors": [
                    {
                        "name": "Pfaff E.R."
                    },
                    {
                        "name": "Champion J."
                    },
                    {
                        "name": "Bradford R.L."
                    },
                    {
                        "name": "Clark M."
                    },
                    {
                        "name": "Xu H."
                    },
                    {
                        "name": "Fecho K."
                    },
                    {
                        "name": "Krishnamurthy A."
                    },
                    {
                        "name": "Cox S."
                    },
                    {
                        "name": "Chute C.G."
                    },
                    {
                        "name": "Taylor C.O."
                    },
                    {
                        "name": "Ahalt S."
                    }
                ],
                "citationCount": 8,
                "date": "2019-10-01T00:00:00Z",
                "journal": "JMIR Medical Informatics",
                "title": "Fast healthcare interoperability resources (fhir) as a meta model to integrate common data models: Development of a tool and quantitative validation study"
            },
            "pmcid": "PMC6913576",
            "pmid": "31621639"
        },
        {
            "doi": "10.1007/S41666-018-0043-8",
            "metadata": {
                "abstract": "© 2019, Springer Nature Switzerland AG.The rich semantic representation and sophisticated structure definition of the HL7 Fast Healthcare Interoperability Resources (FHIR) specification require relatively great efforts to understand and utilize. The objective of our study is to design, develop, and evaluate an open-source and user-friendly visualization interface for exploring the FHIR specification. We prototyped an interactive visualization tool for navigating and manipulating the FHIR core resources, profiles, and extensions. The utility of the tool was evaluated using evaluation metrics mainly focusing on its interactive mechanism and content expressiveness. We demonstrated that the visualization techniques are helpful for navigating the HL7 FHIR specification and aiding its profiling.",
                "authors": [
                    {
                        "name": "Hong N."
                    },
                    {
                        "name": "Wang K."
                    },
                    {
                        "name": "Wu S."
                    },
                    {
                        "name": "Shen F."
                    },
                    {
                        "name": "Yao L."
                    },
                    {
                        "name": "Jiang G."
                    }
                ],
                "citationCount": 2,
                "date": "2019-09-15T00:00:00Z",
                "journal": "Journal of Healthcare Informatics Research",
                "title": "An Interactive Visualization Tool for HL7 FHIR Specification Browsing and Profiling"
            },
            "pmcid": "PMC6784845",
            "pmid": "31598581"
        }
    ],
    "toolType": [
        "Web API"
    ],
    "topic": [
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Allergy, clinical immunology and immunotherapeutics",
            "uri": "http://edamontology.org/topic_3400"
        },
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        }
    ],
    "validated": 1,
    "version": [
        "4.0.1"
    ]
}