
{
    "credit": [
        {
            "name": "Contact Form",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://www.dnastar.com/f-tech-submit.aspx?&process=submit"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://www.dnastar.com/t-support-tutorials.aspx"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Ontology comparison",
                    "uri": "http://edamontology.org/operation_3352"
                },
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "labels": {
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "Genetic variation",
                "uri": "http://edamontology.org/topic_0199"
            },
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "Data visualisation",
                "uri": "http://edamontology.org/topic_0092"
            }
        ]
    },
    "publication": [
        {
            "abstract": "We examined the profiling of gene expression of metallothioneins (MTs) in human tissues from cadaver eyes with microarray-based analysis. All MT1 isoforms, with the exception of MT1B, were abundantly expressed in lens and corneal tissue. Along with MT1B, MT4 was not detected in any tissues. Antibodies to MT1/2 labeled the corneal epithelial and endothelial cells, whereas MT3 label the retinal ganglion cells. We studied the effects of zinc and cytokines on the gene expression of MT isoforms in a corneal epithelial cell line (HCEsv). Zinc exerted an up-regulation of the expression of MT isoforms, and this effect was further potentiated in the presence of IL1α or TNFα. Zinc also elicited a strong down-regulation of the expression of inflammatory cytokines, and this effect was blocked in the presence of TNFα or IL1α. The concentration of MTs, bound zinc, and the metal stoichiometry of MTs in cultured HCEsv were determined by mass spectrometry. The total concentration of MTs was 0.24 ± 0.03 μM and, after 24 h of zinc exposure, increased to 0.96 ± 0.01 μM. The combination of zinc and IL1αfurther enhanced the level of MTs to 1.13 ± 0.03 μM. The average metal stoichiometry of MTs was Zn6Cu1-MT, and after exposure to the different treatments, it changed to Zn7-MT. ActinomycinDblocked transcription, and cycloheximide attenuated synthesis of MTs in the presence or absence of zinc, suggesting transcriptional regulation. Overall the data provide molecular and analytical evidence on the interplay between zinc, MTs, and proinflammatory cytokines in HCEsv cells, with potential implications on cell-based inflammatory eye diseases. © 2012 by The American Society for Biochemistry and Molecular Biology, Inc.",
            "authors": [
                "Alvarez L.",
                "Gonzalez-Iglesias H.",
                "Garcia M.",
                "Ghosh S.",
                "Sanz-Medel A.",
                "Coca-Prados M."
            ],
            "cit_count": 17,
            "journal": "Journal of Biological Chemistry",
            "pmid": "22722935",
            "title": "The stoichiometric transition from Zn 6Cu 1- metallothionein to Zn 7-metallothionein underlies the up-regulation of metallothionein (MT) expression: Quantitative analysis of MT-metal load in eye cells",
            "year": "2012-08-17"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:arraystar",
        "biotoolsID": "arraystar",
        "description": "An application for gene expression and variant analysis. It enables analyzing a variety of experimental data.",
        "homepage": "http://www.dnastar.com/t-sub-products-genomics-arraystar.aspx",
        "name": "ArrayStar"
    }
}