{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.ebi.ac.uk/compneur-srv/"}],"documentation":[{"type":"GENERAL","url":"https://www.ebi.ac.uk/compneur-srv/SBMLeditor.html"}],"function":[{"operation":[{"term":"Validation","uri":"http://edamontology.org/operation_2428"}]}],"labels":{"language":["Java"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Desktop application"],"topic":[{"term":"Systems biology","uri":"http://edamontology.org/topic_2259"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/sbmleditor-1-3-4-sbml-file-editor.html"}],"publication":[{"abstract":"Background: The need to build a tool to facilitate the quick creation and editing of models encoded in the Systems Biology Markup language (SBML) has been growing with the number of users and the increased complexity of the language. SBMLeditor tries to answer this need by providing a very simple, low level editor of SBML files. Users can create and remove all the necessary bits and pieces of SBML in a controlled way, that maintains the validity of the final SBML file. Results: SBMLeditor is written in JAVA using JCompneur, a library providing interfaces to easily display an XML document as a tree. This decreases dramatically the development time for a new XML editor. The possibility to include custom dialogs for different tags allows a lot of freedom for the editing and validation of the document. In addition to Xerces, SBMLeditor uses libSBML to check the validity and consistency of SBML files. A graphical equation editor allows an easy manipulation of MathML. SBMLeditor can be used as a module of the Systems Biology Workbench. Conclusion: SBMLeditor contains many improvements compared to a generic XML editor, and allow users to create an SBML model quickly and without syntactic errors. © 2007 Rodriguez et al; licensee BioMed Central Ltd.","authors":["Rodriguez N.","Donizelli M.","Le Novere N."],"cit_count":25,"doi":"10.1186/1471-2105-8-79","journal":"BMC Bioinformatics","title":"SBMLeditor: Effective creation of models in the Systems Biology Markup Language (SBML)","type":"Primary","year":"2007-03-06"}],"summary":{"biotoolsCURIE":"biotools:sbmleditor","biotoolsID":"sbmleditor","description":"SBMLeditor is a portable (written in Java), low-level, tree-structured editor for SBML. It supports annotations and validation.","homepage":"http://www.ebi.ac.uk/compneur-srv/SBMLeditor.html","name":"SBMLeditor","version":["2.0-b1"]}}