{
    "accessibility": "Open access",
    "additionDate": "2023-02-08T09:48:16.395663Z",
    "biotoolsCURIE": "biotools:hi-c_aggregate",
    "biotoolsID": "hi-c_aggregate",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jesse.gillis@utoronto.ca",
            "name": "Jesse Gillis",
            "orcidid": "https://orcid.org/0000-0002-0936-9774",
            "typeEntity": "Person"
        },
        {
            "name": "Nathan Fox"
        },
        {
            "name": "Ruchi Lohia",
            "orcidid": "http://orcid.org/0000-0002-3496-8197"
        }
    ],
    "description": "A global high-density chromatin interaction network reveals functional long-range and trans-chromosomal relationships.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Gene expression QTL analysis",
                    "uri": "http://edamontology.org/operation_3232"
                }
            ]
        }
    ],
    "homepage": "https://gillisweb.cshl.edu/HiC/",
    "language": [
        "R"
    ],
    "lastUpdate": "2023-02-08T09:48:16.398212Z",
    "name": "Hi-C Aggregate",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S13059-022-02790-Z",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: Chromatin contacts are essential for gene-expression regulation; however, obtaining a high-resolution genome-wide chromatin contact map is still prohibitively expensive owing to large genome sizes and the quadratic scale of pairwise data. Chromosome conformation capture (3C)-based methods such as Hi-C have been extensively used to obtain chromatin contacts. However, since the sparsity of these maps increases with an increase in genomic distance between contacts, long-range or trans-chromatin contacts are especially challenging to sample. Results: Here, we create a high-density reference genome-wide chromatin contact map using a meta-analytic approach. We integrate 3600 human, 6700 mouse, and 500 fly Hi-C experiments to create species-specific meta-Hi-C chromatin contact maps with 304 billion, 193 billion, and 19 billion contacts in respective species. We validate that meta-Hi-C contact maps are uniquely powered to capture functional chromatin contacts in both cis and trans. We find that while individual dataset Hi-C networks are largely unable to predict any long-range coexpression (median 0.54 AUC), meta-Hi-C networks perform comparably in both cis and trans (0.65 AUC vs 0.64 AUC). Similarly, for long-range expression quantitative trait loci (eQTL), meta-Hi-C contacts outperform all individual Hi-C experiments, providing an improvement over the conventionally used linear genomic distance-based association. Assessing between species, we find patterns of chromatin contact conservation in both cis and trans and strong associations with coexpression even in species for which Hi-C data is lacking. Conclusions: We have generated an integrated chromatin interaction network which complements a large number of methodological and analytic approaches focused on improved specificity or interpretation. This high-depth “super-experiment” is surprisingly powerful in capturing long-range functional relationships of chromatin interactions, which are now able to predict coexpression, eQTLs, and cross-species relationships. The meta-Hi-C networks are available at https://labshare.cshl.edu/shares/gillislab/resource/HiC/.",
                "authors": [
                    {
                        "name": "Fox N."
                    },
                    {
                        "name": "Gillis J."
                    },
                    {
                        "name": "Lohia R."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "Genome Biology",
                "title": "A global high-density chromatin interaction network reveals functional long-range and trans-chromosomal relationships"
            },
            "pmcid": "PMC9647974",
            "pmid": "36352464"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Chromosome conformation capture",
            "uri": "http://edamontology.org/topic_3940"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
