{
    "additionDate": "2020-01-09T18:28:16Z",
    "biotoolsCURIE": "biotools:TILLinG",
    "biotoolsID": "TILLinG",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ute.baumann@adelaide.edu.au",
            "name": "Ute Baumann",
            "typeEntity": "Person"
        }
    ],
    "description": "Bioinformatics pipeline for the analysis of TILLinG mutants in conjunction with the new optimised reference sequence for tetraploid wheat.\n\nThis tool consists of TILLING populations developed in tetraploid durum wheat cv 'Kronos' and hexaploid bread wheat cv 'Cadenza' as part of a joint project between the University of California Davis, Rothamsted Research, The Earlham Institute, and John Innes Centre.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Exome assembly",
                    "uri": "http://edamontology.org/operation_3229"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "http://wheat-tilling.com",
    "language": [
        "Java"
    ],
    "lastUpdate": "2021-01-16T16:36:54Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/CroBiAd/TILLinG-mutants"
        }
    ],
    "name": "TILLinG",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FPLS.2019.01244",
            "metadata": {
                "abstract": "© Copyright © 2019 Fruzangohar, Kalashyan, Kalambettu, Ens, Wiebe, Pozniak, Tricker and Baumann.Seed mutagenesis is one strategy to create a population with thousands of useful mutations for the direct selection of desirable traits, to introduce diversity into varietal improvement programs, or to generate a mutant collection to support gene functional analysis. However, phenotyping such large collections, where each individual may carry many mutations, is a bottleneck for downstream analysis. Targeting Induced Local Lesions in Genomes (TILLinG), when coupled with next-generation sequencing allows high-throughput mutation discovery and selection by genotyping. We mutagenized an advanced durum breeding line, UAD0951096_F2:5 and performed short-read (2x125 bp) Illumina sequencing of the exome of 100 lines using an available exome capture platform. To improve variant calling, we generated a consolidated exome reference using the recently available genome sequences of the cultivars Svevo and Kronos to facilitate the alignment of reads from the UAD0951096_F2:5 derived mutants. The resulting exome reference was 484.4 Mbp. We also developed a user-friendly, searchable database and bioinformatic analysis pipeline that allowed us to predict zygosity of the mutations discovered and extracts flanking sequences for rapid marker development. Here, we present these tools with the aim of allowing researchers fast and accurate downstream selection of mutations discovered by TILLinG by sequencing to support functional annotation of the durum wheat genome.",
                "authors": [
                    {
                        "name": "Baumann U."
                    },
                    {
                        "name": "Ens J."
                    },
                    {
                        "name": "Fruzangohar M."
                    },
                    {
                        "name": "Kalambettu P."
                    },
                    {
                        "name": "Kalashyan E."
                    },
                    {
                        "name": "Pozniak C.J."
                    },
                    {
                        "name": "Tricker P.J."
                    },
                    {
                        "name": "Wiebe K."
                    }
                ],
                "citationCount": 1,
                "date": "2019-10-10T00:00:00Z",
                "journal": "Frontiers in Plant Science",
                "title": "Novel Informatic Tools to Support Functional Annotation of the Durum Wheat Genome"
            },
            "pmcid": "PMC6795695",
            "pmid": "31649706"
        }
    ],
    "topic": [
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}
