
{
    "credit": [
        {
            "email": "raghava@imtech.ernet.in",
            "name": "Dr. G.P.S. Raghava",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://crdd.osdd.net/raghava/gpcrpred/help.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Transmembrane protein analysis",
                    "uri": "http://edamontology.org/operation_0270"
                },
                {
                    "term": "Transmembrane protein prediction",
                    "uri": "http://edamontology.org/operation_0269"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Machine learning",
                "uri": "http://edamontology.org/topic_3474"
            }
        ]
    },
    "publication": [
        {
            "abstract": "G-protein coupled receptors (GPCRs) belong to one of the largest superfamilies of membrane proteins and are important targets for drug design. In this study, a support vector machine (SVM)-based method, GPCRpred, has been developed for predicting families and subfamilies of GPCRs from the dipeptide composition of proteins. The dataset used in this study for training and testing was obtained from http://www.soe.ucsc.edu/research/compbio/gpcr/. The method classified GPCRs and non-GPCRs with an accuracy of 99.5% when evaluated using 5-fold cross-validation. The method is further able to predict five major classes or families of GPCRs with an overall Matthew's correlation coefficient (MCC) and accuracy of 0.81 and 97.5% respectively. In recognizing the subfamilies of the rhodopsin-like family, the method achieved an average MCC and accuracy of 0.97 and 97.3% respectively. The method achieved overall accuracy of 91.3% and 96.4% at family and subfamily level respectively when evaluated on an independent/blind dataset of 650 GPCRs. A server for recognition and classification of GPCRs based on multiclass SVMs has been set up at http://www.imtech.res.in/raghava/gpcrpred/. We have also suggested subfamilies for 42 sequences which were previously identified as unclassified ClassA GPCRs. The supplementary information is available at http://www.imtech.res.in/raghava/gpcrpred/info.html. © Oxford University Press 2004; all rights reserved.",
            "authors": [
                "Bhasin M.",
                "Raghava G.P.S."
            ],
            "cit_count": 142,
            "journal": "Nucleic Acids Research",
            "pmid": "15215416",
            "title": "GPCRpred: An SVM-based method for prediction of families and subfamilies of G-protein coupled receptors",
            "year": "2004-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:gpcrpred",
        "biotoolsID": "gpcrpred",
        "description": "Tool that uses a support vector machine based method to make GPCR family and subfamily predictions for a user-supplied query sequence.",
        "homepage": "http://www.imtech.res.in/raghava/gpcrpred/",
        "name": "GPCRpred"
    }
}