{
    "accessibility": "Open access",
    "additionDate": "2024-01-10T13:33:59.137221Z",
    "biotoolsCURIE": "biotools:freq-seq2",
    "biotoolsID": "freq-seq2",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jje@uci.edu",
            "name": "J J Emerson",
            "orcidid": "https://orcid.org/0000-0001-9474-0891",
            "typeEntity": "Person"
        },
        {
            "email": "roy.zhao@uci.edu",
            "name": "Roy Zhao",
            "typeEntity": "Person"
        }
    ],
    "description": "Method for precise high-throughput combinatorial quantification of allele frequencies.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA barcoding",
                    "uri": "http://edamontology.org/operation_3200"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/rnzhao/fsdm",
    "language": [
        "C"
    ],
    "lastUpdate": "2024-01-10T13:33:59.139904Z",
    "license": "CC-BY-4.0",
    "name": "FREQ-Seq2",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/G3JOURNAL/JKAD162",
            "metadata": {
                "abstract": "The accurate determination of allele frequencies is crucially important across a wide range of problems in genetics, such as developing population genetic models, making inferences from genome-wide association studies, determining genetic risk for diseases, as well as other scientific and medical applications. Furthermore, understanding how allele frequencies change over time in populations is central to ascertaining their evolutionary dynamics. We present a precise, efficient, and economical method (FREQ-Seq2) for quantifying the relative frequencies of different alleles at loci of interest in mixed population samples. Through the creative use of paired barcode sequences, we exponentially increased the throughput of the original FREQ-Seq method from 48 to 2,304 samples. FREQ-Seq2 can be targeted to specific genomic regions of interest, which are amplified using universal barcoded adapters to generate Illumina sequencing libraries. Our enhanced method, available as a kit along with open-source software for analyzing sequenced libraries, enables the detection and removal of errors that are undetectable in the original FREQ-Seq method as well as other conventional methods for allele frequency quantification. Finally, we validated the performance of our sequencing-based approach with a highly multiplexed set of control samples as well as a competitive evolution experiment in Escherichia coli and compare the latter to estimates derived from manual colony counting. Our analyses demonstrate that FREQ-Seq2 is flexible, inexpensive, and produces large amounts of data with low error, low noise, and desirable statistical properties. In summary, FREQ-Seq2 is a powerful method for quantifying allele frequency that provides a versatile approach for profiling mixed populations.",
                "authors": [
                    {
                        "name": "Emerson J.J."
                    },
                    {
                        "name": "Gaut R."
                    },
                    {
                        "name": "Lukacsovich T."
                    },
                    {
                        "name": "Zhao R."
                    }
                ],
                "date": "2023-10-01T00:00:00Z",
                "journal": "G3: Genes, Genomes, Genetics",
                "title": "FREQ-Seq2: a method for precise high-throughput combinatorial quantification of allele frequencies"
            },
            "pmcid": "PMC10542570",
            "pmid": "37494033"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
