{
    "additionDate": "2016-05-11T10:00:46Z",
    "biotoolsCURIE": "biotools:prolic",
    "biotoolsID": "prolic",
    "collectionID": [
        "de.NBI",
        "Proteomics",
        "BioInfra.Prot"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "name": "PD Dr. Martin Eisenacher"
        },
        {
            "name": "Dr. Michael Kohl",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "email": "michael.kohl@rub.de",
            "name": "Michael Kohl",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "It includes adresses the problem of protein list comparison, which can be challenging due to different or changing database accession numbers.\nIn addition to a simple accession based comparison, ProLiC permits a more reliable comparison of an arbitrary number of protein lists by considering measured sequence and/or peptide information.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.ruhr-uni-bochum.de/mpc/software/ProLiC/index.html.en"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein sequence",
                        "uri": "http://edamontology.org/data_2976"
                    },
                    "format": [
                        {
                            "term": "TSV",
                            "uri": "http://edamontology.org/format_3475"
                        }
                    ]
                }
            ],
            "note": "ProLiC includes different possibilities to solve the problem of protein list comparison. \nProLiC uses its own data format (tsv or csv files) containing protein accessions as well as protein and peptide sequences. However in the medium run support of standard format is intended. The result of a ProLiC protein list comparison is a single text file, which gives the calculated overlaps and set differences in a very simple way.",
            "operation": [
                {
                    "term": "Protein comparison",
                    "uri": "http://edamontology.org/operation_2997"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Sequence set",
                        "uri": "http://edamontology.org/data_0850"
                    },
                    "format": [
                        {
                            "term": "TSV",
                            "uri": "http://edamontology.org/format_3475"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://www.ruhr-uni-bochum.de/mpc/software/ProLiC/index.html.en",
    "lastUpdate": "2020-06-04T12:00:11.440244Z",
    "maturity": "Legacy",
    "name": "ProLiC (Protein List Comparator)",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "BioInfra.Prot",
    "publication": [
        {
            "doi": "10.1016/j.bbapap.2013.02.029",
            "metadata": {
                "abstract": "Multi-OMICS approaches aim on the integration of quantitative data obtained for different biological molecules in order to understand their interrelation and the functioning of larger systems. This paper deals with several data integration and data processing issues that frequently occur within this context. To this end, the data processing workflow within the PROFILE project is presented, a multi-OMICS project that aims on identification of novel biomarkers and the development of new therapeutic targets for seven important liver diseases. Furthermore, a software called CrossPlatformCommander is sketched, which facilitates several steps of the proposed workflow in a semi-automatic manner. Application of the software is presented for the detection of novel biomarkers, their ranking and annotation with existing knowledge using the example of corresponding Transcriptomics and Proteomics data sets obtained from patients suffering from hepatocellular carcinoma. Additionally, a linear regression analysis of Transcriptomics vs. Proteomics data is presented and its performance assessed. It was shown, that for capturing profound relations between Transcriptomics and Proteomics data, a simple linear regression analysis is not sufficient and implementation and evaluation of alternative statistical approaches are needed. Additionally, the integration of multivariate variable selection and classification approaches is intended for further development of the software. Although this paper focuses only on the combination of data obtained from quantitative Proteomics and Transcriptomics experiments, several approaches and data integration steps are also applicable for other OMICS technologies. Keeping specific restrictions in mind the suggested workflow (or at least parts of it) may be used as a template for similar projects that make use of different high throughput techniques. This article is part of a Special Issue entitled: Computational Proteomics in the Post-Identification Era. Guest Editors: Martin Eisenacher and Christian Stephan. © 2013 Elsevier B.V. All rights reserved.",
                "authors": [
                    {
                        "name": "Kohl M."
                    },
                    {
                        "name": "Megger D.A."
                    },
                    {
                        "name": "Trippler M."
                    },
                    {
                        "name": "Meckel H."
                    },
                    {
                        "name": "Ahrens M."
                    },
                    {
                        "name": "Bracht T."
                    },
                    {
                        "name": "Weber F."
                    },
                    {
                        "name": "Hoffmann A.-C."
                    },
                    {
                        "name": "Baba H.A."
                    },
                    {
                        "name": "Sitek B."
                    },
                    {
                        "name": "Schlaak J.F."
                    },
                    {
                        "name": "Meyer H.E."
                    },
                    {
                        "name": "Stephan C."
                    },
                    {
                        "name": "Eisenacher M."
                    }
                ],
                "citationCount": 32,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Biochimica et Biophysica Acta - Proteins and Proteomics",
                "title": "A practical data processing workflow for multi-OMICS projects"
            },
            "type": [
                "Review"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ],
    "version": [
        "1"
    ]
}