{
    "accessibility": "Open access",
    "additionDate": "2022-03-21T12:02:06.880272Z",
    "biotoolsCURIE": "biotools:itsx",
    "biotoolsID": "itsx",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "johan@microbiology.se",
            "name": "Johan Bengtsson-Palme",
            "typeEntity": "Person",
            "typeRole": [
                "Developer",
                "Primary contact"
            ]
        }
    ],
    "description": "TSx is an open source software utility to extract the highly variable ITS1 and ITS2 subregions from ITS sequences, which is commonly used as a molecular barcode for e.g. fungi. As the inclusion of parts of the neighbouring, very conserved, ribosomal genes (SSU, 5S and LSU rRNA sequences) in the sequence identification process can lead to severely misleading results, ITSx identifies and extracts only the ITS regions themselves.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://microbiology.se/publ/itsx_users_guide.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence feature detection",
                    "uri": "http://edamontology.org/operation_0253"
                }
            ]
        }
    ],
    "homepage": "https://microbiology.se/software/itsx/",
    "lastUpdate": "2022-03-21T12:07:10.895781Z",
    "license": "GPL-3.0",
    "name": "ITSx",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1111/2041-210X.12073",
            "metadata": {
                "abstract": "Summary: The nuclear ribosomal internal transcribed spacer (ITS) region is the primary choice for molecular identification of fungi. Its two highly variable spacers (ITS1 and ITS2) are usually species specific, whereas the intercalary 5.8S gene is highly conserved. For sequence clustering and blast searches, it is often advantageous to rely on either one of the variable spacers but not the conserved 5.8S gene. To identify and extract ITS1 and ITS2 from large taxonomic and environmental data sets is, however, often difficult, and many ITS sequences are incorrectly delimited in the public sequence databases. We introduce ITSx, a Perl-based software tool to extract ITS1, 5.8S and ITS2 - as well as full-length ITS sequences - from both Sanger and high-throughput sequencing data sets. ITSx uses hidden Markov models computed from large alignments of a total of 20 groups of eukaryotes, including fungi, metazoans and plants, and the sequence extraction is based on the predicted positions of the ribosomal genes in the sequences. ITSx has a very high proportion of true-positive extractions and a low proportion of false-positive extractions. Additionally, process parallelization permits expedient analyses of very large data sets, such as a one million sequence amplicon pyrosequencing data set. ITSx is rich in features and written to be easily incorporated into automated sequence analysis pipelines. ITSx paves the way for more sensitive blast searches and sequence clustering operations for the ITS region in eukaryotes. The software also permits elimination of non-ITS sequences from any data set. This is particularly useful for amplicon-based next-generation sequencing data sets, where insidious non-target sequences are often found among the target sequences. Such non-target sequences are difficult to find by other means and would contribute noise to diversity estimates if left in the data set. © 2013 British Ecological Society.",
                "authors": [
                    {
                        "name": "Abarenkov K."
                    },
                    {
                        "name": "Amend A."
                    },
                    {
                        "name": "Bengtsson-Palme J."
                    },
                    {
                        "name": "Bertrand Y.J.K."
                    },
                    {
                        "name": "Branco S."
                    },
                    {
                        "name": "De Wit P."
                    },
                    {
                        "name": "Ebersberger I."
                    },
                    {
                        "name": "Eriksson K.M."
                    },
                    {
                        "name": "Godhe A."
                    },
                    {
                        "name": "Hartmann M."
                    },
                    {
                        "name": "Jumpponen A."
                    },
                    {
                        "name": "Kristiansson E."
                    },
                    {
                        "name": "Nilsson R.H."
                    },
                    {
                        "name": "Ryberg M."
                    },
                    {
                        "name": "Sanchez-Garcia M."
                    },
                    {
                        "name": "Sanli K."
                    },
                    {
                        "name": "Unterseher M."
                    },
                    {
                        "name": "Veldre V."
                    },
                    {
                        "name": "Vik U."
                    },
                    {
                        "name": "Wang Z."
                    },
                    {
                        "name": "de Sousa F."
                    }
                ],
                "citationCount": 673,
                "date": "2013-10-01T00:00:00Z",
                "journal": "Methods in Ecology and Evolution",
                "title": "Improved software detection and extraction of ITS1 and ITS2 from ribosomal ITS sequences of fungi and other eukaryotes for analysis of environmental sequencing data"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        }
    ]
}
