{
    "additionDate": "2017-02-10T11:35:49Z",
    "biotoolsCURIE": "biotools:pobo",
    "biotoolsID": "pobo",
    "credit": [
        {
            "email": "matti.kankainen@helsinki.fi",
            "name": "POBO Webmaster",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "POBO is a tool to summarize, verify and screen predetermined cis-element motifs from a set of sequences. POBO reports the results in as understandable format as possible for biologists.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://ekhidna.biocenter.helsinki.fi/poxo/pobo/download/movie.avi"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                },
                {
                    "term": "Transcriptional regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0438"
                }
            ]
        }
    ],
    "homepage": "http://ekhidna.biocenter.helsinki.fi/poxo/pobo/",
    "homepage_status": 1,
    "language": [
        "C",
        "C++",
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "POBO",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Transcription factors can either activate or repress target genes by binding onto short nucleotide sequence motifs in the promoter regions of these genes. Here, we present POBO, a promoter bootstrapping program, for gene expression data. POBO can be used to detect, compare and verify predetermined transcription factor binding site motifs in the promoters of one or two clusters of co-regulated genes. The program calculates the frequencies of the motif in the input promoter sets. A bootstrap analysis detects significantly over- or underrepresented motifs. The output of the program presents bootstrapped results in picture and text formats. The program was tested with published data from transgenic WRKY70 microarray experiments. Intriguingly, motifs recognized by the WRKY transcription factors of plant defense pathways are similarly enriched in both up- and downregulated clusters. POBO analysis suggests slightly modified hypothetical motifs that discriminate between up- and downregulated clusters. In conclusion, POBO allows easy, fast and accurate verification of putative regulatory motifs. The statistical tests implemented in POBO can be useful in eliminating false positives from the results of pattern discovery programs and increasing the reliability of true positives. POBO is freely available from http://ekhidna.biocenter.helsinki.fi:9801/pobo. © Oxford University Press 2004; all rights reserved.",
                "authors": [
                    {
                        "name": "Holm L."
                    },
                    {
                        "name": "Kankainen M."
                    }
                ],
                "citationCount": 44,
                "date": "2004-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "POBO, transcription factor binding site verification with bootstrapping"
            },
            "pmid": "15215385"
        },
        {
            "metadata": {
                "abstract": "We present POXO, a comprehensive tool series to discover transcription factor binding sites from coexpressed genes (www.bioinfo.biocenter.helsinki.fi/poxo). POXOmanagestaskssuchas functional evaluation and grouping of genes, sequence retrieval, pattern discovery and pattern verification. It also allows users to tailor analytical pipelines from these tools, with single mouse clicks. One typical pipeline of POXO begins by examining the biological functions that a set of co-expressed genes are involved in. In this examination, the functional coherence of the gene set is evaluated and representative functions are associated with the gene set. This examination can also be used to group genes into functionally similar subsets, if several biological processes are affected in the experiment. The next step in the pipeline is then to discover over-represented nucleotide patterns from the upstream sequences of the selected gene sets. This enables to investigate the possibility that the genes are co-regulated by common cis-elements. If over-represented patterns are found, similar ones can then be clustered together and be verified. The performance of POXO is demonstrated by analysing expression data from pathogen treated Arabidopsis thaliana. In this example, POXO detected activated gene sets and suggested transcription factors responsible for their regulation. © The Author 2006. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Holm L."
                    },
                    {
                        "name": "Kankainen M."
                    },
                    {
                        "name": "Pehkonen P."
                    },
                    {
                        "name": "Rosenstom P."
                    },
                    {
                        "name": "Toronen P."
                    },
                    {
                        "name": "Wong G."
                    }
                ],
                "citationCount": 9,
                "date": "2006-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "POXO: A web-enabled tool series to discover transcription factor binding sites"
            },
            "pmid": "16845065"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
