{
    "accessibility": "Open access",
    "additionDate": "2022-02-15T18:02:57.041033Z",
    "biotoolsCURIE": "biotools:ncdlres",
    "biotoolsID": "ncdlres",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "wanglyu@163.com",
            "name": "Linyu Wang",
            "typeEntity": "Person"
        },
        {
            "email": "liuyn@jlu.edu.cn",
            "name": "Yuanning Liu"
        },
        {
            "name": "Shuo Wang"
        },
        {
            "name": "Xiaodan Zhong"
        }
    ],
    "description": "A novel method for non-coding RNAs family prediction based on dynamic LSTM and ResNet.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "RNA secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0278"
                },
                {
                    "term": "Sequence feature detection",
                    "uri": "http://edamontology.org/operation_0253"
                }
            ]
        }
    ],
    "homepage": "https://github.com/linyuwangPHD/ncDLRES",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-02-15T18:02:57.043701Z",
    "license": "Not licensed",
    "name": "ncDLRES",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04365-4",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Studies have proven that the same family of non-coding RNAs (ncRNAs) have similar functions, so predicting the ncRNAs family is helpful to the research of ncRNAs functions. The existing calculation methods mainly fall into two categories: the first type is to predict ncRNAs family by learning the features of sequence or secondary structure, and the other type is to predict ncRNAs family by the alignment among homologs sequences. In the first type, some methods predict ncRNAs family by learning predicted secondary structure features. The inaccuracy of predicted secondary structure may cause the low accuracy of those methods. Different from that, ncRFP directly learning the features of ncRNA sequences to predict ncRNAs family. Although ncRFP simplifies the prediction process and improves the performance, there is room for improvement in ncRFP performance due to the incomplete features of its input data. In the secondary type, the homologous sequence alignment method can achieve the highest performance at present. However, due to the need for consensus secondary structure annotation of ncRNA sequences, and the helplessness for modeling pseudoknots, the use of the method is limited. Results: In this paper, a novel method “ncDLRES”, which according to learning the sequence features, is proposed to predict the family of ncRNAs based on Dynamic LSTM (Long Short-term Memory) and ResNet (Residual Neural Network). Conclusions: ncDLRES extracts the features of ncRNA sequences based on Dynamic LSTM and then classifies them by ResNet. Compared with the homologous sequence alignment method, ncDLRES reduces the data requirement and expands the application scope. By comparing with the first type of methods, the performance of ncDLRES is greatly improved.",
                "authors": [
                    {
                        "name": "Wang L."
                    },
                    {
                        "name": "Zhong X."
                    },
                    {
                        "name": "Wang S."
                    },
                    {
                        "name": "Liu Y."
                    }
                ],
                "citationCount": 1,
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "ncDLRES: a novel method for non-coding RNAs family prediction based on dynamic LSTM and ResNet"
            },
            "pmcid": "PMC8451086",
            "pmid": "34544356"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ]
}