{
    "additionDate": "2020-01-14T19:31:36Z",
    "biotoolsCURIE": "biotools:SpliceFinder",
    "biotoolsID": "SpliceFinder",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jianwang@cityu.edu.hk",
            "name": "Jianping Wang",
            "typeEntity": "Person"
        },
        {
            "email": "shuaicli@cityu.edu.hk",
            "name": "Shuaicheng Li",
            "typeEntity": "Person"
        }
    ],
    "description": "ab initio prediction of splice sites using convolutional neural network.\n\nThis is the source code for SpliceFinder",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Splice site prediction",
                    "uri": "http://edamontology.org/operation_0433"
                },
                {
                    "term": "Sequence merging",
                    "uri": "http://edamontology.org/operation_0232"
                },
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                }
            ]
        }
    ],
    "homepage": "https://gitlab.deepomics.org/wangruohan/SpliceFinder",
    "lastUpdate": "2020-12-24T09:13:24Z",
    "name": "SpliceFinder",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3306-3",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Identifying splice sites is a necessary step to analyze the location and structure of genes. Two dinucleotides, GT and AG, are highly frequent on splice sites, and many other patterns are also on splice sites with important biological functions. Meanwhile, the dinucleotides occur frequently at the sequences without splice sites, which makes the prediction prone to generate false positives. Most existing tools select all the sequences with the two dimers and then focus on distinguishing the true splice sites from those pseudo ones. Such an approach will lead to a decrease in false positives; however, it will result in non-canonical splice sites missing. Result: We have designed SpliceFinder based on convolutional neural network (CNN) to predict splice sites. To achieve the ab initio prediction, we used human genomic data to train our neural network. An iterative approach is adopted to reconstruct the dataset, which tackles the data unbalance problem and forces the model to learn more features of splice sites. The proposed CNN obtains the classification accuracy of 90.25%, which is 10% higher than the existing algorithms. The method outperforms other existing methods in terms of area under receiver operating characteristics (AUC), recall, precision, and F1 score. Furthermore, SpliceFinder can find the exact position of splice sites on long genomic sequences with a sliding window. Compared with other state-of-the-art splice site prediction tools, SpliceFinder generates results in about half lower false positive while keeping recall higher than 0.8. Also, SpliceFinder captures the non-canonical splice sites. In addition, SpliceFinder performs well on the genomic sequences of Drosophila melanogaster, Mus musculus, Rattus, and Danio rerio without retraining. Conclusion: Based on CNN, we have proposed a new ab initio splice site prediction tool, SpliceFinder, which generates less false positives and can detect non-canonical splice sites. Additionally, SpliceFinder is transferable to other species without retraining. The source code and additional materials are available at https://gitlab.deepomics.org/wangruohan/SpliceFinder.",
                "authors": [
                    {
                        "name": "Wang R."
                    },
                    {
                        "name": "Wang Z."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Li S."
                    }
                ],
                "citationCount": 9,
                "date": "2019-12-27T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SpliceFinder: Ab initio prediction of splice sites using convolutional neural network"
            },
            "pmcid": "PMC6933889",
            "pmid": "31881982"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        },
        {
            "term": "Gene structure",
            "uri": "http://edamontology.org/topic_0114"
        }
    ],
    "validated": 1
}