{
    "additionDate": "2017-01-17T14:59:51Z",
    "biotoolsCURIE": "biotools:stan",
    "biotoolsID": "stan",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "gagneur@in.tum.de",
            "name": "Julien Gagneur",
            "orcidid": "http://orcid.org/0000-0002-8924-8365",
            "typeEntity": "Person",
            "typeRole": [
                "Contributor"
            ]
        },
        {
            "email": "zacher@genzentrum.lmu.de",
            "name": "Benedikt Zacher",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Genome segmentation with hidden Markov models has become a useful tool to annotate genomic elements, such as promoters and enhancers. The tool implements (bidirectional) hidden Markov models (HMMs) using a variety of different probability distributions, which can model a wide range of current genomic data. It de novo learns and annotates the genome into a given number of 'genomic states'. It also allows for the integration of strand-specific and non-strand-specific data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/STAN.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/STAN_2.2.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/STAN.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-10T15:57:04Z",
    "license": "GPL-2.0",
    "name": "STAN",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.15252/msb.20145654",
            "metadata": {
                "abstract": "© 2014 The Authors. Published under the terms of the CC BY 4.0 license.DNA replication, transcription and repair involve the recruitment of protein complexes that change their composition as they progress along the genome in a directed or strand-specific manner. Chromatin immunoprecipitation in conjunction with hidden Markov models (HMMs) has been instrumental in understanding these processes, as they segment the genome into discrete states that can be related to DNA-associated protein complexes. However, current HMM-based approaches are not able to assign forward or reverse direction to states or properly integrate strand-specific (e.g., RNA expression) with non-strand-specific (e.g., ChIP) data, which is indispensable to accurately characterize directed processes. To overcome these limitations, we introduce bidirectional HMMs which infer directed genomic states from occupancy profiles de novo. Application to RNA polymerase II-associated factors in yeast and chromatin modifications in human T cells recovers the majority of transcribed loci, reveals gene-specific variations in the yeast transcription cycle and indicates the existence of directed chromatin state patterns at transcribed, but not at repressed, regions in the human genome. In yeast, we identify 32 new transcribed loci, a regulated initiation-elongation transition, the absence of elongation factors Ctk1 and Paf1 from a class of genes, a distinct transcription mechanism for highly expressed genes and novel DNA sequence motifs associated with transcription termination. We anticipate bidirectional HMMs to significantly improve the analyses of genome-associated directed processes. Synopsis Bidirectional hidden Markov models improve the annotation of DNA-associated processes from genomics data, reveal variations in the yeast Pol II transcription cycle and identify directed chromatin state patterns at transcribed regions in the human genome. Genomic feature annotations derived from bidirectional hidden Markov models are up to twice as accurate compared to those from standard hidden Markov models. Variations in the yeast Pol II transcription cycle fall into clusters of co-regulated genes, whose functional categories range from housekeeping and cell cycle to stress response. New insights into transcriptional regulation are obtained, indicating a regulated initiation-elongation transition and a distinct transcription mechanism for highly expressed genes. An implementation of bidirectional hidden Markov models is freely available at the Bioconductor website: http://www.bioconductor.org/packages/devel/bioc/html/STAN.html. Bidirectional hidden Markov models improve the annotation of DNA-associated processes from genomics data, reveal variations in the yeast Pol II transcription cycle and identify directed chromatin state patterns at transcribed regions in the human genome.",
                "authors": [
                    {
                        "name": "Cramer P."
                    },
                    {
                        "name": "Gagneur J."
                    },
                    {
                        "name": "Lidschreiber M."
                    },
                    {
                        "name": "Tresch A."
                    },
                    {
                        "name": "Zacher B."
                    }
                ],
                "citationCount": 13,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Molecular Systems Biology",
                "title": "Annotation of genomics data using bidirectional hidden Markov models unveils variations in Pol II transcription cycle"
            },
            "pmcid": "PMC4300491",
            "pmid": "25527639",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1,
    "version": [
        "2.2.0"
    ]
}
