{
    "accessibility": "Open access",
    "additionDate": "2024-06-19T07:44:12.362456Z",
    "biotoolsCURIE": "biotools:scannox",
    "biotoolsID": "scannox",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ch_xiaozhou@163.com",
            "name": "Xiaozhou Chen",
            "typeEntity": "Person"
        },
        {
            "email": "li_hua_mei@163.com",
            "name": "Huamei Li",
            "typeEntity": "Person"
        }
    ],
    "description": "R package integrating multiple public tools for single-cell annotation.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "https://github.com/XQ-hub/scAnnoX",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-06-19T07:44:12.364764Z",
    "name": "scAnnoX",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.7717/peerj.17184",
            "metadata": {
                "abstract": "Background: Single-cell annotation plays a crucial role in the analysis of single-cell genomics data. Despite the existence of numerous single-cell annotation algorithms, a comprehensive tool for integrating and comparing these algorithms is also lacking. Methods: This study meticulously investigated a plethora of widely adopted single-cell annotation algorithms. Ten single-cell annotation algorithms were selected based on the classification of either reference dataset-dependent or marker gene-dependent approaches. These algorithms included SingleR, Seurat, sciBet, scmap, CHETAH, scSorter, sc.type, cellID, scCATCH, and SCINA. Building upon these algorithms, we developed an R package named scAnnoX for the integration and comparative analysis of single-cell annotation algorithms. Results: The development of the scAnnoX software package provides a cohesive framework for annotating cells in scRNA-seq data, enabling researchers to more efficiently perform comparative analyses among the cell type annotations contained in scRNA-seq datasets. The integrated environment of scAnnoX streamlines the testing, evaluation, and comparison processes among various algorithms. Among the ten annotation tools evaluated, SingleR, Seurat, sciBet, and scSorter emerged as top-performing algorithms in terms of prediction accuracy, with SingleR and sciBet demonstrating particularly superior performance, offering guidance for users. Interested parties can access the scAnnoX package at https://github.com/XQ-hub/ scAnnoX.",
                "authors": [
                    {
                        "name": "Chen X."
                    },
                    {
                        "name": "Huang X."
                    },
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "Liu R."
                    },
                    {
                        "name": "Yang S."
                    }
                ],
                "date": "2024-01-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "scAnnoX: an R package integrating multiple public tools for single-cell annotation"
            },
            "pmcid": "PMC10981883",
            "pmid": "38560451"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
