{
    "additionDate": "2021-12-13T13:06:54.161635Z",
    "biotoolsCURIE": "biotools:vcf2fhir",
    "biotoolsID": "vcf2fhir",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "bdolin@elimu.io",
            "name": "Robert H. Dolin",
            "orcidid": "https://orcid.org/0000-0002-6235-6964",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "vcf2fhir is a utility to convert VCF files into HL7 FHIR format for genomics-EHR integration. VCF-formatted files are the lingua franca of next-generation sequencing, whereas HL7 FHIR is emerging as a standard language for electronic health record interoperability. A growing number of clinical genomics applications are emerging, based on the HL7 FHIR Genomics standard. Here, we provide an open source utility for converting variants from VCF format into HL7 FHIR Genomics format. Details of the translation logic are on the manual page.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                }
            ]
        }
    ],
    "homepage": "https://github.com/elimuinformatics/vcf2fhir",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-12-13T13:06:54.164372Z",
    "license": "Apache-2.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/elimuinformatics/vcf2fhir/issues"
        }
    ],
    "name": "vcf2fhir",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04039-1",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: VCF formatted files are the lingua franca of next-generation sequencing, whereas HL7 FHIR is emerging as a standard language for electronic health record interoperability. A growing number of FHIR-based clinical genomics applications are emerging. Here, we describe an open source utility for converting variants from VCF format into HL7 FHIR format. Results: vcf2fhir converts VCF variants into a FHIR Genomics Diagnostic Report. Conversion translates each VCF row into a corresponding FHIR-formatted variant in the generated report. In scope are simple variants (SNVs, MNVs, Indels), along with zygosity and phase relationships, for autosomes, sex chromosomes, and mitochondrial DNA. Input parameters include VCF file and genome build (‘GRCh37’ or ‘GRCh38’); and optionally a conversion region that indicates the region(s) to convert, a studied region that lists genomic regions studied by the lab, and a non-callable region that lists studied regions deemed uncallable by the lab. Conversion can be limited to a subset of VCF by supplying genomic coordinates of the conversion region(s). If studied and non-callable regions are also supplied, the output FHIR report will include ‘region-studied’ observations that detail which portions of the conversion region were studied, and of those studied regions, which portions were deemed uncallable. We illustrate the vcf2fhir utility via two case studies. The first, 'SMART Cancer Navigator', is a web application that offers clinical decision support by linking patient EHR information to cancerous gene variants. The second, 'Precision Genomics Integration Platform', intersects a patient's FHIR-formatted clinical and genomic data with knowledge bases in order to provide on-demand delivery of contextually relevant genomic findings and recommendations to the EHR. Conclusions: Experience to date shows that the vcf2fhir utility can be effectively woven into clinically useful genomic-EHR integration pipelines. Additional testing will be a critical step towards the clinical validation of this utility, enabling it to be integrated in a variety of real world data flow scenarios. For now, we propose the use of this utility primarily to accelerate FHIR Genomics understanding and to facilitate experimentation with further integration of genomics data into the EHR.",
                "authors": [
                    {
                        "name": "Dolin R.H."
                    },
                    {
                        "name": "Gothi S.R."
                    },
                    {
                        "name": "Boxwala A."
                    },
                    {
                        "name": "Heale B.S.E."
                    },
                    {
                        "name": "Husami A."
                    },
                    {
                        "name": "Jones J."
                    },
                    {
                        "name": "Khangar H."
                    },
                    {
                        "name": "Londhe S."
                    },
                    {
                        "name": "Naeymi-Rad F."
                    },
                    {
                        "name": "Rao S."
                    },
                    {
                        "name": "Rapchak B."
                    },
                    {
                        "name": "Shalaby J."
                    },
                    {
                        "name": "Suraj V."
                    },
                    {
                        "name": "Xie N."
                    },
                    {
                        "name": "Chamala S."
                    },
                    {
                        "name": "Alterovitz G."
                    }
                ],
                "citationCount": 1,
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "vcf2fhir: a utility to convert VCF files into HL7 FHIR format for genomics-EHR integration"
            },
            "pmcid": "PMC7923512",
            "pmid": "33653260",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Allergy, clinical immunology and immunotherapeutics",
            "uri": "http://edamontology.org/topic_3400"
        }
    ]
}