{
    "additionDate": "2020-01-14T09:38:07Z",
    "biotoolsCURIE": "biotools:ECOTOOL",
    "biotoolsID": "ECOTOOL",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Diego.Pedregal@uclm.es",
            "name": "Diego J. Pedregal",
            "orcidid": "https://orcid.org/0000-0003-4958-0969",
            "typeEntity": "Person"
        }
    ],
    "description": "A new toolbox for time series analysis and forecasting. Some Features found in a few packages or none at all.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA-seq time series data analysis",
                    "uri": "http://edamontology.org/operation_3565"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/djpt999/ECOTOOL",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2020-12-25T11:55:31Z",
    "license": "GPL-3.0",
    "name": "ECOTOOL",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0221238",
            "metadata": {
                "abstract": "© 2019 Diego J. Pedregal. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.This paper presents ECOTOOL, a new free MATLAB toolbox that embodies several routines for identification, validation and forecasting of dynamic models. The toolbox includes a wide range of exploratory, descriptive and diagnostic statistical tools with visual support, designed in easy-to-use Graphical User Interfaces. It also incorporates complex automatic procedures for identification, exact maximum likelihood estimation and outlier detection for many types of models available in the literature (like multi-seasonal ARIMA models, transfer functions, Exponential Smoothing, Unobserved Components, VARX). ECOTOOL is the outcome of a long period of programming effort with the aim of producing a user friendly toolkit such that, just a few lines of code written in MATLAB are able to perform a comprehensive analysis of time series. The toolbox is supplied with an in-depth documentation system and online help and is available on the internet. The paper describes the main functionalities of the toolbox, and its power is shown working on several real examples.",
                "authors": [
                    {
                        "name": "Pedregal D.J."
                    }
                ],
                "citationCount": 4,
                "date": "2019-10-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Time series analysis and forecasting with ECOTOOL"
            },
            "pmcid": "PMC6822939",
            "pmid": "31671102"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
