
{
    "credit": [
        {
            "email": "hlin@uestc.edu.cn",
            "name": "Hao Lin",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://lin-group.cn/server/iTerm-PseKNC/help.php"
        }
    ],
    "download": [
        {
            "type": "Biological data",
            "url": "http://lin-group.cn/server/iTerm-PseKNC/download.php"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                }
            ]
        }
    ],
    "labels": {
        "accessibility": [
            "Open access"
        ],
        "cost": "Free of charge",
        "license": "Unlicense",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application",
            "Web service"
        ],
        "topic": [
            {
                "term": "Transcription factors and regulatory sites",
                "uri": "http://edamontology.org/topic_0749"
            },
            {
                "term": "Biochemistry",
                "uri": "http://edamontology.org/topic_3292"
            },
            {
                "term": "Sequence composition, complexity and repeats",
                "uri": "http://edamontology.org/topic_0157"
            }
        ]
    },
    "link": [
        {
            "note": "Web server of iTerm-PseKNC",
            "type": "Other",
            "url": "http://lin-group.cn/server/iTerm-PseKNC/predictor.php"
        }
    ],
    "publication": [
        {
            "abstract": "© The Author(s) 2018. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com. MOTIVATION: Transcription termination is an important regulatory step of gene expression. If there is no terminator in gene, transcription could not stop, which will result in abnormal gene expression. Detecting such terminators can determine the operon structure in bacterial organisms and improve genome annotation. Thus, accurate identification of transcriptional terminators is essential and extremely important in the research of transcription regulations. RESULTS: In this study, we developed a new predictor called 'iTerm-PseKNC' based on support vector machine to identify transcription terminators. The binomial distribution approach was used to pick out the optimal feature subset derived from pseudo k-tuple nucleotide composition (PseKNC). The 5-fold cross-validation test results showed that our proposed method achieved an accuracy of 95%. To further evaluate the generalization ability of 'iTerm-PseKNC', the model was examined on independent datasets which are experimentally confirmed Rho-independent terminators in Escherichia coli and Bacillus subtilis genomes. As a result, all the terminators in E. coli and 87.5% of the terminators in B. subtilis were correctly identified, suggesting that the proposed model could become a powerful tool for bacterial terminator recognition. AVAILABILITY AND IMPLEMENTATION: For the convenience of most of wet-experimental researchers, the web-server for 'iTerm-PseKNC' was established at http://lin-group.cn/server/iTerm-PseKNC/, by which users can easily obtain their desired result without the need to go through the detailed mathematical equations involved.",
            "authors": [
                "Feng C.-Q.",
                "Zhang Z.-Y.",
                "Zhu X.-J.",
                "Lin Y.",
                "Chen W.",
                "Tang H.",
                "Lin H."
            ],
            "cit_count": 11,
            "doi": "10.1093/bioinformatics/bty827",
            "journal": "Bioinformatics (Oxford, England)",
            "title": "iTerm-PseKNC: a sequence-based tool for predicting bacterial transcriptional terminators",
            "type": "Primary",
            "year": "2019-05-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:iTerm-PseKNC",
        "biotoolsID": "iTerm-PseKNC",
        "description": "Sequence-based tool for predicting bacterial transcriptional terminators.",
        "homepage": "http://lin-group.cn/server/iTerm-PseKNC/",
        "name": "iTerm-PseKNC"
    }
}