{
    "additionDate": "2017-02-10T14:14:42Z",
    "biotoolsCURIE": "biotools:fold-rate",
    "biotoolsID": "fold-rate",
    "credit": [
        {
            "email": "gromiha@rtc.riken.go.jp",
            "name": "MM Gromiha",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Predict the folding rates of proteins from their amino acid sequences.",
    "documentation": [
        {
            "type": "General",
            "url": "http://www.iitm.ac.in/bioinfo/fold-rate/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein folding analysis",
                    "uri": "http://edamontology.org/operation_2415"
                },
                {
                    "term": "Protein fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Nucleic acid folding analysis",
                    "uri": "http://edamontology.org/operation_0279"
                },
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ]
        }
    ],
    "homepage": "http://www.iitm.ac.in/bioinfo/fold-rate/",
    "lastUpdate": "2018-12-10T12:58:55Z",
    "name": "FOLD-RATE",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Prediction of protein folding rates from amino acid sequences is one of the most important challenges in molecular biology. In this work, I have related the protein folding rates with physical-chemical, energetic and conformational properties of amino acid residues. I found that the classification of proteins into different structural classes shows an excellent correlation between amino acid properties and folding rates of two-and three-state proteins, indicating the importance of native state topology in determining the protein folding rates. I have formulated a simple linear regression model for predicting the protein folding rates from amino acid sequences along with structural class information and obtained an excellent agreement between predicted and experimentally observed folding rates of proteins; the correlation coefficients are 0.99, 0.96 and 0.95, respectively, for all-α, all-β and mixed class proteins. This is the first available method, which is capable of predicting the protein folding rates just from the amino acid sequence with the aid of generic amino acid properties and structural class information. © 2005 American Chemical Society.",
                "authors": [
                    {
                        "name": "Gromiha M.M."
                    }
                ],
                "citationCount": 88,
                "date": "2005-03-01T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "A statistical model for predicting protein folding rates from amino acid sequence with structural class information"
            },
            "pmid": "15807515"
        },
        {
            "metadata": {
                "abstract": "The contact order is believed to be an important factor for understanding protein folding mechanisms. In our earlier work, we have shown that the long-range interactions play a vital role in protein folding. In this work, we analyzed the contribution of long-range contacts to determine the folding rate of two-state proteins. We found that the residues that are close in space and are separated by at least ten to 15 residues in sequence are important determinants of folding rates, suggesting the presence of a folding nucleus at an interval of approximately 25 residues. A novel parameter \"long-range order\" has been proposed to predict protein folding rates. This parameter shows as good a relationship with the folding rate of two-state proteins as contact order. Further, we examined the minimum limit of residue separation to determine the long-range contacts for different structural classes. We observed an excellent correlation between long-range order and folding rate for all classes of globular proteins. We suggest that in mixed-class proteins, a larger number of residues can serve as folding nuclei compared to all-α and all-β proteins. A simple statistical method has been developed to predict the folding rates of two-state proteins using the long-range order that produces an agreement with experimental results that is better or comparable to other methods in the literature. © 2001 Academic Press.",
                "authors": [
                    {
                        "name": "Gromiha M.M."
                    },
                    {
                        "name": "Selvaraj S."
                    }
                ],
                "citationCount": 247,
                "date": "2001-06-29T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "Comparison between long-range interactions and contact order in determining the folding rate of two-state proteins: Application of long-range order to folding rate prediction"
            },
            "pmid": "11419934"
        },
        {
            "metadata": {
                "abstract": "We have developed a web server, FOLD-RATE, for predicting the folding rates of proteins from their amino acid sequences. The relationship between amino acid properties and protein folding rates has been systematically analyzed and a statistical method based on linear regression technique has been proposed for predicting the folding rate of proteins. We found that the classification of proteins into different structural classes shows an excellent correlation between amino acid properties and folding rates of two and three-state proteins. Consequently, different regression equations have been developed for proteins belonging to all-α, all-β and mixed class. We observed an excellent agreement between predicted and experimentally observed folding rates of proteins; the correlation coefficients are, 0.99, 0.97 and 0.90, respectively, for all-α, all-β and mixed class proteins. © The Author 2006. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Gromiha M.M."
                    },
                    {
                        "name": "Thangakani A.M."
                    },
                    {
                        "name": "Selvaraj S."
                    }
                ],
                "citationCount": 110,
                "date": "2006-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "FOLD-RATE: Prediction of protein folding rates from amino acid sequence"
            },
            "pmid": "16845101"
        },
        {
            "pmid": "14502481"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        }
    ],
    "validated": 1
}