{
    "additionDate": "2021-01-18T09:30:17Z",
    "biotoolsCURIE": "biotools:pvp01",
    "biotoolsID": "pvp01",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "bjayaram@chemistry.iitd.ac.in",
            "name": "B Jayaram",
            "typeEntity": "Person"
        }
    ],
    "description": "A computational structural and functional characterization of soluble proteome of PvP01 strain of Plasmodium vivax.\n\nFive Species of malarial parasite (Plasmodium) are know to affect Humans, i.e., P. falciparum, P. ovale, P. malariae, P. vivax and P. knowlesi. P01 is one the strain of P. vivax which has been collected and annotated, which is directly connected to a patient in Papua Indonesia (PvP01), isolates from China (PvC01) and Thailand (PvT01), and have an improved version of genome over P. vixax Sal-1, Also reported as closely related to P. falciparum.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Protein solubility prediction",
                    "uri": "http://edamontology.org/operation_0409"
                },
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                }
            ]
        }
    ],
    "homepage": "http://www.scfbio-iitd.res.in/PvP01",
    "lastUpdate": "2021-01-30T14:16:12Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://scfbio-iitd.res.in/PvP01/upload.php"
        }
    ],
    "name": "PvP01",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAAA036",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press.Despite Plasmodium vivax being the main offender in the majority of malarial infections, very little information is available about its adaptation and development in humans. Its capability for activating relapsing infections through its dormant liver stage and resistance to antimalarial drugs makes it as one of the major challenges in eradicating malaria. Noting the immediate necessity for the availability of a comprehensive and reliable structural and functional repository for P. vivax proteome, here we developed a web resource for the new reference genome, PvP01, furnishing information on sequence, structure, functions, active sites and metabolic pathways compiled and predicted using some of the state-of-the-art methods in respective fields. The PvP01 web resource comprises organized data on the soluble proteome consisting of 3664 proteins in blood and liver stages of malarial cycle. The current public resources represent only 163 proteins of soluble proteome of PvP01, with complete information about their molecular function, biological process and cellular components. Also, only 46 proteins of P. vivax have experimentally determined structures. In this milieu of extreme scarcity of structural and functional information, PvP01 web resource offers meticulously validated structures of 3664 soluble proteins. The sequence and structure-based functional characterization led to a quantum leap from 163 proteins available presently to whole soluble proteome offered through PvP01 web resource. We believe PvP01 web resource will serve the researchers in identifying novel protein drug targets and in accelerating the development of structure-based new drug candidates to combat malaria. Database Availability: http://www.scfbio-iitd.res.in/PvP01",
                "authors": [
                    {
                        "name": "Chaurasia D.K."
                    },
                    {
                        "name": "Jayaram B."
                    },
                    {
                        "name": "Kaushik R."
                    },
                    {
                        "name": "Singh A."
                    },
                    {
                        "name": "Singh M."
                    }
                ],
                "citationCount": 1,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Database",
                "title": "PvP01-DB: Computational structural and functional characterization of soluble proteome of PvP01 strain of Plasmodium vivax"
            },
            "pmcid": "PMC7296392",
            "pmid": "32542363"
        }
    ],
    "topic": [
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ]
}
