{"collectionID": [], "accessibility": [], "topic": [{"term": "Structure prediction", "uri": "http://edamontology.org/topic_0082"}, {"term": "Protein folds and structural domains", "uri": "http://edamontology.org/topic_0736"}, {"term": "Protein folding, stability and design", "uri": "http://edamontology.org/topic_0130"}, {"term": "Small molecules", "uri": "http://edamontology.org/topic_0154"}, {"term": "Physics", "uri": "http://edamontology.org/topic_3318"}], "owner": "ELIXIR-EE", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": null, "note": null, "version": null, "pmid": "15162489", "type": null, "pmcid": null, "metadata": {"title": "A physical reference state unifies the structure-derived potential of mean force for protein folding and binding", "abstract": "Extracting knowledge-based statistical potential from known structures of proteins is proved to be a simple, effective method to obtain an approximate free-energy function. However, the different compositions of amino acid residues at the core, the surface, and the binding interface of proteins prohibited the establishment of a unified statistical potential for folding and binding despite the fact that the physical basis of the interaction (water-mediated interaction between amino acids) is the same. Recently, a physical state of ideal gas, rather than a statistically averaged state, has been used as the reference state for extracting the net interaction energy between amino acid residues of monomeric proteins. Here, we find that this monomer-based potential is more accurate than an existing all-atom knowledge-based potential trained with interfacial structures of dimers in distinguishing native complex structures from docking decoys (100% success rate vs. 52% in 21 dimer/trimer decoy sets). It is also more accurate than a recently developed semiphysical empirical free-energy functional enhanced by an orientation-dependent hydrogen-bonding potential in distinguishing native state from Rosetta docking decoys (94% success rate vs. 74% in 31 antibody-antigen and other complexes based on Z score). In addition, the monomer potential achieved a 93% success rate in distinguishing true dimeric interfaces from artificial crystal interfaces. More importantly, without additional parameters, the potential provides an accurate prediction of binding free energy of protein-peptide and protein-protein complexes (a correlation coefficient of 0. 87 and a root-mean-square deviation of 1.76 kcal/mol with 69 experimental data points). This work marks a significant step toward a unified knowledge-based potential that quantitatively captures the common physical principle underlying folding and binding. A Web server for academic users, established for the prediction of binding free energy and the energy evaluation of the protein-protein complexes, may be found at http://theory.med.buffalo. edu. © 2004 Wiley-Liss,Inc.", "citationCount": 137, "authors": [{"name": "Liu S."}, {"name": "Zhang C."}, {"name": "Zhou H."}, {"name": "Zhou Y."}], "date": "2004-07-01T00:00:00Z", "journal": "Proteins: Structure, Function and Genetics"}}, {"doi": null, "note": null, "version": null, "pmid": "12381853", "type": null, "pmcid": null, "metadata": {"title": "Distance-scaled, finite ideal-gas reference state improves structure-derived potentials of mean force for structure selection and stability prediction", "abstract": "The distance-dependent structure-derived potentials developed so far all employed a reference state that can be characterized as a residue (atom)-averaged state. Here, we establish a new reference state called the distance-scaled, finite ideal-gas reference (DFIRE) state. The reference state is used to construct a residue-specific all-atom potential of mean force from a database of 1011 nonhomologous (less than 30% homology) protein structures with resolution less than 2 Å. The new all-atom potential recognizes more native proteins from 32 multiple decoy sets, and raises an average Z-score by 1.4 units more than two previously developed, residue-specific, all-atom knowledge-based potentials. When only backbone and Cβ atoms are used in scoring, the performance of the DFIRE-based potential, although is worse than that of the all-atom version, is comparable to those of the previously developed potentials on the all-atom level. In addition, the DFIRE-based all-atom potential provides the most accurate prediction of the stabilities of 895 mutants among three knowledge-based all-atom potentials. Comparison with several physical-based potentials is made.", "citationCount": 639, "authors": [{"name": "Zhou H."}, {"name": "Zhou Y."}], "date": "2002-11-01T00:00:00Z", "journal": "Protein Science"}}, {"doi": null, "note": null, "version": null, "pmid": "15146497", "type": null, "pmcid": null, "metadata": {"title": "Single-body residue-level knowledge-based energy score combined with sequence-profile and secondary structure information for fold recognition", "abstract": "An elaborate knowledge-based energy function is designed for fold recognition. It is a residue-level single-body potential so that highly efficient dynamic programming method can be used for alignment optimization. It contains a backbone torsion term, a buried surface term, and a contact-energy term. The energy score combined with sequence profile and secondary structure information leads to an algorithm called SPARKS (Sequence, secondary structure Profiles and Residue-level Knowledge-based energy Score) for fold recognition. Compared with the popular PSI-BLAST, SPARKS is 21% more accurate in sequence-sequence alignment in ProSup benchmark and 10%, 25%, and 20% more sensitive in detecting the family, superfamily, fold similarities in the Lindahl benchmark, respectively. Moreover, it is one of the best methods for sensitivity (the number of correctly recognized proteins), alignment accuracy (based on the MaxSub score), and specificity (the average number of correctly recognized proteins whose scores are higher than the first false positives) in LiveBench 7 among more than twenty servers of non-consensus methods. The simple algorithm used in SPARKS has the potential for further improvement. This highly efficient method can be used for fold recognition on genomic scales. A web server is established for academic users on http://theory. med.buffalo.edu. © 2004 Wiley-Liss, Inc.", "citationCount": 150, "authors": [{"name": "Zhou H."}, {"name": "Zhou Y."}], "date": "2004-04-01T00:00:00Z", "journal": "Proteins: Structure, Function and Genetics"}}, {"doi": null, "note": null, "version": null, "pmid": "14739324", "type": null, "pmcid": null, "metadata": {"title": "Accurate and efficient loop selections by the DFIRE-based all-atom statistical potential", "abstract": "The conformations of loops are determined by the water-mediated interactions between amino acid residues. Energy functions that describe the interactions can be derived either from physical principles (physical-based energy function) or statistical analysis of known protein structures (knowledge-based statistical potentials). It is commonly believed that statistical potentials are appropriate for coarse-grained representation of proteins but are not as accurate as physical-based potentials when atomic resolution is required. Several recent applications of physical-based energy functions to loop selections appear to support this view. In this article, we apply a recently developed DFIRE-based statistical potential to three different loop decoy sets (RAPPER, Jacobson, and Forrest-Woolf sets). Together with a rotamer library for side-chain optimization, the performance of DFIRE-based potential in the RAPPER decoy set (385 loop targets) is comparable to that of AMBER/GBSA for short loops (two to eight residues). The DFIRE is more accurate for longer loops (9 to 12 residues). Similar trend is observed when comparing DFIRE with another physical-based OPLS/SGB-NP energy function in the large Jacobson decoy set (788 loop targets). In the Forrest-Woolf decoy set for the loops of membrane proteins, the DFIRE potential performs substantially better than the combination of the CHARMM force field with several solvation models. The results suggest that a single-term DFIRE-statistical energy function can provide an accurate loop prediction at a fraction of computing cost required for more complicate physical-based energy functions. A Web server for academic users is established for loop selection at the softwares/services section of the Web site http://theory.med. buffalo.edu/.", "citationCount": 95, "authors": [{"name": "Zhang C."}, {"name": "Liu S."}, {"name": "Zhou Y."}], "date": "2004-02-01T00:00:00Z", "journal": "Protein Science"}}, {"doi": null, "note": null, "version": null, "pmid": "15523666", "type": null, "pmcid": null, "metadata": {"title": "Fold recognition by combining sequence profiles derived from evolution and from depth-dependent structural alignment of fragments", "abstract": "Recognizing structural similarity without significant sequence identity has proved to be a challenging task. Sequence-based and structure-based methods as well as their combinations have been developed. Here, we propose a fold-recognition method that incorporates structural information without the need of sequence-to-structure threading. This is accomplished by generating sequence profiles from protein structural fragments. The structure-derived sequence profiles allow a simple integration with evolution-derived sequence profiles and secondary-structural information for an optimized alignment by efficient dynamic programming. The resulting method (called SP3) is found to make a statistically significant improvement in both sensitivity of fold recognition and accuracy of alignment over the method based on evolution-derived sequence profiles alone (SP) and the method based on evolution-derived sequence profile and secondary structure profile (SP 2). SP3 was tested in SALIGN benchmark for alignment accuracy and Lindahl, PROSPECTOR 3.0, and LiveBench 8.0 benchmarks for remote-homology detection and model accuracy. SP3 is found to be the most sensitive and accurate single-method server in all benchmarks tested where other methods are available for comparison (although its results are statistically indistinguishable from the next best in some cases and the comparison is subjected to the limitation of time-dependent sequence and/or structural library used by different methods.). In LiveBench 8.0, its accuracy rivals some of the consensus methods such as ShotGun-INBGU, Pmodeller3, Pcons4, and ROBETTA. SP3 fold-recognition server is available on http://theory. med.buffalo.edu. © 2004 Wiley-Liss, Inc.", "citationCount": 172, "authors": [{"name": "Zhou H."}, {"name": "Zhou Y."}], "date": "2005-02-01T00:00:00Z", "journal": "Proteins: Structure, Function and Genetics"}}, {"doi": null, "note": null, "version": null, "pmid": "11751332", "type": null, "pmcid": null, "metadata": {"title": "Folding rate prediction using total contact distance", "abstract": "Linear regression analysis found that either contact order (CO) or long-range order (LRO) parameter has a significant correlation with the logarithms of folding rates. This suggests that sequence separation per contact and total number of contacts are both important in determining the rate of folding. Here, the two factors are incorporated into a new parameter, total contact distance (TCD). Using a database of 28 two-state or weakly three-state folding proteins, TCD is found to be the most accurate among the three parameters (CO, LRO, and TCD) in terms of correlation and prediction. It provides even more accurate prediction than the best neural network results with two descriptors (contact order and stability per residue). The improvement is achieved in all three-structural classes (all α, β, and mixed). The accuracy of total contact distance in predicting folding rates is essentially unchanged if \"short\"-ranged contacts (|i - j| ≤ 14) are not included in calculation. Thus, only long-range contacts with a sequence separation of more than 14 residues are important in determining the rate of folding. This is consistent with the results from the long-range order parameter. One of the significant outliers in prediction is found to be associated with the only protein in the database that involves nonlocal disulfide bonds. Removing the protein leads to a correlation coefficient of 0.89 between experimental observed and predicted folding rates in jackknife cross validation. The corresponding values for CO and LRO are 0.71 and 0.80, respectively.", "citationCount": 144, "authors": [{"name": "Zhou H."}, {"name": "Zhou Y."}], "date": "2002-01-01T00:00:00Z", "journal": "Biophysical Journal"}}, {"doi": null, "note": null, "version": null, "pmid": "12824500", "type": null, "pmcid": null, "metadata": {"title": "Predicting the topology of transmembrane helical proteins using mean burial propensity and a hidden-Markov-model-based method", "abstract": "Helices in membrane spanning regions are more tightly packed than the helices in soluble proteins. Thus, we introduce a method that uses a simple scale of burial propensity and a new algorithm to predict transmembrane helical (TMH) segments and a positive-inside rule to predict amino-terminal orientation. The method (the topology predictor of transmembrane helical proteins using mean burial propensity [THUMBUP]) correctly predicted the topology of 55 of 73 proteins (or 75%) with known three-dimensional structures (the 3D helix database). This level of accuracy can be reached by MEMSAT 1.8 (a 200-parameter model-recognition method) and a new HMM-based method (a 111-parameter hidden Markov model, UMDHMMTMHP) if they were retrained with the 73-protein database. Thus, a method based on a physiochemical property can provide topology prediction as accurate as those methods based on more complicated statistical models and learning algorithms for the proteins with accurately known structures. Commonly used HMM-based methods and MEMSAT 1.8 were trained with a combination of the partial 3D helix database and a 1D helix database of TMH proteins in which topology information were obtained by gene fusion and other experimental techniques. These methods provide a significantly poorer prediction for the topology of TMH proteins in the 3D helix database. This suggests that the 1D helix database, because of its inaccuracy, should be avoided as either a training or testing database. A Web server of THUMBUP and UMDHMMTMHP is established for academic users at http://www.smbs.buffalo.edu/phys_bio/service.htm. The 3D helix database is also available from the same Web site.", "citationCount": 62, "authors": [{"name": "Zhou H."}, {"name": "Zhou Y."}], "date": "2003-07-01T00:00:00Z", "journal": "Protein Science"}}, {"doi": null, "note": null, "version": null, "pmid": "15980453", "type": null, "pmcid": null, "metadata": {"title": "Web-based toolkits for topology prediction of transmembrane helical proteins, fold recognition, structure and binding scoring, folding-kinetics analysis and comparative analysis of domain combinations", "abstract": "We have developed the following web servers for protein structural modeling and analysis at http://theory.med.buffalo.edu: THUMBUP, UMDHMMTMHP and TUPS, predictors of transmembrane helical protein topology based on a mean-burial-propensity scale of amino acid residues (THUMBUP), hidden Markov model (UMDHMMTMHP) and their combinations (TUPS); SPARKS 2.0 and SP3, two profile-profile alignment methods, that match input query sequence(s) to structural templates by integrating sequence profile with knowledge-based structural score (SPARKS 2.0) and structure-derived profile (SP3); DFIRE, a knowledge-based potential for scoring free energy of monomers (DMONOMER), loop conformations (DLOOP), mutant stability (DMUTANT) and binding affinity of protein-protein/peptide/DNA complexes (DCOMPLEX & DDNA); TCD, a program for protein-folding rate and transition-state analysis of small globular proteins; and DOGMA, a web-server that allows comparative analysis of domain combinations between plant and other 55 organisms. These servers provide tools for prediction and/or analysis of proteins on the secondary structure, tertiary structure and interaction levels, respectively. © 2005 Oxford University Press.", "citationCount": 16, "authors": [{"name": "Zhou H."}, {"name": "Zhang C."}, {"name": "Liu S."}, {"name": "Zhou Y."}], "date": "2005-07-01T00:00:00Z", "journal": "Nucleic Acids Research"}}], "homepage_status": 1, "credit": [{"typeRole": ["Primary contact"], "name": "Hongyi Zhou", "url": "http://cssb.biology.gatech.edu/skolnick/people/zhou.html", "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "hzhou3@mail.gatech.edu"}], "biotoolsCURIE": "biotools:services_from_zhou_laboratory", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "http://cssb.biology.gatech.edu/skolnick/people/zhou.html", "function": [{"note": null, "input": [], "operation": [{"term": "Protein fold recognition", "uri": "http://edamontology.org/operation_0303"}, {"term": "Prediction and recognition", "uri": "http://edamontology.org/operation_2423"}, {"term": "Transmembrane protein analysis", "uri": "http://edamontology.org/operation_0270"}, {"term": "Protein secondary structure prediction", "uri": "http://edamontology.org/operation_0267"}, {"term": "Protein threading", "uri": "http://edamontology.org/operation_0302"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:43Z", "otherID": [], "description": "Tools from the Zhou laboratory including predictors of transmembrane topology (THUMBUP, UMDHMM-TMHP, TUPS); prediction/analysis tools for tertiary structure (SPARKS2, SP3); and, prediction/analysis tools for interactions (DMONOMER, DLOOP, DMUTANT, DCOMPLEX, DDNA, TCD, DOGMA).", "toolType": ["Suite"], "editPermission": {"type": "private", "authors": []}, "language": [], "link": [], "biotoolsID": "services_from_zhou_laboratory", "additionDate": "2017-03-25T22:23:05Z", "name": "Services from Zhou Laboratory", "license": null, "documentation": [], "maturity": null, "confidence_flag": null, "operatingSystem": []}