{
    "additionDate": "2018-07-28T13:56:17Z",
    "biotoolsCURIE": "biotools:xenogi",
    "biotoolsID": "xenogi",
    "credit": [
        {
            "email": "bush@hmc.edu",
            "name": "Eliot C. Bush",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Reconstructing the history of genomic island insertions in clades of closely related bacteria.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://siva.cs.hmc.edu/xgicgi/wxgi.py/form"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree analysis",
                    "uri": "http://edamontology.org/operation_0324"
                },
                {
                    "term": "Sequence feature detection",
                    "uri": "http://edamontology.org/operation_0253"
                }
            ]
        }
    ],
    "homepage": "http://siva.cs.hmc.edu/xgicgi/wxgi.py/form",
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "xenoGI",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s12859-018-2038-0",
            "metadata": {
                "abstract": "© 2018 The Author(s).Background: Genomic islands play an important role in microbial genome evolution, providing a mechanism for strains to adapt to new ecological conditions. A variety of computational methods, both genome-composition based and comparative, have been developed to identify them. Some of these methods are explicitly designed to work in single strains, while others make use of multiple strains. In general, existing methods do not identify islands in the context of the phylogeny in which they evolved. Even multiple strain approaches are best suited to identifying genomic islands that are present in one strain but absent in others. They do not automatically recognize islands which are shared between some strains in the clade or determine the branch on which these islands inserted within the phylogenetic tree. Results: We have developed a software package, xenoGI, that identifies genomic islands and maps their origin within a clade of closely related bacteria, determining which branch they inserted on. It takes as input a set of sequenced genomes and a tree specifying their phylogenetic relationships. Making heavy use of synteny information, the package builds gene families in a species-tree-aware way, and then attempts to combine into islands those families whose members are adjacent and whose most recent common ancestor is shared. The package provides a variety of text-based analysis functions, as well as the ability to export genomic islands into formats suitable for viewing in a genome browser. We demonstrate the capabilities of the package with several examples from enteric bacteria, including an examination of the evolution of the acid fitness island in the genus Escherichia. In addition we use output from simulations and a set of known genomic islands from the literature to show that xenoGI can accurately identify genomic islands and place them on a phylogenetic tree. Conclusions: xenoGI is an effective tool for studying the history of genomic island insertions in a clade of microbes. It identifies genomic islands, and determines which branch they inserted on within the phylogenetic tree for the clade. Such information is valuable because it helps us understand the adaptive path that has produced living species.",
                "authors": [
                    {
                        "name": "Bush E.C."
                    },
                    {
                        "name": "Clark A.E."
                    },
                    {
                        "name": "DeRanek C.A."
                    },
                    {
                        "name": "Eng A."
                    },
                    {
                        "name": "Forman J."
                    },
                    {
                        "name": "Heath K."
                    },
                    {
                        "name": "Lee A.B."
                    },
                    {
                        "name": "Stoebel D.M."
                    },
                    {
                        "name": "Wang Z."
                    },
                    {
                        "name": "Wilber M."
                    },
                    {
                        "name": "Wu H."
                    }
                ],
                "citationCount": 2,
                "date": "2018-02-05T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "xenoGI: Reconstructing the history of genomic island insertions in clades of closely related bacteria"
            },
            "pmcid": "PMC5799925",
            "pmid": "29402213"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Nucleic acid sites, features and motifs",
            "uri": "http://edamontology.org/topic_3511"
        },
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        }
    ],
    "validated": 1
}