{
    "additionDate": "2017-05-02T10:00:56Z",
    "biotoolsCURIE": "biotools:popmusic",
    "biotoolsID": "popmusic",
    "credit": [
        {
            "email": "info@dezyme.com",
            "name": "Dezyme Team",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://dezyme.com/en/Contact"
        }
    ],
    "description": "MuSiC is a suite of programs that evaluate the biophysical effects of amino acid mutations in proteins. They request the experimental or modeled 3-dimensional protein structure as input, and predict the impact of specific single-site mutations requested by the user or of all possible single-site mutations.\n\nPoPMuSiC and HoTMuSiC predict the changes in thermodynamic and thermal stability, respectively, upon mutation.  They are helpful for the rational design of modified proteins with controlled stability properties. \n\nSNPMuSiC predicts whether protein variants are deleterious or benign due to stability issues, thus providing a molecular-level interpretation of disease phenotype.",
    "editPermission": {
        "authors": [
            "mrooman"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Design",
                    "uri": "http://edamontology.org/operation_2430"
                },
                {
                    "term": "Protein property calculation",
                    "uri": "http://edamontology.org/operation_0250"
                },
                {
                    "term": "Variant effect prediction",
                    "uri": "http://edamontology.org/operation_0331"
                }
            ]
        }
    ],
    "homepage": "http://dezyme.com/",
    "lastUpdate": "2024-11-24T20:58:53.138581Z",
    "name": "MuSiC suite: PoPMuSiC, HoTMuSiC, and SNPMuSiC",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": "10.1038/s41598-018-22531-2",
            "metadata": {
                "abstract": "The classification of human genetic variants into deleterious and neutral is a challenging issue, whose complexity is rooted in the large variety of biophysical mechanisms that can be responsible for disease conditions. For non-synonymous mutations in structured proteins, one of these is the protein stability change, which can lead to loss of protein structure or function. We developed a stability-driven knowledge-based classifier that uses protein structure, artificial neural networks and solvent accessibility-dependent combinations of statistical potentials to predict whether destabilizing or stabilizing mutations are disease-causing. Our predictor yields a balanced accuracy of 71% in cross validation. As expected, it has a very high positive predictive value of 89%: It predicts with high accuracy the subset of mutations that are deleterious because of stability issues, but is by construction unable of classifying variants that are deleterious for other reasons. Its combination with an evolutionary-based predictor increases the balanced accuracy up to 75%, and allowed predicting more than 1/4 of the variants with 95% positive predictive value. Our method, called SNPMuSiC, can be used with both experimental and modeled structures and compares favorably with other prediction tools on several independent test sets. It constitutes a step towards interpreting variant effects at the molecular scale. SNPMuSiC is freely available at https://soft.dezyme.com/.",
                "authors": [
                    {
                        "name": "Ancien F."
                    },
                    {
                        "name": "Godfroid M."
                    },
                    {
                        "name": "Pucci F."
                    },
                    {
                        "name": "Rooman M."
                    }
                ],
                "citationCount": 62,
                "date": "2018-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "Prediction and interpretation of deleterious coding variants in terms of protein structural stability"
            },
            "pmcid": "PMC5852127",
            "pmid": "29540703"
        },
        {
            "doi": "10.1038/srep23257",
            "metadata": {
                "abstract": "The accurate prediction of the impact of an amino acid substitution on the thermal stability of a protein is a central issue in protein science, and is of key relevance for the rational optimization of various bioprocesses that use enzymes in unusual conditions. Here we present one of the first computational tools to predict the change in melting temperature ΔTm upon point mutations, given the protein structure and, when available, the melting temperature Tm of the wild-type protein. The key ingredients of our model structure are standard and temperature-dependent statistical potentials, which are combined with the help of an artificial neural network. The model structure was chosen on the basis of a detailed thermodynamic analysis of the system. The parameters of the model were identified on a set of more than 1,600 mutations with experimentally measured ΔTm. The performance of our method was tested using a strict 5-fold cross-validation procedure, and was found to be significantly superior to that of competing methods. We obtained a root mean square deviation between predicted and experimental ΔTm values of 4.2 °C that reduces to 2.9 °C when ten percent outliers are removed. A webserver-based tool is freely available for non-commercial use at soft.dezyme.com.",
                "authors": [
                    {
                        "name": "Bourgeas R."
                    },
                    {
                        "name": "Pucci F."
                    },
                    {
                        "name": "Rooman M."
                    }
                ],
                "citationCount": 82,
                "date": "2016-03-18T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "Predicting protein thermal stability changes upon point mutations using statistical potentials: Introducing HoTMuSiC"
            },
            "pmcid": "PMC4796876",
            "pmid": "26988870"
        },
        {
            "doi": "10.1186/1471-2105-12-151",
            "metadata": {
                "abstract": "Background: The rational design of modified proteins with controlled stability is of extreme importance in a whole range of applications, notably in the biotechnological and environmental areas, where proteins are used for their catalytic or other functional activities. Future breakthroughs in medical research may also be expected from an improved understanding of the effect of naturally occurring disease-causing mutations on the molecular level.Results: PoPMuSiC-2.1 is a web server that predicts the thermodynamic stability changes caused by single site mutations in proteins, using a linear combination of statistical potentials whose coefficients depend on the solvent accessibility of the mutated residue. PoPMuSiC presents good prediction performances (correlation coefficient of 0.8 between predicted and measured stability changes, in cross validation, after exclusion of 10% outliers). It is moreover very fast, allowing the prediction of the stability changes resulting from all possible mutations in a medium size protein in less than a minute. This unique functionality is user-friendly implemented in PoPMuSiC and is particularly easy to exploit. Another new functionality of our server concerns the estimation of the optimality of each amino acid in the sequence, with respect to the stability of the structure. It may be used to detect structural weaknesses, i.e. clusters of non-optimal residues, which represent particularly interesting sites for introducing targeted mutations. This sequence optimality data is also expected to have significant implications in the prediction and the analysis of particular structural or functional protein regions. To illustrate the interest of this new functionality, we apply it to a dataset of known catalytic sites, and show that a much larger than average concentration of structural weaknesses is detected, quantifying how these sites have been optimized for function rather than stability.Conclusion: The freely available PoPMuSiC-2.1 web server is highly useful for identifying very rapidly a list of possibly relevant mutations with the desired stability properties, on which subsequent experimental studies can be focused. It can also be used to detect sequence regions corresponding to structural weaknesses, which could be functionally important or structurally delicate regions, with obvious applications in rational protein design. © 2011 Dehouck et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Dehouck Y."
                    },
                    {
                        "name": "Gilis D."
                    },
                    {
                        "name": "Kwasigroch J.M."
                    },
                    {
                        "name": "Rooman M."
                    }
                ],
                "citationCount": 419,
                "date": "2011-05-13T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "PoPMuSiC 2.1: A web server for the estimation of protein stability changes upon mutation and sequence optimality"
            },
            "pmcid": "PMC3113940",
            "pmid": "21569468"
        },
        {
            "doi": "10.1007/978-1-0716-0270-6_5",
            "metadata": {
                "abstract": "The rational design of enzymes is a challenging research field, which plays an important role in the optimization of a wide series of biotechnological processes. Computational approaches allow screening all possible amino acid substitutions in a target protein and to identify a subset likely to have the desired properties. They can thus be used to guide and restrict the huge, time-consuming search in sequence space to reach protein optimality. Here we present HoTMuSiC, a tool that predicts the impact of point mutations on the protein melting temperature, which uses the experimental or modeled protein structure as sole input and is available at the dezyme.com website. Its main advantages include accuracy and speed, which makes it a perfect instrument for thermal stability engineering projects aiming at designing new proteins that feature increased heat resistance or remain active and stable in nonphysiological conditions. We set up a HoTMuSiC-based pipeline, which uses additional information to avoid mutations of functionally important residues, identified as being too well conserved among homologous proteins or too close to annotated functional sites. The efficiency of this pipeline is successfully demonstrated on Rhizomucor miehei lipase.",
                "authors": [
                    {
                        "name": "Kwasigroch J.M."
                    },
                    {
                        "name": "Pucci F."
                    },
                    {
                        "name": "Rooman M."
                    }
                ],
                "citationCount": 16,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Methods in Molecular Biology",
                "title": "Protein Thermal Stability Engineering Using HoTMuSiC"
            },
            "pmid": "32006278"
        },
        {
            "doi": "10.1093/bioinformatics/btp445",
            "metadata": {
                "abstract": "Motivation: The rational design of proteins with modified properties, through amino acid substitutions, is of crucial importance in a large variety of applications. Given the huge number of possible substitutions, every protein engineering project would benefit strongly from the guidance of in silico methods able to predict rapidly, and with reasonable accuracy, the stability changes resulting from all possible mutations in a protein. Results: We exploit newly developed statistical potentials, based on a formalism that highlights the coupling between four protein sequence and structure descriptors, and take into account the amino acid volume variation upon mutation. The stability change is expressed as a linear combination of these energy functions, whose proportionality coefficients vary with the solvent accessibility of the mutated residue and are identified with the help of a neural network. A correlation coefficient of R = 0.63 and a root mean square error of σc = 1.15 kcal/mol between measured and predicted stability changes are obtained upon cross-validation. These scores reach R = 0.79, and σc = 0.86 kcal/mol after exclusion of 10% outliers. The predictive power of our method is shown to be significantly higher than that of other programs described in the literature. © The Author 2009. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Bogaerts P."
                    },
                    {
                        "name": "Dehouck Y."
                    },
                    {
                        "name": "Folch B."
                    },
                    {
                        "name": "Gilis D."
                    },
                    {
                        "name": "Grosfils A."
                    },
                    {
                        "name": "Rooman M."
                    }
                ],
                "citationCount": 326,
                "date": "2009-10-16T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Fast and accurate predictions of protein stability changes upon mutations using statistical potentials and neural networks: PoPMuSiC-2.0"
            },
            "pmid": "19654118"
        },
        {
            "doi": "10.1093/bioinformatics/bty348",
            "metadata": {
                "abstract": "Motivation: Bioinformatics tools that predict protein stability changes upon point mutations have made a lot of progress in the last decades and have become accurate and fast enough to make computational mutagenesis experiments feasible, even on a proteome scale. Despite these achievements, they still suffer from important issues that must be solved to allow further improving their performances and utilizing them to deepen our insights into protein folding and stability mechanisms. One of these problems is their bias toward the learning datasets which, being dominated by destabilizing mutations, causes predictions to be better for destabilizing than for stabilizing mutations. Results: We thoroughly analyzed the biases in the prediction of folding free energy changes upon point mutations (∆∆G0) and proposed some unbiased solutions. We started by constructing a dataset Ssym of experimentally measured ∆∆G0s with an equal number of stabilizing and destabilizing mutations, by collecting mutations for which the structure of both the wild-type and mutant protein is available. On this balanced dataset, we assessed the performances of 15 widely used ∆∆G0 predictors. After the astonishing observation that almost all these methods are strongly biased toward destabilizing mutations, especially those that use black-box machine learning, we proposed an elegant way to solve the bias issue by imposing physical symmetries under inverse mutations on the model structure, which we implemented in PoPMuSiCsym. This new predictor constitutes an efficient trade-off between accuracy and absence of biases. Some final considerations and suggestions for further improvement of the predictors are discussed.",
                "authors": [
                    {
                        "name": "Bernaerts K.V."
                    },
                    {
                        "name": "Kwasigroch J.M."
                    },
                    {
                        "name": "Pucci F."
                    },
                    {
                        "name": "Rooman M."
                    }
                ],
                "citationCount": 107,
                "date": "2018-11-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Quantification of biases in predictions of protein stability changes upon mutations"
            },
            "pmid": "29718106"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Bioengineering",
            "uri": "http://edamontology.org/topic_3398"
        },
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Protein properties",
            "uri": "http://edamontology.org/topic_0123"
        }
    ],
    "validated": 1
}
