{
    "additionDate": "2021-02-15T22:30:12Z",
    "biotoolsCURIE": "biotools:vardict",
    "biotoolsID": "vardict",
    "description": "VarDict is an ultra sensitive variant caller for both single and paired sample variant calling from BAM files. VarDict implements several novel features such as amplicon bias aware variant calling from targeted sequencing experiments, rescue of long indels by realigning bwa soft clipped reads and better scalability than many Java based variant callers.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence alignment",
                        "uri": "http://edamontology.org/data_0863"
                    },
                    "format": [
                        {
                            "term": "BAM",
                            "uri": "http://edamontology.org/format_2572"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Sequence variations",
                        "uri": "http://edamontology.org/data_3498"
                    },
                    "format": [
                        {
                            "term": "VCF",
                            "uri": "http://edamontology.org/format_3016"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "https://github.com/AstraZeneca-NGS/VarDict",
    "lastUpdate": "2024-11-24T20:43:37.160274Z",
    "name": "vardict",
    "owner": "leipzig",
    "publication": [
        {
            "doi": "10.1093/nar/gkw227",
            "metadata": {
                "abstract": "Accurate variant calling in next generation sequencing (NGS) is critical to understand cancer genomes better. Here we present VarDict, a novel and versatile variant caller for both DNA- and RNA-sequencing data. VarDict simultaneously calls SNV, MNV, InDels, complex and structural variants, expanding the detected genetic driver landscape of tumors. It performs local realignments on the fly for more accurate allele frequency estimation. VarDict performance scales linearly to sequencing depth, enabling ultra-deep sequencing used to explore tumor evolution or detect tumor DNA circulating in blood. In addition, VarDict performs amplicon aware variant calling for polymerase chain reaction (PCR)-based targeted sequencing often used in diagnostic settings, and is able to detect PCR artifacts. Finally, VarDict also detects differences in somatic and loss of heterozygosity variants between paired samples. VarDict reprocessing of The Cancer Genome Atlas (TCGA) Lung Adenocarcinoma dataset called known driver mutations in KRAS, EGFR, BRAF, PIK3CA and MET in 16% more patients than previously published variant calls. We believe VarDict will greatly facilitate application of NGS in clinical cancer research.",
                "authors": [
                    {
                        "name": "Ahdesmaki M."
                    },
                    {
                        "name": "Barrett J.C."
                    },
                    {
                        "name": "Chapman B."
                    },
                    {
                        "name": "Dougherty B."
                    },
                    {
                        "name": "Dry J.R."
                    },
                    {
                        "name": "Hofmann O."
                    },
                    {
                        "name": "Johnson J."
                    },
                    {
                        "name": "Lai Z."
                    },
                    {
                        "name": "Markovets A."
                    },
                    {
                        "name": "Mcewen R."
                    }
                ],
                "citationCount": 562,
                "date": "2016-06-20T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "VarDict: A novel and versatile variant caller for next-generation sequencing in cancer research"
            },
            "pmcid": "PMC4914105",
            "pmid": "27060149"
        }
    ]
}
