
{
    "credit": [
        {
            "name": "Bedtools Discussion Forum",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://groups.google.com/forum/?fromgroups#!forum/bedtools-discuss"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://bedtools.readthedocs.io/en/latest/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Animal and Crop Genomics",
            "bedtools"
        ],
        "language": [
            "C++"
        ],
        "license": "GPL-2.0",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Suite"
        ],
        "topic": [
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Motivation: Testing for correlations between different sets of genomic features is a fundamental task in genomics research. However, searching for overlaps between features with existing webbased methods is complicated by the massive datasets that are routinely produced with current sequencing technologies. Fast and flexible tools are therefore required to ask complex questions of these data in an efficient manner. Results: This article introduces a new software suite for the comparison, manipulation and annotation of genomic features in Browser Extensible Data (BED) and General Feature Format (GFF) format. BEDTools also supports the comparison of sequence alignments in BAM format to both BED and GFF features. The tools are extremely efficient and allow the user to compare large datasets (e.g. next-generation sequencing data) with both public and custom genome annotation tracks. BEDTools can be combined with one another as well as with standard UNIX commands, thus facilitating routine genomics tasks as well as pipelines that can quickly answer intricate questions of large genomic datasets. Availability and implementation: BEDTools was written in C++. Source code and a comprehensive user manual are freely available at http://code.google.com/p/bedtools. Contact: aaronquinlan@gmail.com; imh4y@virginia.edu. Supplementary information: Supplementary data are available at Bioinformatics online. © The Author(s) 2010. Published by Oxford University Press.",
            "authors": [
                "Quinlan A.R.",
                "Hall I.M."
            ],
            "cit_count": 4997,
            "journal": "Bioinformatics",
            "pmid": "20110278",
            "title": "BEDTools: A flexible suite of utilities for comparing genomic features",
            "year": "2010-01-28"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:bedtools",
        "biotoolsID": "bedtools",
        "description": "BEDTools is an extensive suite of utilities for comparing genomic features in BED format.",
        "homepage": "https://github.com/arq5x/bedtools2",
        "name": "BEDTools"
    }
}