{
    "accessibility": "Open access",
    "additionDate": "2021-11-20T07:12:39.661814Z",
    "biotoolsCURIE": "biotools:centromerearchitect",
    "biotoolsID": "centromerearchitect",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "abzikadze@ucsd.edu",
            "name": "Andrey V Bzikadze",
            "typeEntity": "Person"
        }
    ],
    "description": "Tool for decomposition centromeric assemblies and long reads into monomers",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ablab/stringdecomposer/tree/ismb2021",
    "language": [
        "C",
        "C++",
        "Python"
    ],
    "lastUpdate": "2021-11-20T07:12:39.664458Z",
    "license": "GPL-2.0",
    "name": "CentromereArchitect",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAB265",
            "metadata": {
                "abstract": "© 2021 The Author(s) 2021. Published by Oxford University Press.Motivation: Recent advances in long-read sequencing technologies led to rapid progress in centromere assembly in the last year and, for the first time, opened a possibility to address the long-standing questions about the architecture and evolution of human centromeres. However, since these advances have not been yet accompanied by the development of the centromere-specific bioinformatics algorithms, even the fundamental questions (e.g. centromere annotation by deriving the complete set of human monomers and high-order repeats), let alone more complex questions (e.g. explaining how monomers and high-order repeats evolved) about human centromeres remain open. Moreover, even though there was a four-decade-long series of studies aimed at cataloging all human monomers and high-order repeats, the rigorous algorithmic definitions of these concepts are still lacking. Thus, the development of a centromere annotation tool is a prerequisite for follow-up personalized biomedical studies of centromeres across the human population and evolutionary studies of centromeres across various species. Results: We describe the CentromereArchitect, the first tool for the centromere annotation in a newly sequenced genome, apply it to the recently generated complete assembly of a human genome by the Telomere-to-Telomere consortium, generate the complete set of human monomers and high-order repeats for 'live' centromeres, and reveal a vast set of hybrid monomers that may represent the focal points of centromere evolution.",
                "authors": [
                    {
                        "name": "Alexandrov I."
                    },
                    {
                        "name": "Bzikadze A.V."
                    },
                    {
                        "name": "Dvorkina T."
                    },
                    {
                        "name": "Kunyavskaya O."
                    },
                    {
                        "name": "Pevzner P.A."
                    }
                ],
                "date": "2021-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "CentromereArchitect: Inference and analysis of the architecture of centromeres"
            },
            "pmcid": "PMC8336445",
            "pmid": "34252949"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ]
}
