{
    "accessibility": "Open access",
    "additionDate": "2022-06-07T07:07:53.358780Z",
    "biotoolsCURIE": "biotools:defpred",
    "biotoolsID": "defpred",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "raghava@iiitd.ac.in",
            "name": "Gajendra P. S. Raghava",
            "typeEntity": "Person"
        }
    ],
    "description": "Defpred is a web server that predicts the presence of Defensins in given query protein sequqnces.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "https://webs.iiitd.edu.in/raghava/defpred",
    "lastUpdate": "2022-06-07T07:07:53.361289Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/defpred/dataset.php"
        }
    ],
    "name": "DefPred",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3389/FIMMU.2021.780610",
            "metadata": {
                "abstract": "Copyright © 2021 Kaur, Patiyal, Arora, Singh, Lodhi and Raghava.Defensins are host defense peptides present in nearly all living species, which play a crucial role in innate immunity. These peptides provide protection to the host, either by killing microbes directly or indirectly by activating the immune system. In the era of antibiotic resistance, there is a need to develop a fast and accurate method for predicting defensins. In this study, a systematic attempt has been made to develop models for predicting defensins from available information on defensins. We created a dataset of defensins and non-defensins called the main dataset that contains 1,036 defensins and 1,035 AMPs (antimicrobial peptides, or non-defensins) to understand the difference between defensins and AMPs. Our analysis indicates that certain residues like Cys, Arg, and Tyr are more abundant in defensins in comparison to AMPs. We developed machine learning technique-based models on the main dataset using a wide range of peptide features. Our SVM (support vector machine)-based model discriminates defensins and AMPs with MCC of 0.88 and AUC of 0.98 on the validation set of the main dataset. In addition, we created an alternate dataset that consists of 1,036 defensins and 1,054 non-defensins obtained from Swiss-Prot. Models were also developed on the alternate dataset to predict defensins. Our SVM-based model achieved maximum MCC of 0.96 with AUC of 0.99 on the validation set of the alternate dataset. All models were trained, tested, and validated using standard protocols. Finally, we developed a web-based service “DefPred” to predict defensins, scan defensins in proteins, and design the best defensins from their analogs. The stand-alone software and web server of DefPred are available at https://webs.iiitd.edu.in/raghava/defpred.",
                "authors": [
                    {
                        "name": "Arora C."
                    },
                    {
                        "name": "Kaur D."
                    },
                    {
                        "name": "Lodhi G."
                    },
                    {
                        "name": "Patiyal S."
                    },
                    {
                        "name": "Raghava G.P.S."
                    },
                    {
                        "name": "Singh R."
                    }
                ],
                "citationCount": 1,
                "date": "2021-11-22T00:00:00Z",
                "journal": "Frontiers in Immunology",
                "title": "In-Silico Tool for Predicting, Scanning, and Designing Defensins"
            },
            "pmcid": "PMC8645896",
            "pmid": "34880873"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ],
    "validated": 1
}
