{
    "additionDate": "2017-08-03T19:06:10Z",
    "biotoolsCURIE": "biotools:imomlogit",
    "biotoolsID": "imomlogit",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.stat.tamu.edu/~amir/"
        }
    ],
    "description": "iMOMLogit provides improved performance in identifying true models and reducing estimation and prediction error in a number of simulation studies.",
    "documentation": [
        {
            "type": "General",
            "url": "https://cran.r-project.org/web/packages/BVSNLP/BVSNLP.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "homepage": "http://www.stat.tamu.edu/~amir/code.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/imomlogit-bayesian-variable-selection-for-binary-outcomes-in-high-dimensional-genomic-studies.html"
        }
    ],
    "name": "iMOMLogit",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© The Author 2016. Published by Oxford University Press. Motivation: The advent of new genomic technologies has resulted in the production of massive data sets. Analyses of these data require new statistical and computational methods. In this article, we propose one such method that is useful in selecting explanatory variables for prediction of a binary response. Although this problem has recently been addressed using penalized likelihood methods, we adopt a Bayesian approach that utilizes a mixture of non-local prior densities and point masses on the binary regression coefficient vectors. Results: The resulting method, which we call iMOMLogit, provides improved performance in identifying true models and reducing estimation and prediction error in a number of simulation studies. More importantly, its application to several genomic datasets produces predictions that have high accuracy using far fewer explanatory variables than competing methods. We also describe a novel approach for setting prior hyperparameters by examining the total variation distance between the prior distributions on the regression parameters and the distribution of the maximum likelihood estimator under the null distribution. Finally, we describe a computational algorithm that can be used to implement iMOMLogit in ultrahigh-dimensional settings (p>>n) and provide diagnostics to assess the probability that this algorithm has identified the highest posterior probability model.",
                "authors": [
                    {
                        "name": "Nikooienejad A."
                    },
                    {
                        "name": "Wang W."
                    },
                    {
                        "name": "Johnson V.E."
                    }
                ],
                "citationCount": 8,
                "date": "2016-05-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Bayesian variable selection for binary outcomes in high-dimensional genomic studies using non-local priors"
            },
            "pmid": "26740524"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Experimental design and studies",
            "uri": "http://edamontology.org/topic_3678"
        }
    ],
    "validated": 1
}