{
    "additionDate": "2018-08-13T10:08:35Z",
    "biotoolsCURIE": "biotools:seqfam",
    "biotoolsID": "seqfam",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/mframpton/seqfam/issues"
        }
    ],
    "description": "Analysis of next generation sequencing (NGS) DNA data from families with known pedigree information in order to identify rare variants that are potentially causal of a disease/trait of interest. It can be used to verify pedigree information, to perform Monte Carlo gene dropping, to undertake regression-based gene burden testing, and to identify variants which segregate by affection status in families via user-defined pattern of occurrence rules.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://seqfam.readthedocs.io/en/latest/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "DNA mapping",
                    "uri": "http://edamontology.org/operation_2520"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "https://github.com/mframpton/seqfam",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "GPL-3.0",
    "name": "seqfam",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.12688/f1000research.13930.1",
            "metadata": {
                "abstract": "© 2018 Frampton M et al.This article introduces seqfam, a python package which is primarily designed for analysing next generation sequencing (NGS) DNA data from families with known pedigree information in order to identify rare variants that are potentially causal of a disease/trait of interest. It uses the popular and versatile Pandas library, and can be straightforwardly integrated into existing analysis code/pipelines. Seqfam can be used to verify pedigree information, to perform Monte Carlo gene dropping, to undertake regression-based gene burden testing, and to identify variants which segregate by affection status in families via user-defined pattern of occurrence rules. Additionally, it can generate scripts for running analyses in a ‘MapReduce pattern’ on a computer cluster, something which is usually desirable in NGS data analysis and indeed ‘big data’ analysis in general. This article summarises how seqfam’s main user functions work and motivates their use. It also provides explanatory context for example scripts and data included in the package which demonstrate use cases. With respect to verifying pedigree information, software exists for efficiently calculating kinship coefficients, so seqfam performs the necessary extra steps of mapping pedigrees and kinship coefficients to expected and observed degrees of relationship respectively. Gene dropping and the application of variant pattern of occurrence rules in families can provide evidence for a variant being causal. The authors are unaware of other software which performs these tasks in familial cohorts, so seqfam fulfils this need. Gene burden rather than single marker tests are often used to detect rare causal variants due to greater power. Seqfam may be an attractive alternative to existing gene burden testing software due to its flexibility, particularly in grouping and aggregating variants.",
                "authors": [
                    {
                        "name": "Frampton M."
                    },
                    {
                        "name": "Schiff E.R."
                    },
                    {
                        "name": "Pontikos N."
                    },
                    {
                        "name": "Segal A.W."
                    },
                    {
                        "name": "Levine A.P."
                    }
                ],
                "date": "2018-01-01T00:00:00Z",
                "journal": "F1000Research",
                "title": "Seqfam: A python package for analysis of next generation sequencing DNA data in families [version 1; peer review: 1 approved with reservations, 1 not approved]"
            }
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}