{
    "additionDate": "2019-11-14T18:37:28Z",
    "biotoolsCURIE": "biotools:dbMDEGA",
    "biotoolsID": "dbMDEGA",
    "confidence_flag": "low",
    "credit": [
        {
            "email": "mariacristina.rodriguez.fontenla@usc.es",
            "name": "Cristina Rodriguez-Fontenla",
            "typeEntity": "Person"
        },
        {
            "name": "Angel Carracedo",
            "typeEntity": "Person"
        }
    ],
    "description": "> LOW CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'GBA', 'PASCAL', 'Novel Gene-Based Analysis ASD GWAS', 'ASD-associated' | Insight Into the Biological Role of Associated Genes | Background: Autism spectrum disorder (ASD) is a neurodevelopmental disorder characterized by its significant social impact and high heritability. The latest meta-analysis of ASD GWAS (genome-wide association studies) has revealed the association of several SNPs that were replicated in additional sets of independent samples. However, summary statistics from GWAS can be used to perform a gene-based analysis (GBA). GBA allows to combine all genetic information across the gene to create a single statistic (p-value for each gene). Thus, PASCAL (Pathway scoring algorithm), a novel GBA tool, has been applied to the summary statistics from the latest meta-analysis of ASD. GBA approach (testing the gene as a unit) provides an advantage to perform an accurate insight into the biological ASD mechanisms",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://dbmdega.shinyapps.io/dbMDEGA/",
    "language": [
        "Pascal"
    ],
    "lastUpdate": "2019-11-14T18:37:28Z",
    "name": "dbMDEGA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FGENE.2019.00733",
            "metadata": {
                "abstract": "© 2019 Alonso-Gonzalez, Calaza, Rodriguez-Fontenla and Carracedo. This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms.Background: Autism spectrum disorder (ASD) is a neurodevelopmental disorder characterized by its significant social impact and high heritability. The latest meta-analysis of ASD GWAS (genome-wide association studies) has revealed the association of several SNPs that were replicated in additional sets of independent samples. However, summary statistics from GWAS can be used to perform a gene-based analysis (GBA). GBA allows to combine all genetic information across the gene to create a single statistic (p-value for each gene). Thus, PASCAL (Pathway scoring algorithm), a novel GBA tool, has been applied to the summary statistics from the latest meta-analysis of ASD. GBA approach (testing the gene as a unit) provides an advantage to perform an accurate insight into the biological ASD mechanisms. Therefore, a gene-network analysis and an enrichment analysis for KEGG and GO terms were carried out. GENE2FUNC was used to create gene expression heatmaps and to carry out differential expression analysis (DEA) across GTEx v7 tissues and Brainspan data. dbMDEGA was employed to perform a DEG analysis between ASD and brain control samples for the associated genes and interactors. Results: PASCAL has identified the following loci associated with ASD: XRN2, NKX2-4, PLK1S1, KCNN2, NKX2-2, CRHR1-IT1, C8orf74 and LOC644172. While some of these genes were previously reported by MAGMA (XRN2, PLK1S1, and KCNN2), PASCAL has been useful to highlight additional genes. The biological characterization of the ASD-associated genes and their interactors have demonstrated the association of several GO and KEGG terms. Moreover, DEA analysis has revealed several up- and down-regulated clusters. In addition, many of the ASD-associated genes and their interactors have shown association with ASD expression datasets. Conclusions: This study identifies several associations at a gene level in ASD. Most of them were previously reported by MAGMA. This fact proves that PASCAL is an efficient GBA tool to extract additional information from previous GWAS. In addition, this study has characterized for the first time the biological role of the ASD-associated genes across brain regions, neurodevelopmental stages, and ASD gene-expression datasets.",
                "authors": [
                    {
                        "name": "Alonso-Gonzalez A."
                    },
                    {
                        "name": "Calaza M."
                    },
                    {
                        "name": "Rodriguez-Fontenla C."
                    },
                    {
                        "name": "Carracedo A."
                    }
                ],
                "citationCount": 1,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "Novel gene-based analysis of ASD GWAS: Insight into the biological role of associated genes"
            },
            "pmcid": "PMC6696953",
            "pmid": "31447886"
        }
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}