{
    "additionDate": "2020-01-14T20:08:23Z",
    "biotoolsCURIE": "biotools:autoantigenomics",
    "biotoolsID": "autoantigenomics",
    "confidence_flag": "medium",
    "description": "Holistic characterization of autoantigen repertoires for a better understanding of autoimmune diseases.\n\nAutoimmune diseases are mostly characterized by autoantibodies in the patients' serum or cerebrospinal fluid, representing diagnostic or prognostic biomarkers. For decades, research has focused on single autoantigens or panels of single autoantigens. In this article, we advocate to broaden the focus by addressing the entire autoantigen repertoire in a systemic \"omics-like\" way. This approach aims to capture the enormous biodiversity in the sets of targeted antigens and pave the way toward a more holistic understanding of the concerted character of antibody-related humoral immune responses. Ongoing technological progress permits high-throughput screenings of thousands of autoantigens in parallel, e.g., via protein microarrays, phage display, or immunoprecipitation with mass spectrometry.\n\n||| HOMEPAGE MISSING!",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31838165",
    "lastUpdate": "2020-01-14T20:08:23Z",
    "name": "autoantigenomics",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.AUTREV.2019.102450",
            "metadata": {
                "abstract": "© 2019 Elsevier B.V.Autoimmune diseases are mostly characterized by autoantibodies in the patients' serum or cerebrospinal fluid, representing diagnostic or prognostic biomarkers. For decades, research has focused on single autoantigens or panels of single autoantigens. In this article, we advocate to broaden the focus by addressing the entire autoantigen repertoire in a systemic “omics-like” way. This approach aims to capture the enormous biodiversity in the sets of targeted antigens and pave the way toward a more holistic understanding of the concerted character of antibody-related humoral immune responses. Ongoing technological progress permits high-throughput screenings of thousands of autoantigens in parallel, e.g., via protein microarrays, phage display, or immunoprecipitation with mass spectrometry. We argue that the time is right for combining omics and autoantibody screening approaches into “autoantigenomics” as a novel omics subcategory. In this article, we introduce the concept of autoantigenomics, describe its roots and application options, and demarcate the method from related holistic approaches such as systems serology or immune-related transcriptomics and proteomics. We suggest the following extendable method set to be applied to autoantigen repertoires: (1) principal component analysis, (2) hierarchical cluster analysis, (3) partial least-square discriminant analysis or orthogonal projections to latent structures discriminant analysis, (4) analysis of the repertoire sizes in disease groups and clinical subgroups, (5) overrepresentation analyses using databases like those of Gene Ontology, Reactome Pathway, or DisGeNET, (6) analysis of pathways that are significantly targeted by specific repertoires, and (7) machine learning approaches. In an unsupervised way, these methods can identify clusters of autoantigens sharing certain functional or spatial properties, or clusters of patients comprising clinical subgroups potentially useful for patient stratification. In a supervised way, these methods can lead to prediction models that may eventually assist diagnosis and prognosis. The untargeted autoantigenomics approach allows for the systematic survey of antibody-related humoral immune responses. This may enhance our understanding of autoimmune diseases in a more comprehensive way compared to current single or panel autoantibodies approaches.",
                "authors": [
                    {
                        "name": "Moritz C.P."
                    },
                    {
                        "name": "Paul S."
                    },
                    {
                        "name": "Stoevesandt O."
                    },
                    {
                        "name": "Tholance Y."
                    },
                    {
                        "name": "Camdessanche J.-P."
                    },
                    {
                        "name": "Antoine J.-C."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Autoimmunity Reviews",
                "title": "Autoantigenomics: Holistic characterization of autoantigen repertoires for a better understanding of autoimmune diseases"
            },
            "pmid": "31838165"
        }
    ],
    "topic": [
        {
            "term": "Biodiversity",
            "uri": "http://edamontology.org/topic_3050"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ]
}