{
    "additionDate": "2021-01-18T10:12:52Z",
    "biotoolsCURIE": "biotools:pyspawn",
    "biotoolsID": "pyspawn",
    "confidence_flag": "tool",
    "description": "Software for Nonadiabatic Quantum Molecular Dynamics.\n\nThe ab initio multiple spawning (AIMS) method enables nonadiabatic quantum molecular dynamics simulations in an arbitrary number of dimensions, with potential energy surfaces provided by electronic structure calculations performed on-the-fly. However, the intricacy of the AIMS algorithm complicates software development, deployment on modern shared computer resources, and postsimulation data analysis. PySpawn is a nonadiabatic molecular dynamics software package that addresses these issues. The program is designed to be easily interfaced with electronic structure software, and an interface to the TeraChem software package is described here. PySpawn introduces a task-based reorganization of the AIMS algorithm, allowing fine-grained restart capability and setting the stage for efficient parallelization in a future release",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Molecular surface calculation",
                    "uri": "http://edamontology.org/operation_0387"
                },
                {
                    "term": "Simulation analysis",
                    "uri": "http://edamontology.org/operation_0244"
                }
            ]
        }
    ],
    "homepage": "https://github.com/blevine37/pySpawn17",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-31T10:55:18Z",
    "name": "PySpawn",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1021/ACS.JCTC.0C00575",
            "metadata": {
                "abstract": "Copyright © 2020 American Chemical Society.The ab initio multiple spawning (AIMS) method enables nonadiabatic quantum molecular dynamics simulations in an arbitrary number of dimensions, with potential energy surfaces provided by electronic structure calculations performed on-the-fly. However, the intricacy of the AIMS algorithm complicates software development, deployment on modern shared computer resources, and postsimulation data analysis. PySpawn is a nonadiabatic molecular dynamics software package that addresses these issues. The program is designed to be easily interfaced with electronic structure software, and an interface to the TeraChem software package is described here. PySpawn introduces a task-based reorganization of the AIMS algorithm, allowing fine-grained restart capability and setting the stage for efficient parallelization in a future release. PySpawn includes a user-friendly and interactive Python analysis module that will enable novice users to painlessly adopt AIMS. As a demonstration of PySpawn's simulation capability and analysis module, we report complete active space self-consistent field-based AIMS simulations of the 1,2-dithienyl-1,2-dicyanoethene molecule, a promising molecular photoswitch.",
                "authors": [
                    {
                        "name": "Fales B.S."
                    },
                    {
                        "name": "Fedorov D.A."
                    },
                    {
                        "name": "Levine B.G."
                    },
                    {
                        "name": "Martinez T.J."
                    },
                    {
                        "name": "Seritan S."
                    }
                ],
                "citationCount": 2,
                "date": "2020-09-08T00:00:00Z",
                "journal": "Journal of Chemical Theory and Computation",
                "title": "PySpawn: Software for Nonadiabatic Quantum Molecular Dynamics"
            },
            "pmid": "32687710"
        }
    ],
    "topic": [
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
