{
    "name": "QuadGT", 
    "description": "Software package for calling single-nucleotide variants in four sequenced genomes: normal-tumor pairs coupled with parents. Genotypes are inferred using a joint model of parental variant frequencies, de novo germline mutations, and somatic mutations. The model quantifies the descent-by-modification relationships between the unknown genotypes by using a set of parameters in a Bayesian inference setting.", 
    "homepage": "http://www.iro.umontreal.ca/%7Ecsuros/quadgt/", 
    "biotoolsID": "quadgt", 
    "biotoolsCURIE": "biotools:quadgt", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3227", 
                    "term": "Variant calling"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0484", 
                    "term": "SNP detection"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_2885", 
            "term": "DNA polymorphism"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "Java"
    ], 
    "license": "BSD-4-Clause", 
    "collectionID": [], 
    "maturity": "Mature", 
    "cost": "Free of charge", 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [
        {
            "url": "http://www.iro.umontreal.ca/~csuros/quadgt/dist/QuadGT.jar", 
            "type": "Source package", 
            "note": null, 
            "version": null
        }
    ], 
    "documentation": [
        {
            "url": "http://www.iro.umontreal.ca/~csuros/quadgt/quadgt-usage.pdf", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1186/1471-2105-14-S5-S3", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "Joint genotype inference with germline and somatic mutations", 
                "abstract": "The joint sequencing of related genomes has become an important means to discover rare variants. Normal-tumor genome pairs are routinely sequenced together to find somatic mutations and their associations with different cancers. Parental and sibling genomes reveal de novo germline mutations and inheritance patterns related to Mendelian diseases.Acute lymphoblastic leukemia (ALL) is the most common paediatric cancer and the leading cause of cancer-related death among children. With the aim of uncovering the full spectrum of germline and somatic genetic alterations in childhood ALL genomes, we conducted whole-exome re-sequencing on a unique cohort of over 120 exomes of childhood ALL quartets, each comprising a patient's tumor and matched-normal material, and DNA from both parents. We developed a general probabilistic model for such quartet sequencing reads mapped to the reference human genome. The model is used to infer joint genotypes at homologous loci across a normal-tumor genome pair and two parental genomes.We describe the algorithms and data structures for genotype inference, model parameter training. We implemented the methods in an open-source software package (QUADGT) that uses the standard file formats of the 1000 Genomes Project. Our method's utility is illustrated on quartets from the ALL cohort. © 2013 Bareke et al.; licensee BioMed Central Ltd.", 
                "date": "2013-04-10T00:00:00Z", 
                "citationCount": 4, 
                "authors": [
                    {
                        "name": "Bareke E."
                    }, 
                    {
                        "name": "Saillour V."
                    }, 
                    {
                        "name": "Spinella J.-F."
                    }, 
                    {
                        "name": "Vidal R."
                    }, 
                    {
                        "name": "Healy J."
                    }, 
                    {
                        "name": "Sinnett D."
                    }, 
                    {
                        "name": "Csuros M."
                    }
                ], 
                "journal": "BMC Bioinformatics"
            }
        }
    ], 
    "credit": [], 
    "owner": "seqwiki_import", 
    "additionDate": "2017-01-13T13:16:00Z", 
    "lastUpdate": "2019-07-22T17:51:22Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 0, 
    "homepage_status": 0, 
    "elixir_badge": 0
}