
{
    "credit": [
        {
            "email": "sray@jhmi.edu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://sray.med.som.jhmi.edu/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://sray.med.som.jhmi.edu/SCRoftware/simplot/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Recombination detection",
                    "uri": "http://edamontology.org/operation_0451"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Windows"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            },
            {
                "term": "DNA replication and recombination",
                "uri": "http://edamontology.org/topic_3127"
            },
            {
                "term": "Virology",
                "uri": "http://edamontology.org/topic_0781"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/simplot-3-5-1-sequence-similarity-plotting.html"
        }
    ],
    "publication": [
        {
            "abstract": "The development of an effective human immunodeficiency virus type 1 (HIV-1) vaccine is likely to depend on knowledge of circulating variants of genes other than the commonly sequenced gag and env genes. In addition, full- genome data are particularly limited for HIV-1 subtype C, currently the most commonly transmitted subtype in India and worldwide. Likewise, little is known about sequence variation of HIV-1 in India, the country facing the largest burden of HIV worldwide. Therefore, the objective of this study was to clone and characterize the complete genome of HIV-1 from seroconverters infected with subtype C variants in India. Cocultured HIV-1 isolates were obtained from six seroincident individuals from Pune, India, and virtually full-length HIV-1 genomes were amplified, cloned, and sequenced from each. Sequence analysis revealed that five of the six genomes were of subtype C, while one was a mosaic of subtypes A and C, with multiple breakpoints in env, nef, and the 3' long terminal repeat as determined by both maximal χ2 analysis and phylogenetic bootstrapping. Sequences were compared for preservation of known cytotoxic T lymphocyte (CTL) epitopes. Compared with those of the HIV-1(LAI) sequence, 38% of well-defined CTL epitopes were identical. The proportion of nonconservative substitutions for Env, at 61%, was higher (P < 0.001) than those for Gag (24%), Pol (18%), and Nef (32%). Therefore, characterized CTL epitopes demonstrated substantial differences from subtype B laboratory strains, which were most pronounced in Env. Because these clones were obtained from Indian seroconverters, they are likely to facilitate vaccine-related efforts in India by providing potential antigens for vaccine candidates as well as for assays of vaccine responsiveness.",
            "authors": [
                "Lole K.S.",
                "Bollinger R.C.",
                "Paranjape R.S.",
                "Gadkari D.",
                "Kulkarni S.S.",
                "Novak N.G.",
                "Ingersoll R.",
                "Sheppard H.W.",
                "Ray S.C."
            ],
            "cit_count": 1654,
            "journal": "Journal of Virology",
            "pmid": "9847317",
            "title": "Full-length human immunodeficiency virus type 1 genomes from subtype C- infected seroconverters in India, with evidence of intersubtype recombination",
            "year": "1999-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:simplot",
        "biotoolsID": "simplot",
        "description": "A popular tool for recombination analysis.",
        "homepage": "http://sray.med.som.jhmi.edu/SCRoftware/simplot/",
        "name": "SimPlot"
    }
}