{
    "additionDate": "2024-01-22T09:35:37.437811Z",
    "biotoolsCURIE": "biotools:o_glythr",
    "biotoolsID": "o_glythr",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "fengpengmian@gmail.com",
            "name": "Pengmian Feng"
        }
    ],
    "description": "Prediction of human O-linked threonine glycosites using multi-feature fusion.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "PTM localisation",
                    "uri": "http://edamontology.org/operation_3755"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                }
            ]
        }
    ],
    "homepage": "http://cbcb.cdutcm.edu.cn/O-GlyThr/",
    "lastUpdate": "2024-01-22T09:35:37.440296Z",
    "name": "O-GlyThr",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.IJBIOMAC.2023.124761",
            "metadata": {
                "abstract": "O-linked glycosylation is one of the most complex post-translational modifications (PTM) of human proteins modulating various cellular metabolic and signaling pathways. Unlike N-glycosylation, the O-glycosylation has non-specific sequence features and unstable glycan core structure, which makes identification of O-glycosites more challenging either by experimental or computational methods. Biochemical experiments to identify O-glycosites in batches are technically and economically demanding. Therefore, development of computation-based methods is greatly warranted. This study constructed a prediction model based on feature fusion for O-glycosites linked to the threonine residues in Homo sapiens. In the training model, we collected and sorted out high-quality human protein data with O-linked threonine glycosites. Seven feature coding methods were fused to represent the sample sequence. By comparison of different algorithms, random forest was selected as the final classifier to construct the classification model. Through 5-fold cross-validation, the proposed model, namely O-GlyThr, performed satisfactorily on both training set (AUC: 0.9308) and independent validation dataset (AUC: 0.9323). Compared with previously published predictors, O-GlyThr achieved the highest ACC of 0.8475 on the independent test dataset. These results demonstrated the high competency of our predictor in identifying O-glycosites on threonine residues. Furthermore, a user-friendly webserver named O-GlyThr (http://cbcb.cdutcm.edu.cn/O-GlyThr/) was developed to assist glycobiologists in the research associated with glycosylation structure and function.",
                "authors": [
                    {
                        "name": "Feng P."
                    },
                    {
                        "name": "Tang H."
                    },
                    {
                        "name": "Tang Q."
                    },
                    {
                        "name": "Zhang Q."
                    }
                ],
                "date": "2023-07-01T00:00:00Z",
                "journal": "International Journal of Biological Macromolecules",
                "title": "O-GlyThr: Prediction of human O-linked threonine glycosites using multi-feature fusion"
            },
            "pmid": "37156312"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        }
    ]
}
