{
    "additionDate": "2021-09-08T13:57:13Z",
    "biotoolsCURIE": "biotools:discount-kmer",
    "biotoolsID": "discount-kmer",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "johan@jnpersson.com",
            "name": "Johan Nyström-Persson",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Discount is a Spark-based tool for k-mer counting, and for analysis of minimizer orderings. It is able to analyse large metagenomic-scale datasets while having a small memory footprint.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                },
                {
                    "term": "k-mer counting",
                    "uri": "http://edamontology.org/operation_3472"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jtnystrom/discount",
    "language": [
        "Java",
        "Scala"
    ],
    "lastUpdate": "2024-11-24T20:19:37.286203Z",
    "license": "GPL-3.0",
    "name": "Discount",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btab156",
            "metadata": {
                "abstract": "Motivation: The processing of k-mers (subsequences of length k) is at the foundation of many sequence processing algorithms in bioinformatics, including k-mer counting for genome size estimation, genome assembly, and taxonomic classification for metagenomics. Minimizers - ordered m-mers where m < k - are often used to group k-mers into bins as a first step in such processing. However, minimizers are known to generate bins of very different sizes, which can pose challenges for distributed and parallel processing, as well as generally increase memory requirements. Furthermore, although various minimizer orderings have been proposed, their practical value for improving tool efficiency has not yet been fully explored. Results: We present Discount, a distributed k-mer counting tool based on Apache Spark, which we use to investigate the behaviour of various minimizer orderings in practice when applied to metagenomics data. Using this tool, we then introduce the universal frequency ordering, a new combination of frequency-sampled minimizers and universal k-mer hitting sets, which yields both evenly distributed binning and small bin sizes. We show that this ordering allows Discount to perform distributed k-mer counting on a large dataset in as little as 1/8 of the memory of comparable approaches, making it the most efficient out-of-core distributed k-mer counting method available.",
                "authors": [
                    {
                        "name": "Keeble-Gagnere G."
                    },
                    {
                        "name": "Nystrom-Persson J."
                    },
                    {
                        "name": "Zawad N."
                    }
                ],
                "citationCount": 14,
                "date": "2021-09-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Compact and evenly distributed k-mer binning for genomic sequences"
            },
            "pmcid": "PMC8428581",
            "pmid": "33693556",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Script"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
