{
    "additionDate": "2021-01-18T11:31:14Z",
    "biotoolsCURIE": "biotools:deep-drm",
    "biotoolsID": "deep-drm",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "liangcheng@hrbmu.edu.cn",
            "name": "Liang Cheng",
            "typeEntity": "Person"
        }
    ],
    "description": "Deep-DRM is a computational Method for Identifying Dis-ease-related Metabolites based on Graph Deep Learning Approaches",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/zty2009/GPDNN-for-Identify-ing-Disease-related-Metabolites",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-24T14:55:36Z",
    "name": "Deep-DRM",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAA212",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.MOTIVATION: The functional changes of the genes, RNAs and proteins will eventually be reflected in the metabolic level. Increasing number of researchers have researched mechanism, biomarkers and targeted drugs by metabolites. However, compared with our knowledge about genes, RNAs, and proteins, we still know few about diseases-related metabolites. All the few existed methods for identifying diseases-related metabolites ignore the chemical structure of metabolites, fail to recognize the association pattern between metabolites and diseases, and fail to apply to isolated diseases and metabolites. RESULTS: In this study, we present a graph deep learning based method, named Deep-DRM, for identifying diseases-related metabolites. First, chemical structures of metabolites were used to calculate similarities of metabolites. The similarities of diseases were obtained based on their functional gene network and semantic associations. Therefore, both metabolites and diseases network could be built. Next, Graph Convolutional Network (GCN) was applied to encode the features of metabolites and diseases, respectively. Then, the dimension of these features was reduced by Principal components analysis (PCA) with retainment 99% information. Finally, Deep neural network was built for identifying true metabolite-disease pairs (MDPs) based on these features. The 10-cross validations on three testing setups showed outstanding AUC (0.952) and AUPR (0.939) of Deep-DRM compared with previous methods and similar approaches. Ten of top 15 predicted associations between diseases and metabolites got support by other studies, which suggests that Deep-DRM is an efficient method to identify MDPs. CONTACT: liangcheng@hrbmu.edu.cn. AVAILABILITY AND IMPLEMENTATION: https://github.com/zty2009/GPDNN-for-Identify-ing-Disease-related-Metabolites.",
                "authors": [
                    {
                        "name": "Zhao T."
                    },
                    {
                        "name": "Hu Y."
                    },
                    {
                        "name": "Cheng L."
                    }
                ],
                "citationCount": 13,
                "date": "2021-07-20T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "Deep-DRM: a computational method for identifying disease-related metabolites based on graph deep learning approaches"
            },
            "pmid": "33048110"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}