{
    "additionDate": "2017-08-03T18:59:04Z",
    "biotoolsCURIE": "biotools:sase-hunter",
    "biotoolsID": "sase-hunter",
    "credit": [
        {
            "email": "subhajyoti.de@rutgers.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.sjdlab.org/"
        }
    ],
    "description": "Software to identify regions of interest with a higher than expected number of mutations than the near-by regions.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/kylessmith/SASE-hunter"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Polymorphism detection",
                    "uri": "http://edamontology.org/operation_3202"
                }
            ]
        }
    ],
    "homepage": "http://www.sjdlab.org/resources/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/sase-hunter-signatures-of-accelerated-somatic-evolution-hunter.html"
        }
    ],
    "name": "SASE-hunter",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2015 The Author(s).Cancer-associated somatic mutations outside protein-coding regions remain largely unexplored. Analyses of the TERT locus have indicated that non-coding regulatory mutations can be more frequent than previously suspected and play important roles in oncogenesis. Using a computational method called SASE-hunter, developed here, we identified a novel signature of accelerated somatic evolution (SASE) marked by a significant excess of somatic mutations localized in a genomic locus, and prioritized those loci that carried the signature in multiple cancer patients. Interestingly, even when an affected locus carried the signature in multiple individuals, the mutations contributing to SASE themselves were rarely recurrent at the base-pair resolution. In a pan-cancer analysis of 906 samples from 12 tumor types, we detected SASE in the promoters of several genes, including known cancer genes such as MYC, BCL2, RBM5 and WWOX. Nucleotide substitution patterns consistent with oxidative DNA damage and local somatic hypermutation appeared to contribute to this signature in selected gene promoters (e.g. MYC). SASEs in selected cancer gene promoters were associated with over-expression, and also correlated with the age of onset of cancer, aggressiveness of the disease and survival. Taken together, our work detects a hitherto under-appreciated and clinically important class of regulatory changes in cancer genomes.",
                "authors": [
                    {
                        "name": "De S."
                    },
                    {
                        "name": "Geraci M.W."
                    },
                    {
                        "name": "Pedersen B.S."
                    },
                    {
                        "name": "Pollard K.S."
                    },
                    {
                        "name": "Shaknovich R."
                    },
                    {
                        "name": "Smith K.S."
                    },
                    {
                        "name": "Yadav V.K."
                    }
                ],
                "citationCount": 21,
                "date": "2015-04-17T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Signatures of accelerated somatic evolution in gene promoters in multiple cancer types"
            },
            "pmid": "25934800"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA mutation",
            "uri": "http://edamontology.org/topic_2533"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1
}
