{
    "additionDate": "2018-06-04T20:21:10Z",
    "biotoolsCURIE": "biotools:parbibit",
    "biotoolsID": "parbibit",
    "credit": [
        {
            "email": "jgonzalezd@udc.es",
            "name": "Jorge González-Domínguez",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Parallel tool to accelerate the search of biclusters on binary datasets, especially useful for gene expression data. This tool receives as input the expression values of n genes and m samples in a file with ARFF extension and returns a file with the biclustering information.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/projects/parbibit/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "ParBiBit",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0194361",
            "metadata": {
                "abstract": "© 2018 González-Domínguez, Expósito.This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Biclustering techniques are gaining attention in the analysis of large-scale datasets as they identify two-dimensional submatrices where both rows and columns are correlated. In this work we present ParBiBit, a parallel tool to accelerate the search of interesting biclusters on binary datasets, which are very popular on different fields such as genetics, marketing or text mining. It is based on the state-of-the-art sequential Java tool BiBit, which has been proved accurate by several studies, especially on scenarios that result on many large biclusters. ParBiBit uses the same methodology as BiBit (grouping the binary information into patterns) and provides the same results. Nevertheless, our tool significantly improves performance thanks to an efficient implementation based on C++11 that includes support for threads and MPI processes in order to exploit the compute capabilities of modern distributed- memory systems, which provide several multicore CPU nodes interconnected through a network. Our performance evaluation with 18 representative input datasets on two different eight-node systems shows that our tool is significantly faster than the original BiBit.",
                "authors": [
                    {
                        "name": "Gonzalez-Domonguez J."
                    },
                    {
                        "name": "Sito R.R.E."
                    }
                ],
                "citationCount": 4,
                "date": "2018-04-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "ParBiBit: Parallel tool for binary biclustering on modern distributed-memory systems"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1
}