{
    "additionDate": "2020-01-09T18:32:59Z",
    "biotoolsCURIE": "biotools:DR-thermo",
    "biotoolsID": "DR-thermo",
    "confidence_flag": "tool",
    "description": "Thermodynamically Consistent Estimation of Gibbs Free Energy from Data.\n\nThe DR-thermo algorithm can be used to curate experimental thermodynamic data from different sources to generate reliable data-banks such that all measurements are modified to be thermodynamically consistent and any missing reaction or formation Gibbs energies can be predicted either directly or using group contributions.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/samansalike/DR-thermo",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2020-12-22T10:46:35Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/samansalike/DR-thermo/issues"
        }
    ],
    "name": "DR-thermo",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ741",
            "metadata": {
                "abstract": "© 2020 Oxford University Press. All rights reserved.Motivation: Thermodynamic analysis of biological reaction networks requires the availability of accurate and consistent values of Gibbs free energies of reaction and formation. These Gibbs energies can be measured directly via the careful design of experiments or can be computed from the curated Gibbs free energy databases. However, the computed Gibbs free energies of reactions and formations do not satisfy the thermodynamic constraints due to the compounding effect of measurement errors in the experimental data. The propagation of these errors can lead to a false prediction of pathway feasibility and uncertainty in the estimation of thermodynamic parameters. Results: This work proposes a data reconciliation framework for thermodynamically consistent estimation of Gibbs free energies of reaction, formation and group contributions from experimental data. In this framework, we formulate constrained optimization problems that reduce measurement errors and their effects on the estimation of Gibbs energies such that the thermodynamic constraints are satisfied. When a subset of Gibbs free energies of formations is unavailable, it is shown that the accuracy of their resulting estimates is better than that of existing empirical prediction methods. Moreover, we also show that the estimation of group contributions can be improved using this approach. Further, we provide guidelines based on this approach for performing systematic experiments to estimate unknown Gibbs formation energies. Availability and implementation: The MATLAB code for the executing the proposed algorithm is available for free on the GitHub repository: https://github.com/samansalike/DR-thermo.",
                "authors": [
                    {
                        "name": "Salike S."
                    },
                    {
                        "name": "Bhatt N."
                    }
                ],
                "citationCount": 1,
                "date": "2020-02-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Thermodynamically consistent estimation of Gibbs free energy from data: Data reconciliation approach"
            },
            "pmid": "31584610"
        }
    ],
    "topic": [
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        }
    ],
    "validated": 1
}