{
    "accessibility": "Open access",
    "additionDate": "2022-10-19T20:05:22.546887Z",
    "biotoolsCURIE": "biotools:mca",
    "biotoolsID": "mca",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "zpstat@xzhmu.edu.cn",
            "name": "Ping Zeng",
            "typeEntity": "Person"
        },
        {
            "name": "Jiahao Qiao"
        },
        {
            "name": "Shuiping Huang"
        },
        {
            "name": "Ting Wang"
        },
        {
            "name": "Yuchen Zhang"
        },
        {
            "name": "Zhonghe Shao"
        }
    ],
    "description": "A comprehensive comparison of multilocus association methods with summary statistics in genome-wide association studies.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Collapsing methods",
                    "uri": "http://edamontology.org/operation_3791"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://github.com/biostatpzeng/MCA",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T15:26:38.131727Z",
    "license": "Not licensed",
    "name": "MCA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/s12859-022-04897-3",
            "metadata": {
                "abstract": "Background: Multilocus analysis on a set of single nucleotide polymorphisms (SNPs) pre-assigned within a gene constitutes a valuable complement to single-marker analysis by aggregating data on complex traits in a biologically meaningful way. However, despite the existence of a wide variety of SNP-set methods, few comprehensive comparison studies have been previously performed to evaluate the effectiveness of these methods. Results: We herein sought to fill this knowledge gap by conducting a comprehensive empirical comparison for 22 commonly-used summary-statistics based SNP-set methods. We showed that only seven methods could effectively control the type I error, and that these well-calibrated approaches had varying power performance under the simulation scenarios. Overall, we confirmed that the burden test was generally underpowered and score-based variance component tests (e.g., sequence kernel association test) were much powerful under the polygenic genetic architecture in both common and rare variant association analyses. We further revealed that two linkage-disequilibrium-free P value combination methods (e.g., harmonic mean P value method and aggregated Cauchy association test) behaved very well under the sparse genetic architecture in simulations and real-data applications to common and rare variant association analyses as well as in expression quantitative trait loci weighted integrative analysis. We also assessed the scalability of these approaches by recording computational time and found that all these methods can be scalable to biobank-scale data although some might be relatively slow. Conclusion: In conclusion, we hope that our findings can offer an important guidance on how to choose appropriate multilocus association analysis methods in post-GWAS era. All the SNP-set methods are implemented in the R package called MCA, which is freely available at https://github.com/biostatpzeng/.",
                "authors": [
                    {
                        "name": "Huang S."
                    },
                    {
                        "name": "Qiao J."
                    },
                    {
                        "name": "Shao Z."
                    },
                    {
                        "name": "Wang T."
                    },
                    {
                        "name": "Zeng P."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "citationCount": 6,
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "A comprehensive comparison of multilocus association methods with summary statistics in genome-wide association studies"
            },
            "pmcid": "PMC9429742",
            "pmid": "36042399"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
