{
    "additionDate": "2018-05-17T17:31:19Z",
    "biotoolsCURIE": "biotools:cgrnb",
    "biotoolsID": "cgrnb",
    "credit": [
        {
            "email": "xuhuayong@gmail.com",
            "name": "Webmaster",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A web server for building combinatorial gene regulatory networks through integrated engineering of seed-matching sequence information and gene expression datasets.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://www.scbit.org/cgrnb/faq.htm"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                }
            ]
        }
    ],
    "homepage": "https://www.scbit.org/cgrnb/",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "cGRNB",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/1752-0509-7-S2-S7",
            "metadata": {
                "abstract": "© 2013 Xu et al.Background: We are witnessing rapid progress in the development of methodologies for building the combinatorial gene regulatory networks involving both TFs (Transcription Factors) and miRNAs (microRNAs). There are a few tools available to do these jobs but most of them are not easy to use and not accessible online. A web server is especially needed in order to allow users to upload experimental expression datasets and build combinatorial regulatory networks corresponding to their particular contexts. Methods: In this work, we compiled putative TF-gene, miRNA-gene and TF-miRNA regulatory relationships from forward-engineering pipelines and curated them as built-in data libraries. We streamlined the R codes of our two separate forward-and-reverse engineering algorithms for combinatorial gene regulatory network construction and formalized them as two major functional modules. As a result, we released the cGRNB (combinatorial Gene Regulatory Networks Builder): a web server for constructing combinatorial gene regulatory networks through integrated engineering of seed-matching sequence information and gene expression datasets. The cGRNB enables two major network-building modules, one for MPGE (miRNA-perturbed gene expression) datasets and the other for parallel miRNA/mRNA expression datasets. A miRNA-centered two-layer combinatorial regulatory cascade is the output of the first module and a comprehensive genome-wide network involving all three types of combinatorial regulations (TF-gene, TF-miRNA, and miRNA-gene) are the output of the second module. Conclusions: In this article we propose cGRNB, a web server for building combinatorial gene regulatory networks through integrated engineering of seed-matching sequence information and gene expression datasets. Since parallel miRNA/mRNA expression datasets are rapidly accumulated by the advance of next-generation sequencing techniques, cGRNB will be very useful tool for researchers to build combinatorial gene regulatory networks based on expression datasets. The cGRNB web-server is free and available online at http://www.scbit.org/cgrnb.",
                "authors": [
                    {
                        "name": "Xu H."
                    },
                    {
                        "name": "Yu H."
                    },
                    {
                        "name": "Tu K."
                    },
                    {
                        "name": "Shi Q."
                    },
                    {
                        "name": "Wei C."
                    },
                    {
                        "name": "Li Y.-Y."
                    },
                    {
                        "name": "Li Y.-X."
                    }
                ],
                "citationCount": 11,
                "date": "2013-01-01T00:00:00Z",
                "journal": "BMC Systems Biology",
                "title": "cGRNB: A web server for building combinatorial gene regulatory networks through integrated engineering of seed-matching sequence information and gene expression datasets"
            },
            "pmcid": "PMC3851836",
            "pmid": "24565134"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        }
    ],
    "validated": 1
}