{
    "name": "SHARCGS", 
    "description": "Tool for fully exploiting novel sequencing technologies by assembling sequence contigs de novo with high confidence and by outperforming existing assembly algorithms in terms of speed and accuracy.", 
    "homepage": "http://sharcgs.molgen.mpg.de/", 
    "biotoolsID": "sharcgs", 
    "biotoolsCURIE": "biotools:sharcgs", 
    "version": [], 
    "otherID": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0310", 
                    "term": "Sequence assembly"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0196", 
            "term": "Sequence assembly"
        }
    ], 
    "operatingSystem": [
        "Linux"
    ], 
    "language": [
        "Perl"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "http://sharcgs.molgen.mpg.de/", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "17908823", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "SHARCGS, a fast and highly accurate short-read assembly algorithm for de novo genomic sequencing", 
                "abstract": "The latest revolution in the DNA sequencing field has been brought about by the development of automated sequencers that are capable of generating giga base pair data sets quickly and at low cost. Applications of such technologies seem to be limited to resequencing and transcript discovery, due to the shortness of the generated reads. In order to extend the fields of application to de novo sequencing, we developed the SHARCGS algorithm to assemble short-read (25-40-mer) data with high accuracy and speed. The efficiency of SHARCGS was tested on BAC inserts from three eukaryotic species, on two yeast chromosomes, and on two bacterial genomes (Haemophilus influenzae, Escherichia coli). We show that 30-mer-based BAC assemblies have N50 sizes >20 kbp for Drosophila and Arabidopsis and >4 kbp for human in simulations taking missing reads and wrong base calls into account. We assembled 949,974 contigs with length >50 bp, and only one single contig could not be aligned error-free against the reference sequences. We generated 36-mer reads for the genome of Helicobacter acinonychis on the Illumina 1G sequencing instrument and assembled 937 contigs covering 98% of the genome with an N50 size of 3.7 kbp. With the exception of five contigs that differ in 1-4 positions relative to the reference sequence, all contigs matched the genome error-free. Thus, SHARCGS is a suitable tool for fully exploiting novel sequencing technologies by assembling sequence contigs de novo with high confidence and by outperforming existing assembly algorithms in terms of speed and accuracy. ©2007 by Cold Spring Harbor Laboratory Press.", 
                "date": "2007-11-01T00:00:00Z", 
                "citationCount": 181, 
                "authors": [
                    {
                        "name": "Dohm J.C."
                    }, 
                    {
                        "name": "Lottaz C."
                    }, 
                    {
                        "name": "Borodina T."
                    }, 
                    {
                        "name": "Himmelbauer H."
                    }
                ], 
                "journal": "Genome Research"
            }
        }
    ], 
    "credit": [], 
    "owner": "seqwiki_import", 
    "additionDate": "2017-01-13T13:16:26Z", 
    "lastUpdate": "2018-12-10T12:58:53Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0
}