
{
    "credit": [
        {
            "email": "zhangyijing@sibs.ac.cn",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://bioinfo.sibs.ac.cn/zhanglab/"
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://bioinfo.sibs.ac.cn/carmo/manual.php"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Annotation",
                    "uri": "http://edamontology.org/operation_0226"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Preclinical and clinical studies",
                "uri": "http://edamontology.org/topic_3379"
            },
            {
                "term": "Omics",
                "uri": "http://edamontology.org/topic_3391"
            },
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/carmo-comprehensive-annotation-of-rice-multi-omics.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2015 The Authors The Plant Journal © 2015 John Wiley & Sons Ltd. Summary High-throughput technology is gradually becoming a powerful tool for routine research in rice. Interpretation of biological significance from the huge amount of data is a critical but non-trivial task, especially for rice, for which gene annotations rely heavily on sequence similarity rather than direct experimental evidence. Here we describe the annotation platform for comprehensive annotation of rice multi-omics data (CARMO), which provides multiple web-based analysis tools for in-depth data mining and visualization. The central idea involves systematic integration of 1819 samples from omics studies and diverse sources of functional evidence (15 401 terms), which are further organized into gene sets and higher-level gene modules. In this way, the high-throughput data may easily be compared across studies and platforms, and integration of multiple types of evidence allows biological interpretation from the level of gene functional modules with high confidence. In addition, the functions and pathways for thousands of genes lacking description or validation may be deduced based on concerted expression of genes within the constructed co-expression networks or gene modules. Overall, CARMO provides comprehensive annotations for transcriptomic datasets, epi-genomic modification sites, single nucleotide polymorphisms identified from genome re-sequencing, and the large gene lists derived from these omics studies. Well-organized results, as well as multiple tools for interactive visualization, are available through a user-friendly web interface. Finally, we illustrate how CARMO enables biological insights using four examples, demonstrating that CARMO is a highly useful resource for intensive data mining and hypothesis generation based on rice multi-omics data. CARMO is freely available online (http://bioinfo.sibs.ac.cn/carmo).",
            "authors": [
                "Wang J.",
                "Qi M.",
                "Liu J.",
                "Zhang Y."
            ],
            "cit_count": 13,
            "journal": "Plant Journal",
            "pmid": "26040787",
            "title": "CARMO: A comprehensive annotation platform for functional exploration of rice multi-omics data",
            "year": "2015-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:carmo",
        "biotoolsID": "carmo",
        "description": "Web-based platform providing comprehensive annotations for multi-omics data, including transcriptomic data sets, epi-genomic modification sites, SNPs from genome re-sequencing, and the large gene lists derived from these omics studies.",
        "homepage": "http://bioinfo.sibs.ac.cn/carmo/",
        "name": "CARMO"
    }
}