{
    "additionDate": "2021-12-06T08:50:12.850453Z",
    "biotoolsCURIE": "biotools:smalf",
    "biotoolsID": "smalf",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "leideng@csu.edu.cn",
            "name": "Lei Deng",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "SMALF is a miRNA-disease associations prediction tool based on stacked autoencoder and XGBoost. Identifying miRNA and disease associations helps us understand disease mechanisms of action from the molecular level. However, it is usually blind, time-consuming, and small-scale based on biological experiments. Hence, developing computational methods to predict unknown miRNA and disease associations is becoming increasingly important.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                }
            ]
        }
    ],
    "homepage": "https://github.com/dayunliu/SMALF",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-12-06T08:50:12.853121Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/dayunliu/SMALF/issues"
        }
    ],
    "name": "SMALF",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04135-2",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Identifying miRNA and disease associations helps us understand disease mechanisms of action from the molecular level. However, it is usually blind, time-consuming, and small-scale based on biological experiments. Hence, developing computational methods to predict unknown miRNA and disease associations is becoming increasingly important. Results: In this work, we develop a computational framework called SMALF to predict unknown miRNA-disease associations. SMALF first utilizes a stacked autoencoder to learn miRNA latent feature and disease latent feature from the original miRNA-disease association matrix. Then, SMALF obtains the feature vector of representing miRNA-disease by integrating miRNA functional similarity, miRNA latent feature, disease semantic similarity, and disease latent feature. Finally, XGBoost is utilized to predict unknown miRNA-disease associations. We implement cross-validation experiments. Compared with other state-of-the-art methods, SAMLF achieved the best AUC value. We also construct three case studies, including hepatocellular carcinoma, colon cancer, and breast cancer. The results show that 10, 10, and 9 out of the top ten predicted miRNAs are verified in MNDR v3.0 or miRCancer, respectively. Conclusion: The comprehensive experimental results demonstrate that SMALF is effective in identifying unknown miRNA-disease associations.",
                "authors": [
                    {
                        "name": "Liu D."
                    },
                    {
                        "name": "Huang Y."
                    },
                    {
                        "name": "Nie W."
                    },
                    {
                        "name": "Zhang J."
                    },
                    {
                        "name": "Deng L."
                    }
                ],
                "citationCount": 3,
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SMALF: miRNA-disease associations prediction based on stacked autoencoder and XGBoost"
            },
            "pmcid": "PMC8082881",
            "pmid": "33910505",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}