{
    "additionDate": "2021-01-18T07:41:28Z",
    "biotoolsCURIE": "biotools:deeplytough",
    "biotoolsID": "deeplytough",
    "confidence_flag": "tool",
    "description": "DeeplyTough is a tool for Learning Structural Comparison of Protein Binding Sites",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein structure comparison",
                    "uri": "http://edamontology.org/operation_2487"
                },
                {
                    "term": "Protein secondary structure comparison",
                    "uri": "http://edamontology.org/operation_2488"
                },
                {
                    "term": "Protein-protein binding site prediction",
                    "uri": "http://edamontology.org/operation_2464"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BenevolentAI/DeeplyTough",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-27T14:12:50Z",
    "name": "DeeplyTough",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.9B00554",
            "metadata": {
                "abstract": "Copyright © 2020 American Chemical Society.Protein pocket matching, or binding site comparison, is of importance in drug discovery. Identification of similar binding pockets can help guide efforts for hit-finding, understanding polypharmacology, and characterization of protein function. The design of pocket matching methods has traditionally involved much intuition and has employed a broad variety of algorithms and representations of the input protein structures. We regard the high heterogeneity of past work and the recent availability of large-scale benchmarks as an indicator that a data-driven approach may provide a new perspective. We propose DeeplyTough, a convolutional neural network that encodes a three-dimensional representation of protein pockets into descriptor vectors that may be compared efficiently in an alignment-free manner by computing pairwise Euclidean distances. The network is trained with supervision (i) to provide similar pockets with similar descriptors, (ii) to separate the descriptors of dissimilar pockets by a minimum margin, and (iii) to achieve robustness to nuisance variations. We evaluate our method using three large-scale benchmark datasets, on which it demonstrates excellent performance for held-out data coming from the training distribution and competitive performance when the trained network is required to generalize to datasets constructed independently. DeeplyTough is available at http://github.com/BenevolentAI/DeeplyTough.",
                "authors": [
                    {
                        "name": "Simonovsky M."
                    },
                    {
                        "name": "Meyers J."
                    }
                ],
                "citationCount": 8,
                "date": "2020-04-27T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "Deeply Tough: Learning Structural Comparison of Protein Binding Sites"
            },
            "pmid": "32023053"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        }
    ]
}