{
    "additionDate": "2021-01-18T10:57:49Z",
    "biotoolsCURIE": "biotools:m3diseen",
    "biotoolsID": "m3diseen",
    "confidence_flag": "tool",
    "description": "A novel machine learning approach for predicting the 3D printability of medicines.\n\nSelect a tested drug product Example 1 Example 2 Example 3 Example 4 Load materials.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                }
            ]
        }
    ],
    "homepage": "http://m3diseen.com/predictions/",
    "lastUpdate": "2021-02-19T08:18:14Z",
    "name": "M3DISEEN",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/J.IJPHARM.2020.119837",
            "metadata": {
                "abstract": "© 2020 Elsevier B.V.Artificial intelligence (AI) has the potential to reshape pharmaceutical formulation development through its ability to analyze and continuously monitor large datasets. Fused deposition modeling (FDM) three-dimensional printing (3DP) has made significant advancements in the field of oral drug delivery with personalized drug-loaded formulations being designed, developed and dispensed for the needs of the patient. The FDM 3DP process begins with the production of drug-loaded filaments by hot melt extrusion (HME), followed by the printing of a drug product using a FDM 3D printer. However, the optimization of the fabrication parameters is a time-consuming, empirical trial approach, requiring expert knowledge. Here, M3DISEEN, a web-based pharmaceutical software, was developed to accelerate FDM 3D printing using AI machine learning techniques (MLTs). In total, 614 drug-loaded formulations were designed from a comprehensive list of 145 different pharmaceutical excipients, 3D printed and assessed in-house. To build the predictive tool, a dataset was constructed and models were trained and tested at a ratio of 75:25. Significantly, the AI models predicted key fabrication parameters with accuracies of 76% and 67% for the printability and the filament characteristics, respectively. Furthermore, the AI models predicted the HME and FDM processing temperatures with a mean absolute error of 8.9 °C and 8.3 °C, respectively. Strikingly, the AI models achieved high levels of accuracy by solely inputting the pharmaceutical excipient trade names. Therefore, AI provides an effective holistic modeling technology and software to streamline and advance 3DP as a significant technology within drug development. M3DISEEN is available at (http://m3diseen.com/predictions/).",
                "authors": [
                    {
                        "name": "Basit A.W."
                    },
                    {
                        "name": "Cabalar P."
                    },
                    {
                        "name": "Elbadawi M."
                    },
                    {
                        "name": "Gaisford S."
                    },
                    {
                        "name": "Gavins F.K.H."
                    },
                    {
                        "name": "Goyanes A."
                    },
                    {
                        "name": "Muniz Castro B."
                    },
                    {
                        "name": "Ong J.J."
                    },
                    {
                        "name": "Perez G."
                    }
                ],
                "citationCount": 37,
                "date": "2020-11-30T00:00:00Z",
                "journal": "International Journal of Pharmaceutics",
                "title": "M3DISEEN: A novel machine learning approach for predicting the 3D printability of medicines"
            },
            "pmid": "32961295"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Biotherapeutics",
            "uri": "http://edamontology.org/topic_3374"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        }
    ]
}
