{
    "additionDate": "2020-01-09T17:49:31Z",
    "biotoolsCURIE": "biotools:u-can-act_platform",
    "biotoolsID": "u-can-act_platform",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "f.j.blaauw@rug.nl",
            "name": "Frank J. Blaauw",
            "typeEntity": "Person"
        }
    ],
    "description": "A Tool to Study Intra-individual Processes of Early School Leaving and Its Prevention Using Multiple Informants.\n\nu-can-act – Voorkom voortijdig schoolverlaten.\n\nInzichten vanuit de wetenschap richten zich tot nu toe voornamelijk op groepsrisicofactoren van schooluitval, wij willen inzicht geven in individuele processen.\n\nWij ontdekken de werkzame ingrediënten van effectieve jongerenbegeleiding door zowel begeleiders als jongeren gedurende een langere tijd te volgen. Hiermee helpen wij begeleidingsinitiatieven om hun begeleiding te professionaliseren en te verbeteren.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'u-can-act'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Anonymisation",
                    "uri": "http://edamontology.org/operation_3283"
                }
            ]
        }
    ],
    "homepage": "http://u-can-act.com",
    "lastUpdate": "2020-01-09T17:49:31Z",
    "name": "u-can-act platform",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FPSYG.2019.01808",
            "metadata": {
                "abstract": "© 2019 Blaauw, van der Gaag, Snell, Emerencia, Kunnen and de Jonge.We present the u-can-act platform, a tool that we developed to study the individual processes of early school leaving and the preventative actions that mentors take to steer these processes in the right direction. Early school leaving is a significant problem, particularly in vocational education, and can have severe consequences for both the individual and society. However, the prevention of early school leaving is hampered by a mismatch between research and practice: research tends to focus on identifying risk factors using group averages and cross-sectional studies, while practitioners focus on intervening in individual processes. We aim to help solve this mismatch with our project u-can-act. In this project we have developed a platform that helps to gain insight into both the individual processes that precede early school leaving as well as the actions that mentors take to prevent it. In this paper we introduce the u-can-act platform, which consists of three technology-based, reusable methodological innovations. Specifically, our innovations concern: (i) an open source web application for longitudinal personalized data-collection, (ii) an automated study protocol that optimizes adherence in a difficult target group (adolescents at risk for early school leaving), and (iii) a technologically assisted coupling between mentor and student that allows us to study dyadic interactions over time. We present performance results of our platform, including participant adherence, the behavior of the questionnaire items over time, and the way that our web application is experienced by the participants. We conclude that our innovative platform is successful in collecting multi-informant time-series data on intervention processes among students in vocational education, both for at-risk students and control students, and for their mentors. Moreover, our platform is suitable for broader applications: it can be used to study any malleable individual process including the efforts of a second individual who aims to influence this process. Because of the unique insights that the u-can-act platform is able to generate, the platform may ultimately contribute to solving the mismatch between research and practice, and to more effective interventions in individual processes.",
                "authors": [
                    {
                        "name": "Blaauw F.J."
                    },
                    {
                        "name": "van der Gaag M.A.E."
                    },
                    {
                        "name": "Snell N.R."
                    },
                    {
                        "name": "Emerencia A.C."
                    },
                    {
                        "name": "Kunnen E.S."
                    },
                    {
                        "name": "de Jonge P."
                    }
                ],
                "date": "2019-09-01T00:00:00Z",
                "journal": "Frontiers in Psychology",
                "title": "The u-can-act platform: A tool to study intra-individual processes of early school leaving and its prevention using multiple informants"
            },
            "pmcid": "PMC6764284",
            "pmid": "31616330"
        }
    ],
    "topic": [
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Data acquisition",
            "uri": "http://edamontology.org/topic_3077"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        }
    ]
}