{
    "additionDate": "2017-01-17T15:03:03Z",
    "biotoolsCURIE": "biotools:flowqb",
    "biotoolsID": "flowqb",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "jspidlen@bccrc.ca",
            "name": "Josef Spidlen",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Fully automated R BioConductor package to calculate automatically the detector efficiency (Q), optical background (B) and intrinsic CV of the beads.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/flowQB.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/flowQB_2.2.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Spectral analysis",
                    "uri": "http://edamontology.org/operation_3214"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/flowQB.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:53Z",
    "license": "Artistic-2.0",
    "name": "flowQB",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1002/cyto.a.23052",
            "metadata": {
                "abstract": "© 2017 International Society for Advancement of CytometryWe developed a fully automated procedure for analyzing data from LED pulses and multilevel bead sets to evaluate backgrounds and photoelectron scales of cytometer fluorescence channels. The method improves on previous formulations by fitting a full quadratic model with appropriate weighting and by providing standard errors and peak residuals as well as the fitted parameters themselves. Here we describe the details of the methods and procedures involved and present a set of illustrations and test cases that demonstrate the consistency and reliability of the results. The automated analysis and fitting procedure is generally quite successful in providing good estimates of the Spe (statistical photoelectron) scales and backgrounds for all the fluorescence channels on instruments with good linearity. The precision of the results obtained from LED data is almost always better than that from multilevel bead data, but the bead procedure is easy to carry out and provides results good enough for most purposes. Including standard errors on the fitted parameters is important for understanding the uncertainty in the values of interest. The weighted residuals give information about how well the data fits the model, and particularly high residuals indicate bad data points. Known photoelectron scales and measurement channel backgrounds make it possible to estimate the precision of measurements at different signal levels and the effects of compensated spectral overlap on measurement quality. Combining this information with measurements of standard samples carrying dyes of biological interest, we can make accurate comparisons of dye sensitivity among different instruments. Our method is freely available through the R/Bioconductor package flowQB. © 2017 International Society for Advancement of Cytometry.",
                "authors": [
                    {
                        "name": "Brinkman R.R."
                    },
                    {
                        "name": "Chase E."
                    },
                    {
                        "name": "El Khettabi F."
                    },
                    {
                        "name": "Hoffman R.A."
                    },
                    {
                        "name": "Moore W.A."
                    },
                    {
                        "name": "Parks D.R."
                    },
                    {
                        "name": "Perfetto S.P."
                    },
                    {
                        "name": "Spidlen J."
                    },
                    {
                        "name": "Wood J.C.S."
                    }
                ],
                "citationCount": 12,
                "date": "2017-03-01T00:00:00Z",
                "journal": "Cytometry Part A",
                "title": "Evaluating flow cytometer performance with weighted quadratic least squares analysis of LED and multi-level bead data"
            },
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        }
    ],
    "validated": 1,
    "version": [
        "2.2.0"
    ]
}
