{
    "name": "NordScreen", 
    "description": "Interactive tool for presenting cervical cancer screening indicators in the Nordic countries.", 
    "homepage": "https://nordscreen.org/", 
    "biotoolsID": "NordScreen", 
    "biotoolsCURIE": "biotools:NordScreen", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_2640", 
            "term": "Oncology"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "R"
    ], 
    "license": "Unlicense", 
    "collectionID": [], 
    "maturity": "Mature", 
    "cost": "Free of charge", 
    "accessibility": [
        "Open access"
    ], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [], 
    "publication": [
        {
            "doi": "10.1080/0284186X.2019.1615637", 
            "pmid": "31106635", 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "NordScreen–an interactive tool for presenting cervical cancer screening indicators in the Nordic countries", 
                "abstract": "© 2019, © 2019 Acta Oncologica Foundation.Introduction: Quality assurance and improvement of cancer screening programs require up-to-date monitoring systems and evidence-based indicators. National quality reports exist but the definition and calculation of indicators vary making comparisons between countries difficult. The aim is to stimulate collaborative research and quality improvements in screening through freely available, comparable and regularly updated quality indicators. The project currently includes data on cervical cancer screening but population-based screening programs for breast cancer and colorectal cancer may be included in the future. Material and methods: Through a network of Nordic and Baltic screening managers, population-based individual screening data from each country were converted to standard format in each collaborative center, aggregated by the same R program script and then uploaded to the NordScreen online platform. Registry data included all cervical tests except for Finland where only tests based on invitation are included. Results: The NordScreen collaboration has so far collated standardized indicators based on 32.8 million screening tests from four Nordic countries and Estonia. Interactive comparison of test coverage and distribution of women by number of tests are currently possible online. In 2016, the test coverage within a time interval of 5.5 years in the age group 30–64 year-olds was between 78 and 84% in Iceland, Norway and Sweden whereas 70% in Finland. The application allows users to choose indicator specifications interactively. Conclusions: NordScreen is a pilot model for comparable, reliable and accessible cross-country comparisons of cancer screening. Comparability between countries is enhanced by a uniform data structure and standardized calculations. The comparison of coverage rates to national figures shows that the methods used nationally and in the NordScreen project produce similar results.", 
                "date": "2019-09-02T00:00:00Z", 
                "citationCount": 1, 
                "authors": [
                    {
                        "name": "Partanen V.-M."
                    }, 
                    {
                        "name": "Anttila A."
                    }, 
                    {
                        "name": "Heinavaara S."
                    }, 
                    {
                        "name": "Pankakoski M."
                    }, 
                    {
                        "name": "Sarkeala T."
                    }, 
                    {
                        "name": "Bzhalava Z."
                    }, 
                    {
                        "name": "Elfstrom K.M."
                    }, 
                    {
                        "name": "Trope A."
                    }, 
                    {
                        "name": "Skare G.B."
                    }, 
                    {
                        "name": "Thorsteinsdottir S."
                    }, 
                    {
                        "name": "Agustsson A.I."
                    }, 
                    {
                        "name": "Veerus P."
                    }, 
                    {
                        "name": "Koreinik L."
                    }, 
                    {
                        "name": "Dillner J."
                    }, 
                    {
                        "name": "Lonnberg S."
                    }
                ], 
                "journal": "Acta Oncologica"
            }
        }
    ], 
    "credit": [
        {
            "name": "Veli-Matti Partanen", 
            "email": "veli-matti.partanen@cancer.fi", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "hans", 
    "additionDate": "2019-08-09T13:17:46Z", 
    "lastUpdate": "2019-10-31T12:07:16Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 0, 
    "homepage_status": 0, 
    "elixir_badge": 0
}