{
    "accessibility": "Open access",
    "additionDate": "2022-07-17T11:25:44.555103Z",
    "biotoolsCURIE": "biotools:boost-rs",
    "biotoolsID": "boost-rs",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "liping.liu@tufts.edu",
            "name": "Li-Ping Liu"
        },
        {
            "email": "soha.hassoun@tufts.edu",
            "name": "Soha Hassoun",
            "orcidid": "https://orcid.org/0000-0001-9477-2199"
        },
        {
            "name": "Xinmeng Li"
        }
    ],
    "description": "Boost-RS is an innovative general RS framework that enhances RS performance by “boosting” embedding vectors based on auxiliary data.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/HassounLab/Boost-RS",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:54:39.514177Z",
    "license": "MIT",
    "name": "Boost-RS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btac201",
            "metadata": {
                "abstract": "Motivation: Despite experimental and curation efforts, the extent of enzyme promiscuity on substrates continues to be largely unexplored and under documented. Providing computational tools for the exploration of the enzyme-substrate interaction space can expedite experimentation and benefit applications such as constructing synthesis pathways for novel biomolecules, identifying products of metabolism on ingested compounds, and elucidating xenobiotic metabolism. Recommender systems (RS), which are currently unexplored for the enzyme-substrate interaction prediction problem, can be utilized to provide enzyme recommendations for substrates, and vice versa. The performance of Collaborative-Filtering (CF) RSs; however, hinges on the quality of embedding vectors of users and items (enzymes and substrates in our case). Importantly, enhancing CF embeddings with heterogeneous auxiliary data, specially relational data (e.g. hierarchical, pairwise or groupings), remains a challenge. Results: We propose an innovative general RS framework, termed Boost-RS that enhances RS performance by 'boosting' embedding vectors through auxiliary data. Specifically, Boost-RS is trained and dynamically tuned on multiple relevant auxiliary learning tasks Boost-RS utilizes contrastive learning tasks to exploit relational data. To show the efficacy of Boost-RS for the enzyme-substrate prediction interaction problem, we apply the Boost-RS framework to several baseline CF models. We show that each of our auxiliary tasks boosts learning of the embedding vectors, and that contrastive learning using Boost-RS outperforms attribute concatenation and multi-label learning. We also show that Boost-RS outperforms similarity-based models. Ablation studies and visualization of learned representations highlight the importance of using contrastive learning on some of the auxiliary data in boosting the embedding vectors.",
                "authors": [
                    {
                        "name": "Hassoun S."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Liu L.-P."
                    }
                ],
                "date": "2022-05-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Boost-RS: Boosted embeddings for recommender systems and its application to enzyme-substrate interaction prediction"
            },
            "pmcid": "PMC9113267",
            "pmid": "35561204"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}
