{
    "additionDate": "2021-03-19T08:48:18Z",
    "biotoolsCURIE": "biotools:cgmlstattaiwan",
    "biotoolsID": "cgmlstattaiwan",
    "confidence_flag": "tool",
    "description": "cgMLST@Taiwan is a web service platform for Vibrio cholerae cgMLST profiling and global strain tracking.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Multilocus sequence typing",
                    "uri": "http://edamontology.org/operation_3840"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "http://rdvd.cdc.gov.tw/cgMLST",
    "lastUpdate": "2021-04-22T14:42:12Z",
    "name": "cgMLSTatTaiwan",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.JMII.2020.12.007",
            "metadata": {
                "abstract": "© 2021Background: Cholera, a rapidly dehydrating diarrheal disease caused by toxigenic Vibrio cholerae, is a leading cause of morbidity and mortality in some regions of the world. Core genome multilocus sequence typing (cgMLST) is a promising approach in generating genetic fingerprints from whole-genome sequencing (WGS) data for strain comparison among laboratories. Methods: We constructed a V. cholerae core gene allele database using an in-house developed computational pipeline, a database with cgMLST profiles converted from genomic sequences from the National Center for Biotechnology Information, and built a REST-based web accessible via the Internet. Results: We built a web service platform—cgMLST@Taiwan and installed a V. cholerae allele database, a cgMLST profile database, and computational tools for generating V. cholerae cgMLST profiles (based on 3,017 core genes), performing rapid global strain tracking, and clustering analysis of cgMLST profiles. This web-based platform provides services to researchers, public health microbiologists, and physicians who use WGS data for the investigation of cholera outbreaks and tracking of V. cholerae strain transmission across countries and geographic regions. The cgMLST@Taiwan is accessible at http://rdvd.cdc.gov.tw/cgMLST.",
                "authors": [
                    {
                        "name": "Chen Y.-S."
                    },
                    {
                        "name": "Tu Y.-H."
                    },
                    {
                        "name": "Chen B.-H."
                    },
                    {
                        "name": "Liu Y.-Y."
                    },
                    {
                        "name": "Hong Y.-P."
                    },
                    {
                        "name": "Teng R.-H."
                    },
                    {
                        "name": "Wang Y.-W."
                    },
                    {
                        "name": "Chiou C.-S."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Journal of Microbiology, Immunology and Infection",
                "title": "cgMLST@Taiwan: A web service platform for Vibrio cholerae cgMLST profiling and global strain tracking"
            },
            "pmid": "33485793"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ]
}