{
    "additionDate": "2023-09-07T12:39:00.999594Z",
    "biotoolsCURIE": "biotools:bitterdb",
    "biotoolsID": "bitterdb",
    "collectionID": [
        "gpcr"
    ],
    "description": "The aim of BitterDB database is to gather information about bitter-tasting natural and synthetic compounds, and their cognate bitter taste receptors (T2Rs or TAS2Rs).",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://bitterdb.agri.huji.ac.il/dbbitter.php",
    "lastUpdate": "2024-11-24T14:16:27.781056Z",
    "name": "BitterDB",
    "owner": "laasfeld",
    "publication": [
        {
            "doi": "10.1093/nar/gky974",
            "metadata": {
                "abstract": "BitterDB (http://bitterdb.agri.huji.ac.il) was introduced in 2012 as a central resource for information on bitter-tasting molecules and their receptors. The information in BitterDB is frequently used for choosing suitable ligands for experimental studies, for developing bitterness predictors, for analysis of receptors promiscuity and more. Here, we describe a major upgrade of the database, including significant increase in content as well as new features. BitterDB now holds over 1000 bitter molecules, up from the initial 550. When available, quantitative sensory data on bitterness intensity as well as toxicity information were added. For 270 molecules, at least one associated bitter taste receptor (T2R) is reported. The overall number of ligand-T2R associations is now close to 800. BitterDB was extended to several species: in addition to human, it now holds information on mouse, cat and chicken T2Rs, and the compounds that activate them. BitterDB now provides a unique platform for structure-based studies with high-quality homology models, known ligands, and for the human receptors also data from mutagenesis experiments, information on frequently occurring single nucleotide polymorphisms and links to expression levels in different tissues.",
                "authors": [
                    {
                        "name": "Bahia M.S."
                    },
                    {
                        "name": "Dagan-Wiener A."
                    },
                    {
                        "name": "Di Pizio A."
                    },
                    {
                        "name": "Dubovski N."
                    },
                    {
                        "name": "Margulis E."
                    },
                    {
                        "name": "Nissim I."
                    },
                    {
                        "name": "Niv M.Y."
                    }
                ],
                "citationCount": 158,
                "date": "2019-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Bitterdb: Taste ligands and receptors database in 2019"
            },
            "pmcid": "PMC6323989",
            "pmid": "30357384",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Biochemistry",
            "uri": "http://edamontology.org/topic_3292"
        },
        {
            "term": "Compound libraries and screening",
            "uri": "http://edamontology.org/topic_3343"
        },
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        }
    ]
}
