{
    "accessibility": "Open access",
    "additionDate": "2019-05-19T09:32:10Z",
    "biotoolsCURIE": "biotools:ADS-HCSpark",
    "biotoolsID": "ADS-HCSpark",
    "cost": "Free of charge",
    "description": "Scalable HaplotypeCaller leveraging adaptive data segmentation to accelerate variant calling on Spark.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/SCUT-CCNL/ADS-HCSpark/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://github.com/SCUT-CCNL/ADS-HCSpark.git",
    "language": [
        "Java"
    ],
    "lastUpdate": "2020-06-16T10:55:24Z",
    "license": "BSD-3-Clause",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/SCUT-CCNL/ADS-HCSpark/issues"
        }
    ],
    "maturity": "Mature",
    "name": "ADS-HCSpark",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12859-019-2665-0",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: The advance of next generation sequencing enables higher throughput with lower price, and as the basic of high-throughput sequencing data analysis, variant calling is widely used in disease research, clinical treatment and medicine research. However, current mainstream variant caller tools have a serious problem of computation bottlenecks, resulting in some long tail tasks when performing on large datasets. This prevents high scalability on clusters of multi-node and multi-core, and leads to long runtime and inefficient usage of computing resources. Thus, a high scalable tool which could run in distributed environment will be highly useful to accelerate variant calling on large scale genome data. Results: In this paper, we present ADS-HCSpark, a scalable tool for variant calling based on Apache Spark framework. ADS-HCSpark accelerates the process of variant calling by implementing the parallelization of mainstream GATK HaplotypeCaller algorithm on multi-core and multi-node. Aiming at solving the problem of computation skew in HaplotypeCaller, a parallel strategy of adaptive data segmentation is proposed and a variant calling algorithm based on adaptive data segmentation is implemented, which achieves good scalability on both single-node and multi-node. For the requirement that adjacent data blocks should have overlapped boundaries, Hadoop-BAM library is customized to implement partitioning BAM file into overlapped blocks, further improving the accuracy of variant calling. Conclusions: ADS-HCSpark is a scalable tool to achieve variant calling based on Apache Spark framework, implementing the parallelization of GATK HaplotypeCaller algorithm. ADS-HCSpark is evaluated on our cluster and in the case of best performance that could be achieved in this experimental platform, ADS-HCSpark is 74% faster than GATK3.8 HaplotypeCaller on single-node experiments, 57% faster than GATK4.0 HaplotypeCallerSpark and 27% faster than SparkGA on multi-node experiments, with better scalability and the accuracy of over 99%. The source code of ADS-HCSpark is publicly available at https://github.com/SCUT-CCNL/ADS-HCSpark.git.",
                "authors": [
                    {
                        "name": "Xiao A."
                    },
                    {
                        "name": "Wu Z."
                    },
                    {
                        "name": "Dong S."
                    }
                ],
                "citationCount": 1,
                "date": "2019-02-14T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Ads-hcspark: A scalable haplotypecaller leveraging adaptive data segmentation to accelerate variant calling on spark"
            },
            "pmcid": "PMC6376756",
            "pmid": "30764760",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        }
    ]
}