{
    "additionDate": "2017-08-03T18:50:09Z",
    "biotoolsCURIE": "biotools:msite",
    "biotoolsID": "msite",
    "credit": [
        {
            "email": "wbs@icho.edu.pl",
            "name": "Wanda Sicinska",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://biocomp.chem.uw.edu.pl/contact"
        }
    ],
    "description": "Program designed to analyse structural data of liganded and unliganded proteins.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://biocomp.chem.uw.edu.pl/tools/msite"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "homepage": "http://biocomp.chem.uw.edu.pl/tools/msite",
    "language": [
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/msite-analyse-structural-data-of-liganded-and-unliganded-proteins.html"
        }
    ],
    "name": "MSITE",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "The mechanism by which nuclear receptors respond differentially to structurally distinct agonists is not a well understood process. However, it is now obvious that transcriptional activity of nuclear receptors is a function of their interactions with co-activators. Recently, we released a new computational tool, CCOMP, for comparing side chain conformations in crystal structures of homologous protein complexes. Application of the CCOMP program revealed that 20-epi-1α,25-(OH)2D3 changes the side chain conformation of vitamin D receptor amino acids residing mostly far away from the ligand-receptor contacts. This strongly suggests that the ligand-co-activator signaling pathway involves indirect interactions between amino acids lining the binding pocket and outer surface residues that could attract co-activators. To facilitate identification of amino acids transmitting the subtle receptor changes upon ligand/modulator binding we developed another simple tool, MSITE. The program automatically lists the nearest neighbors of a given amino acid (for example neighbors of residues that are in contact with a ligand or reorient their side chains in the presence of a co-factor) in an arbitrary number of compared complexes. Comparison of seven binary vitamin D receptor complexes holding as ligands the analogs of 1α,25-(OH)2D3 with inverted configuration at carbon 14 or 20, or with incorporated oxolane ring bridging carbons 20 and 23, is reported. © 2010 Elsevier Ltd.",
                "authors": [
                    {
                        "name": "Kurcinski M."
                    },
                    {
                        "name": "Sicinska W."
                    }
                ],
                "citationCount": 3,
                "date": "2010-07-01T00:00:00Z",
                "journal": "Journal of Steroid Biochemistry and Molecular Biology",
                "title": "MSITE: A new computational tool for comparison of homological proteins in holo form"
            },
            "pmid": "20399855"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
