{
    "additionDate": "2017-09-19T09:08:23Z",
    "biotoolsCURIE": "biotools:diana-mirgen",
    "biotoolsID": "diana-mirgen",
    "credit": [
        {
            "email": "artemis.hatzigeorgiou@gmail.com",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.microrna.gr"
        }
    ],
    "description": "Provides accurate cell-line-specific miRNA gene transcription start sites, coupled with genome-wide maps of transcription factor binding sites in order to unveil the mechanisms of miRNA transcription regulation. The database schema and web interface facilitates user interaction, provides advanced queries and innate connection with other DIANA resources for miRNA target identification and pathway analysis.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://carolina.imis.athena-innovation.gr/diana_tools/web/index.php?r=mirgenv3%2Fhelp"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Annotation",
                    "uri": "http://edamontology.org/operation_0226"
                }
            ]
        }
    ],
    "homepage": "http://www.microrna.gr/mirgen",
    "language": [
        "PHP"
    ],
    "lastUpdate": "2019-03-12T13:30:40Z",
    "name": "DIANA-miRGen",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "dianalab",
    "publication": [
        {
            "doi": "10.1093/nar/gkv1254",
            "metadata": {
                "abstract": "© The Author(s) 2015.MicroRNAs (miRNAs) are small non-coding RNAs that actively fine-tune gene expression. The accurate characterization of the mechanisms underlying miRNA transcription regulation will further expand our knowledge regarding their implication in homeostatic and pathobiological networks. Aim of DIANA-miRGen v3.0 (http://www.microrna.gr/mirgen) is to provide for the first time accurate cell-line-specific miRNA gene transcription start sites (TSSs), coupled with genome-wide maps of transcription factor (TF) binding sites in order to unveil the mechanisms of miRNA transcription regulation. To this end, more than 7.3 billion RNA-, ChIP- and DNase-Seq next generation sequencing reads were analyzed/assembled and combined with state-of-the-art miRNA TSS prediction and TF binding site identification algorithms. The new database schema and web interface facilitates user interaction, provides advanced queries and innate connection with other DIANA resources for miRNA target identification and pathway analysis. The database currently supports 276 miRNA TSSs that correspond to 428 precursors and >19M binding sites of 202 TFs on a genome-wide scale in nine cell-lines and six tissues of Homo sapiensand Mus musculus.",
                "authors": [
                    {
                        "name": "Georgakilas G."
                    },
                    {
                        "name": "Vlachos I.S."
                    },
                    {
                        "name": "Zagganas K."
                    },
                    {
                        "name": "Vergoulis T."
                    },
                    {
                        "name": "Paraskevopoulou M.D."
                    },
                    {
                        "name": "Kanellos I."
                    },
                    {
                        "name": "Tsanakas P."
                    },
                    {
                        "name": "Dellis D."
                    },
                    {
                        "name": "Fevgas A."
                    },
                    {
                        "name": "Dalamagas T."
                    },
                    {
                        "name": "Hatzigeorgiou A.G."
                    }
                ],
                "citationCount": 24,
                "date": "2016-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "DIANA-miRGen v3.0: Accurate characterization of microRNA promoters and their regulators"
            },
            "pmcid": "PMC4702888",
            "pmid": "26586797",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/nar/gkp888",
            "metadata": {
                "abstract": "MicroRNAs are small, non-protein coding RNA molecules known to regulate the expression of genes by binding to the 3′UTR region of mRNAs. MicroRNAs are produced from longer transcripts which can code for more than one mature miRNAs. miRGen 2.0 is a database that aims to provide comprehensive information about the position of human and mouse microRNA coding transcripts and their regulation by transcription factors, including a unique compilation of both predicted and experimentally supported data. Expression profiles of microRNAs in several tissues and cell lines, single nucleotide polymorphism locations, microRNA target prediction on protein coding genes and mapping of miRNA targets of co-regulated miRNAs on biological pathways are also integrated into the database and user interface. The miRGen database will be continuously maintained and freely available at . http://www.microrna.gr/mirgen/. © The Author(s) 2009. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Alexiou P."
                    },
                    {
                        "name": "Vergoulis T."
                    },
                    {
                        "name": "Gleditzsch M."
                    },
                    {
                        "name": "Prekas G."
                    },
                    {
                        "name": "Dalamagas T."
                    },
                    {
                        "name": "Megraw M."
                    },
                    {
                        "name": "Grosse I."
                    },
                    {
                        "name": "Sellis T."
                    },
                    {
                        "name": "Hatzigeorgiou A.G."
                    }
                ],
                "citationCount": 107,
                "date": "2009-11-17T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "miRGen 2.0: A database of microRNA genomic information and regulation"
            },
            "pmcid": "PMC2808909",
            "pmid": "19850714",
            "type": [
                "Other"
            ]
        },
        {
            "doi": "10.1093/nar/gkl904",
            "metadata": {
                "abstract": "miRGen is an integrated database of (i) positional relationships between animal miRNAs and genomic annotation sets and (ii) animal miRNA targets according to combinations of widely used target prediction programs. A major goal of the database is the study of the relationship between miRNA genomic organization and miRNA function. This is made possible by three integrated and user friendly interfaces. The Genomics interface allows the user to explore where whole-genome collections of miRNAs are located with respect to UCSC genome browser annotation sets such as Known Genes, Refseq Genes, Genscan predicted genes, CpG islands and pseudogenes. These miRNAs are connected through the Targets interface to their experimentally supported target genes from TarBase, as well as computationally predicted target genes from optimized intersections and unions of several widely used mammalian target prediction programs. Finally, the Clusters interface provides predicted miRNA clusters at any given inter-miRNA distance and provides specific functional information on the targets of miRNAs within each cluster. All of these unique features of miRGen are designed to facilitate investigations into miRNA genomic organization, co-transcription and targeting. miRGen can be freely accessed at http://www.diana.pcbi.upenn.edu/miRGen. © 2007 Oxford University Press.",
                "authors": [
                    {
                        "name": "Megraw M."
                    },
                    {
                        "name": "Sethupathy P."
                    },
                    {
                        "name": "Corda B."
                    },
                    {
                        "name": "Hatzigeorgiou A.G."
                    }
                ],
                "citationCount": 231,
                "date": "2007-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "miRGen: A database for the study of animal microRNA genomic organization and function"
            },
            "pmcid": "PMC1669779",
            "pmid": "17108354",
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene structure",
            "uri": "http://edamontology.org/topic_0114"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ]
}