{
    "additionDate": "2023-08-30T12:39:58.333143Z",
    "biotoolsCURIE": "biotools:gpcr-sas",
    "biotoolsID": "gpcr-sas",
    "collectionID": [
        "gpcr"
    ],
    "description": "The G Protein-Coupled Receptors-Sequence Analysis and Statistics (GPCR-SAS) web application provides a set of tools to perform comparative analysis of sequence positions between receptors, based on a curated structural-informed multiple sequence alignment. The analysis tools include: (i) percentage of occurrence of an amino acid or motif and entropy at a position or range of positions, (ii) covariance of two positions, (iii) correlation between two amino acids in two positions (or two sequence motifs in two ranges of positions), and (iv) snake-plot representation for a specific receptor or for the consensus sequence of a group of selected receptors. The analysis of conservation of residues and motifs across transmembrane (TM) segments may guide the design of more selective ligands or help to rationalize activation mechanisms, among others. As an example, here we analyze the amino acids of the \"transmission switch\", that initiates receptor activation following ligand binding.",
    "editPermission": {
        "authors": [
            "mbermudez1"
        ],
        "type": "group"
    },
    "homepage": "http://lmc.uab.cat/gpcrsas/",
    "lastUpdate": "2024-02-15T12:30:02.272330Z",
    "name": "GPCR-SAS",
    "owner": "laasfeld",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0199843",
            "metadata": {
                "abstract": "G protein-coupled receptors (GPCRs) are one of the largest protein families in mammals. They mediate signal transduction across cell membranes and are important targets for the pharmaceutical industry. The G Protein-Coupled Receptors—Sequence Analysis and Statistics (GPCR-SAS) web application provides a set of tools to perform comparative analysis of sequence positions between receptors, based on a curated structural-informed multiple sequence alignment. The analysis tools include: (i) percentage of occurrence of an amino acid or motif and entropy at a position or range of positions, (ii) covariance of two positions, (iii) correlation between two amino acids in two positions (or two sequence motifs in two ranges of positions), and (iv) snake-plot representation for a specific receptor or for the consensus sequence of a group of selected receptors. The analysis of conservation of residues and motifs across transmembrane (TM) segments may guide the design of more selective ligands or help to rationalize activation mechanisms, among others. As an example, here we analyze the amino acids of the “transmission switch”, that initiates receptor activation following ligand binding. The tool is freely accessible at http://lmc.uab.cat/gpcrsas/.",
                "authors": [
                    {
                        "name": "Campillo M."
                    },
                    {
                        "name": "Cordomi A."
                    },
                    {
                        "name": "Deupi X."
                    },
                    {
                        "name": "Gomez Tamayo J.C."
                    },
                    {
                        "name": "Gonzalez A."
                    },
                    {
                        "name": "Hoogstraat M."
                    },
                    {
                        "name": "Mayol E."
                    },
                    {
                        "name": "Olivella M."
                    },
                    {
                        "name": "Rios S."
                    }
                ],
                "citationCount": 5,
                "date": "2018-07-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "GPCR-SAS: A web application for statistical analyses on G protein-coupled receptors sequences"
            }
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        }
    ]
}
