{
    "additionDate": "2017-01-17T15:08:20Z",
    "biotoolsCURIE": "biotools:artemis",
    "biotoolsID": "artemis",
    "collectionID": [
        "ELIXIR Trainer Tools"
    ],
    "credit": [
        {
            "email": "artemis@sanger.ac.uk",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Free genome browser and annotation tool that allows visualisation of sequence features, next generation data and the results of analyses within the context of the sequence, and also its six-frame translation.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.sanger.ac.uk/science/tools/artemis"
        }
    ],
    "editPermission": {
        "authors": [
            "sergitobara"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome visualisation",
                    "uri": "http://edamontology.org/operation_3208"
                }
            ]
        }
    ],
    "homepage": "http://www.sanger.ac.uk/science/tools/artemis",
    "language": [
        "Java"
    ],
    "lastUpdate": "2022-06-23T13:38:49.504924Z",
    "name": "Artemis",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "training_go_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btn529",
            "metadata": {
                "abstract": "Motivation: Artemis and Artemis Comparison Tool (ACT) have become mainstream tools for viewing and annotating sequence data, particularly for microbial genomes. Since its first release, Artemis has been continuously developed and supported with additional functionality for editing and analysing sequences based on feedback from an active user community of laboratory biologists and professional annotators. Nevertheless, its utility has been somewhat restricted by its limitation to reading and writing from flat files. Therefore, a new version of Artemis has been developed, which reads from and writes to a relational database schema, and allows users to annotate more complex, often large and fragmented, genome sequences. Results: Artemis and ACT have now been extended to read and write directly to the Generic Model Organism Database (GMOD, http://www.w3.org/ 1999/xlink) Chado relational database schema. In addition, a Gene Builder tool has been developed to provide structured forms and tables to edit coordinates of gene models and edit functional annotation, based on standard ontologies, controlled vocabularies and free text. © 2008 The Author(s).",
                "authors": [
                    {
                        "name": "Barrell B.G."
                    },
                    {
                        "name": "Berriman M."
                    },
                    {
                        "name": "Bohme U."
                    },
                    {
                        "name": "Carver T."
                    },
                    {
                        "name": "Parkhill J."
                    },
                    {
                        "name": "Patel C."
                    },
                    {
                        "name": "Rajandream M.-A."
                    },
                    {
                        "name": "Tivey A."
                    }
                ],
                "citationCount": 450,
                "date": "2008-12-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Artemis and ACT: Viewing, annotating and comparing sequences stored in a relational database"
            },
            "pmcid": "PMC2606163",
            "pmid": "18845581"
        },
        {
            "doi": "10.1093/bioinformatics/btr703",
            "metadata": {
                "abstract": "Motivation: High-throughput sequencing (HTS) technologies have made low-cost sequencing of large numbers of samples commonplace. An explosion in the type, not just number, of sequencing experiments has also taken place including genome re-sequencing, population-scale variation detection, whole transcriptome sequencing and genome-wide analysis of protein-bound nucleic acids. Results: We present Artemis as a tool for integrated visualization and computational analysis of different types of HTS datasets in the context of a reference genome and its corresponding annotation. © The Author(s) 2011. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Berriman M."
                    },
                    {
                        "name": "Carver T."
                    },
                    {
                        "name": "Harris S.R."
                    },
                    {
                        "name": "McQuillan J.A."
                    },
                    {
                        "name": "Parkhill J."
                    }
                ],
                "citationCount": 640,
                "date": "2012-02-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Artemis: An integrated platform for visualization and analysis of high-throughput sequence-based experimental data"
            },
            "pmcid": "PMC3278759",
            "pmid": "22199388"
        },
        {
            "doi": "10.1093/bib/4.2.124",
            "metadata": {
                "abstract": "Artemis is a widely used software tool for annotating and viewing sequence data. No database is required to use Artemis. Instead, individual sequence data files can be analysed with little or no formatting, making it particularly suited to the study of small genomes and chromosomes, and straightforward for a novice user to get started. Since its release in 1999, Artemis has been used to annotate a diverse collection of prokaryotic and eukaryotic genomes, ranging from Streptomyces coelicolor to, more recently, a large proportion of the Plasmodium falciparum genome. Artemis allows annotated genomes to be easily browsed and makes it simple to add useful biological information to raw sequence data. This paper gives an overview of some of the features of Artemis and includes how it facilitates manual gene prediction and can provide an overview of entire chromosomes or small compact genomes--useful for uncovering unusual features such as pathogenicity islands.",
                "authors": [
                    {
                        "name": "Berriman M."
                    },
                    {
                        "name": "Rutherford K."
                    }
                ],
                "citationCount": 117,
                "date": "2003-01-01T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "Viewing and annotating sequence data with Artemis."
            },
            "pmid": "12846394"
        },
        {
            "doi": "10.1093/bioinformatics/16.10.944",
            "metadata": {
                "abstract": "Artemis is a DNA sequence visualization and annotation tool that allows the results of any analysis or sets of analyses to be viewed in the context of the sequence and its six-frame translation. Artemis is especially useful in analysing the compact genomes of bacteria, archaea and lower eukaryotes, and will cope with sequences of any size from small genes to whole genomes. It is implemented in Java, and can be run on any suitable platform. Sequences and annotation can be read and written directly in EMBL, GenBank and GFF format.",
                "authors": [
                    {
                        "name": "Barrell B."
                    },
                    {
                        "name": "Crook J."
                    },
                    {
                        "name": "Horsnell T."
                    },
                    {
                        "name": "Parkhill J."
                    },
                    {
                        "name": "Rajandream M.-A."
                    },
                    {
                        "name": "Rice P."
                    },
                    {
                        "name": "Rutherford K."
                    }
                ],
                "citationCount": 2443,
                "date": "2000-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Artemis: Sequence visualization and annotation"
            },
            "pmid": "11120685"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        }
    ],
    "validated": 1
}
