{
    "additionDate": "2020-01-14T20:07:41Z",
    "biotoolsCURIE": "biotools:PTR",
    "biotoolsID": "PTR",
    "confidence_flag": "tool",
    "description": "PTR is an approach to identify and explore Post Transcriptional Regulatory mechanisms using proteogenomics.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                }
            ]
        }
    ],
    "homepage": "https://github.com/arunima2/PTRE_PSB_2020",
    "lastUpdate": "2021-01-13T18:11:45Z",
    "name": "PTR",
    "owner": "Pub2Tools",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2019 The Authors.Integration of transcriptomic and proteomic data should reveal multi-layered regulatory processes governing cancer cell behaviors. Traditional correlation-based analyses have demonstrated limited ability to identify the post-Transcriptional regulatory (PTR) processes that drive the non-linear relationship between transcript and protein abundances. In this work, we ideate an integrative approach to explore the variety of post-Transcriptional mechanisms that dictate relationships between genes and corresponding proteins. The proposed workflow utilizes the intuitive technique of scatterplot diagnostics or scagnostics, to characterize and examine the diverse scatterplots built from transcript and protein abundances in a proteogenomic experiment. The workflow includes representing gene-protein relationships as scatterplots, clustering on geometric scagnostic features of these scatterplots, and finally identifying and grouping the potential gene-protein relationships according to their disposition to various PTR mechanisms. Our study verifies the efficacy of the implemented approach to excavate possible regulatory mechanisms by utilizing comprehensive tests on a synthetic dataset. We also propose a variety of 2D pattern-specific downstream analyses methodologies such as mixture modeling, and mapping miRNA post-Transcriptional effects to explore each mechanism further. This work suggests that the proposed methodology has the potential for discovering and categorizing post-Transcriptional regulatory mechanisms, manifesting in proteogenomic trends. These trends subsequently provide evidence for cancer specificity, miRNA targeting, and identification of regulation impacted by biological functionality and different types of degradation. (Supplementary Material-https://github.com/arunima2/PTRE-PSB-2020).",
                "authors": [
                    {
                        "name": "Huang K."
                    },
                    {
                        "name": "Machiraju R."
                    },
                    {
                        "name": "Mallick P."
                    },
                    {
                        "name": "Sharpnack M."
                    },
                    {
                        "name": "Srivastava A."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Pacific Symposium on Biocomputing",
                "title": "PTR Explorer: An approach to identify and explore Post Transcriptional Regulatory mechanisms using proteogenomics"
            },
            "pmid": "31797620"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}
