{
    "additionDate": "2017-08-03T18:55:59Z",
    "biotoolsCURIE": "biotools:pocketdepth",
    "biotoolsID": "pocketdepth",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://proline.physics.iisc.ernet.in/pocketdepth/other_info/contact.html"
        }
    ],
    "description": "Algorithm for finding binding site (pockets) in protein structures.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://proline.physics.iisc.ernet.in/pocketdepth/other_info/algorithm.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                },
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "homepage": "http://proline.physics.iisc.ernet.in/pocketdepth/",
    "lastUpdate": "2018-12-10T12:58:43Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/pocketdepth-a-new-depth-based-algortihm-for-identification-of-ligand-binding-sites.html"
        }
    ],
    "name": "PocketDepth",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Predicting functional sites in proteins is important in structural biology for understanding the function and also for structure-based drug design. Here we report a new binding site prediction method PocketDepth, which is geometry based and uses a depth based clustering. Depth is an important parameter considered during protein structure visualisation and analysis but has been used more often intuitively than systematically. Our current implementation of depth reflects how central a given subspace is to a putative pocket. We have tested the algorithm against PDBbind, a large curated set of 1091 proteins. A prediction was considered a true-positive if the predicted pocket had at least 10% overlap with the actual ligand. Two different parameter sets, 'deeper' and 'surface' were used, for wider coverage of different types of binding sites in proteins. With deeper parameters, true-positives were observed for 841 proteins, resulting in a prediction accuracy of 77%, for any ranked prediction. Of these, 55.2% were first ranked predictions, whereas 91.2% and 97.4% were covered in the first 5 and 10 ranks, respectively. With the 'surface' parameters, a prediction rate of 95.8% was observed, albeit with much poorer ranks. The deeper set identified pocket boundaries more precisely and yielded better ranks, while the latter missed fewer predictions and hence had better coverage. The two parameter sets were therefore algorithmically combined, resulting in prediction accuracies of 96.5% for any ranked prediction. About 41.8% of these were in the first rank, 82% and 94% were in top 5 and 10 ranks, respectively. The algorithm is available at http://proline.physics.iisc.ernet.in/pocketdepth. © 2007 Elsevier Inc. All rights reserved.",
                "authors": [
                    {
                        "name": "Chandra N."
                    },
                    {
                        "name": "Kalidas Y."
                    }
                ],
                "citationCount": 74,
                "date": "2008-01-01T00:00:00Z",
                "journal": "Journal of Structural Biology",
                "title": "PocketDepth: A new depth based algorithm for identification of ligand binding sites in proteins"
            },
            "pmid": "17949996"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        }
    ],
    "validated": 1
}
