{
    "accessibility": "Open access",
    "additionDate": "2022-04-28T15:45:07.873224Z",
    "biotoolsCURIE": "biotools:openmole",
    "biotoolsID": "openmole",
    "collectionID": [
        "PerMedCoE"
    ],
    "cost": "Free of charge",
    "description": "OpenMOLE has been developed since 2008 as a free and open-source platform. It offers tools to run, explore, diagnose and optimize your numerical model, taking advantage of distributed computing environments. With OpenMOLE you can explore your already developed model, in any language (Java, Binary exe, NetLogo, R, SciLab, Python, C++, etc.)",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://openmole.org/Documentation.html"
        }
    ],
    "download": [
        {
            "type": "Downloads page",
            "url": "https://openmole.org/Download.html"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://openmole.org/",
    "language": [
        "Java",
        "Julia",
        "R",
        "Scala"
    ],
    "lastUpdate": "2024-11-24T20:09:38.246562Z",
    "name": "OpenMole",
    "owner": "tntiniak",
    "publication": [
        {
            "doi": "10.1186/1758-2946-5-39",
            "metadata": {
                "abstract": "Background: Channels and pores in biomacromolecules (proteins, nucleic acids and their complexes) play significant biological roles, e.g., in molecular recognition and enzyme substrate specificity. Results: We present an advanced software tool entitled MOLE 2.0, which has been designed to analyze molecular channels and pores. Benchmark tests against other available software tools showed that MOLE 2.0 is by comparison quicker, more robust and more versatile. As a new feature, MOLE 2.0 estimates physicochemical properties of the identified channels, i.e., hydropathy, hydrophobicity, polarity, charge, and mutability. We also assessed the variability in physicochemical properties of eighty X-ray structures of two members of the cytochrome P450 superfamily. Conclusion: Estimated physicochemical properties of the identified channels in the selected biomacromolecules corresponded well with the known functions of the respective channels. Thus, the predicted physicochemical properties may provide useful information about the potential functions of identified channels. The MOLE 2.0 software is available at http://mole.chemi.muni.cz. © 2013 Sehnal et al.; licensee Chemistry Central Ltd.",
                "authors": [
                    {
                        "name": "Banas P."
                    },
                    {
                        "name": "Berka K."
                    },
                    {
                        "name": "Ionescu C.-M."
                    },
                    {
                        "name": "Koca J."
                    },
                    {
                        "name": "Navratilova V."
                    },
                    {
                        "name": "Otyepka M."
                    },
                    {
                        "name": "Pravda L."
                    },
                    {
                        "name": "Sehnal D."
                    },
                    {
                        "name": "Varekova R.S."
                    }
                ],
                "citationCount": 256,
                "date": "2013-08-16T00:00:00Z",
                "journal": "Journal of Cheminformatics",
                "title": "MOLE 2.0: Advanced approach for analysis of biomacromolecular channels"
            },
            "pmcid": "PMC3765717",
            "pmid": "23953065"
        }
    ]
}
