{
    "additionDate": "2021-03-19T08:32:44Z",
    "biotoolsCURIE": "biotools:minnetrank",
    "biotoolsID": "minnetrank",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "yuzhangsheng@sjtu.edu.cn",
            "name": "Zhangsheng Yu",
            "typeEntity": "Person"
        }
    ],
    "description": "An Efficient and Easy-to-Use Network-Based Integrative Method of Multi-Omics Data for Cancer Genes Discovery.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "homepage": "https://github.com/weitinging/MinNetRank",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-04-11T09:24:52.495035Z",
    "name": "MinNetRank",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.3389/FGENE.2020.613033",
            "metadata": {
                "abstract": "© Copyright © 2021 Wei, Fa, Luo, Johnston, Zhang and Yu.Identifying personalized driver genes is essential for discovering critical biomarkers and developing effective personalized therapies of cancers. However, few methods consider weights for different types of mutations and efficiently distinguish driver genes over a larger number of passenger genes. We propose MinNetRank (Minimum used for Network-based Ranking), a new method for prioritizing cancer genes that sets weights for different types of mutations, considers the incoming and outgoing degree of interaction network simultaneously, and uses minimum strategy to integrate multi-omics data. MinNetRank prioritizes cancer genes among multi-omics data for each sample. The sample-specific rankings of genes are then integrated into a population-level ranking. When evaluating the accuracy and robustness of prioritizing driver genes, our method almost always significantly outperforms other methods in terms of precision, F1 score, and partial area under the curve (AUC) on six cancer datasets. Importantly, MinNetRank is efficient in discovering novel driver genes. SP1 is selected as a candidate driver gene only by our method (ranked top three), and SP1 RNA and protein differential expression between tumor and normal samples are statistically significant in liver hepatocellular carcinoma. The top seven genes stratify patients into two subtypes exhibiting statistically significant survival differences in five cancer types. These top seven genes are associated with overall survival, as illustrated by previous researchers. MinNetRank can be very useful for identifying cancer driver genes, and these biologically relevant marker genes are associated with clinical outcome. The R package of MinNetRank is available at https://github.com/weitinging/MinNetRank.",
                "authors": [
                    {
                        "name": "Wei T."
                    },
                    {
                        "name": "Fa B."
                    },
                    {
                        "name": "Luo C."
                    },
                    {
                        "name": "Johnston L."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Yu Z."
                    }
                ],
                "date": "2021-01-08T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "An Efficient and Easy-to-Use Network-Based Integrative Method of Multi-Omics Data for Cancer Genes Discovery"
            },
            "pmcid": "PMC7820902",
            "pmid": "33488678"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        }
    ]
}