{
    "additionDate": "2024-09-20T07:18:14.102477Z",
    "biotoolsCURIE": "biotools:iphop",
    "biotoolsID": "iphop",
    "description": "An automated command-line pipeline for predicting host genus of novel bacteriophages and archaeoviruses based on their genome sequences.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "DNA sequence",
                        "uri": "http://edamontology.org/data_3494"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Sample comparison",
                    "uri": "http://edamontology.org/operation_3731"
                }
            ]
        }
    ],
    "homepage": "https://bitbucket.org/srouxjgi/iphop/",
    "lastUpdate": "2024-09-20T07:30:58.461443Z",
    "name": "iPHoP",
    "owner": "m.bernt",
    "publication": [
        {
            "doi": "10.1371/journal.pbio.3002083",
            "metadata": {
                "abstract": "The extraordinary diversity of viruses infecting bacteria and archaea is now primarily studied through metagenomics. While metagenomes enable high-throughput exploration of the viral sequence space, metagenome-derived sequences lack key information compared to isolated viruses, in particular host association. Different computational approaches are available to predict the host(s) of uncultivated viruses based on their genome sequences, but thus far individual approaches are limited either in precision or in recall, i.e., for a number of viruses they yield erroneous predictions or no prediction at all. Here, we describe iPHoP, a two-step framework that integrates multiple methods to reliably predict host taxonomy at the genus rank for a broad range of viruses infecting bacteria and archaea, while retaining a low false discovery rate. Based on a large dataset of metagenome-derived virus genomes from the IMG/VR database, we illustrate how iPHoP can provide extensive host prediction and guide further characterization of uncultivated viruses.",
                "authors": [
                    {
                        "name": "Camargo A.P."
                    },
                    {
                        "name": "Coutinho F.H."
                    },
                    {
                        "name": "Dabdoub S.M."
                    },
                    {
                        "name": "Dutilh B.E."
                    },
                    {
                        "name": "Nayfach S."
                    },
                    {
                        "name": "Roux S."
                    },
                    {
                        "name": "Tritt A."
                    }
                ],
                "citationCount": 65,
                "date": "2023-04-01T00:00:00Z",
                "journal": "PLoS Biology",
                "title": "iPHoP: An integrated machine learning framework to maximize host prediction for metagenome-derived viruses of archaea and bacteria"
            }
        }
    ]
}
