{
    "additionDate": "2019-11-14T18:18:55Z",
    "biotoolsCURIE": "biotools:TEs",
    "biotoolsID": "TEs",
    "confidence_flag": "tool",
    "description": "> CORRECT NAME OF TOOL COULD ALSO BE 'maizeTE_variation' | Transposable elements contribute to dynamic genome content in maize | Structural transposable element (TE) annotation of multiple maize genomes | TEs along a region of the genome: | We reconstruct the history of TEs nesting into each other. For example, the blue TE on the left inserted first, and then was disrupted by the insertion of green and yellow TEs",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "homepage": "https://mcstitzer.github.io/maize_TEs",
    "lastUpdate": "2020-12-28T11:30:34Z",
    "name": "TEs",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1111/TPJ.14489",
            "metadata": {
                "abstract": "© 2019 The Authors The Plant Journal © 2019 John Wiley & Sons LtdTransposable elements (TEs) are ubiquitous components of eukaryotic genomes and can create variation in genome organization and content. Most maize genomes are composed of TEs. We developed an approach to define shared and variable TE insertions across genome assemblies and applied this method to four maize genomes (B73, W22, Mo17 and PH207) with uniform structural annotations of TEs. Among these genomes we identified approximately 400 000 TEs that are polymorphic, encompassing 1.6 Gb of variable TE sequence. These polymorphic TEs include a combination of recent transposition events as well as deletions of older TEs. There are examples of polymorphic TEs within each of the superfamilies of TEs and they are found distributed across the genome, including in regions of recent shared ancestry among individuals. There are many examples of polymorphic TEs within or near maize genes. In addition, there are 2380 gene annotations in the B73 genome that are located within variable TEs, providing evidence for the role of TEs in contributing to the substantial differences in annotated gene content among these genotypes. TEs are highly variable in our survey of four temperate maize genomes, highlighting the major contribution of TEs in driving variation in genome organization and gene content. Open Research Badges: This article has earned an Open Data Badge for making publicly available the digitally-shareable data necessary to reproduce the reported results. The data is available at https://github.com/SNAnderson/maizeTE_variation; https://mcstitzer.github.io/maize_TEs.",
                "authors": [
                    {
                        "name": "Anderson S.N."
                    },
                    {
                        "name": "Stitzer M.C."
                    },
                    {
                        "name": "Brohammer A.B."
                    },
                    {
                        "name": "Zhou P."
                    },
                    {
                        "name": "Noshay J.M."
                    },
                    {
                        "name": "O'Connor C.H."
                    },
                    {
                        "name": "Hirsch C.D."
                    },
                    {
                        "name": "Ross-Ibarra J."
                    },
                    {
                        "name": "Hirsch C.N."
                    },
                    {
                        "name": "Springer N.M."
                    }
                ],
                "citationCount": 29,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Plant Journal",
                "title": "Transposable elements contribute to dynamic genome content in maize"
            },
            "pmid": "31381222"
        }
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ],
    "validated": 1
}