{
    "accessibility": "Open access",
    "additionDate": "2022-01-06T16:21:09.072215Z",
    "biotoolsCURIE": "biotools:or",
    "biotoolsID": "or",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "martinsgomes.jose@gmail.com",
            "name": "António Preto Gomes",
            "orcidid": "https://orcid.org/0000-0003-4203-2230"
        },
        {
            "email": "irina.moreira@cnc.uc.pt",
            "name": "Irina Moreira",
            "orcidid": "https://orcid.org/0000-0003-2970-5250",
            "url": "http://moreiralab.com/"
        }
    ],
    "description": "A multi-step approach including models’ construction (multiple sequence alignment, homology modeling), complex assembling (protein complex refinement with HADDOCK and complex equilibration), and protein-protein interface (PPI) characterization (including both structural and dynamics analysis) were performed. Our database can be easily applied to several GPCR sub-families, to determine the key structural and dynamical determinants involved in GPCR coupling selectivity.",
    "download": [
        {
            "type": "Biological data",
            "url": "http://www.moreiralab.com/resources/oor/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "elixirCommunity": [
        "3D-BioInfo"
    ],
    "elixirNode": [
        "Portugal"
    ],
    "elixirPlatform": [
        "Data",
        "Tools"
    ],
    "homepage": "http://www.moreiralab.com/resources/oor/",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2022-01-06T16:35:14.591159Z",
    "license": "GPL-3.0",
    "link": [
        {
            "note": "Application of the protocol to human Dopamine Receptors (DXR) and intracelullar partners.",
            "type": [
                "Other"
            ],
            "url": "http://www.moreiralab.com/resources/dxr/"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/MoreiraLAB/or"
        }
    ],
    "maturity": "Mature",
    "name": "OR and DXR",
    "owner": "ELIXIR-PT",
    "publication": [
        {
            "doi": "10.3389/fmolb.2021.715215",
            "metadata": {
                "abstract": "© Copyright © 2021 Barreto, Baptista, Preto, Silvério, Melo and Moreira.This paper describes an exciting big data analysis compiled in a freely available database, which can be applied to characterize the coupling of different G-Protein coupled receptors (GPCRs) families with their intracellular partners. Opioid receptor (OR) family was used as case study in order to gain further insights into the physiological properties of these important drug targets, known to be associated with the opioid crisis, a huge socio-economic issue directly related to drug abuse. An extensive characterization of all members of the ORs family (μ (MOR), δ (DOR), κ (KOR), nociceptin (NOP)) and their corresponding binding partners (ARRs: Arr2, Arr3; G-protein: Gi1, Gi2, Gi3, Go, Gob, Gz, Gq, G11, G14, G15, G12, Gssh, Gslo) was carried out. A multi-step approach including models’ construction (multiple sequence alignment, homology modeling), complex assembling (protein complex refinement with HADDOCK and complex equilibration), and protein-protein interface characterization (including both structural and dynamics analysis) were performed. Our database can be easily applied to several GPCR sub-families, to determine the key structural and dynamical determinants involved in GPCR coupling selectivity.",
                "authors": [
                    {
                        "name": "Baptista S.J."
                    },
                    {
                        "name": "Barreto C.A.V."
                    },
                    {
                        "name": "Melo R."
                    },
                    {
                        "name": "Moreira I.S."
                    },
                    {
                        "name": "Preto A.J."
                    },
                    {
                        "name": "Silverio D."
                    }
                ],
                "date": "2021-09-21T00:00:00Z",
                "journal": "Frontiers in Molecular Biosciences",
                "title": "Decoding Partner Specificity of Opioid Receptor Family"
            },
            "pmcid": "PMC8490921",
            "pmid": "34621786",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1021/acs.jcim.0c00371",
            "metadata": {
                "abstract": "© 2020 American Chemical Society.G-Protein coupled receptors (GPCRs) are involved in a myriad of pathways key for human physiology through the formation of complexes with intracellular partners such as G-proteins and arrestins (Arrs). However, the structural and dynamical determinants of these complexes are still largely unknown. Herein, we developed a computational big-data pipeline that enables the structural characterization of GPCR complexes with no available structure. This pipeline was used to study a well-known group of catecholamine receptors, the human dopamine receptor (DXR) family and its complexes, producing novel insights into the physiological properties of these important drug targets. A detailed description of the protein interfaces of all members of the DXR family (D1R, D2R, D3R, D4R, and D5R) and the corresponding protein interfaces of their binding partners (Arrs: Arr2 and Arr3; G-proteins: Gi1, Gi2, Gi3, Go, Gob, Gq, Gslo, Gssh, Gt2, and Gz) was generated. To produce reliable structures of the DXR family in complex with either G-proteins or Arrs, we performed homology modeling using as templates the structures of the β2-adrenergic receptor (β2AR) bound to Gs, the rhodopsin bound to Gi, and the recently acquired neurotensin receptor-1 (NTSR1) and muscarinic 2 receptor (M2R) bound to arrestin (Arr). Among others, the work demonstrated that the three partner groups, Arrs and Gs- and Gi-proteins, are all structurally and dynamically distinct. Additionally, it was revealed the involvement of different structural motifs in G-protein selective coupling between D1- and D2-like receptors. Having constructed and analyzed 50 models involving DXR, this work represents an unprecedented large-scale analysis of GPCR-intracellular partner interface determinants. All data is available at www.moreiralab.com/resources/dxr.",
                "authors": [
                    {
                        "name": "Almeida J.G.D."
                    },
                    {
                        "name": "Baptista S.J."
                    },
                    {
                        "name": "Barreto C.A.V."
                    },
                    {
                        "name": "Cordeiro M.N.D.S."
                    },
                    {
                        "name": "Kurkcuoglu Z."
                    },
                    {
                        "name": "Lemos A."
                    },
                    {
                        "name": "Melo A."
                    },
                    {
                        "name": "Melo R."
                    },
                    {
                        "name": "Moreira I.S."
                    },
                    {
                        "name": "Preto A.J."
                    }
                ],
                "citationCount": 3,
                "date": "2020-08-24T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "Understanding the Binding Specificity of G-Protein Coupled Receptors toward G-Proteins and Arrestins: Application to the Dopamine Receptor Family"
            },
            "pmid": "32692555",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        }
    ]
}
