{"credit":[{"email":"mitchellsrv@biochem.wisc.edu","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"url":"https://mitchell-lab.biochem.wisc.edu/KFC_Server/kfcmanual.html"}],"function":[{"operation":[{"term":"Protein modelling","uri":"http://edamontology.org/operation_0477"},{"term":"Protein binding site prediction","uri":"http://edamontology.org/operation_2575"},{"term":"Protein secondary structure prediction","uri":"http://edamontology.org/operation_0267"},{"term":"Protein model validation","uri":"http://edamontology.org/operation_0321"},{"term":"Protein structure prediction","uri":"http://edamontology.org/operation_0474"}]}],"labels":{"accessibility":["Open access"],"cost":"Free of charge","license":"Unlicense","maturity":"Mature","operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Protein interactions","uri":"http://edamontology.org/topic_0128"},{"term":"Protein binding sites","uri":"http://edamontology.org/topic_3534"},{"term":"Structure prediction","uri":"http://edamontology.org/topic_0082"},{"term":"Protein structure analysis","uri":"http://edamontology.org/topic_2814"},{"term":"Machine learning","uri":"http://edamontology.org/topic_3474"}]},"link":[{"type":"SERVICE","url":"https://mitchell-lab.biochem.wisc.edu/KFC_Server/upload.php"}],"publication":[{"abstract":"The KFC Server is a web-based implementation of the KFC (Knowledge-based FADE and Contacts) model-a machine learning approach for the prediction of binding hot spots, or the subset of residues that account for most of a protein interface's; binding free energy. The server facilitates the automated analysis of a user submitted protein-protein or protein-DNA interface and the visualization of its hot spot predictions. For each residue in the interface, the KFC Server characterizes its local structural environment, compares that environment to the environments of experimentally determined hot spots and predicts if the interface residue is a hot spot. After the computational analysis, the user can visualize the results using an interactive job viewer able to quickly highlight predicted hot spots and surrounding structural features within the protein structure. The KFC Server is accessible at http://kfc.mitchell-lab.org.","authors":["Darnell S.J.","LeGault L.","Mitchell J.C."],"cit_count":94,"journal":"Nucleic acids research","pmid":"18539611","title":"KFC Server: interactive forecasting of protein interaction hot spots.","type":"Primary","year":"2008-01-01"},{"abstract":"Hot spots constitute a small fraction of protein-protein interface residues, yet they account for a large fraction of the binding affinity. Based on our previous method (KFC), we present two new methods (KFC2a and KFC2b) that outperform other methods at hot spot prediction. A number of improvements were made in developing these new methods. First, we created a training data set that contained a similar number of hot spot and non-hot spot residues. In addition, we generated 47 different features, and different numbers of features were used to train the models to avoid over-fitting. Finally, two feature combinations were selected: One (used in KFC2a) is composed of eight features that are mainly related to solvent accessible surface area and local plasticity; the other (KFC2b) is composed of seven features, only two of which are identical to those used in KFC2a. The two models were built using support vector machines (SVM). The two KFC2 models were then tested on a mixed independent test set, and compared with other methods such as Robetta, FOLDEF, HotPoint, MINERVA, and KFC. KFC2a showed the highest predictive accuracy for hot spot residues (True Positive Rate: TPR = 0.85); however, the false positive rate was somewhat higher than for other models. KFC2b showed the best predictive accuracy for hot spot residues (True Positive Rate: TPR = 0.62) among all methods other than KFC2a, and the False Positive Rate (FPR = 0.15) was comparable with other highly predictive methods. Proteins 2011. © 2011 Wiley-Liss, Inc.","authors":["Zhu X.","Mitchell J.C."],"cit_count":107,"doi":"10.1002/prot.23094","journal":"Proteins: Structure, Function and Bioinformatics","title":"KFC2: A knowledge-based hot spot prediction method based on interface solvation, atomic density, and plasticity features","type":"Primary","version":"2","year":"2011-09-01"}],"summary":{"biotoolsCURIE":"biotools:kfc","biotoolsID":"kfc","description":"Web-based implementation of the Knowledge-based FADE and Contacts model. It predicts the subset of residues responsible for the majority of a protein interface&apos,s binding free energy. Users input protein-protein or protein-DNA information for visualization of binding hot spots within the protein structure.","homepage":"https://mitchell-lab.biochem.wisc.edu/KFC_Server/index.php","name":"KFC Server"}}