{
    "additionDate": "2021-01-18T09:20:24Z",
    "biotoolsCURIE": "biotools:maskmitosis",
    "biotoolsID": "maskmitosis",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Meriem Sebai",
            "typeEntity": "Person"
        },
        {
            "name": "Tianjiang Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "A deep learning framework for fully supervised, weakly supervised, and unsupervised mitosis detection in histopathology images.\n\nCodes for our Medical & Biological Engineering & Computing paper \"MaskMitosis: a deep learning framework for fully supervised, weakly supervised, and unsupervised mitosis detection in histopathology images\". Please see the paper for more details.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image annotation",
                    "uri": "http://edamontology.org/operation_3553"
                },
                {
                    "term": "Backbone modelling",
                    "uri": "http://edamontology.org/operation_0479"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/MeriemSebai/MaskMitosis",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-20T17:07:08Z",
    "name": "MaskMitosis",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1007/S11517-020-02175-Z",
            "metadata": {
                "abstract": "© 2020, International Federation for Medical and Biological Engineering.Counting the mitotic cells in histopathological cancerous tissue areas is the most relevant indicator of tumor grade in aggressive breast cancer diagnosis. In this paper, we propose a robust and accurate technique for the automatic detection of mitoses from histological breast cancer slides using the multi-task deep learning framework for object detection and instance segmentation Mask RCNN. Our mitosis detection and instance segmentation framework is deployed for two main tasks: it is used as a detection network to perform mitosis localization and classification in the fully annotated mitosis datasets (i.e., the pixel-level annotated datasets), and it is used as a segmentation network to estimate the mitosis mask labels for the weakly annotated mitosis datasets (i.e., the datasets with centroid-pixel labels only). We evaluate our approach on the fully annotated 2012 ICPR grand challenge dataset and the weakly annotated 2014 ICPR MITOS-ATYPIA challenge dataset. Our evaluation experiments show that we can obtain the highest F-score of 0.863 on the 2012 ICPR dataset by applying the mitosis detection and instance segmentation model trained on the pixel-level labels provided by this dataset. For the weakly annotated 2014 ICPR dataset, we first employ the mitosis detection and instance segmentation model trained on the fully annotated 2012 ICPR dataset to segment the centroid-pixel annotated mitosis ground truths, and produce the mitosis mask and bounding box labels. These estimated labels are then used to train another mitosis detection and instance segmentation model for mitosis detection on the 2014 ICPR dataset. By adopting this two-stage framework, our method outperforms all state-of-the-art mitosis detection approaches on the 2014 ICPR dataset by achieving an F-score of 0.475. Moreover, we show that the proposed framework can also perform unsupervised mitosis detection through the estimation of pseudo labels for an unlabeled dataset and it can achieve promising detection results. Code has been made available at: https://github.com/MeriemSebai/MaskMitosis. [Figure not available: see fulltext.].",
                "authors": [
                    {
                        "name": "Sebai M."
                    },
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Wang T."
                    }
                ],
                "citationCount": 2,
                "date": "2020-07-01T00:00:00Z",
                "journal": "Medical and Biological Engineering and Computing",
                "title": "MaskMitosis: a deep learning framework for fully supervised, weakly supervised, and unsupervised mitosis detection in histopathology images"
            },
            "pmid": "32445109"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}