{
    "additionDate": "2017-08-03T18:37:52Z",
    "biotoolsCURIE": "biotools:braincloud",
    "biotoolsID": "braincloud",
    "credit": [
        {
            "email": "brain.cloud@libd.org",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://braincloud.jhmi.edu/"
        }
    ],
    "description": "Freely-available, biologist-friendly, stand-alone application for exploring the temporal dynamics and genetic control of transcription in the human prefrontal cortex across the lifespan. The BrainCloud applications will contain expression or methylation data, while users will have to register with dbGaP to integrate SNP data.",
    "documentation": [
        {
            "type": "General",
            "url": "http://braincloud.jhmi.edu/braincloudPublication.htm"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "http://braincloud.jhmi.edu/",
    "lastUpdate": "2018-12-10T12:58:43Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/braincloud-1-0-0-20-exploration-of-genetic-associations-with-gene-expression-in-the-prefrontal-cortex.html"
        }
    ],
    "name": "BrainCloud",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Previous investigations have combined transcriptional and genetic analyses in human cell lines, but few have applied these techniques to human neural tissue. To gain a global molecular perspective on the role of the human genome in cortical development, function and ageing, we explore the temporal dynamics and genetic control of transcription in human prefrontal cortex in an extensive series of post-mortem brains from fetal development through ageing. We discover a wave of gene expression changes occurring during fetal development which are reversed in early postnatal life. One half-century later in life, this pattern of reversals is mirrored in ageing and in neurodegeneration. Although we identify thousands of robust associations of individual genetic polymorphisms with gene expression, we also demonstrate that there is no association between the total extent of genetic differences between subjects and the global similarity of their transcriptional profiles. Hence, the human genome produces a consistent molecular architecture in the prefrontal cortex, despite millions of genetic differences across individuals and races. To enable further discovery, this entire data set is freely available (from Gene Expression Omnibus: accession GSE30272; and dbGaP: accession phs000417.v1.p1) and can also be interrogated via a biologist-friendly stand-alone application (http://www.libd.org/braincloud). © 2011 Macmillan Publishers Limited. All rights reserved.",
                "authors": [
                    {
                        "name": "Colantuoni C."
                    },
                    {
                        "name": "Lipska B.K."
                    },
                    {
                        "name": "Ye T."
                    },
                    {
                        "name": "Hyde T.M."
                    },
                    {
                        "name": "Tao R."
                    },
                    {
                        "name": "Leek J.T."
                    },
                    {
                        "name": "Colantuoni E.A."
                    },
                    {
                        "name": "Elkahloun A.G."
                    },
                    {
                        "name": "Herman M.M."
                    },
                    {
                        "name": "Weinberger D.R."
                    },
                    {
                        "name": "Kleinman J.E."
                    }
                ],
                "citationCount": 387,
                "date": "2011-10-27T00:00:00Z",
                "journal": "Nature",
                "title": "Temporal dynamics and genetic control of transcription in the human prefrontal cortex"
            },
            "pmid": "22031444"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1
}