{
    "additionDate": "2020-01-14T09:48:51Z",
    "biotoolsCURIE": "biotools:BORIS",
    "biotoolsID": "BORIS",
    "confidence_flag": "tool",
    "description": "BORIS: R package for Bayesian Outbreak Reconstruction Inference and Simulation.\nTransmission network reconstruction for foot-and-mouth disease outbreaks incorporating farm-level covariates.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                },
                {
                    "term": "Recombination detection",
                    "uri": "http://edamontology.org/operation_0451"
                }
            ]
        }
    ],
    "homepage": "https://github.com/sfires/BORIS",
    "language": [
        "C++",
        "R"
    ],
    "lastUpdate": "2021-01-14T17:02:38Z",
    "license": "GPL-2.0",
    "name": "BORIS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/835421"
        },
        {
            "doi": "10.1371/journal.pone.0235660",
            "metadata": {
                "abstract": "© 2020 Firestone et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Transmission network modelling to infer ‘who infected whom’ in infectious disease outbreaks is a highly active area of research. Outbreaks of foot-and-mouth disease have been a key focus of transmission network models that integrate genomic and epidemiological data. The aim of this study was to extend Lau’s systematic Bayesian inference framework to incorporate additional parameters representing predominant species and numbers of animals held on a farm. Lau’s Bayesian Markov chain Monte Carlo algorithm was reformulated, verified and pseudo-validated on 100 simulated outbreaks populated with demographic data Japan and Australia. The modified model was then implemented on genomic and epidemiological data from the 2010 outbreak of foot-and-mouth disease in Japan, and outputs compared to those from the SCOTTI model implemented in BEAST2. The modified model achieved improvements in overall accuracy when tested on the simulated outbreaks. When implemented on the actual outbreak data from Japan, infected farms that held predominantly pigs were estimated to have five times the transmissibility of infected cattle farms and be 49% less susceptible. The farm-level incubation period was 1 day shorter than the latent period, the timing of the seeding of the outbreak in Japan was inferred, as were key linkages between clusters and features of farms involved in widespread dissemination of this outbreak. To improve accessibility the modified model has been implemented as the R package ‘BORIS’ for use in future outbreaks.",
                "authors": [
                    {
                        "name": "Bradhurst R.A."
                    },
                    {
                        "name": "Demirhan H."
                    },
                    {
                        "name": "Firestone S.M."
                    },
                    {
                        "name": "Hayama Y."
                    },
                    {
                        "name": "Lau M.S.Y."
                    },
                    {
                        "name": "Nishi T."
                    },
                    {
                        "name": "Stevenson M.A."
                    },
                    {
                        "name": "Tsutsui T."
                    },
                    {
                        "name": "Yamamoto T."
                    }
                ],
                "citationCount": 4,
                "date": "2020-07-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Transmission network reconstruction for foot- and-mouth disease outbreaks incorporating farm-level covariates"
            },
            "pmcid": "PMC7363093",
            "pmid": "32667952"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ],
    "validated": 1
}
