{"credit":[{"email":"shzhang@cs.ucf.edu","name":"Shaojie Zhang","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://genome.ucf.edu/"}],"documentation":[{"type":"GENERAL","url":"http://genome.ucf.edu/PAL/"}],"function":[{"operation":[{"term":"Prediction and recognition","uri":"http://edamontology.org/operation_2423"}]}],"labels":{"operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"RNA","uri":"http://edamontology.org/topic_0099"},{"term":"Functional, regulatory and non-coding RNA","uri":"http://edamontology.org/topic_0659"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/pal-1-31-pseudoknot-aligment-rna-sequences.html"}],"publication":[{"abstract":"In this paper, we address the problem of discovering novel non-coding RNA (ncRNA) using primary sequence, and secondary structure conservation, focusing on ncRNA families with pseudoknotted structures. Our main technical result is an efficient algorithm for computing an optimum structural alignment of an RNA sequence against a genomic substring. This algorithm has two applications. First, by scanning a genome, we can identify novel (homologous) pseudoknotted ncRNA, and second, we can infer the secondary structure of the target aligned sequence. We test an implementation of our algorithm (PAL) and show that it has near-perfect behavior for predicting the structure of many known pseudoknots. Additionally, it can detect the true homologs with high sensitivity and specificity in controlled tests. We also use PAL to search entire viral genome and mouse genome for novel homologs of some viral and eukaryotic pseudoknots, respectively. In each case, we have found strong support for novel homologs. © Mary Ann Liebert, Inc. 2008.","authors":["Han B.","Dost B.","Bafna V.","Zhang S."],"cit_count":25,"journal":"Journal of Computational Biology","pmid":"18549303","title":"Structural alignment of pseudoknotted RNA","year":"2008-06-01"}],"summary":{"biotoolsCURIE":"biotools:pal","biotoolsID":"pal","description":"Implementation of an efficient algorithm to compute an optimal structural alignment of an RNA sequence against a genomic substring.","homepage":"http://genome.ucf.edu/PAL/","name":"PAL"}}