{
    "additionDate": "2017-03-27T12:32:33Z",
    "biotoolsCURIE": "biotools:tadb",
    "biotoolsID": "tadb",
    "credit": [
        {
            "email": "hyou@sjtu.edu.cn",
            "name": "Hong-Yu OU",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "TADB is an integrated database that provides comprehensive information about Type 2 toxin-antitoxin (TA) loci. TADB offers both predicted and experimentally supported Type 2 TA loci-relevant data. A broad range of similarity search, sequence alignment, genome context browser and phylogenetic tools are readily accessible via TADB.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://202.120.12.135/TADB2/Introduction.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence similarity search",
                    "uri": "http://edamontology.org/operation_0346"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Genome visualisation",
                    "uri": "http://edamontology.org/operation_3208"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo-mml.sjtu.edu.cn/TADB/",
    "language": [
        "PHP",
        "JavaScript",
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "TADB",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "TADB (http://bioinfo-mml.sjtu.edu.cn/TADB/) is an integrated database that provides comprehensive information about Type 2 toxin-antitoxin (TA) loci, genetic features that are richly distributed throughout bacterial and archaeal genomes. Two-gene and much less frequently three-gene Type 2 TA loci code for cognate partners that have been hypothesized or demonstrated to play key roles in stress response, bacterial physiology and stabilization of horizontally acquired genetic elements. TADB offers a unique compilation of both predicted and experimentally supported Type 2 TA loci-relevant data and currently contains 10 753 Type 2 TA gene pairs identified within 1240 prokaryotic genomes, and details of over 240 directly relevant scientific publications. A broad range of similarity search, sequence alignment, genome context browser and phylogenetic tools are readily accessible via TADB. We propose that TADB will facilitate efficient, multi-disciplinary and innovative exploration of the bacteria and archaea Type 2 TA space, better defining presently recognized TA-related phenomena and potentially even leading to yet-to-be envisaged frontiers. The TADB database, envisaged as a one-stop shop for Type 2 TA-related research, will be maintained, updated and improved regularly to ensure its ongoing maximum utility to the research community. © The Author(s) 2010.",
                "authors": [
                    {
                        "name": "Shao Y."
                    },
                    {
                        "name": "Harrison E.M."
                    },
                    {
                        "name": "Bi D."
                    },
                    {
                        "name": "Tai C."
                    },
                    {
                        "name": "He X."
                    },
                    {
                        "name": "Ou H.-Y."
                    },
                    {
                        "name": "Rajakumar K."
                    },
                    {
                        "name": "Deng Z."
                    }
                ],
                "citationCount": 151,
                "date": "2011-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "TADB: A web-based resource for Type 2 toxin-antitoxin loci in bacteria and archaea"
            },
            "pmid": "20929871"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}