{
    "additionDate": "2019-11-14T19:36:20Z",
    "biotoolsCURIE": "biotools:DisCVR",
    "biotoolsID": "DisCVR",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Joseph.Hughes@glasgow.ac.uk",
            "name": "Joseph Hughes",
            "orcidid": "https://orcid.org/0000-0003-2556-2563",
            "typeEntity": "Person"
        },
        {
            "email": "Maha.Maabar@glasgow.ac.uk",
            "name": "Maha Maabar",
            "typeEntity": "Person"
        }
    ],
    "description": "Rapid viral diagnosis from high-throughput sequencing data | High-throughput sequencing (HTS) enables most pathogens in a clinical sample to be detected from a single analysis, thereby providing novel opportunities for diagnosis, surveillance, and epidemiology. However, this powerful technology is difficult to apply in diagnostic laboratories because of its computational and bioinformatic demands. We have developed DisCVR, which detects known human viruses in clinical samples by matching sample k-mers (twenty-two nucleotide sequences) to k-mers from taxonomically labeled viral genomes. DisCVR was validated using published HTS data for eighty-nine clinical samples from adults with upper respiratory tract infections. These samples had been tested for viruses metagenomically and also by real-time polymerase chain reaction assay, which is the standard diagnostic method",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "k-mer counting",
                    "uri": "http://edamontology.org/operation_3472"
                }
            ]
        }
    ],
    "homepage": "https://bioinformatics.cvr.ac.uk/software/discvr/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2020-12-22T08:10:29Z",
    "name": "DisCVR",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/VE/VEZ033",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.High-Throughput sequencing (HTS) enables most pathogens in a clinical sample to be detected from a single analysis, thereby providing novel opportunities for diagnosis, surveillance, and epidemiology. However, this powerful technology is difficult to apply in diagnostic laboratories because of its computational and bioinformatic demands. We have developed DisCVR, which detects known human viruses in clinical samples by matching sample k-mers (twenty-Two nucleotide sequences) to k-mers from taxonomically labeled viral genomes. DisCVR was validated using published HTS data for eighty-nine clinical samples from adults with upper respiratory tract infections. These samples had been tested for viruses metagenomically and also by real-Time polymerase chain reaction assay, which is the standard diagnostic method. DisCVR detected human viruses with high sensitivity (79%) and specificity (100%), and was able to detect mixed infections. Moreover, it produced results comparable to those in a published metagenomic analysis of 177 blood samples from patients in Nigeria. DisCVR has been designed as a user-friendly tool for detecting human viruses from HTS data using computers with limited RAM and processing power, and includes a graphical user interface to help users interpret and validate the output. It is written in Java and is publicly available from http://bioinformatics.cvr.ac.uk/discvr.php.",
                "authors": [
                    {
                        "name": "Davison A.J."
                    },
                    {
                        "name": "Gunson R."
                    },
                    {
                        "name": "Hughes J."
                    },
                    {
                        "name": "Maabar M."
                    },
                    {
                        "name": "Murcia P.R."
                    },
                    {
                        "name": "Palmarini M."
                    },
                    {
                        "name": "Thorburn F."
                    },
                    {
                        "name": "Vucak M."
                    }
                ],
                "citationCount": 1,
                "date": "2019-07-01T00:00:00Z",
                "journal": "Virus Evolution",
                "title": "DisCVR: Rapid viral diagnosis from high-Throughput sequencing data"
            },
            "pmcid": "PMC6735924",
            "pmid": "31528358"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "PCR experiment",
            "uri": "http://edamontology.org/topic_3519"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ],
    "validated": 1
}
