{
    "additionDate": "2017-01-17T15:06:10Z",
    "biotoolsCURIE": "biotools:meigor",
    "biotoolsID": "meigor",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "josea.egea@upct.es",
            "name": "Jose Egea",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A software suite based on metaheuristics for global optimization in systems biology and bioinformatics.",
    "documentation": [
        {
            "type": "User manual",
            "url": "http://bioconductor.org/packages/release/bioc/html/MEIGOR.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/MEIGOR_1.8.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Optimisation and refinement",
                    "uri": "http://edamontology.org/operation_2425"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/MEIGOR.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "license": "GPL-3.0",
    "name": "MEIGOR",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-15-136",
            "metadata": {
                "abstract": "Background: Optimization is the key to solving many problems in computational biology. Global optimization methods, which provide a robust methodology, and metaheuristics in particular have proven to be the most efficient methods for many applications. Despite their utility, there is a limited availability of metaheuristic tools. Results: We present MEIGO, an R and Matlab optimization toolbox (also available in Python via a wrapper of the R version), that implements metaheuristics capable of solving diverse problems arising in systems biology and bioinformatics. The toolbox includes the enhanced scatter search method (eSS) for continuous nonlinear programming (cNLP) and mixed-integer programming (MINLP) problems, and variable neighborhood search (VNS) for Integer Programming (IP) problems. Additionally, the R version includes BayesFit for parameter estimation by Bayesian inference. The eSS and VNS methods can be run on a single-thread or in parallel using a cooperative strategy. The code is supplied under GPLv3 and is available at http://www.iim.csic.es/~gingproc/meigo.html. Documentation and examples are included. The R package has been submitted to BioConductor. We evaluate MEIGO against optimization benchmarks, and illustrate its applicability to a series of case studies in bioinformatics and systems biology where it outperforms other state-of-the-art methods. Conclusions: MEIGO provides a free, open-source platform for optimization that can be applied to multiple domains of systems biology and bioinformatics. It includes efficient state of the art metaheuristics, and its open and modular structure allows the addition of further methods. © 2014 Egea et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Egea J.A."
                    },
                    {
                        "name": "Henriques D."
                    },
                    {
                        "name": "Cokelaer T."
                    },
                    {
                        "name": "Villaverde A.F."
                    },
                    {
                        "name": "MacNamara A."
                    },
                    {
                        "name": "Danciu D.-P."
                    },
                    {
                        "name": "Banga J.R."
                    },
                    {
                        "name": "Saez-Rodriguez J."
                    }
                ],
                "citationCount": 46,
                "date": "2014-05-10T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "MEIGO: An open-source software suite based on metaheuristics for global optimization in systems biology and bioinformatics"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Data quality management",
            "uri": "http://edamontology.org/topic_3572"
        }
    ],
    "validated": 1,
    "version": [
        "1.8.0"
    ]
}