{"collectionID": ["BioConductor"], "accessibility": [], "topic": [{"term": "ChIP-seq", "uri": "http://edamontology.org/topic_3169"}, {"term": "Genomics", "uri": "http://edamontology.org/topic_0622"}], "owner": "bioconductor_import", "cost": null, "relation": [], "download": [{"url": "http://bioconductor/packages/release/bioc/src/contrib/iChip_1.28.0.tar.gz", "note": null, "version": null, "type": "Source code"}], "validated": 1, "publication": [{"doi": "10.1093/bioinformatics/btq032", "note": null, "version": null, "pmid": null, "type": "Primary", "pmcid": null, "metadata": {"title": "A hidden Ising model for ChIP-chip data analysis", "abstract": "Motivation: Chromatin immunoprecipitation (ChIP) coupled with tiling microarray (chip) experiments have been used in a wide range of biological studies such as identification of transcription factor binding sites and investigation of DNA methylation and histone modification. Hidden Markov models are widely used to model the spatial dependency of ChIP-chip data. However, parameter estimation for these models is typically either heuristic or suboptimal, leading to inconsistencies in their applications. To overcome this limitation and to develop an efficient software, we propose a hidden ferromagnetic Ising model for ChIP-chip data analysis. Results: We have developed a simple, but powerful Bayesian hierarchical model for ChIP-chip data via a hidden Ising model. Metropolis within Gibbs sampling algorithm is used to simulate from the posterior distribution of the model parameters. The proposed model naturally incorporates the spatial dependency of the data, and can be used to analyze data with various genomic resolutions and sample sizes. We illustrate the method using three publicly available datasets and various simulated datasets, and compare it with three closely related methods, namely TileMap HMM, tileHMM and BAC. We find that our method performs as well as TileMap HMM and BAC for the high-resolution data from Affymetrix platform, but significantly outperforms the other three methods for the low-resolution data from Agilent platform. Compared with the BAC method which also involves MCMC simulations, our method is computationally much more efficient. Availability: A software called iChip is freely available at http://www.bioconductor.org/. Contact: moq@mskcc.org. © The Author 2010. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oxfordjournals.org.", "citationCount": 6, "authors": [{"name": "Mo Q."}, {"name": "Liang F."}], "date": "2010-01-28T00:00:00Z", "journal": "Bioinformatics"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": "Qianxing Mo", "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "qmo@bcm.edu"}], "biotoolsCURIE": "biotools:ichip", "elixirPlatform": [], "elixirNode": [], "version": ["1.28.0"], "elixir_badge": 0, "homepage": "http://bioconductor.org/packages/release/bioc/html/iChip.html", "function": [{"note": null, "input": [], "operation": [{"term": "Enrichment analysis", "uri": "http://edamontology.org/operation_3501"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:50Z", "otherID": [], "description": "This package uses hidden Ising models to identify enriched genomic regions in ChIP-chip data.  It can be used to analyze the data from multiple platforms (e.g., Affymetrix, Agilent, and NimbleGen), and the data with single to multiple replicates.", "toolType": ["Command-line tool", "Library"], "editPermission": {"type": "private", "authors": []}, "language": ["R"], "link": [], "biotoolsID": "ichip", "additionDate": "2017-01-17T14:59:48Z", "name": "iChip", "license": "GPL-2.0", "documentation": [{"url": "http://bioconductor.org/packages/release/bioc/html/iChip.html", "note": null, "type": "User manual"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux", "Windows", "Mac"]}