
{
    "credit": [
        {
            "email": "katerina.kechris@ucdenver.edu",
            "name": "Katerina J. Kechris",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://csph.ucdenver.edu/Sites/Kechris"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://r-forge.r-project.org/projects/lcmix/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Data integration and warehousing",
                "uri": "http://edamontology.org/topic_3366"
            },
            {
                "term": "Machine learning",
                "uri": "http://edamontology.org/topic_3474"
            },
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/lcmix-r-package-using-hierarchical-mixture-models-for-genomic-data-integration.html"
        }
    ],
    "publication": [
        {
            "abstract": "Making effective use of multiple data sources is a major challenge in modern bioinformatics. Genome-wide data such as measures of transcription factor binding, gene expression, and sequence conservation, which are used to identify binding regions and genes that are important to major biological processes such as development and disease, can be difficult to use together due to the different biological meanings and statistical distributions of the heterogeneous data types, but each can provide valuable information for understanding the processes under study. Here we present methods for integrating multiple data sources to gain a more complete picture of gene regulation and expression. Our goal is to identify genes and cis-regulatory regions which play specific biological roles. We describe a graphical mixture model approach for data integration, examine the effect of using different model topologies, and discuss methods for evaluating the effectiveness of the models. Model fitting is computationally efficient and produces results which have clear biological and statistical interpretations. The Hedgehog and Dorsal signaling pathways in Drosophila, which are critical in embryonic development, are used as examples. © 2013 Walter de Gruyter GmbH, Berlin/Boston.",
            "authors": [
                "Dvorkin D.",
                "Biehs B.",
                "Kechris K."
            ],
            "cit_count": 3,
            "journal": "Statistical Applications in Genetics and Molecular Biology",
            "pmid": "23934610",
            "title": "A graphical model method for integrating multiple sources of genome-scale data",
            "year": "2013-08-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:lcmix",
        "biotoolsID": "lcmix",
        "description": "R package using hierarchical mixture models for genomic data integration.",
        "homepage": "http://lcmix.r-forge.r-project.org/",
        "name": "lcmix"
    }
}