{
    "additionDate": "2017-03-27T12:32:51Z",
    "biotoolsCURIE": "biotools:ikmc",
    "biotoolsID": "ikmc",
    "credit": [
        {
            "email": "ringwald@informatics.jax.org",
            "name": "Martin Ringwald",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The International Knockout Mouse Consortium database and web portal which serves as the central public web site for IKMC data. Researchers can access up-to-date information on IKMC knockout vectors, ES cells and mice for specific genes, and follow links to the respective repositories from which corresponding IKMC products can be ordered. Researchers can also use the web site to nominate genes for targeting, or to indicate that targeting of a gene should receive high priority.",
    "documentation": [
        {
            "type": "General",
            "url": "http://www.mousephenotype.org/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Gene functional annotation",
                    "uri": "http://edamontology.org/operation_3672"
                }
            ]
        }
    ],
    "homepage": "http://www.knockoutmouse.org",
    "language": [
        "Java",
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "name": "IKMC",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "The International Knockout Mouse Consortium (IKMC) aims to mutate all protein-coding genes in the mouse using a combination of gene targeting and gene trapping in mouse embryonic stem (ES) cells and to make the generated resources readily available to the research community. The IKMC database and web portal (www.knockoutmouse .org) serves as the central public web site for IKMC data and facilitates the coordination and prioritization of work within the consortium. Researchers can access up-to-date information on IKMC knockout vectors, ES cells and mice for specific genes, and follow links to the respective repositories from which corresponding IKMC products can be ordered. Researchers can also use the web site to nominate genes for targeting, or to indicate that targeting of a gene should receive high priority. The IKMC database provides data to, and features extensive interconnections with, other community databases. © The Author(s) 2010.",
                "authors": [
                    {
                        "name": "Ringwald M."
                    },
                    {
                        "name": "Iyer V."
                    },
                    {
                        "name": "Mason J.C."
                    },
                    {
                        "name": "Stone K.R."
                    },
                    {
                        "name": "Tadepally H.D."
                    },
                    {
                        "name": "Kadin J.A."
                    },
                    {
                        "name": "Bult C.J."
                    },
                    {
                        "name": "Eppig J.T."
                    },
                    {
                        "name": "Oakley D.J."
                    },
                    {
                        "name": "Briois S."
                    },
                    {
                        "name": "Stupka E."
                    },
                    {
                        "name": "Maselli V."
                    },
                    {
                        "name": "Smedley D."
                    },
                    {
                        "name": "Liu S."
                    },
                    {
                        "name": "Hansen J."
                    },
                    {
                        "name": "Baldock R."
                    },
                    {
                        "name": "Hicks G.G."
                    },
                    {
                        "name": "Skarnes W.C."
                    }
                ],
                "citationCount": 66,
                "date": "2011-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "The IKMC web portal: A central point of entry to data and resources from the International Knockout Mouse Consortium"
            },
            "pmid": "20929875"
        },
        {
            "metadata": {
                "abstract": "In this article, we describe the use of the BioMart data management system to provide integrated access to International Knockout Mouse Consortium (IKMC) data and other related mouse resources. The IKMC is currently mutating all mouse protein-coding genes in embryonic stem (ES) cells using gene targeting and gene trapping approaches. The BioMart portal allows researchers to identify and obtain IKMC knockout vectors, ES cells and mice for genes of interest. Gene annotation, expression, phenotype and disease data is also integrated from external BioMarts, allowing selection of IKMC products by a wide variety of criteria. These products are invaluable for researchers involved in the elucidation of gene function and the role of individual genes in human disease. Here, we describe these datasets in more detail and illustrate the functionality of the portal using several examples. © The Author(s) 2011.",
                "authors": [
                    {
                        "name": "Oakley D.J."
                    },
                    {
                        "name": "Iyer V."
                    },
                    {
                        "name": "Skarnes W.C."
                    },
                    {
                        "name": "Smedley D."
                    }
                ],
                "citationCount": 7,
                "date": "2011-12-01T00:00:00Z",
                "journal": "Database",
                "title": "BioMart as an integration solution for the International Knockout Mouse Consortium"
            },
            "pmid": "21930503"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        },
        {
            "term": "Regenerative medicine",
            "uri": "http://edamontology.org/topic_3395"
        }
    ],
    "validated": 1
}