
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://rseqc.sourceforge.net/#contact"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://rseqc.sourceforge.net/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "ELIXIR Trainer Tools"
        ],
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Suite"
        ],
        "topic": [
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Motivation: RNA-seq has been extensively used for transcriptome study. Quality control (QC) is critical to ensure that RNA-seq data are of high quality and suitable for subsequent analyses. However, QC is a time-consuming and complex task, due to the massive size and versatile nature of RNA-seq data. Therefore, a convenient and comprehensive QC tool to assess RNA-seq quality is sorely needed.Results: We developed the RSeQC package to comprehensively evaluate different aspects of RNA-seq experiments, such as sequence quality, GC bias, polymerase chain reaction bias, nucleotide composition bias, sequencing depth, strand specificity, coverage uniformity and read distribution over the genome structure. RSeQC takes both SAM and BAM files as input, which can be produced by most RNA-seq mapping tools as well as BED files, which are widely used for gene models. Most modules in RSeQC take advantage of R scripts for visualization, and they are notably efficient in dealing with large BAM/SAM files containing hundreds of millions of alignments. © The Author (2012). Published by Oxford University Press. All rights reserved.",
            "authors": [
                "Wang L.",
                "Wang S.",
                "Li W."
            ],
            "cit_count": 412,
            "doi": "10.1093/bioinformatics/bts356",
            "journal": "Bioinformatics",
            "title": "RSeQC: Quality control of RNA-seq experiments",
            "year": "2012-08-01"
        },
        {
            "abstract": "© 2016 Wang et al. Background: Stored biological samples with pathology information and medical records are invaluable resources for translational medical research. However, RNAs extracted from the archived clinical tissues are often substantially degraded. RNA degradation distorts the RNA-seq read coverage in a gene-specific manner, and has profound influences on whole-genome gene expression profiling. Result: We developed the transcript integrity number (TIN) to measure RNA degradation. When applied to 3 independent RNA-seq datasets, we demonstrated TIN is a reliable and sensitive measure of the RNA degradation at both transcript and sample level. Through comparing 10 prostate cancer clinical samples with lower RNA integrity to 10 samples with higher RNA quality, we demonstrated that calibrating gene expression counts with TIN scores could effectively neutralize RNA degradation effects by reducing false positives and recovering biologically meaningful pathways. When further evaluating the performance of TIN correction using spike-in transcripts in RNA-seq data generated from the Sequencing Quality Control consortium, we found TIN adjustment had better control of false positives and false negatives (sensitivity = 0.89, specificity = 0.91, accuracy = 0.90), as compared to gene expression analysis results without TIN correction (sensitivity = 0.98, specificity = 0.50, accuracy = 0.86). Conclusion: TIN is a reliable measurement of RNA integrity and a valuable approach used to neutralize in vitro RNA degradation effect and improve differential gene expression analysis.",
            "authors": [
                "Wang L.",
                "Nie J.",
                "Sicotte H.",
                "Li Y.",
                "Eckel-Passow J.E.",
                "Dasari S.",
                "Vedell P.T.",
                "Barman P.",
                "Wang L.",
                "Weinshiboum R.",
                "Jen J.",
                "Huang H.",
                "Kohli M.",
                "Kocher J.-P.A."
            ],
            "cit_count": 24,
            "doi": "10.1186/s12859-016-0922-z",
            "journal": "BMC Bioinformatics",
            "title": "Measure transcript integrity using RNA-seq data",
            "year": "2016-02-03"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:rseqc",
        "biotoolsID": "rseqc",
        "description": "Provides a number of useful modules that can comprehensively evaluate high throughput sequence data especially RNA-seq data. Some basic modules quickly inspect sequence quality, nucleotide composition bias, PCR bias and GC bias, while RNA-seq specific modules evaluate sequencing saturation, mapped reads distribution, coverage uniformity, strand specificity, transcript level RNA integrity etc.",
        "homepage": "http://rseqc.sourceforge.net",
        "name": "RSeQC"
    }
}