{
    "additionDate": "2023-01-28T13:21:35.087221Z",
    "biotoolsCURIE": "biotools:flowsa",
    "biotoolsID": "flowsa",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "birney.catherine@epa.gov",
            "name": "Catherine Birney",
            "orcidid": "https://orcid.org/0000-0003-4467-9927",
            "typeEntity": "Person"
        }
    ],
    "description": "A Python Package Attributing Resource Use, Waste, Emissions, and Other Flows to Industries.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/USEPA/flowsa/wiki"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                }
            ]
        }
    ],
    "homepage": "https://edap-ord-data-commons.s3.amazonaws.com/index.html?prefix=flowsa/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-01-28T13:21:35.089926Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/USEPA/flowsa"
        }
    ],
    "name": "FLOWSA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3390/APP12115742",
            "metadata": {
                "abstract": "© 2022 by the authors. Licensee MDPI, Basel, Switzerland.Quantifying industry consumption or production of resources, wastes, emissions, and losses—collectively called flows—is a complex and evolving process. The attribution of flows to industries often requires allocating multiple data sources that span spatial and temporal scopes and contain varied levels of aggregation. Once calculated, datasets can quickly become outdated with new releases of source data. The US Environmental Protection Agency (USEPA) developed the open-source Flow Sector Attribution (FLOWSA) Python package to address the challenges sur-rounding attributing flows to US industrial and final-use sectors. Models capture flows drawn from or released to the environment by sectors, as well as flow transfers between sectors. Data on flow use and generation by source-defined activities are imported from providers and transformed into standardized tables but are otherwise numerically unchanged in preparation for modeling. FLOWSA sector attribution models allocate primary data sources to industries using secondary data sources and file mapping activities to sectors. Users can modify methodological, spatial, and temporal parameters to explore and compare the impact of sector attribution methodological changes on model results. The standardized data outputs from these models are used as the environmental data inputs into the latest version of USEPA’s US Environmentally Extended Input–Output (USEEIO) models, life cycle models of US goods and services for ~400 categories. This communication demonstrates FLOWSA’s capability by describing how to build models and providing select model results for US industry use of water, land, and employment. FLOWSA is available on GitHub, and many of the data outputs are available on the USEPA’s Data Commons.",
                "authors": [
                    {
                        "name": "Birney C."
                    },
                    {
                        "name": "Conner M."
                    },
                    {
                        "name": "Ingwersen W.W."
                    },
                    {
                        "name": "Li M."
                    },
                    {
                        "name": "Specht J."
                    },
                    {
                        "name": "Young B."
                    }
                ],
                "date": "2022-06-01T00:00:00Z",
                "journal": "Applied Sciences (Switzerland)",
                "title": "FLOWSA: A Python Package Attributing Resource Use, Waste, Emissions, and Other Flows to Industries"
            },
            "pmcid": "PMC9628186",
            "pmid": "36330151"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        }
    ]
}
