{
    "accessibility": "Open access",
    "additionDate": "2023-05-16T16:33:30.313849Z",
    "biotoolsCURIE": "biotools:covid19_outbreak_simulator",
    "biotoolsID": "covid19_outbreak_simulator",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "bo.peng@bcm.edu",
            "name": "Bo Peng",
            "orcidid": "https://orcid.org/0000-0001-8225-2284",
            "typeEntity": "Person",
            "url": "https://github.com/ictr/covid19-outbreak-simulator/issues"
        }
    ],
    "description": "Population-based Forward-time Simulator for the Outbreak of COVID-19",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://ictr.github.io/covid19-outbreak-simulator/docs/home/"
        }
    ],
    "download": [
        {
            "type": "Downloads page",
            "url": "https://pypi.org/project/covid19-outbreak-simulator/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://ictr.github.io/covid19-outbreak-simulator/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:47:52.167318Z",
    "license": "BSD-3-Clause",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/ictr/covid19-outbreak-simulator"
        }
    ],
    "maturity": "Mature",
    "name": "COVID19 Outbreak Simulator",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "bo.peng",
    "publication": [
        {
            "doi": "10.1093/jamiaopen/ooaa074",
            "metadata": {
                "abstract": "Objectives: We developed COVID-19 Outbreak Simulator (https://ictr.github.io/covid19-outbreak-simulator/) to quantitatively estimate the effectiveness of preventative and interventive measures to prevent and battle COVID-19 outbreaks for specific populations. Materials and methods: Our simulator simulates the entire course of infection and transmission of the virus among individuals in heterogeneous populations, subject to operations and influences, such as quarantine, testing, social distancing, and community infection. It provides command-line and Jupyter notebook interfaces and a plugin system for user-defined operations. Results: The simulator provides quantitative estimates for COVID-19 outbreaks in a variety of scenarios and assists the development of public health policies, risk-reduction operations, and emergency response plans. Discussion: Our simulator is powerful, flexible, and customizable, although successful applications require realistic estimation and robustness analysis of population-specific parameters. Conclusion: Risk assessment and continuity planning for COVID-19 outbreaks are crucial for the continued operation of many organizations. Our simulator will be continuously expanded to meet this need.",
                "authors": [
                    {
                        "name": "Amos C.I."
                    },
                    {
                        "name": "Peng B."
                    },
                    {
                        "name": "Pettit R.W."
                    }
                ],
                "citationCount": 5,
                "date": "2021-07-01T00:00:00Z",
                "journal": "JAMIA Open",
                "title": "Population simulations of COVID-19 outbreaks provide tools for risk assessment and continuity planning"
            },
            "pmcid": "PMC7928848",
            "pmid": "34505002",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1136/bmjopen-2021-050473",
            "metadata": {
                "abstract": "Objective To evaluate the effectiveness of SARS-CoV-2 testing on shortening the duration of quarantines for COVID-19 and to identify the most effective choices of testing schedules. Design We performed extensive simulations to evaluate the performance of quarantine strategies when one or more SARS-CoV-2 tests were administered during the quarantine. Simulations were based on statistical models for the transmissibility and viral loads of SARS-CoV-2 infections and the sensitivities of available testing methods. Sensitivity analyses were performed to evaluate the impact of perturbations in model assumptions on the outcomes of optimal strategies. Results We found that SARS-CoV-2 testing can effectively reduce the length of a quarantine without compromising safety. A single reverse transcription-PCR (RT-PCR) test performed before the end of quarantine can reduce quarantine duration to 10 days. Two tests can reduce the duration to 8 days, and three highly sensitive RT-PCR tests can justify a 6-day quarantine. More strategic testing schedules and longer quarantines are needed if tests are administered with less-sensitive RT-PCR tests or antigen tests. Shorter quarantines can be used for applications that tolerate a residual postquarantine transmission risk comparable to a 10-day quarantine. Conclusions Testing could substantially reduce the length of isolation, reducing the physical and mental stress caused by lengthy quarantines. With increasing capacity and lowered costs of SARS-CoV-2 tests, test-assisted quarantines could be safer and more cost-effective than 14-day quarantines and warrant more widespread use.",
                "authors": [
                    {
                        "name": "Amos C.I."
                    },
                    {
                        "name": "Greninger A.L."
                    },
                    {
                        "name": "Matos P.G."
                    },
                    {
                        "name": "McCashin J."
                    },
                    {
                        "name": "Peng B."
                    },
                    {
                        "name": "Pettit R.W."
                    },
                    {
                        "name": "Yu P."
                    },
                    {
                        "name": "Zhou W."
                    }
                ],
                "citationCount": 9,
                "date": "2021-07-16T00:00:00Z",
                "journal": "BMJ Open",
                "title": "Reducing COVID-19 quarantine with SARS-CoV-2 testing: A simulation study"
            },
            "pmcid": "PMC8290949",
            "pmid": "34272225",
            "type": [
                "Usage"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "version": [
        "0.5.3"
    ]
}
