{
    "additionDate": "2020-01-14T09:19:12Z",
    "biotoolsCURIE": "biotools:SWiFi",
    "biotoolsID": "SWiFi",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "achillefs.kapanidis@physics.ox.ac.uk",
            "name": "Achillefs N. Kapanidis",
            "typeEntity": "Person"
        }
    ],
    "description": "Confinement-Free Wide-Field Ratiometric Tracking of Single Fluorescent Molecules.\n\nA software for single particle tracking which includes intensity ratiometric measurements and analysis.\n\nUnpack the zip file to a folder of your choice.\n\nfollow the instructions in the manual in order to get started",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Single particle analysis",
                    "uri": "http://edamontology.org/operation_3457"
                }
            ]
        }
    ],
    "homepage": "https://github.com/barakgilboa/SWiFi-software",
    "lastUpdate": "2020-12-27T12:57:37Z",
    "license": "GPL-3.0",
    "name": "SWiFi",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.BPJ.2019.10.033",
            "metadata": {
                "abstract": "© 2019 Biophysical SocietySingle-molecule fluorescence has been highly instrumental in elucidating interactions and dynamics of biological molecules in the past two decades. Single-molecule fluorescence experiments usually rely on one of two detection geometries, either confocal point-detection or wide-field area detection, typically in a total internal reflection fluorescence (TIRF) format. However, each of these techniques suffers from fundamental drawbacks that limit their application. In this work, we present a new technique, solution wide-field imaging (SWiFi) of diffusing molecules, as an alternative to the existing methods. SWiFi is a simple extension to existing objective-type TIRF microscopes that allows wide-field observations of fast-diffusing molecules down to single fluorophores without the need of tethering the molecules to the surface. We demonstrate that SWiFi enables high-throughput ratiometric measurements with several thousands of individual data points per minute on double-stranded DNA standard (dsDNA) samples containing Förster resonance energy transfer pairs. We further display the capabilities of SWiFi by reporting on mobility and ratiometric characterization of fluorescent nanodiamonds, DNA Holliday junctions, and protein-DNA interactions. The ability of SWiFi for high-throughput, ratiometric measurements of fast-diffusing species renders it a valuable tool for the single-molecule research community by bridging between confocal and TIRF detection geometries in a simple and efficient way.",
                "authors": [
                    {
                        "name": "Gilboa B."
                    },
                    {
                        "name": "Jing B."
                    },
                    {
                        "name": "Cui T.J."
                    },
                    {
                        "name": "Sow M."
                    },
                    {
                        "name": "Plochowietz A."
                    },
                    {
                        "name": "Mazumder A."
                    },
                    {
                        "name": "Kapanidis A.N."
                    }
                ],
                "citationCount": 1,
                "date": "2019-12-03T00:00:00Z",
                "journal": "Biophysical Journal",
                "title": "Confinement-Free Wide-Field Ratiometric Tracking of Single Fluorescent Molecules"
            },
            "pmcid": "PMC6895709",
            "pmid": "31711608"
        }
    ],
    "topic": [
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ],
    "validated": 1
}