{
    "accessibility": "Open access",
    "additionDate": "2021-12-12T14:32:28.448292Z",
    "biotoolsCURIE": "biotools:bsf-skeleton",
    "biotoolsID": "bsf-skeleton",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "leonid.sokolinsky@susu.ru",
            "name": "Leonid B. Sokolinsky",
            "typeEntity": "Person"
        }
    ],
    "description": "A template for parallelization of iterative numerical algorithms on cluster computing systems.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "https://github.com/leonid-sokolinsky/BSF-skeleton",
    "language": [
        "C++",
        "C"
    ],
    "lastUpdate": "2021-12-12T14:32:28.450948Z",
    "name": "BSF-skeleton",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.MEX.2021.101437",
            "metadata": {
                "abstract": "© 2021This article describes a method for creating applications for cluster computing systems using the parallel BSF-skeleton based on the original BSF (Bulk Synchronous Farm) model of parallel computations developed by the author earlier. This model uses the master/slave paradigm. The main advantage of the BSF model is that it allows to estimate the scalability of a parallel algorithm before its implementation. Another important feature of the BSF model is the representation of problem data in the form of lists that greatly simplifies the logic of building applications. The BSF-skeleton is designed for creating parallel programs in C++ using the MPI library. The scope of the BSF-skeleton is iterative numerical algorithms of high computational complexity. The BSF-skeleton has the following distinctive features. • The BSF-skeleton completely encapsulates all aspects that are associated with parallelizing a program. • The BSF-skeleton allows error-free compilation at all stages of application development. • The BSF-skeleton supports OpenMP programming model and workflows.",
                "authors": [
                    {
                        "name": "Sokolinsky L.B."
                    }
                ],
                "citationCount": 1,
                "date": "2021-01-01T00:00:00Z",
                "journal": "MethodsX",
                "title": "BSF-skeleton: A template for parallelization of iterative numerical algorithms on cluster computing systems"
            },
            "pmcid": "PMC8374653",
            "pmid": "34430326"
        }
    ],
    "topic": [
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ]
}