{
    "additionDate": "2020-01-09T18:06:54Z",
    "biotoolsCURIE": "biotools:dbInDel",
    "biotoolsID": "dbInDel",
    "confidence_flag": "tool",
    "description": "A database of enhancer-associated insertion and deletion variants by analysis of H3K27ac ChIP-Seq.\n\nCancer hallmarks rely on its specific transcriptional programs, which are dysregulated by multiple mechanisms, including genomic aberrations in the DNA regulatory regions. Genome-wide association studies (GWAS) have shown many variants are found within putative enhancer elements. To provide insights into the regulatory role of enhancer-associated noncoding variants in cancer epigenome, and to facilitate the identification of functional noncoding mutations, we present dbInDel, a database where we have comprehensively analyzed enhancer-associated insertion and deletion variants for both human and murine samples using ChIP-Seq data. Moreover, we provide the identification and visualization of upstream TF binding motifs in InDel-containing enhancers. Downstream target genes are also predicted and analyzed in the context of cancer biology.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Indel detection",
                    "uri": "http://edamontology.org/operation_0452"
                },
                {
                    "term": "Transcriptional regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0438"
                },
                {
                    "term": "Variant prioritisation",
                    "uri": "http://edamontology.org/operation_3226"
                }
            ]
        }
    ],
    "homepage": "http://enhancer-indel.cam-su.org/",
    "lastUpdate": "2020-12-17T13:33:13Z",
    "name": "dbInDel",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ770",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press.Summary: Cancer hallmarks rely on its specific transcriptional programs, which are dysregulated by multiple mechanisms, including genomic aberrations in the DNA regulatory regions. Genome-wide association studies have shown many variants are found within putative enhancer elements. To provide insights into the regulatory role of enhancer-associated non-coding variants in cancer epigenome, and to facilitate the identification of functional non-coding mutations, we present dbInDel, a database where we have comprehensively analyzed enhancer-associated insertion and deletion variants for both human and murine samples using ChIP-Seq data. Moreover, we provide the identification and visualization of upstream TF binding motifs in InDel-containing enhancers. Downstream target genes are also predicted and analyzed in the context of cancer biology. The dbInDel database promotes the investigation of functional contributions of non-coding variants in cancer epigenome.",
                "authors": [
                    {
                        "name": "Chen X."
                    },
                    {
                        "name": "Huang M."
                    },
                    {
                        "name": "Koeffler H.P."
                    },
                    {
                        "name": "Lin D.-C."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Xu Y."
                    },
                    {
                        "name": "Yan J."
                    },
                    {
                        "name": "Yang H."
                    },
                    {
                        "name": "Yang M."
                    },
                    {
                        "name": "Zhuang W."
                    }
                ],
                "date": "2020-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "DbInDel: A database of enhancer-associated insertion and deletion variants by analysis of H3K27ac ChIP-Seq"
            },
            "pmcid": "PMC7703781",
            "pmid": "31603498"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
