{
    "accessibility": "Open access",
    "additionDate": "2024-02-23T13:55:14.953081Z",
    "biotoolsCURIE": "biotools:g2p-env",
    "biotoolsID": "g2p-env",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "qchengray@cau.edu.cn",
            "name": "Qian Cheng",
            "typeEntity": "Person"
        },
        {
            "email": "wanshi0066@126.com",
            "name": "Shuqin Jiang",
            "typeEntity": "Person"
        }
    ],
    "description": "G2P provides an integrative environment for multi-model genomic selection analysis to improve genotype-to-phenotype prediction.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Optimisation and refinement",
                    "uri": "http://edamontology.org/operation_2425"
                }
            ]
        }
    ],
    "homepage": "https://g2p-env.github.io/",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-02-23T13:55:14.955726Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/G2P-env/G2P"
        }
    ],
    "name": "G2P",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FPLS.2023.1207139",
            "metadata": {
                "abstract": "Genotype-to-phenotype (G2P) prediction has become a mainstream paradigm to facilitate genomic selection (GS)-assisted breeding in the seed industry. Many methods have been introduced for building GS models, but their prediction precision may vary depending on species and specific traits. Therefore, evaluation of multiple models and selection of the appropriate one is crucial to effective GS analysis. Here, we present the G2P container developed for the Singularity platform, which not only contains a library of 16 state-of-the-art GS models and 13 evaluation metrics. G2P works as an integrative environment offering comprehensive, unbiased evaluation analyses of the 16 GS models, which may be run in parallel on high-performance computing clusters. Based on the evaluation outcome, G2P performs auto-ensemble algorithms that not only can automatically select the most precise models but also can integrate prediction results from multiple models. This functionality should further improve the precision of G2P prediction. Another noteworthy function is the refinement design of the training set, in which G2P optimizes the training set based on the genetic diversity analysis of a studied population. Although the training samples in the optimized set are fewer than in the original set, the prediction precision is almost equivalent to that obtained when using the whole set. This functionality is quite useful in practice, as it reduces the cost of phenotyping when constructing training population. The G2P container and source codes are freely accessible at https://g2p-env.github.io/.",
                "authors": [
                    {
                        "name": "Cheng Q."
                    },
                    {
                        "name": "Fu R."
                    },
                    {
                        "name": "Jiang S."
                    },
                    {
                        "name": "Jiang S."
                    },
                    {
                        "name": "Li T."
                    },
                    {
                        "name": "Ma C."
                    },
                    {
                        "name": "Qiu Z."
                    },
                    {
                        "name": "Wang Q."
                    },
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Yan J."
                    }
                ],
                "date": "2023-01-01T00:00:00Z",
                "journal": "Frontiers in Plant Science",
                "title": "G2P Provides an Integrative Environment for Multi-model genomic selection analysis to improve genotype-to-phenotype prediction"
            },
            "pmcid": "PMC10437076",
            "pmid": "37600179"
        }
    ],
    "toolType": [
        "Library",
        "Workflow"
    ],
    "topic": [
        {
            "term": "Computer science",
            "uri": "http://edamontology.org/topic_3316"
        },
        {
            "term": "Epistasis",
            "uri": "http://edamontology.org/topic_3974"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ]
}
