{
    "additionDate": "2022-01-03T09:38:35.967946Z",
    "biotoolsCURIE": "biotools:sapdb",
    "biotoolsID": "sapdb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "raghava@iiitd.ac.in",
            "name": "Gajendra P.S. Raghava",
            "orcidid": "https://orcid.org/0000-0002-8902-2876",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://webs.iiitd.edu.in/raghava/"
        }
    ],
    "description": "SAPdb (Self Assembling Peptides Database) is a database of short peptides and the corresponding nanostructures formed by self-assembly.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Peptide database search",
                    "uri": "http://edamontology.org/operation_3646"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "https://webs.iiitd.edu.in/raghava/sapdb",
    "lastUpdate": "2022-01-03T09:38:35.970342Z",
    "name": "SAPdb",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.COMPBIOMED.2021.104391",
            "metadata": {
                "abstract": "© 2021 Elsevier LtdNanostructures generated by self-assembly of peptides yield nanomaterials that have many therapeutic applications, including drug delivery and biomedical engineering, due to their low cytotoxicity and higher uptake by targeted cells owing to their high affinity and specificity towards cell surface receptors. Despite the promising implications of this rapidly expanding field, there is no dedicated resource to study peptide nanostructures. This study endeavours to create a repository of short peptides, which may prove to be the best models to study ordered nanostructures formed by peptide self-assembly. SAPdb has a repertoire of 1049 entries of experimentally validated nanostructures formed by the self-assembly of small peptides. It consists of 328 tripeptides, 701 dipeptides, and 20 single amino acids with some conjugate partners. Each entry encompasses comprehensive information about the peptide, such as chemical modifications, the type of nanostructure formed, experimental conditions like pH, temperature, solvent required for the self-assembly, etc. Our analysis indicates that peptides containing aromatic amino acids favour the formation of self-assembling nanostructures. Additionally, we observed that these peptides form different nanostructures under different experimental conditions. SAPdb provides this comprehensive information in a hassle-free tabulated manner at a glance. User-friendly browsing, searching, and analysis modules have been integrated for easy data retrieval, data comparison, and examination of properties. We anticipate SAPdb to be a valuable repository for researchers engaged in the burgeoning arena of nanobiotechnology. It is freely available at https://webs.iiitd.edu.in/raghava/sapdb.",
                "authors": [
                    {
                        "name": "Dhall A."
                    },
                    {
                        "name": "Kaur H."
                    },
                    {
                        "name": "Mathur D."
                    },
                    {
                        "name": "Raghava G.P.S."
                    },
                    {
                        "name": "Sharma N."
                    }
                ],
                "citationCount": 2,
                "date": "2021-06-01T00:00:00Z",
                "journal": "Computers in Biology and Medicine",
                "title": "SAPdb: A database of short peptides and the corresponding nanostructures formed by self-assembly"
            },
            "pmid": "33892308",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Biological databases",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
