{
    "name": "FreClu", 
    "description": "a frequency-based, de novo short-read clustering method that organizes erroneous short sequences originating in a single abundant sequence into a tree structure. In this structure, each “child” sequence is considered to be derived from its “parent” sequence with one mutation through sequencing errors. The root node is the most frequently observed sequence that represents all erroneous reads in the entire tree.", 
    "homepage": "http://mlab.cb.k.u-tokyo.ac.jp/%7Equwei/DeNovoShortReadClustering/", 
    "biotoolsID": "freclu", 
    "biotoolsCURIE": "biotools:freclu", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3198", 
                    "term": "Read mapping"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3170", 
            "term": "RNA-seq"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Mac"
    ], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "http://mlab.cb.k.u-tokyo.ac.jp/~quwei/DeNovoShortReadClustering/Manual%20of%20de%20novo%20clustering.txt", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "19439514", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Efficient frequency-based de novo short-read clustering for error trimming in next-generation sequencing", 
                "abstract": "Novel massively parallel sequencing technologies provide highly detailed structures of transcriptomes and genomes by yielding deep coverage of short reads, but their utility is limited by inadequate sequencing quality and short-read lengths. Sequencing-error trimming in short reads is therefore a vital process that could improve the rate of successful reference mapping and polymorphism detection. Toward this aim, we herein report a frequency-based, de novo short-read clustering method that organizes erroneous short sequences originating in a single abundant sequence into a tree structure; in this structure, each \"child\" sequence is considered to be stochastically derived from its more abundant \"parent\" sequence with one mutation through sequencing errors. The root node is the most frequently observed sequence that represents all erroneous reads in the entire tree, allowing the alignment of the reliable representative read to the genome without the risk of mapping erroneous reads to false-positive positions. This method complements base calling and the error correction of making direct alignments with the reference genome, and is able to improve the overall accuracy of short-read alignment by consulting the inherent relationships among the entire set of reads. The algorithm runs efficiently with a linear time complexity. In addition, an error rate evaluation model can be derived from bacterial artificial chromosome sequencing data obtained in the same run as a control. In two clustering experiments using small RNA and 5′-end mRNA reads data sets, we confirmed a remarkable increase (∼5%) in the percentage of short reads aligned to the reference sequence. © 2009 by Cold Spring Harbor Laboratory Press.", 
                "date": "2009-07-01T00:00:00Z", 
                "citationCount": 51, 
                "authors": [
                    {
                        "name": "Qu W."
                    }, 
                    {
                        "name": "Hashimoto S.-I."
                    }, 
                    {
                        "name": "Morishita S."
                    }
                ], 
                "journal": "Genome Research"
            }
        }
    ], 
    "credit": [
        {
            "name": "Shinichi Morishita", 
            "email": "moris@cb.k.u-tokyo.ac.jp", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "seqwiki_import", 
    "additionDate": "2017-01-13T13:14:38Z", 
    "lastUpdate": "2018-12-10T12:58:59Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}