{
    "accessibility": [],
    "additionDate": "2017-02-10T11:35:01Z",
    "biotoolsCURIE": "biotools:cluspro",
    "biotoolsID": "cluspro",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": null,
            "gridid": null,
            "name": "Contact form",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://structure.bu.edu/contact"
        }
    ],
    "description": "ClusPro is a tool for automatically computing the docking of two protein structures supplied by the user (or as PDB IDs).  The result set is a ranked list of putative complexes, ordered by clustering properties.",
    "documentation": [
        {
            "note": null,
            "type": "User manual",
            "url": "https://cluspro.bu.edu/help.php"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Protein property comparison",
                    "uri": "http://edamontology.org/operation_2930"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Protein property calculation",
                    "uri": "http://edamontology.org/operation_0250"
                },
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                },
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://cluspro.bu.edu/login.php",
    "homepage_status": 0,
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "license": null,
    "link": [],
    "maturity": null,
    "name": "ClusPro",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": null,
            "metadata": {
                "abstract": "ClusPro (http://nrc.bu.edu/cluster) represents the first fully automated, web-based program for the computational docking of protein structures. Users may upload the coordinate files of two protein structures through ClusPro's web interface, or enter the PDB codes of the respective structures, which ClusPro will then download from the PDB server (http://www.rcsb.org/pdb/). The docking algorithms evaluate billions of putative complexes, retaining a preset number with favorable surface complementarities. A filtering method is then applied to this set of structures, selecting those with good electrostatic and desolvation free energies for further clustering. The program output is a short list of putative complexes ranked according to their clustering properties, which is automatically sent back to the user via email. © Oxford University Press 2004; all rights reserved.",
                "authors": [
                    {
                        "name": "Comeau S.R."
                    },
                    {
                        "name": "Gatchell D.W."
                    },
                    {
                        "name": "Vajda S."
                    },
                    {
                        "name": "Camacho C.J."
                    }
                ],
                "citationCount": 463,
                "date": "2004-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "ClusPro: A fully automated algorithm for protein-protein docking"
            },
            "note": null,
            "pmcid": null,
            "pmid": "15215358",
            "type": null,
            "version": null
        },
        {
            "doi": null,
            "metadata": {
                "abstract": "Our approach to protein-protein docking includes three main steps. First, we run PIPER, a rigid body docking program based on the Fast Fourier Transform (FFT) correlation approach, extended to use pairwise interactions potentials. Second, the 1000 best energy conformations are clustered, and the 30 largest clusters are retained for refinement. Third, the stability of the clusters is analyzed by short Monte Carlo simulations, and the structures are refined by the medium-range optimization method SDU. The first two steps of this approach are implemented in the ClusPro 2.0 protein-protein docking server. Despite being fully automated, the last step is computationally too expensive to be included in the server. When comparing the models obtained in CAPRI rounds 13-19 by ClusPro, by the refinement of the ClusPro predictions and by all predictor groups, we arrived at three conclusions. First, for the first time in the CAPRI history, our automated ClusPro server was able to compete with the best human predictor groups. Second, selecting the top ranked models, our current protocol reliably generates high-quality structures of protein-protein complexes from the structures of separately crystallized proteins, even in the absence of biological information, provided that there is limited backbone conformational change. Third, despite occasional successes, homology modeling requires further improvement to achieve reliable docking results. © 2010 Wiley-Liss, Inc.",
                "authors": [
                    {
                        "name": "Kozakov D."
                    },
                    {
                        "name": "Hall D.R."
                    },
                    {
                        "name": "Beglov D."
                    },
                    {
                        "name": "Brenke R."
                    },
                    {
                        "name": "Comeau S.R."
                    },
                    {
                        "name": "Shen Y."
                    },
                    {
                        "name": "Li K."
                    },
                    {
                        "name": "Zheng J."
                    },
                    {
                        "name": "Vakili P."
                    },
                    {
                        "name": "Paschalidis I.C."
                    },
                    {
                        "name": "Vajda S."
                    }
                ],
                "citationCount": 165,
                "date": "2010-11-15T00:00:00Z",
                "journal": "Proteins: Structure, Function and Bioinformatics",
                "title": "Achieving reliability and high accuracy in automated protein docking: ClusPro, PIPER, SDU, and stability analysis in CAPRI rounds 13-19"
            },
            "note": null,
            "pmcid": null,
            "pmid": "20818657",
            "type": null,
            "version": null
        },
        {
            "doi": null,
            "metadata": {
                "abstract": "The Fast Fourier Transform (FFT) correlation approach to protein-protein docking can evaluate the energies of billions of docked conformations on a grid if the energy is described in the form of a correlation function. Here, this restriction is removed, and the approach is efficiently used with pairwise interaction potentials that substantially improve the docking results. The basic idea is approximating the interaction matrix by its eigenvectors corresponding to the few dominant eigenvalues, resulting in an energy expression written as the sum of a few correlation functions, and solving the problem by repeated FFT calculations. In addition to describing how the method is implemented, we present a novel class of structure-based pairwise intermolecular potentials. The DARS (Decoys As the Reference State) potentials are extracted from structures of protein-protein complexes and use large sets of docked conformations as decoys to derive atom pair distributions in the reference state. The current version of the DARS potential works well for enzyme-inhibitor complexes. With the new FFT-based program, DARS provides much better docking results than the earlier approaches, in many cases generating 50% more near-native docked conformations. Although the potential is far from optimal for antibody-antigen pairs, the results are still slightly better than those given by an earlier FFT method. The docking program PIPER is freely available for noncommercial applications. © 2006 Wiley-Liss, Inc.",
                "authors": [
                    {
                        "name": "Kozakov D."
                    },
                    {
                        "name": "Brenke R."
                    },
                    {
                        "name": "Comeau S.R."
                    },
                    {
                        "name": "Vajda S."
                    }
                ],
                "citationCount": 406,
                "date": "2006-11-01T00:00:00Z",
                "journal": "Proteins: Structure, Function and Genetics",
                "title": "PIPER: An FFT-based protein docking program with pairwise potentials"
            },
            "note": null,
            "pmcid": null,
            "pmid": "16933295",
            "type": null,
            "version": null
        },
        {
            "doi": null,
            "metadata": {
                "abstract": "Motivation: Predicting protein interactions is one of the most challenging problems in functional genomics. Given two proteins known to interact, current docking methods evaluate billions of docked conformations by simple scoring functions, and in addition to near-native structures yield many false positives, i.e. structures with good surface complementarity but far from the native. Results: We have developed a fast algorithm for filtering docked conformations with good surface complementarity, and ranking them based on their clustering properties. The free energy filters select complexes with lowest desolvation and electrostatic energies. Clustering is then used to smooth the local minima and to select the ones with the broadest energy wells - a property associated with the free energy at the binding site. The robustness of the method was tested on sets of 2000 docked conformations generated for 48 pairs of interacting proteins. In 31 of these cases, the top 10 predictions include at least one near-native complex, with an average RMSD of 5 Å from the native structure. The docking and discrimination method also provides good results for a number of complexes that were used as targets in the Critical Assessment of PRedictions of Interactions experiment.",
                "authors": [
                    {
                        "name": "Comeau S.R."
                    },
                    {
                        "name": "Gatchell D.W."
                    },
                    {
                        "name": "Vajda S."
                    },
                    {
                        "name": "Camacho C.J."
                    }
                ],
                "citationCount": 604,
                "date": "2004-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "ClusPro: An automated docking and discrimination method for the prediction of protein complexes"
            },
            "note": null,
            "pmcid": null,
            "pmid": "14693807",
            "type": null,
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Protein properties",
            "uri": "http://edamontology.org/topic_0123"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        }
    ],
    "validated": 1,
    "version": []
}