{"credit":[{"email":"delphi@g.clemson.edu","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://compbio.clemson.edu/"}],"documentation":[{"type":"GENERAL","url":"http://compbio.clemson.edu/saambe_webserver/help.php"}],"function":[{"operation":[{"term":"Protein property calculation","uri":"http://edamontology.org/operation_0250"}]}],"labels":{"language":["PHP"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Genetic variation","uri":"http://edamontology.org/topic_0199"},{"term":"DNA mutation","uri":"http://edamontology.org/topic_2533"},{"term":"Protein interactions","uri":"http://edamontology.org/topic_0128"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/saambe-webserver-to-predict-the-charge-of-binding-free-energy-caused-by-amino-acids-mutations.html"}],"publication":[{"abstract":"© 2016 by the authors; licensee MDPI, Basel, Switzerland.Predicting the effect of amino acid substitutions on protein–protein affinity (typically evaluated via the change of protein binding free energy) is important for both understanding the disease-causing mechanism of missense mutations and guiding protein engineering. In addition, researchers are also interested in understanding which energy components are mostly affected by the mutation and how the mutation affects the overall structure of the corresponding protein. Here we report a webserver, the Single Amino Acid Mutation based change in Binding free Energy (SAAMBE) webserver, which addresses the demand for tools for predicting the change of protein binding free energy. SAAMBE is an easy to use webserver, which only requires that a coordinate file be inputted and the user is provided with various, but easy to navigate, options. The user specifies the mutation position, wild type residue and type of mutation to be made. The server predicts the binding free energy change, the changes of the corresponding energy components and provides the energy minimized 3D structure of the wild type and mutant proteins for download. The SAAMBE protocol performance was tested by benchmarking the predictions against over 1300 experimentally determined changes of binding free energy and a Pearson correlation coefficient of 0.62 was obtained. How the predictions can be used for discriminating disease-causing from harmless mutations is discussed. The webserver can be accessed via http://compbio.clemson.edu/saambe_webserver/.","authors":["Petukh M.","Dai L.","Alexov E."],"cit_count":14,"journal":"International Journal of Molecular Sciences","pmid":"27077847","title":"SAAMBE: Webserver to predict the charge of binding free energy caused by amino acids mutations","year":"2016-04-12"}],"summary":{"biotoolsCURIE":"biotools:saambe","biotoolsID":"saambe","description":"This method addresses the demand for computational tools of predicting the effect of single amino acid substitution on the binding free energy of protein complexes. It is based on the fast (<< 1 minute) modified MM-PBSA protocol that is successfully tested and optimized for more than thousand experimental data points.","homepage":"http://compbio.clemson.edu/saambe_webserver/","name":"SAAMBE"}}