{
    "additionDate": "2021-03-19T09:03:48Z",
    "biotoolsCURIE": "biotools:immc",
    "biotoolsID": "immc",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "q.fang@neu.edu",
            "name": "Qianqian Fang",
            "orcidid": "https://orcid.org/0000-0003-0805-935X",
            "typeEntity": "Person"
        }
    ],
    "description": "Light transport modeling in highly complex tissues using the implicit mesh-based Monte Carlo algorithm.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "http://mcx.space/#mmc",
    "lastUpdate": "2021-03-31T18:32:23Z",
    "name": "iMMC",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1364/BOE.411898",
            "metadata": {
                "abstract": "© 2020 Optical Society of America under the terms of the OSA Open Access Publishing AgreementThe mesh-based Monte Carlo (MMC) technique has grown tremendously since its initial publication nearly a decade ago. It is now recognized as one of the most accurate Monte Carlo (MC) methods, providing accurate reference solutions for the development of novel biophotonics techniques. In this work, we aim to further advance MMC to address a major challenge in biophotonics modeling, i.e. light transport within highly complex tissues, such as dense microvascular networks, porous media and multi-scale tissue structures. Although the current MMC framework is capable of simulating light propagation in such media given its generality, the run-time and memory usage grow rapidly with increasing media complexity and size. This greatly limits our capability to explore complex and multi-scale tissue structures. Here, we propose a highly efficient implicit mesh-based Monte Carlo (iMMC) method that incorporates both mesh- and shape-based tissue representations to create highly complex yet memory-efficient light transport simulations. We demonstrate that iMMC is capable of providing accurate solutions for dense vessel networks and porous tissues while reducing memory usage by greater than a hundred- or even thousand-fold. In a sample network of microvasculature, the reduced shape complexity results in nearly 3x speed acceleration. The proposed algorithm is now available in our open-source MMC software at http://mcx.space/#mmc.",
                "authors": [
                    {
                        "name": "Yuan Y."
                    },
                    {
                        "name": "Yan S."
                    },
                    {
                        "name": "Fang Q."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Biomedical Optics Express",
                "title": "Light transport modeling in highly complex tissues using the implicit mesh-based monte carlo algorithm"
            },
            "pmcid": "PMC7818958",
            "pmid": "33520382"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        }
    ]
}