{
    "additionDate": "2018-07-07T13:31:01Z",
    "biotoolsCURIE": "biotools:combiroc",
    "biotoolsID": "combiroc",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "email": "mazzara@ingm.org",
            "name": "Saveria Mazzara",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Interactive web tool for selecting accurate marker combinations of omics data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://combiroc.eu/"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                }
            ]
        }
    ],
    "homepage": "http://combiroc.eu/",
    "lastUpdate": "2019-03-26T08:13:27Z",
    "name": "CombiROC",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1038/srep45477",
            "metadata": {
                "abstract": "Diagnostic accuracy can be improved considerably by combining multiple markers, whose performance in identifying diseased subjects is usually assessed via receiver operating characteristic (ROC) curves. The selection of multimarker signatures is a complicated process that requires integration of data signatures with sophisticated statistical methods. We developed a user-friendly tool, called CombiROC, to help researchers accurately determine optimal markers combinations from diverse omics methods. With CombiROC data from different domains, such as proteomics and transcriptomics, can be analyzed using sensitivity/specificity filters: the number of candidate marker panels rising from combinatorial analysis is easily optimized bypassing limitations imposed by the nature of different experimental approaches. Leaving to the user full control on initial selection stringency, CombiROC computes sensitivity and specificity for all markers combinations, performances of best combinations and ROC curves for automatic comparisons, all visualized in a graphic interface. CombiROC was designed without hard-coded thresholds, allowing a custom fit to each specific data: this dramatically reduces the computational burden and lowers the false negative rates given by fixed thresholds. The application was validated with published data, confirming the marker combination already originally described or even finding new ones. CombiROC is a novel tool for the scientific community freely available at http://CombiROC.eu.",
                "authors": [
                    {
                        "name": "Mazzara S."
                    },
                    {
                        "name": "Rossi R.L."
                    },
                    {
                        "name": "Grifantini R."
                    },
                    {
                        "name": "Donizetti S."
                    },
                    {
                        "name": "Abrignani S."
                    },
                    {
                        "name": "Bombaci M."
                    }
                ],
                "citationCount": 4,
                "date": "2017-03-30T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "CombiROC: An interactive web tool for selecting accurate marker combinations of omics data"
            }
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}