{
    "additionDate": "2019-11-14T20:11:16Z",
    "biotoolsCURIE": "biotools:HLA",
    "biotoolsID": "HLA",
    "confidence_flag": "tool",
    "description": "Using RNA Sequencing to Characterize the Tumor Microenvironment | Using k-mers to call HLA alleles in RNA sequencing data | HLAProfiler uses the k-mer content of next generation sequencing reads to call HLA types in a sample. Based on the k-mer content each each read pair is assigned to an HLA gene and the aggregate k-mer profile for the gene is compared to reference k-mer profiles to determin the HLA type. Currently HLAProfiler only supports paired-end RNA-seq data",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Protein quantification",
                    "uri": "http://edamontology.org/operation_3630"
                },
                {
                    "term": "RNA-Seq quantification",
                    "uri": "http://edamontology.org/operation_3800"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ExpressionAnalysis/HLAProfiler",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2020-12-10T09:10:51Z",
    "name": "HLA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/978-1-4939-9773-2_12",
            "metadata": {
                "abstract": "© Springer Science+Business Media, LLC, part of Springer Nature 2020.RNA sequencing (RNA-seq) is an integral tool in immunogenomics, allowing for interrogation of the transcriptome of a tumor and its microenvironment. Analytical methods to deconstruct the genomics data can then be applied to infer gene expression patterns associated with the presence of various immunocyte populations. High quality RNA-seq is possible from formalin-fixed, paraffin-embedded (FFPE), fresh-frozen, and fresh tissue, with a wide variety of sequencing library preparation methods, sequencing platforms, and downstream bioinformatics analyses currently available. Selection of an appropriate library preparation method is largely determined by tissue type, quality of RNA, and quantity of RNA. Downstream of sequencing, many analyses can be applied to the data, including differential gene expression analysis, immune gene signature analysis, gene pathway analysis, T/B-cell receptor inference, HLA inference, and viral transcript quantification. In this chapter, we will describe our workflow for RNA-seq from bulk tissue to evaluable data, including extraction of RNA, library preparation methods, sequencing of libraries, alignment and quality assurance of data, and initial downstream analyses of RNA-seq data to extract relevant immunogenomics features. Systems biology methods that draw additional insights by integrating these features are covered further in Chapters 28 – 30.",
                "authors": [
                    {
                        "name": "Bixby L.M."
                    },
                    {
                        "name": "Bortone D.S."
                    },
                    {
                        "name": "Hoadley K.A."
                    },
                    {
                        "name": "Miller K.L."
                    },
                    {
                        "name": "Selitsky S.R."
                    },
                    {
                        "name": "Serody J.S."
                    },
                    {
                        "name": "Smith C.C."
                    },
                    {
                        "name": "Vincent B.G."
                    }
                ],
                "citationCount": 2,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Methods in Molecular Biology",
                "title": "Using RNA Sequencing to Characterize the Tumor Microenvironment"
            },
            "pmid": "31502156"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
