{
    "additionDate": "2019-11-14T18:05:22Z",
    "biotoolsCURIE": "biotools:ETM-DB",
    "biotoolsID": "ETM-DB",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "dhlee@kaist.ac.kr",
            "name": "Doheon Lee",
            "orcidid": "https://orcid.org/0000-0001-9070-4316",
            "typeEntity": "Person"
        }
    ],
    "description": "Iintegrated Ethiopian traditional herbal medicine and phytochemicals database | ETM-DB is a free, online relational database containing Ethiopian herbal medicine, related compounds and target gene/proteins. Ethiopia is endowed with an affluence of botanical remedies that have proven useful over a long time, especially in the rural areas where modern health care is much less accessible. It is estimated that about 80% of the Ethiopian population, predominantly in the rural areas, use traditional medicine. There are about 6,500-7,500 plant species in Ethiopia, of which an estimated 12% are endemic to Ethiopia",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Named-entity and concept recognition",
                    "uri": "http://edamontology.org/operation_3280"
                },
                {
                    "term": "Natural product identification",
                    "uri": "http://edamontology.org/operation_3803"
                }
            ]
        }
    ],
    "homepage": "http://biosoft.kaist.ac.kr/etm",
    "lastUpdate": "2020-12-28T12:28:36Z",
    "name": "ETM-DB",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12906-019-2634-1",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Recently, there has been an increasing tendency to go back to nature in search of new medicines. To facilitate this, a great deal of effort has been made to compile information on natural products worldwide, and as a result, many ethnic-based traditional medicine databases have been developed. In Ethiopia, there are more than 80 ethnic groups, each having their indigenous knowledge on the use of traditional medicine. About 80% of the population uses traditional medicine for primary health care. Despite this, there is no structured online database for Ethiopian traditional medicine, which limits natural products based drug discovery researches using natural products from this country. Description: To develop ETM-DB, online research articles, theses, books, and public databases containing Ethiopian herbal medicine and phytochemicals information were searched. These resources were thoroughly inspected and the necessary data were extracted. Then, we developed a comprehensive online relational database which contains information on 1054 Ethiopian medicinal herbs with 1465 traditional therapeutic uses, 573 multi-herb prescriptions, 4285 compounds, 11,621 human target gene/proteins, covering 5779 herb-phenotype, 1879 prescription-herb, 16,426 herb-compound, 105,202 compound-phenotype, 162,632 compound-gene/protein, and 16,584 phenotype-gene/protein relationships. Using various cheminformatics tools, we obtained predicted physicochemical and absorption, distribution, metabolism, excretion, and toxicity (ADMET) properties of ETM-DB compounds. We also evaluated drug-likeness properties of these compounds using FAF-Drugs4 webserver. From the 4285 compounds, 4080 of them passed the FAF-Drugs4 input data curation stage, of which 876 were found to have acceptable drug-likeness properties. Conclusion: ETM-DB is the largest, freely accessible, web-based integrated resource on Ethiopian traditional medicine. It provides traditional herbal medicine entities and their relationships in well-structured forms including reference to the sources. The ETM-DB website interface allows users to search the entities using various options provided by the search menu. We hope that our database will expedite drug discovery and development researches from Ethiopian natural products as it contains information on the chemical composition and related human target gene/proteins. The current version of ETM-DB is openly accessible at http://biosoft.kaist.ac.kr/etm.",
                "authors": [
                    {
                        "name": "Bultum L.E."
                    },
                    {
                        "name": "Woyessa A.M."
                    },
                    {
                        "name": "Lee D."
                    }
                ],
                "citationCount": 3,
                "date": "2019-08-14T00:00:00Z",
                "journal": "BMC Complementary and Alternative Medicine",
                "title": "ETM-DB: Integrated Ethiopian traditional herbal medicine and phytochemicals database"
            },
            "pmcid": "PMC6692943",
            "pmid": "31412866"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Complementary medicine",
            "uri": "http://edamontology.org/topic_3423"
        },
        {
            "term": "Critical care medicine",
            "uri": "http://edamontology.org/topic_3403"
        }
    ],
    "validated": 1
}