{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:06:08Z",
    "biotoolsCURIE": "biotools:GeneSurrounder",
    "biotoolsID": "GeneSurrounder",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "rbraun@northwestern.edu",
            "name": "Rosemary Braun",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "sahil.shah@u.northwestern.edu",
            "name": "Sahil Shah",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Network-based identification of disease genes in expression data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/sahildshah1/gene-surrounder/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Pathway or network comparison",
                    "uri": "http://edamontology.org/operation_0277"
                }
            ]
        }
    ],
    "homepage": "http://github.com/sahildshah1/gene-surrounder",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-06-16T10:55:25Z",
    "license": "Unlicense",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/sahildshah1/gene-surrounder/issues"
        }
    ],
    "maturity": "Mature",
    "name": "GeneSurrounder",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1186/S12859-019-2829-Y",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: A key challenge of identifying disease-associated genes is analyzing transcriptomic data in the context of regulatory networks that control cellular processes in order to capture multi-gene interactions and yield mechanistically interpretable results. One existing category of analysis techniques identifies groups of related genes using interaction networks, but these gene sets often comprise tens or hundreds of genes, making experimental follow-up challenging. A more recent category of methods identifies precise gene targets while incorporating systems-level information, but these techniques do not determine whether a gene is a driving source of changes in its network, an important characteristic when looking for potential drug targets. Results: We introduce GeneSurrounder, an analysis method that integrates expression data and network information in a novel procedure to detect genes that are sources of dysregulation on the network. The key idea of our method is to score genes based on the evidence that they influence the dysregulation of their neighbors on the network in a manner that impacts cell function. Applying GeneSurrounder to real expression data, we show that our method is able to identify biologically relevant genes, integrate pathway and expression data, and yield more reproducible results across multiple studies of the same phenotype than competing methods. Conclusions: Together these findings suggest that GeneSurrounder provides a new avenue for identifying individual genes that can be targeted therapeutically. The key innovation of GeneSurrounder is the combination of pathway network information with gene expression data to determine the degree to which a gene is a source of dysregulation on the network. By prioritizing genes in this way, our method provides insights into disease mechanisms and suggests diagnostic and therapeutic targets. Our method can be used to help biologists select among tens or hundreds of genes for further validation. The implementation in R is available at github.com/sahildshah1/gene-surrounder.",
                "authors": [
                    {
                        "name": "Shah S.D."
                    },
                    {
                        "name": "Braun R."
                    }
                ],
                "citationCount": 3,
                "date": "2019-05-06T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "GeneSurrounder: Network-based identification of disease genes in expression data"
            },
            "pmcid": "PMC6503437",
            "pmid": "31060502",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1
}