{
    "additionDate": "2021-05-26T19:47:41Z",
    "biotoolsCURIE": "biotools:dms_tools2",
    "biotoolsID": "dms_tools2",
    "credit": [
        {
            "name": "Jesse D Bloom",
            "orcidid": "https://orcid.org/0000-0003-1267-3408",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "dms_tools2 is a software package for analyzing deep mutational scanning data. It is tailored to analyze libraries created using comprehensive codon mutagenesis of protein-coding genes",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://jbloomlab.github.io/dms_tools2/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Sequence mutation and randomisation",
                    "uri": "http://edamontology.org/operation_0367"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jbloomlab/dms_tools2",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-06-01T08:28:24Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/jbloomlab/dms_tools2/issues"
        }
    ],
    "name": "dms_tools2",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/s12859-015-0590-4",
            "metadata": {
                "abstract": "© 2015 Bloom; licensee BioMed Central.Background: Deep mutational scanning is a technique to estimate the impacts of mutations on a gene by using deep sequencing to count mutations in a library of variants before and after imposing a functional selection. The impacts of mutations must be inferred from changes in their counts after selection. Results: I describe a software package, dms_tools, to infer the impacts of mutations from deep mutational scanning data using a likelihood-based treatment of the mutation counts. I show that dms_tools yields more accurate inferences on simulated data than simply calculating ratios of counts pre- and post-selection. Using dms_tools, one can infer the preference of each site for each amino acid given a single selection pressure, or assess the extent to which these preferences change under different selection pressures. The preferences and their changes can be intuitively visualized with sequence-logo-style plots created using an extension to weblogo. Conclusions: dms_tools implements a statistically principled approach for the analysis and subsequent visualization of deep mutational scanning data.",
                "authors": [
                    {
                        "name": "Bloom J.D."
                    }
                ],
                "citationCount": 46,
                "date": "2015-05-20T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Software for the analysis and visualization of deep mutational scanning data"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ]
}