{
    "additionDate": "2021-01-18T10:52:28Z",
    "biotoolsCURIE": "biotools:pyflosic",
    "biotoolsID": "pyflosic",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Sebastian Schwalbe",
            "typeEntity": "Person"
        },
        {
            "name": "Jens Kortus",
            "typeEntity": "Person"
        },
        {
            "name": "Susi Lehtola",
            "typeEntity": "Person"
        }
    ],
    "description": "Python-based Fermi-Löwdin orbital self-interaction correction (FLO-SIC).\n\nThe following document will guide you through the setup and show you how to get started with this Python-based FLO-SIC code.\n\n\nThe development of PyFLOSIC started with the master's thesis of Lenz Fiedler. Over the last year, we had many updates and complete code re-writes by Sebastian Schwalbe (ase-backends,classes etc.) and Torsten Hahn (various speed-up techniques). Our main testers are Kai Trepte, Sebastian Schwalbe and Jakob Kraus. Jens Kortus is our overall theoretical guide and head of decisions, whereas Susi Lehtola has recently joined the team and provides new perspectives.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/pyflosic/pyflosic",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-30T15:09:08Z",
    "license": "Apache-2.0",
    "name": "pyflosic",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1063/5.0012519",
            "metadata": {
                "abstract": "© 2020 Author(s).We present pyflosic, an open-source, general-purpose python implementation of the Fermi-Löwdin orbital self-interaction correction (FLO-SIC), which is based on the python simulation of chemistry framework (pyscf) electronic structure and quantum chemistry code. Thanks to pyscf, pyflosic can be used with any kind of Gaussian-type basis set, various kinds of radial and angular quadrature grids, and all exchange-correlation functionals within the local density approximation, generalized-gradient approximation (GGA), and meta-GGA provided in the libxc and xcfun libraries. A central aspect of FLO-SIC is the Fermi-orbital descriptors, which are used to estimate the self-interaction correction. Importantly, they can be initialized automatically within pyflosic; they can also be optimized within pyflosic with an interface to the atomic simulation environment, a python library that provides a variety of powerful gradient-based algorithms for geometry optimization. Although pyflosic has already facilitated applications of FLO-SIC to chemical studies, it offers an excellent starting point for further developments in FLO-SIC approaches, thanks to its use of a high-level programming language and pronounced modularity.",
                "authors": [
                    {
                        "name": "Schwalbe S."
                    },
                    {
                        "name": "Fiedler L."
                    },
                    {
                        "name": "Kraus J."
                    },
                    {
                        "name": "Kortus J."
                    },
                    {
                        "name": "Trepte K."
                    },
                    {
                        "name": "Lehtola S."
                    }
                ],
                "citationCount": 2,
                "date": "2020-08-28T00:00:00Z",
                "journal": "Journal of Chemical Physics",
                "title": "PyFLOSIC: Python-based Fermi-Löwdin orbital self-interaction correction"
            },
            "pmid": "32872868"
        }
    ],
    "topic": [
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        },
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        }
    ]
}