{"collectionID": ["JIB.tools"], "accessibility": [], "topic": [{"term": "Metabolomics", "uri": "http://edamontology.org/topic_3172"}, {"term": "Data mining", "uri": "http://edamontology.org/topic_3473"}, {"term": "Data management", "uri": "http://edamontology.org/topic_3071"}], "owner": "veits@bmb.sdu.dk", "cost": null, "relation": [], "download": [], "validated": 0, "publication": [{"doi": "10.2390/biecoll-jib-2013-218", "note": null, "version": null, "pmid": "23545212", "type": "Primary", "pmcid": null, "metadata": {"title": "An integrative clinical database and diagnostics platform for biomarker identification and analysis in ion mobility spectra of human exhaled air", "abstract": "Over the last decade the evaluation of odors and vapors in human breath has gained more and more attention, particularly in the diagnostics of pulmonary diseases. Ion mobility spectrometry coupled with multi-capillary columns (MCC/IMS), is a well known technology for detecting volatile organic compounds (VOCs) in air. It is a comparatively inexpensive, non-invasive, high-throughput method, which is able to handle the moisture that comes with human exhaled air, and allows for characterizing of VOCs in very low concentrations. To identify discriminating compounds as biomarkers, it is necessary to have a clear understanding of the detailed composition of human breath. Therefore, in addition to the clinical studies, there is a need for a flexible and comprehensive centralized data repository, which is capable of gathering all kinds of related information. Moreover, there is a demand for automated data integration and semi-automated data analysis, in particular with regard to the rapid data accumulation, emerging from the high-throughput nature of the MCC/IMS technology. Here, we present a comprehensive database application and analysis platform, which combines metabolic maps with heterogeneous biomedical data in a well-structured manner. The design of the database is based on a hybrid of the entity-attribute-value (EAV) model and the EAV-CR, which incorporates the concepts of classes and relationships. Additionally it offers an intuitive user interface that provides easy and quick access to the platform&rsquo;s functionality: automated data integration and integrity validation, versioning and roll-back strategy, data retrieval as well as semi-automatic data mining and machine learning capabilities. The platform will support MCC/IMS-based biomarker identification and validation. The software, schemata, data sets and further information is publicly available at http://imsdb.mpi-inf.mpg.de.", "citationCount": 10, "authors": [{"name": "Schneider T."}, {"name": "Hauschild A.-C."}, {"name": "Baumbach J.I."}, {"name": "Baumbach J."}], "date": "2013-01-01T00:00:00Z", "journal": "Journal of integrative bioinformatics"}}], "homepage_status": 0, "credit": [{"typeRole": ["Provider"], "name": "bmb.sdu.dk", "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": "Institute", "email": null}, {"typeRole": ["Primary contact"], "name": "Jan Baumbach", "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "jbaumbac@imada.sdu.dk"}], "biotoolsCURIE": "biotools:imsdb", "elixirPlatform": [], "elixirNode": [], "version": ["1"], "elixir_badge": 0, "homepage": "http://imsdb.compbio.sdu.dk", "function": [{"note": null, "input": [], "operation": [{"term": "Data retrieval", "uri": "http://edamontology.org/operation_2422"}], "cmd": null, "output": []}, {"note": null, "input": [], "operation": [{"term": "Deposition", "uri": "http://edamontology.org/operation_3431"}], "cmd": null, "output": []}], "lastUpdate": "2019-09-18T18:30:17Z", "otherID": [], "description": "Comprehensive database application and analysis platform that is capable of combining metabolic data, like IMS chromatograms, and heterogeneous biomedical data, like patient records, into a centralized data structure.", "toolType": ["Workbench"], "editPermission": {"type": "group", "authors": ["bjsommer"]}, "language": [], "link": [{"url": "https://jib.tools/details.php?id=34", "note": "IMSDB@JIB.tools - a web registry of tools published in the Journal of Integrative Bioinformatics", "type": "Software catalogue"}], "biotoolsID": "imsdb", "additionDate": "2015-08-04T11:45:05Z", "name": "IMSDB", "license": null, "documentation": [{"url": "https://imsdb.compbio.sdu.dk/", "note": null, "type": "General"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux", "Windows", "Mac"]}