{
    "additionDate": "2021-10-11T05:48:31.852064Z",
    "biotoolsCURIE": "biotools:modelbase",
    "biotoolsID": "modelbase",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "anna.matuszynska@hhu.de",
            "name": "Anna Matuszyńska",
            "orcidid": "https://orcid.org/0000-0003-0882-6088",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "modelbase is a python package to help you build and analyze dynamic mathematical models of biological systems. It has originally been designed for the simulation of metabolic systems, but can be used for virtually any processes, in which some substances get converted into others.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://modelbase.readthedocs.io/en/latest"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "https://pypi.org/project/modelbase/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-10-11T05:50:15.315277Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://gitlab.com/qtb-hhu/modelbase-software"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://gitlab.com/qtb-hhu/modelbase-software/-/issues"
        }
    ],
    "name": "modelbase",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04122-7",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Computational mathematical models of biological and biomedical systems have been successfully applied to advance our understanding of various regulatory processes, metabolic fluxes, effects of drug therapies, and disease evolution and transmission. Unfortunately, despite community efforts leading to the development of SBML and the BioModels database, many published models have not been fully exploited, largely due to a lack of proper documentation or the dependence on proprietary software. To facilitate the reuse and further development of systems biology and systems medicine models, an open-source toolbox that makes the overall process of model construction more consistent, understandable, transparent, and reproducible is desired. Results and discussion: We provide an update on the development of modelbase, a free, expandable Python package for constructing and analysing ordinary differential equation-based mathematical models of dynamic systems. It provides intuitive and unified methods to construct and solve these systems. Significantly expanded visualisation methods allow for convenient analysis of the structural and dynamic properties of models. After specifying reaction stoichiometries and rate equations modelbase can automatically assemble the associated system of differential equations. A newly provided library of common kinetic rate laws reduces the repetitiveness of the computer programming code. modelbase is also fully compatible with SBML. Previous versions provided functions for the automatic construction of networks for isotope labelling studies. Now, using user-provided label maps, modelbase v1.2.3 streamlines the expansion of classic models to their isotope-specific versions. Finally, the library of previously published models implemented in modelbase is growing continuously. Ranging from photosynthesis to tumour cell growth to viral infection evolution, all these models are now available in a transparent, reusable and unified format through modelbase. Conclusion: With this new Python software package, which is written in currently one of the most popular programming languages, the user can develop new models and actively profit from the work of others. modelbase enables reproducing and replicating models in a consistent, tractable and expandable manner. Moreover, the expansion of models to their isotopic label-specific versions enables simulating label propagation, thus providing quantitative information regarding network topology and metabolic fluxes.",
                "authors": [
                    {
                        "name": "van Aalst M."
                    },
                    {
                        "name": "Ebenhoh O."
                    },
                    {
                        "name": "Matuszynska A."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Constructing and analysing dynamic models with modelbase v1.2.3: a software update"
            },
            "pmcid": "PMC8056244",
            "pmid": "33879053",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Systems medicine",
            "uri": "http://edamontology.org/topic_3396"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}