{
    "accessibility": "Open access",
    "additionDate": "2022-10-09T15:42:18.467986Z",
    "biotoolsCURIE": "biotools:sadeepcry",
    "biotoolsID": "sadeepcry",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "zhaohaochen@csu.edu.cn",
            "name": "Haochen Zhao"
        },
        {
            "name": "Shaokai Wang"
        }
    ],
    "description": "A deep learning framework for protein crystallization propensity prediction using self-attention and auto-encoder networks.",
    "download": [
        {
            "type": "Downloads page",
            "url": "https://zenodo.org/record/6475529"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                }
            ]
        }
    ],
    "homepage": "https://github.com/zhc940702/SADeepcry",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-10-09T15:42:18.470456Z",
    "license": "Not licensed",
    "name": "SADeepcry",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAC352",
            "metadata": {
                "abstract": "© The Author(s) 2022. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.The X-ray diffraction (XRD) technique based on crystallography is the main experimental method to analyze the three-dimensional structure of proteins. The production process of protein crystals on which the XRD technique relies has undergone multiple experimental steps, which requires a lot of manpower and material resources. In addition, studies have shown that not all proteins can form crystals under experimental conditions, and the success rate of the final crystallization of proteins is only <10%. Although some protein crystallization predictors have been developed, not many tools capable of predicting multi-stage protein crystallization propensity are available and the accuracy of these tools is not satisfactory. In this paper, we propose a novel deep learning framework, named SADeepcry, for predicting protein crystallization propensity. The framework can be used to estimate the three steps (protein material production, purification and crystallization) in protein crystallization experiments and the success rate of the final protein crystallization. SADeepcry uses the optimized self-attention and auto-encoder modules to extract sequence, structure and physicochemical features from the proteins. Compared with other state-of-the-art protein crystallization propensity prediction models, SADeepcry can obtain more complex global spatial long-distance dependence of protein sequence information. Our computational results show that SADeepcry has increased Matthews correlation coefficient and area under the curve, by 100.3% and 13.4%, respectively, over the DCFCrystal method on the benchmark dataset. The codes of SADeepcry are available at https://github.com/zhc940702/SADeepcry.",
                "authors": [
                    {
                        "name": "Wang S."
                    },
                    {
                        "name": "Zhao H."
                    }
                ],
                "date": "2022-09-20T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "SADeepcry: a deep learning framework for protein crystallization propensity prediction using self-attention and auto-encoder networks"
            },
            "pmid": "36037090"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Experimental design and studies",
            "uri": "http://edamontology.org/topic_3678"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "X-ray diffraction",
            "uri": "http://edamontology.org/topic_2828"
        }
    ]
}
