
{
    "credit": [
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://brapi.org"
        }
    ],
    "function": [
        {
            "cmd": "Database portal",
            "note": "API to extract genotyping/phenotyping data",
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Genotype/phenotype report",
                        "uri": "http://edamontology.org/data_0920"
                    },
                    "format": [
                        {
                            "term": "JSON-LD",
                            "uri": "http://edamontology.org/format_3749"
                        }
                    ]
                }
            ]
        }
    ],
    "labels": {
        "cost": "Free of charge",
        "elixirNode": [
            "Portugal"
        ],
        "language": [
            "JavaScript"
        ],
        "maturity": "Emerging",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web API"
        ],
        "topic": [
            {
                "term": "Genotype and phenotype",
                "uri": "http://edamontology.org/topic_0625"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Modern genomic breeding methods rely heavily on very large amounts of phenotyping and genotyping data, presenting new challenges in effective data management and integration. Recently, the size and complexity of datasets have increased significantly, with the result that data are often stored on multiple systems. As analyses of interest increasingly require aggregation of datasets from diverse sources, data exchange between disparate systems becomes a challenge. Results: To facilitate interoperability among breeding applications, we present the public plant Breeding Application Programming Interface (BrAPI). BrAPI is a standardized web service API specification. The development of BrAPI is a collaborative, community-based initiative involving a growing global community of over a hundred participants representing several dozen institutions and companies. Development of such a standard is recognized as critical to a number of important large breeding system initiatives as a foundational technology. The focus of the first version of the API is on providing services for connecting systems and retrieving basic breeding data including germplasm, study, observation, and marker data. A number of BrAPI-enabled applications, termed BrAPPs, have been written, that take advantage of the emerging support of BrAPI by many databases. Availability and implementation: More information on BrAPI, including links to the specification, test suites, BrAPPs, and sample implementations is available at https://brapi.org/. The BrAPI specification and the developer tools are provided as free and open source.",
            "authors": [
                "Selby P.",
                "Abbeloos R.",
                "Backlund J.E.",
                "Basterrechea Salido M.",
                "Bauchet G.",
                "Benites-Alfaro O.E.",
                "Birkett C.",
                "Calaminos V.C.",
                "Carceller P.",
                "Cornut G.",
                "Vasques Costa B.",
                "Edwards J.D.",
                "Finkers R.",
                "Yanxin Gao S.",
                "Ghaffar M.",
                "Glaser P.",
                "Guignon V.",
                "Hok P.",
                "Kilian A.",
                "Konig P.",
                "Lagare J.E.B.",
                "Lange M.",
                "Laporte M.-A.",
                "Larmande P.",
                "Lebauer D.S.",
                "Lyon D.A.",
                "Marshall D.S.",
                "Matthews D.",
                "Milne I.",
                "Mistry N.",
                "Morales N.",
                "Mueller L.A.",
                "Neveu P.",
                "Papoutsoglou E.",
                "Pearce B.",
                "Perez-Masias I.",
                "Pommier C.",
                "Ramirez-Gonzalez R.H.",
                "Rathore A.",
                "Raquel A.M.",
                "Raubach S.",
                "Rife T.",
                "Robbins K.",
                "Rouard M.",
                "Sarma C.",
                "Scholz U.",
                "Sempere G.",
                "Shaw P.D.",
                "Simon R.",
                "Soldevilla N.",
                "Stephen G.",
                "Sun Q.",
                "Tovar C.",
                "Uszynski G.",
                "Verouden M.",
                "Wren J."
            ],
            "cit_count": 4,
            "doi": "10.1093/bioinformatics/btz190",
            "journal": "Bioinformatics",
            "title": "BrAPI - An application programming interface for plant breeding applications",
            "year": "2019-10-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:PHENO",
        "biotoolsID": "PHENO",
        "description": "PHENO aims to provide access to plant phenotypic datasets, with a major focus on the woody plant domain.\n\nPlant phenotyping is central to plant research and breeding and is becoming increasingly throughput, with large amounts of data being generated from diverse experimental settings. Access to phenotypic datasets annotated according to widely accepted standards contributes for data interoperability, enabling powerful genotype-phenotype association studies.",
        "homepage": "https://brapi.biodata.pt",
        "name": "PHENO",
        "version": [
            "1.3"
        ]
    }
}