{
    "additionDate": "2017-03-27T11:53:44Z",
    "biotoolsCURIE": "biotools:psortdb",
    "biotoolsID": "psortdb",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "email": "psort-mail@sfu.ca",
            "name": "PSORTdb Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "PSORTdb (part of the PSORT family) is a database of protein subcellular localizations for bacteria and archaea that contains both information determined through laboratory experimentation (ePSORTdb dataset) and computational predictions (cPSORTdb dataset).",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://db.psort.org/about"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                },
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                },
                {
                    "term": "Protein function prediction",
                    "uri": "http://edamontology.org/operation_1777"
                }
            ]
        }
    ],
    "homepage": "http://db.psort.org",
    "lastUpdate": "2019-03-26T08:35:59Z",
    "name": "PSORTdb",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "The subcellular localization (SCL) of a microbial protein provides clues about its function, its suitability as a drug, vaccine or diagnostic target and aids experimental design. The first version of PSORTdb provided a valuable resource comprising a data set of proteins of known SCL (ePSORTdb) as well as pre-computed SCL predictions for proteomes derived from complete bacterial genomes (cPSORTdb). PSORTdb 2.0 (http://db.psort.org) extends user-friendly functionalities, significantly expands ePSORTdb and now contains precomputed SCL predictions for all prokaryotes- including Archaea and Bacteria with atypical cell wall/membrane structures. cPSORTdb uses the latest version of the SCL predictor PSORTb(version 3.0), with higher genome prediction coverage and functional improvements over PSORTb 2.0, which has been the most precise bacterial SCL predictor available. PSORTdb 2.0 is the first microbial protein SCL database reported to have an automatic updating mechanism to regularly generate SCL predictions for deduced proteomes of newly sequenced prokaryotic organisms. This updating approach uses a novel sequence analysis we developed that detects whether the microbe being analyzed has an outer membrane. This identification of membrane structure permits appropriate SCL prediction in an auto-updated fashion and allows PSORTdb to serve as a practical resource for genome annotation and prokaryotic research. © The Author(s) 2010.",
                "authors": [
                    {
                        "name": "Yu N.Y."
                    },
                    {
                        "name": "Laird M.R."
                    },
                    {
                        "name": "Spencer C."
                    },
                    {
                        "name": "Brinkman F.S.L."
                    }
                ],
                "citationCount": 65,
                "date": "2011-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PSORTdb-an expanded, auto-updated, user-friendly protein subcellular localization database for Bacteria and Archaea"
            },
            "pmid": "21071402"
        },
        {
            "metadata": {
                "abstract": "Information about bacterial subcellular localization (SCL) is important for protein function prediction and identification of suitable drug/vaccine/diagnostic targets. PSORTdb (http://db.psort.org/) is a web-accessible database of SCL for bacteria that contains both information determined through laboratory experimentation and computational predictions. The dataset of experimentally verified information (∼2000 proteins) was manually curated by us and represents the largest dataset of its kind. Earlier versions have been used for training SCL predictors, and its incorporation now into this new PSORTdb resource, with its associated additional annotation information and dataset version control, should aid researchers in future development of improved SCL predictors. The second component of this database contains computational analyses of proteins deduced from the most recent NCBI dataset of completely sequenced genomes. Analyses are currently calculated using PSORTb, the most precise automated SCL predictor for bacterial proteins. Both datasets can be accessed through the web using a very flexible text search engine, a data browser, or using BLAST, and the entire database or search results may be downloaded in various formats. Features such as GO ontologies and multiple accession numbers are incorporated to facilitate integration with other bioinformatics resources. PSORTdb is freely available under GNU General Public License. © Oxford University Press 2005; all rights reserved.",
                "authors": [
                    {
                        "name": "Rey S."
                    },
                    {
                        "name": "Acab M."
                    },
                    {
                        "name": "Gardy J.L."
                    },
                    {
                        "name": "Laird M.R."
                    },
                    {
                        "name": "deFays K."
                    },
                    {
                        "name": "Lambert C."
                    },
                    {
                        "name": "Brinkman F.S.L."
                    }
                ],
                "citationCount": 113,
                "date": "2005-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PSORTdb: A protein subcellular localization database for bacteria"
            },
            "pmid": "15608169"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Membrane and lipoproteins",
            "uri": "http://edamontology.org/topic_0820"
        }
    ],
    "validated": 1
}