{
    "additionDate": "2019-11-14T18:01:29Z",
    "biotoolsCURIE": "biotools:treehouse",
    "biotoolsID": "treehouse",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "antonis.rokas@vanderbilt.edu",
            "name": "Antonis Rokas",
            "orcidid": "https://orcid.org/0000-0002-7248-6551",
            "typeEntity": "Person"
        }
    ],
    "description": "a user-friendly application to obtain subtrees from large phylogenies | Phylogenies are rapidly becoming larger due to the rising number of available genomes. Beyond broad patterns, large phylogenies often become uninterpretable as tip labels are so small or excluded altogether. As a result, large phylogenies can be difficult to use for other researchers especially for groups interested in the relationships among a subset of taxa. Here, we introduce treehouse, a user friendly shiny app that allows researchers to obtain subtrees from large-scale phylogenies. Treehouse is populated with a handful of large-scale phylogenies available through treehouseDB. Additionally, treehouse features an additional function, userTree, which allows a user to upload and parse their own phylogeny | Our aim is to make phylogenies more accessible to all and facilitate researchers exploration in their own phylogenies",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree comparison",
                    "uri": "http://edamontology.org/operation_0325"
                },
                {
                    "term": "Phylogenetic tree bootstrapping",
                    "uri": "http://edamontology.org/operation_0552"
                },
                {
                    "term": "Phylogenetic tree reconstruction",
                    "uri": "http://edamontology.org/operation_3478"
                }
            ]
        }
    ],
    "homepage": "https://github.com/JLSteenwyk/treehouse",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-30T15:48:21.605550Z",
    "name": "treehouse",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S13104-019-4577-5",
            "metadata": {
                "abstract": "© 2019 The Author(s).Objective: Phylogenetic trees that contain hundreds to thousands of taxa are now routinely generated. Retrieving the relationships among a subset of taxa in these large phylogenies can be a challenging or time-consuming task. Addressing this challenge requires the development of tools that facilitate the easy retrieval of subtrees from any user-specified set of taxa in a given phylogeny. Results: We developed treehouse, an open source tool that enables the retrieval of any subtree from a given large phylogeny. With a three-step workflow, treehouse successfully allows a user to obtain a subtree from any phylogeny. Treehouse can help researchers to explore the relationships among any set of taxa from across the tree of life. Treehouse is implemented as a shiny application in the R programming language. Treehouse software and usage instructions are publicly available at https://github.com/JLSteenwyk/treehouse.",
                "authors": [
                    {
                        "name": "Steenwyk J.L."
                    },
                    {
                        "name": "Rokas A."
                    }
                ],
                "citationCount": 2,
                "date": "2019-08-27T00:00:00Z",
                "journal": "BMC Research Notes",
                "title": "Treehouse: A user-friendly application to obtain subtrees from large phylogenies"
            },
            "pmcid": "PMC6712805",
            "pmid": "31455362"
        }
    ],
    "topic": [
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Phylogenomics",
            "uri": "http://edamontology.org/topic_0194"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ]
}