{"collectionID": [], "accessibility": [], "topic": [{"term": "Machine learning", "uri": "http://edamontology.org/topic_3474"}, {"term": "Molecular interactions, pathways and networks", "uri": "http://edamontology.org/topic_0602"}], "owner": "migle_sur", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": "10.1186/s12859-017-1792-8", "note": null, "version": null, "pmid": null, "type": "Primary", "pmcid": null, "metadata": {"title": "EL_PSSM-RT: DNA-binding residue prediction by integrating ensemble learning with PSSM Relation Transformation", "abstract": "© 2017 The Author(s). Background: Prediction of DNA-binding residue is important for understanding the protein-DNA recognition mechanism. Many computational methods have been proposed for the prediction, but most of them do not consider the relationships of evolutionary information between residues. Results: In this paper, we first propose a novel residue encoding method, referred to as the Position Specific Score Matrix (PSSM) Relation Transformation (PSSM-RT), to encode residues by utilizing the relationships of evolutionary information between residues. PDNA-62 and PDNA-224 are used to evaluate PSSM-RT and two existing PSSM encoding methods by five-fold cross-validation. Performance evaluations indicate that PSSM-RT is more effective than previous methods. This validates the point that the relationship of evolutionary information between residues is indeed useful in DNA-binding residue prediction. An ensemble learning classifier (EL_PSSM-RT) is also proposed by combining ensemble learning model and PSSM-RT to better handle the imbalance between binding and non-binding residues in datasets. EL_PSSM-RT is evaluated by five-fold cross-validation using PDNA-62 and PDNA-224 as well as two independent datasets TS-72 and TS-61. Performance comparisons with existing predictors on the four datasets demonstrate that EL_PSSM-RT is the best-performing method among all the predicting methods with improvement between 0.02-0.07 for MCC, 4.18-21.47% for ST and 0.013-0.131 for AUC. Furthermore, we analyze the importance of the pair-relationships extracted by PSSM-RT and the results validates the usefulness of PSSM-RT for encoding DNA-binding residues. Conclusions: We propose a novel prediction method for the prediction of DNA-binding residue with the inclusion of relationship of evolutionary information and ensemble learning. Performance evaluation shows that the relationship of evolutionary information between residues is indeed useful in DNA-binding residue prediction and ensemble learning can be used to address the data imbalance issue between binding and non-binding residues. A web service of EL_PSSM-RT ( http://hlt.hitsz.edu.cn:8080/PSSM-RT_SVM/ ) is provided for free access to the biological research community.", "citationCount": 5, "authors": [{"name": "Zhou J."}, {"name": "Lu Q."}, {"name": "Xu R."}, {"name": "He Y."}, {"name": "Wang H."}], "date": "2017-08-29T00:00:00Z", "journal": "BMC Bioinformatics"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": "Ruifeng Xu", "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "xuruifeng@hit.edu.cn"}], "biotoolsCURIE": "biotools:el_pssm-rt", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "http://hlt.hitsz.edu.cn:8080/PSSM-RT_SVM/", "function": [{"note": null, "input": [], "operation": [{"term": "Protein interaction prediction", "uri": "http://edamontology.org/operation_2492"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:59:01Z", "otherID": [], "description": "DNA-binding residue prediction by integrating ensemble learning with PSSM Relation Transformation.", "toolType": ["Web application"], "editPermission": {"type": "private", "authors": []}, "language": [], "link": [], "biotoolsID": "el_pssm-rt", "additionDate": "2018-08-11T09:09:54Z", "name": "EL_PSSM-RT", "license": null, "documentation": [{"url": "http://hlt.hitsz.edu.cn:8080/PSSM-RT_SVM/readme.jsp", "note": null, "type": "General"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux", "Windows", "Mac"]}