{
    "additionDate": "2024-01-29T12:05:40.569596Z",
    "biotoolsCURIE": "biotools:orientate",
    "biotoolsID": "orientate",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "esteban.egea@upct.es",
            "name": "Esteban Egea-Lopez",
            "typeEntity": "Person"
        }
    ],
    "description": "Automated machine learning classifiers for oral health prediction and research.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://gitlab.com/esteban.egea/orientate",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-01-29T12:05:40.572376Z",
    "license": "MIT",
    "name": "ORIENTATE",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12903-023-03112-W",
            "metadata": {
                "abstract": "Background: The application of data-driven methods is expected to play an increasingly important role in healthcare. However, a lack of personnel with the necessary skills to develop these models and interpret its output is preventing a wider adoption of these methods. To address this gap, we introduce and describe ORIENTATE, a software for automated application of machine learning classification algorithms by clinical practitioners lacking specific technical skills. ORIENTATE allows the selection of features and the target variable, then automatically generates a number of classification models and cross-validates them, finding the best model and evaluating it. It also implements a custom feature selection algorithm for systematic searches of the best combination of predictors for a given target variable. Finally, it outputs a comprehensive report with graphs that facilitates the explanation of the classification model results, using global interpretation methods, and an interface for the prediction of new input samples. Feature relevance and interaction plots provided by ORIENTATE allow to use it for statistical inference, which can replace and/or complement classical statistical studies. Results: Its application to a dataset with healthy and special health care needs (SHCN) children, treated under deep sedation, was discussed as case study. On the example dataset, despite its small size, the feature selection algorithm found a set of features able to predict the need for a second sedation with a f1 score of 0.83 and a ROC (AUC) of 0.92. Eight predictive factors for both populations were found and ordered by the relevance assigned to them by the model. A discussion of how to derive inferences from the relevance and interaction plots and a comparison with a classical study is also provided. Conclusions: ORIENTATE automatically finds suitable features and generates accurate classifiers which can be used in preventive tasks. In addition, researchers without specific skills on data methods can use it for the application of machine learning classification and as a complement to classical studies for inferential analysis of features. In the case study, a high prediction accuracy for a second sedation in SHCN children was achieved. The analysis of the relevance of the features showed that the number of teeth with pulpar treatments at the first sedation is a predictive factor for a second sedation.",
                "authors": [
                    {
                        "name": "Egea-Lopez E."
                    },
                    {
                        "name": "Gomez-Rios I."
                    },
                    {
                        "name": "OrtizRuiz A.J."
                    }
                ],
                "date": "2023-12-01T00:00:00Z",
                "journal": "BMC Oral Health",
                "title": "ORIENTATE: automated machine learning classifiers for oral health prediction and research"
            },
            "pmcid": "PMC10283267",
            "pmid": "37340367"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Dentistry",
            "uri": "http://edamontology.org/topic_3405"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
