{
    "additionDate": "2024-01-18T10:05:20.317333Z",
    "biotoolsCURIE": "biotools:mass_dynamics",
    "biotoolsID": "mass_dynamics",
    "description": "A software platform for analysis and visualization of label-free and tandem mass tag (TMT) data-dependent acquisition (DDA) bottom-up proteomics data, including pathway and gene set enrichment analyses.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Mass spectrometry data",
                        "uri": "http://edamontology.org/data_2536"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Report",
                        "uri": "http://edamontology.org/data_2048"
                    }
                }
            ]
        }
    ],
    "homepage": "https://massdynamics.com/",
    "lastUpdate": "2024-01-18T12:57:09.002286Z",
    "name": "Mass Dynamics",
    "owner": "n.m.palmblad@lumc.nl",
    "publication": [
        {
            "doi": "10.1021/acs.jproteome.1c00683",
            "metadata": {
                "abstract": "Label-free quantification (LFQ) of shotgun proteomics data is a popular and robust method for the characterization of relative protein abundance between samples. Many analytical pipelines exist for the automation of this analysis, and some tools exist for the subsequent representation and inspection of the results of these pipelines. Mass Dynamics 1.0 (MD 1.0) is a web-based analysis environment that can analyze and visualize LFQ data produced by software such as MaxQuant. Unlike other tools, MD 1.0 utilizes a cloud-based architecture to enable researchers to store their data, enabling researchers to not only automatically process and visualize their LFQ data but also annotate and share their findings with collaborators and, if chosen, to easily publish results to the community. With a view toward increased reproducibility and standardization in proteomics data analysis and streamlining collaboration between researchers, MD 1.0 requires minimal parameter choices and automatically generates quality control reports to verify experiment integrity. Here, we demonstrate that MD 1.0 provides reliable results for protein expression quantification, emulating Perseus on benchmark datasets over a wide dynamic range. The MD 1.0 platform is available globally via: https://app.massdynamics.com/.",
                "authors": [
                    {
                        "name": "Bloom J."
                    },
                    {
                        "name": "Burton Ngov P."
                    },
                    {
                        "name": "Infusini G."
                    },
                    {
                        "name": "Quaglieri A."
                    },
                    {
                        "name": "Triantafyllidis A."
                    },
                    {
                        "name": "Webb A."
                    }
                ],
                "citationCount": 1,
                "date": "2021-11-05T00:00:00Z",
                "journal": "Journal of Proteome Research",
                "title": "Mass Dynamics 1.0: A Streamlined, Web-Based Environment for Analyzing, Sharing, and Integrating Label-Free Data"
            },
            "pmid": "34647461",
            "type": [
                "Primary"
            ],
            "version": "1.0"
        },
        {
            "doi": "10.1101/2022.12.12.517480",
            "type": [
                "Primary"
            ],
            "version": "2.0"
        }
    ],
    "version": [
        "1.0",
        "2.0"
    ]
}
