{
    "accessibility": "Open access",
    "additionDate": "2024-02-09T09:57:36.510602Z",
    "biotoolsCURIE": "biotools:eyecnn",
    "biotoolsID": "eyecnn",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "sayhitowaqar@gmail.com",
            "name": "Waqar Hussain",
            "typeEntity": "Person"
        }
    ],
    "description": "Exploring the potential of convolutional neural networks for identification of multiple eye diseases through retinal imagery.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Information extraction",
                    "uri": "http://edamontology.org/operation_3907"
                }
            ]
        }
    ],
    "homepage": "https://abdulrafay97-eyecnn-app-rd9wgz.streamlit.app/",
    "lastUpdate": "2024-11-24T14:17:10.173436Z",
    "name": "EyeCNN",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/s10792-023-02764-5",
            "metadata": {
                "abstract": "Background: The eyes are the most important part of the human body as these are directly connected to the brain and help us perceive the imagery in daily life whereas, eye diseases are mostly ignored and underestimated until it is too late. Diagnosing eye disorders through manual diagnosis by the physician can be very costly and time taking. Objective: Thus, to tackle this, a novel method namely EyeCNN is proposed for identifying eye diseases through retinal images using EfficientNet B3. Methods: A dataset of retinal imagery of three diseases, i.e. Diabetic Retinopathy, Glaucoma, and Cataract is used to train 12 convolutional networks while EfficientNet B3 was the topperforming model out of all 12 models with a testing accuracy of 94.30%. Results: After preprocessing of the dataset and training of models, various experimentations were performed to see where our model stands. The evaluation was performed using some well-defined measures and the final model was deployed on the Streamlit server as a prototype for public usage. The proposed model has the potential to help diagnose eye diseases early, which can facilitate timely treatment. Conclusion: The use of EyeCNN for classifying eye diseases has the potential to aid ophthalmologists in diagnosing conditions accurately and efficiently. This research may also lead to a deeper understanding of these diseases and it may lead to new treatments. The webserver of EyeCNN can be accessed at (https://abdulrafay97-eyecnn-app-rd9wgz.streamlit.app/).",
                "authors": [
                    {
                        "name": "Asghar Z."
                    },
                    {
                        "name": "Hussain W."
                    },
                    {
                        "name": "Manzoor H."
                    },
                    {
                        "name": "Rafay A."
                    }
                ],
                "citationCount": 4,
                "date": "2023-10-01T00:00:00Z",
                "journal": "International Ophthalmology",
                "title": "EyeCNN: exploring the potential of convolutional neural networks for identification of multiple eye diseases through retinal imagery"
            },
            "pmid": "37291412",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
