{
    "accessibility": "Open access",
    "additionDate": "2022-08-16T22:44:45.675261Z",
    "biotoolsCURIE": "biotools:synbiostrainfinder",
    "biotoolsID": "synbiostrainfinder",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "qnhu@sibs.ac.cn",
            "name": "Qian-Nan Hu",
            "typeEntity": "Person"
        },
        {
            "name": "Dongliang Liu"
        },
        {
            "name": "Sheng Liu"
        }
    ],
    "description": "A microbial strain database of manually curated CRISPR/Cas genetic manipulation system information for biomanufacturing.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Species name",
                        "uri": "http://edamontology.org/data_1045"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Virulence prediction",
                    "uri": "http://edamontology.org/operation_3461"
                }
            ]
        }
    ],
    "homepage": "http://design.rxnfinder.org/biosynstrain/",
    "lastUpdate": "2022-08-16T22:44:45.677869Z",
    "name": "SynBioStrainFinder",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S12934-022-01813-5",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: Microbial strain information databases provide valuable data for microbial basic research and applications. However, they rarely contain information on the genetic operating system of microbial strains. Results: We established a comprehensive microbial strain database, SynBioStrainFinder, by integrating CRISPR/Cas gene-editing system information with cultivation methods, genome sequence data, and compound-related information. It is presented through three modules, Strain2Gms/PredStrain2Gms, Strain2BasicInfo, and Strain2Compd, which combine to form a rapid strain information query system conveniently curated, integrated, and accessible on a single platform. To date, 1426 CRISPR/Cas gene-editing records of 157 microbial strains have been manually extracted from the literature in the Strain2Gms module. For strains without established CRISPR/Cas systems, the PredStrain2Gms module recommends the system of the most closely related strain as a reference to facilitate the construction of a new CRISPR/Cas gene-editing system. The database contains 139,499 records of strain cultivation and genome sequences, and 773,298 records of strain-related compounds. To facilitate simple and intuitive data application, all microbial strains are also labeled with stars based on the order and availability of strain information. SynBioStrainFinder provides a user-friendly interface for querying, browsing, and visualizing detailed information on microbial strains, and it is publicly available at http://design.rxnfinder.org/biosynstrain/. Conclusion: SynBioStrainFinder is the first microbial strain database with manually curated information on the strain CRISPR/Cas system as well as other microbial strain information. It also provides reference information for the construction of new CRISPR/Cas systems. SynBioStrainFinder will serve as a useful resource to extend microbial strain research and application for biomanufacturing.",
                "authors": [
                    {
                        "name": "Cai P."
                    },
                    {
                        "name": "Ding S."
                    },
                    {
                        "name": "Han M."
                    },
                    {
                        "name": "Hu Q.-N."
                    },
                    {
                        "name": "Liu D."
                    },
                    {
                        "name": "Liu S."
                    },
                    {
                        "name": "Zhang D."
                    },
                    {
                        "name": "Zhang R."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "Microbial Cell Factories",
                "title": "SynBioStrainFinder: A microbial strain database of manually curated CRISPR/Cas genetic manipulation system information for biomanufacturing"
            },
            "pmcid": "PMC9107733",
            "pmid": "35568950"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Data submission, annotation and curation",
            "uri": "http://edamontology.org/topic_0219"
        },
        {
            "term": "Genetic engineering",
            "uri": "http://edamontology.org/topic_3912"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        }
    ]
}
