{
    "additionDate": "2017-08-03T18:49:42Z",
    "biotoolsCURIE": "biotools:mcmc_ibdfinder",
    "biotoolsID": "mcmc_ibdfinder",
    "credit": [
        {
            "email": "ida@binf.ku.dk",
            "name": "Ida Moltke",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://people.binf.ku.dk/ida/"
        }
    ],
    "description": "C++ program that estimates posterior probabilities of identity by descent (IBD) sharing between multiple individuals using unphased single nucleotide polymorphism (SNP) data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://128.32.118.212/ida/unprotected/MCMC_IBDfinder_v1.0_manual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical inference",
                    "uri": "http://edamontology.org/operation_3658"
                }
            ]
        }
    ],
    "homepage": "http://people.binf.ku.dk/ida/Software/MCMC_IBDfinder/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/mcmc_ibdfinder-1-0-detect-ibd-regions-simultaneously-multiple-individuals.html"
        }
    ],
    "name": "MCMC_IBDfinder",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "All individuals in a finite population are related if traced back long enough and will, therefore, share regions of their genomes identical by descent (IBD). Detection of such regions has several important applications - from answering questions about human evolution to locating regions in the human genome containing disease-causing variants. However, IBD regions can be difficult to detect, especially in the common case where no pedigree information is available. In particular, all existing non-pedigree based methods can only infer IBD sharing between two individuals. Here, we present a new Markov Chain Monte Carlo method for detection of IBD regions, which does not rely on any pedigree information. It is based on a probabilistic model applicable to unphased SNP data. It can take inbreeding, allele frequencies, genotyping errors, and genomic distances into account. And most importantly, it can simultaneously infer IBD sharing among multiple individuals. Through simulations, we show that the simultaneous modeling of multiple individuals makes the method more powerful and accurate than several other non-pedigree based methods. We illustrate the potential of the method by applying it to data from individuals with breast and/or ovarian cancer, and show that a known disease-causing mutation can be mapped to a 2.2-Mb region using SNP data from only five seemingly unrelated affected individuals. This would not be possible using classical linkage mapping or association mapping. © 2011 by Cold Spring Harbor Laboratory Press.",
                "authors": [
                    {
                        "name": "Albrechtsen A."
                    },
                    {
                        "name": "Hansen T.V.O."
                    },
                    {
                        "name": "Moltke I."
                    },
                    {
                        "name": "Nielsen F.C."
                    },
                    {
                        "name": "Nielsen R."
                    }
                ],
                "citationCount": 35,
                "date": "2011-07-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "A method for detecting IBD regions simultaneously in multiple individuals - With applications to disease genetics"
            },
            "pmid": "21493780"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        }
    ],
    "validated": 1
}
