{
    "accessibility": "Open access",
    "additionDate": "2022-07-21T11:07:00.120863Z",
    "biotoolsCURIE": "biotools:vrmlgen",
    "biotoolsID": "vrmlgen",
    "collectionID": [
        "LCSB",
        "LCSB-BDS",
        "UniLu"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "email": "enrico.glaab@uni.lu",
            "name": "Enrico Glaab",
            "orcidid": "https://orcid.org/0000-0003-3977-7469"
        }
    ],
    "description": "VRMLGen is a free software package for 3D data visualisation on the web. It supports VRML and LiveGraphics3D formats. The package runs within the R environment for statistical computing and is available for download from CRAN. It is licensed under the terms of GNU GPL version 2 (or later).\nVRMLGen can be used to generate 3D line and bar charts, scatter plots with density estimation contour surfaces, visualizations of height maps, parametric functions and 3D object models.",
    "download": [
        {
            "type": "Downloads page",
            "url": "https://ico2s.org/software/vrmlgen.html",
            "version": "1.4.9"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://ico2s.org/software/vrmlgen.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-07-21T11:30:09.699168Z",
    "license": "GPL-2.0",
    "maturity": "Legacy",
    "name": "VRMLGen",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "enricogl",
    "publication": [
        {
            "doi": "10.18637/jss.v036.i08",
            "metadata": {
                "abstract": "The 3-dimensional representation and inspection of complex data is a frequently used strategy in many data analysis domains. Existing data mining software often lacks functionality that would enable users to explore 3D data interactively, especially if one wishes to make dynamic graphical representations directly viewable on the web. In this paper we present vrmlgen, a software package for the statistical programming language R to create 3D data visualizations in web formats like the Virtual Reality Markup Language (VRML) and LiveGraphics3D. vrmlgen can be used to generate 3D charts and bar plots, scatter plots with density estimation contour surfaces, and visualizations of height maps, 3D object models and parametric functions. For greater flexibility, the user can also access low-level plotting methods through a unified interface and freely group different function calls together to create new higher-level plotting methods. Additionally, we present a web tool allowing users to visualize 3D data online and test some of vrmlgen's features without the need to install any software on their computer.",
                "authors": [
                    {
                        "name": "Garibaldi J.M."
                    },
                    {
                        "name": "Glaab E."
                    },
                    {
                        "name": "Krasnogor N."
                    }
                ],
                "citationCount": 8,
                "date": "2010-01-01T00:00:00Z",
                "journal": "Journal of Statistical Software",
                "title": "Vrmlgen: An R package for 3D data visualization on the web"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        },
        {
            "term": "Functional genomics",
            "uri": "http://edamontology.org/topic_0085"
        }
    ],
    "version": [
        "1.4.9"
    ]
}
