{"credit":[{"email":"z.l.i@godziklab.org","name":"POSA Support","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://posa.sanfordburnham.org/help.php"}],"function":[{"operation":[{"term":"Multiple structure alignment","uri":"http://edamontology.org/operation_0504"}]},{"operation":[{"term":"Structure alignment","uri":"http://edamontology.org/operation_0295"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Protein structure analysis","uri":"http://edamontology.org/topic_2814"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/posa-partial-order-structure-alignment.html"}],"publication":[{"abstract":"POSA (Partial Order Structure Alignment), available at http://posa. godziklab.org, is a server for multiple protein structure alignment introduced in 2005 (Ye,Y. and Godzik,A. (2005) Multiple flexible structure alignment using partial order graphs. Bioinformatics, 21, 2362-2369). It is free and open to all users, and there is no login requirement, albeit there is an option to register and store results in individual, password-protected directories. In the updated POSA server described here, we introduce two significant improvements. First is an interface allowing the user to provide additional information by defining segments that anchor the alignment in one or more input structures. This interface allows users to take advantage of their intuition and biological insights to improve the alignment and guide it toward a biologically relevant solution. The second improvement is an interactive visualization with options that allow the user to view all superposed structures in one window (a typical solution for visualizing results of multiple structure alignments) or view them individually in a series of synchronized windows with extensive, user-controlled visualization options. The user can rotate structure(s) in any of the windows and study similarities or differences between structures clearly visible in individual windows. © 2014 The Author(s).","authors":["Li Z.","Natarajan P.","Ye Y.","Hrabe T.","Godzik A."],"cit_count":14,"journal":"Nucleic Acids Research","pmid":"24838569","title":"POSA: A user-driven, interactive multiple protein structure alignment server","year":"2014-07-01"}],"summary":{"biotoolsCURIE":"biotools:posa","biotoolsID":"posa","description":"Multiple flexible protein structure alignment server using a partial order graph representation.","homepage":"http://posa.godziklab.org/","name":"POSA"}}