{
    "additionDate": "2017-01-17T14:51:06Z",
    "biotoolsCURIE": "biotools:biolccc",
    "biotoolsID": "biolccc",
    "collectionID": [
        "ms-utils",
        "Proteomics"
    ],
    "credit": [
        {
            "email": "webmaster@ms-utils.org",
            "typeEntity": "Person",
            "typeRole": [
                "Documentor"
            ],
            "url": "http://ms-utils.org"
        }
    ],
    "description": "An analytic model of peptide retention.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://theorchromo.ru/"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://packages.python.org/pyteomics.biolccc/API/mespaceBioLCCC.html"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein sequence",
                        "uri": "http://edamontology.org/data_2976"
                    },
                    "format": [
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Retention time prediction",
                    "uri": "http://edamontology.org/operation_3633"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Peptide property",
                        "uri": "http://edamontology.org/data_2979"
                    },
                    "format": [
                        {
                            "term": "HTML",
                            "uri": "http://edamontology.org/format_2331"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://theorchromo.ru/",
    "lastUpdate": "2019-03-26T08:12:17Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://ms-utils.org"
        }
    ],
    "name": "BioLCCC",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "msutils_import",
    "publication": [
        {
            "metadata": {
                "abstract": "An approach to sequence-dependent retention time prediction of peptides based on the concept of liquid chromatography at critical conditions (LCCC) is presented. Within the LCCC approach applied to biopolymers (BioLCCC), the specific retention time corresponds to a particular sequence. In combination with mass spectrometry, this approach provides an efficient tool to solve problems wherein the protein sequencing is essential. In this work, we present a theoretical background of the BioLCCC concept and demonstrate experimentally its feasibility for sequence-dependent LC retention time prediction for peptides. BioLCCC model is based on three notions: (a) a random walk model for a macromolecule chain; (b) an entropy and energy compensation for the macromolecules within the adsorbent pore; and (c) a set of phenomenological parameters for the effective interaction energies of interactions between the amino acid residues and the adsorbent surface. In this work, the phenomenological parameters have been obtained for C18 reversed-phase HPLC. Note, that contrary to alternative additive models for retention time prediction based on summation of the so-called \"retention coefficients\", the BioLCCC approach takes into account the location of amino acids within the primary structure of a peptide and, thus, allows the identification of the peptides having the same composition of amino acids but differing by their arrangement. As a result, this new approach allows prediction of retention time for any possible amino acid sequence in particular HPLC experiments. In addition, the BioLCCC model lacks of main drawbacks of additive approaches that predict retention time for sequences of limited chain lengths and provide information about amino acid composition only. The proposed BioLCCC approach was characterized experimentally using LTQ FT LC-MS and LC-MS/MS data obtained earlier for Escherichia coli. The HPLC system calibration was performed using peptide retention standards. The results received show a linear correlation between predicted and experimental retention times, with a correlation coefficient, R2, of 0.97 for a peptide standard mixture and 0.9 for E. coli data, respectively, with the standard error below 1 min. The work presents the first description of a BioLCCC approach for high-throughput peptide characterization and preliminary results of its feasibility tests. © 2006 American Chemical Society.",
                "authors": [
                    {
                        "name": "Gorshkov A.V."
                    },
                    {
                        "name": "Tarasova I.A."
                    },
                    {
                        "name": "Evreinov V.V."
                    },
                    {
                        "name": "Savitski M.M."
                    },
                    {
                        "name": "Nielsen M.L."
                    },
                    {
                        "name": "Zubarev R.A."
                    },
                    {
                        "name": "Gorshkov M.V."
                    }
                ],
                "citationCount": 60,
                "date": "2006-11-15T00:00:00Z",
                "journal": "Analytical Chemistry",
                "title": "Liquid chromatography at critical conditions: Comprehensive approach to sequence-dependent retention time prediction"
            },
            "pmid": "17105170"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ]
}