{
    "name": "ThermoLabAnimal", 
    "description": "High-throughput analysis software for non-invasive thermal assessment of laboratory mic.", 
    "homepage": "https://github.com/ThermoLabAnimal/ThermoLabAnimal_FreeVersion", 
    "biotoolsID": "ThermoLabAnimal", 
    "biotoolsCURIE": "biotools:ThermoLabAnimal", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [], 
    "toolType": [
        "Workflow"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3382", 
            "term": "Imaging"
        }, 
        {
            "uri": "http://edamontology.org/topic_3500", 
            "term": "Zoology"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "MATLAB"
    ], 
    "license": "Unlicense", 
    "collectionID": [], 
    "maturity": "Mature", 
    "cost": "Free of charge", 
    "accessibility": [
        "Open access"
    ], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "https://github.com/ThermoLabAnimal/ThermoLabAnimal_FreeVersion/issues", 
            "type": "Issue tracker", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "https://github.com/ThermoLabAnimal/ThermoLabAnimal_FreeVersion/blob/master/README.md", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1016/J.PHYSBEH.2019.05.004", 
            "pmid": "31078672", 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "ThermoLabAnimal – A high-throughput analysis software for non-invasive thermal assessment of laboratory mice", 
                "abstract": "© 2019 Elsevier Inc.Body temperature changes in laboratory mice are often assessed by invasive and stressful methods, which may confound the measurement. Infrared thermography is a possible non-invasive alternative, but the cost of standard thermal cameras, lack of dedicated software for biomedical purposes, and labour-intensiveness of thermal image analysis have limited their use. An additional limitation lies on the scarcity of research on the causing factors of differences between body surface and core body temperature. We propose a method for automatic assessment of mean body surface temperature in freely-moving mice, using dedicated software for thermal image analysis. While skin surface temperature may not necessarily be linearly correlated with core body temperature (in itself an imprecise concept), under standardized environmental conditions, such as those in which laboratory animals are kept, mean body surface temperature can provide useful information on their thermal status (i.e. deviations from normothermia, namely hypo- and hyperthermia). We developed a publicly available software that includes an imaging analysis workflow/algorithm for automatic segmentation of the pixels associated with the animal from the pixels associated with the background, removing the need for manually defining the area of analysis. A batch analysis mode is also available, for automatic and high-throughput analysis of all image files located in a folder. The software is compatible with the most widespread thermal camera manufacturer, ‘FLIR Systems’, as well as with the low-cost ‘Thermal Expert TE-Q1’ miniaturized high-resolution thermal camera used for this study. Furthermore, the software has been validated in a mouse model expressing non-transient hypothermia, where the thermal analysis results were compared with readings from implanted thermo-sensitive passive integrated transponders tags. Thermography allows for thermal assessment of laboratory animals without the effect of handling stress on their physiology or behaviour. Our automatic image analysis software also removes observer errors and bias, while speeding up the data processing.", 
                "date": "2019-08-01T00:00:00Z", 
                "citationCount": 1, 
                "authors": [
                    {
                        "name": "Franco N.H."
                    }, 
                    {
                        "name": "Geros A."
                    }, 
                    {
                        "name": "Oliveira L."
                    }, 
                    {
                        "name": "Olsson I.A.S."
                    }, 
                    {
                        "name": "Aguiar P."
                    }
                ], 
                "journal": "Physiology and Behavior"
            }
        }
    ], 
    "credit": [
        {
            "name": "Paulo Aguiar", 
            "email": "pauloaguiar@ineb.up.pt", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "hans", 
    "additionDate": "2019-08-09T13:18:05Z", 
    "lastUpdate": "2019-10-31T12:19:44Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 0, 
    "homepage_status": 0, 
    "elixir_badge": 0
}