{
    "additionDate": "2021-10-31T09:06:20.102254Z",
    "biotoolsCURIE": "biotools:deepd2v",
    "biotoolsID": "deepd2v",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hliu@cczu.edu.cn",
            "name": "Hui Liu",
            "typeEntity": "Person"
        },
        {
            "email": "xjliu@njtech.edu.cn",
            "name": "Xuejun Liu",
            "typeEntity": "Person"
        }
    ],
    "description": "A Novel Deep Learning-Based Framework for Predicting Transcription Factor Binding Sites from Combined DNA Sequence.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA binding site prediction",
                    "uri": "http://edamontology.org/operation_3903"
                },
                {
                    "term": "DNA-binding protein prediction",
                    "uri": "http://edamontology.org/operation_3900"
                },
                {
                    "term": "Small molecule design",
                    "uri": "http://edamontology.org/operation_4009"
                },
                {
                    "term": "Transcription factor binding site prediction",
                    "uri": "http://edamontology.org/operation_0445"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Sparkleiii/DeepD2V",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-10-31T09:06:20.104797Z",
    "name": "DeepD2V",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3390/IJMS22115521",
            "metadata": {
                "abstract": "© 2021 by the authors. Licensee MDPI, Basel, Switzerland.Predicting in vivo protein–DNA binding sites is a challenging but pressing task in a variety of fields like drug design and development. Most promoters contain a number of transcription factor (TF) binding sites, but only a small minority has been identified by biochemical experiments that are time-consuming and laborious. To tackle this challenge, many computational methods have been proposed to predict TF binding sites from DNA sequence. Although previous methods have achieved remarkable performance in the prediction of protein–DNA interactions, there is still considerable room for improvement. In this paper, we present a hybrid deep learning framework, termed DeepD2V, for transcription factor binding sites prediction. First, we construct the input matrix with an original DNA sequence and its three kinds of variant sequences, including its inverse, complementary, and complementary inverse sequence. A sliding window of size k with a specific stride is used to obtain its k-mer representation of input sequences. Next, we use word2vec to obtain a pre-trained k-mer word distributed representation model. Finally, the probability of protein–DNA binding is predicted by using the recurrent and convolutional neural network. The experiment results on 50 public ChIP-seq benchmark datasets demonstrate the superior performance and robustness of DeepD2V. Moreover, we verify that the performance of DeepD2V using word2vec-based k-mer distributed representation is better than one-hot encoding, and the integrated framework of both convolutional neural network (CNN) and bidirectional LSTM (bi-LSTM) outperforms CNN or the bi-LSTM model when used alone. The source code of DeepD2V is available at the github repository.",
                "authors": [
                    {
                        "name": "Deng L."
                    },
                    {
                        "name": "Liu H."
                    },
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Wu H."
                    }
                ],
                "date": "2021-06-01T00:00:00Z",
                "journal": "International Journal of Molecular Sciences",
                "title": "Deepd2v: A novel deep learning-based framework for predicting transcription factor binding sites from combined dna sequence"
            },
            "pmcid": "PMC8197256",
            "pmid": "34073774"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
