{
    "additionDate": "2021-01-18T08:15:44Z",
    "biotoolsCURIE": "biotools:swift-active_screener",
    "biotoolsID": "swift-active_screener",
    "confidence_flag": "tool",
    "description": "Accelerated document screening through active learning and integrated recall estimation.\nIn the screening phase of systematic review, researchers use detailed inclusion exclusion criteria to decide whether each article in a set of candidate articles is relevant to the research question under consideration. A typical review may require screening thousands or tens of thousands of articles in and can utilize hundreds of person-hours of labor. METHODS:Here we introduce SWIFT-Active Screener, a web-based, collaborative systematic review software application, designed to reduce the overall screening burden required during this resource-intensive phase of the review process. To prioritize articles for review, SWIFT-Active Screener uses active learning, a type of machine learning that incorporates user feedback during screening",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                }
            ]
        }
    ],
    "homepage": "https://www.sciome.com/swift-activescreener/",
    "lastUpdate": "2024-11-24T20:41:48.726690Z",
    "name": "SWIFT-Active Screener",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1016/j.envint.2020.105623",
            "metadata": {
                "abstract": "Background: In the screening phase of systematic review, researchers use detailed inclusion/exclusion criteria to decide whether each article in a set of candidate articles is relevant to the research question under consideration. A typical review may require screening thousands or tens of thousands of articles in and can utilize hundreds of person-hours of labor. Methods: Here we introduce SWIFT-Active Screener, a web-based, collaborative systematic review software application, designed to reduce the overall screening burden required during this resource-intensive phase of the review process. To prioritize articles for review, SWIFT-Active Screener uses active learning, a type of machine learning that incorporates user feedback during screening. Meanwhile, a negative binomial model is employed to estimate the number of relevant articles remaining in the unscreened document list. Using a simulation involving 26 diverse systematic review datasets that were previously screened by reviewers, we evaluated both the document prioritization and recall estimation methods. Results: On average, 95% of the relevant articles were identified after screening only 40% of the total reference list. In the 5 document sets with 5,000 or more references, 95% recall was achieved after screening only 34% of the available references, on average. Furthermore, the recall estimator we have proposed provides a useful, conservative estimate of the percentage of relevant documents identified during the screening process. Conclusion: SWIFT-Active Screener can result in significant time savings compared to traditional screening and the savings are increased for larger project sizes. Moreover, the integration of explicit recall estimation during screening solves an important challenge faced by all machine learning systems for document screening: when to stop screening a prioritized reference list. The software is currently available in the form of a multi-user, collaborative, online web application.",
                "authors": [
                    {
                        "name": "Elmore R."
                    },
                    {
                        "name": "Howard B.E."
                    },
                    {
                        "name": "Maharana A."
                    },
                    {
                        "name": "Mav D."
                    },
                    {
                        "name": "Merrick B.A."
                    },
                    {
                        "name": "Phillips J."
                    },
                    {
                        "name": "Rooney A."
                    },
                    {
                        "name": "Sedykh A."
                    },
                    {
                        "name": "Shah R.R."
                    },
                    {
                        "name": "Tandon A."
                    },
                    {
                        "name": "Thayer K."
                    },
                    {
                        "name": "Walker V."
                    }
                ],
                "citationCount": 85,
                "date": "2020-05-01T00:00:00Z",
                "journal": "Environment International",
                "title": "SWIFT-Active Screener: Accelerated document screening through active learning and integrated recall estimation"
            },
            "pmcid": "PMC8082972",
            "pmid": "32203803"
        }
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}
