{
    "additionDate": "2017-08-03T18:48:08Z",
    "biotoolsCURIE": "biotools:lnetwork",
    "biotoolsID": "lnetwork",
    "credit": [
        {
            "email": "wangjuanangle@hit.edu.cn",
            "name": "Juan Wang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://nclab.hit.edu.cn/"
        }
    ],
    "description": "Efficient and effective method for constructing phylogenetic networks. It takes as input a set of rooted phylogenetic trees given in Newick format (inputfile shows an example of input data).",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://nclab.hit.edu.cn/~wangjuan/LNETWORK/README.txt"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree generation",
                    "uri": "http://edamontology.org/operation_0323"
                }
            ]
        }
    ],
    "homepage": "http://nclab.hit.edu.cn/~wangjuan/LNETWORK/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/lnetwork-20140320-an-efficient-and-effective-method-for-constructing-phylogenetic-networks.html"
        }
    ],
    "name": "LNETWORK",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: The evolutionary history of species is traditionally represented with a rooted phylogenetic tree. Each tree comprises a set of clusters, i.e. subsets of the species that are descended from a common ancestor. When rooted phylogenetic trees are built from several different datasets (e.g. from different genes), the clusters are often conflicting. These conflicting clusters cannot be expressed as a simple phylogenetic tree; however, they can be expressed in a phylogenetic network. Phylogenetic networks are a generalization of phylogenetic trees that can account for processes such as hybridization, horizontal gene transfer and recombination, which are difficult to represent in standard tree-like models of evolutionary histories. There is currently a large body of research aimed at developing appropriate methods for constructing phylogenetic networks from cluster sets. The Cass algorithm can construct a much simpler network than other available methods, but is extremely slow for large datasets or for datasets that need lots of reticulate nodes. The networks constructed by Cass are also greatly dependent on the order of input data, i.e. it generally derives different phylogenetic networks for the same dataset when different input orders are used.Results: In this study, we introduce an improved Cass algorithm, Lnetwork, which can construct a phylogenetic network for a given set of clusters. We show that Lnetwork is significantly faster than Cass and effectively weakens the influence of input data order. Moreover, we show that Lnetwork can construct a much simpler network than most of the other available methods. © The Author 2013.",
                "authors": [
                    {
                        "name": "Che K."
                    },
                    {
                        "name": "Guo M."
                    },
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Wang C."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Xing L."
                    }
                ],
                "citationCount": 17,
                "date": "2013-09-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Lnetwork: An efficient and effective method for constructing phylogenetic networks"
            },
            "pmid": "23811095"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        }
    ],
    "validated": 1
}
