{
    "additionDate": "2018-07-24T14:47:27Z",
    "biotoolsCURIE": "biotools:chat",
    "biotoolsID": "chat",
    "credit": [
        {
            "email": "simon.baker@cl.cam.ac.uk",
            "name": "Simon Baker",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Text mining approach to organize and evaluate scientific literature on cancer.",
    "documentation": [
        {
            "type": [
                "API documentation"
            ],
            "url": "http://chat.lionproject.net/api"
        },
        {
            "type": [
                "General"
            ],
            "url": "http://chat.lionproject.net/about"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "homepage": "http://chat.lionproject.net/",
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "CHAT",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btx454",
            "metadata": {
                "abstract": "© The Author 2017. Published by Oxford University Press. All rights reserved.Motivation: To understand the molecular mechanisms involved in cancer development, significant efforts are being invested in cancer research. This has resulted in millions of scientific articles. An efficient and thorough review of the existing literature is crucially important to drive new research. This time-demanding task can be supported by emerging computational approaches based on text mining which offer a great opportunity to organize and retrieve the desired information efficiently from sizable databases. One way to organize existing knowledge on cancer is to utilize the widely accepted framework of the Hallmarks of Cancer. These hallmarks refer to the alterations in cell behaviour that characterize the cancer cell. Results: We created an extensive Hallmarks of Cancer taxonomy and developed automatic text mining methodology and a tool (CHAT) capable of retrieving and organizing millions of cancerrelated references from PubMed into the taxonomy. The efficiency and accuracy of the tool was evaluated intrinsically as well as extrinsically by case studies. The correlations identified by the tool show that it offers a great potential to organize and correctly classify cancer-related literature. Furthermore, the tool can be useful, for example, in identifying hallmarks associated with extrinsic factors, biomarkers and therapeutics targets.",
                "authors": [
                    {
                        "name": "Ali I."
                    },
                    {
                        "name": "Baker S."
                    },
                    {
                        "name": "Guo Y."
                    },
                    {
                        "name": "Hogberg J."
                    },
                    {
                        "name": "Korhonen A."
                    },
                    {
                        "name": "Pyysalo S."
                    },
                    {
                        "name": "Silins I."
                    },
                    {
                        "name": "Stenius U."
                    }
                ],
                "citationCount": 47,
                "date": "2017-12-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Cancer Hallmarks Analytics Tool (CHAT): A text mining approach to organize and evaluate scientific literature on cancer"
            },
            "pmcid": "PMC5860084",
            "pmid": "29036271"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ],
    "validated": 1
}
