{
    "accessibility": "Open access",
    "additionDate": "2022-09-07T14:31:29.772789Z",
    "biotoolsCURIE": "biotools:cmdsr",
    "biotoolsID": "cmdsr",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Changhu Wang"
        },
        {
            "name": "Guanghao Yin"
        }
    ],
    "description": "CMDSR is a novel conditional meta-network framework which helps the SR framework learn how to adapt to changes in the degradation distribution of input.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://github.com/guanghaoyin/CMDSR",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:40:58.482107Z",
    "license": "MIT",
    "name": "CMDSR",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1109/tip.2022.3176526",
            "metadata": {
                "abstract": "Although the single-image super-resolution (SISR) methods have achieved great success on the single degradation, they still suffer performance drop with multiple degrading effects in real scenarios. Recently, some blind and non-blind models for multiple degradations have been explored. However, these methods usually degrade significantly for distribution shifts between the training and test data. Towards this end, we propose a novel conditional hyper-network framework for super-resolution with multiple degradations (named CMDSR), which helps the SR framework learn how to adapt to changes in the degradation distribution of input. We extract degradation prior at the task-level with the proposed ConditionNet, which will be used to adapt the parameters of the basic SR network (BaseNet). Specifically, the ConditionNet of our framework first learns the degradation prior from a support set, which is composed of a series of degraded image patches from the same task. Then the adaptive BaseNet rapidly shifts its parameters according to the conditional features. Moreover, in order to better extract degradation prior, we propose a task contrastive loss to shorten the inner-task distance and enlarge the cross-task distance between task-level features. Without predefining degradation maps, our blind framework can conduct one single parameter update to yield considerable improvement in SR results. Extensive experiments demonstrate the effectiveness of CMDSR over various blind, and even several non-blind methods. The flexible BaseNet structure also reveals that CMDSR can be a general framework for a large series of SISR models. Our code is available at https://github.com/guanghaoyin/CMDSR.",
                "authors": [
                    {
                        "name": "Chua T.-S."
                    },
                    {
                        "name": "Ji W."
                    },
                    {
                        "name": "Sun S."
                    },
                    {
                        "name": "Wang C."
                    },
                    {
                        "name": "Wang W."
                    },
                    {
                        "name": "Yin G."
                    },
                    {
                        "name": "Yu D."
                    },
                    {
                        "name": "Yuan Z."
                    }
                ],
                "citationCount": 13,
                "date": "2022-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Image Processing",
                "title": "Conditional Hyper-Network for Blind Super-Resolution With Multiple Degradations"
            },
            "pmid": "35635814"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}
