{
    "additionDate": "2017-08-03T19:06:05Z",
    "biotoolsCURIE": "biotools:icdi-psefpt",
    "biotoolsID": "icdi-psefpt",
    "credit": [
        {
            "email": "jdzxiaoxuan@163.com",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.jci-bioinfo.cn/"
        }
    ],
    "description": "Independent predictor using Fuzzy K-Nearest Neighbor algorithm, used to predict ion channel-drug interactions. It can be used to identify a pair as Ion channel-drug pair or non-Ion channel drug pair according to the sequence of protein and the molecular fingerprint of drug.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.jci-bioinfo.cn/iCDI-PseFpt/readme.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Residue interaction prediction",
                    "uri": "http://edamontology.org/operation_0272"
                }
            ]
        }
    ],
    "homepage": "http://www.jci-bioinfo.cn/iCDI-PseFpt/",
    "lastUpdate": "2018-12-10T12:58:43Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/icdi-psefpt-identify-the-channel-drug-interaction-in-cellular-networking-with-pseaac-and-molecular-fingerprints.html"
        }
    ],
    "name": "iCDI-PseFpt",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Many crucial functions in life, such as heartbeat, sensory transduction and central nervous system response, are controlled by cell signalings via various ion channels. Therefore, ion channels have become an excellent drug target, and study of ion channel-drug interaction networks is an important topic for drug development. However, it is both time-consuming and costly to determine whether a drug and a protein ion channel are interacting with each other in a cellular network by means of experimental techniques. Although some computational methods were developed in this regard based on the knowledge of the 3D (three-dimensional) structure of protein, unfortunately their usage is quite limited because the 3D structures for most protein ion channels are still unknown. With the avalanche of protein sequences generated in the post-genomic age, it is highly desirable to develop the sequence-based computational method to address this problem. To take up the challenge, we developed a new predictor called iCDI-PseFpt, in which the protein ion-channel sample is formulated by the PseAAC (pseudo amino acid composition) generated with the gray model theory, the drug compound by the 2D molecular fingerprint, and the operation engine is the fuzzy K-nearest neighbor algorithm. The overall success rate achieved by iCDI-PseFpt via the jackknife cross-validation was 87.27%, which is remarkably higher than that by any of the existing predictors in this area. As a user-friendly web-server, iCDI-PseFpt is freely accessible to the public at the website http://www.jci-bioinfo.cn/iCDI-PseFpt/. Furthermore, for the convenience of most experimental scientists, a step-by-step guide is provided on how to use the web-server to get the desired results without the need to follow the complicated math equations presented in the paper just for its integrity. It has not escaped our notice that the current approach can also be used to study other drug-target interaction networks. © 2013 Elsevier Ltd.",
                "authors": [
                    {
                        "name": "Xiao X."
                    },
                    {
                        "name": "Min J.-L."
                    },
                    {
                        "name": "Wang P."
                    },
                    {
                        "name": "Chou K.-C."
                    }
                ],
                "citationCount": 106,
                "date": "2013-11-21T00:00:00Z",
                "journal": "Journal of Theoretical Biology",
                "title": "ICDI-PseFpt: Identify the channel-drug interaction in cellular networking with PseAAC and molecular fingerprints"
            },
            "pmid": "23988798"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Membrane and lipoproteins",
            "uri": "http://edamontology.org/topic_0820"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        }
    ],
    "validated": 1
}