{
    "additionDate": "2021-01-18T07:29:29Z",
    "biotoolsCURIE": "biotools:bsm-arc",
    "biotoolsID": "bsm-arc",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "gertjan.bekker@protein.osaka-u.ac.jp",
            "name": "Gert-Jan Bekker",
            "orcidid": "https://orcid.org/0000-0001-8385-5693",
            "typeEntity": "Person"
        }
    ],
    "description": "The Biological Structure Model Archive (BSM-Arc) aims to collect raw data obtained via in silico methods related to structural biology, such as computationally modeled 3D structures and molecular dynamics trajectories. Since BSM-Arc does not enforce a specific data format for the raw data, depositors are free to upload their data without any prior conversion. Besides uploading raw data, BSM-Arc enables depositors to annotate their data with additional explanations and figures. It is possible to recreate 3D scenes as shown in the corresponding scientific article in an interactive manner.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                },
                {
                    "term": "Trajectory visualization",
                    "uri": "http://edamontology.org/operation_3890"
                },
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                }
            ]
        }
    ],
    "homepage": "https://bsma.pdbj.org",
    "lastUpdate": "2021-02-06T20:17:00Z",
    "name": "BSM-Arc",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1007/S12551-020-00632-5",
            "metadata": {
                "abstract": "© 2020, The Author(s).We present the Biological Structure Model Archive (BSM-Arc, https://bsma.pdbj.org), which aims to collect raw data obtained via in silico methods related to structural biology, such as computationally modeled 3D structures and molecular dynamics trajectories. Since BSM-Arc does not enforce a specific data format for the raw data, depositors are free to upload their data without any prior conversion. Besides uploading raw data, BSM-Arc enables depositors to annotate their data with additional explanations and figures. Furthermore, via our WebGL-based molecular viewer Molmil, it is possible to recreate 3D scenes as shown in the corresponding scientific article in an interactive manner. To submit a new entry, depositors require an ORCID ID to login, and to finally publish the data, an accompanying peer-reviewed paper describing the work must be associated with the entry. Submitting their data enables researchers to not only have an external backup but also provide an opportunity to promote their work via an interactive platform and to provide third-party researchers access to their raw data.",
                "authors": [
                    {
                        "name": "Bekker G.-J."
                    },
                    {
                        "name": "Kawabata T."
                    },
                    {
                        "name": "Kurisu G."
                    }
                ],
                "citationCount": 15,
                "date": "2020-04-01T00:00:00Z",
                "journal": "Biophysical Reviews",
                "title": "The Biological Structure Model Archive (BSM-Arc): an archive for in silico models and simulations"
            },
            "pmcid": "PMC7242595",
            "pmid": "32026396"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Electron microscopy",
            "uri": "http://edamontology.org/topic_0611"
        }
    ]
}