{
    "additionDate": "2019-11-14T18:01:34Z",
    "biotoolsCURIE": "biotools:atlas-genome",
    "biotoolsID": "atlas-genome",
    "confidence_flag": "tool",
    "description": "A Snakemake workflow for assembly, annotation, and genomic binning of metagenome sequence data | A global overview of pleiotropy and genetic architecture in complex traits | ATLAS - Three commands to start analysing your metagenome data | Genome wide association study ATLAS | Welcome to the Atlas of GWAS Summary Statistics | This atlas is a database of publicly available GWAS summary statistics | All databases and dependencies are installed on the fly in the directory db-dir | Free document hosting provided by Read the Docs",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Read binning",
                    "uri": "http://edamontology.org/operation_3798"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                }
            ]
        }
    ],
    "homepage": "https://atlas.ctglab.nl",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-02T16:02:22Z",
    "license": "BSD-3-Clause",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/metagenome-atlas/atlas"
        },
        {
            "type": [
                "Other"
            ],
            "url": "https://metagenome-atlas.rtfd.io"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/metagenome-atlas"
        }
    ],
    "name": "ATLAS",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/s12859-020-03585-4",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Metagenomics studies provide valuable insight into the composition and function of microbial populations from diverse environments; however, the data processing pipelines that rely on mapping reads to gene catalogs or genome databases for cultured strains yield results that underrepresent the genes and functional potential of uncultured microbes. Recent improvements in sequence assembly methods have eased the reliance on genome databases, thereby allowing the recovery of genomes from uncultured microbes. However, configuring these tools, linking them with advanced binning and annotation tools, and maintaining provenance of the processing continues to be challenging for researchers. Results: Here we present ATLAS, a software package for customizable data processing from raw sequence reads to functional and taxonomic annotations using state-of-the-art tools to assemble, annotate, quantify, and bin metagenome data. Abundance estimates at genome resolution are provided for each sample in a dataset. ATLAS is written in Python and the workflow implemented in Snakemake; it operates in a Linux environment, and is compatible with Python 3.5+ and Anaconda 3+ versions. The source code for ATLAS is freely available, distributed under a BSD-3 license. Conclusions: ATLAS provides a user-friendly, modular and customizable Snakemake workflow for metagenome data processing; it is easily installable with conda and maintained as open-source on GitHub at https://github.com/metagenome-atlas/atlas.",
                "authors": [
                    {
                        "name": "Kieser S."
                    },
                    {
                        "name": "Brown J."
                    },
                    {
                        "name": "Zdobnov E.M."
                    },
                    {
                        "name": "Trajkovski M."
                    },
                    {
                        "name": "McCue L.A."
                    }
                ],
                "citationCount": 5,
                "date": "2020-06-22T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "ATLAS: A Snakemake workflow for assembly, annotation, and genomic binning of metagenome sequence data"
            }
        },
        {
            "doi": "10.1038/S41588-019-0481-0",
            "metadata": {
                "abstract": "© 2019, The Author(s), under exclusive licence to Springer Nature America, Inc.After a decade of genome-wide association studies (GWASs), fundamental questions in human genetics, such as the extent of pleiotropy across the genome and variation in genetic architecture across traits, are still unanswered. The current availability of hundreds of GWASs provides a unique opportunity to address these questions. We systematically analyzed 4,155 publicly available GWASs. For a subset of well-powered GWASs on 558 traits, we provide an extensive overview of pleiotropy and genetic architecture. We show that trait-associated loci cover more than half of the genome, and 90% of these overlap with loci from multiple traits. We find that potential causal variants are enriched in coding and flanking regions, as well as in regulatory elements, and show variation in polygenicity and discoverability of traits. Our results provide insights into how genetic variation contributes to trait variation. All GWAS results can be queried and visualized at the GWAS ATLAS resource (https://atlas.ctglab.nl).",
                "authors": [
                    {
                        "name": "Watanabe K."
                    },
                    {
                        "name": "Stringer S."
                    },
                    {
                        "name": "Frei O."
                    },
                    {
                        "name": "Umicevic Mirkov M."
                    },
                    {
                        "name": "de Leeuw C."
                    },
                    {
                        "name": "Polderman T.J.C."
                    },
                    {
                        "name": "van der Sluis S."
                    },
                    {
                        "name": "Andreassen O.A."
                    },
                    {
                        "name": "Neale B.M."
                    },
                    {
                        "name": "Posthuma D."
                    }
                ],
                "citationCount": 91,
                "date": "2019-09-01T00:00:00Z",
                "journal": "Nature Genetics",
                "title": "A global overview of pleiotropy and genetic architecture in complex traits"
            },
            "pmid": "31427789"
        }
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}