{
    "additionDate": "2018-05-19T15:24:39Z",
    "biotoolsCURIE": "biotools:irspot-tncpseaac",
    "biotoolsID": "irspot-tncpseaac",
    "credit": [
        {
            "email": "jdzxiaoxuan@163.com",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Identify Recombination Spots with Trinucleotide Composition and Pseudo Amino Acid Components.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.jci-bioinfo.cn/IRspot/IRspot_readme.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence motif recognition",
                    "uri": "http://edamontology.org/operation_0239"
                }
            ]
        }
    ],
    "homepage": "http://www.jci-bioinfo.cn/iRSpot-TNCPseAAC",
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "iRSpot-TNCPseAAC",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.3390/IJMS15021746",
            "metadata": {
                "abstract": "Meiosis and recombination are the two opposite aspects that coexist in a DNA system. As a driving force for evolution by generating natural genetic variations, meiotic recombination plays a very important role in the formation of eggs and sperm. Interestingly, the recombination does not occur randomly across a genome, but with higher probability in some genomic regions called \"hotspots\", while with lower probability in so-called \"coldspots\". With the ever-increasing amount of genome sequence data in the postgenomic era, computational methods for effectively identifying the hotspots and coldspots have become urgent as they can timely provide us with useful insights into the mechanism of meiotic recombination and the process of genome evolution as well. To meet the need, we developed a new predictor called \"iRSpot-TNCPseAAC\", in which a DNA sample was formulated by combining its trinucleotide composition (TNC) and the pseudo amino acid components (PseAAC) of the protein translated from the DNA sample according to its genetic codes. The former was used to incorporate its local or short-rage sequence order information; while the latter, its global and long-range one. Compared with the best existing predictor in this area, iRSpot-TNCPseAAC achieved higher rates in accuracy, Mathew's correlation coefficient, and sensitivity, indicating that the new predictor may become a useful tool for identifying the recombination hotspots and coldspots, or, at least, become a complementary tool to the existing methods. It has not escaped our notice that the aforementioned novel approach to incorporate the DNA sequence order information into a discrete model may also be used for many other genome analysis problems. The web-server for iRSpot-TNCPseAAC is available at http://www.jci-bioinfo.cn/iRSpot-TNCPseAAC. Furthermore, for the convenience of the vast majority of experimental scientists, a step-by-step guide is provided on how to use the current web server to obtain their desired result without the need to follow the complicated mathematical equations. © 2014 by the authors; licensee MDPI, Basel, Switzerland.",
                "authors": [
                    {
                        "name": "Qiu W.-R."
                    },
                    {
                        "name": "Xiao X."
                    },
                    {
                        "name": "Chou K.-C."
                    }
                ],
                "citationCount": 222,
                "date": "2014-01-24T00:00:00Z",
                "journal": "International Journal of Molecular Sciences",
                "title": "iRSpot-TNCPseAAC: Identify recombination spots with trinucleotide composition and pseudo amino acid components"
            },
            "pmcid": "PMC3958819",
            "pmid": "24469313"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "DNA replication and recombination",
            "uri": "http://edamontology.org/topic_3127"
        },
        {
            "term": "Nucleic acid sites, features and motifs",
            "uri": "http://edamontology.org/topic_3511"
        }
    ],
    "validated": 1
}