{
    "additionDate": "2019-11-14T18:15:48Z",
    "biotoolsCURIE": "biotools:Glyco-DIA",
    "biotoolsID": "Glyco-DIA",
    "confidence_flag": "high",
    "description": "a method for quantitative O-glycoproteomics with in silico-boosted glycopeptide libraries | Glyco-DIA is a method for quantitative O-glycoproteomics with in silico-boosted glycopeptide libraries | The Glyco-DIA library consists of sublibraries obtained from human cell lines and human serum, and it currently covers 2,076 O-glycoproteins (11,452 unique glycopeptide sequences) and the five most common core1 O-glycan structures. Applying the Glyco-DIA library to human serum without enrichment for glycopeptides enabled us to identify and quantify 269 distinct glycopeptide sequences bearing up to 5 different core1 O-glycans from 159 glycoproteins in a singleshot analysis. The DIA method is expandable and widely applicable to different glycoproteomes, and it may represent a first step towards direct and comprehensive approach to glycoproteomics",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Post-translation modification site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "homepage": "https://github.com/CCGMS/Glyco-DIA",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-11-14T18:15:48Z",
    "name": "Glyco-DIA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1038/S41592-019-0504-X",
            "metadata": {
                "abstract": "© 2019, The Author(s), under exclusive licence to Springer Nature America, Inc.We report a liquid chromatography coupled to tandem mass spectrometry O-glycoproteomics strategy using data-independent acquisition (DIA) mode for direct analysis of O-glycoproteins. This approach enables characterization of glycopeptides and structures of O-glycans on a proteome-wide scale with quantification of stoichiometries (though it does not allow for direct unambiguous glycosite identification). The method relies on a spectral library of O-glycopeptides; the Glyco-DIA library contains sublibraries obtained from human cell lines and human serum, and it currently covers 2,076 O-glycoproteins (11,452 unique glycopeptide sequences) and the 5 most common core1 O-glycan structures. Applying the Glyco-DIA library to human serum without enrichment for glycopeptides enabled us to identify and quantify 269 distinct glycopeptide sequences bearing up to 5 different core1 O-glycans from 159 glycoproteins in a SingleShot analysis.",
                "authors": [
                    {
                        "name": "Ye Z."
                    },
                    {
                        "name": "Mao Y."
                    },
                    {
                        "name": "Clausen H."
                    },
                    {
                        "name": "Vakhrushev S.Y."
                    }
                ],
                "date": "2019-09-01T00:00:00Z",
                "journal": "Nature Methods",
                "title": "Glyco-DIA: a method for quantitative O-glycoproteomics with in silico-boosted glycopeptide libraries"
            },
            "pmid": "31384044"
        }
    ],
    "topic": [
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        }
    ]
}