{
    "additionDate": "2022-10-09T12:41:45.524275Z",
    "biotoolsCURIE": "biotools:diatoms_org",
    "biotoolsID": "diatoms_org",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Marina G Potapova"
        },
        {
            "name": "Mark B Edlund"
        },
        {
            "name": "Sarah A Spaulding"
        }
    ],
    "description": "Diatoms.org represents such a content curation community, providing open, online access to a vast amount of recent and historical information on North American diatom taxonomy and ecology.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Ecological modelling",
                    "uri": "http://edamontology.org/operation_3946"
                }
            ]
        }
    ],
    "homepage": "http://Diatoms.org",
    "lastUpdate": "2022-10-09T12:41:45.526731Z",
    "license": "Not licensed",
    "name": "diatoms.org",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1080/0269249X.2021.2006790",
            "metadata": {
                "abstract": "©, This work was authored as part of the Contributor's official duties as an Employee of the United States Government and is therefore a work of the United States Government. In accordance with 17 U.S.C. 105, no copyright protection is available for such works under U.S. Law.Consistent identification of diatoms is a prerequisite for studying their ecology, biogeography, and successful application as environmental indicators. However, taxonomic consistency among observers has been difficult to achieve because taxonomic information is scattered across numerous literature sources, presenting challenges to the diatomist. Firstly, literature is often inaccessible because of cost or its location in journals that are not widely circulated. Secondly, taxonomic revisions of diatoms are taking place faster than floras can be updated. Finally, taxonomic information is often contradictory across literature sources. These issues can be addressed by developing a content creation community dedicated to making taxonomic, ecological, and image-based data freely available for diatom researchers. Diatoms.org represents such a content curation community, providing open, online access to a vast amount of recent and historical information on North American diatom taxonomy and ecology. The content curation community aggregates existing taxonomic information, creates new content, and provides feedback in the form of corrections and notices of literature with nomenclatural changes. The website not only addresses the needs of experienced diatom scientists for consistent identification but is also designed to meet users at their level of expertise, including engaging the lay public in the importance of diatom science. The website now contains over 1000 species pages contributed by over 100 content contributors, from students to established scientists. The project began with the intent to provide accurate information on diatom identification, ecology, and distribution using an approach that incorporates engaging design, user feedback, and advanced data access technology. In retrospect, the project that began as an ‘extended electronic book’ has emerged not only as a means to support taxonomists, but for practitioners to communicate and collaborate, expanding the size of and benefits to the content curation community. In this paper, we outline the development of diatoms.org, document key elements of the project, examine ongoing challenges and consider the unexpected emergent properties, including the value of diatoms.org as a source of data. Ultimately, if the field of diatom taxonomy, ecology, and biodiversity is to be relevant, a new generation of taxonomists needs to be trained and employed using new tools. We propose that diatoms.org is in a key position to serve as a hub of training and continuity for the study of diatom biodiversity and aquatic conditions.",
                "authors": [
                    {
                        "name": "Bishop I.W."
                    },
                    {
                        "name": "Edlund M.B."
                    },
                    {
                        "name": "Furey P.C."
                    },
                    {
                        "name": "Gasperak T.S."
                    },
                    {
                        "name": "Jovanoska E."
                    },
                    {
                        "name": "Lee S.S."
                    },
                    {
                        "name": "Potapova M.G."
                    },
                    {
                        "name": "Spaulding S.A."
                    }
                ],
                "citationCount": 5,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Diatom Research",
                "title": "Diatoms.org: supporting taxonomists, connecting communities"
            },
            "pmcid": "PMC9359083",
            "pmid": "35958044"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        }
    ],
    "validated": 1
}
