{
    "additionDate": "2024-03-18T16:43:42.238250Z",
    "biotoolsCURIE": "biotools:mudcod",
    "biotoolsID": "mudcod",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "otastan@sabanciuniv.edu",
            "name": "Oznur Tastan",
            "orcidid": "https://orcid.org/0000-0001-7058-5372",
            "typeEntity": "Person"
        },
        {
            "email": "keles@stat.wisc.edu",
            "name": "Sündüz Keleş",
            "typeEntity": "Person"
        }
    ],
    "description": "Multi-subject community detection in personalized dynamic gene networks from single-cell RNA sequencing.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bo1929/MuDCoD",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:08:18.324921Z",
    "license": "MIT",
    "name": "MuDCoD",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btad592",
            "metadata": {
                "abstract": "Motivation: With the wide availability of single-cell RNA-seq (scRNA-seq) technology, population-scale scRNA-seq datasets across multiple individuals and time points are emerging. While the initial investigations of these datasets tend to focus on standard analysis of clustering and differential expression, leveraging the power of scRNA-seq data at the personalized dynamic gene co-expression network level has the potential to unlock subject and/or time-specific network-level variation, which is critical for understanding phenotypic differences. Community detection from co-expression networks of multiple time points or conditions has been well-studied; however, none of the existing settings included networks from multiple subjects and multiple time points simultaneously. To address this, we develop Multi-subject Dynamic Community Detection (MuDCoD) for multi-subject community detection in personalized dynamic gene networks from scRNA-seq. MuDCoD builds on the spectral clustering framework and promotes information sharing among the networks of the subjects as well as networks at different time points. It clusters genes in the personalized dynamic gene networks and reveals gene communities that are variable or shared not only across time but also among subjects. Results: Evaluation and benchmarking of MuDCoD against existing approaches reveal that MuDCoD effectively leverages apparent shared signals among networks of the subjects at individual time points, and performs robustly when there is no or little information sharing among the networks. Applications to population-scale scRNA-seq datasets of human-induced pluripotent stem cells during dopaminergic neuron differentiation and CD4+ T cell activation indicate that MuDCoD enables robust inference for identifying time-varying personalized gene modules. Our results illustrate how personalized dynamic community detection can aid in the exploration of subject-specific biological processes that vary across time. Availability and implementation: MuDCoD is publicly available at https://github.com/bo1929/MuDCoD as a Python package. Implementation includes simulation and real-data experiments together with extensive documentation.",
                "authors": [
                    {
                        "name": "Ay F."
                    },
                    {
                        "name": "Keles S."
                    },
                    {
                        "name": "Lu S."
                    },
                    {
                        "name": "Sapci A.O.B."
                    },
                    {
                        "name": "Tastan O."
                    },
                    {
                        "name": "Yan S."
                    }
                ],
                "date": "2023-10-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "MuDCoD: Multi-subject community detection in personalized dynamic gene networks from single-cell RNA sequencing"
            },
            "pmcid": "PMC10564618",
            "pmid": "37740957"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
