{
    "additionDate": "2021-09-08T13:44:41Z",
    "biotoolsCURIE": "biotools:deephomo",
    "biotoolsID": "deephomo",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "huangsy@hust.edu.cn",
            "name": "Sheng-You Huang",
            "typeEntity": "Person"
        }
    ],
    "description": "DeepHomo is a tool for accurate prediction of inter-protein residue-residue contacts for homo-oligomeric or homo-dimeric protein complexes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Ab initio structure prediction",
                    "uri": "http://edamontology.org/operation_0476"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Protein-protein docking",
                    "uri": "http://edamontology.org/operation_3899"
                },
                {
                    "term": "Residue contact prediction",
                    "uri": "http://edamontology.org/operation_0272"
                },
                {
                    "term": "Residue distance calculation",
                    "uri": "http://edamontology.org/operation_2950"
                }
            ]
        }
    ],
    "homepage": "http://huanglab.phys.hust.edu.cn/DeepHomo/",
    "lastUpdate": "2024-11-24T20:19:41.092380Z",
    "name": "DeepHomo",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/bib/bbab038",
            "metadata": {
                "abstract": "Protein-protein interactions play a fundamental role in all cellular processes. Therefore, determining the structure of protein-protein complexes is crucial to understand their molecular mechanisms and develop drugs targeting the protein-protein interactions. Recently, deep learning has led to a breakthrough in intra-protein contact prediction, achieving an unusual high accuracy in recent Critical Assessment of protein Structure Prediction (CASP) structure prediction challenges. However, due to the limited number of known homologous protein-protein interactions and the challenge to generate joint multiple sequence alignments of two interacting proteins, the advances in inter-protein contact prediction remain limited. Here, we have proposed a deep learning model to predict inter-protein residue-residue contacts across homo-oligomeric protein interfaces, named as DeepHomo. Unlike previous deep learning approaches, we integrated intra-protein distance map and inter-protein docking pattern, in addition to evolutionary coupling, sequence conservation, and physico-chemical information of monomers. DeepHomo was extensively tested on both experimentally determined structures and realistic CASP-Critical Assessment of Predicted Interaction (CAPRI) targets. It was shown that DeepHomo achieved a high precision of >60% for the top predicted contact and outperformed state-of-The-Art direct-coupling analysis and machine learning-based approaches. Integrating predicted inter-chain contacts into protein-protein docking significantly improved the docking accuracy on the benchmark dataset of realistic homo-dimeric targets from CASP-CAPRI experiments. DeepHomo is available at http://huanglab.phys.hust.edu.cn/DeepHomo/",
                "authors": [
                    {
                        "name": "Huang S.-Y."
                    },
                    {
                        "name": "Yan Y."
                    }
                ],
                "citationCount": 40,
                "date": "2021-09-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "Accurate prediction of inter-protein residue-residue contacts for homo-oligomeric protein complexes"
            },
            "pmcid": "PMC8425427",
            "pmid": "33693482"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
