{
    "additionDate": "2019-11-14T20:02:34Z",
    "biotoolsCURIE": "biotools:SSCOR",
    "biotoolsID": "SSCOR",
    "confidence_flag": "low",
    "description": "> LOW CONFIDENCE! | > HOMEPAGE MISSING! | Designing a Sum of Squared Correlations Framework for Enhancing SSVEP-Based BCIs | This study illustrates and evaluates a novel subject-specific target detection framework, sum of squared correlations (SSCOR), for improving the performance of steady-state visual evoked potential (SSVEP) based brain-computer interfaces (BCIs). The SSCOR spatial filter learns a common SSVEP representation space through the optimization of the individual SSVEP templates. The projection onto this SSVEP response subspace improves the signal to noise ratio (SNR) of the SSVEP components embedded in the recorded electroencephalographic (EEG) data. To demonstrate the effectiveness of the proposed framework, the target detection performance of the SSCOR method is compared with the state of the art task-related component analysis (TRCA). The evaluation is conducted on a 40 target SSVEP benchmark data collected from 35 subjects",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31536009",
    "lastUpdate": "2019-11-14T20:02:34Z",
    "name": "SSCOR",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1109/TNSRE.2019.2941349",
            "metadata": {
                "abstract": "This study illustrates and evaluates a novel subject-specific target detection framework, sum of squared correlations (SSCOR), for improving the performance of steady-state visual evoked potential (SSVEP) based brain-computer interfaces (BCIs). The SSCOR spatial filter learns a common SSVEP representation space through the optimization of the individual SSVEP templates. The projection onto this SSVEP response subspace improves the signal to noise ratio (SNR) of the SSVEP components embedded in the recorded electroencephalographic (EEG) data. To demonstrate the effectiveness of the proposed framework, the target detection performance of the SSCOR method is compared with the state of the art task-related component analysis (TRCA). The evaluation is conducted on a 40 target SSVEP benchmark data collected from 35 subjects. The results of the extensive comparisons of the performance metrics show that the proposed SSCOR method outperforms the TRCA method. The ensemble version of the SSCOR framework provides an offline simulated information transfer rate (ITR) of 387 ± 9 bits/min which is much higher than that of the ensemble TRCA approach (max. ITR 216 ± 27 bits/min). The significant improvement in the detection accuracy and simulated ITR demonstrates the efficacy of the proposed framework for target detection in SSVEP based BCI applications.",
                "authors": [
                    {
                        "name": "Kiran Kumar G.R."
                    },
                    {
                        "name": "Ramasubba Reddy M."
                    }
                ],
                "date": "2019-10-01T00:00:00Z",
                "journal": "IEEE transactions on neural systems and rehabilitation engineering : a publication of the IEEE Engineering in Medicine and Biology Society",
                "title": "Designing a Sum of Squared Correlations Framework for Enhancing SSVEP-Based BCIs"
            },
            "pmid": "31536009"
        }
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}