{"credit":[{"email":"coela@g-language.org","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"gaou@g-language.org","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://restauro-g.iab.keio.ac.jp/doc.html"},{"type":"OTHER","url":"http://restauro-g.iab.keio.ac.jp/sup.html"}],"function":[{"operation":[{"term":"Genome annotation","uri":"http://edamontology.org/operation_0362"}]}],"labels":{"language":["Perl"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Desktop application"],"topic":[{"term":"Data submission, annotation and curation","uri":"http://edamontology.org/topic_0219"},{"term":"Genomics","uri":"http://edamontology.org/topic_0622"},{"term":"Microbiology","uri":"http://edamontology.org/topic_3301"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/restauro-g-1-0-genome-re-annotation-system-comparative-genomics.html"}],"publication":[{"abstract":"Annotations of complete genome sequences submitted directly from sequencing projects are diverse in terms of annotation strategies and update frequencies. These inconsistencies make comparative studies difficult. To allow rapid data preparation of a large number of complete genomes, automation and speed are important for genome re-annotation. Here we introduce an open-source rapid genome re-annotation software system, Restauro-G, specialized for bacterial genomes. Restauro-G re-annotates a genome by similarity searches utilizing the BLAST-Like Alignment Tool, referring to protein databases such as UniProt KB, NCBI nr, NCBI COGs, Pfam, and PSORTb. Re-annotation by Restauro-G achieved over 98% accuracy for most bacterial chromosomes in comparison with the original manually curated annotation of EMBL releases. Restauro-G was developed in the generic bioinformatics workbench G-language Genome Analysis Environment and is distributed at http://restauro-g.iab.keio.ac.jp/under the GNU General Public License. © 2007 Beijing Genomics Institute.","authors":["Tamaki S.","Arakawa K.","Kono N.","Tomita M."],"cit_count":3,"journal":"Genomics, Proteomics and Bioinformatics","pmid":"17572364","title":"Restauro-G: A Rapid Genome Re-Annotation System for Comparative Genomics","year":"2007-06-15"}],"summary":{"biotoolsCURIE":"biotools:restauro-g","biotoolsID":"restauro-g","description":"An open-source rapid genome re-annotation software system , specialized for bacterial genomes. Restauro-G re-annotates a genome by similarity searches utilizing the BLAST-Like Alignment Tool, referring to protein databases such as UniProt KB, NCBI nr, NCBI COGs, Pfam, and PSORTb. Re-annotation by Restauro-G achieved over 98% accuracy for most bacterial chromosomes in comparison with the original manually curated annotation of EMBL releases.","homepage":"http://restauro-g.iab.keio.ac.jp/","name":"Restauro-G"}}