{"collectionID": [], "accessibility": [], "topic": [{"term": "Protein folding, stability and design", "uri": "http://edamontology.org/topic_0130"}, {"term": "Proteins", "uri": "http://edamontology.org/topic_0078"}, {"term": "Protein structure analysis", "uri": "http://edamontology.org/topic_2814"}, {"term": "Protein sites, features and motifs", "uri": "http://edamontology.org/topic_3510"}, {"term": "Structure analysis", "uri": "http://edamontology.org/topic_0081"}], "owner": "ELIXIR-EE", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": null, "note": null, "version": null, "pmid": "15980473", "type": null, "pmcid": null, "metadata": {"title": "The diamond STING server", "abstract": "Diamond STING is a new version of the STING suite of programs for a comprehensive analysis of a relationship between protein sequence, structure, function and stability. We have added a number of new functionalities by both providing more structure parameters to the STING Database and by improving/expanding the interface for enhanced data handling. The integration among the STING components has also been improved. A new key feature is the ability of the STING server to handle local files containing protein structures (either modeled or not yet deposited to the Protein Data Bank) so that they can be used by the principal STING components: JavaProtein Dossier (J PD) and STING Report. The current capabilities of the new STING version and a couple of biologically relevant applications are described here. We have provided an example where Diamond STING identifies the active site amino acids and folding essential amino acids (both previously determined by experiments) by filtering out all but those residues by selecting the numerical values/ranges for a set of corresponding parameters. This is the fundamental step toward a more interesting endeavor - the prediction of such residues. Diamond STING is freely accessible at http://sms.cbi.cnptia.embrapa.br and http://trantor.bioc.columbia.edu/SMS. © 2005 Oxford University Press.", "citationCount": 20, "authors": [{"name": "Neshich G."}, {"name": "Borro L.C."}, {"name": "Higa R.H."}, {"name": "Kuser P.R."}, {"name": "Yamagishi M.E.B."}, {"name": "Franco E.H."}, {"name": "Krauchenco J.N."}, {"name": "Fileto R."}, {"name": "Ribeiro A.A."}, {"name": "Bezerra G.B.P."}, {"name": "Velludo T.M."}, {"name": "Jimenez T.S."}, {"name": "Furukawa N."}, {"name": "Teshima H."}, {"name": "Kitajima K."}, {"name": "Bava A."}, {"name": "Sarai A."}, {"name": "Togawa R.C."}, {"name": "Mancini A.L."}], "date": "2005-07-01T00:00:00Z", "journal": "Nucleic Acids Research"}}, {"doi": null, "note": null, "version": null, "pmid": "15073001", "type": null, "pmcid": null, "metadata": {"title": "STING Contacts: A web-based application for identification and analysis of amino acid contacts within protein structure and across protein interfaces", "abstract": "Amino acid contacts in terms of atomic interactions are essential factors to be considered in the analysis of the structure of a protein and its complexes. Consequently, molecular biologists do require specific tools for the identification and visualization of all such contacts. Graphical contacts (GC) and interface forming residue graphical contacts (IFRgc) presented here, calculate atomic contacts among amino acids based on a table of predefined pairs of the atom types and their distances, and then display them using number of different forms. The inventory of currently listed contact types by GC and IFRgc include hydrogen bonds (in nine different flavors), hydrophobic interactions, charge-charge interactions, aromatic stacking and disulfide bonds. Such extensive catalog of the interactions, representing the forces that govern protein folding, stability and binding, is the key feature of these two applications. GC and IFRgc are part of STING Millennium Suite. © Oxford University Press 2004; all rights reserved.", "citationCount": 20, "authors": [{"name": "Mancini A.L."}, {"name": "Higa R.H."}, {"name": "Oliveira A."}, {"name": "Dominiquini F."}, {"name": "Kuser P.R."}, {"name": "Yamagishi M.E.B."}, {"name": "Togawa R.C."}, {"name": "Neshich G."}], "date": "2004-09-01T00:00:00Z", "journal": "Bioinformatics"}}, {"doi": null, "note": null, "version": null, "pmid": "15044232", "type": null, "pmcid": null, "metadata": {"title": "Defining 3D residue environment in protein structures using SCORPION and FORMIGA", "abstract": "Two web-based applications to analyze amino acids three-dimensional (3D) local environment within protein structures - SCORPION and FORMIGA - are presented. SCORPION and FORMIGA produce a graphical presentation for simple statistical data showing the frequency of residue occurrence within a given sphere (defined here as the 3D contacts). The center of that sphere is placed at the Cα and at the last heavy atom in the side chain of the selected amino acid. Further depth of detail is given in terms of a secondary structure to which the profiled amino acid belongs. Results obtained with those two applications are relevant for estimating the importance of the amino acid 3D local environment for protein folding and stability. Effectively, SCORPION and FORMIGA construct knowledge-based force fields. The difference between SCORPION and FORMIGA is in that the latter operates on protein interfaces, while the former only functions for a single protein chain. Both applications are implemented as stand-alone components of STING Millennium Suite. © Oxford University Press 2004; all rights reserved.", "citationCount": 3, "authors": [{"name": "Higa R.H."}, {"name": "Oliveira A.G."}, {"name": "Horita L.G."}, {"name": "Miura R.T."}, {"name": "Inoue M.K."}, {"name": "Kuser P.R."}, {"name": "Mancini A.L."}, {"name": "Yamagishi M.E.B."}, {"name": "Togawa R.C."}, {"name": "Neshich G."}], "date": "2004-08-12T00:00:00Z", "journal": "Bioinformatics"}}, {"doi": null, "note": null, "version": null, "pmid": "15608194", "type": null, "pmcid": null, "metadata": {"title": "STING Report: Convenient web-based application for graphic and tabular presentations of protein sequence, structure and function descriptors from the STING database", "abstract": "The Sting Report is a versatile web-based application for extraction and presentation of detailed information about any individual amino acid of a protein structure stored in the STING Database. The extracted information is presented as a series of GIF images and tables, containing the values of up to 125 sequence/structure/function descriptors/parameters. The GIF images are generated by the Gold STING modules. The HTML page resulting from the STING Report query can be printed and, most importantly, it can be composed and visualized on a computer platform with an elementary configuration. Using the STING Report, a user can generate a collection of customized reports for amino acids of specific interest. Such a collection comes as an ideal match for a demand for the rapid and detailed consultation and documentation of data about structure/function. The inclusion of information generated with STING Report in a research report or even a textbook, allows for the increased density of its contents. STING Report is freely accessible within the Gold STING Suite at http://www.cbi.cnptia.embrapa.br, http://www.es.embnet.org/SMS/, http://gibk26.bse.kyutech.ac.jp/SMS/ and http://trantor.bioc.columbia.edu/SMS (option: STING Report). © Oxford University Press 2005; all rights reserved.", "citationCount": 19, "authors": [{"name": "Neshich G."}, {"name": "Mancini A.L."}, {"name": "Yamagishi M.E.B."}, {"name": "Kuser P.R."}, {"name": "Fileto R."}, {"name": "Pinto I.P."}, {"name": "Palandrani J.F."}, {"name": "Krauchenco J.N."}, {"name": "Baudet C."}, {"name": "Montagner A.J."}, {"name": "Higa R.H."}], "date": "2005-01-01T00:00:00Z", "journal": "Nucleic Acids Research"}}, {"doi": null, "note": null, "version": null, "pmid": "15044236", "type": null, "pmcid": null, "metadata": {"title": "ConSSeq: A web-based application for analysis of amino acid conservation based on HSSP database and within context of structure", "abstract": "A web-based application to analyze protein amino acids conservation - Consensus Sequence (ConSSeq) is presented. ConSSeq graphically represents information about amino acid conservation based on sequence alignments reported in homology-derived structures of proteins. Beyond the relative entropy for each position in the alignment, ConSSeq also presents the consensus sequence and information about the amino acids, which are predominant at each position of the alignment. ConSSeq is part of the STING Millennium Suite and is implemented as a Java Applet. © Oxford University Press 2004; all rights reserved.", "citationCount": 6, "authors": [{"name": "Higa R.H."}, {"name": "Montagner A.J."}, {"name": "Togawa R.C."}, {"name": "Kuser P.R."}, {"name": "Yamagishi M.E.B."}, {"name": "Mancini A.L."}, {"name": "Pappas Jr. G."}, {"name": "Miura R.T."}, {"name": "Horita L.G."}, {"name": "Neshich G."}], "date": "2004-08-12T00:00:00Z", "journal": "Bioinformatics"}}, {"doi": null, "note": null, "version": null, "pmid": "10775658", "type": null, "pmcid": null, "metadata": {"title": "Analysis of structural and physico-chemical parameters involved in the specificity of binding between α-amylases and their inhibitors", "abstract": "Enzyme-inhibitor specificity was studied for α-amylases and their inhibitors. We purified and cloned the cDNAs of two different α-amylase inhibitors from the common bean (Phaseolus vulgaris) and have recently cloned the cDNA of an α-amylase of the Mexican bean weevil (Zabrotes subfasciatus), which is inhibited by α-amylase inhibitor 2 but not by α-amylase inhibitor 1. The crystal structure of AI-1 complexed with pancreatic porcine α-amylase allowed us to model the structure of AI-2. The structure of Zabrotes subfasciatus α-amylase was modeled based on the crystal structure of Tenebrio molitor α-amylase, Pairwise AI-1 and AI-2 with PPA and ZSA complexes were modeled. For these complexes we first identified the interface forming residues. In addition, we identified the hydrogen bonds, ionic interactions and loss of hydrophobic surface area resulting from complex formation. The parameters we studied provide insight into the general scheme of binding, but fall short of explaining the specificity of the inhibition. We also introduce three new tools - software packages STING, HORNET and STINGPaint - which efficiently determine the interface forming residues and the ionic interaction data, the hydrogen bond net as well as aid in interpretation of multiple sequence alignment, respectively.", "citationCount": 31, "authors": [{"name": "Da Silva M.C.M."}, {"name": "Grossi De Sa M.F."}, {"name": "Chrispeels M.J."}, {"name": "Togawa R.C."}, {"name": "Neshich G."}], "date": "2000-05-15T00:00:00Z", "journal": "Protein Engineering"}}, {"doi": null, "note": null, "version": null, "pmid": "15301693", "type": null, "pmcid": null, "metadata": {"title": "STING millennium suite: Integrated software forextensive analyses of 3d structures of proteins and their complexes", "abstract": "Background: The integration of many aspects of protein/DNA structure analysis is an important requirement for software products in general area of structural bioinformatics. In fact, there are too few software packages on the internet which can be described as successful in this respect. We might say that what is still missing is publicly available, web based software for interactive analysis of the sequence/structure/function of proteins and their complexes with DNA and ligands. Some of existing software packages do have certain level of integration and do offer analysis of several structure related parameters, however not to the extent generally demanded by a user. Results: We are reporting here about new Sting Millennium Suite (SMS) version which is fully accessible (including for local files at client end), web based software for molecular structure and sequence/structure/function analysis. The new SMS client version is now operational also on Linux boxes and it works with non-public pdb formatted files (structures not deposited at the RCSB/PDB), eliminating earlier requirement for the registration if SMS components were to be used with user's local files. At the same time the new SMS offers some important additions and improvements such as link to ProTherm as well as significant re-engineering of SMS component ConSSeq. Also, we have added 3 new SMS mirror sites to existing network of global SMS servers: Argentina, Japan and Spain. Conclusion: SMS is already established software package and many key data base and software servers worldwide, do offer either a link to, or host the SMS. SMS (Sting Millennium Suite) is web-based publicly available software developed to aid researches in their quest for translating information about the structures of macromolecules into knowledge. SMS allows to a user to interactively analyze molecular structures, cross-referencing visualized information with a correlated one, available across the internet. SMS is already used as a didactic tool by some universities. SMS analysis is now possible on Linux OS boxes and with no requirement for registration when using local files. © 2004 Higa et al; licensee BioMed Central Ltd.", "citationCount": 21, "authors": [{"name": "Higa R.H."}, {"name": "Togawa R.C."}, {"name": "Montagner A.J."}, {"name": "Palandrani J.C.F."}, {"name": "Okimoto I.K.S."}, {"name": "Kuser P.R."}, {"name": "Yamagishi M.E.B."}, {"name": "Mancini A.L."}, {"name": "Neshich G."}], "date": "2004-08-09T00:00:00Z", "journal": "BMC Bioinformatics"}}, {"doi": null, "note": null, "version": null, "pmid": "15215458", "type": null, "pmcid": null, "metadata": {"title": "JavaProtein Dossier: A novel web-based data visualization tool for comprehensive analysis of protein structure", "abstract": "JavaProtein Dossier (JPD) is a new concept, database and visualization tool providing one of the largest collections of the physicochemical parameters describing proteins' structure, stability, function and interaction with other macromolecules. By collecting as many descriptors/parameters as possible within a single database, we can achieve a better use of the available data and information. Furthermore, data grouping allows us to generate different parameters with the potential to provide new insights into the sequence-structure-function relationship. In JPD, residue selection can be performed according to multiple criteria. JPD can simultaneously display and analyze all the physicochemical parameters of any pair of structures, using precalculated structural alignments, allowing direct parameter comparison at corresponding amino acid positions among homologous structures. In order to focus on the physicochemical (and consequently pharmacological) profile of proteins, visualization tools (showing the structure and structural parameters) also had to be optimized. Our response to this challenge was the use of Java technology with its exceptional level of interactivity. JPD is freely accessible (within the Gold Sting Suite) at http://sms.cbi.cnptia.embrapa.br, http://mirrors.rcsb.org/SMS, http://trantor.bioc.columbia.edu/ SMS and http://www.es.embnet.org/SMS/ (Option: JavaProtein Dossier. © Oxford University Press 2004; all rights reserved.", "citationCount": 32, "authors": [{"name": "Neshich G."}, {"name": "Rocchia W."}, {"name": "Mancini A.L."}, {"name": "Yamagishi M.E.B."}, {"name": "Kuser P.R."}, {"name": "Fileto R."}, {"name": "Baudet C."}, {"name": "Pinto I.P."}, {"name": "Montagner A.J."}, {"name": "Palandrani J.F."}, {"name": "Krauchenco J.N."}, {"name": "Torres R.C."}, {"name": "Souza S."}, {"name": "Togawa R.C."}, {"name": "Higa R.H."}], "date": "2004-07-01T00:00:00Z", "journal": "Nucleic Acids Research"}}, {"doi": null, "note": null, "version": null, "pmid": "12824333", "type": null, "pmcid": null, "metadata": {"title": "STING Millennium: A web-based suite of programs for comprehensive and simultaneous analysis of protein structure and sequence", "abstract": "STING Millennium Suite (SMS) is a new web-based suite of programs and databases providing visualization and a complex analysis of molecular sequence and structure for the data deposited at the Protein Data Bank (PDB). SMS operates with a collection of both publicly available data (PDB, HSSP, Prosite) and its own data (contacts, interface contacts, surface accessibility). Biologists find SMS useful because it provides a variety of algorithms and validated data, wrapped-up in a user friendly web interface. Using SMS it is now possible to analyze sequence to structure relationships, the quality of the structure, nature and volume of atomic contacts of intra and inter chain type, relative conservation of amino acids at the specific sequence position based on multiple sequence alignment, indications of folding essential residue (FER) based on the relationship of the residue conservation to the intra-chain contacts and Cα-Cα and Cβ-Cβ distance geometry. Specific emphasis in SMS is given to interface forming residues (IFR) - amino acids that define the interactive portion of the protein surfaces. SMS may simultaneously display and analyze previously superimposed structures. PDB updates trigger SMS updates in a synchronized fashion. SMS is freely accessible for public data at http://www.cbi.cnptia.embrapa.br, http://mirrors.rcsb.org/SMS and http://trantor.bioc.columbia.edu/SMS.", "citationCount": 43, "authors": [{"name": "Neshich G."}, {"name": "Togawa R.C."}, {"name": "Mancini A.L."}, {"name": "Kuser P.R."}, {"name": "Yamagishi M.E.B."}, {"name": "Pappas Jr. G."}, {"name": "Torres W.V."}, {"name": "Fonseca e Campos T."}, {"name": "Ferreira L.L."}, {"name": "Luna F.M."}, {"name": "Oliveira A.G."}, {"name": "Miura R.T."}, {"name": "Inoue M.K."}, {"name": "Horita L.G."}, {"name": "de Souza D.F."}, {"name": "Dominiquini F."}, {"name": "Alvaro A."}, {"name": "Lima C.S."}, {"name": "Ogawa F.O."}, {"name": "Gomes G.B."}, {"name": "Palandrani J.F."}, {"name": "dos Santos G.F."}, {"name": "de Freitas E.M."}, {"name": "Mattiuz A.R."}, {"name": "Costa I.C."}, {"name": "de Almeida C.L."}, {"name": "Souza S."}, {"name": "Baudet C."}, {"name": "Higa R.H."}], "date": "2003-07-01T00:00:00Z", "journal": "Nucleic Acids Research"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": "Neshich G.", "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "neshich@cnptia.embrapa.br"}], "biotoolsCURIE": "biotools:sting_millenium", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "http://sms.cbi.cnptia.embrapa.br/SMS/STINGm/", "function": [{"note": null, "input": [], "operation": [{"term": "Protein sequence analysis", "uri": "http://edamontology.org/operation_2479"}, {"term": "Protein function analysis", "uri": "http://edamontology.org/operation_2414"}, {"term": "Protein secondary structure analysis", "uri": "http://edamontology.org/operation_2416"}, {"term": "Protein structure analysis", "uri": "http://edamontology.org/operation_2406"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:52Z", "otherID": [], "description": "STING is a suite of tools for the analysis of protein sequence, structure, stability and function - and the relationships between them.", "toolType": ["Web application"], "editPermission": {"type": "private", "authors": []}, "language": ["JavaScript", "C++", "Perl"], "link": [], "biotoolsID": "sting_millenium", "additionDate": "2017-02-07T13:52:11Z", "name": "STING Millenium", "license": null, "documentation": [{"url": "http://sms.cbi.cnptia.embrapa.br/SMS/STINGm/", "note": null, "type": "User manual"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux", "Windows", "Mac"]}