{"credit":[{"email":"xinglong.wang@manchester.ac.uk","name":"Xinglong Wang","typeEntity":"Person","typeRoles":["Primary contact"]}],"function":[{"operation":[{"term":"Data handling","uri":"http://edamontology.org/operation_2409"},{"term":"Named-entity and concept recognition","uri":"http://edamontology.org/operation_3280"},{"term":"Taxonomic classification","uri":"http://edamontology.org/operation_3460"},{"term":"Text mining","uri":"http://edamontology.org/operation_0306"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Natural language processing","uri":"http://edamontology.org/topic_0218"},{"term":"Model organisms","uri":"http://edamontology.org/topic_0621"},{"term":"Taxonomy","uri":"http://edamontology.org/topic_0637"},{"term":"Machine learning","uri":"http://edamontology.org/topic_3474"},{"term":"Ontology and terminology","uri":"http://edamontology.org/topic_0089"}]},"publication":[{"abstract":"Motivation: Text mining technologies have been shown to reduce the laborious work involved in organizing the vast amount of information hidden in the literature. One challenge in text mining is linking ambiguous word forms to unambiguous biological concepts. This article reports on a comprehensive study on resolving the ambiguity in mentions of biomedical named entities with respect to model organisms and presents an array of approaches, with focus on methods utilizing natural language parsers. Results: We build a corpus for organism disambiguation where every occurrence of protein/gene entity is manually tagged with a species ID, and evaluate a number of methods on it. Promising results are obtained by training a machine learning model on syntactic parse trees, which is then used to decide whether an entity belongs to the model organism denoted by a neighbouring species-indicating word (e.g. yeast). The parser-based approaches are also compared with a supervised classification method and results indicate that the former are a more favorable choice when domain portability is of concern. The best overall performance is obtained by combining the strengths of syntactic features and supervised classification. Availability: The corpus and demo are available at http://www.nactem.ac.uk/deca_details/start.cgi, and the software is freely available as U-Compare components (Kano et al., 2009): NaCTeM Species Word Detector and NaCTeM Species Disambiguator. U-Compare is available at http://-compare.org/. Contact: xinglong.wang@manchester.ac.uk © The Author(s) 2010. Published by Oxford University Press.","authors":["Wang X.","Tsujii J.","Ananiadou S."],"cit_count":36,"journal":"Bioinformatics","pmid":"20053840","title":"Disambiguating the species of biomedical named entities using natural language parsers","year":"2010-01-06"}],"summary":{"biotoolsCURIE":"biotools:deca","biotoolsID":"deca","description":"Species disambiguation system for biological named entities. The system will identify protein entities and disambiguate them according to species, by assigning NCBI Taxonomy organism IDs.","homepage":"http://www.nactem.ac.uk/deca_details/start.cgi","name":"DECA"}}