{
    "additionDate": "2020-01-09T17:43:17Z",
    "biotoolsCURIE": "biotools:MetumpX",
    "biotoolsID": "MetumpX",
    "confidence_flag": "tool",
    "description": "A Metabolomics Support Package for Untargeted Mass Spectrometry.\n\nA Metabolomics Support Package for Untargeted Mass Spectrometery.\n\nMetumpX is a Ubuntu based software package that facilitate easy download and installation of about 89 tools related to standard Untargeted Metabolomics Mass Spectrometery pipeline.\n\nInstallation • Authors • License • Revision History",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Spectrum calculation",
                    "uri": "http://edamontology.org/operation_3860"
                },
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                },
                {
                    "term": "Mass spectra calibration",
                    "uri": "http://edamontology.org/operation_3627"
                }
            ]
        }
    ],
    "homepage": "https://github.com/hasaniqbal777/MetumpX-bin",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-28T09:55:08Z",
    "license": "GPL-3.0",
    "name": "MetumpX",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ765",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press.Motivation: Metabolomics is a data analysis and interpretation field aiming to study functions of small molecules within the organism. Consequently Metabolomics requires researchers in life sciences to be comfortable in downloading, installing and scripting of software that are mostly not user friendly and lack basic GUIs. As the researchers struggle with these skills, there is a dire need to develop software packages that can automatically install software pipelines truly speeding up the learning curve to build software workstations. Therefore, this paper aims to provide MetumpX, a software package that eases in the installation of 103 software by automatically resolving their individual dependencies and also allowing the users to choose which software works best for them. Results: MetumpX is a Ubuntu-based software package that facilitate easy download and installation of 103 tools spread across the standard metabolomics pipeline. As far as the authors know MetumpX is the only solution of its kind where the focus lies on automating development of software workstations.",
                "authors": [
                    {
                        "name": "Wajid B."
                    },
                    {
                        "name": "Iqbal H."
                    },
                    {
                        "name": "Jamil M."
                    },
                    {
                        "name": "Rafique H."
                    },
                    {
                        "name": "Anwar F."
                    }
                ],
                "citationCount": 2,
                "date": "2020-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "MetumpX - A metabolomics support package for untargeted mass spectrometry"
            },
            "pmid": "31596440"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}