
{
    "credit": [
        {
            "email": "yedeng@rcees.ac.cn",
            "name": "Ye Deng",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Antimicrobial resistance prediction",
                    "uri": "http://edamontology.org/operation_3482"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                }
            ]
        }
    ],
    "labels": {
        "accessibility": [
            "Open access"
        ],
        "cost": "Free of charge (with restrictions)",
        "license": "Unlicense",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Probes and primers",
                "uri": "http://edamontology.org/topic_0632"
            },
            {
                "term": "Metagenomics",
                "uri": "http://edamontology.org/topic_3174"
            },
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019 The AuthorsMolecular biology techniques have assisted in the investigation of antibiotic resistance genes (ARGs) from various environments. However, their accuracy relies on primer quality and data interpretation, both of which require a full-coverage sequence database for ARGs. Here, based upon the abandoned Antibiotic Resistance Genes Database (ARDB), we created an updated sequence database of antibiotic resistance genes (SDARG). A total of 1,260,069 protein sequences and 1,164,479 nucleotide sequences, 56 times more sequences than ARDB, from 448 types of ARGs (enabling resistance to 18 categories of antibiotics) were collected and integrated with different hierarchical credibility and full-scale taxonomic information. Based on this comprehensive sequence database, an online pipeline - ARG analyzer (ARGA, http://mem.rcees.ac.cn:8083/) was developed to assess current ARGs primers, as well as annotate ARGs from environmental metagenomes. Thereafter, a list of 658 published primer pairs, targeting 173 ARGs, was evaluated using ARGA and integrated in ARGA as ARGs primer database. The results showed that 65.05% primers are of high specificity (≥90%), while only 29.79% primers cover >50% of targeted sequences, indicating a divergence in the quality of current ARG primers. Hence, primer assessment or redesign is highly recommended to improve the accuracy of ARGs studies. ARGs primer database was attached in ARGA to provide researchers alternatives to better survey ARGs in the environment.",
            "authors": [
                "Wei Z.",
                "Wu Y.",
                "Feng K.",
                "Yang M.",
                "Zhang Y.",
                "Tu Q.",
                "Wang J.",
                "Deng Y."
            ],
            "cit_count": 0,
            "doi": "10.1016/J.ENVINT.2019.04.030",
            "journal": "Environment International",
            "pmid": "31054477",
            "title": "ARGA, a pipeline for primer evaluation on antibiotic resistance genes",
            "type": "Primary",
            "year": "2019-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:ARGA",
        "biotoolsID": "ARGA",
        "description": "Antibiotic Resistance Gene Analyzer.",
        "homepage": "http://mem.rcees.ac.cn:8083/",
        "name": "ARGA"
    }
}