{
    "additionDate": "2021-01-18T10:49:16Z",
    "biotoolsCURIE": "biotools:viadbg",
    "biotoolsID": "viadbg",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jose.parama@udc.es",
            "name": "Jose R Paramá",
            "typeEntity": "Person"
        }
    ],
    "description": "Inference of viral quasispecies with a paired de Bruijn graph.\nRNA viruses exhibit a high mutation rate and thus they exist in infected cells as a population of closely related strains called viral quasispecies. The viral quasispecies assembly problem asks to characterise the quasispecies present in a sample from high-throughput sequencing data. We study the de novo version of the problem, where reference sequences of the quasispecies are not available. Current methods for assembling viral quasispecies are either based on overlap graphs or on de Bruijn graphs. Overlap graph based methods tend to be accurate but slow, whereas de Bruijn graph based methods are fast but less accurate.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "de Novo sequencing",
                    "uri": "http://edamontology.org/operation_3644"
                }
            ]
        }
    ],
    "homepage": "https://bitbucket.org/bfreirec1/viadbg",
    "language": [
        "C++"
    ],
    "lastUpdate": "2021-03-12T16:36:30Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://bitbucket.org/bfreirec1/data-viadbg/"
        }
    ],
    "name": "viaDBG",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA782",
            "metadata": {
                "abstract": "© 2021 Oxford University Press. All rights reserved.Motivation: RNA viruses exhibit a high mutation rate and thus they exist in infected cells as a population of closely related strains called viral quasispecies. The viral quasispecies assembly problem asks to characterize the quasispecies present in a sample from high-throughput sequencing data. We study the de novo version of the problem, where reference sequences of the quasispecies are not available. Current methods for assembling viral quasispecies are either based on overlap graphs or on de Bruijn graphs. Overlap graph-based methods tend to be accurate but slow, whereas de Bruijn graph-based methods are fast but less accurate. Results: We present viaDBG, which is a fast and accurate de Bruijn graph-based tool for de novo assembly of viral quasispecies. We first iteratively correct sequencing errors in the reads, which allows us to use large k-mers in the de Bruijn graph. To incorporate the paired-end information in the graph, we also adapt the paired de Bruijn graph for viral quasispecies assembly. These features enable the use of long-range information in contig construction without compromising the speed of de Bruijn graph-based approaches. Our experimental results show that viaDBG is both accurate and fast, whereas previous methods are either fast or accurate but not both. In particular, viaDBG has comparable or better accuracy than SAVAGE, while being at least nine times faster. Furthermore, the speed of viaDBG is comparable to PEHaplo but viaDBG is able to retrieve also low abundance quasispecies, which are often missed by PEHaplo.",
                "authors": [
                    {
                        "name": "Freire B."
                    },
                    {
                        "name": "Ladra S."
                    },
                    {
                        "name": "Parama J.R."
                    },
                    {
                        "name": "Salmela L."
                    }
                ],
                "date": "2021-02-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Inference of viral quasispecies with a paired de bruijn graph"
            },
            "pmid": "32926162"
        }
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
