{
    "additionDate": "2021-12-10T12:25:13.714698Z",
    "biotoolsCURIE": "biotools:acnpd",
    "biotoolsID": "acnpd",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "leilei_fu@163.com",
            "name": "Leilei Fu",
            "typeEntity": "Person"
        },
        {
            "email": "zhulingjuanadele@163.com",
            "name": "Lingjuan Zhu",
            "typeEntity": "Person"
        }
    ],
    "description": "The Database for Elucidating the Relationships Between Natural Products, Compounds, Molecular Mechanisms, and Cancer Types. \nACNPD is an online tool that provides users with a quick search of the pharmacological mechanisms of natural anti-cancer products. The database contains 10 common cancer types, XXX compounds, XXX pharmacological mechanisms, involving PI3K/Akt, PI3K/Akt/mTOR, Wnt/ β-catenin and other signaling pathways. The web interface allows users to query related queries in a variety of ways.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "homepage": "http://www.acnpd-fu.com/",
    "lastUpdate": "2021-12-10T12:25:13.717328Z",
    "name": "ACNPD",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3389/FPHAR.2021.746067",
            "metadata": {
                "abstract": "© Copyright © 2021 Tan, Fu, Yuan, Zhu and Fu.Objectives: Cancer is well-known as a collection of diseases of uncontrolled proliferation of cells caused by mutated genes which are generated by external or internal factors. As the mechanisms of cancer have been constantly revealed, including cell cycle, proliferation, apoptosis and so on, a series of new emerging anti-cancer drugs acting on each stage have also been developed. It is worth noting that natural products are one of the important sources for the development of anti-cancer drugs. To the best of our knowledge, there is not any database summarizing the relationships between natural products, compounds, molecular mechanisms, and cancer types. Materials and methods: Based upon published literatures and other sources, we have constructed an anti-cancer natural product database (ACNPD) (http://www.acnpd-fu.com/). The database currently contains 521 compounds, which specifically refer to natural compounds derived from traditional Chinese medicine plants (derivatives are not considered herein). And, it includes 1,593 molecular mechanisms/signaling pathways, covering 10 common cancer types, such as breast cancer, lung cancer and cervical cancer. Results: Integrating existing data sources, we have obtained a large amount of information on natural anti-cancer products, including herbal sources, regulatory targets and signaling pathways. ACNPD is a valuable online resource that illustrates the complex pharmacological relationship between natural products and human cancers. Conclusion: In summary, ACNPD is crucial for better understanding of the relationships between traditional Chinese medicine (TCM) and cancer, which is not only conducive to expand the influence of TCM, but help to find more new anti-cancer drugs in the future.",
                "authors": [
                    {
                        "name": "Fu J."
                    },
                    {
                        "name": "Fu L."
                    },
                    {
                        "name": "Tan X."
                    },
                    {
                        "name": "Yuan Z."
                    },
                    {
                        "name": "Zhu L."
                    }
                ],
                "date": "2021-08-23T00:00:00Z",
                "journal": "Frontiers in Pharmacology",
                "title": "ACNPD: The Database for Elucidating the Relationships Between Natural Products, Compounds, Molecular Mechanisms, and Cancer Types"
            },
            "pmcid": "PMC8419280",
            "pmid": "34497528"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ]
}
