{
    "additionDate": "2020-01-14T09:21:34Z",
    "biotoolsCURIE": "biotools:E-HIP",
    "biotoolsID": "E-HIP",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "dominik.macko@stuba.sk",
            "name": "Dominik Macko",
            "orcidid": "https://orcid.org/0000-0002-8235-2004",
            "typeEntity": "Person"
        }
    ],
    "description": "An Energy-Efficient OpenHIP-Based Security in Internet of Things Networks.\n\n4-way hand-shake protocol that provides mobility enhanced with security, in particular authentication and authorisation.\n\nhttp://homebase.htt-consult.com/ hip/.\n\nkey -- generated using the HIP_Trans and DH.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'OpenHIP', 'OpenHIP-Based', 'HIP'",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://www.avispa-project.org/library/hip.html",
    "lastUpdate": "2020-01-14T09:21:34Z",
    "name": "E-HIP",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3390/S19224921",
            "metadata": {
                "abstract": "© 2019 by the authors. Licensee MDPI, Basel, Switzerland.The rapidly growing segment of the Internet of Things (IoT) makes the security threats more prominent than ever. The research around communication security and cybersecurity in such networks is still a challenge, mainly due to the typically limited energy and computation resources of IoT devices. The strong security mechanisms require significant power and thus the energy wastage must be minimized. Optimized application-specific security protocols are commonly used to make the data transfer more efficient, while still offering a high level of security. The supported security features, such as confidentiality, integrity or authenticity, should not be affected by the optimization. Our work is focused on optimizing one of the existing security protocols for the use in the IoT area, namely the Host Identity Protocol (HIP). Based on the analysis of related works, we have identified multiple possibilities for optimization and combined some of them into the proposed E-HIP optimized protocol. For verification purpose, it has been implemented as a modification of the open-source OpenHIP library and applied on a communication between real hardware devices. The secured communication worked correctly. The resulting effect of the proposed optimization has been evaluated experimentally and it represents an increase in energy efficiency by about 20%. Compared to other HIP optimizations, the achieved results are similar; however, the proposed optimizations are unique and can be further combined with some of the existing ones to achieve even higher efficiency.",
                "authors": [
                    {
                        "name": "Kanuch P."
                    },
                    {
                        "name": "Macko D."
                    }
                ],
                "date": "2019-11-02T00:00:00Z",
                "journal": "Sensors (Switzerland)",
                "title": "E-HIP: An energy-efficient openHIP-based security in internet of things networks"
            },
            "pmcid": "PMC6891635",
            "pmid": "31726675"
        }
    ],
    "topic": [
        {
            "term": "Data security",
            "uri": "http://edamontology.org/topic_3263"
        }
    ]
}