{
    "additionDate": "2019-11-14T18:32:40Z",
    "biotoolsCURIE": "biotools:IDTxl",
    "biotoolsID": "IDTxl",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "leonardo.novelli@sydney.edu.au",
            "name": "Leonardo Novelli",
            "orcidid": "https://orcid.org/0000-0002-6081-3367",
            "typeEntity": "Person"
        }
    ],
    "description": "Large-scale directed network inference with multivariate transfer entropy and hierarchical statistical testing | The Information Dynamics Toolkit xl (IDTxl) is a comprehensive software package for efficient inference of networks and their node dynamics from multivariate time series data using information theory. IDTxl provides functionality to estimate the following measures:",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Statistical inference",
                    "uri": "http://edamontology.org/operation_3658"
                }
            ]
        }
    ],
    "homepage": "https://github.com/pwollstadt/IDTxl",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-14T08:33:16Z",
    "license": "GPL-3.0",
    "name": "IDTxl",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1162/NETN_A_00092",
            "metadata": {
                "abstract": "© 2019 Massachusetts Institute of Technology.Network inference algorithms are valuable tools for the study of large-scale neuroimaging datasets. Multivariate transfer entropy is well suited for this task, being a model-free measure that captures nonlinear and lagged dependencies between time series to infer a minimal directed network model. Greedy algorithms have been proposed to efficiently deal with high-dimensional datasets while avoiding redundant inferences and capturing synergistic effects. However, multiple statistical comparisons may inflate the false positive rate and are computationally demanding, which limited the size of previous validation studies. The algorithm we present—as implemented in the IDTxl open-source software—addresses these challenges by employing hierarchical statistical tests to control the family-wise error rate and to allow for efficient parallelization. The method was validated on synthetic datasets involving random networks of increasing size (up to 100 nodes), for both linear and nonlinear dynamics. The performance increased with the length of the time series, reaching consistently high precision, recall, and specificity (>98% on average) for 10,000 time samples. Varying the statistical significance threshold showed a more favorable precision-recall trade-off for longer time series. Both the network size and the sample size are one order of magnitude larger than previously demonstrated, showing feasibility for typical EEG and magnetoencephalography experiments.",
                "authors": [
                    {
                        "name": "Lizier J.T."
                    },
                    {
                        "name": "Mediano P."
                    },
                    {
                        "name": "Novelli L."
                    },
                    {
                        "name": "Wibral M."
                    },
                    {
                        "name": "Wollstadt P."
                    }
                ],
                "citationCount": 21,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Network Neuroscience",
                "title": "Large-scale directed network inference with multivariate transfer entropy and hierarchical statistical testing"
            },
            "pmcid": "PMC6663300",
            "pmid": "31410382"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        }
    ],
    "validated": 1
}
