{
    "additionDate": "2018-06-21T15:54:43Z",
    "biotoolsCURIE": "biotools:rnaseqeval",
    "biotoolsID": "rnaseqeval",
    "credit": [
        {
            "email": "mile.sikic@fer.hr",
            "name": "Mile Šikić",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A tool for evaluating RNA seq mapping.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/kkrizanovic/RNAseqEval"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "homepage": "https://github.com/kkrizanovic/RNAseqEval",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-25T14:43:26.439351Z",
    "name": "RNAseqEval",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btx668",
            "metadata": {
                "abstract": "Motivation High-throughput sequencing has transformed the study of gene expression levels through RNA-seq, a technique that is now routinely used by various fields, such as genetic research or diagnostics. The advent of third generation sequencing technologies providing significantly longer reads opens up new possibilities. However, the high error rates common to these technologies set new bioinformatics challenges for the gapped alignment of reads to their genomic origin. In this study, we have explored how currently available RNA-seq splice-aware alignment tools cope with increased read lengths and error rates. All tested tools were initially developed for short NGS reads, but some have claimed support for long Pacific Biosciences (PacBio) or even Oxford Nanopore Technologies (ONT) MinION reads. Results The tools were tested on synthetic and real datasets from two technologies (PacBio and ONT MinION). Alignment quality and resource usage were compared across different aligners. The effect of error correction of long reads was explored, both using self-correction and correction with an external short reads dataset. A tool was developed for evaluating RNA-seq alignment results. This tool can be used to compare the alignment of simulated reads to their genomic origin, or to compare the alignment of real reads to a set of annotated transcripts. Our tests show that while some RNA-seq aligners were unable to cope with long error-prone reads, others produced overall good results. We further show that alignment accuracy can be improved using error-corrected reads.",
                "authors": [
                    {
                        "name": "Echchiki A."
                    },
                    {
                        "name": "Krizanovic K."
                    },
                    {
                        "name": "Roux J."
                    },
                    {
                        "name": "Sikic M."
                    }
                ],
                "citationCount": 45,
                "date": "2018-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Evaluation of tools for long read RNA-seq splice-aware alignment"
            },
            "pmcid": "PMC6192213",
            "pmid": "29069314"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "RNA alignment",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
