{
    "name": "Spotlite", 
    "description": "A user-friendly web application for predicting complex co-membership from affinity purification – mass spectrometry data. This web application employs a logistic regression classifier that integrates existing, proven APMS scoring approaches (SAINT, CompPASS, and HGSCore), gene co-expression patterns, functional annotations, domain-domain binding affinity, and homologous interactions, which we have shown outperforms existing APMS scoring methods.", 
    "homepage": "http://cancer.unc.edu/majorlab/software.php", 
    "biotoolsID": "spotlite", 
    "biotoolsCURIE": "biotools:spotlite", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3214", 
                    "term": "Spectral analysis"
                }, 
                {
                    "uri": "http://edamontology.org/operation_2492", 
                    "term": "Protein interaction prediction"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0078", 
            "term": "Proteins"
        }, 
        {
            "uri": "http://edamontology.org/topic_0602", 
            "term": "Molecular interactions, pathways and networks"
        }, 
        {
            "uri": "http://edamontology.org/topic_3520", 
            "term": "Proteomics experiment"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "C++"
    ], 
    "license": null, 
    "collectionID": [
        "Proteomics"
    ], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/spotlite-predicting-co-complexed-proteins-from-affinity-purification-mass-spectrometry-data.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "https://lbgsites2.bioinf.unc.edu/spotlite/#about:", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "25300367", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Spotlite: Web application and augmented algorithms for predicting co-complexed proteins from affinity purification - Mass spectrometry data", 
                "abstract": "© 2014 American Chemical Society.Protein-protein interactions defined by affinity purification and mass spectrometry (APMS) suffer from high false discovery rates. Consequently, lists of potential interactions must be pruned of contaminants before network construction and interpretation, historically an expensive, time-intensive, and error-prone task. In recent years, numerous computational methods were developed to identify genuine interactions from the hundreds of candidates. Here, comparative analysis of three popular algorithms, HGSCore, CompPASS, and SAINT, revealed complementarity in their classification accuracies, which is supported by their divergent scoring strategies. We improved each algorithm by an average area under a receiver operating characteristics curve increase of 16% by integrating a variety of indirect data known to correlate with established protein-protein interactions, including mRNA coexpression, gene ontologies, domain-domain binding affinities, and homologous protein interactions. Each APMS scoring approach was incorporated into a separate logistic regression model along with the indirect features; the resulting three classifiers demonstrate improved performance on five diverse APMS data sets. To facilitate APMS data scoring within the scientific community, we created Spotlite, a user-friendly and fast web application. Within Spotlite, data can be scored with the augmented classifiers, annotated, and visualized (http://cancer.unc.edu/majorlab/software.php). The utility of the Spotlite platform to reveal physical, functional, and disease-relevant characteristics within APMS data is established through a focused analysis of the KEAP1 E3 ubiquitin ligase.", 
                "date": "2014-01-01T00:00:00Z", 
                "citationCount": 9, 
                "authors": [
                    {
                        "name": "Goldfarb D."
                    }, 
                    {
                        "name": "Hast B.E."
                    }, 
                    {
                        "name": "Wang W."
                    }, 
                    {
                        "name": "Major M.B."
                    }
                ], 
                "journal": "Journal of Proteome Research"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": "ben_major@med.unc.edu", 
            "url": "http://cancer.unc.edu/majorlab/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T19:02:03Z", 
    "lastUpdate": "2019-03-26T08:39:39Z", 
    "editPermission": {
        "type": "group", 
        "authors": [
            "proteomics.bio.tools"
        ]
    }, 
    "validated": 0, 
    "homepage_status": 0, 
    "elixir_badge": 0
}