{
    "additionDate": "2021-01-18T07:39:31Z",
    "biotoolsCURIE": "biotools:tasti",
    "biotoolsID": "tasti",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mdegiorg@fau.edu",
            "name": "Michael DeGiorgio",
            "typeEntity": "Person"
        }
    ],
    "description": "TASTI: Taxa with Ancestral structure Species Tree Inference.\n\nMaximum Likelihood Estimation of Species Trees from Gene Trees in the Presence of Ancestral Population Structure.\n\n\nThis R package uses maximum likelihood methods to construct species trees from gene trees, with or without ancestral population structure.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Species tree construction",
                    "uri": "http://edamontology.org/operation_0544"
                },
                {
                    "term": "Gene tree construction",
                    "uri": "http://edamontology.org/operation_0553"
                },
                {
                    "term": "Phylogenetic sub/super tree construction",
                    "uri": "http://edamontology.org/operation_0556"
                }
            ]
        }
    ],
    "homepage": "https://github.com/hillarykoch/TASTI",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-26T16:21:30Z",
    "license": "Artistic-2.0",
    "name": "TASTI",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/GBE/EVAA022",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of the Society for Molecular Biology and Evolution.Though large multilocus genomic data sets have led to overall improvements in phylogenetic inference, they have posed the new challenge of addressing conflicting signals across the genome. In particular, ancestral population structure, which has been uncovered in a number of diverse species, can skew gene tree frequencies, thereby hindering the performance of species tree estimators. Here we develop a novel maximum likelihood method, termed TASTI (Taxa with Ancestral structure Species Tree Inference), that can infer phylogenies under such scenarios, and find that it has increasing accuracy with increasing numbers of input gene trees, contrasting with the relatively poor performances of methods not tailored for ancestral structure. Moreover, we propose a supertree approach that allows TASTI to scale computationally with increasing numbers of input taxa. We use genetic simulations to assess TASTI's performance in the three- and four-taxon settings and demonstrate the application of TASTI on a six-species Afrotropical mosquito data set. Finally, we have implemented TASTI in an open-source software package for ease of use by the scientific community.",
                "authors": [
                    {
                        "name": "Koch H."
                    },
                    {
                        "name": "DeGiorgio M."
                    }
                ],
                "citationCount": 2,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Genome Biology and Evolution",
                "title": "Maximum likelihood estimation of species trees from gene trees in the presence of ancestral population structure"
            },
            "pmcid": "PMC7061232",
            "pmid": "32022857"
        }
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Paleogenomics",
            "uri": "http://edamontology.org/topic_3943"
        }
    ]
}