{
    "additionDate": "2021-01-18T11:24:38Z",
    "biotoolsCURIE": "biotools:abcmodeller",
    "biotoolsID": "abcmodeller",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "lishuyan@lzu.edu.cn",
            "name": "Honglin Zhai",
            "typeEntity": "Person"
        },
        {
            "email": "zhaihl@lzu.edu.cn",
            "name": "Shuyan Li",
            "typeEntity": "Person"
        }
    ],
    "description": "An automatic data mining tool based on a consistent voting method with a user-friendly graphical interface.\n\nIn order to extract useful information from a huge amount of biological data nowadays, simple and convenient tools are urgently needed for data analysis and modeling. In this paper, an automatic data mining tool, termed as ABCModeller (Automatic Binary Classification Modeller), with a user-friendly graphical interface was developed here, which includes automated functions as data preprocessing, significant feature extraction, classification modeling, model evaluation and prediction. In order to enhance the generalization ability of the final model, a consistent voting method was built here in this tool with the utilization of three popular machine-learning algorithms, as artificial neural network, support vector machine and random forest.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                }
            ]
        }
    ],
    "homepage": "http://lishuyan.lzu.edu.cn/ABCModeller.rar",
    "lastUpdate": "2021-01-19T12:12:08Z",
    "license": "GPL-3.0",
    "name": "ABCModeller",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAA247",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.In order to extract useful information from a huge amount of biological data nowadays, simple and convenient tools are urgently needed for data analysis and modeling. In this paper, an automatic data mining tool, termed as ABCModeller (Automatic Binary Classification Modeller), with a user-friendly graphical interface was developed here, which includes automated functions as data preprocessing, significant feature extraction, classification modeling, model evaluation and prediction. In order to enhance the generalization ability of the final model, a consistent voting method was built here in this tool with the utilization of three popular machine-learning algorithms, as artificial neural network, support vector machine and random forest. Besides, Fibonacci search and orthogonal experimental design methods were also employed here to automatically select significant features in the data space and optimal hyperparameters of the three algorithms to achieve the best model. The reliability of this tool has been verified through multiple benchmark data sets. In addition, with the advantage of a user-friendly graphical interface of this tool, users without any programming skills can easily obtain reliable models directly from original data, which can reduce the complexity of modeling and data mining, and contribute to the development of related research including but not limited to biology. The excitable file of this tool can be downloaded from http://lishuyan.lzu.edu.cn/ABCModeller.rar.",
                "authors": [
                    {
                        "name": "Li S."
                    },
                    {
                        "name": "Wu J."
                    },
                    {
                        "name": "Zhai H."
                    },
                    {
                        "name": "Zhang P."
                    }
                ],
                "date": "2021-07-20T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "ABCModeller: an automatic data mining tool based on a consistent voting method with a user-friendly graphical interface"
            },
            "pmid": "33057581"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
