{
    "additionDate": "2021-01-18T12:31:21Z",
    "biotoolsCURIE": "biotools:brat-biomarker",
    "biotoolsID": "brat-biomarker",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "marc-andre.verner.1@umontreal.ca",
            "name": "Marc-André Verner",
            "typeEntity": "Person"
        }
    ],
    "description": "The Biomarker Reliability Assessment Tool (BRAT) was developed to help researchers set targets to improve exposure assessment in studies of chemicals with a short half-life. The BRAT software uses a simple pharmacokinetic model to simulate exposure, internal levels, and resulting urinary levels in individuals from a population based on user-specified inputs (e.g., biological half-life, within- and between-person variability in exposure). Based on internal levels (a toxicologically-relevant exposure metric) and urinary levels in the simulated population, the tool evaluates – through linear regression and quantile classification – the accuracy of the estimation of internal levels depending on the number of urine samples.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Information extraction",
                    "uri": "http://edamontology.org/operation_3907"
                }
            ]
        }
    ],
    "homepage": "https://www.magnoliasci.com/brat",
    "lastUpdate": "2021-02-06T17:03:03Z",
    "name": "BRAT",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3390/IJERPH17239102",
            "metadata": {
                "abstract": "© 2020 by the authors. Licensee MDPI, Basel, Switzerland.In epidemiologic and exposure research, biomonitoring is often used as the basis for assessing human exposure to environmental chemicals. Studies frequently rely on a single urinary measurement per participant to assess exposure to non-persistent chemicals. However, there is a growing consensus that single urine samples may be insufficient for adequately estimating exposure. The question then arises: how many samples would be needed for optimal characterization of exposure? To help researchers answer this question, we developed a tool called the Biomarker Reliability Assessment Tool (BRAT). The BRAT is based on pharmacokinetic modeling simulations, is freely available, and is designed to help researchers determine the approximate number of urine samples needed to optimize exposure assessment. The BRAT performs Monte Carlo simulations of exposure to estimate internal levels and resulting urinary concentrations in individuals from a population based on user-specified inputs (e.g., biological half-life, within-and between-person variability in exposure). The BRAT evaluates—through linear regression and quantile classification—the precision/accuracy of the estimation of internal levels depending on the number of urine samples. This tool should guide researchers towards more robust biomonitoring and improved exposure classification in epidemiologic and exposure research, which should in turn improve the translation of that research into decision-making.",
                "authors": [
                    {
                        "name": "Verner M.-A."
                    },
                    {
                        "name": "Salame H."
                    },
                    {
                        "name": "Housand C."
                    },
                    {
                        "name": "Birnbaum L.S."
                    },
                    {
                        "name": "Bouchard M.F."
                    },
                    {
                        "name": "Chevrier J."
                    },
                    {
                        "name": "Aylward L.L."
                    },
                    {
                        "name": "Naiman D.Q."
                    },
                    {
                        "name": "Lakind J.S."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "International Journal of Environmental Research and Public Health",
                "title": "How many urine samples are needed to accurately assess exposure to non-persistent chemicals? The biomarker reliability assessment tool (brat) for scientists, research sponsors, and risk managers"
            },
            "pmcid": "PMC7730379",
            "pmid": "33291237"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}