{"credit":[],"function":[{"operation":[{"term":"PTM localisation","uri":"http://edamontology.org/operation_3755"},{"term":"Protein fragment weight comparison","uri":"http://edamontology.org/operation_2929"},{"term":"PTM identification","uri":"http://edamontology.org/operation_3645"},{"term":"Protein post-translation modification site prediction","uri":"http://edamontology.org/operation_0417"},{"term":"Mass spectra calibration","uri":"http://edamontology.org/operation_3627"}]}],"labels":{"collectionID":["Proteomics"],"toolType":["Web application"],"topic":[{"term":"Protein modifications","uri":"http://edamontology.org/topic_0601"},{"term":"Small molecules","uri":"http://edamontology.org/topic_0154"},{"term":"Proteomics experiment","uri":"http://edamontology.org/topic_3520"},{"term":"Proteins","uri":"http://edamontology.org/topic_0078"}]},"publication":[{"abstract":"MODi (http://modi.uos.ac.kr/modi/) is a powerful and convenient web service that facilitates the interpretation of tandem mass spectra for identifying post-translational modifications (PTMs) in a peptide. It is powerful in that it can interpret a tandem mass spectrum even when hundreds of modification types are considered and the number of potential PTMs in a peptide is large, in contrast to most of the methods currently available for spectra interpretation that limit the number of PTM sites and types being used for PTM analysis. For example, using MODi, one can consider for analysis both the entire PTM list published on the unimod webpage (http://www.unimod.org) and user-defined PTMs simultaneously, and one can also identify multiple PTM sites in a spectrum. MODi is convenient in that it can take various input file formats such as .mzXML, .dta, .pkl and .mgf files, and it is equipped with a graphical tool called MassPective developed to display MODi's output in a user-friendly manner and helps users understand MODi's output quickly. In addition, one can perform manual de novo sequencing using MassPective. © The Author 2006. Published by Oxford University Press. All rights reserved.","authors":["Kim S.","Na S.","Sim J.W.","Park H.","Jeong J.","Kim H.","Seo Y.","Seo J.","Lee K.-J.","Paek E."],"cit_count":44,"journal":"Nucleic Acids Research","pmid":"16845006","title":"MODi: A powerful and convenient web server for identifying multiple post-translational peptide modifications from tandem mass spectra","year":"2006-07-01"}],"summary":{"biotoolsCURIE":"biotools:modi","biotoolsID":"modi","description":"Tool that facilitates the interpretation of tandem mass spectra in order to identify post-translational modifications (PTMs) in a peptide.","homepage":"http://prix.uos.ac.kr/research.jsp","name":"MODi"}}