{
    "additionDate": "2023-11-17T16:46:03.755707Z",
    "biotoolsCURIE": "biotools:musera",
    "biotoolsID": "musera",
    "credit": [
        {
            "email": "marco.masseroli@polimi.it",
            "name": "Marco Masseroli",
            "orcidid": "https://orcid.org/0000-0003-2574-1174",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "ELIXIR-ITA",
            "typeEntity": "Project",
            "url": "https://elixir-italy.org/"
        },
        {
            "name": "ELIXIR-ITA-POLIMI",
            "typeEntity": "Project",
            "url": "https://www.deib.polimi.it/eng/elixir-iib"
        }
    ],
    "description": "MuSERA (Multiple Sample Enriched Region Assessment) is a broadly useful stand-alone tool for both interactive and batch analysis of combined evidence from enriched regions in multiple ChIP-seq or DNase-seq sample replicates, with a user-friendly graphical interface.",
    "download": [
        {
            "type": "Software package",
            "url": "http://www.bioinformatics.deib.polimi.it/MuSERA/"
        }
    ],
    "editPermission": {
        "type": "group"
    },
    "elixirNode": [
        "Italy"
    ],
    "elixirPlatform": [
        "Tools"
    ],
    "homepage": "http://www.bioinformatics.deib.polimi.it/MuSERA/",
    "lastUpdate": "2023-11-17T23:09:07.942698Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://www.bioinformatics.deib.polimi.it/MuSERA/"
        }
    ],
    "name": "MuSERA",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "ELIXIR-ITA-POLIMI",
    "publication": [
        {
            "doi": "10.1093/bib/bbw029",
            "metadata": {
                "abstract": "Enriched region (ER) identification is a fundamental step in several next-generation sequencing (NGS) experiment types. Yet, although NGS experimental protocols recommend producing replicate samples for each evaluated condition and their consistency is usually assessed, typically pipelines for ER identification do not consider available NGS replicates. This may alter genome-wide descriptions of ERs, hinder significance of subsequent analyses on detected ERs and eventually preclude biological discoveries that evidence in replicate could support. MuSERA is a broadly useful stand-alone tool for both interactive and batch analysis of combined evidence from ERs in multiple ChIP-seq or DNase-seq replicates. Besides rigorously combining sample replicates to increase statistical significance of detected ERs, it also provides quantitative evaluations and graphical features to assess the biological relevance of each determined ER set within its genomic context; they include genomic annotation of determined ERs, nearest ER distance distribution, global correlation assessment of ERs and an integrated genome browser.We review MuSERA rationale and implementation, and illustrate how sets of significant ERs are expanded by applying MuSERA on replicates for several types of NGS data, including ChIP-seq of transcription factors or histone marks and DNase-seq hypersensitive sites. We show that MuSERA can determine a new, enhanced set of ERs for each sample by locally combining evidence on replicates, and prove how the easy-to-use interactive graphical displays and quantitative evaluations that MuSERA provides effectively support thorough inspection of obtained results and evaluation of their biological content, facilitating their understanding and biological interpretations. MuSERA is freely available at http://www.bioinformatics.deib.polimi.it/MuSERA/.",
                "authors": [
                    {
                        "name": "Jalili V."
                    },
                    {
                        "name": "Masseroli M."
                    },
                    {
                        "name": "Matteucci M."
                    },
                    {
                        "name": "Morelli M.J."
                    }
                ],
                "citationCount": 10,
                "date": "2017-05-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "MuSERA: Multiple sample enriched region assessment"
            }
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
