{
    "additionDate": "2019-11-14T18:24:30Z",
    "biotoolsCURIE": "biotools:CircRiC",
    "biotoolsID": "CircRiC",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "leng.han@uth.tmc.edu",
            "name": "Leng Han",
            "orcidid": "https://orcid.org/0000-0002-7380-2640",
            "typeEntity": "Person"
        }
    ],
    "description": "Comprehensive characterization of circular RNAs in ~ 1000 human cancer cell lines | The CircRic refers to “circular RNA in cancers”. Circular RNAs (circRNAs) is class of non-coding RNA generated in a “back-splicing”. Recent studies have highlighted the important role of circRNAs in cancer. Here, we systematically characterize circRNAs expression profile in 935 cancer cell lines across 22 cancer lineages from Cancer Cell line Encyclopedia (CCLE), and analyzed the circRNAs biogenesis regulators, effect of circRNAs on drug response and association between circRNAs with mRNA, protein and mutation, and predicted RNA regulatory element in circRNAs",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "trans-regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0443"
                },
                {
                    "term": "cis-regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0441"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://hanlab.uth.edu/cRic",
    "lastUpdate": "2020-12-11T21:13:19Z",
    "name": "CircRiC",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S13073-019-0663-5",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Human cancer cell lines are fundamental models for cancer research and therapeutic strategy development. However, there is no characterization of circular RNAs (circRNAs) in a large number of cancer cell lines. Methods: Here, we apply four circRNA identification algorithms to heuristically characterize the expression landscape of circRNAs across ~ 1000 human cancer cell lines from CCLE polyA-enriched RNA-seq data. By using integrative analysis and experimental approaches, we explore the expression landscape, biogenesis, functional consequences, and drug response of circRNAs across different cancer lineages. Results: We revealed highly lineage-specific expression patterns of circRNAs, suggesting that circRNAs may be powerful diagnostic and/or prognostic markers in cancer treatment. We also identified key genes involved in circRNA biogenesis and confirmed that TGF-β signaling may promote biogenesis of circRNAs. Strikingly, we showed that clinically actionable genes are more likely to generate circRNAs, potentially due to the enrichment of RNA-binding protein (RBP) binding sites. Among these, circMYC can promote cell proliferation. We observed strong association between the expression of circRNAs and the response to drugs, especially those targeting chromatin histone acetylation. Finally, we developed a user-friendly data portal, CircRNAs in cancer cell lines (CircRiC, https://hanlab.uth.edu/cRic), to benefit the biomedical research community. Conclusions: Our study provides the characterization of circRNAs in cancer cell lines and explored the potential mechanism of circRNA biogenesis as well as its therapeutic implications. We also provide a data portal to facilitate the related biomedical researches.",
                "authors": [
                    {
                        "name": "Ruan H."
                    },
                    {
                        "name": "Xiang Y."
                    },
                    {
                        "name": "Ko J."
                    },
                    {
                        "name": "Li S."
                    },
                    {
                        "name": "Jing Y."
                    },
                    {
                        "name": "Zhu X."
                    },
                    {
                        "name": "Ye Y."
                    },
                    {
                        "name": "Zhang Z."
                    },
                    {
                        "name": "Mills T."
                    },
                    {
                        "name": "Feng J."
                    },
                    {
                        "name": "Liu C.-J."
                    },
                    {
                        "name": "Jing J."
                    },
                    {
                        "name": "Cao J."
                    },
                    {
                        "name": "Zhou B."
                    },
                    {
                        "name": "Wang L."
                    },
                    {
                        "name": "Zhou Y."
                    },
                    {
                        "name": "Lin C."
                    },
                    {
                        "name": "Guo A.-Y."
                    },
                    {
                        "name": "Chen X."
                    },
                    {
                        "name": "Diao L."
                    },
                    {
                        "name": "Li W."
                    },
                    {
                        "name": "Chen Z."
                    },
                    {
                        "name": "He X."
                    },
                    {
                        "name": "Mills G.B."
                    },
                    {
                        "name": "Blackburn M.R."
                    },
                    {
                        "name": "Han L."
                    }
                ],
                "citationCount": 42,
                "date": "2019-08-26T00:00:00Z",
                "journal": "Genome Medicine",
                "title": "Comprehensive characterization of circular RNAs in ~ 1000 human cancer cell lines"
            },
            "pmcid": "PMC6709551",
            "pmid": "31446897"
        }
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ],
    "validated": 1
}