
{
    "credit": [
        {
            "name": "Contact List",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://repairtoire.genesilico.pl/contact/"
        },
        {
            "email": "repairtoire@genesilico.pl",
            "name": "REPAIRtoire Support",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://repairtoire.genesilico.pl"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                },
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                },
                {
                    "term": "Protein modelling (mutation)",
                    "uri": "http://edamontology.org/operation_0331"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Genetic variation",
                "uri": "http://edamontology.org/topic_0199"
            },
            {
                "term": "Pathology",
                "uri": "http://edamontology.org/topic_0634"
            },
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            },
            {
                "term": "Model organisms",
                "uri": "http://edamontology.org/topic_0621"
            }
        ]
    },
    "publication": [
        {
            "abstract": "REPAIRtoire is the first comprehensive database resource for systems biology of DNA damage and repair. The database collects and organizes the following types of information: (i) DNA damage linked to environmental mutagenic and cytotoxic agents, (ii) pathways comprising individual processes and enzymatic reactions involved in the removal of damage, (iii) proteins participating in DNA repair and (iv) diseases correlated with mutations in genes encoding DNA repair proteins. REPAIRtoire provides also links to publications and external databases. REPAIRtoire contains information about eight main DNA damage checkpoint, repair and tolerance pathways: DNA damage signaling, direct reversal repair, base excision repair, nucleotide excision repair, mismatch repair, homologous recombination repair, nonhomologous end-joining and translesion synthesis. The pathway/protein dataset is currently limited to three model organisms: Escherichia coli, Saccharomyces cerevisiae and Homo sapiens. The DNA repair and tolerance pathways are represented as graphs and in tabular form with descriptions of each repair step and corresponding proteins, and individual entries are cross-referenced to supporting literature and primary databases. REPAIRtoire can be queried by the name of pathway, protein, enzymatic complex, damage and disease. In addition, a tool for drawing custom DNA-protein complexes is available online. REPAIRtoire is freely available and can be accessed at http://repairtoire.genesilico.pl/. © The Author(s) 2010.",
            "authors": [
                "Milanowska K.",
                "Krwawicz J.",
                "Papaj G.",
                "Kosinski J.",
                "Poleszak K.",
                "Lesiak J.",
                "Osinska E.",
                "Rother K.",
                "Bujnicki J.M."
            ],
            "cit_count": 28,
            "journal": "Nucleic Acids Research",
            "pmid": "21051355",
            "title": "REPAIRtoire-A database of DNA repair pathways",
            "year": "2011-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:repairtoire",
        "biotoolsID": "repairtoire",
        "description": "REPAIRtoire is a database resource for systems biology of DNA damage and repair. The database collects and organizes the following types of information: (i) DNA damage linked to environmental mutagenic and cytotoxic agents, (ii) pathways comprising individual processes and enzymatic reactions involved in the removal of damage, (iii) proteins participating in DNA repair and (iv) diseases correlated with mutations in genes encoding DNA repair proteins.",
        "homepage": "http://repairtoire.genesilico.pl/",
        "name": "REPAIRtoire"
    }
}