
{
    "credit": [
        {
            "email": "serafim@cs.stanford.edu",
            "name": "Serafim Batzoglou",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://ai.stanford.edu/~serafim/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://motifcut.stanford.edu/help.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence motif discovery",
                    "uri": "http://edamontology.org/operation_0238"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++"
        ],
        "maturity": "Emerging",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            },
            {
                "term": "Nucleic acid sites, features and motifs",
                "uri": "http://edamontology.org/topic_3511"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/motifcut-0-1-beta-non-parametric-graph-based-motif-finding-algorithm.html"
        }
    ],
    "publication": [
        {
            "abstract": "Motivation: DNA motif finding is one of the core problems in computational biology, for which several probabilistic and discrete approaches have been developed. Most existing methods formulate motif finding as an intractable optimization problem and rely either on expectation maximization (EM) or on local heuristic searches. Another challenge is the choice of motif model: simpler models such as the position-specific scoring matrix (PSSM) impose biologically unrealistic assumptions such as independence of the motif positions, while more involved models are harder to parametrize and learn. Results: We present MotifCut, a graph-theoretic approach to motif finding leading to a convex optimization problem with a polynomial time solution. We build a graph where the vertices represent all k-mers in the input sequences, and edges represent pairwise k-mer similarity. In this graph, we search for a motif as the maximum density subgraph, which is a set of k-mers that exhibit a large number of pairwise similarities. Our formulation does not make strong assumptions regarding the structure of the motif and in practice both motifs that fit well the PSSM model, and those that exhibit strong dependencies between position pairs are found as dense subgraphs. We benchmark MotifCut on both synthetic and real yeast motifs, and find that it compares favorably to existing popular methods. The ability of MotifCut to detect motifs appears to scale well with increasing input size. Moreover, the motifs we discover are different from those discovered by the other methods. © 2006 Oxford University Press.",
            "authors": [
                "Fratkin E.",
                "Naughton B.T.",
                "Brutlag D.L.",
                "Batzoglou S."
            ],
            "cit_count": 57,
            "journal": "Bioinformatics",
            "pmid": "16873465",
            "title": "MotifCut: Regulatory motifs finding with maximum density subgraphs",
            "year": "2006-07-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:motifcut",
        "biotoolsID": "motifcut",
        "description": "DNA motif-finding algorithm using a Maximum Density Subgraph.",
        "homepage": "http://motifcut.stanford.edu/",
        "name": "MotifCut 0.1 beta"
    }
}