{
    "additionDate": "2017-03-24T10:30:32Z",
    "biotoolsCURIE": "biotools:dianna",
    "biotoolsID": "dianna",
    "credit": [
        {
            "email": "clote@bc.edu",
            "name": "Peter Clote",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "ferref@bc.edu",
            "name": "Fabrizio Ferre",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "DiANNA (DiAminoacid Neural Network Application) a tool that predicts cysteine states of a protein. It can predict whether a particular cysteine is reduced, is forming a disulfide bond, or is bound to a metallic ligand.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bioinformatics.bc.edu/clotelab/DiANNA/DiANNA-help.html"
        },
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioinformatics.bc.edu/clotelab/DiANNA/DiANNA-instructions.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Free cysteine detection",
                    "uri": "http://edamontology.org/operation_1830"
                },
                {
                    "term": "Metal-bound cysteine detection",
                    "uri": "http://edamontology.org/operation_1831"
                },
                {
                    "term": "Protein cysteine and disulfide bond assignment",
                    "uri": "http://edamontology.org/operation_1850"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                }
            ]
        }
    ],
    "homepage": "http://bioinformatics.bc.edu/clotelab/DiANNA/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2023-01-06T15:44:11.483294Z",
    "name": "DiANNA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mm",
    "publication": [
        {
            "metadata": {
                "abstract": "Correctly predicting the disulfide bond topology in a protein is of crucial importance for the understanding of protein function and can be of great help for tertiary prediction methods. The web server http:// clavius.bc.edu/~clotelab/DiANNA/ outputs the disulfide connectivity prediction given input of a protein sequence. The following procedure is performed. First, PSIPRED is run to predict the protein's secondary structure, then PSIBLAST is run against the non-redundant SwissProt to obtain a multiple alignment of the input sequence. The predicted secondary structure and the profile arising from this alignment are used in the training phase of our neural network. Next, cysteine oxidation state is predicted, then each pair of cysteines in the protein sequence is assigned a likelihood of forming a disulfide bond - this is performed by means of a novel architecture (diresidue neural network). Finally, Rothberg's implementation of Gabow's maximum weighted matching algorithm is applied to diresidue neural network scores in order to produce the final connectivity prediction. Our novel neural network-based approach achieves results that are comparable and in some cases better than the current state-of-the-art methods. © 2005 Oxford University Press.",
                "authors": [
                    {
                        "name": "Clote P."
                    },
                    {
                        "name": "Ferre F."
                    }
                ],
                "citationCount": 234,
                "date": "2005-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "DiANNA: A web server for disulfide connectivity prediction"
            },
            "pmid": "15980459"
        },
        {
            "metadata": {
                "abstract": "DiANNA is a recent state-of-the-art artificial neural network and web server, which determines the cysteine oxidation state and disulfide connectivity of a protein, given only its amino acid sequence. Version 1.0 of DiANNA uses a feed-forward neural network to determine which cysteines are involved in a disulfide bond, and employs a novel architecture neural network to predict which half-cystines are covalently bound to which other half-cystines. In version 1.1 of DiANNA, described here, we extend functionality by applying a support vector machine with spectrum kernel for the cysteine classification problem - to determine whether a cysteine is reduced (free in sulfhydryl state), half-cystine (involved in a disulfide bond) or bound to a metallic ligand. In the latter case, DiANNApredicts the ligand among iron, zinc, cadmium and carbon. © The Author 2006. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Clote P."
                    },
                    {
                        "name": "Ferre F."
                    }
                ],
                "citationCount": 135,
                "date": "2006-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "DiANNA 1.1: An extension of the DiANNA web server for ternary cysteine classification"
            },
            "pmid": "16844987"
        },
        {
            "metadata": {
                "abstract": "Motivation: We describe a stand-alone algorithm to predict disulfide bond partners in a protein given only the amino acid sequence, using a novel neural network architecture (the diresidue neural network), and given input of symmetric flanking regions of N-terminus and C-terminus half-cystines augmented with residue secondary structure (helix, coil, sheet) as well as evolutionary information. The approach is motivated by the observation of a bias in the secondary structure preferences of free cysteines and half-cystines, and by promising preliminary results we obtained using diresidue position-specific scoring matrices. Results: As calibrated by receiver operating characteristic curves from 4-fold cross-validation, our conditioning on secondary structure allows our novel diresidue neural network to perform as well as, and in some cases better than, the current state-of-the-art method. A slight drop in performance is seen when secondary structure is predicted rather than being derived from three-dimensional protein structures. © The Author 2005. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Clote P."
                    },
                    {
                        "name": "Ferre F."
                    }
                ],
                "citationCount": 74,
                "date": "2005-05-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Disulfide connectivity prediction using secondary structure information and diresidue frequencies"
            },
            "pmid": "15741247"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Protein secondary structure",
            "uri": "http://edamontology.org/topic_3542"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}
