{
    "additionDate": "2017-12-18T00:10:01Z",
    "biotoolsCURIE": "biotools:palsse",
    "biotoolsID": "palsse",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://prodata.swmed.edu/Lab/HomeLAB.htm"
        }
    ],
    "description": "Predictive Assignment of Linear Secondary Structure Elements is a software that delineates secondary structure elements from protein Cα coordinates and specifically addresses the requirements of vector-based protein similarity searches. Our program identifies two types of secondary structures: helix and β-strand, typically those that can be well approximated by vectors.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://prodata.swmed.edu/palsse/README"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "homepage": "http://prodata.swmed.edu/palsse/palsse.php",
    "language": [
        "Python"
    ],
    "lastUpdate": "2019-03-12T15:39:09Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/palsse-20090521-predictive-assignment-linear-secondary-structure-elements.html"
        }
    ],
    "name": "PALSSE",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-6-202",
            "metadata": {
                "abstract": "Background: The majority of residues in protein structures are involved in the formation of α-helices and β-strands. These distinctive secondary structure patterns can be used to represent a protein for visual inspection and in vector-based protein structure comparison. Success of such structural comparison methods depends crucially on the accurate identification and delineation of secondary structure elements. Results: We have developed a method PALSSE (Predictive Assignment of Linear Secondary Structure Elements) that delineates secondary structure elements (SSEs) from protein Cα coordinates and specifically addresses the requirements of vector-based protein similarity searches. Our program identifies two types of secondary structures: helix and β-strand, typically those that can be well approximated by vectors. In contrast to traditional secondary structure algorithms, which identify a secondary structure state for every residue in a protein chain, our program attributes residues to linear SSEs. Consecutive elements may overlap, thus allowing residues located at the overlapping region to have more than one secondary structure type. Conclusion: PALSSE is predictive in nature and can assign about 80% of the protein chain to SSEs as compared to 53% by DSSP and 57% by P-SEA. Such a generous assignment ensures almost every residue is part of an element and is used in structural comparisons. Our results are in agreement with human judgment and DSSP. The method is robust to coordinate errors and can be used to define SSEs even in poorly refined and low-resolution structures. The program and results are available at http://prodata.swmed.edu/palsse/. © 2005 Majumdar et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Majumdar I."
                    },
                    {
                        "name": "Krishna S.S."
                    },
                    {
                        "name": "Grishin N.V."
                    }
                ],
                "citationCount": 52,
                "date": "2005-08-11T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "PALSSE: A program to delineate linear secondary structural elements from protein structures"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        }
    ],
    "validated": 1,
    "version": [
        "20090521"
    ]
}