{
    "additionDate": "2020-01-14T09:43:37Z",
    "biotoolsCURIE": "biotools:bhai",
    "biotoolsID": "bhai",
    "confidence_flag": "tool",
    "description": "A R-page for estimating the burden of healthcare-associated infections.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/package=BHAI",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-14T16:42:09Z",
    "license": "GPL-3.0",
    "name": "BHAI",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.2807/1560-7917.ES.2019.24.46.1900135",
            "metadata": {
                "abstract": "© 2019 European Centre for Disease Prevention and Control (ECDC). All rights reserved.Background: Healthcare-associated infections(HAIs) pose a major challenge to health systems. Burden of disease estimations in disability-adjusted life years(DALYs) are useful for comparing and ranking HAIs. Aim: To estimate the number of five common HAIs, their attributable number of deaths and burden for Germany. Methods: We developed a new method and R package that builds on the approach used by the Burden of Communicable Diseases in Europe(BCoDE) project to estimate the burden of HAIs for individual countries. We used data on healthcare-associatedClostridioidesdifficileinfection,healthcareassociated pneumonia, healthcare-associated primary bloodstream infection, healthcare-associated urinary tract infection and surgical-site infection, which were collected during the point prevalence survey of HAIs in European acute-care hospitals between 2011 and 2012. Results: We estimated 478,222(95%uncertainty interval(UI):421,350–537,787) cases for Germany, resulting in 16,245(95%UI:10,863–22,756) attributable deaths and 248,920(95%UI:178,693–336,239)DALYs. Despite the fact that Germany has a relatively low hospital prevalence of HAIs compared with the European Union/European Economic Area(EU/EEA) average, the burden of HAIs in Germany(308.2DALYs/100,000 population; 95%UI:221.2–416.3) was higher than the EU/EEA average(290.0DALYs/100,000 population; 95%UI:214.9–376.9). Our methodology is applicable to other countries in or outside of the EU/EEA. An R package is available from https://CRAN.R-project.org/package=BHAI. Conclusion: This is the first study to estimate the burden of HAIs in DALYs for Germany. The large number of hospital beds may be a contributing factor for a relatively high burden of HAIs in Germany. Further focus on infection prevention control, paired with reduction of avoidable hospital stays, is needed to reduce the burden of HAIs in Germany.",
                "authors": [
                    {
                        "name": "Zacher B."
                    },
                    {
                        "name": "Haller S."
                    },
                    {
                        "name": "Willrich N."
                    },
                    {
                        "name": "Walter J."
                    },
                    {
                        "name": "Sin M.A."
                    },
                    {
                        "name": "Cassini A."
                    },
                    {
                        "name": "Plachouras D."
                    },
                    {
                        "name": "Suetens C."
                    },
                    {
                        "name": "Behnke M."
                    },
                    {
                        "name": "Gastmeier P."
                    },
                    {
                        "name": "Wieler L.H."
                    },
                    {
                        "name": "Eckmanns T."
                    }
                ],
                "citationCount": 3,
                "date": "2019-11-14T00:00:00Z",
                "journal": "Eurosurveillance",
                "title": "Application of a new methodology and R package reveals a high burden of healthcare-associated infections (HAI) in Germany compared to the average in the European Union/European Economic Area, 2011 to 2012"
            },
            "pmcid": "PMC6864977",
            "pmid": "31771703"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}