{
    "additionDate": "2024-06-18T13:55:08.494894Z",
    "biotoolsCURIE": "biotools:massef",
    "biotoolsID": "massef",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "dczielin@ucsd.edu",
            "name": "Bernhard O. Palsson",
            "typeEntity": "Person"
        }
    ],
    "description": "Bottom-up parameterization of enzyme rate constants.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enzyme kinetics calculation",
                    "uri": "http://edamontology.org/operation_0334"
                },
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/opencobra/MASSef",
    "language": [
        "Mathematica"
    ],
    "lastUpdate": "2024-11-24T13:54:11.073882Z",
    "name": "MASSef",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/j.mec.2024.e00234",
            "metadata": {
                "abstract": "Kinetic models of metabolism are promising platforms for studying complex metabolic systems and designing production strains. Given the availability of enzyme kinetic data from historical experiments and machine learning estimation tools, a straightforward modeling approach is to assemble kinetic data enzyme by enzyme until a desired scale is reached. However, this type of ‘bottom up’ parameterization of kinetic models has been difficult due to a number of issues including gaps in kinetic parameters, the complexity of enzyme mechanisms, inconsistencies between parameters obtained from different sources, and in vitro-in vivo differences. Here, we present a computational workflow for the robust estimation of kinetic parameters for detailed mass action enzyme models while taking into account parameter uncertainty. The resulting software package, termed MASSef (the Mass Action Stoichiometry Simulation Enzyme Fitting package), can handle standard ‘macroscopic’ kinetic parameters, including Km, kcat, Ki, Keq, and nh, as well as diverse reaction mechanisms defined in terms of mass action reactions and ‘microscopic’ rate constants. We provide three enzyme case studies demonstrating that this approach can identify and reconcile inconsistent data either within in vitro experiments or between in vitro and in vivo enzyme function. We further demonstrate how parameterized enzyme modules can be used to assemble pathway-scale kinetic models consistent with in vivo behavior. This work builds on the legacy of knowledge on kinetic behavior of enzymes by enabling robust parameterization of enzyme kinetic models at scale utilizing the abundance of historical literature data and machine learning parameter estimates.",
                "authors": [
                    {
                        "name": "Glass K."
                    },
                    {
                        "name": "Matos M.R.A."
                    },
                    {
                        "name": "Palsson B.O."
                    },
                    {
                        "name": "Sonnenschein N."
                    },
                    {
                        "name": "Zielinski D.C."
                    },
                    {
                        "name": "de Bree J.E."
                    }
                ],
                "date": "2024-06-01T00:00:00Z",
                "journal": "Metabolic Engineering Communications",
                "title": "Bottom-up parameterization of enzyme rate constants: Reconciling inconsistent data"
            },
            "pmcid": "PMC11070925",
            "pmid": "38711578"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
