{
    "additionDate": "2017-08-03T18:44:17Z",
    "biotoolsCURIE": "biotools:ggea",
    "biotoolsID": "ggea",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://drupal.bio.ifi.lmu.de/mitarbeiter/geistlinger/index.html"
        }
    ],
    "description": "Intuitive method to detect consistently and coherently enriched gene sets, based on prior knowledge derived from directed gene regulatory networks.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.bioconductor.org/packages/release/bioc/manuals/EnrichmentBrowser/man/EnrichmentBrowser.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                }
            ]
        }
    ],
    "homepage": "https://drupal.bio.ifi.lmu.de/en/GGEA/index.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/ggea-enrichmentbrowser-1-5-gene-graph-enrichment-analysis.html"
        }
    ],
    "name": "GGEA",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: Current gene set enrichment approaches do not take interactions and associations between set members into account. Mutual activation and inhibition causing positive and negative correlation among set members are thus neglected. As a consequence, inconsistent regulations and contextless expression changes are reported and, thus, the biological interpretation of the result is impeded. Results: We analyzed established gene set enrichment methods and their result sets in a large-scale investigation of 1000 expression datasets. The reported statistically significant gene sets exhibit only average consistency between the observed patterns of differential expression and known regulatory interactions. We present Gene Graph Enrichment Analysis (GGEA) to detect consistently and coherently enriched gene sets, based on prior knowledge derived from directed gene regulatory networks. Firstly, GGEA improves the concordance of pairwise regulation with individual expression changes in respective pairs of regulating and regulated genes, compared with set enrichment methods. Secondly, GGEA yields result sets where a large fraction of relevant expression changes can be explained by nearby regulators, such as transcription factors, again improving on set-based methods. Thirdly, we demonstrate in additional case studies that GGEA can be applied to human regulatory pathways, where it sensitively detects very specific regulation processes, which are altered in tumors of the central nervous system. GGEA significantly increases the detection of gene sets where measured positively or negatively correlated expression patterns coincide with directed inducing or repressing relationships, thus facilitating further interpretation of gene expression data. © The Author(s) 2011. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Geistlinger L."
                    },
                    {
                        "name": "Csaba G."
                    },
                    {
                        "name": "Kuffner R."
                    },
                    {
                        "name": "Mulder N."
                    },
                    {
                        "name": "Zimmer R."
                    }
                ],
                "citationCount": 51,
                "date": "2011-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "From sets to graphs: Towards a realistic enrichment analysis of transcriptomic systems"
            },
            "pmid": "21685094"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}