{
    "additionDate": "2021-01-18T10:56:17Z",
    "biotoolsCURIE": "biotools:ashic",
    "biotoolsID": "ashic",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "wenxiu.ma@ucr.edu",
            "name": "Wenxiu Ma",
            "typeEntity": "Person"
        }
    ],
    "description": "A method for allele-specific modeling of diploid Hi-C data (chromatin contacts and structures) using hierarchical Bayesian modeling.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/wmalab/ASHIC",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T20:46:48.410873Z",
    "name": "ASHIC",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/nar/gkaa872",
            "metadata": {
                "abstract": "The recently developed Hi-C technique has been widely applied to map genome-wide chromatin interactions. However, current methods for analyzing diploid Hi-C data cannot fully distinguish between homologous chromosomes. Consequently, the existing diploid Hi-C analyses are based on sparse and inaccurate allele-specific contact matrices, which might lead to incorrect modeling of diploid genome architecture. Here we present ASHIC, a hierarchical Bayesian framework to model allele-specific chromatin organizations in diploid genomes. We developed two models under the Bayesian framework: the Poisson-multinomial (ASHIC-PM) model and the zero-inflated Poisson-multinomial (ASHIC-ZIPM) model. The proposed ASHIC methods impute allele-specific contact maps from diploid Hi-C data and simultaneously infer allelic 3D structures. Through simulation studies, we demonstrated that ASHIC methods outperformed existing approaches, especially under low coverage and low SNP density conditions. Additionally, in the analyses of diploid Hi-C datasets in mouse and human, our ASHIC-ZIPM method produced fine-resolution diploid chromatin maps and 3D structures and provided insights into the allelic chromatin organizations and functions. To summarize, our work provides a statistically rigorous framework for investigating fine-scale allele-specific chromatin conformations. The ASHIC software is publicly available at https://github.com/wmalab/ASHIC.",
                "authors": [
                    {
                        "name": "Ma W."
                    },
                    {
                        "name": "Ye T."
                    }
                ],
                "citationCount": 5,
                "date": "2020-12-02T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "ASHIC: Hierarchical Bayesian modeling of diploid chromatin contacts and structures"
            },
            "pmcid": "PMC7708071",
            "pmid": "33074315",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1101/2020.08.29.273722",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Chromosome conformation capture",
            "uri": "http://edamontology.org/topic_3940"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ]
}
