{"credit":[{"name":"BioCatalogue","typeEntity":"Project","typeRoles":["Documentor"],"url":"https://www.biocatalogue.org"},{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://mafft.cbrc.jp/alignment/software/mailform.html"}],"documentation":[{"type":"GENERAL","url":"http://mafft.cbrc.jp/alignment/software/"}],"function":[{"input":[{"data":{"term":"Sequence alignment","uri":"http://edamontology.org/data_0863"},"format":[{"term":"FASTA","uri":"http://edamontology.org/format_1929"}]}],"operation":[{"term":"Multiple sequence alignment","uri":"http://edamontology.org/operation_0492"}],"output":[{"data":{"term":"Sequence alignment","uri":"http://edamontology.org/data_0863"},"format":[{"term":"FASTA","uri":"http://edamontology.org/format_1929"}]}]}],"labels":{"collectionID":["MAFFT","Proteomics"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"},{"term":"Proteomics","uri":"http://edamontology.org/topic_0121"},{"term":"Genomics","uri":"http://edamontology.org/topic_0622"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"https://www.biocatalogue.org/services/2039"},{"type":"MIRROR","url":"https://mafft.cbrc.jp/alignment/software/"}],"publication":[{"abstract":"© The Author 2016. Published by Oxford University Press. All rights reserved.Motivation: Large multiple sequence alignments (MSAs), consisting of thousands of sequences, are becoming more and more common, due to advances in sequencing technologies. The MAFFT MSA program has several options for building large MSAs, but their performances have not been sufficiently assessed yet, because realistic benchmarking of large MSAs has been difficult. Recently, such assessments have been made possible through the HomFam and ContTest benchmark protein datasets. Along with the development of these datasets, an interesting theory was proposed: chained guide trees increase the accuracy of MSAs of structurally conserved regions. This theory challenges the basis of progressive alignment methods and needs to be examined by being compared with other known methods including computationally intensive ones. Results: We used HomFam, ContTest and OXFam (an extended version of OXBench) to evaluate several methods enabled in MAFFT: (1) a progressive method with approximate guide trees, (2) a progressive method with chained guide trees, (3) a combination of an iterative refinement method and a progressive method and (4) a less approximate progressive method that uses a rigorous guide tree and consistency score. Other programs, Clustal Omega and UPP, available for large MSAs, were also included into the comparison. The effect of method 2 (chained guide trees) was positive in ContTest but negative in HomFam and OXFam. Methods 3 and 4 increased the benchmark scores more consistently than method 2 for the three datasets, suggesting that they are safer to use.","authors":["Yamada K.D.","Tomii K.","Katoh K."],"cit_count":59,"doi":"10.1093/bioinformatics/btw412","journal":"Bioinformatics","title":"Application of the MAFFT sequence alignment program to large data - Reexamination of the usefulness of chained guide trees","type":"Primary","year":"2016-11-01"}],"summary":{"biotoolsCURIE":"biotools:mafft_ebi","biotoolsID":"mafft_ebi","description":"A high-speed multiple sequence alignment program.","homepage":"https://www.ebi.ac.uk/Tools/msa/mafft/","name":"MAFFT (EBI)","version":["1"]}}