{
    "additionDate": "2021-03-19T09:16:29Z",
    "biotoolsCURIE": "biotools:retro-cues",
    "biotoolsID": "retro-cues",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "p.zerr@uu.nl",
            "name": "Paul Zerr",
            "orcidid": "https://orcid.org/0000-0003-0841-1907",
            "typeEntity": "Person"
        }
    ],
    "description": "Implications for capacity estimation and attentional states in visual working memory.\n\nAccessing the contents of visual short-term memory (VSTM) is compromised by information bottlenecks and visual interference between memorization and recall. Retro-cues, displayed after the offset of a memory stimulus and prior to the onset of a probe stimulus, indicate the test item and improve performance in VSTM tasks. It has been proposed that retro-cues aid recall by transferring information from a high-capacity memory store into visual working memory (multiple-store hypothesis). Alternatively, retro-cues could aid recall by redistributing memory resources within the same (low-capacity) working memory store (single-store hypothesis). If retro-cues provide access to a memory store with a capacity exceeding the set size, then, given sufficient training in the use of the retro-cue, near-ceiling performance should be observed",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "http://github.com/paulzerr/retrocues",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-04-02T10:30:47Z",
    "license": "GPL-3.0",
    "name": "retro-cues",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3758/S13421-021-01138-5",
            "metadata": {
                "abstract": "© 2021, The Author(s).Accessing the contents of visual short-term memory (VSTM) is compromised by information bottlenecks and visual interference between memorization and recall. Retro-cues, displayed after the offset of a memory stimulus and prior to the onset of a probe stimulus, indicate the test item and improve performance in VSTM tasks. It has been proposed that retro-cues aid recall by transferring information from a high-capacity memory store into visual working memory (multiple-store hypothesis). Alternatively, retro-cues could aid recall by redistributing memory resources within the same (low-capacity) working memory store (single-store hypothesis). If retro-cues provide access to a memory store with a capacity exceeding the set size, then, given sufficient training in the use of the retro-cue, near-ceiling performance should be observed. To test this prediction, 10 observers each performed 12 hours across 8 sessions in a retro-cue change-detection task (40,000+ trials total). The results provided clear support for the single-store hypothesis: retro-cue benefits (difference between a condition with and without retro-cues) emerged after a few hundred trials and then remained constant throughout the testing sessions, consistently improving performance by two items, rather than reaching ceiling performance. Surprisingly, we also observed a general increase in performance throughout the experiment in conditions with and without retro-cues, calling into question the generalizability of change-detection tasks in assessing working memory capacity as a stable trait of an observer (data and materials are available at osf.io/9xr82 and github.com/paulzerr/retrocues). In summary, the present findings suggest that retro-cues increase capacity estimates by redistributing memory resources across memoranda within a low-capacity working memory store.",
                "authors": [
                    {
                        "name": "Zerr P."
                    },
                    {
                        "name": "Gayet S."
                    },
                    {
                        "name": "van den Esschert F."
                    },
                    {
                        "name": "Kappen M."
                    },
                    {
                        "name": "Olah Z."
                    },
                    {
                        "name": "Van der Stigchel S."
                    }
                ],
                "date": "2021-07-01T00:00:00Z",
                "journal": "Memory and Cognition",
                "title": "The development of retro-cue benefits with extensive practice: Implications for capacity estimation and attentional states in visual working memory"
            },
            "pmcid": "PMC7899059",
            "pmid": "33616865"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        }
    ]
}