{"credit":[{"email":"r.s.savage@warwick.ac.uk","name":"Rich Savage","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"url":"http://bioconductor.org/packages/release/bioc/html/BHC.html"}],"download":[{"type":"Source code","url":"http://bioconductor/packages/release/bioc/src/contrib/BHC_1.26.0.tar.gz"}],"function":[{"operation":[{"term":"Clustering","uri":"http://edamontology.org/operation_3432"}]}],"labels":{"collectionID":["BioConductor"],"language":["R"],"license":"GPL-3.0","operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool","Library"],"topic":[{"term":"Statistics and probability","uri":"http://edamontology.org/topic_2269"}]},"publication":[{"abstract":"Background: Although the use of clustering methods has rapidly become one of the standard computational approaches in the literature of microarray gene expression data analysis, little attention has been paid to uncertainty in the results obtained. Results: We present an R/Bioconductor port of a fast novel algorithm for Bayesian agglomerative hierarchical clustering and demonstrate its use in clustering gene expression microarray data. The method performs bottom-up hierarchical clustering, using a Dirichlet Process (infinite mixture) to model uncertainty in the data and Bayesian model selection to decide at each step which clusters to merge. Conclusion: Biologically plausible results are presented from a well studied data set: expression profiles of A. thaliana subjected to a variety of biotic and abiotic stresses. Our method avoids several limitations of traditional methods, for example how many clusters there should be and how to choose a principled distance metric. © 2009 Savage et al; licensee BioMed Central Ltd.","authors":["Savage R.S.","Heller K.","Xu Y.","Ghahramani Z.","Truman W.M.","Grant M.","Denby K.J.","Wild D.L."],"cit_count":29,"doi":"10.1186/1471-2105-10-242","journal":"BMC Bioinformatics","title":"R/BHC: Fast Bayesian hierarchical clustering for microarray data","type":"Primary","year":"2009-08-06"}],"summary":{"biotoolsCURIE":"biotools:bhc","biotoolsID":"bhc","description":"This method performs bottom-up hierarchical clustering using a Dirichlet Process to model uncertainty in the data and a Bayesian model selection to decide at each step which clusters to merge. This avoids several limitations of traditional methods, for example how many clusters there should be and how to choose a principled distance metric. This implementation accepts multinomial (i.e. discrete, with 2+ categories) or time-series data.","homepage":"http://bioconductor.org/packages/release/bioc/html/BHC.html","name":"BHC","version":["1.26.0"]}}