{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2022-08-30T08:04:38.115656Z",
    "biotoolsCURIE": "biotools:s2d",
    "biotoolsID": "s2d",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "mv245@cam.ac.uk",
            "name": "Michele Vendruscolo"
        },
        {
            "email": "ps589@cam.ac.uk",
            "name": "Pietro Sarmani"
        }
    ],
    "description": "s2D is a computational method to predict secondary-structure populations from amino acid sequences, which simultaneously characterizes structure and disorder in a unified statistical mechanics framework.",
    "download": [
        {
            "type": "Downloads page",
            "url": "https://www-cohsoftware.ch.cam.ac.uk/"
        }
    ],
    "editPermission": {
        "authors": [
            "damiano.piovesan",
            "tlazar"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                },
                {
                    "term": "Structure analysis",
                    "uri": "http://edamontology.org/operation_2480"
                }
            ]
        }
    ],
    "homepage": "http://www-mvsoftware.ch.cam.ac.uk/index.php/s2D",
    "lastUpdate": "2023-01-13T01:59:03.396548Z",
    "license": "GPL-3.0",
    "name": "s2D",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "daniela.mereuta",
    "publication": [
        {
            "doi": "10.1016/j.jmb.2014.12.007",
            "metadata": {
                "abstract": "© 2014 Elsevier Ltd. All rights reserved.Extensive amounts of information about protein sequences are becoming available, as demonstrated by the over 79 million entries in the UniProt database. Yet, it is still challenging to obtain proteome-wide experimental information on the structural properties associated with these sequences. Fast computational predictors of secondary structure and of intrinsic disorder of proteins have been developed in order to bridge this gap. These two types of predictions, however, have remained largely separated, often preventing a clear characterization of the structure and dynamics of proteins. Here, we introduce a computational method to predict secondary-structure populations from amino acid sequences, which simultaneously characterizes structure and disorder in a unified statistical mechanics framework. To develop this method, called s2D, we exploited recent advances made in the analysis of NMR chemical shifts that provide quantitative information about the probability distributions of secondary-structure elements in disordered states. The results that we discuss show that the s2D method predicts secondary-structure populations with an average error of about 14%. A validation on three datasets of mostly disordered, mostly structured and partly structured proteins, respectively, shows that its performance is comparable to or better than that of existing predictors of intrinsic disorder and of secondary structure. These results indicate that it is possible to perform rapid and quantitative sequence-based characterizations of the structure and dynamics of proteins through the predictions of the statistical distributions of their ordered and disordered regions.",
                "authors": [
                    {
                        "name": "Camilloni C."
                    },
                    {
                        "name": "Fariselli P."
                    },
                    {
                        "name": "Sormanni P."
                    },
                    {
                        "name": "Vendruscolo M."
                    }
                ],
                "citationCount": 60,
                "date": "2015-02-27T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "The s2D method: Simultaneous sequence-based prediction of the statistical populations of ordered and disordered regions in proteins"
            },
            "pmid": "25534081",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "version": [
        "v1.1"
    ]
}
