{
    "accessibility": "Open access",
    "additionDate": "2017-03-24T09:34:05Z",
    "biotoolsCURIE": "biotools:vista",
    "biotoolsID": "vista",
    "collectionID": [
        "Rare Disease"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "email": "Vista@lbl.gov",
            "name": "Vista Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Comprehensive suite of programs and databases for comparative analysis of genomic sequences. There are two ways of using VISTA - you can submit your own sequences and alignments for analysis (VISTA servers) or examine pre-computed whole-genome alignments of different species.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://genome.lbl.gov/vista/help.shtml"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pairwise sequence alignment",
                    "uri": "http://edamontology.org/operation_0491"
                },
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                },
                {
                    "term": "Local alignment",
                    "uri": "http://edamontology.org/operation_0495"
                },
                {
                    "term": "Global alignment",
                    "uri": "http://edamontology.org/operation_0496"
                }
            ]
        }
    ],
    "homepage": "http://genome.lbl.gov/vista/index.shtml",
    "language": [
        "Java"
    ],
    "lastUpdate": "2020-06-16T10:55:22Z",
    "maturity": "Mature",
    "name": "VISTA",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btg459",
            "metadata": {
                "abstract": "Motivation: The power of multi-sequence comparison for biological discovery is well established. The need for new capabilities to visualize and compare cross-species alignment data is intensified by the growing number of genomic sequence datasets being generated for an ever-increasing number of organisms. To be efficient these visualization algorithms must support the ability to accommodate consistently a wide range of evolutionary distances in a comparison framework based upon phylogenetic relationships. Results: We have developed Phylo-VISTA, an interactive tool for analyzing multiple alignments by visualizing a similarity measure for multiple DNA sequences. The complexity of visual presentation is effectively organized using a framework based upon interspecies phylogenetic relationships. The phylogenetic organization supports rapid, user-guided interspecies comparison. To aid in navigation through large sequence datasets, Phylo-VISTA leverages concepts from VISTA that provide a user with the ability to select and view data at varying resolutions. The combination of multiresolution data visualization and analysis, combined with the phylogenetic framework for interspecies comparison, produces a highly flexible and powerful tool for visual data analysis of multiple sequence alignments. © Oxford University Press 2004; all rights reserved.",
                "authors": [
                    {
                        "name": "Shah N."
                    },
                    {
                        "name": "Couronne O."
                    },
                    {
                        "name": "Pennacchio L.A."
                    },
                    {
                        "name": "Brudno M."
                    },
                    {
                        "name": "Batzoglou S."
                    },
                    {
                        "name": "Bethel E.W."
                    },
                    {
                        "name": "Rubin E.M."
                    },
                    {
                        "name": "Hamann B."
                    },
                    {
                        "name": "Dubchak I."
                    }
                ],
                "citationCount": 33,
                "date": "2004-03-22T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Phylo-VISTA: Interactive visualization of multiple DNA sequence alignments"
            },
            "pmid": "15033870"
        },
        {
            "doi": "10.1093/nar/gkm279",
            "metadata": {
                "abstract": "The VISTA portal for comparative genomics is designed to give biomedical scientists a unified set of tools to lead them from the raw DNA sequences through the alignment and annotation to the visualization of the results. The VISTA portal also hosts the alignments of a number of genomes computed by our group, allowing users to study the regions of their interest without having to manually download the individual sequences. Here we describe various algorithmic and functional improvements implemented in the VISTA portal over the last 2 years. The VISTA Portal is accessible at http://genome.lbl.gov/vista. © 2007 The Author(s).",
                "authors": [
                    {
                        "name": "Brudno M."
                    },
                    {
                        "name": "Poliakov A."
                    },
                    {
                        "name": "Minovitsky S."
                    },
                    {
                        "name": "Ratnere I."
                    },
                    {
                        "name": "Dubchak I."
                    }
                ],
                "citationCount": 23,
                "date": "2007-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Multiple whole genome alignments and novel biomedical applications at the VISTA portal"
            },
            "pmcid": "PMC1933192",
            "pmid": "17488840"
        },
        {
            "doi": "10.1093/bioinformatics/btg1005",
            "metadata": {
                "abstract": "Motivation: To compare entire genomes from different species, biologists increasingly need alignment methods that are efficient enough to handle long sequences, and accurate enough to correctly align the conserved biological features between distant species. The two main classes of pain/vise alignments are global alignment, where one string is transformed into the other, and local alignment, where all locations of similarity between the two strings are returned. Global alignments are less prone to demonstrating false homology as each letter of one sequence is constrained to being aligned to only one letter of the other. Local alignments, on the other hand, can cope with rearrangements between non-syntenic, orthologous sequences by identifying similar regions in sequences; this, however, comes at the expense of a higher false positive rate due to the inability of local aligners to take into account overall conservation maps. Results: In this paper we introduce the notion of glocal alignment, a combination of global and local methods, where one creates a map that transforms one sequence into the other while allowing for rearrangement events. We present Shuffle-LAGAN, a glocal alignment algorithm that is based on the CHAOS local alignment algorithm and the LAGAN global aligner, and is able to align long genomic sequences. To test Shuffle-LAGAN we split the mouse genome into BAC-sized pieces, and aligned these pieces to the human genome. We demonstrate that Shuffle-LAGAN compares favorably in terms of sensitivity and specificity with standard local and global aligners. From the alignments we conclude that about 9% of human/mouse homology may be attributed to small rearrangements, 63% of which are duplications. Availability: Our systems, supplemental information, and the alignment of the human and mouse genomes using Shuffle-LAGAN are available at http://lagan.stanford.edu/glocal. © Oxford University Press 2003; all rights reserved.",
                "authors": [
                    {
                        "name": "Brudno M."
                    },
                    {
                        "name": "Malde S."
                    },
                    {
                        "name": "Poliakov A."
                    },
                    {
                        "name": "Do C.B."
                    },
                    {
                        "name": "Couronne O."
                    },
                    {
                        "name": "Dubchak I."
                    },
                    {
                        "name": "Batzoglou S."
                    }
                ],
                "citationCount": 194,
                "date": "2003-12-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Glocal alignment: Finding rearrangements during alignment"
            },
            "pmid": "12855437"
        },
        {
            "doi": "10.1093/bioinformatics/16.11.1046",
            "metadata": {
                "abstract": "VISTA is a program for visualizing global DNA sequence alignments of arbitrary length. It has a clean output, allowing for easy identification of similarity, and is easily configurable, enabling the visualization of alignments of various lengths at different levels of resolution. It is currently available on the web, thus allowing for easy access by all researchers.",
                "authors": [
                    {
                        "name": "Mayor C."
                    },
                    {
                        "name": "Brudno M."
                    },
                    {
                        "name": "Schwartz J.R."
                    },
                    {
                        "name": "Poliakov A."
                    },
                    {
                        "name": "Rubin E.M."
                    },
                    {
                        "name": "Frazer K.A."
                    },
                    {
                        "name": "Pachter L.S."
                    },
                    {
                        "name": "Dubchak I."
                    }
                ],
                "citationCount": 647,
                "date": "2000-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Vista: Visualizing global DNA sequence alignments of arbitrary length"
            },
            "pmid": "11159318"
        },
        {
            "doi": "10.1101/gr.789803",
            "metadata": {
                "abstract": "In this paper we describe a new global alignment method called AVID. The method is designed to be fast, memory efficient, and practical for sequence alignments of large genomic regions up to megabases long. We present numerous applications of the method, ranging from the comparison of assemblies to alignment of large syntenic genomic regions and whole genome human/mouse alignments. We have also performed a quantitative comparison of AVID with other popular alignment tools. To this end, we have established a format for the representation of alignments and methods for their comparison. These formats and methods should be useful for future studies. The tools we have developed for the alignment comparisons, as well as the AVID program, are publicly available. See Web Site References section for AVID Web address and Web addresses for other programs discussed in this paper.",
                "authors": [
                    {
                        "name": "Bray N."
                    },
                    {
                        "name": "Dubchak I."
                    },
                    {
                        "name": "Pachter L."
                    }
                ],
                "citationCount": 342,
                "date": "2003-01-01T00:00:00Z",
                "journal": "Genome research",
                "title": "AVID: A global alignment program."
            },
            "pmcid": "PMC430967",
            "pmid": "12529311"
        },
        {
            "doi": "10.1101/gr.926603",
            "metadata": {
                "abstract": "To compare entire genomes from different species, biologists increasingly need alignment methods that are efficient enough to handle long sequences, and accurate enough to correctly align the conserved biological features between distant species. We present LAGAN, a system for rapid global alignment of two homologous genomic sequences, and Multi-LAGAN, a system for multiple global alignment of genomic sequences. We tested our systems on a data set consisting of greater than 12 Mb of high-quality sequence from 12 vertebrate species. All the sequence was derived from the genomic region orthologous to an ∼1.5-Mb region on human chromosome 7q31.3. We found that both LAGAN and Multi-LAGAN compare favorably with other leading alignment methods in correctly aligning protein-coding exons, especially between distant homologs such as human and chicken, or human and fugu. Multi-LAGAN produced the most accurate alignments, while requiring just 75 minutes on a personal computer to obtain the multiple alignment of all 12 sequences. Multi-LAGAN is a practical method for generating multiple alignments of long genomic sequences at any evolutionary distance. Our systems are publicly available at http://lagan.stanford.edu.",
                "authors": [
                    {
                        "name": "Brudno M."
                    },
                    {
                        "name": "Do C.B."
                    },
                    {
                        "name": "Cooper G.M."
                    },
                    {
                        "name": "Kim M.F."
                    },
                    {
                        "name": "Davydov E."
                    },
                    {
                        "name": "Green E.D."
                    },
                    {
                        "name": "Sidow A."
                    },
                    {
                        "name": "Batzoglou S."
                    }
                ],
                "citationCount": 770,
                "date": "2003-04-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "LAGAN and Multi-LAGAN: Efficient tools for large-scale multiple alignment of genomic DNA"
            },
            "pmcid": "PMC430158",
            "pmid": "12654723"
        },
        {
            "doi": "10.1093/nar/gkh458",
            "metadata": {
                "abstract": "Comparison of DNA sequences from different species is a fundamental method for identifying functional elements in genomes. Here, we describe the VISTA family of tools created to assist biologists in carrying out this task. Our first VISTA server at http://www-gsd.Ibl.gov/vista/ was launched in the summer of 2000 and was designed to align long genomic sequences and visualize these alignments with associated functional annotations. Currently the VISTA site includes multiple comparative genomics tools and provides users with rich capabilities to browse pre-computed whole-genome alignments of large vertebrate genomes and other groups of organisms with VISTA Browser, to submit their own sequences of interest to several VISTA servers for various types of comparative analysis and to obtain detailed comparative analysis results for a set of cardiovascular genes. We illustrate capabilities of the VISTA site by the analysis of a 180 kb interval on human chromosome 5 that encodes for the kinesin family member 3A (KIF3A) protein. © Oxford University Press 2004; all rights reserved.",
                "authors": [
                    {
                        "name": "Frazer K.A."
                    },
                    {
                        "name": "Pachter L."
                    },
                    {
                        "name": "Poliakov A."
                    },
                    {
                        "name": "Rubin E.M."
                    },
                    {
                        "name": "Dubchak I."
                    }
                ],
                "citationCount": 1130,
                "date": "2004-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "VISTA: Computational tools for comparative genomics"
            },
            "pmcid": "PMC441596",
            "pmid": "15215394"
        },
        {
            "doi": "10.1093/nar/gkl822",
            "metadata": {
                "abstract": "Despite the known existence of distant-acting cis-regulatory elements in the human genome, only a small fraction of these elements has been identified and experimentally characterized in vivo. This paucity of enhancer collections with defined activities has thus hindered computational approaches for the genome-wide prediction of enhancers and their functions. To fill this void, we utilize comparative genome analysis to identify candidate enhancer elements in the human genome coupled with the experimental determination of their in vivo enhancer activity in transgenic mice [L. A. Pennacchio et al. (2006) Nature, in press]. These data are available through the VISTA Enhancer Browser (http://enhancer.lbl.gov). This growing database currently contains over 250 experimentally tested DNA fragments, of which more than 100 have been validated as tissue-specific enhancers. For each positive enhancer, we provide digital images of whole-mount embryo staining at embryonic day 11.5 and an anatomical description of the reporter gene expression pattern. Users can retrieve elements near single genes of interest, search for enhancers that target reporter gene expression to a particular tissue, or download entire collections of enhancers with a defined tissue specificity or conservation depth. These experimentally validated training sets are expected to provide a basis for a wide range of downstream computational and functional studies of enhancer function. © 2007 Oxford University Press.",
                "authors": [
                    {
                        "name": "Visel A."
                    },
                    {
                        "name": "Minovitsky S."
                    },
                    {
                        "name": "Dubchak I."
                    },
                    {
                        "name": "Pennacchio L.A."
                    }
                ],
                "citationCount": 515,
                "date": "2007-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "VISTA Enhancer Browser - A database of tissue-specific human enhancers"
            },
            "pmcid": "PMC1716724",
            "pmid": "17130149"
        }
    ],
    "toolType": [
        "Web application",
        "Database portal"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        }
    ]
}