{
    "accessibility": "Open access",
    "additionDate": "2024-01-04T20:22:59.207839Z",
    "biotoolsCURIE": "biotools:tarpid",
    "biotoolsID": "tarpid",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "vivek.iitian@gmail.com",
            "name": "Bibekanand Mallick",
            "typeEntity": "Person"
        },
        {
            "name": "Gourab Das",
            "typeEntity": "Person"
        },
        {
            "name": "Pooja Gupta",
            "typeEntity": "Person"
        }
    ],
    "description": "Database of putative and validated targets of piRNAs.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "trans-regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0443"
                }
            ]
        }
    ],
    "homepage": "https://tarpid.nitrkl.ac.in/tarpid_db/",
    "lastUpdate": "2024-11-24T14:23:19.510322Z",
    "name": "TarpiD",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1039/d3mo00098b",
            "metadata": {
                "abstract": "Piwi-interacting RNAs (piRNAs) are a novel class of 18-36 nts long small non-coding single-stranded RNAs that play crucial roles in a wide array of critical biological activities besides maintaining genome integrity by transposon silencing. piRNAs influence biological processes and pathways by regulating gene expression at transcriptional and post-transcriptional level. Studies have reported that piRNAs silence various endogenous genes post-transcriptionally by binding to respective mRNAs through interaction with the PIWI proteins. Several thousands of piRNAs have been discovered in animals, but their functions remain largely undiscovered owing to a lack of proper guiding principles of piRNA targeting or diversity in targeting patterns amongst piRNAs from the same or different species. Identification of piRNA targets is essential for deciphering their functions. There are a few tools and databases on piRNAs, but there are no systematic and exclusive repositories to obtain information on target genes regulated by piRNAs and other related information. Hence, we developed a user-friendly database named TarpiD (Targets of piRNA Database) that offers comprehensive information on piRNA and its targets, including their expression, methodologies (high-throughput or low-throughput) for target identification/validation, cells/tissue types, diseases, target gene regulation types, target binding regions, and key functions driven by piRNAs through target gene interactions. The contents of TarpiD are curated from the published literature and enable users to search and download the targets of a particular piRNA or the piRNAs that target a specific gene for use in their research. This database harbours 28 682 entries of piRNA-target interactions supported by 15 methodologies reported in hundreds of cell types/tissues from 9 species. TarpiD will be a valuable resource for a better understanding of the functions and gene-regulatory mechanisms mediated by piRNAs. TarpiD is freely accessible for academic use at https://tarpid.nitrkl.ac.in/tarpid_db/.",
                "authors": [
                    {
                        "name": "Chattopadhyay T."
                    },
                    {
                        "name": "Das G."
                    },
                    {
                        "name": "Ghosh Z."
                    },
                    {
                        "name": "Gupta P."
                    },
                    {
                        "name": "Mallick B."
                    }
                ],
                "citationCount": 2,
                "date": "2023-06-27T00:00:00Z",
                "journal": "Molecular Omics",
                "title": "TarpiD, a database of putative and validated targets of piRNAs"
            },
            "pmid": "37427797"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}
