{
    "additionDate": "2021-01-18T11:03:53Z",
    "biotoolsCURIE": "biotools:optconet",
    "biotoolsID": "optconet",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "murugan.rmn@ece.nits.ac.in",
            "name": "R. Murugan",
            "orcidid": "https://orcid.org/0000-0002-9341-3810",
            "typeEntity": "Person"
        }
    ],
    "description": "An optimized convolutional neural network for an automatic diagnosis of COVID-19.\n\nOptCoNet: An Optimized Convolutional Neural Network for an Automatic Diagnosis of COVID-19 .",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/biomedicallabecenitsilchar/optconet",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-03-15T09:27:42Z",
    "name": "OptCoNet",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1007/S10489-020-01904-Z",
            "metadata": {
                "abstract": "© 2020, Springer Science+Business Media, LLC, part of Springer Nature.The quick spread of coronavirus disease (COVID-19) has become a global concern and affected more than 15 million confirmed patients as of July 2020. To combat this spread, clinical imaging, for example, X-ray images, can be utilized for diagnosis. Automatic identification software tools are essential to facilitate the screening of COVID-19 using X-ray images. This paper aims to classify COVID-19, normal, and pneumonia patients from chest X-ray images. As such, an Optimized Convolutional Neural network (OptCoNet) is proposed in this work for the automatic diagnosis of COVID-19. The proposed OptCoNet architecture is composed of optimized feature extraction and classification components. The Grey Wolf Optimizer (GWO) algorithm is used to optimize the hyperparameters for training the CNN layers. The proposed model is tested and compared with different classification strategies utilizing an openly accessible dataset of COVID-19, normal, and pneumonia images. The presented optimized CNN model provides accuracy, sensitivity, specificity, precision, and F1 score values of 97.78%, 97.75%, 96.25%, 92.88%, and 95.25%, respectively, which are better than those of state-of-the-art models. This proposed CNN model can help in the automatic screening of COVID-19 patients and decrease the burden on medicinal services frameworks.",
                "authors": [
                    {
                        "name": "Goel T."
                    },
                    {
                        "name": "Murugan R."
                    },
                    {
                        "name": "Mirjalili S."
                    },
                    {
                        "name": "Chakrabartty D.K."
                    }
                ],
                "citationCount": 8,
                "date": "2021-03-01T00:00:00Z",
                "journal": "Applied Intelligence",
                "title": "OptCoNet: an optimized convolutional neural network for an automatic diagnosis of COVID-19"
            },
            "pmcid": "PMC7502308"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        }
    ]
}