{
    "additionDate": "2017-02-10T11:35:47Z",
    "biotoolsCURIE": "biotools:icgebnet_protein_tools",
    "biotoolsID": "icgebnet_protein_tools",
    "description": "Resource for analysis of 3D protein structures including domain predictors, a protein fold similiarity server (PRIDE), and tools for calculating atom protusion (CX) and/or depth (DPX) indexes in 3D models.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                },
                {
                    "term": "Protein folding analysis",
                    "uri": "http://edamontology.org/operation_2415"
                },
                {
                    "term": "Protein fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Protein property calculation",
                    "uri": "http://edamontology.org/operation_0250"
                },
                {
                    "term": "Protein structure analysis",
                    "uri": "http://edamontology.org/operation_2406"
                }
            ]
        }
    ],
    "homepage": "http://www.icgeb.org/protein/",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:39Z",
    "name": "ICGEBnet Protein Tools",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: A simple and fast algorithm is described that calculates a measure of protrusion (cx) for atoms in protein structures, directly useable with the common molecular graphics programs. Results: A sphere of predetermined radius is centered around each non-hydrogen atom, and the volume occupied by the protein and the free volume within the sphere (internal and external volumes, respectively) are calculated. Atoms in protruding regions have a high ratio (cx) between the external and the internal volume. The program reads a PDB file, and writes the output in the same format, with cx values in the B factor field. Output structure files can be directly displayed with standard molecular graphics programs like RASMOL, MOLMOL, Swiss-PDB Viewer and colored according to cx values. We show the potential use of this program in the analysis of two protein-protein complexes and in the prediction of limited proteolysis sites in native proteins.",
                "authors": [
                    {
                        "name": "Pintar A."
                    },
                    {
                        "name": "Carugo O."
                    },
                    {
                        "name": "Pongor S."
                    }
                ],
                "citationCount": 66,
                "date": "2002-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "CX, an algorithm that identifies protruding atoms in proteins"
            },
            "pmid": "12117796"
        },
        {
            "metadata": {
                "abstract": "In order to obtain an accurate description of the protein interior, we describe a simple and fast algorithm that measures the depth of each atom in a protein (dpx), defined as its distance (Å) from the closest solvent accessible atom. The program reads a PDB file containing the atomic solvent accessibility in the B-factor field, and writes a file in the same format, where the B-factor field now contains the dpx value. Output structure files can be thus directly displayed with molecular graphics programs like RASMOL, MOLMOL, Swiss-PDB View and colored according to dpx values.",
                "authors": [
                    {
                        "name": "Pintar A."
                    },
                    {
                        "name": "Carugo O."
                    },
                    {
                        "name": "Pongor S."
                    }
                ],
                "citationCount": 55,
                "date": "2003-02-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "DPX: For the analysis of the protein core"
            },
            "pmid": "12538266"
        },
        {
            "metadata": {
                "abstract": "The distribution of the Cα-Cα distances between residues separated by three to 30 amino acid residues is highly characteristic of protein folds and makes it possible to identify them from a straightforward comparison of the distance histograms. The comparison is carried out by contingency table analysis and yields a probability of identity (PRIDE score), with values between zero and 1. For closely related structures, PRIDE is highly correlated with the root-mean-square distance between Cα atoms, but it provides a correct classification even for unrelated structures for which a structural alignment is not meaningful. For example, an analysis of the CATH database of fold structures showed that 98.8% of the folds fall into the correct CATH homologous superfamily category, based on the highest PRIDE score obtained. Structural alignment and secondary-structure assignment are not necessary for the calculation of PRIDE, which is fast enough to allow the scanning of large databases. © 2002 Academic Press.",
                "authors": [
                    {
                        "name": "Carugo O."
                    },
                    {
                        "name": "Pongor S."
                    }
                ],
                "citationCount": 87,
                "date": "2002-01-01T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "Protein fold similarity estimated by a probabilistic approach based on Cα-Cα distance comparison"
            },
            "pmid": "11812155"
        },
        {
            "metadata": {
                "abstract": "The WWW servers at http://www.icgeb.org/protein/ are dedicated to the analysis of protein 3D structures submitted by the users as the Protein Data Bank (PDB) files. CX computes an atomic protrusion index that makes it possible to highlight the protruding atoms within a protein 3D structure. DPX calculates a depth index for the buried atoms and makes it possible to analyze the distribution of buried residues. CX and DPX return PDB files containing the calculated indices that can then be visualized using standard programs, such as Swiss-PDBviewer and Rasmol. PRIDE compares 3D structures using a fast algorithm based on the distribution of inter-atomic distances. The options include pairwise as well as multiple comparisons, and fold recognition based on searching the CATH fold database. © 2005 Oxford University Press.",
                "authors": [
                    {
                        "name": "Vlahovicek K."
                    },
                    {
                        "name": "Pintar A."
                    },
                    {
                        "name": "Parthasarathi L."
                    },
                    {
                        "name": "Carugo O."
                    },
                    {
                        "name": "Pongor S."
                    }
                ],
                "citationCount": 12,
                "date": "2005-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "CX, DPX and PRIDE: WWW servers for the analysis and comparison of protein 3D structures"
            },
            "pmid": "15980464"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        }
    ],
    "validated": 1
}