{
    "accessibility": "Open access",
    "additionDate": "2024-03-22T16:47:41.769597Z",
    "biotoolsCURIE": "biotools:temm",
    "biotoolsID": "temm",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "Achraf.ELALLALI@um6p.ma",
            "name": "Achraf El Allali",
            "typeEntity": "Person"
        },
        {
            "name": "Asmaa H Hassan",
            "typeEntity": "Person"
        }
    ],
    "description": "Curated data resource for transposon element-based molecular markers in plants.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome feature comparison",
                    "uri": "http://edamontology.org/operation_3194"
                },
                {
                    "term": "Sequence similarity search",
                    "uri": "http://edamontology.org/operation_0346"
                },
                {
                    "term": "Transposon prediction",
                    "uri": "http://edamontology.org/operation_0427"
                }
            ]
        }
    ],
    "homepage": "https://bioinformatics.um6p.ma/TEMM",
    "lastUpdate": "2024-11-24T14:06:52.222297Z",
    "name": "TEMM",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/978-1-0716-3389-2_4",
            "metadata": {
                "abstract": "Transposon elements (TEs) are mobile genetic elements that can insert themselves into new locations and modify the plant genome. In recent years, they have been used as molecular markers in plant breeding programs. TE-based molecular markers (TE-markers) are divided into two categories depending on the transcription mechanism of the TEs. The first category is retrotransposon-based molecular markers, which include RBIP, IRAP, REMAP, and iPBS. The second group is DNA-based-TE-markers, which include MITE, TE-junction, and CACTA TE-markers. These markers are a good tool for studying genetic diversity and can provide information on plants’ phylogenetic and evolutionary history. They can help improve breeding programs to increase agronomic traits and develop new varieties. Overall, TE-markers play an important role in plant genetics and plant breeding and contribute to a better understanding of plant biology. Here, we present TEMM, a curated data resource for TE-markers in plants. Relevant research articles were screened to collect primer sequences and related information. Only articles containing primer sequences are added to the present data resource. TEMM contains 784 primers with their associated PCR reaction programs and their applications in various crops. These include 203 IPBS, 191 RBIP, 140 IRAP, 78 TE-junction, 76 IRAPS, 47 RBIP-IRAP, 16 IRAP-REMAP, 12 REMAP, 12 REMA-IRAP, 6 REMA, and 3 ISBP primers. The data resource is freely available at https://bioinformatics.um6p.ma/TEMM.",
                "authors": [
                    {
                        "name": "El Allali A."
                    },
                    {
                        "name": "Hassan A.H."
                    },
                    {
                        "name": "Mokhtar M.M."
                    }
                ],
                "citationCount": 1,
                "date": "2023-01-01T00:00:00Z",
                "journal": "Methods in Molecular Biology",
                "title": "TEMM: A Curated Data Resource for Transposon Element-Based Molecular Markers in Plants"
            },
            "pmid": "37646936"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Mobile genetic elements",
            "uri": "http://edamontology.org/topic_0798"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ]
}
