{
    "additionDate": "2019-11-14T19:28:26Z",
    "biotoolsCURIE": "biotools:FeGenie",
    "biotoolsID": "FeGenie",
    "confidence_flag": "tool",
    "description": "a comprehensive tool for the identification of iron genes and iron gene neighborhoods in genomes and metagenome assemblies | HMM-based identification and categorization of iron genes and iron gene operons in genomes and metagenomes | Please see the Wiki page for introduction and tutorial on how to use this tool | git clone https://github.com/Arkadiy-Garber/FeGenie.git | Easy Installation (if you have Conda installed) | HMM-lib directory can be found within FeGenie's main repository -t 8 means that 8 threads will be used for HMMER and BLAST. If you have less than 16 available on your system, set this number lower (default = 1)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Read binning",
                    "uri": "http://edamontology.org/operation_3798"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Arkadiy-Garber/FeGenie",
    "language": [
        "R",
        "Python"
    ],
    "lastUpdate": "2020-12-28T19:00:11Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/Arkadiy-Garber/FeGenie/issues"
        }
    ],
    "name": "FeGenie",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/777656"
        },
        {
            "doi": "10.3389/fmicb.2020.00037",
            "metadata": {
                "abstract": "© Copyright © 2020 Garber, Nealson, Okamoto, McAllister, Chan, Barco and Merino.Iron is a micronutrient for nearly all life on Earth. It can be used as an electron donor and electron acceptor by iron-oxidizing and iron-reducing microorganisms and is used in a variety of biological processes, including photosynthesis and respiration. While it is the fourth most abundant metal in the Earth’s crust, iron is often limiting for growth in oxic environments because it is readily oxidized and precipitated. Much of our understanding of how microorganisms compete for and utilize iron is based on laboratory experiments. However, the advent of next-generation sequencing and surge in publicly available sequence data has made it possible to probe the structure and function of microbial communities in the environment. To bridge the gap between our understanding of iron acquisition, iron redox cycling, iron storage, and magnetosome formation in model microorganisms and the plethora of sequence data available from environmental studies, we have created a comprehensive database of hidden Markov models (HMMs) based on genes related to iron acquisition, storage, and reduction/oxidation in Bacteria and Archaea. Along with this database, we present FeGenie, a bioinformatics tool that accepts genome and metagenome assemblies as input and uses our comprehensive HMM database to annotate provided datasets with respect to iron-related genes and gene neighborhood. An important contribution of this tool is the efficient identification of genes involved in iron oxidation and dissimilatory iron reduction, which have been largely overlooked by standard annotation pipelines. We validated FeGenie against a selected set of 28 isolate genomes and showcase its utility in exploring iron genes present in 27 metagenomes, 4 isolate genomes from human oral biofilms, and 17 genomes from candidate organisms, including members of the candidate phyla radiation. We show that FeGenie accurately identifies iron genes in isolates. Furthermore, analysis of metagenomes using FeGenie demonstrates that the iron gene repertoire and abundance of each environment is correlated with iron richness. While this tool will not replace the reliability of culture-dependent analyses of microbial physiology, it provides reliable predictions derived from the most up-to-date genetic markers. FeGenie’s database will be maintained and continually updated as new genes are discovered. FeGenie is freely available: https://github.com/Arkadiy-Garber/FeGenie.",
                "authors": [
                    {
                        "name": "Garber A.I."
                    },
                    {
                        "name": "Nealson K.H."
                    },
                    {
                        "name": "Okamoto A."
                    },
                    {
                        "name": "McAllister S.M."
                    },
                    {
                        "name": "Chan C.S."
                    },
                    {
                        "name": "Barco R.A."
                    },
                    {
                        "name": "Merino N."
                    }
                ],
                "citationCount": 35,
                "date": "2020-01-31T00:00:00Z",
                "journal": "Frontiers in Microbiology",
                "title": "FeGenie: A Comprehensive Tool for the Identification of Iron Genes and Iron Gene Neighborhoods in Genome and Metagenome Assemblies"
            },
            "pmcid": "PMC7005843",
            "pmid": "32082281",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        }
    ],
    "validated": 1
}