{
    "accessibility": "Open access",
    "additionDate": "2022-05-20T22:59:01.135988Z",
    "biotoolsCURIE": "biotools:ms-mda",
    "biotoolsID": "ms-mda",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "lijinpeng@ucas.ac.cn",
            "name": "Jinpeng Li",
            "typeEntity": "Person"
        },
        {
            "name": "Cunhang Fan"
        },
        {
            "name": "Huiguang He"
        }
    ],
    "description": "Multisource Marginal Distribution Adaptation for Cross-Subject and Cross-Session EEG Emotion Recognition.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/VoiceBeer/MS-MDA",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-05-20T22:59:01.138163Z",
    "license": "MIT",
    "name": "MS-MDA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/FNINS.2021.778488",
            "metadata": {
                "abstract": "Copyright © 2021 Chen, Jin, Li, Fan, Li and He.As an essential element for the diagnosis and rehabilitation of psychiatric disorders, the electroencephalogram (EEG) based emotion recognition has achieved significant progress due to its high precision and reliability. However, one obstacle to practicality lies in the variability between subjects and sessions. Although several studies have adopted domain adaptation (DA) approaches to tackle this problem, most of them treat multiple EEG data from different subjects and sessions together as a single source domain for transfer, which either fails to satisfy the assumption of domain adaptation that the source has a certain marginal distribution, or increases the difficulty of adaptation. We therefore propose the multi-source marginal distribution adaptation (MS-MDA) for EEG emotion recognition, which takes both domain-invariant and domain-specific features into consideration. First, we assume that different EEG data share the same low-level features, then we construct independent branches for multiple EEG data source domains to adopt one-to-one domain adaptation and extract domain-specific features. Finally, the inference is made by multiple branches. We evaluate our method on SEED and SEED-IV for recognizing three and four emotions, respectively. Experimental results show that the MS-MDA outperforms the comparison methods and state-of-the-art models in cross-session and cross-subject transfer scenarios in our settings. Codes at https://github.com/VoiceBeer/MS-MDA.",
                "authors": [
                    {
                        "name": "Chen H."
                    },
                    {
                        "name": "Fan C."
                    },
                    {
                        "name": "He H."
                    },
                    {
                        "name": "Jin M."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Li Z."
                    }
                ],
                "citationCount": 2,
                "date": "2021-12-07T00:00:00Z",
                "journal": "Frontiers in Neuroscience",
                "title": "MS-MDA: Multisource Marginal Distribution Adaptation for Cross-Subject and Cross-Session EEG Emotion Recognition"
            },
            "pmcid": "PMC8688841",
            "pmid": "34949983"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        },
        {
            "term": "Psychiatry",
            "uri": "http://edamontology.org/topic_3419"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
