{
    "additionDate": "2020-01-09T18:02:26Z",
    "biotoolsCURIE": "biotools:PyRadiomics",
    "biotoolsID": "PyRadiomics",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhenwei.shi@maastro.nl",
            "name": "Zhenwei Shi",
            "typeEntity": "Person"
        }
    ],
    "description": "PyRadiomics is an ontology-guided radiomics analysis workflow (O-RAW).",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Radiomics/pyradiomics",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-13T18:24:56Z",
    "name": "PyRadiomics",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/MP.13844",
            "metadata": {
                "abstract": "© 2019 The Authors. Medical Physics published by Wiley Periodicals, Inc. on behalf of American Association of Physicists in MedicinePurpose: Radiomics is the process to automate tumor feature extraction from medical images. This has shown potential for quantifying the tumor phenotype and predicting treatment response. The three major challenges of radiomics research and clinical adoption are: (a) lack of standardized methodology for radiomics analyses, (b) lack of a universal lexicon to denote features that are semantically equivalent, and (c) lists of feature values alone do not sufficiently capture the details of feature extraction that might nonetheless strongly affect feature values (e.g. image normalization or interpolation parameters). These barriers hamper multicenter validation studies applying subtly different imaging protocols, preprocessing steps and radiomics software. We propose an open-source ontology-guided radiomics analysis workflow (O-RAW) to address the above challenges in the following manner: (a) distributing a free and open-source software package for radiomics analysis, (b) deploying a standard lexicon to uniquely describe features in common usage and (c) provide methods to publish radiomic features as a semantically interoperable data graph object complying to FAIR (findable accessible interoperable reusable) data principles. Methods: O-RAW was developed in Python, and has three major modules using open-source component libraries (PyRadiomics Extension and PyRadiomics). First, PyRadiomics Extension takes standard DICOM-RT (Radiotherapy) input objects (i.e. a DICOM series and an RTSTRUCT file) and parses them as arrays of voxel intensities and a binary mask corresponding to a volume of interest (VOI). Next, these arrays are passed into PyRadiomics, which performs the feature extraction procedure and returns a Python dictionary object. Lastly, PyRadiomics Extension parses this dictionary as a W3C-compliant Semantic Web “triple store” (i.e., list of subject-predicate-object statements) with relevant semantic meta-labels drawn from the radiation oncology ontology and radiomics ontology. The output can be published on an SPARQL endpoint, and can be remotely examined via SPARQL queries or to a comma separated file for further analysis. Results: We showed that O-RAW executed efficiently on four datasets with different modalities, RIDER (CT), MMD (CT), CROSS (PET) and THUNDER (MR). The test was performed on an HP laptop running Windows 7 operating system and 8GB RAM on which we noted execution time including DICOM images and associated RTSTRUCT matching, binary mask conversion of a single VOI, batch-processing of feature extraction (105 basic features in PyRadiomics), and the conversion to an resource description framework (RDF) object. The results were (RIDER) 407.3, (MMD) 123.5, (CROSS) 513.2 and (THUNDER) 128.9 s for a single VOI. In addition, we demonstrated a use case, taking images from a public repository and publishing the radiomics results as FAIR data in this study on www.radiomics.org. Finally, we provided a practical instance to show how a user could query radiomic features and track the calculation details based on the RDF graph object created by O-RAW via a simple SPARQL query. Conclusions: We implemented O-RAW for FAIR radiomics analysis, and successfully published radiomic features from DICOM-RT objects as semantic web triples. Its practicability and flexibility can greatly increase the development of radiomics research and ease transfer to clinical practice.",
                "authors": [
                    {
                        "name": "Shi Z."
                    },
                    {
                        "name": "Traverso A."
                    },
                    {
                        "name": "van Soest J."
                    },
                    {
                        "name": "Dekker A."
                    },
                    {
                        "name": "Wee L."
                    }
                ],
                "citationCount": 8,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Medical Physics",
                "title": "Technical Note: Ontology-guided radiomics analysis workflow (O-RAW)"
            },
            "pmcid": "PMC6916323",
            "pmid": "31580484"
        }
    ],
    "topic": [
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}