{
    "additionDate": "2018-04-29T09:25:08Z",
    "biotoolsCURIE": "biotools:epig-seq",
    "biotoolsID": "epig-seq",
    "credit": [
        {
            "email": "bushel@niehs.nih.gov",
            "name": "Pierre R. Bushel",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Extracting patterns and identifying co-expressed genes from RNA-Seq data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://sourceforge.net/projects/epig-seq/files/EPIGSeqQuickStartGuide_v01.pdf/download"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression correlation",
                    "uri": "http://edamontology.org/operation_3463"
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/projects/epig-seq/?source=navbar",
    "language": [
        "R",
        "Java",
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "license": "GPL-3.0",
    "name": "EPIG-Seq",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/S12864-016-2584-7",
            "metadata": {
                "abstract": "© 2016 Li and Bushel.Background: RNA sequencing (RNA-Seq) measures genome-wide gene expression. RNA-Seq data is count-based rendering normal distribution models for analysis inappropriate. Normalization of RNA-Seq data to transform the data has limitations which can adversely impact the analysis. Furthermore, there are a few count-based methods for analysis of RNA-Seq data but they are essentially for pairwise analysis of treatment groups or multiclasses but not pattern-based to identify co-expressed genes. Results: We adapted our extracting patterns and identifying genes methodology for RNA-Seq (EPIG-Seq) count data. The software uses count-based correlation to measure similarity between genes, quasi-Poisson modelling to estimate dispersion in the data and a location parameter to indicate magnitude of differential expression. EPIG-Seq is different than any other software currently available for pattern analysis of RNA-Seq data in that EPIG-Seq 1) uses count level data and supports cases of inflated zeros, 2) identifies statistically significant clusters of genes that are co-expressed across experimental conditions, 3) takes into account dispersion in the replicate data and 4) provides reliable results even with small sample sizes. EPIG-Seq operates in two steps: 1) extract the pattern profiles from data as seeds for clustering co-expressed genes and 2) cluster the genes to the pattern seeds and compute statistical significance of the pattern of co-expressed genes. EPIG-Seq provides a table of the genes with bootstrapped p-values and profile plots of the patterns of co-expressed genes. In addition, EPIG-Seq provides a heat map and principal component dimension reduction plot of the clustered genes as visual aids. We demonstrate the utility of EPIG-Seq through the analysis of toxicogenomics and cancer data sets to identify biologically relevant co-expressed genes. EPIG-Seq is available at: sourceforge.net/projects/epig-seq. Conclusions: EPIG-Seq is unlike any other software currently available for pattern analysis of RNA-Seq count level data across experimental groups. Using the EPIG-Seq software to analyze RNA-Seq count data across biological conditions permits the ability to extract biologically meaningful co-expressed genes associated with coordinated regulation.",
                "authors": [
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Bushel P.R."
                    }
                ],
                "citationCount": 5,
                "date": "2016-01-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "EPIG-Seq: Extracting patterns and identifying co-expressed genes from RNA-Seq data"
            },
            "pmcid": "PMC4804494",
            "pmid": "27004791"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Toxicology",
            "uri": "http://edamontology.org/topic_2840"
        }
    ],
    "validated": 1
}