
{
    "credit": [
        {
            "email": "jeremy_purvis@med.unc.edu",
            "name": "Jeremy E. Purvis",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://github.com/RENCI/CellCycleBrowser/wiki"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "JavaScript"
        ],
        "license": "BSD-3-Clause",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Cell biology",
                "uri": "http://edamontology.org/topic_2229"
            },
            {
                "term": "Molecular biology",
                "uri": "http://edamontology.org/topic_3047"
            }
        ]
    },
    "link": [
        {
            "type": "ISSUE_TRACKER",
            "url": "https://github.com/RENCI/CellCycleBrowser/issues"
        }
    ],
    "publication": [
        {
            "abstract": "© 2018 Elsevier Inc.The cell cycle is driven by precise temporal coordination among many molecular activities. To understand and explore this process, we developed the Cell Cycle Browser (CCB), an interactive web interface based on real-time reporter data collected in proliferating human cells. This tool facilitates visualizing, organizing, simulating, and predicting the outcomes of perturbing cell-cycle parameters. Time-series traces from individual cells can be combined to build a multi-layered timeline of molecular activities. Users can simulate the cell cycle using computational models that capture the dynamics of molecular activities and phase transitions. By adjusting individual expression levels and strengths of molecular relationships, users can predict effects on the cell cycle. Virtual assays, such as growth curves and flow cytometry, provide familiar outputs to compare cell-cycle behaviors for data and simulations. The CCB serves to unify our understanding of cell-cycle dynamics and provides a platform for generating hypotheses through virtual experiments. Borland, Yi, and colleagues develop an interactive website offering visualization, simulation, and virtual experiments to study cell-cycle progression at the molecular level.",
            "authors": [
                "Borland D.",
                "Yi H.",
                "Grant G.D.",
                "Kedziora K.M.",
                "Chao H.X.",
                "Haggerty R.A.",
                "Kumar J.",
                "Wolff S.C.",
                "Cook J.G.",
                "Purvis J.E."
            ],
            "cit_count": 0,
            "doi": "10.1016/j.cels.2018.06.004",
            "journal": "Cell Systems",
            "title": "The Cell Cycle Browser: An Interactive Tool for Visualizing, Simulating, and Perturbing Cell-Cycle Progression",
            "type": "Primary",
            "year": "2018-08-22"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:ccb",
        "biotoolsID": "ccb",
        "description": "The Human Cell Cycle Browser (hCCB) is an interactive web tool for visualizing and simulating the human cell cycle to explore the timeline of molecular events during cell cycle progression.",
        "homepage": "https://cellcycle.renci.org/",
        "name": "Cell Cycle Browser (CCB)",
        "version": [
            "1.0"
        ]
    }
}