{
    "additionDate": "2021-01-18T08:31:40Z",
    "biotoolsCURIE": "biotools:lmsm",
    "biotoolsID": "lmsm",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhangjunpeng_411@yahoo.com",
            "name": "Junpeng Zhang",
            "orcidid": "https://orcid.org/0000-0001-6127-9701",
            "typeEntity": "Person"
        },
        {
            "email": "raonn@uestc.edu.cn",
            "name": "Nini Rao",
            "orcidid": "https://orcid.org/0000-0001-7979-2917",
            "typeEntity": "Person"
        },
        {
            "email": "thuc.le@unisa.edu.au",
            "name": "Thuc Duy Le",
            "orcidid": "https://orcid.org/0000-0002-9732-4313",
            "typeEntity": "Person"
        }
    ],
    "description": "A modular approach for identifying lncRNA related miRNA sponge modules in breast cancer.\n\nA modular approach to identify lncRNA related miRNA sponge modules in breast cancer.\n\nUntil now, existing methods for identifying lncRNA related miRNA sponge modules mainly rely on lncRNA related miRNA sponge interaction networks, which may not provide a full picture of miRNA sponging activities in biological conditions. Hence there is a strong need of new computational methods to identify lncRNA related miRNA sponge modules. In this work, we propose a framework, LMSM, to identify LncRNA related MiRNA Sponge Modules from heterogeneous data. To understand the miRNA sponging activities in biological conditions, LMSM uses gene expression data to evaluate the influence of the shared miRNAs on the clustered sponge lncRNAs and mRNAs.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "https://github.com/zhangjunpeng411/LMSM",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-17T07:14:30Z",
    "license": "GPL-3.0",
    "name": "LMSM",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1007851",
            "metadata": {
                "abstract": "© 2020 Zhang et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Until now, existing methods for identifying lncRNA related miRNA sponge modules mainly rely on lncRNA related miRNA sponge interaction networks, which may not provide a full picture of miRNA sponging activities in biological conditions. Hence there is a strong need of new computational methods to identify lncRNA related miRNA sponge modules. In this work, we propose a framework, LMSM, to identify LncRNA related MiRNA Sponge Modules from heterogeneous data. To understand the miRNA sponging activities in biological conditions, LMSM uses gene expression data to evaluate the influence of the shared miRNAs on the clustered sponge lncRNAs and mRNAs. We have applied LMSM to the human breast cancer (BRCA) dataset from The Cancer Genome Atlas (TCGA). As a result, we have found that the majority of LMSM modules are significantly implicated in BRCA and most of them are BRCA subtype-specific. Most of the mediating miRNAs act as crosslinks across different LMSM modules, and all of LMSM modules are statistically significant. Multi-label classification analysis shows that the performance of LMSM modules is significantly higher than baseline’s performance, indicating the biological meanings of LMSM modules in classifying BRCA subtypes. The consistent results suggest that LMSM is robust in identifying lncRNA related miRNA sponge modules. Moreover, LMSM can be used to predict miRNA targets. Finally, LMSM outperforms a graph clustering-based strategy in identifying BRCA-related modules. Altogether, our study shows that LMSM is a promising method to investigate modular regulatory mechanism of sponge lncRNAs from heterogeneous data.",
                "authors": [
                    {
                        "name": "Zhang J."
                    },
                    {
                        "name": "Xu T."
                    },
                    {
                        "name": "Liu L."
                    },
                    {
                        "name": "Zhang W."
                    },
                    {
                        "name": "Zhao C."
                    },
                    {
                        "name": "Li S."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Rao N."
                    },
                    {
                        "name": "Le T.D."
                    }
                ],
                "citationCount": 3,
                "date": "2020-04-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "LMSM: A modular approach for identifying lncRNA related miRNA sponge modules in breast cancer"
            },
            "pmcid": "PMC7200020",
            "pmid": "32324747"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ]
}