{
    "accessibility": "Open access",
    "additionDate": "2022-09-10T15:43:13.748067Z",
    "biotoolsCURIE": "biotools:dema",
    "biotoolsID": "dema",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jakechen@uab.edu",
            "name": "Jake Yue Chen",
            "typeEntity": "Person"
        }
    ],
    "description": "DEMA (Distance-bounded Energy-field Minimization Algorithm) an algorithm to model and layout biomolecular networks with quantitative properties.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://discovery.informatics.uab.edu/dema",
    "language": [
        "Java"
    ],
    "lastUpdate": "2024-11-24T15:40:11.451226Z",
    "license": "MIT",
    "name": "DEMA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btac261",
            "metadata": {
                "abstract": "In biology, graph layout algorithms can reveal comprehensive biological contexts by visually positioning graph nodes in their relevant neighborhoods. A layout software algorithm/engine commonly takes a set of nodes and edges and produces layout coordinates of nodes according to edge constraints. However, current layout engines normally do not consider node, edge or node-set properties during layout and only curate these properties after the layout is created. Here, we propose a new layout algorithm, distance-bounded energy-field minimization algorithm (DEMA), to natively consider various biological factors, i.e., the strength of gene-to-gene association, the gene's relative contribution weight and the functional groups of genes, to enhance the interpretation of complex network graphs. In DEMA, we introduce a parameterized energy model where nodes are repelled by the network topology and attracted by a few biological factors, i.e., interaction coefficient, effect coefficient and fold change of gene expression. We generalize these factors as gene weights, protein-protein interaction weights, gene-to-gene correlations and the gene set annotations - four parameterized functional properties used in DEMA. Moreover, DEMA considers further attraction/repulsion/grouping coefficient to enable different preferences in generating network views. Applying DEMA, we performed two case studies using genetic data in autism spectrum disorder and Alzheimer's disease, respectively, for gene candidate discovery. Furthermore, we implement our algorithm as a plugin to Cytoscape, an open-source software platform for visualizing networks; hence, it is convenient. Our software and demo can be freely accessed at http://discovery.informatics.uab.edu/dema.",
                "authors": [
                    {
                        "name": "Chen J.Y."
                    },
                    {
                        "name": "Weng Z."
                    },
                    {
                        "name": "Yue Z."
                    },
                    {
                        "name": "Zhu Y."
                    }
                ],
                "date": "2022-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "DEMA: A distance-bounded energy-field minimization algorithm to model and layout biomolecular networks with quantitative features"
            },
            "pmcid": "PMC9235497",
            "pmid": "35758816"
        }
    ],
    "relation": [
        {
            "biotoolsID": "cytoscape",
            "type": "uses"
        }
    ],
    "toolType": [
        "Plug-in"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ],
    "validated": 1
}
