{
    "additionDate": "2019-11-14T20:09:23Z",
    "biotoolsCURIE": "biotools:SBM",
    "biotoolsID": "SBM",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "asjagath@ntu.edu.sg",
            "name": "Jagath C. Rajapakse",
            "typeEntity": "Person"
        },
        {
            "email": "francisco.azuaje@lih.lu",
            "name": "Francisco Azuaje",
            "orcidid": "https://orcid.org/0000-0002-9207-9072",
            "typeEntity": "Person"
        }
    ],
    "description": "Analysis of correlation-based biomolecular networks from different omics data by fitting stochastic block models | SBM-for-correlation-based-networks",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Weighted correlation network analysis",
                    "uri": "http://edamontology.org/operation_3766"
                }
            ]
        }
    ],
    "homepage": "https://gitlab.com/biomodlih/sbm-for-correlation-based-networks",
    "lastUpdate": "2020-12-17T08:37:56Z",
    "license": "GPL-3.0",
    "name": "SBM",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.12688/F1000RESEARCH.18705.2",
            "metadata": {
                "abstract": "© 2019 Baum K et al.Background: Biological entities such as genes, promoters, mRNA, metabolites or proteins do not act alone, but in concert in their network context. Modules, i.e., groups of nodes with similar topological properties in these networks characterize important biological functions of the underlying biomolecular system. Edges in such molecular networks represent regulatory and physical interactions, and comparing them between conditions provides valuable information on differential molecular mechanisms. However, biological data is inherently noisy and network reduction techniques can propagate errors particularly to the level of edges. We aim to improve the analysis of networks of biological molecules by deriving modules together with edge relevance estimations that are based on global network characteristics. Methods: The key challenge we address here is investigating the capability of stochastic block models (SBMs) for representing and analyzing different types of biomolecular networks. Fitting them to SBMs both delivers modules of the networks and enables the derivation of edge confidence scores, and it has not yet been investigated for analyzing biomolecular networks. We apply SBM-based analysis independently to three correlation-based networks of breast cancer data originating from high-throughput measurements of different molecular layers: either transcriptomics, proteomics, or metabolomics. The networks were reduced by thresholding for correlation significance or by requirements on scale-freeness. Results and discussion: We find that the networks are best represented by the hierarchical version of the SBM, and many of the predicted blocks have a biologically and phenotypically relevant functional annotation. The edge confidence scores are overall in concordance with the biological evidence given by the measurements. We conclude that biomolecular networks can be appropriately represented and analyzed by fitting SBMs. As the SBM-derived edge confidence scores are based on global network connectivity characteristics and potential hierarchies within the biomolecular networks are considered, they could be used as additional, integrated features in network-based data comparisons.",
                "authors": [
                    {
                        "name": "Rajapakse J.C."
                    },
                    {
                        "name": "Azuaje F."
                    },
                    {
                        "name": "Baum K."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "F1000Research",
                "title": "Analysis of correlation-based biomolecular networks from different omics data by fitting stochastic block models"
            },
            "pmcid": "PMC6743255",
            "pmid": "31559017"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ],
    "validated": 1
}