
{
    "credit": [
        {
            "name": "Joe Chalfoun",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://www.nature.com/articles/s41598-017-04567-y/email/correspondent/c1/new"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/usnistgov/MIST"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java",
            "MATLAB"
        ],
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Imaging",
                "uri": "http://edamontology.org/topic_3382"
            },
            {
                "term": "Biomarkers",
                "uri": "http://edamontology.org/topic_3360"
            },
            {
                "term": "Biological imaging",
                "uri": "http://edamontology.org/topic_3383"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2017 The Author(s). Automated microscopy can image specimens larger than the microscope's field of view (FOV) by stitching overlapping image tiles. It also enables time-lapse studies of entire cell cultures in multiple imaging modalities. We created MIST (Microscopy Image Stitching Tool) for rapid and accurate stitching of large 2D time-lapse mosaics. MIST estimates the mechanical stage model parameters (actuator backlash, and stage repeatability 'r') from computed pairwise translations and then minimizes stitching errors by optimizing the translations within a (4r)2 square area. MIST has a performance-oriented implementation utilizing multicore hybrid CPU/GPU computing resources, which can process terabytes of time-lapse multi-channel mosaics 15 to 100 times faster than existing tools. We created 15 reference datasets to quantify MIST's stitching accuracy. The datasets consist of three preparations of stem cell colonies seeded at low density and imaged with varying overlap (10 to 50%). The location and size of 1150 colonies are measured to quantify stitching accuracy. MIST generated stitched images with an average centroid distance error that is less than 2% of a FOV. The sources of these errors include mechanical uncertainties, specimen photobleaching, segmentation, and stitching inaccuracies. MIST produced higher stitching accuracy than three open-source tools. MIST is available in ImageJ at isg.nist.gov.",
            "authors": [
                "Chalfoun J.",
                "Majurski M.",
                "Blattner T.",
                "Bhadriraju K.",
                "Keyrouz W.",
                "Bajcsy P.",
                "Brady M."
            ],
            "cit_count": 6,
            "doi": "10.1038/s41598-017-04567-y",
            "journal": "Scientific Reports",
            "title": "MIST: Accurate and Scalable Microscopy Image Stitching Tool with Stage Modeling and Error Minimization",
            "year": "2017-12-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:mist-stitch",
        "biotoolsID": "mist-stitch",
        "description": "Microscopy image stitching tool.",
        "homepage": "https://github.com/usnistgov/MIST",
        "name": "MIST"
    }
}