{
    "additionDate": "2017-08-03T18:45:13Z",
    "biotoolsCURIE": "biotools:genetier",
    "biotoolsID": "genetier",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://dna2.leeds.ac.uk:8080/expression/contact.jsp"
        }
    ],
    "description": "This tool replaces the knowledge-based inference traditionally used in candidate disease gene prioritization, instead using experimental data from tissue-specific gene expression data sets.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://dna2.leeds.ac.uk:8080/expression/faq.jsp"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://dna2.leeds.ac.uk:8080/expression/index.jsp",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2018-12-10T12:58:49Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/genetier-expression-based-candidate-gene-prioritisation.html"
        }
    ],
    "name": "GeneTIER",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2015 The Author 2015. Published by Oxford University Press.Motivation: In attempts to determine the genetic causes of human disease, researchers are often faced with a large number of candidate genes. Linkage studies can point to a genomic region containing hundreds of genes, while the high-throughput sequencing approach will often identify a great number of non-synonymous genetic variants. Since systematic experimental verification of each such candidate gene is not feasible, a method is needed to decide which genes are worth investigating further. Computational gene prioritization presents itself as a solution to this problem, systematically analyzing and sorting each gene from the most to least likely to be the disease-causing gene, in a fraction of the time it would take a researcher to perform such queries manually. Results: Here, we present Gene TIssue Expression Ranker (GeneTIER), a new web-based application for candidate gene prioritization. GeneTIER replaces knowledge-based inference traditionally used in candidate disease gene prioritization applications with experimental data from tissue-specific gene expression datasets and thus largely overcomes the bias toward the better characterized genes/diseases that commonly afflict other methods. We show that our approach is capable of accurate candidate gene prioritization and illustrate its strengths and weaknesses using case study examples. Availability and Implementation: Freely available on the web at http://dna.leeds.ac.uk/GeneTIER/.",
                "authors": [
                    {
                        "name": "Antanaviciute A."
                    },
                    {
                        "name": "Daly C."
                    },
                    {
                        "name": "Crinnion L.A."
                    },
                    {
                        "name": "Markham A.F."
                    },
                    {
                        "name": "Watson C.M."
                    },
                    {
                        "name": "Bonthron D.T."
                    },
                    {
                        "name": "Carr I.M."
                    }
                ],
                "citationCount": 18,
                "date": "2015-01-19T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "GeneTIER: Prioritization of candidate disease genes using tissue-specific gene expression profiles"
            },
            "pmid": "25861967"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Molecular genetics",
            "uri": "http://edamontology.org/topic_3321"
        }
    ],
    "validated": 1
}