{
    "additionDate": "2017-08-03T18:50:44Z",
    "biotoolsCURIE": "biotools:matrix_eqtl",
    "biotoolsID": "matrix_eqtl",
    "credit": [
        {
            "email": "ashabalin@vcu.edu",
            "name": "Andrey A. Shabalin",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://shabal.in/"
        }
    ],
    "description": "Model and test for association using both linear regression and ANOVA models. The models can include covariates to account for such factors as population structure, gender, and clinical variables. It also supports testing of heteroscedastic models and models with correlated errors.",
    "documentation": [
        {
            "type": "User manual",
            "url": "http://www.bios.unc.edu/research/genomic_software/Matrix_eQTL/runit.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "http://www.bios.unc.edu/research/genomic_software/Matrix_eQTL/",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/matrix-eqtl-ultra-fast-eqtl-analysis-large-matrix-operations.html"
        }
    ],
    "name": "Matrix eQTL",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: Expression quantitative trait loci (eQTL) analysis links variations in gene expression levels to genotypes. For modern datasets, eQTL analysis is a computationally intensive task as it involves testing for association of billions of transcript-SNP (single-nucleotide polymorphism) pair. The heavy computational burden makes eQTL analysis less popular and sometimes forces analysts to restrict their attention to just a small subset of transcript-SNP pairs. As more transcripts and SNPs get interrogated over a growing number of samples, the demand for faster tools for eQTL analysis grows stronger.Results: We have developed a new software for computationally efficient eQTL analysis called Matrix eQTL. In tests on large datasets, it was 2-3 orders of magnitude faster than existing popular tools for QTL/eQTL analysis, while finding the same eQTLs. The fast performance is achieved by special preprocessing and expressing the most computationally intensive part of the algorithm in terms of large matrix operations. Matrix eQTL supports additive linear and ANOVA models with covariates, including models with correlated and heteroskedastic errors. The issue of multiple testing is addressed by calculating false discovery rate; this can be done separately for cis- and trans-eQTLs. © The Author 2012. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Shabalin A.A."
                    }
                ],
                "citationCount": 373,
                "date": "2012-05-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Matrix eQTL: Ultra fast eQTL analysis via large matrix operations"
            },
            "pmid": "22492648"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        }
    ],
    "validated": 1
}