{
    "name": "multperf", 
    "description": "Program used to generate the empirical results on the missing data problem for an arbitrary, but fixed (at input) number of states.", 
    "homepage": "http://csiflabs.cs.ucdavis.edu/~gusfield/software.html", 
    "biotoolsID": "multperf", 
    "biotoolsCURIE": "biotools:multperf", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2409", 
                    "term": "Data handling"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0084", 
            "term": "Phylogeny"
        }, 
        {
            "uri": "http://edamontology.org/topic_3293", 
            "term": "Phylogenetics"
        }, 
        {
            "uri": "http://edamontology.org/topic_3572", 
            "term": "Data quality management"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Mac"
    ], 
    "language": [
        "Perl"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/multperf-generate-empirical-results-missing-data-problem-multi-state-perfect-phylogenies.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://csiflabs.cs.ucdavis.edu/~gusfield/software.html", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "20377452", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "The multi-state perfect phylogeny problem with missing and removable data: Solutions via integer-programming and chordal graph theory", 
                "abstract": "The Multi-State Perfect Phylogeny Problem is an extension of the Binary Perfect Phylogeny Problem, allowing characters to take on more than two states. In this article, we consider three problems that extend the utility of the multi-state perfect phylogeny model: (1) the Missing Data (MD) Problem, where some entries in the input are missing and the question is whether (bounded) values for the missing data can be imputed so that the resulting data has a multi-state perfect phylogeny; (2) the Character-Removal (CR) Problem, where we want to minimize the number of characters to remove from the data so that the resulting data has a multi-state perfect phylogeny; and (3) the Missing-Data Character-Removal (MDCR) Problem, where the input has missing data and we want to impute values for the missing data to minimize the solution to the resulting Character-Removal Problem. We discuss Integer Linear Programming (ILP) solutions to these problems for the special case of three, four, and five permitted states per character, and we report on extensive empirical testing of these solutions. Then we develop a general theory to solve the MD problem for an arbitrary number of permitted states, using chordal graph theory and results on minimal triangulation of non-chordal graphs. This establishes new necessary and sufficient conditions for the existence of a perfect phylogeny with (or without) missing data. We implement the general theory using integer linear programming, although other optimization methods are possible. We extensively explore the empirical behavior of the general solution, showing that the methods are very practical for data of size and complexity that is characteristic of many current applications in phylogenetics. Some of the empirical results for the MD problem with an arbitrary number of permitted states are very surprising, suggesting the existence of additional combinatorial structure in multi-state perfect phylogenies. Finally, we note some relationships between our chordal-graph approach to the multi-state perfect phylogeny, without missing data, and prior methods. © Copyright 2010, Mary Ann Liebert, Inc.", 
                "date": "2010-03-01T00:00:00Z", 
                "citationCount": 17, 
                "authors": [
                    {
                        "name": "Gusfield D."
                    }
                ], 
                "journal": "Journal of Computational Biology"
            }
        }
    ], 
    "credit": [
        {
            "name": "Dan Gusfield", 
            "email": "gusfield@cs.ucdavis.edu", 
            "url": "http://csiflabs.cs.ucdavis.edu/~gusfield/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T19:07:27Z", 
    "lastUpdate": "2018-12-10T12:58:55Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}