{
    "additionDate": "2021-03-19T08:37:15Z",
    "biotoolsCURIE": "biotools:biosaur",
    "biotoolsID": "biosaur",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "markmipt@gmail.com",
            "name": "Mark V. Ivanov",
            "orcidid": "https://orcid.org/0000-0003-4762-2846",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Biosaur is an open‐source Python software for liquid chromatography–mass spectrometry peptide feature detection with ion mobility support.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                }
            ]
        }
    ],
    "homepage": "https://github.com/abdrakhimov1/Biosaur",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-04-21T08:15:52Z",
    "license": "Apache-2.0",
    "name": "Biosaur",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1002/RCM.9045",
            "metadata": {
                "abstract": "© 2021 John Wiley & Sons LtdRATIONALE: One of the important steps in initial data processing of peptide mass spectra is the detection of peptide features in full-range mass spectra. Ion mobility offers advantages over previous methods performing this detection by providing an additional structure-specific separation dimension. However, there is a lack of open-source software that utilizes these advantages and detects peptide features in mass spectra acquired along with ion mobility data using new instruments such as timsTOF and/or FAIMS-Orbitrap. METHODS: Recently, a utility called Dinosaur was presented, which provides an efficient way for feature detection in peptide ion mass spectra. In this work we extended its functionality by developing Biosaur software to fully employ the additional information provided by ion mobility data. Biosaur was developed using the Python 3.8 programming language. RESULTS: Biosaur supports the processing of data acquired using mass spectrometers with ion mobility capabilities, specifically timsTOF and FAIMS. In addition, it processes mass spectra obtained in negative ion mode and reports cosine correlation table for peptide features which is useful for differentiation between in-source fragments and semi-tryptic peptides. CONCLUSIONS: Biosaur is a utility for detecting peptide features in liquid chromatography–mass spectra with ion mobility and negative ion supports. The software is distributed with an open-source APACHE 2.0 license and is freely available on Github: https://github.com/abdrakhimov1/Biosaur.",
                "authors": [
                    {
                        "name": "Abdrakhimov D.A."
                    },
                    {
                        "name": "Bubis J.A."
                    },
                    {
                        "name": "Gorshkov M.V."
                    },
                    {
                        "name": "Gorshkov V."
                    },
                    {
                        "name": "Ivanov M.V."
                    },
                    {
                        "name": "Kjeldsen F."
                    }
                ],
                "citationCount": 2,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Rapid Communications in Mass Spectrometry",
                "title": "Biosaur: An open-source Python software for liquid chromatography–mass spectrometry peptide feature detection with ion mobility support"
            },
            "pmid": "33450063"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
