{
    "additionDate": "2018-07-29T09:02:12Z",
    "biotoolsCURIE": "biotools:lme4qtl",
    "biotoolsID": "lme4qtl",
    "credit": [
        {
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/variani/lme4qtl/issues"
        }
    ],
    "description": "Linear mixed models with flexible covariance structure for genetic studies of related individuals.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/variani/lme4qtl"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression QTL analysis",
                    "uri": "http://edamontology.org/operation_3232"
                }
            ]
        }
    ],
    "homepage": "https://github.com/variani/lme4qtl",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "license": "GPL-3.0",
    "name": "lme4qtl",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s12859-018-2057-x",
            "metadata": {
                "abstract": "© 2018 The Author(s).Background: Quantitative trait locus (QTL) mapping in genetic data often involves analysis of correlated observations, which need to be accounted for to avoid false association signals. This is commonly performed by modeling such correlations as random effects in linear mixed models (LMMs). The R package lme4 is a well-established tool that implements major LMM features using sparse matrix methods; however, it is not fully adapted for QTL mapping association and linkage studies. In particular, two LMM features are lacking in the base version of lme4: the definition of random effects by custom covariance matrices; and parameter constraints, which are essential in advanced QTL models. Apart from applications in linkage studies of related individuals, such functionalities are of high interest for association studies in situations where multiple covariance matrices need to be modeled, a scenario not covered by many genome-wide association study (GWAS) software. Results: To address the aforementioned limitations, we developed a new R package lme4qtl as an extension of lme4. First, lme4qtl contributes new models for genetic studies within a single tool integrated with lme4 and its companion packages. Second, lme4qtl offers a flexible framework for scenarios with multiple levels of relatedness and becomes efficient when covariance matrices are sparse. We showed the value of our package using real family-based data in the Genetic Analysis of Idiopathic Thrombophilia 2 (GAIT2) project. Conclusions: Our software lme4qtl enables QTL mapping models with a versatile structure of random effects and efficient computation for sparse covariances. lme4qtl is available at https://github.com/variani/lme4qtl.",
                "authors": [
                    {
                        "name": "Ziyatdinov A."
                    },
                    {
                        "name": "Vazquez-Santiago M."
                    },
                    {
                        "name": "Brunel H."
                    },
                    {
                        "name": "Martinez-Perez A."
                    },
                    {
                        "name": "Aschard H."
                    },
                    {
                        "name": "Soria J.M."
                    }
                ],
                "citationCount": 28,
                "date": "2018-02-27T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "lme4qtl: Linear mixed models with flexible covariance structure for genetic studies of related individuals"
            },
            "pmcid": "PMC5830078",
            "pmid": "29486711"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Molecular genetics",
            "uri": "http://edamontology.org/topic_3321"
        }
    ],
    "validated": 1
}