{
    "additionDate": "2021-01-18T08:40:24Z",
    "biotoolsCURIE": "biotools:srprism",
    "biotoolsID": "srprism",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "agarwala@ncbi.nlm.nih.gov",
            "name": "Richa Agarwala",
            "orcidid": "https://orcid.org/0000-0002-5518-9723",
            "typeEntity": "Person"
        }
    ],
    "description": "SRPRISM - Single Read Paired Read Indel Substitution Minimizer.",
    "download": [
        {
            "type": "Binaries",
            "url": "ftp://ftp.ncbi.nlm.nih.gov/pub/agarwala/srprism"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome indexing",
                    "uri": "http://edamontology.org/operation_3211"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ncbi/SRPRISM",
    "language": [
        "C++"
    ],
    "lastUpdate": "2021-02-21T15:23:45Z",
    "name": "SRPRISM",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/GIGASCIENCE/GIAA023",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. This work is written by US Government employees and is in the public domain in the US.Background: Alignment of sequence reads generated by next-generation sequencing is an integral part of most pipelines analyzing next-generation sequencing data. A number of tools designed to quickly align a large volume of sequences are already available. However, most existing tools lack explicit guarantees about their output. They also do not support searching genome assemblies, such as the human genome assembly GRCh38, that include primary and alternate sequences and placement information for alternate sequences to primary sequences in the assembly. Findings: This paper describes SRPRISM (Single Read Paired Read Indel Substitution Minimizer), an alignment tool for aligning reads without splices. SRPRISM has features not available in most tools, such as (i) support for searching genome assemblies with alternate sequences, (ii) partial alignment of reads with a specified region of reads to be included in the alignment, (iii) choice of ranking schemes for alignments, and (iv) explicit criteria for search sensitivity. We compare the performance of SRPRISM to GEM, Kart, STAR, BWA-MEM, Bowtie2, Hobbes, and Yara using benchmark sets for paired and single reads of lengths 100 and 250 bp generated using DWGSIM. SRPRISM found the best results for most benchmark sets with error rate of up to ∼2.5% and GEM performed best for higher error rates. SRPRISM was also more sensitive than other tools even when sensitivity was reduced to improve run time performance. Conclusions: We present SRPRISM as a flexible read mapping tool that provides explicit guarantees on results.",
                "authors": [
                    {
                        "name": "Agarwala R."
                    },
                    {
                        "name": "Morgulis A."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "GigaScience",
                "title": "SRPRISM (Single Read Paired Read Indel Substitution Minimizer): an efficient aligner for assemblies with explicit guarantees"
            },
            "pmcid": "PMC7172022",
            "pmid": "32315028"
        }
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
