{
    "additionDate": "2017-08-20T15:59:16Z",
    "biotoolsCURIE": "biotools:unccombo",
    "biotoolsID": "unccombo",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "email": "songyan@unc.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Perform single marker association testing on raw next generation sequencing data. It allows for flexible covariates adjustment and does not require genotype calling. Provides a likelihood ratio test (LRT), score test and a combination of the two.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.unc.edu/~yunmli/UNCcombo/tutorial.php"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "https://yunliweb.its.unc.edu/UNCcombo/",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-01-19T17:47:47Z",
    "license": "Not licensed",
    "name": "UNCcombo",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btv307",
            "metadata": {
                "abstract": "© 2015 The Author.In next generation sequencing (NGS)-based genetic studies, researchers typically perform genotype calling first and then apply standard genotype-based methods for association testing. However, such a two-step approach ignores genotype calling uncertainty in the association testing step and may incur power loss and/or inflated type-I error. In the recent literature, a few robust and efficient likelihood based methods including both likelihood ratio test (LRT) and score test have been proposed to carry out association testing without intermediate genotype calling. These methods take genotype calling uncertainty into account by directly incorporating genotype likelihood function (GLF) of NGS data into association analysis. However, existing LRT methods are computationally demanding or do not allow covariate adjustment; while existing score tests are not applicable to markers with low minor allele frequency (MAF). We provide an LRT allowing flexible covariate adjustment, develop a statistically more powerful score test and propose a combination strategy (UNC combo) to leverage the advantages of both tests. We have carried out extensive simulations to evaluate the performance of our proposed LRT and score test. Simulations and real data analysis demonstrate the advantages of our proposed combination strategy: it offers a satisfactory trade-off in terms of computational efficiency, applicability (accommodating both common variants and variants with low MAF) and statistical power, particularly for the analysis of quantitative trait where the power gain can be up to ∼60% when the causal variant is of low frequency (MAF < 0.01).",
                "authors": [
                    {
                        "name": "Byrnes A."
                    },
                    {
                        "name": "Kang G."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Xu Z."
                    },
                    {
                        "name": "Yan S."
                    },
                    {
                        "name": "Yuan S."
                    },
                    {
                        "name": "Zhang B."
                    },
                    {
                        "name": "Zhang B."
                    }
                ],
                "date": "2015-07-31T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Likelihood-based complex trait association testing for arbitrary depth sequencing data"
            },
            "pmcid": "PMC4668777",
            "pmid": "25979475",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Plug-in"
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
