{
    "accessibility": "Open access",
    "additionDate": "2020-01-14T20:05:02Z",
    "biotoolsCURIE": "biotools:ILMF-VH",
    "biotoolsID": "ILMF-VH",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "xpjiang@mail.ccnu.edu.cn",
            "name": "Xingpeng Jiang",
            "typeEntity": "Person"
        },
        {
            "email": "tthe@mail.ccnu.edu.cn",
            "name": "Tingting He",
            "typeEntity": "Person"
        }
    ],
    "description": "Predicting virus-host association by Kernelized logistic matrix factorization and similarity network fusion.\n\nKernelized Logistic Matrix Factorization based on Similarity Network Fusion for Predicting Virus-host Association.\n\nXingpeng Jiang, xpjiang@mail.ccnu.edu.cn Dan Liu, liudan@mails.ccnu.edu.cn.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "https://github.com/liudan111/ILMF-VH.git",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-14T09:00:41Z",
    "name": "ILMF-VH",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3082-0",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Viruses are closely related to bacteria and human diseases. It is of great significance to predict associations between viruses and hosts for understanding the dynamics and complex functional networks in microbial community. With the rapid development of the metagenomics sequencing, some methods based on sequence similarity and genomic homology have been used to predict associations between viruses and hosts. However, the known virus-host association network was ignored in these methods. Results: We proposed a kernelized logistic matrix factorization with integrating different information to predict potential virus-host associations on the heterogeneous network (ILMF-VH) which is constructed by connecting a virus network with a host network based on known virus-host associations. The virus network is constructed based on oligonucleotide frequency measurement, and the host network is constructed by integrating oligonucleotide frequency similarity and Gaussian interaction profile kernel similarity through similarity network fusion. The host prediction accuracy of our method is better than other methods. In addition, case studies show that the host of crAssphage predicted by ILMF-VH is consistent with presumed host in previous studies, and another potential host Escherichia coli is also predicted. Conclusions: The proposed model is an effective computational tool for predicting interactions between viruses and hosts effectively, and it has great potential for discovering novel hosts of viruses.",
                "authors": [
                    {
                        "name": "Liu D."
                    },
                    {
                        "name": "Ma Y."
                    },
                    {
                        "name": "Jiang X."
                    },
                    {
                        "name": "He T."
                    }
                ],
                "citationCount": 2,
                "date": "2019-12-02T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Predicting virus-host association by Kernelized logistic matrix factorization and similarity network fusion"
            },
            "pmcid": "PMC6886165",
            "pmid": "31787095"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        },
        {
            "term": "Metagenomic sequencing",
            "uri": "http://edamontology.org/topic_3837"
        }
    ],
    "validated": 1
}