{
    "additionDate": "2020-01-14T09:11:30Z",
    "biotoolsCURIE": "biotools:SAME-clustering",
    "biotoolsID": "SAME-clustering",
    "confidence_flag": "tool",
    "description": "Single-cell Aggregated Clustering via Mixture Model Ensemble.\n\nSAME (Single-cell RNA-seq Aggregated clustering via Mixture model Ensemble): Cluster ensemble for single-cell RNA-seq data.\n\nSAMEclustering (Single-cell RNA-seq Aggregated clustering via Mixture model Ensemble): Cluster ensemble for single-cell RNA-seq data.\n\nAlthough several methods have been recently developed to cluster single-cell RNA-seq (scRNA-Seq) data, they utilize different characteristics of data and yield varying results in terms of both the number of clusters and actual cluster assignments",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/yycunc/SAMEclustering",
    "language": [
        "C++",
        "R"
    ],
    "lastUpdate": "2020-12-16T10:32:32Z",
    "name": "SAME-clustering",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/NAR/GKZ959",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press on behalf of Nucleic Acids Research.Clustering is an essential step in the analysis of single cell RNA-seq (scRNA-seq) data to shed light on tissue complexity including the number of cell types and transcriptomic signatures of each cell type. Due to its importance, novel methods have been developed recently for this purpose. However, different approaches generate varying estimates regarding the number of clusters and the single-cell level cluster assignments. This type of unsupervised clustering is challenging and it is often times hard to gauge which method to use because none of the existing methods outperform others across all scenarios. We present SAME-clustering, a mixture model-based approach that takes clustering solutions from multiple methods and selects a maximally diverse subset to produce an improved ensemble solution. We tested SAME-clustering across 15 scRNA-seq datasets generated by different platforms, with number of clusters varying from 3 to 15, and number of single cells from 49 to 32 695. Results show that our SAME-clustering ensemble method yields enhanced clustering, in terms of both cluster assignments and number of clusters. The mixture model ensemble clustering is not limited to clustering scRNA-seq data and may be useful to a wide range of clustering applications.",
                "authors": [
                    {
                        "name": "Huh R."
                    },
                    {
                        "name": "Jiang Y."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Shen Y."
                    },
                    {
                        "name": "Yang Y."
                    }
                ],
                "citationCount": 12,
                "date": "2020-01-10T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "SAME-clustering: Single-cell Aggregated Clustering via Mixture Model Ensemble"
            },
            "pmid": "31777938"
        }
    ],
    "topic": [
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
