{
    "additionDate": "2022-11-03T07:55:46.644842Z",
    "biotoolsCURIE": "biotools:fcccsr_glu",
    "biotoolsID": "fcccsr_glu",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Chen_chen@dlmu.edu.cn",
            "name": "Chen Chen",
            "typeEntity": "Person"
        },
        {
            "email": "ningq669@dlmu.edu.cn",
            "name": "Qiao Ning",
            "typeEntity": "Person"
        }
    ],
    "description": "A semi-supervised learning model based on FCCCSR algorithm for prediction of glutarylation sites.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "PTM localisation",
                    "uri": "http://edamontology.org/operation_3755"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                }
            ]
        }
    ],
    "homepage": "https://github.com/xbbxhbc/FCCCSR_Glu.git",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:23:58.841900Z",
    "license": "Not licensed",
    "name": "FCCCSR_Glu",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/bib/bbac421",
            "metadata": {
                "abstract": "Glutarylation is a post-translational modification which plays an irreplaceable role in various functions of the cell. Therefore, it is very important to accurately identify the glutarylation substrates and its corresponding glutarylation sites. In recent years, many computational methods of glutarylation sites have emerged one after another, but there are still many limitations, among which noisy data and the class imbalance problem caused by the uncertainty of non-glutarylation sites are great challenges. In this study, we propose a new semi-supervised learning algorithm, named FCCCSR, to identify reliable non-glutarylation lysine sites from unlabeled samples as negative samples. FCCCSR first finds core objects from positive samples according to reverse nearest neighbor information, and then clusters core objects based on natural neighbor structure. Finally, reliable negative samples are selected according to clustering result. With FCCCSR algorithm, we propose a new method named FCCCSR_Glu for glutarylation sites identification. In this study, multi-view features are extracted and fused to describe peptides, including amino acid composition, BLOSUM62, amino acid factors and composition of k-spaced amino acid pairs. Then, reliable negative samples selected by FCCCSR and positive samples are combined to establish models and XGBoost optimized by differential evolution algorithm is used as the classifier. On the independent testing dataset, FCCCSR_Glu achieves 85.18%, 98.36%, 94.31% and 0.8651 in sensitivity, specificity, accuracy and Matthew’s Correlation Coefficient, respectively, which is superior to state-of-the-art methods in predicting glutarylation sites. Therefore, FCCCSR_Glu can be a useful tool for glutarylation sites prediction and FCCCSR algorithm can effectively select reliable negative samples from unlabeled samples. The data and code are available on https://github.com/xbbxhbc/FCCCSR_Glu.git",
                "authors": [
                    {
                        "name": "Chen C."
                    },
                    {
                        "name": "Deng A."
                    },
                    {
                        "name": "Ning Q."
                    },
                    {
                        "name": "Qi Z."
                    },
                    {
                        "name": "Wang Y."
                    }
                ],
                "citationCount": 4,
                "date": "2022-11-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "FCCCSR_Glu: a semi-supervised learning model based on FCCCSR algorithm for prediction of glutarylation sites"
            },
            "pmid": "36168700"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
