{
    "accessibility": [],
    "additionDate": "2017-03-24T09:33:55Z",
    "biotoolsCURIE": "biotools:seqvista",
    "biotoolsID": "seqvista",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": "zjhu@bu.edu",
            "gridid": null,
            "name": "Zhenjun Hu",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        },
        {
            "email": "mfrith@bu.edu",
            "gridid": null,
            "name": "Martin Frith",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        },
        {
            "email": "niu@bioinfo.stat.harvard.edu",
            "gridid": null,
            "name": "Tianhua Niu",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        },
        {
            "email": "zhiping@bu.edu",
            "gridid": null,
            "name": "Zhiping Weng",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        }
    ],
    "description": "Tool for sequence feature visualization and comparison; integrates with Internet Explorer;  accepts GenBank Flat Files, GenBank HTML, FASTA files; plugins exist for visualization of output from RepeatMasker, PsiPred, and Cister.",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "https://zlab.bu.edu/SeqVISTA/tutorials/index.htm"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Sequence feature detection",
                    "uri": "http://edamontology.org/operation_0253"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                },
                {
                    "term": "Sequence feature comparison",
                    "uri": "http://edamontology.org/operation_0256"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://zlab.bu.edu/SeqVISTA/",
    "homepage_status": 0,
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:53Z",
    "license": null,
    "link": [],
    "maturity": null,
    "name": "SeqVISTA",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": null,
            "metadata": {
                "abstract": "Background: Many readers will sympathize with the following story. You are viewing a gene sequence in Entrez, and you want to find whether it contains a particular sequence motif. You reach for the browser's \"find in page\" button, but those darn spaces every 10 bp get in the way. And what if the motif is on the opposite strand? Subsequently, your favorite sequence analysis software informs you that there is an interesting feature at position 13982-14013. By painstakingly counting the 10 bp blocks, you are able to examine the sequence at this location. But now you want to see what other features have been annotated close by, and this information is buried several screenfuls higher up the web page. Results: SeqVISTA presents a holistic, graphical view of features annotated on nucleotide or protein sequences. This interactive tool highlights the residues in the sequence that correspond to features chosen by the user, and allows easy searching for sequence motifs or extraction of particular subsequences. SeqVISTA is able to display results from diverse sequence analysis tools in an integrated fashion, and aims to provide much-needed unity to the bioinformatics resources scattered around the Internet. Our viewer may be launched on a GenBank record by a single click of a button installed in the web browser. Conclusion: SeqVISTA allows insights to be gained by viewing the totality of sequence annotations and predictions, which may be more revealing than the sum of their parts. SeqVISTA runs on any operating system with a Java 1.4 virtual machine. It is freely available to academic users at © 2003 Hu et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Hu Z."
                    },
                    {
                        "name": "Frith M."
                    },
                    {
                        "name": "Niu T."
                    },
                    {
                        "name": "Weng Z."
                    }
                ],
                "citationCount": 29,
                "date": "2003-01-04T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SeqVISTA: A graphical tool for sequence feature visualization and comparison"
            },
            "note": null,
            "pmcid": null,
            "pmid": "12513700",
            "type": null,
            "version": null
        },
        {
            "doi": null,
            "metadata": {
                "abstract": "Transcriptional regulation is one of the most basic regulatory mechanisms in the cell. The accumulation of multiple metazoan genome sequences and the advent of high-throughput experimental techniques have motivated the development of a large number of bioinformatics methods for the detection of regulatory motifs. The regulatory process is extremely complex and individual computational algorithms typically have very limited success in genome-scale studies. Here, we argue the importance of integrating multiple computational algorithms and present an infrastructure that integrates eight web services covering key areas of transcriptional regulation. We have adopted the client-side integration technology and built a consistent input and output environment with a versatile visualization tool named SeqVISTA. The infrastructure will allow for easy integration of gene regulation analysis software that is scattered over the Internet. It will also enable bench biologists to perform an arsenal of analysis using cutting-edge methods in a familiar environment and bioinformatics researchers to focus on developing new algorithms without the need to invest substantial effort on complex pre- or post-processors. SeqVISTA is freely available to academic users and can be launched online at http://zlab.bu.edu/SeqVISTA/web.jnlp, provided that Java Web Start has been installed. In addition, a stand-alone version of the program can be downloaded and run locally. It can be obtained at http://zlab.bu.edu/SeqVISTA. © Oxford University Press 2004; all rights reserved.",
                "authors": [
                    {
                        "name": "Hu Z."
                    },
                    {
                        "name": "Fu Y."
                    },
                    {
                        "name": "Halees A.S."
                    },
                    {
                        "name": "Kielbasa S.M."
                    },
                    {
                        "name": "Weng Z."
                    }
                ],
                "citationCount": 6,
                "date": "2004-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "SeqVISTA: A new module of integrated computational tools for studying transcriptional regulation"
            },
            "note": null,
            "pmcid": null,
            "pmid": "15215387",
            "type": null,
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Protein sites, features and motifs",
            "uri": "http://edamontology.org/topic_3510"
        }
    ],
    "validated": 1,
    "version": []
}