{
    "accessibility": [],
    "additionDate": "2017-12-18T00:06:39Z",
    "biotoolsCURIE": "biotools:gam-ngs",
    "biotoolsID": "gam-ngs",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": null,
            "gridid": null,
            "name": null,
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://sole.dimi.uniud.it/~riccardo.vicedomini/"
        }
    ],
    "description": "GAM-NGS is able to merge two or more assemblies and it rteturns an improved assembly (more contiguous and more correct). GAM-NGS shows its full potential with multi-library Illumina-based projects.",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "https://github.com/vice87/gam-ngs"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ],
            "output": []
        },
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Generation",
                    "uri": "http://edamontology.org/operation_3429"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://www.csc.kth.se/~vezzi/software/",
    "homepage_status": 0,
    "language": [],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "license": null,
    "link": [
        {
            "note": null,
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/gam-ngs-genome-assemblies-merger-generation-sequencing.html"
        }
    ],
    "maturity": null,
    "name": "GAM-NGS",
    "operatingSystem": [
        "Linux"
    ],
    "otherID": [],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-14-S7-S6",
            "metadata": {
                "abstract": "Background: In recent years more than 20 assemblers have been proposed to tackle the hard task of assembling NGS data. A common heuristic when assembling a genome is to use several assemblers and then select the best assembly according to some criteria. However, recent results clearly show that some assemblers lead to better statistics than others on specific regions but are outperformed on other regions or on different evaluation measures. To limit these problems we developed GAM-NGS (Genomic Assemblies Merger for Next Generation Sequencing), whose primary goal is to merge two or more assemblies in order to enhance contiguity and correctness of both. GAM-NGS does not rely on global alignment: regions of the two assemblies representing the same genomic locus (called blocks) are identified through reads' alignments and stored in a weighted graph. The merging phase is carried out with the help of this weighted graph that allows an optimal resolution of local problematic regions.Results: GAM-NGS has been tested on six different datasets and compared to other assembly reconciliation tools. The availability of a reference sequence for three of them allowed us to show how GAM-NGS is a tool able to output an improved reliable set of sequences. GAM-NGS is also a very efficient tool able to merge assemblies using substantially less computational resources than comparable tools. In order to achieve such goals, GAM-NGS avoids global alignment between contigs, making its strategy unique among other assembly reconciliation tools.Conclusions: The difficulty to obtain correct and reliable assemblies using a single assembler is forcing the introduction of new algorithms able to enhance de novo assemblies. GAM-NGS is a tool able to merge two or more assemblies in order to improve contiguity and correctness. It can be used on all NGS-based assembly projects and it shows its full potential with multi-library Illumina-based projects. With more than 20 available assemblers it is hard to select the best tool. In this context we propose a tool that improves assemblies (and, as a by-product, perhaps even assemblers) by merging them and selecting the generating that is most likely to be correct. © 2013 Vicedomini et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Vicedomini R."
                    },
                    {
                        "name": "Vezzi F."
                    },
                    {
                        "name": "Scalabrin S."
                    },
                    {
                        "name": "Arvestad L."
                    },
                    {
                        "name": "Policriti A."
                    }
                ],
                "citationCount": 38,
                "date": "2013-04-22T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "GAM-NGS: Genomic assemblies merger for next generation sequencing"
            },
            "note": null,
            "pmcid": null,
            "pmid": null,
            "type": "Primary",
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "NGS",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Next generation sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1,
    "version": [
        "1.1b"
    ]
}