
{
    "credit": [
        {
            "name": "GenOuest",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "support@genouest.org",
            "name": "GenOuest",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.genouest.org"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://training.genouest.org/claroline/claroline/learnPath/learningPathList.php?cidReset=true&cidReq=LOGOL"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence motif",
                        "uri": "http://edamontology.org/data_1353"
                    },
                    "format": [
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Sequence",
                        "uri": "http://edamontology.org/data_2044"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "note": "Pattern searching in nucleic or protein sequences",
            "operation": [
                {
                    "term": "Sequence database search",
                    "uri": "http://edamontology.org/operation_0338"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Sequence signature matches",
                        "uri": "http://edamontology.org/data_0858"
                    },
                    "format": [
                        {
                            "term": "XML",
                            "uri": "http://edamontology.org/format_2332"
                        }
                    ]
                }
            ]
        }
    ],
    "labels": {
        "cost": "Free of charge",
        "license": "CECILL-2.0",
        "maturity": "Emerging",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Web application"
        ],
        "topic": [
            {
                "term": "Sequence sites, features and motifs",
                "uri": "http://edamontology.org/topic_0160"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Most of the current practice of pattern matching tools is oriented towards finding efficient ways to compare sequences. This is useful but insufficient: as the knowledge and understanding of some functional or structural aspects of living systems improve, analysts in molecular biology progressively shift from mere classification tasks to modeling tasks. People need to be able to express global sequence architectures and check various hypotheses on the way their sequences are structured. It appears necessary to offer generic tools for this task, allowing to build more expressive models of biological sequence families, on the basis of their content and structure. This article introduces Logol, a new application designed to achieve pattern matching in possibly large sequences with customized biological patterns. Logol consists in both a language for describing patterns, and the associated parser for effective pattern search in sequences (RNA, DNA or protein) with such patterns. The Logol language, based on an high level grammatical formalism, allows to express flexible patterns (with mispairings and indels) composed of both sequential elements (such as motifs) and structural elements (such as repeats or pseudoknots). Its expressive power is presented through an application using the main components of the language: the identification of -1 programmed ribosomal frameshifting (PRF) events in messenger RNA sequences. Logol allows the design of sophisticated patterns, and their search in large nucleic or amino acid sequences. It is available on the GenOuest bioinformatics platform at http://logol.genouest.org. The core application is a command-line application, available for different operating systems. The Logol suite also includes interfaces, e.g. an interface for graphically drawing the pattern. © 2014 Springer International Publishing Switzerland.",
            "authors": [
                "Belleannee C.",
                "Sallou O.",
                "Nicolas J."
            ],
            "cit_count": 1,
            "doi": "10.1007/978-3-319-09192-1_4",
            "journal": "Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics)",
            "title": "Logol: Expressive pattern matching in sequences. Application to ribosomal frameshift modeling",
            "type": "Primary",
            "year": "2014-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:logol",
        "biotoolsID": "logol",
        "description": "Pattern matching grammar language and a set of tools to search a pattern in a sequence (nucleic or proteic).",
        "homepage": "http://logol.genouest.org",
        "name": "Logol",
        "version": [
            "1.7.0"
        ]
    }
}