{
    "additionDate": "2018-05-18T14:33:25Z",
    "biotoolsCURIE": "biotools:ensembler",
    "biotoolsID": "ensembler",
    "credit": [
        {
            "email": "daniel.parton@choderalab.org",
            "name": "Daniel L. Parton",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "john.chodera@choderalab.org",
            "name": "John D. Chodera",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "patrick.grinaway@choderalab.org",
            "name": "Patrick B. Grinaway",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Enabling High-Throughput Molecular Simulations at the Superfamily Scale.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/choderalab/ensembler"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                }
            ]
        }
    ],
    "homepage": "https://github.com/choderalab/ensembler",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "license": "GPL-2.0",
    "name": "Ensembler",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1004728",
            "metadata": {
                "abstract": "© 2016 Parton et al.The rapidly expanding body of available genomic and protein structural data provides a rich resource for understanding protein dynamics with biomolecular simulation. While computational infrastructure has grown rapidly, simulations on an omics scale are not yet widespread, primarily because software infrastructure to enable simulations at this scale has not kept pace. It should now be possible to study protein dynamics across entire (super)families, exploiting both available structural biology data and conformational similarities across homologous proteins. Here, we present a new tool for enabling high-throughput simulation in the genomics era. Ensembler takes any set of sequences—from a single sequence to an entire superfamily—and shepherds them through various stages of modeling and refinement to produce simulation-ready structures. This includes comparative modeling to all relevant PDB structures (which may span multiple conformational states of interest), reconstruction of missing loops, addition of missing atoms, culling of nearly identical structures, assignment of appropriate protonation states, solvation in explicit solvent, and refinement and filtering with molecular simulation to ensure stable simulation. The output of this pipeline is an ensemble of structures ready for subsequent molecular simulations using computer clusters, supercomputers, or distributed computing projects like Folding@home. Ensembler thus automates much of the time-consuming process of preparing protein models suitable for simulation, while allowing scalability up to entire superfamilies. A particular advantage of this approach can be found in the construction of kinetic models of conformational dynamics—such as Markov state models (MSMs)—which benefit from a diverse array of initial configurations that span the accessible conformational states to aid sampling. We demonstrate the power of this approach by constructing models for all catalytic domains in the human tyrosine kinase family, using all available kinase catalytic domain structures from any organism as structural templates. Ensembler is free and open source software licensed under the GNU General Public License (GPL) v2. It is compatible with Linux and OS X. The latest release can be installed via the conda package manager, and the latest source can be downloaded from https://github.com/choderalab/ensembler.",
                "authors": [
                    {
                        "name": "Beauchamp K.A."
                    },
                    {
                        "name": "Chodera J.D."
                    },
                    {
                        "name": "Grinaway P.B."
                    },
                    {
                        "name": "Hanson S.M."
                    },
                    {
                        "name": "Parton D.L."
                    }
                ],
                "citationCount": 10,
                "date": "2016-06-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Ensembler: Enabling High-Throughput Molecular Simulations at the Superfamily Scale"
            },
            "pmcid": "PMC4918922",
            "pmid": "27337644"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Medicines research and development",
            "uri": "http://edamontology.org/topic_3376"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Simulation experiment",
            "uri": "http://edamontology.org/topic_3524"
        }
    ],
    "validated": 1
}
