{
    "additionDate": "2017-08-03T18:35:29Z",
    "biotoolsCURIE": "biotools:abm-tki",
    "biotoolsID": "abm-tki",
    "credit": [
        {
            "email": "xsun@tmhs.org",
            "name": "Xiaoqiang Sun",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.wakehealth.edu/CTSB/"
        }
    ],
    "description": "Employing agent-based model (ABM) tool to simulate brain tumor growth that includes an EGFR signaling pathway together with a related cell-cycle pathway, angiogenesis and tyrosine kinase inhibitors (TKIs) treatment. The users can apply this tool to predict the responses of brain cancer to TKIs, and to reveal the dual role of angiogenesis during TKI treatment.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://sites.google.com/site/agentbasedtumormodeling/home/multi-scale1"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "https://sites.google.com/site/agentbasedtumormodeling/home",
    "lastUpdate": "2018-12-10T12:58:54Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/abm-tki-0-11-multi-scale-agent-based-brain-tumor-modeling.html"
        }
    ],
    "name": "ABM-TKI",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: The epidermal growth factor receptor (EGFR) signaling pathway and angiogenesis in brain cancer act as an engine for tumor initiation, expansion and response to therapy. Since the existing literature does not have any models that investigate the impact of both angiogenesis and molecular signaling pathways on treatment, we propose a novel multi-scale, agent-based computational model that includes both angiogenesis and EGFR modules to study the response of brain cancer under tyrosine kinase inhibitors (TKIs) treatment.Results: The novel angiogenesis module integrated into the agent-based tumor model is based on a set of reaction-diffusion equations that describe the spatio-temporal evolution of the distributions of micro-environmental factors such as glucose, oxygen, TGFα, VEGF and fibronectin. These molecular species regulate tumor growth during angiogenesis. Each tumor cell is equipped with an EGFR signaling pathway linked to a cell-cycle pathway to determine its phenotype. EGFR TKIs are delivered through the blood vessels of tumor microvasculature and the response to treatment is studied.Conclusions: Our simulations demonstrated that entire tumor growth profile is a collective behaviour of cells regulated by the EGFR signaling pathway and the cell cycle. We also found that angiogenesis has a dual effect under TKI treatment: on one hand, through neo-vasculature TKIs are delivered to decrease tumor invasion; on the other hand, the neo-vasculature can transport glucose and oxygen to tumor cells to maintain their metabolism, which results in an increase of cell survival rate in the late simulation stages. © 2012 Sun et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Sun X."
                    },
                    {
                        "name": "Zhang L."
                    },
                    {
                        "name": "Tan H."
                    },
                    {
                        "name": "Bao J."
                    },
                    {
                        "name": "Strouthos C."
                    },
                    {
                        "name": "Zhou X."
                    }
                ],
                "citationCount": 29,
                "date": "2012-08-30T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Multi-scale agent-based brain cancer modeling and prediction of TKI treatment response: Incorporating EGFR signaling pathway and angiogenesis"
            },
            "pmid": "22935054"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}