{
    "additionDate": "2021-01-18T10:36:11Z",
    "biotoolsCURIE": "biotools:rescan",
    "biotoolsID": "rescan",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mclaugr@tcd.ie",
            "name": "Russell Lewis McLaughlin",
            "typeEntity": "Person"
        }
    ],
    "description": "inferring repeat expansions and structural variation in paired-end short read sequencing data.\n\ngit clone https://github.com/rlmcl/rescan.\n\nAs well as controlling data flow into REscan using SAMtools (see Feed it only the data it needs under Caveats and features, below), you have three options for specifying regions for REscan output:.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://github.com/rlmcl/rescan",
    "language": [
        "C"
    ],
    "lastUpdate": "2021-02-06T13:24:52Z",
    "license": "GPL-3.0",
    "name": "REscan",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA753",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press.Motivation: Repeat expansions are an important class of genetic variation in neurological diseases. However, the identification of novel repeat expansions using conventional sequencing methods is a challenge due to their typical lengths relative to short sequence reads and difficulty in producing accurate and unique alignments for repetitive sequence. However, this latter property can be harnessed in paired-end sequencing data to infer the possible locations of repeat expansions and other structural variation. Results: This article presents REscan, a command-line utility that infers repeat expansion loci from paired-end short read sequencing data by reporting the proportion of reads orientated towards a locus that do not have an adequately mapped mate. A high REscan statistic relative to a population of data suggests a repeat expansion locus for experimental follow-up. This approach is validated using genome sequence data for 259 cases of amyotrophic lateral sclerosis, of which 24 are positive for a large repeat expansion in C9orf72, showing that REscan statistics readily discriminate repeat expansion carriers from non-carriers. Availabilityand implementation: C source code at https://github.com/rlmcl/rescan (GNU General Public Licence v3).",
                "authors": [
                    {
                        "name": "McLaughlin R.L."
                    }
                ],
                "date": "2021-03-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "REscan: Inferring repeat expansions and structural variation in paired-end short read sequencing data"
            },
            "pmid": "32845284"
        }
    ],
    "topic": [
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        },
        {
            "term": "DNA structural variation",
            "uri": "http://edamontology.org/topic_3175"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ]
}