{
    "additionDate": "2023-01-28T14:49:32.845722Z",
    "biotoolsCURIE": "biotools:health_gym",
    "biotoolsID": "health_gym",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "n.kuo@unsw.edu.au",
            "name": "Nicholas I-Hsien Kuo",
            "typeEntity": "Person"
        }
    ],
    "description": "A growing collection of highly realistic synthetic medical datasets that can be freely accessed to prototype, evaluate, and compare machine learning algorithms, with a specific focus on reinforcement learning.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Nic5472K/ScientificData2021_HealthGym",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-01-28T14:49:32.848249Z",
    "license": "MIT",
    "name": "Health Gym",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1038/S41597-022-01784-7",
            "metadata": {
                "abstract": "© 2022, The Author(s).In recent years, the machine learning research community has benefited tremendously from the availability of openly accessible benchmark datasets. Clinical data are usually not openly available due to their confidential nature. This has hampered the development of reproducible and generalisable machine learning applications in health care. Here we introduce the Health Gym - a growing collection of highly realistic synthetic medical datasets that can be freely accessed to prototype, evaluate, and compare machine learning algorithms, with a specific focus on reinforcement learning. The three synthetic datasets described in this paper present patient cohorts with acute hypotension and sepsis in the intensive care unit, and people with human immunodeficiency virus (HIV) receiving antiretroviral therapy. The datasets were created using a novel generative adversarial network (GAN). The distributions of variables, and correlations between variables and trends in variables over time in the synthetic datasets mirror those in the real datasets. Furthermore, the risk of sensitive information disclosure associated with the public distribution of the synthetic datasets is estimated to be very low.",
                "authors": [
                    {
                        "name": "Barbieri S."
                    },
                    {
                        "name": "Bohm M."
                    },
                    {
                        "name": "Finfer S."
                    },
                    {
                        "name": "Garcia F."
                    },
                    {
                        "name": "Jorm L."
                    },
                    {
                        "name": "Kaiser R."
                    },
                    {
                        "name": "Kuo N.I.-H."
                    },
                    {
                        "name": "Polizzotto M.N."
                    },
                    {
                        "name": "Sonnerborg A."
                    },
                    {
                        "name": "Zazzi M."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "Scientific Data",
                "title": "The Health Gym: synthetic health-related datasets for the development of reinforcement learning algorithms"
            },
            "pmcid": "PMC9652426",
            "pmid": "36369205"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Critical care medicine",
            "uri": "http://edamontology.org/topic_3403"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ]
}
