{
    "accessibility": "Open access",
    "additionDate": "2017-01-11T12:47:54Z",
    "biotoolsCURIE": "biotools:bdbm",
    "biotoolsID": "bdbm",
    "collectionID": [
        "BLAST utility"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Molecular Evolution Group (IBMC)",
            "typeRole": [
                "Contributor"
            ],
            "url": "http://evolution.ibmc.up.pt/"
        },
        {
            "name": "SING Research Group",
            "typeRole": [
                "Developer"
            ],
            "url": "http://www.sing-group.org"
        },
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.sing-group.org/BDBM/about.html"
        }
    ],
    "description": "Graphical user interface that allows you to create high quality sequence datasets using the tools included. Using these tools you can perform several common tasks such as doing BLAST alignments, getting the open reading frames of the sequences in a Fasta file or changing the format of a Fasta file. All these task make use of several known tools such as EMBOSS, bedtools, and NCBI's BLAST, Splign and Compart.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.sing-group.org/BDBM/manual.html"
        },
        {
            "type": [
                "Training material"
            ],
            "url": "http://www.sing-group.org/BDBM/usecases.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/sing-group/BDBM/"
        },
        {
            "type": "Binaries",
            "url": "http://www.sing-group.org/BDBM/download.html"
        }
    ],
    "editPermission": {
        "authors": [
            "jbvieira"
        ],
        "type": "group"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Database search results",
                        "uri": "http://edamontology.org/data_2080"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://www.sing-group.org/BDBM",
    "language": [
        "Java"
    ],
    "lastUpdate": "2020-06-16T10:55:24Z",
    "license": "GPL-3.0",
    "maturity": "Emerging",
    "name": "BLAST DataBase Manager",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "hlfernandez@uvigo.es",
    "publication": [
        {
            "doi": "10.1007/s12539-019-00320-3",
            "metadata": {
                "abstract": "© 2019, International Association of Scientists in the Interdisciplinary Areas.Nowadays, bioinformatics is one of the most important areas in modern biology and the creation of high-quality scientific software supporting this recent research area is one of the core activities of many researchers. In this context, high-quality sequence datasets are needed to perform inferences on the evolution of species, genes, and gene families, or to get evidence for adaptive amino acid evolution, among others. Nevertheless, sequence data are very often spread over several databases, many useful genomes and transcriptomes are non-annotated, the available annotation is not for the desired coding sequence isoform, and/or is unlikely to be accurate. Moreover, although the FASTA text-based format is quite simple and usable by most software applications, there are a number of issues that may be critical depending on the software used to analyse such files. Therefore, researchers without training in informatics often use a fraction of all available data. The above issues can be addressed using already available software applications, but there is no easy-to-use single piece of software that allows performing all these tasks within the same graphical interface, such as the one here presented, named BDBM (Blast DataBase Manager). BDBM can be used to efficiently get gene sequences from annotated and non-annotated genomes and transcriptomes. Moreover, it can be used to look for alternatives to existing annotations and to easily create reliable custom databases. Such databases are essential to prepare high-quality datasets. The analyses that we have performed on the Coffea canephora genome using BDBM aimed at the identification of the S-locus region (that harbours the genes involved in gametophytic self-incompatibility) led to the conclusion that there are two likely regions, one on chromosome 2 (around region 6600000–6650000), and another on chromosome 5 (around 15830000–15930000). Such findings are discussed in the context of the Rubiaceae gametophytic self-incompatibility evolution.",
                "authors": [
                    {
                        "name": "Vazquez N."
                    },
                    {
                        "name": "Lopez-Fernandez H."
                    },
                    {
                        "name": "Vieira C.P."
                    },
                    {
                        "name": "Fdez-Riverola F."
                    },
                    {
                        "name": "Vieira J."
                    },
                    {
                        "name": "Reboiro-Jato M."
                    }
                ],
                "citationCount": 4,
                "date": "2019-03-01T00:00:00Z",
                "journal": "Interdisciplinary Sciences: Computational Life Sciences",
                "title": "BDBM 1.0: A Desktop Application for Efficient Retrieval and Processing of High-Quality Sequence Data and Application to the Identification of the Putative Coffea S-Locus"
            },
            "pmid": "30712176",
            "type": [
                "Primary"
            ],
            "version": "1.0"
        }
    ],
    "relation": [
        {
            "biotoolsID": "blast",
            "type": "uses"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Data management",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        }
    ],
    "validated": 1,
    "version": [
        "1.0.2"
    ]
}