{"collectionID": [], "accessibility": [], "topic": [{"term": "Epigenetics", "uri": "http://edamontology.org/topic_3295"}, {"term": "Epigenomics", "uri": "http://edamontology.org/topic_3173"}], "owner": "seqwiki_import", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": null, "note": null, "version": null, "pmid": "18786255", "type": null, "pmcid": null, "metadata": {"title": "Kismeth: Analyzer of plant methylation states through bisulfite sequencing", "abstract": "Background: There is great interest in probing the temporal and spatial patterns of cytosine methylation states in genomes of a variety of organisms. It is hoped that this will shed light on the biological roles of DNA methylation in the epigenetic control of gene expression. Bisulfite sequencing refers to the treatment of isolated DNA with sodium bisulfite to convert unmethylated cytosine to uracil, with PCR converting the uracil to thymidine followed by sequencing of the resultant DNA to detect DNA methylation. For the study of DNA methylation, plants provide an excellent model system, since they can tolerate major changes in their DNA methylation patterns and have long been studied for the effects of DNA methylation on transposons and epimutations. However, in contrast to the situation in animals, there aren't many tools that analyze bisulfite data in plants, which can exhibit methylation of cytosines in a variety of sequence contexts (CG, CHG, and CHH). Results: Kismeth http://katahdin.mssm.edu/kismeth is a web-based tool for bisulfite sequencing analysis. Kismeth was designed to be used with plants, since it considers potential cytosine methylation in any sequence context (CG, CHG, and CHH). It provides a tool for the design of bisulfite primers as well as several tools for the analysis of the bisulfite sequencing results. Kismeth is not limited to data from plants, as it can be used with data from any species. Conclusion: Kismeth simplifies bisulfite sequencing analysis. It is the only publicly available tool for the design of bisulfite primers for plants, and one of the few tools for the analysis of methylation patterns in plants. It facilitates analysis at both global and local scales, demonstrated in the examples cited in the text, allowing dissection of the genetic pathways involved in DNA methylation. Kismeth can also be used to study methylation states in different tissues and disease cells compared to a reference sequence. © 2008 Gruntman et al; licensee BioMed Central Ltd.", "citationCount": 129, "authors": [{"name": "Gruntman E."}, {"name": "Qi Y."}, {"name": "Slotkin R.K."}, {"name": "Roeder T."}, {"name": "Martienssen R.A."}, {"name": "Sachidanandam R."}], "date": "2008-09-11T00:00:00Z", "journal": "BMC Bioinformatics"}}], "homepage_status": 1, "credit": [{"typeRole": ["Primary contact"], "name": "Kismeth Support", "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "ravi.mssm@gmail.com"}], "biotoolsCURIE": "biotools:kismeth", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "http://katahdin.mssm.edu/kismeth", "function": [{"note": null, "input": [], "operation": [{"term": "Bisulfite mapping", "uri": "http://edamontology.org/operation_3186"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:56Z", "otherID": [], "description": "Web-based tool for bisulfite sequencing analysis", "toolType": ["Web service"], "editPermission": {"type": "private", "authors": []}, "language": [], "link": [], "biotoolsID": "kismeth", "additionDate": "2017-01-13T13:15:10Z", "name": "Kismeth", "license": null, "documentation": [], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux", "Windows", "Mac"]}