{
    "additionDate": "2021-01-18T11:50:08Z",
    "biotoolsCURIE": "biotools:biaflows",
    "biotoolsID": "biaflows",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "sebastien.tosi@irbbarcelona.org",
            "name": "Sébastien Tosi",
            "typeEntity": "Person"
        }
    ],
    "description": "BIAFLOWS is a collaborative framework to reproducibly deploy and benchmark bioimage analysis workflows. BIAFLOWS is a web platform centralizing Bio Image Analysis (BIA) workflows to automatically extract biological objects annotations from microscopy images.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://biaflows-doc.neubias.org/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Image annotation",
                    "uri": "http://edamontology.org/operation_3553"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://biaflows.neubias.org",
    "lastUpdate": "2021-03-11T13:41:26Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://biaflows-sandbox.neubias.org/"
        },
        {
            "note": "GitHub repository for submission of workflows.",
            "type": [
                "Repository"
            ],
            "url": "https://github.com/Neubias-WG5/SubmitToBiaflows"
        }
    ],
    "name": "BIAFLOWS",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.PATTER.2020.100040",
            "metadata": {
                "abstract": "© 2020 The Author(s)Image analysis is key to extracting quantitative information from scientific microscopy images, but the methods involved are now often so refined that they can no longer be unambiguously described by written protocols. We introduce BIAFLOWS, an open-source web tool enabling to reproducibly deploy and benchmark bioimage analysis workflows coming from any software ecosystem. A curated instance of BIAFLOWS populated with 34 image analysis workflows and 15 microscopy image datasets recapitulating common bioimage analysis problems is available online. The workflows can be launched and assessed remotely by comparing their performance visually and according to standard benchmark metrics. We illustrated these features by comparing seven nuclei segmentation workflows, including deep-learning methods. BIAFLOWS enables to benchmark and share bioimage analysis workflows, hence safeguarding research results and promoting high-quality standards in image analysis. The platform is thoroughly documented and ready to gather annotated microscopy datasets and workflows contributed by the bioimaging community. Image analysis is currently one of the major hurdles in the bioimaging chain, especially for large datasets. BIAFLOWS seeds the ground for virtual access to image analysis workflows running in high-performance computing environments. Providing a broader access to state-of-the-art image analysis is expected to have a strong impact on research in biology, and in other fields where image analysis is a critical step in extracting scientific results from images. BIAFLOWS could also be adopted as a federated platform to publish microscopy images together with the workflows that were used to extract scientific data from these images. This is a milestone of open science that will help to accelerate scientific progress by fostering collaborative practices. While image analysis is becoming inescapable in the extraction of quantitative information from scientific images, it is currently challenging for life scientists to find, test, and compare state-of-the-art image analysis methods compatible with their own microscopy images. It is also difficult and time consuming for algorithm developers to validate and reproducibly share their methods. BIAFLOWS is a web platform addressing these needs. It can be used as a local solution or through an immediately accessible and curated online instance.",
                "authors": [
                    {
                        "name": "Rubens U."
                    },
                    {
                        "name": "Mormont R."
                    },
                    {
                        "name": "Paavolainen L."
                    },
                    {
                        "name": "Backer V."
                    },
                    {
                        "name": "Pavie B."
                    },
                    {
                        "name": "Scholz L.A."
                    },
                    {
                        "name": "Michiels G."
                    },
                    {
                        "name": "Maska M."
                    },
                    {
                        "name": "Unay D."
                    },
                    {
                        "name": "Ball G."
                    },
                    {
                        "name": "Hoyoux R."
                    },
                    {
                        "name": "Vandaele R."
                    },
                    {
                        "name": "Golani O."
                    },
                    {
                        "name": "Stanciu S.G."
                    },
                    {
                        "name": "Sladoje N."
                    },
                    {
                        "name": "Paul-Gilloteaux P."
                    },
                    {
                        "name": "Maree R."
                    },
                    {
                        "name": "Tosi S."
                    }
                ],
                "citationCount": 3,
                "date": "2020-06-12T00:00:00Z",
                "journal": "Patterns",
                "title": "BIAFLOWS: A Collaborative Framework to Reproducibly Deploy and Benchmark Bioimage Analysis Workflows"
            },
            "pmcid": "PMC7660398",
            "pmid": "33205108"
        }
    ],
    "toolType": [
        "Workbench",
        "Workflow"
    ],
    "topic": [
        {
            "term": "Bioimaging",
            "uri": "http://edamontology.org/topic_3383"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        }
    ]
}