
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Structure classification",
                    "uri": "http://edamontology.org/operation_2996"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "labels": {
        "topic": [
            {
                "term": "Cheminformatics",
                "uri": "http://edamontology.org/topic_2258"
            },
            {
                "term": "Ontology and terminology",
                "uri": "http://edamontology.org/topic_0089"
            },
            {
                "term": "Small molecules",
                "uri": "http://edamontology.org/topic_0154"
            },
            {
                "term": "Taxonomy",
                "uri": "http://edamontology.org/topic_0637"
            },
            {
                "term": "Chemistry",
                "uri": "http://edamontology.org/topic_3314"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019 The Royal Society of Chemistry.Per- and polyfluoroalkyl substances (PFASs) are a large and diverse class of chemicals of great interest due to their wide commercial applicability, as well as increasing public concern regarding their adverse impacts. A common terminology for PFASs was recommended in 2011, including broad categorization and detailed naming for many PFASs with rather simple molecular structures. Recent advancements in chemical analysis have enabled identification of a wide variety of PFASs that are not covered by this common terminology. The resulting inconsistency in categorizing and naming of PFASs is preventing efficient assimilation of reported information. This article explores how a combination of expert knowledge and cheminformatics approaches could help address this challenge in a systematic manner. First, the \"splitPFAS\" approach was developed to systematically subdivide PFASs (for eventual categorization) following a CnF2n+1-X-R pattern into their various parts, with a particular focus on 4 PFAS categories where X is CO, SO2, CH2 and CH2CH2. Then, the open, ontology-based \"ClassyFire\" approach was tested for potential applicability to categorizing and naming PFASs using five scenarios of original and simplified structures based on the \"splitPFAS\" output. This workflow was applied to a set of 770 PFASs from the latest OECD PFAS list. While splitPFAS categorized PFASs as intended, the ClassyFire results were mixed. These results reveal that open cheminformatics approaches have the potential to assist in categorizing PFASs in a consistent manner, while much development is needed for future systematic naming of PFASs. The \"splitPFAS\" tool and related code are publicly available, and include options to extend this proof-of-concept to encompass further PFASs in the future.",
            "authors": [
                "Sha B.",
                "Schymanski E.L.",
                "Ruttkies C.",
                "Cousins I.T.",
                "Wang Z."
            ],
            "cit_count": 0,
            "doi": "10.1039/C9EM00321E",
            "journal": "Environmental Science: Processes and Impacts",
            "pmid": "31576380",
            "title": "Exploring open cheminformatics approaches for categorizing per- And polyfluoroalkyl substances (PFASs)",
            "year": "2019-11-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:ClassyFire",
        "biotoolsID": "ClassyFire",
        "description": "Exploring open cheminformatics approaches for categorizing per- and polyfluoroalkyl substances (PFASs).\n\nClassyFire is a web-based application for automated structural classification of chemical entities. This application uses a rule-based approach that relies on a comprehensible, comprehensive, and computable chemical taxonomy. ClassyFire provides a hierarchical chemical classification of chemical entities (mostly small molecules and short peptide sequences), as well as a structure-based textual description, based on a chemical taxonomy named ChemOnt, which covers 4825 chemical classes of organic and inorganic compounds. It can be accessed via the web interface or via the ClassyFire API.\n\nClassyFire is offered to the public as a freely acessible web server.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'PFASs', 'categorizing PFASs', 'splitPFAS', 'naming PFASs'",
        "homepage": "http://classyfire.wishartlab.com",
        "name": "ClassyFire"
    }
}