{
    "additionDate": "2021-05-21T10:44:15Z",
    "biotoolsCURIE": "biotools:halodom",
    "biotoolsID": "halodom",
    "credit": [
        {
            "email": "ikappas@bio.auth.gr",
            "name": "Ilias Kappas"
        }
    ],
    "description": "HaloDom is a database of halophilic organisms across all life domains. It provides taxonomy info, halotolerance classification, salinity metadata, genomic/proteomic links and publication info.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://halodom.bio.auth.gr/",
    "lastUpdate": "2021-05-23T10:18:49.405235Z",
    "name": "HaloDom",
    "owner": "biotIK",
    "publication": [
        {
            "doi": "10.1186/s40709-017-0072-0",
            "metadata": {
                "abstract": "© 2018 The Author(s).Background: Halophilic organisms may thrive in or tolerate high salt concentrations. They have been studied for decades and a considerable number of papers reporting new halophilic species are being published every year. However, an extensive collection of these salt-loving organisms does not exist nowadays. Halophilic life forms have representatives from all three life domains, Archaea, Bacteria and Eukarya. The purpose of this study was to search for all documented halophilic species in the scientific literature and accommodate this information in the form of an online database. Results: We recorded more than 1000 halophilic species from the scientific literature. From these, 21.9% belong to Archaea, 50.1% to Bacteria and 27.9% to Eukaryotes. Our records contain basic information such as the salinity that a particular organism was found, its taxonomy and genomic information via NCBI and other links. The online database named \"HaloDom\" can be accessed at http://www.halodom.bio.auth.gr. Conclusions: Over the last few years, data on halophiles are growing fast. Compared to previous efforts, this new halophiles database expands its coverage to all life domains and offers a valuable reference system for studies in biotechnology, early life evolution and comparative genomics.",
                "authors": [
                    {
                        "name": "Loukas A."
                    },
                    {
                        "name": "Kappas I."
                    },
                    {
                        "name": "Abatzopoulos T.J."
                    }
                ],
                "citationCount": 11,
                "date": "2018-02-08T00:00:00Z",
                "journal": "Journal of Biological Research (Greece)",
                "title": "HaloDom: A new database of halophiles across all life domains"
            },
            "pmcid": "PMC5957262",
            "pmid": "29796383",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Biology",
            "uri": "http://edamontology.org/topic_3070"
        },
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        },
        {
            "term": "Biological databases",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Comparative genomics",
            "uri": "http://edamontology.org/topic_0797"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        }
    ],
    "version": [
        "1.3"
    ]
}