
{
    "credit": [
        {
            "email": "eric.r.paquet@gmail.com",
            "name": "Eric R Paquet",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "http://bioconductor.org/packages/release/bioc/html/AIMS.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/AIMS_1.6.0.tar.gz"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Gene expression profile",
                        "uri": "http://edamontology.org/data_0928"
                    },
                    "format": [
                        {
                            "term": "Gene expression report format",
                            "uri": "http://edamontology.org/format_2058"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Gene expression comparison",
                    "uri": "http://edamontology.org/operation_0315"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Disease report",
                        "uri": "http://edamontology.org/data_1622"
                    },
                    "format": [
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        }
                    ]
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "language": [
            "R"
        ],
        "license": "Artistic-2.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "Oncology",
                "uri": "http://edamontology.org/topic_2640"
            },
            {
                "term": "Statistics and probability",
                "uri": "http://edamontology.org/topic_2269"
            }
        ]
    },
    "link": [
        {
            "type": "MIRROR",
            "url": "http://www.bci.mcgill.ca/AIMS"
        }
    ],
    "publication": [
        {
            "abstract": "© The Author 2014. Published by Oxford University Press. Background: Massively parallel gene expression profiling has provided a more objective, molecular-level characterization of breast cancer subtypes. Several bioinformatics tools are available to infer patient subtype from a gene expression profile including the well-studied PAM50. The specific algorithmic methods used in these tools require access to a broad patient dataset. The choice of subtype for an individual is determined relative to all other patients across the panel, making subtypes heavily dependent on the composition of the dataset. Our aim was to develop a bioinformatics approach assigning absolute breast cancer subtypes, independent of dataset composition. Methods: Using a dataset of 4924 breast cancer patients, we defined a new bioinformatics approach: Absolute Intrinsic Molecular Subtyping (AIMS) that assigns subtype from a gene expression profile for an individual sample without the need for a large, diverse, and normalized dataset. We evaluated the agreement of AIMS with PAM50 and compared subtype assignment and prognostic value of the subtypes. We assessed AIMS' robustness using a benchmark set of tests including subtype reproducibility between technologies, gene removal, and normal gene expression contamination, and compared it with PAM50. All statistical tests, except where noted, were two-sided. Results: AIMS vastly agreed with PAM50, with 76% and 77% agreement for cross validation and the test set, respectively, and the prognostic capacity of the intrinsic subtypes was preserved. AIMS is fully stable, and its absolute nature enables its use on a wide range of datasets and technologies, including RNA-seq. Conclusions: The instability of a breast cancer subtyping scheme like PAM50 could have important consequences in clinical management of patients. AIMS is a fully stable and robust subtyping scheme that recapitulates PAM50.",
            "authors": [
                "Paquet E.R.",
                "Hallett M.T."
            ],
            "cit_count": 29,
            "doi": "10.1093/jnci/dju357",
            "journal": "Journal of the National Cancer Institute",
            "title": "Absolute assignment of breast cancer intrinsic molecular subtype",
            "type": "Primary",
            "year": "2015-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:aims",
        "biotoolsID": "aims",
        "description": "This package contains the necessary functions to assign the five intrinsic molecular subtypes (Luminal A, Luminal B, Her2-enriched, Basal-like, Normal-like). The assignments could be done on individual samples as well as on dataset of gene expression data.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/AIMS.html",
        "name": "AIMS",
        "version": [
            "1.6.0"
        ]
    }
}