{
    "accessibility": "Restricted access",
    "additionDate": "2022-06-07T06:03:37.593598Z",
    "biotoolsCURIE": "biotools:csrira",
    "biotoolsID": "csrira",
    "confidence_flag": "tool",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "M.Knapp@lse.ac.uk",
            "name": "Martin Knapp",
            "typeEntity": "Person"
        },
        {
            "email": "bhychung@hku.hk",
            "name": "Brian H. Y. Chung",
            "typeEntity": "Person"
        }
    ],
    "description": "Client Service Receipt Inventory as a standardised tool for measurement of socio-economic costs in the rare genetic disease population (CSRI-Ra).",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "https://paed.hku.hk/e-form/csri-ra-registration-form.asp",
    "lastUpdate": "2022-06-07T06:03:37.596046Z",
    "name": "CSRI-Ra",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1038/S41598-021-03379-5",
            "metadata": {
                "abstract": "© 2021, The Author(s).The measurement of costs is fundamental in healthcare decision-making, but it is often challenging. In particular, standardised methods have not been developed in the rare genetic disease population. A reliable and valid tool is critical for research to be locally meaningful yet internationally comparable. Herein, we sought to develop, contextualise, translate, and validate the Client Service Receipt Inventory for the RAre disease population (CSRI-Ra) to be used in cost-of-illness studies and economic evaluations for healthcare planning. Through expert panel discussions and focus group meetings involving 17 rare disease patients, carers, and healthcare and social care professionals from Hong Kong, we have developed the CSRI-Ra. Rounds of forward and backward translations were performed by bilingual researchers, and face validity and semantic equivalence were achieved through interviews and telephone communications with focus group participants and an additional of 13 healthcare professional and university students. Intra-class correlation coefficient (ICC) was used to assess criterion validity between CSRI-Ra and electronic patient record in a sample of 94 rare disease patients and carers, with overall ICC being 0.69 (95% CI 0.56–0.78), indicating moderate to good agreement. Following rounds of revision in the development, contextualisation, translation, and validation stages, the CSRI-Ra is ready for use in empirical research. The CSRI-Ra provides a sufficiently standardised yet adaptable method for collecting socio-economic data related to rare genetic diseases. This is important for near-term and long-term monitoring of the resource consequences of rare diseases, and it provides a tool for use in economic evaluations in the future, thereby helping to inform planning for efficient and effective healthcare. Adaptation of the CSRI-Ra to other populations would facilitate international research.",
                "authors": [
                    {
                        "name": "Chan M.C.Y."
                    },
                    {
                        "name": "Chung B.H.Y."
                    },
                    {
                        "name": "Chung C.C.Y."
                    },
                    {
                        "name": "Fung J.L.F."
                    },
                    {
                        "name": "Knapp M."
                    },
                    {
                        "name": "Lee S.L."
                    },
                    {
                        "name": "Lui A.C.Y."
                    },
                    {
                        "name": "Ng Y.N.C."
                    },
                    {
                        "name": "Wong W.H.S."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "Client Service Receipt Inventory as a standardised tool for measurement of socio-economic costs in the rare genetic disease population (CSRI-Ra)"
            },
            "pmcid": "PMC8668911",
            "pmid": "34903789"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        }
    ],
    "validated": 1
}
