{
    "additionDate": "2019-11-14T18:14:12Z",
    "biotoolsCURIE": "biotools:GLAMbox",
    "biotoolsID": "GLAMbox",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "felixmolter@gmail.com",
            "name": "Felix Molter",
            "orcidid": "https://orcid.org/0000-0002-3283-1090",
            "typeEntity": "Person"
        },
        {
            "email": "athms.research@gmail.com",
            "name": "Armin W. Thomas",
            "typeEntity": "Person"
        }
    ],
    "description": "A Python toolbox for investigating the association between gaze allocation and decision behaviour | A python toolbox for the Gaze Weighted Linear Accumulator Model (GLAM) | GLAMbox is a Python toolbox for investigating the association between gaze allocation and decision behaviour, and applying the Gaze-weighted Linear Accumulator Model (Thomas, Molter et al., 2019, full text available online)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "homepage": "https://glambox.readthedocs.io/en/latest/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-03T11:46:31Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/glamlab/glambox"
        }
    ],
    "name": "GLAMbox",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/741678"
        },
        {
            "doi": "10.1371/journal.pone.0226428",
            "metadata": {
                "abstract": "Copyright: © 2019 Molter et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Recent empirical findings have indicated that gaze allocation plays a crucial role in simple decision behaviour. Many of these findings point towards an influence of gaze allocation onto the speed of evidence accumulation in an accumulation-to-bound decision process (resulting in generally higher choice probabilities for items that have been looked at longer). Further, researchers have shown that the strength of the association between gaze and choice behaviour is highly variable between individuals, encouraging future work to study this association on the individual level. However, few decision models exist that enable a straightforward characterization of the gaze-choice association at the individual level, due to the high cost of developing and implementing them. The model space is particularly scarce for choice sets with more than two choice alternatives. Here, we present GLAMbox, a Python-based toolbox that is built upon PyMC3 and allows the easy application of the gaze-weighted linear accumulator model (GLAM) to experimental choice data. The GLAM assumes gaze-dependent evidence accumulation in a linear stochastic race that extends to decision scenarios with many choice alternatives. GLAMbox enables Bayesian parameter estimation of the GLAM for individual, pooled or hierarchical models, provides an easy-to-use interface to predict choice behaviour and visualize choice data, and benefits from all of PyMC3’s Bayesian statistical modeling functionality. Further documentation, resources and the toolbox itself are available at https://glambox.readthedocs.io.",
                "authors": [
                    {
                        "name": "Heekeren H.R."
                    },
                    {
                        "name": "Mohr P.N.C."
                    },
                    {
                        "name": "Molter F."
                    },
                    {
                        "name": "Thomas A.W."
                    }
                ],
                "citationCount": 3,
                "date": "2019-12-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "GLAMbox: A Python toolbox for investigating the association between gaze allocation and decision behaviour"
            },
            "pmcid": "PMC6914332",
            "pmid": "31841564"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
