
{
    "credit": [
        {
            "email": "abyzov.alexej@mayo.edu",
            "name": "Alexej Abyzov",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/abyzovlab/CNVnator/blob/master/README"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Animal and Crop Genomics"
        ],
        "language": [
            "C++"
        ],
        "license": "Other",
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Genotype and phenotype",
                "uri": "http://edamontology.org/topic_0625"
            },
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "Human biology",
                "uri": "http://edamontology.org/topic_2815"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Copy number variation (CNV) in the genome is a complex phenomenon, and not completely understood. We have developed a method, CNVnator, for CNV discovery and genotyping from read-depth (RD) analysis of personal genome sequencing. Our method is based on combining the established mean-shift approach with additional refinements (multiple-bandwidth partitioning and GC correction) to broaden the range of discovered CNVs. We calibrated CNVnator using the extensive validation performed by the 1000 Genomes Project. Because of this, we could use CNVnator for CNV discovery and genotyping in a population and characterization of atypical CNVs, such as de novo and multi-allelic events. Overall, for CNVs accessible by RD, CNVnator has high sensitivity (86%-96%), low false-discovery rate (3%-20%), high genotyping accuracy (93%-95%), and high resolution in breakpoint discovery (<200 bp in 90% of cases with high sequencing coverage). Furthermore, CNVnator is complementary in a straightforward way to split-read and read-pair approaches: It misses CNVs created by retrotransposable elements, but more than half of the validated CNVs that it identifies are not detected by split-read or read-pair. By genotyping CNVs in the CEPH, Yoruba, and Chinese-Japanese populations, we estimated that at least 11% of all CNV loci involve complex, multi-allelic events, a considerably higher estimate than reported earlier. Moreover, among these events, we observed cases with allele distribution strongly deviating from Hardy-Weinberg equilibrium, possibly implying selection on certain complex loci. Finally, by combining discovery and genotyping, we identified six potential de novo CNVs in two family trios. © 2011 by Cold Spring Harbor Laboratory Press.",
            "authors": [
                "Abyzov A.",
                "Urban A.E.",
                "Snyder M.",
                "Gerstein M."
            ],
            "cit_count": 474,
            "journal": "Genome Research",
            "pmid": "21324876",
            "title": "CNVnator: An approach to discover, genotype, and characterize typical and atypical CNVs from family and population genome sequencing",
            "year": "2011-06-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:cnvnator",
        "biotoolsID": "cnvnator",
        "description": "CNV discovery and genotyping from read-depth analysis of personal genome sequencing.",
        "homepage": "https://github.com/abyzovlab/CNVnator",
        "name": "CNVnator"
    }
}