{
    "additionDate": "2018-08-10T12:53:22Z",
    "biotoolsCURIE": "biotools:spang",
    "biotoolsID": "spang",
    "credit": [
        {
            "email": "chiba@dbcls.rois.ac.jp",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A command-line SPARQL client supporting query generation for distributed RDF databases.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/dbcls/spang/wiki/SPANG"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://spang.dbcls.jp/",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "MIT",
    "name": "SPANG",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s12859-017-1531-1",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: Toward improved interoperability of distributed biological databases, an increasing number of datasets have been published in the standardized Resource Description Framework (RDF). Although the powerful SPARQL Protocol and RDF Query Language (SPARQL) provides a basis for exploiting RDF databases, writing SPARQL code is burdensome for users including bioinformaticians. Thus, an easy-to-use interface is necessary. Results: We developed SPANG, a SPARQL client that has unique features for querying RDF datasets. SPANG dynamically generates typical SPARQL queries according to specified arguments. It can also call SPARQL template libraries constructed in a local system or published on the Web. Further, it enables combinatorial execution of multiple queries, each with a distinct target database. These features facilitate easy and effective access to RDF datasets and integrative analysis of distributed data. Conclusions: SPANG helps users to exploit RDF datasets by generation and reuse of SPARQL queries through a simple interface. This client will enhance integrative exploitation of biological RDF datasets distributed across the Web. This software package is freely available at http://purl.org/net/spang.",
                "authors": [
                    {
                        "name": "Chiba H."
                    },
                    {
                        "name": "Uchiyama I."
                    }
                ],
                "citationCount": 4,
                "date": "2017-02-08T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SPANG: A SPARQL client supporting generation and reuse of queries for distributed RDF databases"
            },
            "pmcid": "PMC5299738",
            "pmid": "28178937"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Data management",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Laboratory information management",
            "uri": "http://edamontology.org/topic_0607"
        },
        {
            "term": "Data acquisition",
            "uri": "http://edamontology.org/topic_3077"
        }
    ],
    "validated": 1
}