{"credit":[{"email":"fantom-help@riken.jp","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://fantom.gsc.riken.jp/"}],"documentation":[{"type":"GENERAL","url":"http://fantom.gsc.riken.jp/faq/"}],"function":[{"operation":[{"term":"Transcriptional regulatory element prediction","uri":"http://edamontology.org/operation_0438"}]}],"labels":{"language":["R"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Library"],"topic":[{"term":"Gene expression","uri":"http://edamontology.org/topic_0203"},{"term":"Genetics","uri":"http://edamontology.org/topic_3053"},{"term":"Sample collections","uri":"http://edamontology.org/topic_3277"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/cagexplorer-1-0-2-analysis-and-visualization-of-promoter-dynamics-across-multiple-experiments.html"}],"publication":[{"abstract":"Alternate promoter usage is an important molecular mechanism for generating RNA and protein diversity. Cap Analysis Gene Expression (CAGE) is a powerful approach for revealing the multiplicity of transcription start site (TSS) events across experiments and conditions. An understanding of the dynamics of TSS choice across these conditions requires both sensitive quantification and comparative visualization. We have developed CAGExploreR, an R package to detect and visualize changes in the use of specific TSS in wider promoter regions in the context of changes in overall gene expression when comparing different CAGE samples. These changes provide insight into the modification of transcript isoform generation and regulatory network alterations associated with cell types and conditions. CAGExploreR is based on the FANTOM5 and MPromDb promoter set definitions but can also work with user-supplied regions. The package compares multiple CAGE libraries simultaneously. Supplementary Materials describe methods in detail, and a vignette demonstrates a workflow with a real data example. © 2014 The Author.","authors":["Dimont E.","Hofmann O.","Ho Sui S.J.","Forrest A.R.R.","Kawaji H.","Hide W."],"cit_count":2,"journal":"Bioinformatics","pmid":"24675730","title":"CAGExploreR: An R package for the analysis and visualization of promoter dynamics across multiple experiments","year":"2014-01-01"}],"summary":{"biotoolsCURIE":"biotools:cagexplorer","biotoolsID":"cagexplorer","description":"R package that facilitates the detection and visualization of changes in the relative transcription from promoter regions in multi-promoter genes, all in the context of overall gene expression. Multiple samples can be compared simultaneously.","homepage":"http://fantom.gsc.riken.jp/software/","name":"CAGExploreR"}}