{
    "additionDate": "2021-01-18T10:31:16Z",
    "biotoolsCURIE": "biotools:dataremix",
    "biotoolsID": "dataremix",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mchikina@pitt.edu",
            "name": "Maria Chikina",
            "typeEntity": "Person"
        }
    ],
    "description": "DataRemix is a R package for universal data transformation for optimal inference from gene expression datasets.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                }
            ]
        }
    ],
    "homepage": "https://github.com/wgmao/DataRemix",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-22T15:07:12Z",
    "name": "DataRemix",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA745",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: RNA-seq technology provides unprecedented power in the assessment of the transcription abundance and can be used to perform a variety of downstream tasks such as inference of gene-correlation network and eQTL discovery. However, raw gene expression values have to be normalized for nuisance biological variation and technical covariates, and different normalization strategies can lead to dramatically different results in the downstream study. Results: We describe a generalization of singular value decomposition-based reconstruction for which the common techniques of whitening, rank-k approximation and removing the top k principal components are special cases. Our simple three-parameter transformation, DataRemix, can be tuned to reweigh the contribution of hidden factors and reveal otherwise hidden biological signals. In particular, we demonstrate that the method can effectively prioritize biological signals over noise without leveraging external dataset-specific knowledge, and can outperform normalization methods that make explicit use of known technical factors. We also show that DataRemix can be efficiently optimized via Thompson sampling approach, which makes it feasible for computationally expensive objectives such as eQTL analysis. Finally, we apply our method to the Religious Orders Study and Memory and Aging Project dataset, and we report what to our knowledge is the first replicable trans-eQTL effect in human brain. Availabilityand implementation: DataRemix is an R package which is freely available at GitHub (https://github.com/wgmao/DataRemix).",
                "authors": [
                    {
                        "name": "Mao W."
                    },
                    {
                        "name": "Rahimikollu J."
                    },
                    {
                        "name": "Hausler R."
                    },
                    {
                        "name": "Chikina M."
                    }
                ],
                "date": "2021-04-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "DataRemix: A universal data transformation for optimal inference from gene expression datasets"
            },
            "pmid": "32821903"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ]
}