{
    "additionDate": "2018-07-28T09:34:01Z",
    "biotoolsCURIE": "biotools:mendelianrandomization",
    "biotoolsID": "mendelianrandomization",
    "credit": [
        {
            "email": "sb452@medschl.cam.ac.uk",
            "name": "Stephen Burgess",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Encodes several methods for performing Mendelian randomization analyses with summarized data. Summarized data on genetic associations with the exposure and with the outcome can be obtained from large consortia. These data can be used for obtaining causal estimates using instrumental variable methods.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://cran.r-project.org/web/packages/MendelianRandomization/MendelianRandomization.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/MendelianRandomization/",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "MendelianRandomization",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/ije/dyx034",
            "metadata": {
                "abstract": "© The Author 2017.MendelianRandomization is a software package for the R open-source software environment that performs Mendelian randomization analyses using summarized data. The core functionality is to implement the inverse-variance weighted, MR-Egger and weighted median methods for multiple genetic variants. Several options are available to the user, such as the use of robust regression, fixed- or random-effects models and the penalization of weights for genetic variants with heterogeneous causal estimates. Extensions to these methods, such as allowing for variants to be correlated, can be chosen if appropriate. Graphical commands allow summarized data to be displayed in an interactive graph, or the plotting of causal estimates from multiple methods, for comparison. Although the main method of data entry is directly by the user, there is also an option for allowing summarized data to be incorporated from the PhenoScanner database of genotype- phenotype associations. We hope to develop this feature in future versions of the package. The R software environment is available for download from [https://www.rproject.org/]. The MendelianRandomization package can be downloaded from the Comprehensive R Archive Network (CRAN) within R, or directly from [https://cran.r-project.org/web/packages/MendelianRandomization/]. Both R and the MendelianRand omization package are released under GNU General Public Licenses (GPL-2jGPL-3).",
                "authors": [
                    {
                        "name": "Yavorska O.O."
                    },
                    {
                        "name": "Burgess S."
                    }
                ],
                "citationCount": 285,
                "date": "2017-12-01T00:00:00Z",
                "journal": "International Journal of Epidemiology",
                "title": "MendelianRandomization: An R package for performing Mendelian randomization analyses using summarized data"
            },
            "pmcid": "PMC5510723",
            "pmid": "28398548"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1
}