{
    "accessibility": [
        "Open access"
    ],
    "additionDate": "2019-07-06T15:07:08Z",
    "biotoolsCURIE": "biotools:GWASinlps",
    "biotoolsID": "GWASinlps",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "nilotpal.sanyal@gmail.com",
            "name": "Nilotpal Sanyal",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Non-local prior based iterative SNP selection tool for genome-wide association studies.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://cran.r-project.org/web/packages/GWASinlps/GWASinlps.pdf"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://cran.r-project.org/src/contrib/GWASinlps_1.2.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/package=GWASinlps",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-07-06T15:07:08Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "GWASinlps",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/bty472",
            "metadata": {
                "abstract": "© 2018 The Author(s). Published by Oxford University Press. All rights reserved.Motivation Multiple marker analysis of the genome-wide association study (GWAS) data has gained ample attention in recent years. However, because of the ultra high-dimensionality of GWAS data, such analysis is challenging. Frequently used penalized regression methods often lead to large number of false positives, whereas Bayesian methods are computationally very expensive. Motivated to ameliorate these issues simultaneously, we consider the novel approach of using non-local priors in an iterative variable selection framework. Results We develop a variable selection method, named, iterative non-local prior based selection for GWAS, or GWASinlps, that combines, in an iterative variable selection framework, the computational efficiency of the screen-and-select approach based on some association learning and the parsimonious uncertainty quantification provided by the use of non-local priors. The hallmark of our method is the introduction of â - structured screen-and-select' strategy, that considers hierarchical screening, which is not only based on response-predictor associations, but also based on response-response associations and concatenates variable selection within that hierarchy. Extensive simulation studies with single nucleotide polymorphisms having realistic linkage disequilibrium structures demonstrate the advantages of our computationally efficient method compared to several frequentist and Bayesian variable selection methods, in terms of true positive rate, false discovery rate, mean squared error and effect size estimation error. Further, we provide empirical power analysis useful for study design. Finally, a real GWAS data application was considered with human height as phenotype.",
                "authors": [
                    {
                        "name": "Sanyal N."
                    },
                    {
                        "name": "Lo M.-T."
                    },
                    {
                        "name": "Kauppi K."
                    },
                    {
                        "name": "Djurovic S."
                    },
                    {
                        "name": "Andreassen O.A."
                    },
                    {
                        "name": "Johnson V.E."
                    },
                    {
                        "name": "Chen C.-H."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "GWASinlps: Non-local prior based iterative SNP selection tool for genome-wide association studies"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "version": [
        "1.2"
    ]
}