{
    "additionDate": "2021-01-18T08:04:53Z",
    "biotoolsCURIE": "biotools:poji",
    "biotoolsID": "poji",
    "confidence_flag": "tool",
    "description": "a Fiji-based tool for analysis of podosomes and associated proteins.\n\nTo use the macro, download 'Poji.ijm' and install it in Fiji or ImageJ. You may optionally download and install the 'Split and Save Channels.ijm' file to correctly set up the files before using Poji. Also deposited are several premade Excel-tables for faster analysis of the output of Poji and two different image sets as test data for the use of Poji. For general use of macro, please refer to 'Userguide.pdf'.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "https://github.com/roherzog/Poji",
    "lastUpdate": "2021-01-24T14:25:11Z",
    "name": "Poji",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1242/JCS.238964",
            "metadata": {
                "abstract": "© 2020. Published by The Company of Biologists Ltd.Podosomes are actin-based adhesion and invasion structures in a variety of cell types, with podosome-forming cells displaying up to several hundreds of these structures. Podosome number, distribution and composition can be affected by experimental treatments or during regular turnover, necessitating a tool that is able to detect even subtle differences in podosomal properties. Here, we present a Fiji-based macro code termed 'Poji' ('podosome analysis by Fiji'), which serves as an easy-to-use tool to characterize a variety of cellular and podosomal parameters, including area, fluorescence intensity, relative enrichment of associated proteins and radial podosome intensity profiles. This tool should be useful to gain more detailed insight into the regulation, architecture and functions of podosomes. Moreover, we show that Poji is easily adaptable for the analysis of invadopodia and associated extracellular matrix degradation, and likely also of other micron-size punctate structures. This article describes the workflow of the Poji macro, presents several examples of its applications, and also points out limitations, as well as respective solutions, and adaptable features to streamline the analysis.",
                "authors": [
                    {
                        "name": "Cervero P."
                    },
                    {
                        "name": "Herzog R."
                    },
                    {
                        "name": "Linder S."
                    },
                    {
                        "name": "Van Den Dries K."
                    }
                ],
                "citationCount": 1,
                "date": "2020-04-01T00:00:00Z",
                "journal": "Journal of Cell Science",
                "title": "Poji: A Fiji-based tool for analysis of podosomes and associated proteins"
            },
            "pmid": "32152182"
        }
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ],
    "validated": 1
}
