{
    "additionDate": "2021-11-29T12:59:24.830200Z",
    "biotoolsCURIE": "biotools:scsensitivegenedefine",
    "biotoolsID": "scsensitivegenedefine",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "xmzhang@ips.ac.cn",
            "name": "Xiaoming Zhang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "phao@ips.ac.cn",
            "name": "Pei Hao",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "scSensitiveGeneDefine is a tool for sensitive gene detection in single-cell RNA sequencing data by Shannon entropy.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Expression profile clustering",
                    "uri": "http://edamontology.org/operation_0313"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Zechuan-Chen/scSensitiveGeneDefine",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-11-29T12:59:24.832894Z",
    "name": "scSensitiveGeneDefine",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04136-1",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Single-cell RNA sequencing (scRNA-seq) is the most widely used technique to obtain gene expression profiles from complex tissues. Cell subsets and developmental states are often identified via differential gene expression patterns. Most of the single-cell tools utilized highly variable genes to annotate cell subsets and states. However, we have discovered that a group of genes, which sensitively respond to environmental stimuli with high coefficients of variation (CV), might impose overwhelming influences on the cell type annotation. Result: In this research, we developed a method, based on the CV-rank and Shannon entropy, to identify these noise genes, and termed them as “sensitive genes”. To validate the reliability of our methods, we applied our tools in 11 single-cell data sets from different human tissues. The results showed that most of the sensitive genes were enriched pathways related to cellular stress response. Furthermore, we noticed that the unsupervised result was closer to the ground-truth cell labels, after removing the sensitive genes detected by our tools. Conclusion: Our study revealed the prevalence of stochastic gene expression patterns in most types of cells, compared the differences among cell marker genes, housekeeping genes (HK genes), and sensitive genes, demonstrated the similarities of functions of sensitive genes in various scRNA-seq data sets, and improved the results of unsupervised clustering towards the ground-truth labels. We hope our method would provide new insights into the reduction of data noise in scRNA-seq data analysis and contribute to the development of better scRNA-seq unsupervised clustering algorithms in the future.",
                "authors": [
                    {
                        "name": "Chen Z."
                    },
                    {
                        "name": "Yang Z."
                    },
                    {
                        "name": "Yuan X."
                    },
                    {
                        "name": "Zhang X."
                    },
                    {
                        "name": "Hao P."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "scSensitiveGeneDefine: sensitive gene detection in single-cell RNA sequencing data by Shannon entropy"
            },
            "pmcid": "PMC8063398",
            "pmid": "33888056",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        }
    ]
}