{
    "additionDate": "2017-12-18T00:13:48Z",
    "biotoolsCURIE": "biotools:transgenescan",
    "biotoolsID": "transgenescan",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://mendel.informatics.indiana.edu/~yye/lab/index.php"
        }
    ],
    "description": "Software tool for finding genes in assembled transcripts from metatranscriptomic sequences.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/COL-IU/TransGeneScan"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                }
            ]
        }
    ],
    "homepage": "https://github.com/COL-IU/TransGeneScan",
    "language": [
        "Python",
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/transgenescan-gene-finding-tool-for-metatranscriptomic-sequences.html"
        }
    ],
    "name": "TransGeneScan",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-15-S9-S8",
            "metadata": {
                "abstract": "© 2014 Ismail et al.; licensee BioMed Central Ltd.Background: Metatranscriptomic sequencing is a highly sensitive bioassay of functional activity in a microbial community, providing complementary information to the metagenomic sequencing of the community. The acquisition of the metatranscriptomic sequences will enable us to refine the annotations of the metagenomes, and to study the gene activities and their regulation in complex microbial communities and their dynamics. Results: In this paper, we present TransGeneScan, a software tool for finding genes in assembled transcripts from metatranscriptomic sequences. By incorporating several features of metatranscriptomic sequencing, including strand-specificity, short intergenic regions, and putative antisense transcripts into a Hidden Markov Model, TranGeneScan can predict a sense transcript containing one or multiple genes (in an operon) or an antisense transcript. Conclusion: We tested TransGeneScan on a mock metatranscriptomic data set containing three known bacterial genomes. The results showed that TranGeneScan performs better than metagenomic gene finders (MetaGeneMark and FragGeneScan) on predicting protein coding genes in assembled transcripts, and achieves comparable or even higher accuracy than gene finders for microbial genomes (Glimmer and GeneMark). These results imply, with the assistance of metatranscriptomic sequencing, we can obtain a broad and precise picture about the genes (and their functions) in a microbial community. Availability: TransGeneScan is available as open-source software on SourceForge at https://sourceforge.net/projects/transgenescan/",
                "authors": [
                    {
                        "name": "Ismail W.M."
                    },
                    {
                        "name": "Ye Y."
                    },
                    {
                        "name": "Tang H."
                    }
                ],
                "citationCount": 23,
                "date": "2014-09-10T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Gene finding in metatranscriptomic sequences"
            },
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/nar/gkq747",
            "metadata": {
                "abstract": "The advances of next-generation sequencing technology have facilitated metagenomics research that attempts to determine directly the whole collection of genetic material within an environmental sample (i.e. the metagenome). Identification of genes directly from short reads has become an important yet challenging problem in annotating metagenomes, since the assembly of metagenomes is often not available. Gene predictors developed for whole genomes (e.g. Glimmer) and recently developed for metagenomic sequences (e.g. MetaGene) show a significant decrease in performance as the sequencing error rates increase, or as reads get shorter. We have developed a novel gene prediction method FragGeneScan, which combines sequencing error models and codon usages in a hidden Markov model to improve the prediction of protein-coding region in short reads. The performance of FragGeneScan was comparable to Glimmer and MetaGene for complete genomes. But for short reads, FragGeneScan consistently outperformed MetaGene (accuracy improved ∼62% for reads of 400 bases with 1% sequencing errors, and ∼18% for short reads of 100 bases that are error free). When applied to metagenomes, FragGeneScan recovered substantially more genes than MetaGene predicted (90% of the genes identified by homology search), and many novel genes with no homologs in current protein sequence database. © The Author(s) 2010.",
                "authors": [
                    {
                        "name": "Rho M."
                    },
                    {
                        "name": "Tang H."
                    },
                    {
                        "name": "Ye Y."
                    }
                ],
                "citationCount": 452,
                "date": "2010-11-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "FragGeneScan: Predicting genes in short and error-prone reads"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1,
    "version": [
        "1.2.1"
    ]
}