{
    "additionDate": "2021-01-18T10:12:49Z",
    "biotoolsCURIE": "biotools:snexpression",
    "biotoolsID": "snexpression",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "massimiliano.depierro@unito.it",
            "name": "Massimiliano De Pierro",
            "typeEntity": "Person"
        }
    ],
    "description": "A Symbolic Calculator for Symmetric Net Expressions.\n\nA tool for Symmetric Nets structural analysis.\n\nDownload SNexpression and related utilities.\n\nSNexpression is a software tool for structural analysis of Symmetric Nets (SN). It is composed by two software layers: a Library for Symbolic Calculus (LSC) and a Command Line Interface (CLI), implementing a symbolic calculus operating on SN arc expressions. The CLI is a parser of expressions denoting structural relationships in SN models, it reads from the standard input, thus it can be used as a user interface or can be integrated in other tools for the design of SN models.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://www.di.unito.it/~depierro/SNexpression",
    "lastUpdate": "2021-02-20T08:41:12Z",
    "name": "SNexpression",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1007/978-3-030-51831-8_19",
            "metadata": {
                "abstract": "© 2020, Springer Nature Switzerland AG.The paper presents SNexpression: a tool for the symbolic structural analysis of Symmetric Nets (SN). It can operate at a low level, handling expressions required to compute the structural properties of interest, but features also a net-based way of interaction allowing to submit commands referring directly to the net structure avoiding error prone input of low level expressions. The User Interface implements a command line interpreter and provides also a multi-page notebook to keep track of the submitted commands and their result.",
                "authors": [
                    {
                        "name": "Capra L."
                    },
                    {
                        "name": "De Pierro M."
                    },
                    {
                        "name": "Franceschinis G."
                    }
                ],
                "citationCount": 2,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics)",
                "title": "SNexpression: A Symbolic Calculator for Symmetric Net Expressions"
            },
            "pmcid": "PMC7324237"
        }
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        }
    ]
}