{
    "accessibility": "Open access",
    "additionDate": "2024-01-03T21:43:37.162391Z",
    "biotoolsCURIE": "biotools:flust",
    "biotoolsID": "flust",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ingvild.k.ekroll@ntnu.no",
            "name": "Ingvild Kinn Ekroll",
            "orcidid": "https://orcid.org/0000-0002-0540-0201"
        }
    ],
    "description": "A fast, open source framework for ultrasound blood flow simulations.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Spectral analysis",
                    "uri": "http://edamontology.org/operation_3214"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://www.ustb.no/flust",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2024-11-24T14:23:39.864727Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://bitbucket.org/ustb/ustb/src/master/"
        }
    ],
    "name": "FLUST",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/j.cmpb.2023.107604",
            "metadata": {
                "abstract": "Background and objective:Ultrasound based blood velocity estimation is a continuously developing frontier, where the vast number of possible acquisition setups and velocity estimators makes it challenging to assess which combination is better suited for a given imaging application. FLUST, the Flow-Line based Ultrasound Simulation Tool, may be used to address this challenge, providing a common platform for evaluation of velocity estimation schemes on in silico data. However, the FLUST approach had some limitations in its original form, including reduced robustness for phase sensitive setups and the need for manual selection of integrity parameters. In addition, implementation of the technique and therefore also documentation of signal integrity was left to potential users of the approach. Methods: In this work, several improvements to the FLUST technique are proposed and investigated, and a robust, open source simulation framework developed. The software supports several transducer types and acquisition setups, in addition to a range of different flow phantoms. The main goal of this work is to offer a robust, computationally cheap and user-friendly framework to simulate ultrasound data from stationary blood velocity fields and thereby facilitate design and evaluation of estimation schemes, including acquisition design, velocity estimation and other post-processing steps. Results: The technical improvements proposed in this work resulted in reduced interpolation errors, reduced variability in signal power, and also automatic selection of spatial and temporal discretization parameters. Results are presented illustrating the challenges and the effectiveness of the solutions. The integrity of the improved simulation framework is validated in an extensive study, with results indicating that speckle statistics, spatial and temporal correlation and frequency content all correspond well with theoretical predictions. Finally, an illustrative example shows how FLUST may be used throughout the design and optimization process of a velocity estimator. Conclusions: The FLUST framework is available as a part of the UltraSound ToolBox (USTB), and the results in this paper demonstrate that it can be used as an efficient and reliable tool for the development and validation of ultrasound-based velocity estimation schemes.",
                "authors": [
                    {
                        "name": "Avdal J."
                    },
                    {
                        "name": "Ekroll I.K."
                    },
                    {
                        "name": "Saris A.E.C.M."
                    }
                ],
                "citationCount": 3,
                "date": "2023-08-01T00:00:00Z",
                "journal": "Computer Methods and Programs in Biomedicine",
                "title": "FLUST: A fast, open source framework for ultrasound blood flow simulations"
            },
            "pmid": "37220679",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Suite"
    ],
    "topic": [
        {
            "term": "Echography",
            "uri": "http://edamontology.org/topic_3954"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        }
    ]
}
