{
    "accessibility": "Open access",
    "additionDate": "2022-08-17T19:55:29.973289Z",
    "biotoolsCURIE": "biotools:singan-seg",
    "biotoolsID": "singan-seg",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "vajira@simula.no",
            "name": "Vajira Thambawita",
            "orcidid": "https://orcid.org/0000-0001-6026-0929",
            "typeEntity": "Person"
        },
        {
            "name": "Pegah Salehi"
        },
        {
            "name": "Pål Halvorsen"
        },
        {
            "name": "Michael A. Riegler",
            "orcidid": "https://orcid.org/0000-0002-3153-2064"
        },
        {
            "name": "Thomas de Lange",
            "orcidid": "https://orcid.org/0000-0003-3989-7487"
        }
    ],
    "description": "Synthetic training data generation for medical image segmentation.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Image annotation",
                    "uri": "http://edamontology.org/operation_3553"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://pypi.org/project/singan-seg-polyp/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-08-17T19:55:29.975848Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/vlbthambawita/singan-seg-polyp"
        }
    ],
    "name": "SinGAN-Seg",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0267976",
            "metadata": {
                "abstract": "© 2022 Thambawita et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Analyzing medical data to find abnormalities is a time-consuming and costly task, particularly for rare abnormalities, requiring tremendous efforts from medical experts. Therefore, artificial intelligence has become a popular tool for the automatic processing of medical data, acting as a supportive tool for doctors. However, the machine learning models used to build these tools are highly dependent on the data used to train them. Large amounts of data can be difficult to obtain in medicine due to privacy reasons, expensive and time-consuming annotations, and a general lack of data samples for infrequent lesions. In this study, we present a novel synthetic data generation pipeline, called SinGAN-Seg, to produce synthetic medical images with corresponding masks using a single training image. Our method is different from the traditional generative adversarial networks (GANs) because our model needs only a single image and the corresponding ground truth to train. We also show that the synthetic data generation pipeline can be used to produce alternative artificial segmentation datasets with corresponding ground truth masks when real datasets are not allowed to share. The pipeline is evaluated using qualitative and quantitative comparisons between real data and synthetic data to show that the style transfer technique used in our pipeline significantly improves the quality of the generated data and our method is better than other state-of-the-art GANs to prepare synthetic images when the size of training datasets are limited. By training UNet++ using both real data and the synthetic data generated from the SinGAN-Seg pipeline, we show that the models trained on synthetic data have very close performances to those trained on real data when both datasets have a considerable amount of training data. In contrast, we show that synthetic data generated from the SinGAN-Seg pipeline improves the performance of segmentation models when training datasets do not have a considerable amount of data. All experiments were performed using an open dataset and the code is publicly available on GitHub.",
                "authors": [
                    {
                        "name": "Halvorsen P."
                    },
                    {
                        "name": "Hammer H.L."
                    },
                    {
                        "name": "Hicks S.A."
                    },
                    {
                        "name": "Parasa S."
                    },
                    {
                        "name": "Riegler M.A."
                    },
                    {
                        "name": "Salehi P."
                    },
                    {
                        "name": "Sheshkal S.A."
                    },
                    {
                        "name": "Thambawita V."
                    },
                    {
                        "name": "de Lange T."
                    }
                ],
                "date": "2022-05-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "SinGAN-Seg: Synthetic training data generation for medical image segmentation"
            },
            "pmcid": "PMC9060378",
            "pmid": "35500005"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ]
}
