{
    "additionDate": "2021-01-18T07:11:01Z",
    "biotoolsCURIE": "biotools:pperturb",
    "biotoolsID": "pperturb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "athi@iitm.ac.in",
            "name": "Athi N. Naganathan",
            "typeEntity": "Person"
        }
    ],
    "description": "A Server for Predicting Long-Distance Energetic Couplings and Mutation-Induced Stability Changes in Proteins via Perturbations.\n\nExtracting Energetic Couplings and Destabilization Thermodynamics via Perturbations.\n\npPerturb provides a rapid and experimentally consistent measure of the extent to which a particular residue is coupled to its neighbors till a distance of nearly 12-15 Å, considering both the first- and second-shell of interactions. The server can be used as a first step to explore the strength of the interaction network around a particular residue. A functional form of the percolation within the interaction network will also be provided to the user.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant effect prediction",
                    "uri": "http://edamontology.org/operation_0331"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Protein interaction network prediction",
                    "uri": "http://edamontology.org/operation_3094"
                },
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Transmembrane protein prediction",
                    "uri": "http://edamontology.org/operation_0269"
                }
            ]
        }
    ],
    "homepage": "http://pbl.biotech.iitm.ac.in/pPerturb",
    "lastUpdate": "2021-01-27T16:09:23Z",
    "name": "pPerturb",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1021/ACSOMEGA.9B03371",
            "metadata": {
                "abstract": "© 2020 American Chemical Society.The strength of intraprotein interactions or contact network is one of the dominant factors determining the thermodynamic stabilities of proteins. The nature and the extent of connectivity of this network also play a role in allosteric signal propagation characteristics upon ligand binding to a protein domain. Here, we develop a server for rapid quantification of the strength of an interaction network by employing an experimentally consistent perturbation approach previously validated against a large data set of 375 mutations in 19 different proteins. The web server can be employed to predict the extent of destabilization of proteins arising from mutations in the protein interior in experimentally relevant units. Moreover, coupling distances - a measure of the extent of percolation on perturbation - and overall perturbation magnitudes are predicted in a residue-specific manner, enabling a first look at the distribution of energetic couplings in a protein or its changes upon ligand binding. We show specific examples of how the server can be employed to probe for the distribution of local stabilities in a protein, to examine changes in side chain orientations or packing before and after ligand binding, and to predict changes in stabilities of proteins upon mutations of buried residues. The web server is freely available at http://pbl.biotech.iitm.ac.in/pPerturb and supports recent versions of all major browsers.",
                "authors": [
                    {
                        "name": "Gopi S."
                    },
                    {
                        "name": "Devanshu D."
                    },
                    {
                        "name": "Rajasekaran N."
                    },
                    {
                        "name": "Anantakrishnan S."
                    },
                    {
                        "name": "Naganathan A.N."
                    }
                ],
                "citationCount": 2,
                "date": "2020-01-21T00:00:00Z",
                "journal": "ACS Omega",
                "title": "PPerturb: A Server for Predicting Long-Distance Energetic Couplings and Mutation-Induced Stability Changes in Proteins via Perturbations"
            },
            "pmcid": "PMC6977024",
            "pmid": "31984271"
        }
    ],
    "topic": [
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Membrane and lipoproteins",
            "uri": "http://edamontology.org/topic_0820"
        }
    ]
}