{
    "additionDate": "2021-01-18T08:57:55Z",
    "biotoolsCURIE": "biotools:myominer",
    "biotoolsID": "myominer",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "w.duddy@ulster.ac.uk",
            "name": "William J. Duddy",
            "orcidid": "https://orcid.org/0000-0003-2239-9094",
            "typeEntity": "Person"
        }
    ],
    "description": "explore gene co-expression in normal and pathological muscle.\n\nMyoMiner doesn't collect any personal information, but does use some cookies (including google analytics to track basic usage) Learn more OK.\n\nCo-expression analyses will help muscle researchers to delineate the tissue-, cell-, and pathology-specific elements of muscle protein interactions, cell signaling and gene regulation. Changes in co-expression between pathologic and healthy tissue may suggest new disease mechanisms and therapeutic targets. MyoMiner is a powerful muscle specific database for the discovery of genes that are associated in related functions based on their co-expression.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                }
            ]
        }
    ],
    "homepage": "https://www.sys-myo.com/myominer",
    "lastUpdate": "2021-03-08T08:25:36Z",
    "name": "MyoMiner",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12920-020-0712-3",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: High-throughput transcriptomics measures mRNA levels for thousands of genes in a biological sample. Most gene expression studies aim to identify genes that are differentially expressed between different biological conditions, such as between healthy and diseased states. However, these data can also be used to identify genes that are co-expressed within a biological condition. Gene co-expression is used in a guilt-by-association approach to prioritize candidate genes that could be involved in disease, and to gain insights into the functions of genes, protein relations, and signaling pathways. Most existing gene co-expression databases are generic, amalgamating data for a given organism regardless of tissue-type. Methods: To study muscle-specific gene co-expression in both normal and pathological states, publicly available gene expression data were acquired for 2376 mouse and 2228 human striated muscle samples, and separated into 142 categories based on species (human or mouse), tissue origin, age, gender, anatomic part, and experimental condition. Co-expression values were calculated for each category to create the MyoMiner database. Results: Within each category, users can select a gene of interest, and the MyoMiner web interface will return all correlated genes. For each co-expressed gene pair, adjusted p-value and confidence intervals are provided as measures of expression correlation strength. A standardized expression-level scatterplot is available for every gene pair r-value. MyoMiner has two extra functions: (a) a network interface for creating a 2-shell correlation network, based either on the most highly correlated genes or from a list of genes provided by the user with the option to include linked genes from the database and (b) a comparison tool from which the users can test whether any two correlation coefficients from different conditions are significantly different. Conclusions: These co-expression analyses will help investigators to delineate the tissue-, cell-, and pathology-specific elements of muscle protein interactions, cell signaling and gene regulation. Changes in co-expression between pathologic and healthy tissue may suggest new disease mechanisms and help define novel therapeutic targets. Thus, MyoMiner is a powerful muscle-specific database for the discovery of genes that are associated with related functions based on their co-expression. MyoMiner is freely available at https://www.sys-myo.com/myominer",
                "authors": [
                    {
                        "name": "Malatras A."
                    },
                    {
                        "name": "Michalopoulos I."
                    },
                    {
                        "name": "Duguez S."
                    },
                    {
                        "name": "Butler-Browne G."
                    },
                    {
                        "name": "Spuler S."
                    },
                    {
                        "name": "Duddy W.J."
                    }
                ],
                "citationCount": 1,
                "date": "2020-05-11T00:00:00Z",
                "journal": "BMC Medical Genomics",
                "title": "MyoMiner: Explore gene co-expression in normal and pathological muscle"
            },
            "pmcid": "PMC7216615",
            "pmid": "32393257"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}