
{
    "credit": [
        {
            "email": "cburge@mit.edu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://genes.mit.edu/GENSCANinfo.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Molecular genetics",
                "uri": "http://edamontology.org/topic_3321"
            },
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            },
            {
                "term": "Gene structure",
                "uri": "http://edamontology.org/topic_0114"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/genscan-20030218-identification-complete-gene-structures-genomic-dna.html"
        }
    ],
    "publication": [
        {
            "abstract": "We introduce a general probabilistic model of the gene structure of human genomic sequences which incorporates descriptions of the basic transcriptional, translational and splicing signals, as well as length distributions and compositional features of exons, introns and intergenic regions. Distinct sets of model parameters are derived to account for the many substantial differences in gene density and structure observed in distinct C + G compositional regions of the human genome. in addition, new models of the donor and acceptor splice signals are described which capture potentially important dependencies between signal positions. The model is applied to the problem of gene identification in a computer program, GENSCAN, which identifies complete exon/intron structures of genes in genomic DNA. Novel features of the program include the capacity to predict multiple genes in a sequence, to deal with partial as well as complete genes, and to predict consistent sets of genes occurring on either or both DNA strands. GENSCAN is shown to have substantially higher accuracy than existing methods when tested on standardized sets of human and vertebrate genes, with 75 to 80% of exons identified exactly. The program is also capable of indicating fairly accurately the reliability of each predicted exon. Consistently high levels of accuracy are observed for sequences of differing C + G content and for distinct groups of vertebrates.",
            "authors": [
                "Burge C.",
                "Karlin S."
            ],
            "cit_count": 2598,
            "journal": "Journal of Molecular Biology",
            "pmid": "9149143",
            "title": "Prediction of complete gene structures in human genomic DNA",
            "year": "1997-04-25"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:genscan",
        "biotoolsID": "genscan",
        "description": "Identify complete exon/intron structures of genes in genomic DNA. Novel features of the program include the capacity to predict multiple genes in a sequence, to deal with partial as well as complete genes, and to predict consistent sets of genes occurring on either or both DNA strands.",
        "homepage": "http://genes.mit.edu/GENSCANinfo.html",
        "name": "GENSCAN"
    }
}