{
    "additionDate": "2017-08-03T19:03:44Z",
    "biotoolsCURIE": "biotools:unphased",
    "biotoolsID": "unphased",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://sites.google.com/site/fdudbridge/home"
        }
    ],
    "description": "Application for performing genetic association analysis in nuclear families and unrelated subjects. It implements maximum-likelihood inference on haplotype and genotype effects while allowing for uncertain phase and missing genotypes.",
    "documentation": [
        {
            "type": "General",
            "url": "https://sites.google.com/site/fdudbridge/software/unphased-3-1"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid sequence analysis",
                    "uri": "http://edamontology.org/operation_2478"
                }
            ]
        }
    ],
    "homepage": "https://sites.google.com/site/fdudbridge/software/unphased-3-1",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/unphased-3-1-6-association-analysis-nuclear-families-unrelated-subjects.html"
        }
    ],
    "name": "UNPHASED",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Missing data occur in genetic association studies for several reasons including missing family members and uncertain haplotype phase. Maximum likelihood is a commonly used approach to accommodate missing data, but it can be difficult to apply to family-based association studies, because of possible loss of robustness to confounding by population stratification. Here a novel likelihood for nuclear families is proposed, in which distinct sets of association parameters are used to model the parental genotypes and the offspring genotypes. This approach is robust to population structure when the data are complete, and has only minor loss of robustness when there are missing data. It also allows a novel conditioning step that gives valid analysis for multiple offspring in the presence of linkage. Unrelated subjects are included by regarding them as the children of two missing parents. Simulations and theory indicate similar operating characteristics to TRANSMIT, but with no bias with missing data in the presence of linkage. In comparison with FBAT and PCPH, the proposed model is slightly less robust to population structure but has greater power to detect strong effects. In comparison to APL and MITDT, the model is more robust to stratification and can accommodate sibships of any size. The methods are implemented for binary and continuous traits in software, UNPHASED, available from the author. Copyright © 2008 S. Karger AG.",
                "authors": [
                    {
                        "name": "Dudbridge F."
                    }
                ],
                "citationCount": 497,
                "date": "2008-03-01T00:00:00Z",
                "journal": "Human Heredity",
                "title": "Likelihood-based association analysis for nuclear families and unrelated subjects with missing genotype data"
            },
            "pmid": "18382088"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ],
    "validated": 1
}