{
    "additionDate": "2021-01-18T07:02:24Z",
    "biotoolsCURIE": "biotools:mspls",
    "biotoolsID": "mspls",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "a@csala.me",
            "name": "Attila Csala",
            "orcidid": "https://orcid.org/0000-0003-4969-5555",
            "typeEntity": "Person"
        }
    ],
    "description": "Multiset sparse partial least squares path modeling for high dimensional omics data analysis.\n\nSimulation studies for sparse partial least squares path modeling.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway analysis",
                    "uri": "http://edamontology.org/operation_3928"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "homepage": "http://uva.csala.me/mspls",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-01T09:57:41Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/acsala/2018_msPLS"
        }
    ],
    "name": "msPLS",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3286-3",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Recent technological developments have enabled the measurement of a plethora of biomolecular data from various omics domains, and research is ongoing on statistical methods to leverage these omics data to better model and understand biological pathways and genetic architectures of complex phenotypes. Current reviews report that the simultaneous analysis of multiple (i.e. three or more) high dimensional omics data sources is still challenging and suitable statistical methods are unavailable. Often mentioned challenges are the lack of accounting for the hierarchical structure between omics domains and the difficulty of interpretation of genomewide results. This study is motivated to address these challenges. We propose multiset sparse Partial Least Squares path modeling (msPLS), a generalized penalized form of Partial Least Squares path modeling, for the simultaneous modeling of biological pathways across multiple omics domains. msPLS simultaneously models the effect of multiple molecular markers, from multiple omics domains, on the variation of multiple phenotypic variables, while accounting for the relationships between data sources, and provides sparse results. The sparsity in the model helps to provide interpretable results from analyses of hundreds of thousands of biomolecular variables. Results: With simulation studies, we quantified the ability of msPLS to discover associated variables among high dimensional data sources. Furthermore, we analysed high dimensional omics datasets to explore biological pathways associated with Marfan syndrome and with Chronic Lymphocytic Leukaemia. Additionally, we compared the results of msPLS to the results of Multi-Omics Factor Analysis (MOFA), which is an alternative method to analyse this type of data. Conclusions: msPLS is an multiset multivariate method for the integrative analysis of multiple high dimensional omics data sources. It accounts for the relationship between multiple high dimensional data sources while it provides interpretable results through its sparse solutions. The biomarkers found by msPLS in the omics datasets can be interpreted in terms of biological pathways associated with the pathophysiology of Marfan syndrome and of Chronic Lymphocytic Leukaemia. Additionally, msPLS outperforms MOFA in terms of variation explained in the chronic lymphocytic leukaemia dataset while it identifies the two most important clinical markers for Chronic Lymphocytic Leukaemia Availability: http://uva.csala.me/mspls. https://github.com/acsala/2018_msPLS",
                "authors": [
                    {
                        "name": "Csala A."
                    },
                    {
                        "name": "Zwinderman A.H."
                    },
                    {
                        "name": "Hof M.H."
                    }
                ],
                "citationCount": 3,
                "date": "2020-01-09T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Multiset sparse partial least squares path modeling for high dimensional omics data analysis"
            },
            "pmcid": "PMC6953292",
            "pmid": "31918677"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}