
{
    "credit": [
        {
            "email": "gremme@gmail.com",
            "name": "Gordon Gremme",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://gremme.org/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://ediss.sub.uni-hamburg.de/volltexte/2013/6237/pdf/Dissertation.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence feature detection",
                    "uri": "http://edamontology.org/operation_0253"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Animal and Crop Genomics"
        ],
        "language": [
            "C"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Gene structure",
                "uri": "http://edamontology.org/topic_0114"
            },
            {
                "term": "Structure prediction",
                "uri": "http://edamontology.org/topic_0082"
            }
        ]
    },
    "publication": [
        {
            "abstract": "The research area now commonly called 'bioinformatics' has brought together biologists, computer scientists, statisticians, and scientists of many other fields of expertise to work on computational solutions to biological problems. A large number of algorithms and software packages are freely available for many specific tasks, such as sequence alignment, molecular phylogeny reconstruction, or protein structure determination. Rapidly changing needs and demands on data handling capacity challenge the application providers to consistently keep pace. In practice, this has led to many incremental advances and re-writing of code that present the user community with confusing options and a large overhead from non-standardized implementations that need to be integrated into existing work flows. This situation gives much scope for contributions by software engineers. In this article, we describe an example of engineering a software tool for a specific bioinformatics task known as spliced alignment. The problem was motivated by disabling limitations in an original, ad hoc, and yet widely popular implementation by one of the authors. The present collaboration has led to a robust, highly versatile, and extensible tool (named GenomeThreader) that not only overcomes the limitations of the earlier implementation but greatly improves space and time requirements. © 2005 Elsevier B.V. All rights reserved.",
            "authors": [
                "Gremme G.",
                "Brendel V.",
                "Sparks M.E.",
                "Kurtz S."
            ],
            "cit_count": 77,
            "doi": "10.1016/j.infsof.2005.09.005",
            "journal": "Information and Software Technology",
            "title": "Engineering a software tool for gene structure prediction in higher organisms",
            "type": "Primary",
            "year": "2005-12-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:genomethreader",
        "biotoolsID": "genomethreader",
        "description": "Software tool to compute gene structure predictions. The gene structure predictions are calculated using a similarity-based approach where additional cDNA/EST and/or protein sequences are used to predict gene structures via spliced alignments.",
        "homepage": "http://genomethreader.org/",
        "name": "GenomeThreader"
    }
}