{
    "additionDate": "2020-01-14T20:15:39Z",
    "biotoolsCURIE": "biotools:apin",
    "biotoolsID": "apin",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhanghan@nankai.edu.cn",
            "name": "Han Zhang",
            "orcidid": "https://orcid.org/0000-0001-8498-3451",
            "typeEntity": "Person"
        }
    ],
    "description": "Antimicrobial peptide identification using multi-scale convolutional network.\n\nBACKGROUND:Antibiotic resistance has become an increasingly serious problem in the past decades. As an alternative choice, antimicrobial peptides (AMPs) have attracted lots of attention. To identify new AMPs, machine learning methods have been commonly used. More recently, some deep learning methods have also been applied to this problem. RESULTS:In this paper, we designed a deep learning model to identify AMP sequences. We employed the embedding layer and the multi-scale convolutional network in our model. The multi-scale convolutional network, which contains multiple convolutional layers of varying filter lengths, could utilize all latent features captured by the multiple convolutional layers. To further improve the performance, we also incorporated additional information into the designed model and proposed a fusion model",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peptide identification",
                    "uri": "http://edamontology.org/operation_3631"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                },
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                }
            ]
        }
    ],
    "homepage": "https://github.com/zhanglabNKU/APIN",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-02T13:54:54Z",
    "name": "APIN",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3327-Y",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Antibiotic resistance has become an increasingly serious problem in the past decades. As an alternative choice, antimicrobial peptides (AMPs) have attracted lots of attention. To identify new AMPs, machine learning methods have been commonly used. More recently, some deep learning methods have also been applied to this problem. Results: In this paper, we designed a deep learning model to identify AMP sequences. We employed the embedding layer and the multi-scale convolutional network in our model. The multi-scale convolutional network, which contains multiple convolutional layers of varying filter lengths, could utilize all latent features captured by the multiple convolutional layers. To further improve the performance, we also incorporated additional information into the designed model and proposed a fusion model. Results showed that our model outperforms the state-of-the-art models on two AMP datasets and the Antimicrobial Peptide Database (APD)3 benchmark dataset. The fusion model also outperforms the state-of-the-art model on an anti-inflammatory peptides (AIPs) dataset at the accuracy. Conclusions: Multi-scale convolutional network is a novel addition to existing deep neural network (DNN) models. The proposed DNN model and the modified fusion model outperform the state-of-the-art models for new AMP discovery. The source code and data are available at https://github.com/zhanglabNKU/APIN.",
                "authors": [
                    {
                        "name": "Su X."
                    },
                    {
                        "name": "Xu J."
                    },
                    {
                        "name": "Yin Y."
                    },
                    {
                        "name": "Quan X."
                    },
                    {
                        "name": "Zhang H."
                    }
                ],
                "citationCount": 9,
                "date": "2019-12-23T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Antimicrobial peptide identification using multi-scale convolutional network"
            },
            "pmcid": "PMC6929291",
            "pmid": "31870282"
        }
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}