{
    "additionDate": "2021-01-18T10:48:31Z",
    "biotoolsCURIE": "biotools:saigegds",
    "biotoolsID": "saigegds",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "xiuwen.zheng@abbvie.com",
            "name": "Xiuwen Zheng",
            "typeEntity": "Person"
        }
    ],
    "description": "Scalable Implementation of Generalized mixed models using GDS files in Phenome-Wide Association Studies.\n\nScalable implementation of generalized mixed models with highly optimized C++ implementation and integration with Genomic Data Structure (GDS) files. It is designed for single variant tests in large-scale phenome-wide association studies (PheWAS) with millions of variants and samples, controlling for sample structure and case-control imbalance. The implementation is based on the original SAIGE R package (v0.29.4.4). SAIGEgds also implements some of the SPAtest functions in C to speed up the calculation of Saddlepoint approximation. Benchmarks show that SAIGEgds is 5 to 6 times faster than the original SAIGE R package.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://bioconductor.org/packages/SAIGEgds",
    "language": [
        "C++",
        "R"
    ],
    "lastUpdate": "2021-02-10T15:17:15Z",
    "license": "GPL-3.0",
    "name": "SAIGEgds",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA731",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Summary: Phenome-wide association studies (PheWASs) are known to be a powerful tool in discovery and replication of genetic association studies. To reduce the computational burden of PheWAS in the large cohorts, such as the UK Biobank, the SAIGE method has been proposed to control for case-control imbalance and sample relatedness in a tractable manner. However, SAIGE is still computationally intensive when deployed in analyzing the associations of thousands of ICD10-coded phenotypes with whole-genome imputed genotype data. Here, we present a new high-performance statistical R package (SAIGEgds) for large-scale PheWAS using generalized linear mixed models. The package implements the SAIGE method in optimized C++ codes, taking advantage of sparse genotype dosages and integrating the efficient genomic data structure file format. Benchmarks using the UK Biobank White British genotype data (N ≈ 430 K) with coronary heart disease and simulated cases show that the implementation in SAIGEgds is 5-6 times faster than the SAIGE R package. When used in conjunction with high-performance computing clusters, SAIGEgds provides an efficient analysis pipeline for biobank-scale PheWAS.",
                "authors": [
                    {
                        "name": "Davis J.W."
                    },
                    {
                        "name": "Zheng X."
                    }
                ],
                "date": "2021-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "SAIGEgds - An efficient statistical tool for large-scale PheWAS with mixed models"
            },
            "pmid": "32898220"
        }
    ],
    "topic": [
        {
            "term": "Biobank",
            "uri": "http://edamontology.org/topic_3337"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ]
}
