{
    "additionDate": "2019-11-14T18:26:16Z",
    "biotoolsCURIE": "biotools:GrowthEstimate",
    "biotoolsID": "GrowthEstimate",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Krisnart@outlook.com",
            "name": "Krisna Rungruangsak-Torrissen",
            "orcidid": "https://orcid.org/0000-0001-6545-1935",
            "typeEntity": "Person"
        },
        {
            "email": "poma@mmmi.sdu.dk",
            "name": "Poramate Manoonpong",
            "typeEntity": "Person"
        }
    ],
    "description": "A model for studying living resources through digestive efficiency | The neural computational model GrowthEstimate is introduced with focusing on new perspectives for the practical estimation of weight specific growth rate (SGR, % day-1). It is developed using recurrent neural networks of reservoir computing type, for estimating SGR based on the known data of three key biological factors relating to growth",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/RungruangsakTorrissenManoonpong/GrowthEstimate",
    "language": [
        "C++"
    ],
    "lastUpdate": "2020-12-07T08:25:58Z",
    "name": "GrowthEstimate",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0216030",
            "metadata": {
                "abstract": "© 2019 Rungruangsak-Torrissen, Manoonpong. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.The neural computational model GrowthEstimate is introduced with focusing on new perspectives for the practical estimation of weight specific growth rate (SGR, % day–1). It is developed using recurrent neural networks of reservoir computing type, for estimating SGR based on the known data of three key biological factors relating to growth. These factors are: (1) weight (g) for specifying the age of the growth stage; (2) digestive efficiency through the pyloric caecal activity ratio of trypsin to chymotrypsin (T/C ratio) for specifying genetic differences in food utilization and growth potential, basically resulting from food consumption under variations in food quality and environmental conditions; and (3) protein growth efficiency through the condition factor (CF, 100 × g cm–3), as higher dietary protein level affecting higher skeletal growth (length) and resulting in lower CF. The computational model was trained using four datasets of different salmonids with size variations. It was evaluated with 15% of each dataset, resulting in an acceptable range of SGR outputs. Additional tests with different species indicated similarity between the estimated SGR outputs and the real SGR values, and the same ranking of wild population growth. The developed model GrowthEstimate is exceptionally useful for the precise and comparable growth estimation of living resources at individual levels, especially in natural ecosystems where the studied individuals, environmental conditions, food availability and consumption rates cannot be controlled. It is a revelation and will help to minimize uncertainty in wild stock assessment process. This will improve our knowledge in nutritional ecology, through the biochemical effects of climate change and environmental impact on the growth performance quality of aquatic living resources in the wild, as well as in aquaculture. The original GrowthEstimate software is available at GitHub repository (https://github.com/RungruangsakTorrissenManoonpong/GrowthEstimate). All other relevant data are within the paper. It will be improved for generality for future use, and required co-operations of the biodata collections of different species from different climate zones. Therefore, a co-operation will be available.",
                "authors": [
                    {
                        "name": "Rungruangsak-Torrissen K."
                    },
                    {
                        "name": "Manoonpong P."
                    }
                ],
                "citationCount": 1,
                "date": "2019-08-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Neural computational model GrowthEstimate: A model for studying living resources through digestive efficiency"
            },
            "pmcid": "PMC6713322",
            "pmid": "31461459"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Nutritional science",
            "uri": "http://edamontology.org/topic_3390"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}