
{
    "credit": [
        {
            "email": "lucianob@ufl.edu",
            "name": "Brocchieri L",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://genome.ufl.edu/pages/index.html"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://genome.ufl.edu/npact/about"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Annotation",
                    "uri": "http://edamontology.org/operation_0226"
                },
                {
                    "term": "Nucleic acid sequence analysis",
                    "uri": "http://edamontology.org/operation_2478"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            },
            {
                "term": "Nucleic acid sites, features and motifs",
                "uri": "http://edamontology.org/topic_3511"
            },
            {
                "term": "Model organisms",
                "uri": "http://edamontology.org/topic_0621"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/npact-n-profile-analysis-computational-tool.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2015 The Author. Published by Oxford University Press. Motivation: Graphical representations of contrasts in GC usage among codon frame positions (frame analysis) provide evidence of genes missing from the annotations of prokaryotic genomes of high GC content but the qualitative approach of visual frame analysis prevents its applicability on a genomic scale. Results: We developed two quantitative methods for the identification and statistical characterization in sequence regions of three-base periodicity (hits) associated with open reading frame structures. The methods were implemented in the N-Profile Analysis Computational Tool (NPACT), which highlights in graphical representations inconsistencies between newly identified ORFs and pre-existing annotations of coding-regions. We applied the NPACT procedures to two recently annotated strains of the deltaproteobacterium Anaeromyxobacter dehalogenans, identifying in both genomes numerous conserved ORFs not included in the published annotation of coding regions.",
            "authors": [
                "Oden S.",
                "Brocchieri L."
            ],
            "cit_count": 1,
            "journal": "Bioinformatics",
            "pmid": "26048600",
            "title": "Quantitative frame analysis and the annotation of GC-rich (and other) prokaryotic genomes. An application to Anaeromyxobacter dehalogenans",
            "year": "2015-03-25"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:npact",
        "biotoolsID": "npact",
        "description": "Computational and graphical representation tool for gene identification and sequence annotation. Identifies sequence segments of any length with statistically-significant 3-base compositional periodicities and associated with ORF structures .",
        "homepage": "http://genome.ufl.edu/npact/",
        "name": "NPACT"
    }
}