{"credit":[],"documentation":[{"type":"API_DOCUMENTATION","url":"https://www.wikidata.org/w/api.php"}],"download":[{"type":"Downloads page","url":"https://www.wikidata.org/wiki/Wikidata:Database_download"}],"function":[{"operation":[{"term":"Editing","uri":"http://edamontology.org/operation_3096"},{"term":"Standardisation and normalisation","uri":"http://edamontology.org/operation_3435"},{"term":"Aggregation","uri":"http://edamontology.org/operation_3436"}]}],"labels":{"topic":[{"term":"Ontology and terminology","uri":"http://edamontology.org/topic_0089"},{"term":"Medical imaging","uri":"http://edamontology.org/topic_3384"},{"term":"Medical informatics","uri":"http://edamontology.org/topic_3063"}]},"publication":[{"abstract":"© 2019 Elsevier Inc.Created in October 2012, Wikidata is a large-scale, human-readable, machine-readable, multilingual, multidisciplinary, centralized, editable, structured, and linked knowledge-base with an increasing diversity of use cases. Here, we raise awareness of the potential use of Wikidata as a useful resource for biomedical data integration and semantic interoperability between biomedical computer systems. We show the data model and characteristics of Wikidata and explain how this database can be automatically processed by users as well as by computer methods and programs. Then, we give an overview of the medical entities and relations provided by the database and how they can be useful for various medical purposes such as clinical decision support.","authors":["Turki H.","Shafee T.","Hadj Taieb M.A.","Ben Aouicha M.","Vrandecic D.","Das D.","Hamdi H."],"cit_count":0,"doi":"10.1016/J.JBI.2019.103292","journal":"Journal of Biomedical Informatics","pmid":"31557529","title":"Wikidata: A large-scale collaborative ontological medical database","year":"2019-11-01"}],"summary":{"biotoolsCURIE":"biotools:Wikidata","biotoolsID":"Wikidata","description":"A large-scale collaborative ontological medical database | This is an auto-generated MediaWiki API documentation page | Jump to navigation Jump to search | Documentation and examples: https://www.mediawiki.org/wiki/API | the free knowledge base with 67,248,834 data items that anyone can edit  | Wikidata is a free and open knowledge base that can be read and edited by both humans and machines | Wikidata also provides support to many other sites and services beyond just Wikimedia projects! The content of Wikidata is available under a free license , exported using standard formats , and can be interlinked to other open data sets on the linked data web | Status: The MediaWiki API is a mature and stable interface that is actively supported and improved. While we try to avoid it, we may occasionally need to make breaking changes; subscribe to the mediawiki-api-announce mailing list for notice of updates | Granted to: bot, sysop and wikidata-staff","homepage":"http://www.wikidata.org","name":"Wikidata"}}