{
    "additionDate": "2018-05-06T09:53:29Z",
    "biotoolsCURIE": "biotools:crosshub",
    "biotoolsID": "crosshub",
    "credit": [
        {
            "email": "Alex_245@mail.ru",
            "name": "Dmitriev AA",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A tool for multi-way analysis of The Cancer Genome Atlas (TCGA) in the context of gene expression regulation mechanisms.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://sourceforge.net/projects/crosshub/files/README.md/download"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/projects/crosshub/",
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "CrossHub",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/NAR/GKV1478",
            "metadata": {
                "abstract": "© 2016 The Author(s).The contribution of different mechanisms to the regulation of gene expression varies for different tissues and tumors. Complementation of predicted mRNA-miRNA and gene-transcription factor (TF) relationships with the results of expression correlation analyses derived for specific tumor types outlines the interactions with functional impact in the current biomaterial. We developed CrossHub software, which enables two-way identification of most possible TF-gene interactions: on the basis of ENCODE ChIP-Seq binding evidence or Jaspar prediction and co-expression according to the data of The Cancer Genome Atlas (TCGA) project, the largest cancer omics resource. Similarly, CrossHub identifies mRNA-miRNA pairs with predicted or validated binding sites (TargetScan, mirSVR, PicTar, DIANA microT, miRTarBase) and strong negative expression correlations. We observed partial consistency between ChIP-Seq or miRNA target predictions and gene-TF/miRNA co-expression, demonstrating a link between these indicators. Additionally, CrossHub expression-methylation correlation analysis can be used to identify hypermethylated CpG sites or regions with the greatest potential impact on gene expression. Thus, CrossHub is capable of outlining molecular portraits of a specific gene and determining the three most common sources of expression regulation: promoter/enhancer methylation, miRNA interference and TF-mediated activation or repression. CrossHub generates formatted Excel workbooks with the detailed results. CrossHub is freely available at https://sourceforge.net/projects/crosshub/.",
                "authors": [
                    {
                        "name": "Dmitriev A.A."
                    },
                    {
                        "name": "Krasnov G.S."
                    },
                    {
                        "name": "Kudryavtseva A.V."
                    },
                    {
                        "name": "Melnikova N.V."
                    },
                    {
                        "name": "Nasedkina T.V."
                    },
                    {
                        "name": "Senchenko V.N."
                    },
                    {
                        "name": "Zaretsky A.R."
                    },
                    {
                        "name": "Zasedatelev A.S."
                    }
                ],
                "citationCount": 33,
                "date": "2016-01-14T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "CrossHub: A tool for multi-way analysis of the Cancer Genome Atlas (TCGA) in the context of gene expression regulation mechanisms"
            },
            "pmcid": "PMC4838350",
            "pmid": "26773058"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
