
{
    "credit": [
        {
            "email": "rsautera@fhcrc.org",
            "name": "Renan Sauteraud",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "xuekui@uvic.ca",
            "name": "Xuekui Zhang",
            "typeEntity": "Person",
            "typeRoles": [
                "Contributor"
            ]
        }
    ],
    "documentation": [
        {
            "url": "http://bioconductor.org/packages/release/bioc/html/PICS.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/PICS_2.18.0.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical inference",
                    "uri": "http://edamontology.org/operation_3658"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "language": [
            "R"
        ],
        "license": "Artistic-2.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "ChIP-seq",
                "uri": "http://edamontology.org/topic_3169"
            },
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            },
            {
                "term": "DNA binding sites",
                "uri": "http://edamontology.org/topic_3125"
            },
            {
                "term": "Sequence sites, features and motifs",
                "uri": "http://edamontology.org/topic_0160"
            }
        ]
    },
    "publication": [
        {
            "abstract": "ChIP-seq combines chromatin immunoprecipitation with massively parallel short-read sequencing. While it can profile genome-wide in vivo transcription factor-DNA association with higher sensitivity, specificity, and spatial resolution than ChIP-chip, it poses new challenges for statistical analysis that derive from the complexity of the biological systems characterized and from variability and biases in its sequence data. We propose a method called PICS (Probabilistic Inference for ChIP-seq) for identifying regions bound by transcription factors from aligned reads. PICS identifies binding event locations by modeling local concentrations of directional reads, and uses DNA fragment length prior information to discriminate closely adjacent binding events via a Bayesian hierarchicalt-mixture model. It uses precalculated, whole-genome read mappability profiles and a truncatedt-distribution to adjust binding event models for reads that are missing due to local genome repetitiveness. It estimates uncertainties in model parameters that can be used to define confidence regions on binding event locations and to filter estimates. Finally, PICS calculates a per-event enrichment score relative to a control sample, and can use a control sample to estimate a false discovery rate. Using published GABP and FOXA1 data from human cell lines, we show that PICS' predicted binding sites were more consistent with computationally predicted binding motifs than the alternative methods MACS, QuEST, CisGenome, and USeq. We then use a simulation study to confirm that PICS compares favorably to these methods and is robust to model misspecification. © 2010, The International Biometric Society.",
            "authors": [
                "Zhang X.",
                "Robertson G.",
                "Krzywinski M.",
                "Ning K.",
                "Droit A.",
                "Jones S.",
                "Gottardo R."
            ],
            "cit_count": 38,
            "doi": "10.1111/j.1541-0420.2010.01441.x",
            "journal": "Biometrics",
            "pmid": "20528864",
            "title": "PICS: Probabilistic Inference for ChIP-seq",
            "type": "Primary",
            "year": "2011-03-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:pics",
        "biotoolsID": "pics",
        "description": "Probabilistic inference of ChIP-Seq using an empirical Bayes mixture model approach.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/PICS.html",
        "name": "PICS",
        "version": [
            "2.18.0"
        ]
    }
}