{"credit":[{"email":"zivy@moulon.inra.fr","name":"Michel ZIVY","typeEntity":"Person","typeRoles":["Maintainer"]},{"email":"webmaster@ms-utils.org","typeEntity":"Person","typeRoles":["Documentor"],"url":"http://ms-utils.org"}],"function":[{"operation":[{"term":"Spectral analysis","uri":"http://edamontology.org/operation_3214"}]}],"labels":{"collectionID":["ms-utils","Proteomics"],"language":["Java"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Proteomics","uri":"http://edamontology.org/topic_0121"},{"term":"Proteomics experiment","uri":"http://edamontology.org/topic_3520"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://ms-utils.org"}],"publication":[{"abstract":"High throughput MS-based proteomic experiments generate large volumes of complex data and necessitate bioinformatics tools to facilitate their handling. Needs include means to archive data, to disseminate them to the scientific communities, and to organize and annotate them to facilitate their interpretation. We present here an evolution of PROTICdb, a database software that now handles MS data, including quantification. PROTICdb has been developed to be as independent as possible from tools used to produce the data. Biological samples and proteomics data are described using ontology terms. A Taverna workflow is embedded, thus permitting to automatically retrieve information related to identified proteins by querying external databases. Stored data can be displayed graphically and a \"Query Builder\" allows users to make sophisticated queries without knowledge on the underlying database structure. All resources can be accessed programmatically using a Java client API or RESTful web services, allowing the integration of PROTICdb in any portal. An example of application is presented, where proteins extracted from a maize leaf sample by four different methods were compared using a label-free shotgun method. Data are available at http://moulon.inra.fr/protic/public. PROTICdb thus provides means for data storage, enrichment, and dissemination of proteomics data. © 2013 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim.","authors":["Langella O.","Valot B.","Jacob D.","Balliau T.","Flores R.","Hoogland C.","Joets J.","Zivy M."],"cit_count":12,"journal":"Proteomics","pmid":"23468041","title":"Management and dissemination of MS proteomic data with PROTICdb: Example of a quantitative comparison between methods of protein extraction","year":"2013-05-01"}],"summary":{"biotoolsCURIE":"biotools:proticdb","biotoolsID":"proticdb","description":"Proteomic database to store, track, query and compare proteome data.","homepage":"http://pappso.inra.fr/bioinfo/proticdb/","name":"PROTICdb"}}