{
    "additionDate": "2017-08-03T18:35:35Z",
    "biotoolsCURIE": "biotools:admixmap",
    "biotoolsID": "admixmap",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.homepages.ed.ac.uk/pmckeigu/"
        }
    ],
    "description": "Program for modelling admixture, using marker genotypes and trait data on a sample of individuals from an admixed population (such as African-Americans), where the markers have been chosen to have extreme differentials in allele frequencies between two or more of the ancestral populations between which admixture has occurred.",
    "documentation": [
        {
            "note": "PDF included in the homepage",
            "type": [
                "General"
            ],
            "url": "http://www.homepages.ed.ac.uk/pmckeigu/admixmap/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "http://www.homepages.ed.ac.uk/pmckeigu/admixmap/index.html",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:43Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/admixmap-3-8-3100-model-admixture-marker-genotype-data.html"
        }
    ],
    "name": "ADMIXMAP",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Admixture between populations originating on different continents can be exploited to detect disease susceptibility loci at which risk alleles are distributed differentially between these populations. We first examine the statistical power and mapping resolution of this approach in the limiting situation in which gamete admixture and locus ancestry are measured without uncertainty. We show that, for a rare disease, the most efficient design is to study affected individuals only. In a typical African American population (two-way admixture proportions 0.8/0.2, ancestry crossover rate 2 per 100 cM), a study of 800 affected individuals has 90% power to detect at P values <10-5 a locus that generates a risk ratio of 2 between populations, with an expected mapping resolution (size of 95% confidence region for the position of the locus) of 4 cM. In practice, to infer locus ancestry from marker data requires Bayesian computationally intensive methods, as implemented in the program ADMIXMAP. Affected-only study designs require strong prior information on the frequencies of each allele given locus ancestry. We show how data from unadmixed and admixed populations can be combined to estimate these ancestry-specific allele frequencies within the admixed population under study, allowing for variation between allele frequencies in unadmixed and admixed populations. Using simulated data based on the genetic structure of the African American population, we show that 60% of information can be extracted in a test for linkage using markers with an ancestry information content of 36% at 3-cM spacing. As in classic linkage studies, the most efficient strategy is to use markers at a moderate density for an initial genome search and then to saturate regions of putative linkage with additional markers, to extract nearly all information about locus ancestry.",
                "authors": [
                    {
                        "name": "Hoggart C.J."
                    },
                    {
                        "name": "Shriver M.D."
                    },
                    {
                        "name": "Kittles R.A."
                    },
                    {
                        "name": "Clayton D.G."
                    },
                    {
                        "name": "McKeigue P.M."
                    }
                ],
                "citationCount": 242,
                "date": "2004-01-01T00:00:00Z",
                "journal": "American Journal of Human Genetics",
                "title": "Design and Analysis of Admixture Mapping Studies"
            },
            "pmid": "15088268"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ],
    "validated": 1
}