{
    "name": "ProNOI", 
    "description": "Convenient tool for generating atomic-style nano shapes in conjunction with biological macromolecule(s). Charges and radii on the macromolecule atoms and the atoms in the shapes are assigned according to the user’s preferences allowing various scenarios of modeling.", 
    "homepage": "http://compbio.clemson.edu/pronoi", 
    "biotoolsID": "ProNOI", 
    "biotoolsCURIE": "biotools:ProNOI", 
    "version": [], 
    "otherID": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0477", 
                    "term": "Protein modelling"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_2275", 
            "term": "Molecular modelling"
        }, 
        {
            "uri": "http://edamontology.org/topic_0092", 
            "term": "Data visualisation"
        }, 
        {
            "uri": "http://edamontology.org/topic_0078", 
            "term": "Proteins"
        }
    ], 
    "operatingSystem": [
        "Windows"
    ], 
    "language": [
        "Java", 
        "C++"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/9286.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://compbio.clemson.edu/pronoi", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "23217202", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Protein Nano-Object Integrator (ProNOI) for generating atomic style objects for molecular modeling", 
                "abstract": "Background: With the progress of nanotechnology, one frequently has to model biological macromolecules simultaneously with nano-objects. However, the atomic structures of the nano objects are typically not available or they are solid state entities. Because of that, the researchers have to investigate such nano systems by generating models of the nano objects in a manner that the existing software be able to carry the simulations. In addition, it should allow generating composite objects with complex shape by combining basic geometrical figures and embedding biological macromolecules within the system. Results: Here we report the Protein Nano-Object Integrator (ProNOI) which allows for generating atomic-style geometrical objects with user desired shape and dimensions. Unlimited number of objects can be created and combined with biological macromolecules in Protein Data Bank (PDB) format file. Once the objects are generated, the users can use sliders to manipulate their shape, dimension and absolute position. In addition, the software offers the option to charge the objects with either specified surface or volumetric charge density and to model them with user-desired dielectric constants. According to the user preference, the biological macromolecule atoms can be assigned charges and radii according to four different force fields: Amber, Charmm, OPLS and PARSE. The biological macromolecules and the atomic-style objects are exported as a position, charge and radius (PQR) file, or if a default dielectric constant distribution is not selected, it is exported as a position, charge, radius and epsilon (PQRE) file. As illustration of the capabilities of the ProNOI, we created a composite object in a shape of a robot, aptly named the Clemson Robot, whose parts are charged with various volumetric charge densities and holds the barnase-barstar protein complex in its hand. Conclusions: The Protein Nano-Object Integrator (ProNOI) is a convenient tool for generating atomic-style nano shapes in conjunction with biological macromolecule(s). Charges and radii on the macromolecule atoms and the atoms in the shapes are assigned according to the user's preferences allowing various scenarios of modeling. The default output file is in PQR (PQRE) format which is readable by almost any software available in biophysical field. It can be downloaded from:. © 2012 Smith et al.; licensee BioMed Central Ltd.", 
                "date": "2012-12-07T00:00:00Z", 
                "citationCount": 3, 
                "authors": [
                    {
                        "name": "Smith N."
                    }, 
                    {
                        "name": "Campbell B."
                    }, 
                    {
                        "name": "Li L."
                    }, 
                    {
                        "name": "Li C."
                    }, 
                    {
                        "name": "Alexov E."
                    }
                ], 
                "journal": "BMC Structural Biology"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": null, 
            "url": "http://compbio.clemson.edu/contactus", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T18:56:26Z", 
    "lastUpdate": "2018-12-10T12:58:56Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 0, 
    "homepage_status": 0
}