
{
    "credit": [
        {
            "email": "araki@port.kobe-u.ac.jp",
            "name": "Michihiro Araki",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://sites.google.com/site/michihiroaraki/en"
        },
        {
            "email": "akondo@kobe-u.ac.jp",
            "name": "Akihiko Kondo",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://bp.scitec.kobe-u.ac.jp/m-path/aa/"
        },
        {
            "url": "http://bp.scitec.kobe-u.ac.jp/m-path/aa/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Systems biology",
                "uri": "http://edamontology.org/topic_2259"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Metabolomics",
                "uri": "http://edamontology.org/topic_3172"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/m-path-navigating-a-potential-metabolic-pathway.html"
        }
    ],
    "publication": [
        {
            "abstract": "© The Author 2014. Published by Oxford University Press. All rights reserved. Motivation: Construction of synthetic metabolic pathways promises sustainable production of diverse chemicals and materials. To design synthetic metabolic pathways of high value, computational methods are needed to expand present knowledge by mining comprehensive chemical and enzymatic information databases. Several computational methods have been already reported for the metabolic pathway design, but until now computation complexity has limited the diversity of chemical and enzymatic data used. Results: We introduce a computational platform, M-path, to explore synthetic metabolic pathways including putative enzymatic reactions and compounds. M-path is an iterative random algorithm, which makes efficient use of chemical and enzymatic databases to find potential synthetic metabolic pathways. M-path can readily control the search space and perform well compared with exhaustively enumerating possible pathways. A web-based pathway viewer is also developed to check extensive metabolic pathways with evaluation scores on the basis of chemical similarities. We further produce extensive synthetic metabolic pathways for a comprehensive set of alpha amino acids. The scalable nature of M-path enables us to calculate potential metabolic pathways for any given chemicals. Availability and implementation: The web tool and viewer are available for free at http://bp.scitec.kobe-u.ac.jp/m-path/aa/.",
            "authors": [
                "Araki M.",
                "Cox R.S.",
                "Makiguchi H.",
                "Ogawa T.",
                "Taniguchi T.",
                "Miyaoku K.",
                "Nakatsui M.",
                "Hara K.Y.",
                "Kondo A."
            ],
            "cit_count": 13,
            "journal": "Bioinformatics",
            "pmid": "25398612",
            "title": "M-path: A compass for navigating potential metabolic pathways",
            "year": "2015-03-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:m-path",
        "biotoolsID": "m-path",
        "description": "Calculates random combinations of a wide variety of reactions to list potential metabolic routes from initial to target compounds efficiently, which could be a heuristic approach in designing potential metabolic pathways in practical applications.",
        "homepage": "http://bp.scitec.kobe-u.ac.jp/m-path/aa/",
        "name": "M-path"
    }
}