{
    "additionDate": "2020-01-09T17:33:35Z",
    "biotoolsCURIE": "biotools:DNAproDB",
    "biotoolsID": "DNAproDB",
    "confidence_flag": "tool",
    "description": "An expanded database and web-based tool for structural analysis of DNA-protein complexes.\n\nA Database and Web Tool for Structural Analysis of DNA-Protein Complexes.\n\nDNAproDB automatically lays out nucleotide and residue interactions maps elegantly.\n\nUse the form below to search DNAproDB.\n\nDNAproDB is processing pipeline, web server and database which aims to assist researchers in performing structural analysis of DNA-protein complexes.\n\nDNAproDB is a database, structure processing pipeline and web-based visualization tool which makes structural analysis of DNA-protein complexes easy",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://dnaprodb.usc.edu/documentation.html"
        }
    ],
    "download": [
        {
            "type": "Downloads page",
            "url": "https://dnaprodb.usc.edu/download.html"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                },
                {
                    "term": "Protein secondary structure comparison",
                    "uri": "http://edamontology.org/operation_2488"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                }
            ]
        }
    ],
    "homepage": "https://dnaprodb.usc.edu",
    "lastUpdate": "2020-12-22T09:33:01Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://dnaprodb.usc.edu/search.html"
        }
    ],
    "name": "DNAproDB",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/NAR/GKZ889",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press on behalf of Nucleic Acids Research.DNAproDB (https://dnaprodb.usc.edu) is a web-based database and structural analysis tool that offers a combination of data visualization, data processing and search functionality that improves the speed and ease with which researchers can analyze, access and visualize structural data of DNA-protein complexes. In this paper, we report significant improvements made to DNAproDB since its initial release. DNAproDB now supports any DNA secondary structure from typical B-form DNA to single-stranded DNA to G-quadruplexes. We have updated the structure of our data files to support complex DNA conformations, multiple DNA-protein complexes within a DNAproDB entry and model indexing for analysis of ensemble data. Support for chemically modified residues and nucleotides has been significantly improved along with the addition of new structural features, improved structural moiety assignment and use of more sequence-based annotations. We have redesigned our report pages and search forms to support these enhancements, and the DNAproDB website has been improved to be more responsive and user-friendly. DNAproDB is now integrated with the Nucleic Acid Database, and we have increased our coverage of available Protein Data Bank entries. Our database now contains 95% of all available DNA-protein complexes, making our tools for analysis of these structures accessible to a broad community.",
                "authors": [
                    {
                        "name": "Sagendorf J.M."
                    },
                    {
                        "name": "Markarian N."
                    },
                    {
                        "name": "Berman H.M."
                    },
                    {
                        "name": "Rohs R."
                    }
                ],
                "citationCount": 14,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "DNAproDB: An expanded database and web-based tool for structural analysis of DNA-protein complexes"
            },
            "pmid": "31612957"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application",
        "Workflow"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "Protein secondary structure",
            "uri": "http://edamontology.org/topic_3542"
        },
        {
            "term": "Protein structural motifs and surfaces",
            "uri": "http://edamontology.org/topic_0166"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}