{
    "additionDate": "2017-01-13T13:15:30Z",
    "biotoolsCURIE": "biotools:mosaik",
    "biotoolsID": "mosaik",
    "credit": [
        {
            "email": "wanping.lee@bc.edu",
            "name": "Wan Ping Lee",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Reference guided aligner/assembler.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/wanpinglee/MOSAIK"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "https://github.com/wanpinglee/MOSAIK",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "license": "GPL-2.0",
    "maturity": "Mature",
    "name": "MOSAIK",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "doi": "10.1186/1471-2164-15-264",
            "metadata": {
                "abstract": "Background: The rapid evolution in high-throughput sequencing (HTS) technologies has opened up new perspectives in several research fields and led to the production of large volumes of sequence data. A fundamental step in HTS data analysis is the mapping of reads onto reference sequences. Choosing a suitable mapper for a given technology and a given application is a subtle task because of the difficulty of evaluating mapping algorithms.Results: In this paper, we present a benchmark procedure to compare mapping algorithms used in HTS using both real and simulated datasets and considering four evaluation criteria: computational resource and time requirements, robustness of mapping, ability to report positions for reads in repetitive regions, and ability to retrieve true genetic variation positions. To measure robustness, we introduced a new definition for a correctly mapped read taking into account not only the expected start position of the read but also the end position and the number of indels and substitutions. We developed CuReSim, a new read simulator, that is able to generate customized benchmark data for any kind of HTS technology by adjusting parameters to the error types. CuReSim and CuReSimEval, a tool to evaluate the mapping quality of the CuReSim simulated reads, are freely available. We applied our benchmark procedure to evaluate 14 mappers in the context of whole genome sequencing of small genomes with Ion Torrent data for which such a comparison has not yet been established.Conclusions: A benchmark procedure to compare HTS data mappers is introduced with a new definition for the mapping correctness as well as tools to generate simulated reads and evaluate mapping quality. The application of this procedure to Ion Torrent data from the whole genome sequencing of small genomes has allowed us to validate our benchmark procedure and demonstrate that it is helpful for selecting a mapper based on the intended application, questions to be addressed, and the technology used. This benchmark procedure can be used to evaluate existing or in-development mappers as well as to optimize parameters of a chosen mapper for any application and any sequencing platform. © 2014 Caboche et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Audebert C."
                    },
                    {
                        "name": "Caboche S."
                    },
                    {
                        "name": "Hot D."
                    },
                    {
                        "name": "Lemoine Y."
                    }
                ],
                "citationCount": 57,
                "date": "2014-04-05T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Comparison of mapping algorithms used in high-throughput sequencing: Application to Ion Torrent data"
            },
            "pmcid": "PMC4051166",
            "pmid": "24708189",
            "type": [
                "Benchmarking study"
            ]
        },
        {
            "doi": "10.1371/journal.pone.0090581",
            "metadata": {
                "abstract": "MOSAIK is a stable, sensitive and open-source program for mapping second and third-generation sequencing reads to a reference genome. Uniquely among current mapping tools, MOSAIK can align reads generated by all the major sequencing technologies, including Illumina, Applied Biosystems SOLiD, Roche 454, Ion Torrent and Pacific BioSciences SMRT. Indeed, MOSAIK was the only aligner to provide consistent mappings for all the generated data (sequencing technologies, low-coverage and exome) in the 1000 Genomes Project. To provide highly accurate alignments, MOSAIK employs a hash clustering strategy coupled with the Smith-Waterman algorithm. This method is well-suited to capture mismatches as well as short insertions and deletions. To support the growing interest in larger structural variant (SV) discovery, MOSAIK provides explicit support for handling known-sequence SVs, e.g. mobile element insertions (MEIs) as well as generating outputs tailored to aid in SV discovery. All variant discovery benefits from an accurate description of the read placement confidence. To this end, MOSAIK uses a neural-network based training scheme to provide well-calibrated mapping quality scores, demonstrated by a correlation coefficient between MOSAIK assigned and actual mapping qualities greater than 0.98. In order to ensure that studies of any genome are supported, a training pipeline is provided to ensure optimal mapping quality scores for the genome under investigation. MOSAIK is multi-threaded, open source, and incorporated into our command and pipeline launcher system GKNO (http://gkno.me). © 2014 Lee et al.",
                "authors": [
                    {
                        "name": "Garrison E.P."
                    },
                    {
                        "name": "Lee W.-P."
                    },
                    {
                        "name": "Marth G.T."
                    },
                    {
                        "name": "Stewart C."
                    },
                    {
                        "name": "Stromberg M.P."
                    },
                    {
                        "name": "Ward A."
                    }
                ],
                "citationCount": 182,
                "date": "2014-03-05T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "MOSAIK: A hash-based algorithm for accurate next-generation sequencing short-read mapping"
            },
            "pmcid": "PMC3944147",
            "pmid": "24599324",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Suite"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ],
    "validated": 1
}
