{
    "additionDate": "2018-08-11T10:00:32Z",
    "biotoolsCURIE": "biotools:crispor",
    "biotoolsID": "crispor",
    "credit": [
        {
            "email": "crispor@tefor.net",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Design, evaluate and clone guide sequences for the CRISPR/Cas9 system.",
    "documentation": [
        {
            "type": "User manual",
            "url": "http://crispor.tefor.net/manual/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Target-Decoy",
                    "uri": "http://edamontology.org/operation_3649"
                }
            ]
        }
    ],
    "homepage": "http://crispor.tefor.net/",
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "CC-BY-4.0",
    "name": "CRISPOR",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s13059-016-1012-2",
            "metadata": {
                "abstract": "© 2016 The Author(s). Background: The success of the CRISPR/Cas9 genome editing technique depends on the choice of the guide RNA sequence, which is facilitated by various websites. Despite the importance and popularity of these algorithms, it is unclear to which extent their predictions are in agreement with actual measurements. Results: We conduct the first independent evaluation of CRISPR/Cas9 predictions. To this end, we collect data from eight SpCas9 off-target studies and compare them with the sites predicted by popular algorithms. We identify problems in one implementation but found that sequence-based off-target predictions are very reliable, identifying most off-targets with mutation rates superior to 0.1 %, while the number of false positives can be largely reduced with a cutoff on the off-target score. We also evaluate on-target efficiency prediction algorithms against available datasets. The correlation between the predictions and the guide activity varied considerably, especially for zebrafish. Together with novel data from our labs, we find that the optimal on-target efficiency prediction model strongly depends on whether the guide RNA is expressed from a U6 promoter or transcribed in vitro. We further demonstrate that the best predictions can significantly reduce the time spent on guide screening. Conclusions: To make these guidelines easily accessible to anyone planning a CRISPR genome editing experiment, we built a new website ( http://crispor.org ) that predicts off-targets and helps select and clone efficient guide sequences for more than 120 genomes using different Cas9 proteins and the eight efficiency scoring systems evaluated here.",
                "authors": [
                    {
                        "name": "Haeussler M."
                    },
                    {
                        "name": "Schonig K."
                    },
                    {
                        "name": "Eckert H."
                    },
                    {
                        "name": "Eschstruth A."
                    },
                    {
                        "name": "Mianne J."
                    },
                    {
                        "name": "Renaud J.-B."
                    },
                    {
                        "name": "Schneider-Maunoury S."
                    },
                    {
                        "name": "Shkumatava A."
                    },
                    {
                        "name": "Teboul L."
                    },
                    {
                        "name": "Kent J."
                    },
                    {
                        "name": "Joly J.-S."
                    },
                    {
                        "name": "Concordet J.-P."
                    }
                ],
                "citationCount": 167,
                "date": "2016-07-05T00:00:00Z",
                "journal": "Genome Biology",
                "title": "Evaluation of off-target and on-target scoring algorithms and integration into the guide RNA selection tool CRISPOR"
            }
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1
}