{
    "additionDate": "2021-01-18T09:18:24Z",
    "biotoolsCURIE": "biotools:egs_brachy",
    "biotoolsID": "egs_brachy",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "rthomson@physics.carleton.ca",
            "name": "Rowan M. Thomson",
            "typeEntity": "Person"
        }
    ],
    "description": "egs_brachy is an egs++ application for rapid brachytherapy calculations for both photon and electron sources.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                }
            ]
        }
    ],
    "homepage": "https://github.com/clrp-code/egs_brachy/",
    "lastUpdate": "2021-03-05T16:13:58Z",
    "license": "AGPL-3.0",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://physics.carleton.ca/clrp/egs_brachy/"
        }
    ],
    "name": "egs_brachy",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1002/MP.14249",
            "metadata": {
                "abstract": "© 2020 American Association of Physicists in MedicinePurpose: To update the Carleton Laboratory for Radiotherapy Physics (CLRP) TG-43 dosimetry database for low-energy (≤50 keV) photon-emitting low-dose rate (LDR) brachytherapy sources utilizing the open-source EGSnrc application egs_brachy rather than the BrachyDose application used previously for 27 LDR sources in the 2008 CLRP version (CLRPv1). CLRPv2 covers 40 sources ((Formula presented.) Pd, (Formula presented.) I, and (Formula presented.) Cs). A comprehensive set of TG-43 parameters is calculated, including dose-rate constants, radial dose functions with functional fitting parameters, 1D and 2D anisotropy functions, along-away dose-rate tables, Primary-Scatter separation dose tables (for some sources), and mean photon energies at the surface of the sources. The database also documents the source models which will become part of the egs_brachy distribution. Acquisition and validation methods: Datasets are calculated after a systematic recoding of the source geometries using the egs++ geometry package and its egs_brachy extensions. Air-kerma strength per history is calculated for models of NIST’s Wide-Angle Free-Air chamber (WAFAC) and for a point detector located at 10 cm on the source’s transverse axis. Full scatter water phantoms with varying voxel resolutions in cylindrical coordinates are used for dose calculations. New statistical uncertainties of source volume corrections for phantom voxels which overlap with brachytherapy sources are implemented in egs_brachy, and all CLRPv2 data include these uncertainties. For validation, data are compared to CLRPv1 and other data in the literature. Data format and access: Data are available at https://physics.carleton.ca/clrp/egs_brachy/seed_database_v2, http://doi.org/10.22215/clrp/tg43v2. As well as being presented graphically in comparisons to previous calculations, data are available in Excel (.xlsx) spreadsheets for each source. Potential applications: The database has applications in research, dosimetry, and brachytherapy treatment planning. This comprehensive update provides the medical physics community with more accurate TG-43 dose evaluation parameters, as well as fully benchmarked and described source models which are distributed with egs_brachy.",
                "authors": [
                    {
                        "name": "Safigholi H."
                    },
                    {
                        "name": "Chamberland M.J.P."
                    },
                    {
                        "name": "Taylor R.E.P."
                    },
                    {
                        "name": "Allen C.H."
                    },
                    {
                        "name": "Martinov M.P."
                    },
                    {
                        "name": "Rogers D.W.O."
                    },
                    {
                        "name": "Thomson R.M."
                    }
                ],
                "date": "2020-09-01T00:00:00Z",
                "journal": "Medical Physics",
                "title": "Update of the CLRP TG-43 parameter database for low-energy brachytherapy sources"
            },
            "pmid": "32436344"
        }
    ],
    "topic": [
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        },
        {
            "term": "Biological databases",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ]
}