{
    "additionDate": "2019-11-14T19:50:44Z",
    "biotoolsCURIE": "biotools:hicGAN",
    "biotoolsID": "hicGAN",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ruijiang@tsinghua.edu.cn",
            "name": "Rui Jiang",
            "typeEntity": "Person"
        }
    ],
    "description": "hicGAN infers super resolution Hi-C data with generative adversarial networks | Hi-C data super-resolution with generative adversarial networks | We proposed hicGAN, an open-sourced framework, for inferring high resolution Hi-C data from low resolution Hi-C data with generative adversarial networks (GANs)",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/kimmo1019/hicGAN",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-10T08:20:56Z",
    "license": "MIT",
    "name": "hicGAN",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ317",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Motivation: Hi-C is a genome-wide technology for investigating 3D chromatin conformation by measuring physical contacts between pairs of genomic regions. The resolution of Hi-C data directly impacts the effectiveness and accuracy of downstream analysis such as identifying topologically associating domains (TADs) and meaningful chromatin loops. High resolution Hi-C data are valuable resources which implicate the relationship between 3D genome conformation and function, especially linking distal regulatory elements to their target genes. However, high resolution Hi-C data across various tissues and cell types are not always available due to the high sequencing cost. It is therefore indispensable to develop computational approaches for enhancing the resolution of Hi-C data. Results: We proposed hicGAN, an open-sourced framework, for inferring high resolution Hi-C data from low resolution Hi-C data with generative adversarial networks (GANs). To the best of our knowledge, this is the first study to apply GANs to 3D genome analysis. We demonstrate that hicGAN effectively enhances the resolution of low resolution Hi-C data by generating matrices that are highly consistent with the original high resolution Hi-C matrices. A typical scenario of usage for our approach is to enhance low resolution Hi-C data in new cell types, especially where the high resolution Hi-C data are not available. Our study not only presents a novel approach for enhancing Hi-C data resolution, but also provides fascinating insights into disclosing complex mechanism underlying the formation of chromatin contacts.",
                "authors": [
                    {
                        "name": "Liu Q."
                    },
                    {
                        "name": "Lv H."
                    },
                    {
                        "name": "Jiang R."
                    }
                ],
                "citationCount": 11,
                "date": "2019-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "HicGAN infers super resolution Hi-C data with generative adversarial networks"
            },
            "pmcid": "PMC6612845",
            "pmid": "31510693"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        }
    ],
    "validated": 1
}