{
    "additionDate": "2017-08-03T19:02:31Z",
    "biotoolsCURIE": "biotools:tappred",
    "biotoolsID": "tappred",
    "credit": [
        {
            "email": "raghava@imtech.ernet.in",
            "name": "Dr G P S Raghava",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://imtech.ernet.in/raghava/"
        }
    ],
    "description": "On-line service for predicting binding affinity of peptides toward the TAP transporter. The Prediction is based on cascade SVM, using sequence and properties of the the amino acids.",
    "documentation": [
        {
            "type": "General",
            "url": "http://crdd.osdd.net/raghava/tappred/help.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                },
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                }
            ]
        }
    ],
    "homepage": "http://www.imtech.res.in/raghava/tappred/",
    "lastUpdate": "2018-12-10T12:58:45Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/tappred-predict-peptide-tap-binding-affinity.html"
        }
    ],
    "name": "TAPPred",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "The generation of cytotoxic T lymphocyte (CTL) epitopes from an antigenic sequence involves number of intracellular processes, including production of peptide fragments by proteasome and transport of peptides to endoplasmic reticulum through transporter associated with antigen processing (TAP). In this study, 409 peptides that bind to human TAP transporter with varying affinity were analyzed to explore the selectivity and specificity of TAP transporter. The abundance of each amino acid from P1 to P9 positions in high-, intermediate-, and low-affinity TAP binders were examined. The rules for predicting TAP binding regions in an antigenic sequence were derived from the above analysis. The quantitative matrix was generated on the basis of contribution of each position and residue in binding affinity. The correlation of r = 0.65 was obtained between experimentally determined and predicted binding affinity by using a quantitative matrix. Further a support vector machine (SVM)-based method has been developed to model the TAP binding affinity of peptides. The correlation (r = 0.80) was obtained between the predicted and experimental measured values by using sequence-based SVM. The reliability of prediction was further improved by cascade SVM that uses features of amino acids along with sequence. An extremely good correlation (r = 0.88) was obtained between measured and predicted values, when the cascade SVM-based method was evaluated through jackknife testing. A Web service, TAPPred (http://www.imtech.res.in/raghava/tappred/ or http://bioinformatics.uams.edu/mirror/tappred/), has been developed based on this approach.",
                "authors": [
                    {
                        "name": "Bhasin M."
                    },
                    {
                        "name": "Raghava G.P.S."
                    }
                ],
                "citationCount": 94,
                "date": "2004-03-01T00:00:00Z",
                "journal": "Protein Science",
                "title": "Analysis and prediction of affinity of TAP binding peptides using cascade SVM"
            },
            "pmid": "14978300"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        }
    ],
    "validated": 1
}