{
    "additionDate": "2020-01-14T20:12:16Z",
    "biotoolsCURIE": "biotools:TCSRWRLD",
    "biotoolsID": "TCSRWRLD",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "wanglei@xtu.edu.cn",
            "name": "Lei Wang",
            "orcidid": "https://orcid.org/0000-0002-5065-8447",
            "typeEntity": "Person"
        }
    ],
    "description": "A novel target convergence set based random walk with restart for prediction of potential LncRNA-disease associations.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://www.cuilab.cn/",
    "lastUpdate": "2021-01-16T16:22:29Z",
    "name": "TCSRWRLD",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3216-4",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: In recent years, lncRNAs (long-non-coding RNAs) have been proved to be closely related to the occurrence and development of many serious diseases that are seriously harmful to human health. However, most of the lncRNA-disease associations have not been found yet due to high costs and time complexity of traditional bio-experiments. Hence, it is quite urgent and necessary to establish efficient and reasonable computational models to predict potential associations between lncRNAs and diseases. Results: In this manuscript, a novel prediction model called TCSRWRLD is proposed to predict potential lncRNA-disease associations based on improved random walk with restart. In TCSRWRLD, a heterogeneous lncRNA-disease network is constructed first by combining the integrated similarity of lncRNAs and the integrated similarity of diseases. And then, for each lncRNA/disease node in the newly constructed heterogeneous lncRNA-disease network, it will establish a node set called TCS (Target Convergence Set) consisting of top 100 disease/lncRNA nodes with minimum average network distances to these disease/lncRNA nodes having known associations with itself. Finally, an improved random walk with restart is implemented on the heterogeneous lncRNA-disease network to infer potential lncRNA-disease associations. The major contribution of this manuscript lies in the introduction of the concept of TCS, based on which, the velocity of convergence of TCSRWRLD can be quicken effectively, since the walker can stop its random walk while the walking probability vectors obtained by it at the nodes in TCS instead of all nodes in the whole network have reached stable state. And Simulation results show that TCSRWRLD can achieve a reliable AUC of 0.8712 in the Leave-One-Out Cross Validation (LOOCV), which outperforms previous state-of-the-art results apparently. Moreover, case studies of lung cancer and leukemia demonstrate the satisfactory prediction performance of TCSRWRLD as well. Conclusions: Both comparative results and case studies have demonstrated that TCSRWRLD can achieve excellent performances in prediction of potential lncRNA-disease associations, which imply as well that TCSRWRLD may be a good addition to the research of bioinformatics in the future.",
                "authors": [
                    {
                        "name": "Feng X."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Wang B."
                    },
                    {
                        "name": "Wang L."
                    },
                    {
                        "name": "Zhao B."
                    }
                ],
                "citationCount": 2,
                "date": "2019-12-03T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "A novel target convergence set based random walk with restart for prediction of potential LncRNA-disease associations"
            },
            "pmcid": "PMC6889579",
            "pmid": "31795943"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}
