{
    "additionDate": "2017-12-18T00:12:03Z",
    "biotoolsCURIE": "biotools:rainbow",
    "biotoolsID": "rainbow",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://sourceforge.net/projects/bio-rainbow/"
        }
    ],
    "description": "RAD-seq related clustering and de novo assembly.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://sourceforge.net/projects/bio-rainbow/files/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "http://sourceforge.net/projects/bio-rainbow/",
    "language": [
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/rainbow-v2-0-3-clustering-assembling-short-reads-rad.html"
        }
    ],
    "name": "Rainbow",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/bts482",
            "metadata": {
                "abstract": "Motivation: The innovation of restriction-site associated DNA sequencing (RAD-seq) method takes full advantage of next-generation sequencing technology. By clustering paired-end short reads into groups with their own unique tags, RAD-seq assembly problem is divided into subproblems. Fast and accurately clustering and assembling millions of RAD-seq reads with sequencing errors, different levels of heterozygosity and repetitive sequences is a challenging question. Results: Rainbow is developed to provide an ultra-fast and memoryefficient solution to clustering and assembling short reads produced by RAD-seq. First, Rainbow clusters reads using a spaced seed method. Then, Rainbow implements a heterozygote calling like strategy to divide potential groups into haplotypes in a top-down manner. And along a guided tree, it iteratively merges sibling leaves in a bottom-up manner if they are similar enough. Here, the similarity is defined by comparing the 2nd reads of a RAD segment. This approach tries to collapse heterozygote while discriminate repetitive sequences. At last, Rainbow uses a greedy algorithm to locally assemble merged reads into contigs. Rainbow not only outputs the optimal but also suboptimal assembly results. Based on simulation and a real guppy RAD-seq data, we show that Rainbow is more competent than the other tools in dealing with RAD-seq data. © 2012 The Author.",
                "authors": [
                    {
                        "name": "Chong Z."
                    },
                    {
                        "name": "Ruan J."
                    },
                    {
                        "name": "Wu C.-I."
                    }
                ],
                "citationCount": 65,
                "date": "2012-11-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Rainbow: An integrated tool for efficient clustering and assembling RAD-seq reads"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ],
    "validated": 1,
    "version": [
        "v2.0.4"
    ]
}