{
    "additionDate": "2018-11-26T08:07:44Z",
    "biotoolsCURIE": "biotools:amen",
    "biotoolsID": "amen",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "frederic.chalmel@inserm.fr",
            "name": "Frederic Chalmel",
            "orcidid": "http://orcid.org/0000-0002-0535-3628",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The Annotation, Mapping, Expression and Network (AMEN) software is a stand-alone, unified suite of tools that enables biological and medical researchers with basic bioinformatics training to manage and explore genome annotation, chromosomal mapping, protein-protein interaction, expression profiling and proteomics data. The current version provides modules for (i) uploading and pre-processing data from microarray expression profiling experiments, (ii) detecting groups of significantly co-expressed genes, and (iii) searching for enrichment of functional annotations within those groups. Moreover, the user interface is designed to simultaneously visualize several types of data such as protein-protein interaction networks in conjunction with expression profiles and cellular co-localization patterns. We have successfully applied the program to interpret expression profiling data from budding yeast, rodents and human.",
    "download": [
        {
            "type": "Source code",
            "url": "https://sourceforge.net/projects/amen/"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/projects/amen/",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-25T14:19:43.793298Z",
    "maturity": "Mature",
    "name": "AMEN",
    "owner": "fchalmel",
    "publication": [
        {
            "doi": "10.1186/1471-2105-9-86",
            "metadata": {
                "abstract": "Background: High-throughput genome biological experiments yield large and multifaceted datasets that require flexible and user-friendly analysis tools to facilitate their interpretation by life scientists. Many solutions currently exist, but they are often limited to specific steps in the complex process of data management and analysis and some require extensive informatics skills to be installed and run efficiently. Results: We developed the Annotation, Mapping, Expression and Network (AMEN) software as a stand-alone, unified suite of tools that enables biological and medical researchers with basic bioinformatics training to manage and explore genome annotation, chromosomal mapping, protein-protein interaction, expression profiling and proteomics data. The current version provides modules for (i) uploading and pre-processing data from microarray expression profiling experiments, (ii) detecting groups of significantly co-expressed genes, and (iii) searching for enrichment of functional annotations within those groups. Moreover, the user interface is designed to simultaneously visualize several types of data such as protein-protein interaction networks in conjunction with expression profiles and cellular co-localization patterns. We have successfully applied the program to interpret expression profiling data from budding yeast, rodents and human. Conclusion: AMEN is an innovative solution for molecular systems biological data analysis freely available under the GNU license. The program is available via a website at the Sourceforge portal which includes a user guide with concrete examples, links to external databases and helpful comments to implement additional functionalities. We emphasize that AMEN will continue to be developed and maintained by our laboratory because it has proven to be extremely useful for our genome biological research program. © 2008 Chalmel and Primig; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Chalmel F."
                    },
                    {
                        "name": "Primig M."
                    }
                ],
                "citationCount": 70,
                "date": "2008-02-06T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "The Annotation, Mapping, Expression and Network (AMEN) suite of tools for molecular systems biology"
            },
            "pmcid": "PMC2375118",
            "pmid": "18254954",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Omics",
            "uri": "http://edamontology.org/topic_3391"
        }
    ],
    "validated": 1,
    "version": [
        "1.5.4"
    ]
}
