{
    "additionDate": "2022-12-20T09:26:16.796212Z",
    "biotoolsCURIE": "biotools:autoscanj",
    "biotoolsID": "autoscanj",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "sebastien.tosi@irbbarcelona.org",
            "name": "Sébastien Tosi",
            "typeEntity": "Person"
        }
    ],
    "description": "A suite of ImageJ and Micro-Manager scripts to perform intelligent imaging.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/SebastienTs/AutoScanJ",
    "language": [
        "Java"
    ],
    "lastUpdate": "2024-11-24T15:17:13.556392Z",
    "license": "Apache-2.0",
    "name": "AutoScanJ",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3389/fbinf.2021.627626",
            "metadata": {
                "abstract": "We developed AutoscanJ, a suite of ImageJ scripts enabling to image targets of interest by automatically driving a motorized microscope at the corresponding locations. For live samples, our software can sequentially detect biological events from their onset and further image them at high resolution, an action that would be impractical by user operation. For fixed samples, the software can dramatically reduce the amount of data acquired and the acquisition duration in situations where statistically few targets of interest are observed per field of view. AutoScanJ is compatible with motorized fluorescence microscopes controlled by Leica LAS AF/X or Micro-Manager. The software is straightforward to set up and new custom image analysis workflows to detect targets of interest can be simply implemented and shared with minimal efforts as independent ImageJ macro functions. We illustrate five different application scenarios with the system ranging from samples fixed on micropatterned surfaces to live cells undergoing several rounds of division. The target detection functions for these applications are provided and can be used as a starting point and a source of inspiration for new applications. Overall, AutoScanJ helps to optimize microscope usage by autonomous operation, and it opens up new experimental avenues by enabling the real-time detection and selective imaging of transient events in live microscopy.",
                "authors": [
                    {
                        "name": "Bardia L."
                    },
                    {
                        "name": "Colombelli J."
                    },
                    {
                        "name": "Godo A."
                    },
                    {
                        "name": "Llado A."
                    },
                    {
                        "name": "Rebollo E."
                    },
                    {
                        "name": "Stockinger P."
                    },
                    {
                        "name": "Tosi S."
                    }
                ],
                "citationCount": 5,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Frontiers in Bioinformatics",
                "title": "AutoScanJ: A Suite of ImageJ Scripts for Intelligent Microscopy"
            },
            "pmcid": "PMC9581036",
            "pmid": "36303768"
        }
    ],
    "toolType": [
        "Suite"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
