{
    "accessibility": "Open access",
    "additionDate": "2024-01-02T17:08:47.845586Z",
    "biotoolsCURIE": "biotools:glucokinasedb",
    "biotoolsID": "glucokinasedb",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "pmathur@amity.edu",
            "name": "Puniti Mathur",
            "typeEntity": "Person"
        },
        {
            "name": "Samuel Bharti",
            "typeEntity": "Person"
        },
        {
            "name": "Siddharth Yadav",
            "typeEntity": "Person"
        }
    ],
    "description": "A comprehensive, curated resource of glucokinase modulators for clinical and molecular research.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://glucokinasedb.in",
    "language": [
        "PHP",
        "SQL"
    ],
    "lastUpdate": "2024-01-02T17:08:47.848090Z",
    "name": "GlucoKinaseDB",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.COMPBIOLCHEM.2023.107818",
            "metadata": {
                "abstract": "Glucokinase (GK), an isoform of hexokinase expressed predominantly in liver, pancreas and hypothalamus is crucial to blood glucose management. It is a critical component of the glucose-sensing mechanism of the pancreatic islet cells and glycogen regulation in hepatocytes. GK modulators such as allosteric GKAs (glucokinase activators) and GK-GKRP (glucokinase regulatory protein) disruptors have found potential applications as safer antihyperglycemics. Recent studies have also demonstrated the potential of GK modulators as antiparasitic agents. Researchers targeting GK often undertake the time-consuming task of independently collecting and compiling modulator information due to the lack of any dedicated single-platform resource. Towards this, in the present study we demonstrate the design and development of GlucoKinaseDB (GKDB), a comprehensive, curated, online resource of GK modulators. GKDB contains experimentally derived structural and bioactivity information of 1723 modulators along with their detailed molecular descriptors. The web-interface is user-friendly with features such as in-browser visualization, advanced search queries, cross-links to other databases and original reference etc. The bioactivity and descriptor data can be downloaded in bulk (for entire database) or for individual modulators. The 3D structures are also downloadable in multiple formats. GKDB employs a PHP-based web design with Bootstrap styling and a MySQL database backend. GKDB can be utilized for clinical and molecular research via development of pharmacophore hypotheses, QSAR/QSPR models, predictive machine learning models etc. GKDB is freely accessible online at https://glucokinasedb.in.",
                "authors": [
                    {
                        "name": "Bharti S."
                    },
                    {
                        "name": "Mathur P."
                    },
                    {
                        "name": "Yadav S."
                    }
                ],
                "date": "2023-04-01T00:00:00Z",
                "journal": "Computational Biology and Chemistry",
                "title": "GlucoKinaseDB: A comprehensive, curated resource of glucokinase modulators for clinical and molecular research"
            },
            "pmid": "36680885"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Data submission, annotation and curation",
            "uri": "http://edamontology.org/topic_0219"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
