{
    "additionDate": "2021-01-18T08:11:09Z",
    "biotoolsCURIE": "biotools:2lpirnapred",
    "biotoolsID": "2lpirnapred",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "xrliu@xmu.edu.cn",
            "name": "Xiangrong Liu",
            "typeEntity": "Person"
        }
    ],
    "description": "2lpiRNApred is a 2-layer integrated program for identifying piRNAs in the first layer and determining if piRNAs have the function of instructing target mRNA deadenylation in the second layer.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                }
            ]
        }
    ],
    "homepage": "https://github.com/JianyuanLin/2lpiRNApred",
    "language": [
        "C",
        "MATLAB"
    ],
    "lastUpdate": "2021-01-19T10:17:14Z",
    "name": "2lpiRNApred",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1080/15476286.2020.1734382",
            "metadata": {
                "abstract": "© 2020, © 2020 Informa UK Limited, trading as Taylor & Francis Group.Piwi–interacting RNAs (piRNAs) are indispensable in the transposon silencing, including in germ cell formation, germline stem cell maintenance, spermatogenesis, and oogenesis. piRNA pathways are amongst the major genome defence mechanisms, which maintain genome integrity. They also have important functions in tumorigenesis, as indicated by aberrantly expressed piRNAs being recently shown to play roles in the process of cancer development. A number of computational methods for this have recently been proposed, but they still have not yielded satisfactory predictive performance. Moreover, only one computational method that identifies whether piRNAs function in inducting target mRNA deadenylation been reported in the literature. In this study, we developed a two-layered integrated classifier algorithm, 2lpiRNApred. It identifies piRNAs in the first layer and determines whether they function in inducting target mRNA deadenylation in the second layer. A new feature selection algorithm, which was based on Luca fuzzy entropy and Gaussian membership function (LFE-GM), was proposed to reduce the dimensionality of the features. Five feature extraction strategies, namely, Kmer, General parallel correlation pseudo-dinucleotide composition, General series correlation pseudo-dinucleotide composition, Normalized Moreau–Broto autocorrelation, and Geary autocorrelation, and two types of classifier, Sparse Representation Classifier (SRC) and support vector machine with Mahalanobis distance-based radial basis function (SVMMDRBF), were used to construct a two-layered integrated classifier algorithm, 2lpiRNApred. The results indicate that 2lpiRNApred performs significantly better than six other existing prediction tools.",
                "authors": [
                    {
                        "name": "Jiang M."
                    },
                    {
                        "name": "Lin J."
                    },
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Zou Q."
                    },
                    {
                        "name": "Zuo Y."
                    }
                ],
                "citationCount": 7,
                "date": "2020-06-02T00:00:00Z",
                "journal": "RNA Biology",
                "title": "2lpiRNApred: a two-layered integrated algorithm for identifying piRNAs and their functions based on LFE-GM feature selection"
            },
            "pmcid": "PMC7549647",
            "pmid": "32138598"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Mobile genetic elements",
            "uri": "http://edamontology.org/topic_0798"
        }
    ],
    "validated": 1
}
