{
    "additionDate": "2018-07-05T20:18:36Z",
    "biotoolsCURIE": "biotools:hybtrack",
    "biotoolsID": "hybtrack",
    "credit": [
        {
            "email": "bhlee1117@gmail.com",
            "name": "Byung Hun Lee",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A hybrid single particle tracking software using manual and automatic detection of dim signals.",
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/bhlee1117/HybTrack"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bhlee1117/HybTrack",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "HybTrack",
    "operatingSystem": [
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1038/s41598-017-18569-3",
            "metadata": {
                "abstract": "© 2017 The Author(s).Single particle tracking is a compelling technique for investigating the dynamics of nanoparticles and biological molecules in a broad range of research fields. In particular, recent advances in fluorescence microscopy have made single molecule tracking a prevalent method for studying biomolecules with a high spatial and temporal precision. Particle tracking algorithms have matured over the past three decades into more easily accessible platforms. However, there is an inherent difficulty in tracing particles that have a low signal-to-noise ratio and/or heterogeneous subpopulations. Here, we present a new MATLAB based tracking program which combines the benefits of manual and automatic tracking methods. The program prompts the user to manually locate a particle when an ambiguous situation occurs during automatic tracking. We demonstrate the utility of this program by tracking the movement of β-actin mRNA in the dendrites of cultured hippocampal neurons. We show that the diffusion coefficient of β-actin mRNA decreases upon neuronal stimulation by bicuculline treatment. This tracking method enables an efficient dissection of the dynamic regulation of biological molecules in highly complex intracellular environments.",
                "authors": [
                    {
                        "name": "Lee B.H."
                    },
                    {
                        "name": "Park H.Y."
                    }
                ],
                "date": "2018-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "HybTrack: A hybrid single particle tracking software using manual and automatic detection of dim signals"
            }
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        }
    ],
    "validated": 1
}