{"credit":[{"email":"aaron.darling@uts.edu.au","name":"Aaron Darling","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://darlinglab.org/mauve/user-guide/introduction.html"}],"function":[{"operation":[{"term":"Sequence alignment comparison","uri":"http://edamontology.org/operation_0259"},{"term":"Visualisation","uri":"http://edamontology.org/operation_0337"},{"term":"Sequence assembly validation","uri":"http://edamontology.org/operation_3180"}]}],"labels":{"language":["Java","C++"],"license":"GPL-3.0","maturity":"Mature","operatingSystem":["Linux","Windows","Mac"],"toolType":["Desktop application"],"topic":[{"term":"Genomics","uri":"http://edamontology.org/topic_0622"},{"term":"Transcriptomics","uri":"http://edamontology.org/topic_3308"}]},"publication":[{"abstract":"As genomes evolve, they undergo large-scale evolutionary processes that present a challenge to sequence comparison not posed by short sequences. Recombination causes frequent genome rearrangements, horizontal transfer introduces new sequences into bacterial chromosomes, and deletions remove segments of the genome. Consequently, each genome is a mosaic of unique lineage-specific segments, regions shared with a subset of other genomes and segments conserved among all the genomes under consideration. Furthermore, the linear order of these segments may be shuffled among genomes. We present methods for identification and alignment of conserved genomic DNA in the presence of rearrangements and horizontal transfer. Our methods have been implemented in a software package called Mauve. Mauve has been applied to align nine enterobacterial genomes and to determine global rearrangement structure in three mammalian genomes. We have evaluated the quality of Mauve alignments and drawn comparison to other methods through extensive simulations of genome evolution. © 2004 by Cold Spring Harbor Laboratory Press.","authors":["Darling A.C.E.","Mau B.","Blattner F.R.","Perna N.T."],"cit_count":1606,"journal":"Genome Research","pmid":"15231754","title":"Mauve: Multiple alignment of conserved genomic sequence with rearrangements","year":"2004-07-01"}],"summary":{"biotoolsCURIE":"biotools:mauve","biotoolsID":"mauve","description":"Mauve Genome Alignment software, for comparing two or more draft or finished genomes","homepage":"http://darlinglab.org/mauve","name":"Mauve"}}