{
    "additionDate": "2023-08-30T11:41:28.797963Z",
    "biotoolsCURIE": "biotools:ordb",
    "biotoolsID": "ordb",
    "collectionID": [
        "gpcr"
    ],
    "description": "The Olfactory Receptor Database is a central repository of olfactory receptor (OR) and olfactory receptor-like gene and protein sequences. To deal with the very large OR gene family, we have constructed an algorithm that automatically downloads sequences from web sources such as GenBank and SWISS-PROT into the database. The algorithm uses hypertext markup language (HTML) parsing techniques that extract information relevant to ORDB. The information is then correlated with the metadata in the ORDB knowledge base to encode the unstructured text extracted into the structured format compliant with the database architecture, entity attribute value with classes and relationship (EAV/CR), which supports the SenseLab project as a whole. Three population methods: batch, automatic and semi-automatic population are discussed. The data is imported into the database using extensible markup language (XML).",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://senselab.med.yale.edu/ordb",
    "lastUpdate": "2024-02-14T09:44:25.305495Z",
    "name": "ORDB",
    "owner": "laasfeld",
    "publication": [
        {
            "doi": "10.1093/nar/30.1.354",
            "metadata": {
                "abstract": "The Olfactory Receptor Database (ORDB; http:// senselab.med.yale.edu/senselab/ordb) is a central repository of olfactory receptor (OR) and olfactory receptor-like gene and protein sequences. To deal with the very large OR gene family, we have constructed an algorithm that automatically down-loads sequences from web sources such as GenBank and SWISS-PROT into the database. The algorithm uses hypertext markup language (HTML) parsing techniques that extract information relevant to ORDB. The information is then correlated with the metadata in the ORDB knowledge base to encode the unstructured text extracted into the structured format compliant with the database architecture, entity attribute value with classes and relationship (EAV/CR), which supports the SenseLab project as a whole. Three population methods: batch, automatic and semi-automatic population are discussed. The data is imported into the database using extensible markup language (XML).",
                "authors": [
                    {
                        "name": "Crasto C."
                    },
                    {
                        "name": "Marenco L."
                    },
                    {
                        "name": "Miller P."
                    },
                    {
                        "name": "Shepherd G."
                    }
                ],
                "citationCount": 68,
                "date": "2002-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Olfactory Receptor Database: A metadata-driven automated population from sources of gene and protein sequences"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Biomedical science",
            "uri": "http://edamontology.org/topic_3344"
        },
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        }
    ]
}
