{
    "accessibility": "Open access",
    "additionDate": "2022-09-17T21:45:33.444540Z",
    "biotoolsCURIE": "biotools:hapdipkinship",
    "biotoolsID": "hapdipkinship",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ywang883@wisc.edu",
            "name": "Yen-Wen Wang",
            "orcidid": "https://orcid.org/0000-0002-6851-1646",
            "typeEntity": "Person"
        },
        {
            "name": "Cécile Ané",
            "orcidid": "https://orcid.org/0000-0002-4702-8217"
        }
    ],
    "description": "A package containing algorithms, exKING-robust and KIMGENS, to estimate kinship in haploid-diploid mixed populations.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                }
            ]
        }
    ],
    "homepage": "https://github.com/YenWenWang/HapDipKinship",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-09-17T21:45:33.448539Z",
    "license": "Not licensed",
    "name": "HapDipKinship",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btac293",
            "metadata": {
                "abstract": "© 2022 The Author(s). Published by Oxford University Press. All rights reserved.Motivation: Kinship estimation is necessary for evaluating violations of assumptions or testing certain hypotheses in many population genomic studies. However, kinship estimators are usually designed for diploid systems and cannot be used in populations with mixed haploid diploid genetic systems. The only estimators for different ploidies require datasets free of population structure, limiting their usage. Results: We present KIMGENS (Kinship Inference for Mixed GENetic Systems), an estimator for kinship estimation among individuals of various ploidies, that is robust to population structure. This estimator is based on the popular KING-robust estimator but uses diploid relatives of the individuals of interest as references of heterozygosity and extends its use to haploid-diploid and haploid pairs of individuals. We demonstrate that KIMGENS estimates kinship more accurately than previously developed estimators in simulated panmictic, structured and admixed populations, but has lower accuracy when the individual of interest is inbred. KIMGENS also outperforms other estimators in a honeybee dataset. Therefore, KIMGENS is a valuable addition to a population geneticist's toolbox.",
                "authors": [
                    {
                        "name": "Ane C."
                    },
                    {
                        "name": "Wang Y.-W."
                    }
                ],
                "date": "2022-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "KIMGENS: A novel method to estimate kinship in organisms with mixed haploid diploid genetic systems robust to population structure"
            },
            "pmid": "35482481"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        },
        {
            "term": "Population genomics",
            "uri": "http://edamontology.org/topic_3796"
        }
    ]
}
