{
    "additionDate": "2021-01-18T12:19:46Z",
    "biotoolsCURIE": "biotools:deeprke",
    "biotoolsID": "deeprke",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "yangchun119119@163.com",
            "name": "Chun Yang",
            "typeEntity": "Person"
        },
        {
            "email": "hliu@cczu.edu.cn",
            "name": "Hui Liu",
            "typeEntity": "Person"
        }
    ],
    "description": "DeepRKE is a deep neural network model, which combines primary RNA sequence and secondary structure information to effectively predict RNA binding protein binding sites.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA binding site prediction",
                    "uri": "http://edamontology.org/operation_3902"
                },
                {
                    "term": "RNA secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0278"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "DNA binding site prediction",
                    "uri": "http://edamontology.org/operation_3903"
                },
                {
                    "term": "Protein secondary structure comparison",
                    "uri": "http://edamontology.org/operation_2488"
                }
            ]
        }
    ],
    "homepage": "https://github.com/youzhiliu/DeepRKE/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-27T15:06:12Z",
    "name": "DeepRKE",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12864-020-07239-W",
            "metadata": {
                "abstract": "© 2020, The Author(s).Background: RNA binding proteins (RBPs) play a vital role in post-transcriptional processes in all eukaryotes, such as splicing regulation, mRNA transport, and modulation of mRNA translation and decay. The identification of RBP binding sites is a crucial step in understanding the biological mechanism of post-transcriptional gene regulation. However, the determination of RBP binding sites on a large scale is a challenging task due to high cost of biochemical assays. Quite a number of studies have exploited machine learning methods to predict binding sites. Especially, deep learning is increasingly used in the bioinformatics field by virtue of its ability to learn generalized representations from DNA and protein sequences. Results: In this paper, we implemented a novel deep neural network model, DeepRKE, which combines primary RNA sequence and secondary structure information to effectively predict RBP binding sites. Specifically, we used word embedding algorithm to extract features of RNA sequences and secondary structures, i.e., distributed representation of k-mers sequence rather than traditional one-hot encoding. The distributed representations are taken as input of convolutional neural networks (CNN) and bidirectional long-term short-term memory networks (BiLSTM) to identify RBP binding sites. Our results show that deepRKE outperforms existing counterpart methods on two large-scale benchmark datasets. Conclusions: Our extensive experimental results show that DeepRKE is an efficacious tool for predicting RBP binding sites. The distributed representations of RNA sequences and secondary structures can effectively detect the latent relationship and similarity between k-mers, and thus improve the predictive performance. The source code of DeepRKE is available at https://github.com/youzhiliu/DeepRKE/.",
                "authors": [
                    {
                        "name": "Deng L."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Shi Y."
                    },
                    {
                        "name": "Zhang W."
                    },
                    {
                        "name": "Yang C."
                    },
                    {
                        "name": "Liu H."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Deep neural networks for inferring binding sites of RNA-binding proteins by using distributed representations of RNA primary sequence and secondary structure"
            },
            "pmcid": "PMC7745412",
            "pmid": "33334313"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        },
        {
            "term": "Protein secondary structure",
            "uri": "http://edamontology.org/topic_3542"
        },
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        }
    ]
}