{
    "additionDate": "2021-01-18T08:58:32Z",
    "biotoolsCURIE": "biotools:tama",
    "biotoolsID": "tama",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jbkim@konkuk.ac.kr",
            "name": "Jaebum Kim",
            "orcidid": "https://orcid.org/0000-0002-2287-9760",
            "typeEntity": "Person"
        }
    ],
    "description": "improved metagenomic sequence classification through meta-analysis.\n\nTaxonomy Analysis pipeline for metagenome using Meta-Analysis.\n\nWhen you run TAMA based on the species rank analysis using the included example dataset.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                },
                {
                    "term": "Genome indexing",
                    "uri": "http://edamontology.org/operation_3211"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Read pre-processing",
                    "uri": "http://edamontology.org/operation_3219"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jkimlab/TAMA",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2021-02-25T13:48:52Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://bioinfo.konkuk.ac.kr/TAMA"
        }
    ],
    "name": "TAMA",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12859-020-3533-7",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Microorganisms are important occupants of many different environments. Identifying the composition of microbes and estimating their abundance promote understanding of interactions of microbes in environmental samples. To understand their environments more deeply, the composition of microorganisms in environmental samples has been studied using metagenomes, which are the collections of genomes of the microorganisms. Although many tools have been developed for taxonomy analysis based on different algorithms, variability of analysis outputs of existing tools from the same input metagenome datasets is the main obstacle for many researchers in this field. Results: Here, we present a novel meta-analysis tool for metagenome taxonomy analysis, called TAMA, by intelligently integrating outputs from three different taxonomy analysis tools. Using an integrated reference database, TAMA performs taxonomy assignment for input metagenome reads based on a meta-score by integrating scores of taxonomy assignment from different taxonomy classification tools. TAMA outperformed existing tools when evaluated using various benchmark datasets. It was also successfully applied to obtain relative species abundance profiles and difference in composition of microorganisms in two types of cheese metagenome and human gut metagenome. Conclusion: TAMA can be easily installed and used for metagenome read classification and the prediction of relative species abundance from multiple numbers and types of metagenome read samples. TAMA can be used to more accurately uncover the composition of microorganisms in metagenome samples collected from various environments, especially when the use of a single taxonomy analysis tool is unreliable. TAMA is an open source tool, and can be downloaded at https://github.com/jkimlab/TAMA.",
                "authors": [
                    {
                        "name": "Sim M."
                    },
                    {
                        "name": "Lee J."
                    },
                    {
                        "name": "Lee D."
                    },
                    {
                        "name": "Kwon D."
                    },
                    {
                        "name": "Kim J."
                    }
                ],
                "date": "2020-05-12T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "TAMA: Improved metagenomic sequence classification through meta-analysis"
            },
            "pmcid": "PMC7218625",
            "pmid": "32397982"
        }
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        },
        {
            "term": "Metagenomic sequencing",
            "uri": "http://edamontology.org/topic_3837"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ]
}