{
    "name": "Viral Bioinformatics", 
    "description": "Viral Bioinformatics provides access to viral genomes and a variety of tools for comparative genomic analyses.", 
    "homepage": "http://athena.bioc.uvic.ca/", 
    "biotoolsID": "viral_bioinformatics", 
    "biotoolsCURIE": "biotools:viral_bioinformatics", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3431", 
                    "term": "Deposition"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0346", 
                    "term": "Sequence similarity search"
                }, 
                {
                    "uri": "http://edamontology.org/operation_2454", 
                    "term": "Gene prediction"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0308", 
                    "term": "PCR primer design"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0781", 
            "term": "Virology"
        }, 
        {
            "uri": "http://edamontology.org/topic_0084", 
            "term": "Phylogeny"
        }, 
        {
            "uri": "http://edamontology.org/topic_3168", 
            "term": "Sequencing"
        }, 
        {
            "uri": "http://edamontology.org/topic_0634", 
            "term": "Pathology"
        }, 
        {
            "uri": "http://edamontology.org/topic_0102", 
            "term": "Mapping"
        }
    ], 
    "operatingSystem": [], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [], 
    "publication": [
        {
            "doi": null, 
            "pmid": "16772042", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Genome annotation transfer utility (GATU): Rapid annotation of viral genomes using a closely related reference genome", 
                "abstract": "Background: Since DNA sequencing has become easier and cheaper, an increasing number of closely related viral genomes have been sequenced. However, many of these have been deposited in GenBank without annotations, severely limiting their value to researchers. While maintaining comprehensive genomic databases for a set of virus families at the Viral Bioinformatics Resource Center http://www.biovirus.org and Viral Bioinformatics - Canada http://www.virology.ca, we found that researchers were unnecessarily spending time annotating viral genomes that were close relatives of already annotated viruses. We have therefore designed and implemented a novel tool, Genome Annotation Transfer Utility (GATU), to transfer annotations from a previously annotated reference genome to a new target genome, thereby greatly reducing this laborious task. Results: GATU transfers annotations from a reference genome to a closely related target genome, while still giving the user final control over which annotations should be included. GATU also detects open reading frames present in the target but not the reference genome and provides the user with a variety of bioinformatics tools to quickly determine if these ORFs should also be included in the annotation. After this process is complete, GATU saves the newly annotated genome as a GenBank, EMBL or XML-format file. The software is coded in Java and runs on a variety of computer platforms. Its user-friendly Graphical User Interface is specifically designed for users trained in the biological sciences. Conclusion: GATU greatly simplifies the initial stages of genome annotation by using a closely related genome as a reference. It is not intended to be a gene prediction tool or a \"complete\" annotation system, but we have found that it significantly reduces the time required for annotation of genes and mature peptides as well as helping to standardize gene names between related organisms by transferring reference genome annotations to the target genome. The program is freely available under the General Public License and can be accessed along with documentation and tutorial from http://www.virology.ca/gatu. © 2006 Tcherepanov et al; licensee BioMed Central Ltd.", 
                "date": "2006-06-13T00:00:00Z", 
                "citationCount": 110, 
                "authors": [
                    {
                        "name": "Tcherepanov V."
                    }, 
                    {
                        "name": "Ehlers A."
                    }, 
                    {
                        "name": "Upton C."
                    }
                ], 
                "journal": "BMC Genomics"
            }
        }, 
        {
            "doi": null, 
            "pmid": "10871272", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Viral genome database: Storing and analyzing genes and proteins from complete viral genomes", 
                "abstract": "The Viral Genome DataBase (VGDB) contains detailed information of the genes and predicted protein sequences from 15 completely sequenced genomes of large (>100 kb) viruses (2847 genes). The data that is stored includes DNA sequence, protein sequence, Gen-Bank and user-entered notes, molecular weight (MW), isoelectric point (pI), amino acid content, A + T%, nucleotide frequency, dinucleotide frequency and codon use. The VGDB is a mySQL database with a user-friendly JAVA GUI. Results of queries can be easily sorted by any of the individual parameters. Availability: The software and additional figures and information are available at http://athena.bioc.uvic.ca/genomes/index.html.", 
                "date": "2000-01-01T00:00:00Z", 
                "citationCount": 26, 
                "authors": [
                    {
                        "name": "Hiscock D."
                    }, 
                    {
                        "name": "Upton C."
                    }
                ], 
                "journal": "Bioinformatics"
            }
        }, 
        {
            "doi": null, 
            "pmid": "12424130", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Poxvirus Orthologous Clusters (POCs)", 
                "abstract": "Poxvirus Orthologous Clusters (POCs) is a JAVA client-server application which accesses an updated database containing all complete poxvirus genomes; it automatically groups orthologous genes into families based on BLASTP scores for assessment by a human database curator. POCs has a user-friendly interface permitting complex SQL queries to retrieve interesting groups of DNA and protein sequences as well as gene families for subsequent interrogation by a variety of integrated tools: BLASTP, BLASTX, TBLASTN, Jalview (multiple alignment), Dotlet (Dotplot), Laj (local alignment), and NAP (nucleotide to amino acid alignment). © Oxford University Press 2002.", 
                "date": "2002-11-01T00:00:00Z", 
                "citationCount": 47, 
                "authors": [
                    {
                        "name": "Ehlers A."
                    }, 
                    {
                        "name": "Osborne J."
                    }, 
                    {
                        "name": "Slack S."
                    }, 
                    {
                        "name": "Roper R.L."
                    }, 
                    {
                        "name": "Upton C."
                    }
                ], 
                "journal": "Bioinformatics"
            }
        }, 
        {
            "doi": null, 
            "pmid": "16227218", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Complete coding sequences of the rabbitpox virus genome", 
                "abstract": "Rabbitpox virus (RPXV) is highly virulent for rabbits and it has long been suspected to be a close relative of vaccinia virus. To explore these questions, the complete coding region of the rabbitpox virus genome was sequenced to permit comparison with sequenced strains of vaccinia virus and other orthopoxviruses. The genome of RPXV strain Utrecht (RPXV-UTR) is 197 731 nucleotides long, excluding the terminal hairpin structures at each end of the genome. The RPXV-UTR genome has 66.5 % A+T content, 184 putative functional genes and 12 fragmented ORF regions that are intact in other orthopoxviruses. The sequence of the RPXV-UTR genome reveals that two RPXV-UTR genes have orthologues in variola virus (VARV; the causative agent of smallpox), but not in vaccinia virus (VACV) strains. These genes are a zinc RING finger protein gene (RPXV-UTR-008) and an ankyrin repeat family protein gene (RPXV-UTR-180). A third gene, encoding a chemokine-binding protein (RPXV-UTR-001/184), is complete in VARV but functional only in some VACV strains. Examination of the evolutionary relationship between RPXV and other orthopoxviruses was carried out using the central 143 kb DNA sequence conserved among all completely sequenced orthopoxviruses and also the protein sequences of 49 gene products present in all completely sequenced chordopoxviruses. The results of these analyses both confirm that RPXV-UTR is most closely related to VACV and suggest that RPXV has not evolved directly from any of the sequenced VACV strains, since RPXV contains a 719 bp region not previously identified in any VACV. © 2005 SGM.", 
                "date": "2005-11-01T00:00:00Z", 
                "citationCount": 35, 
                "authors": [
                    {
                        "name": "Li G."
                    }, 
                    {
                        "name": "Chen N."
                    }, 
                    {
                        "name": "Roper R.L."
                    }, 
                    {
                        "name": "Feng Z."
                    }, 
                    {
                        "name": "Hunter A."
                    }, 
                    {
                        "name": "Danila M."
                    }, 
                    {
                        "name": "Lefkowitz E.J."
                    }, 
                    {
                        "name": "Buller R.M.L."
                    }, 
                    {
                        "name": "Upton C."
                    }
                ], 
                "journal": "Journal of General Virology"
            }
        }, 
        {
            "doi": null, 
            "pmid": "15253776", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Base-By-Base: Single nucleotide-level analysis of whole viral genome alignments", 
                "abstract": "Background: With ever increasing numbers of closely related virus genomes being sequenced, it has become desirable to be able to compare two genomes at a level more detailed than gene content because two strains of an organism may share the same set of predicted genes but still differ in their pathogenicity profiles. For example, detailed comparison of multiple isolates of the smallpox virus genome (each approximately 200 kb, with 200 genes) is not feasible without new bioinformatics tools. Results: A software package, Base-By-Base, has been developed that provides visualization tools to enable researchers to 1) rapidly identify and correct alignment errors in large, multiple genome alignments; and 2) generate tabular and graphical output of differences between the genomes at the nucleotide level. Base-By-Base uses detailed annotation information about the aligned genomes and can list each predicted gene with nucleotide differences, display whether variations occur within promoter regions or coding regions and whether these changes result in amino acid substitutions. Base-By-Base can connect to our mySQL database (Virus Orthologous Clusters; VOCs) to retrieve detailed annotation information about the aligned genomes or use information from text files. Conclusion: Base-By-Base enables users to quickly and easily compare large viral genomes; it highlights small differences that may be responsible for important phenotypic differences such as virulence. It is available via the Internet using Java Web Start and runs on Macintosh, PC and Linux operating systems with the Java 1.4 virtual machine. © 2004 Brodie et al; licensee BioMed Central Ltd.", 
                "date": "2004-07-14T00:00:00Z", 
                "citationCount": 56, 
                "authors": [
                    {
                        "name": "Brodie R."
                    }, 
                    {
                        "name": "Smith A.J."
                    }, 
                    {
                        "name": "Roper R.L."
                    }, 
                    {
                        "name": "Tcherepanov V."
                    }, 
                    {
                        "name": "Upton C."
                    }
                ], 
                "journal": "BMC Bioinformatics"
            }
        }, 
        {
            "doi": null, 
            "pmid": "14734323", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "JDotter: A Java interface to multiple dotplots generated by dotter", 
                "abstract": "Summary: Java-Dotter (JDotter) is a platform-independent Java interactive interface for the Linux version of Dotter, a widely used program for generating dotplots of large DNA or protein sequences. JDotter runs as a client-server application and can send new sequences to the Dotter program for alignment as well as rapidly access a repository of preprocessed dotplots. JDotter also interfaces with a sequence database or file system to display supplementary feature data. Thus, JDotter greatly simplifies access to dotplot data in laboratories that deal with large numbers of genomes and have a multi-platform organization.", 
                "date": "2004-01-22T00:00:00Z", 
                "citationCount": 81, 
                "authors": [
                    {
                        "name": "Brodie R."
                    }, 
                    {
                        "name": "Roper R.L."
                    }, 
                    {
                        "name": "Upton C."
                    }
                ], 
                "journal": "Bioinformatics"
            }
        }, 
        {
            "doi": null, 
            "pmid": "11074125", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Viral genome organizer: A system for analyzing complete viral genomes", 
                "abstract": "The viral genome organizer (VGO) is designed to simplify the characterization and annotation of complete viral genomes (particularly those of large poxviruses) and to help researchers discover new genes and detect gene fragmentation. VGO is based on Genotator [Harris, N.L., 1997. Genome Res. 7, 754-762], an annotation workbench designed for the analysis of eukaryotic genomic sequences. VGO automates a number of database search routines (FASTA, BLASTP, PSI-BLAST and TBLASTN), processes the results through a multiple-alignment viewer (MView; [Brown, N.P., Leroy, C., Sander, C., 1998. Bioinformatics 14, 380-381]) and serves to manage the hundreds of DNA, protein and database search results files that must be organized when dealing with large complete poxviral genomes. It also directs the generation a self-dotplot of the genome by Dotter [Sonnhammer, E.L.L., Durbin, R., 1995. A dot-matrix program with dynamic threshold control suited for genomic DNA and protein sequence analysis. Gene 167: GC1-10. http://www.sanger.ac.uk/Software/Dotter/] to uncover repeated genes and sequences and provides Internet links to programs for generation of restriction maps and analysis of potential PCR primers. The user-friendly graphical interface displays DNA and protein sequences, links to search results, ORFs, stop-start codons, restriction sites and flags of database searches. Currently, VGO and associated programs run in an X-windows environment on commonly available UNIX machines. (C) 2000 Elsevier Science B.V.", 
                "date": "2000-11-22T00:00:00Z", 
                "citationCount": 41, 
                "authors": [
                    {
                        "name": "Upton C."
                    }, 
                    {
                        "name": "Hogg D."
                    }, 
                    {
                        "name": "Perrin D."
                    }, 
                    {
                        "name": "Boone M."
                    }, 
                    {
                        "name": "Harris N.L."
                    }
                ], 
                "journal": "Virus Research"
            }
        }, 
        {
            "doi": null, 
            "pmid": "16503070", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Poxviruses: Past, present and future", 
                "abstract": "The analysis of poxvirus genomes is complex, in part, because of their size (130-360 kb) and the fact that gene content is variable; a common set of 49 genes has been found in all sequenced poxviruses and an additional 41 genes are also present in all sequenced orthopoxviruses. As a group, poxviruses have a very broad range of eukaryotic hosts (including mammals, birds, reptiles and insects) and many poxvirus genes are associated with blocking host anti-viral responses. One consequence of this is that many poxvirus genes are not essential for growth in tissue culture and that extensive passaging in vitro results in the accumulation of mutations, including deletions that result in loss of gene function. Here, we review various comparative analyses of the poxviruses including gene prediction, gene conservation and function, genome organization, and poxvirus taxonomy and evolution. © 2006 Elsevier B.V. All rights reserved.", 
                "date": "2006-01-01T00:00:00Z", 
                "citationCount": 92, 
                "authors": [
                    {
                        "name": "Lefkowitz E.J."
                    }, 
                    {
                        "name": "Wang C."
                    }, 
                    {
                        "name": "Upton C."
                    }
                ], 
                "journal": "Virus Research"
            }
        }, 
        {
            "doi": null, 
            "pmid": "16013958", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "New bioinformatics tools for viral genome analyses at Viral Bioinformatics - Canada", 
                "abstract": "Viruses are much smaller than prokaryotes and eukaryotes, and it is now practical to sequence closely related members of virus families, strains, or even different isolates recovered during the course of an outbreak. However, comparative analysis of viral genomes requires the development of novel bioinformatics tools that allow us to align, edit, compare and interact with these genomes at all levels, from whole genome, to gene family, to single nucleotide polymorphisms. Comparative viral genomics can lead to the identification of the core characteristics that define a virus family, as well as the unique properties of viral species or isolates that contribute to variations in pathogenesis, This paper describes a number of tools, mainly developed for Viral Bioinformatics - Canada, that can be used for annotation and comparative genomic analysis of poxviruses. Nonetheless, these tools are also broadly applicable to other virus families. © 2005 Future Medicine Ltd.", 
                "date": "2005-04-01T00:00:00Z", 
                "citationCount": 11, 
                "authors": [
                    {
                        "name": "Esteban D.J."
                    }, 
                    {
                        "name": "Da Silva M."
                    }, 
                    {
                        "name": "Upton C."
                    }
                ], 
                "journal": "Pharmacogenomics"
            }
        }, 
        {
            "doi": null, 
            "pmid": "15701178", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Recent Hits Acquired by BLAST (ReHAB): A tool to indentify new hits in sequence similarity searches", 
                "abstract": "Background: Sequence similarity searching is a powerful tool to help develop hypotheses in the quest to assign functional, structural and evolutionary information to DNA and protein sequences. As sequence databases continue to grow exponentially, it becomes increasingly important to repeat searches at frequent intervals, and similarity searches retrieve larger and larger sets of results. New and potentially significant results may be buried in a long list of previously obtained sequence hits from past searches. Results: ReHAB (Recent Hits Acquired from BLAST) is a tool for finding new protein hits in repeated PSI-BLAST searches. ReHAB compares results from PSI-BLAST searches performed with two versions of a protein sequence database and highlights hits that are present only in the updated database. Results are presented in an easily comprehended table, or in a BLAST-like report, using colors to highlight the new hits. ReHAB is designed to handle large numbers of query sequences, such as whole genomes or sets of genomes. Advanced computer skills are not needed to use ReHAB; the graphics interface is simple to use and was designed with the bench biologist in mind. Conclusions: This software greatly simplifies the problem of evaluating the output of large numbers of protein database searches. © 2005 Whitney et al; licensee BioMed Central Ltd.", 
                "date": "2005-02-08T00:00:00Z", 
                "citationCount": 11, 
                "authors": [
                    {
                        "name": "Whitney J."
                    }, 
                    {
                        "name": "Esteban D.J."
                    }, 
                    {
                        "name": "Upton C."
                    }
                ], 
                "journal": "BMC Bioinformatics"
            }
        }, 
        {
            "doi": null, 
            "pmid": "12805459", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Poxvirus orthologous clusters: Toward defining the minimum essential poxvirus genome", 
                "abstract": "Increasingly complex bioinformatic analysis is necessitated by the plethora of sequence information currently available. A total of 21 poxvirus genomes have now been completely sequenced and annotated, and many more genomes will be available in the next few years. First, we describe the creation of a database of continuously corrected and updated genome sequences and an easy-to-use and extremely powerful suite of software tools for the analysis of genomes, genes, and proteins. These tools are available free to all researchers and, in most cases, alleviate the need for using multiple Internet sites for analysis. Further, we describe the use of these programs to identify conserved families of genes (poxvirus orthologous clusters) and have named the software suite POCs, which is available at www.poxvirus.org. Using POCs, we have identified a set of 49 absolutely conserved gene families - those which are conserved between the highly diverged families of insect-infecting entomopoxviruses and vertebrate-infecting chordopoxviruses. An additional set of 41 gene families conserved in chordopoxviruses was also identified. Thus, 90 genes are completely conserved in chordopoxviruses and comprise the minimum essential genome, and these will make excellent drug, antibody, vaccine, and detection targets. Finally, we describe the use of these tools to identify necessary annotation and sequencing updates in poxvirus genomes. For example, using POCs, we identified 19 genes that were widely conserved in poxviruses but missing from the vaccinia virus strain Tian Tan 1998 GenBank file. We have reannotated and resequenced fragments of this genome and verified that these genes are conserved in Tiau Tan. The results for poxvirus genes and genomes are discussed in light of evolutionary processes.", 
                "date": "2003-07-01T00:00:00Z", 
                "citationCount": 176, 
                "authors": [
                    {
                        "name": "Upton C."
                    }, 
                    {
                        "name": "Slack S."
                    }, 
                    {
                        "name": "Hunter A.L."
                    }, 
                    {
                        "name": "Ehlers A."
                    }, 
                    {
                        "name": "Roper R.L."
                    }
                ], 
                "journal": "Journal of Virology"
            }
        }
    ], 
    "credit": [
        {
            "name": "Viral Bioinformatics Resource Center", 
            "email": "cupton@uvic.ca", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "ELIXIR-EE", 
    "additionDate": "2017-04-21T12:12:32Z", 
    "lastUpdate": "2018-12-10T12:58:43Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}