{
    "additionDate": "2021-01-18T11:46:57Z",
    "biotoolsCURIE": "biotools:issec",
    "biotoolsID": "issec",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "dbu@ict.ac.cn",
            "name": "Dongbo Bu",
            "orcidid": "https://orcid.org/0000-0003-4119-4238",
            "typeEntity": "Person"
        }
    ],
    "description": "Inferring contacts among protein secondary structure elements using deep object detection.\n\nISSEC adopts deep learning to learn specific patterns within predicted inter-residue contacts and subsequently identifies the objects having these patterns as inter-SSE contacts.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Contact map calculation",
                    "uri": "http://edamontology.org/operation_0392"
                },
                {
                    "term": "Protein secondary structure comparison",
                    "uri": "http://edamontology.org/operation_2488"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                },
                {
                    "term": "Residue contact prediction",
                    "uri": "http://edamontology.org/operation_0272"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bigict/ISSEC/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-11T10:37:04Z",
    "name": "ISSEC",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03793-Y",
            "metadata": {
                "abstract": "© 2020, The Author(s).Background: The formation of contacts among protein secondary structure elements (SSEs) is an important step in protein folding as it determines topology of protein tertiary structure; hence, inferring inter-SSE contacts is crucial to protein structure prediction. One of the existing strategies infers inter-SSE contacts directly from the predicted possibilities of inter-residue contacts without any preprocessing, and thus suffers from the excessive noises existing in the predicted inter-residue contacts. Another strategy defines SSEs based on protein secondary structure prediction first, and then judges whether each candidate SSE pair could form contact or not. However, it is difficult to accurately determine boundary of SSEs due to the errors in secondary structure prediction. The incorrectly-deduced SSEs definitely hinder subsequent prediction of the contacts among them. Results: We here report an accurate approach to infer the inter-SSE contacts (thus called as ISSEC) using the deep object detection technique. The design of ISSEC is based on the observation that, in the inter-residue contact map, the contacting SSEs usually form rectangle regions with characteristic patterns. Therefore, ISSEC infers inter-SSE contacts through detecting such rectangle regions. Unlike the existing approach directly using the predicted probabilities of inter-residue contact, ISSEC applies the deep convolution technique to extract high-level features from the inter-residue contacts. More importantly, ISSEC does not rely on the pre-defined SSEs. Instead, ISSEC enumerates multiple candidate rectangle regions in the predicted inter-residue contact map, and for each region, ISSEC calculates a confidence score to measure whether it has characteristic patterns or not. ISSEC employs greedy strategy to select non-overlapping regions with high confidence score, and finally infers inter-SSE contacts according to these regions. Conclusions: Comprehensive experimental results suggested that ISSEC outperformed the state-of-the-art approaches in predicting inter-SSE contacts. We further demonstrated the successful applications of ISSEC to improve prediction of both inter-residue contacts and tertiary structure as well.",
                "authors": [
                    {
                        "name": "Bu D."
                    },
                    {
                        "name": "Ju F."
                    },
                    {
                        "name": "Kong L."
                    },
                    {
                        "name": "Sun S."
                    },
                    {
                        "name": "Zhang Q."
                    },
                    {
                        "name": "Zheng W.-M."
                    },
                    {
                        "name": "Zhu J."
                    }
                ],
                "citationCount": 1,
                "date": "2020-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "ISSEC: inferring contacts among protein secondary structure elements using deep object detection"
            },
            "pmcid": "PMC7643357",
            "pmid": "33153432"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Protein secondary structure",
            "uri": "http://edamontology.org/topic_3542"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ]
}
