{
    "accessibility": "Open access",
    "additionDate": "2023-03-28T21:43:10.887754Z",
    "biotoolsCURIE": "biotools:tivan-indel",
    "biotoolsID": "tivan-indel",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "li.chen1@ufl.edu",
            "name": "Li Chen",
            "orcidid": "http://orcid.org/0000-0001-9372-5606",
            "typeEntity": "Person"
        },
        {
            "name": "Aman Agarwal"
        },
        {
            "name": "Fengdi Zhao"
        },
        {
            "name": "Yuchao Jiang"
        }
    ],
    "description": "A computational framework for annotating and predicting noncoding regulatory small insertion and deletion.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene regulatory network prediction",
                    "uri": "http://edamontology.org/operation_2437"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Virulence prediction",
                    "uri": "http://edamontology.org/operation_3461"
                }
            ]
        }
    ],
    "homepage": "https://github.com/lichen-lab/TIVAN-indel",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2024-11-24T14:50:49.953725Z",
    "license": "BSD-3-Clause",
    "name": "TIVAN-indel",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btad060",
            "metadata": {
                "abstract": "Motivation: Small insertion and deletion (sindel) of human genome has an important implication for human disease. One important mechanism for non-coding sindel (nc-sindel) to have an impact on human diseases and phenotypes is through the regulation of gene expression. Nevertheless, current sequencing experiments may lack statistical power and resolution to pinpoint the functional sindel due to lower minor allele frequency or small effect size. As an alternative strategy, a supervised machine learning method can identify the otherwise masked functional sindels by predicting their regulatory potential directly. However, computational methods for annotating and predicting the regulatory sindels, especially in the non-coding regions, are underdeveloped. Results: By leveraging labeled nc-sindels identified by cis-expression quantitative trait loci analyses across 44 tissues in Genotype-Tissue Expression (GTEx), and a compilation of both generic functional annotations and large-scale epigenomic profiles, we develop TIssue-specific Variant Annotation for Non-coding indel (TIVAN-indel), which is a supervised computational framework for predicting non-coding regulatory sindels. As a result, we demonstrate that TIVAN-indel achieves the best prediction performance in both with-tissue prediction and cross-tissue prediction. As an independent evaluation, we train TIVAN-indel from the ‘Whole Blood’ tissue in GTEx and test the model using 15 immune cell types from an independent study named Database of Immune Cell Expression. Lastly, we perform an enrichment analysis for both true and predicted sindels in key regulatory regions such as chromatin interactions, open chromatin regions and histone modification sites, and find biologically meaningful enrichment patterns.",
                "authors": [
                    {
                        "name": "Agarwal A."
                    },
                    {
                        "name": "Chen L."
                    },
                    {
                        "name": "Jiang Y."
                    },
                    {
                        "name": "Zhao F."
                    }
                ],
                "citationCount": 2,
                "date": "2023-02-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "TIVAN-indel: a computational framework for annotating and predicting non-coding regulatory small insertions and deletions"
            },
            "pmcid": "PMC9900211",
            "pmid": "36707993"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}
