{
    "additionDate": "2018-07-29T09:37:45Z",
    "biotoolsCURIE": "biotools:phylotar",
    "biotoolsID": "phylotar",
    "credit": [
        {
            "email": "dominic.john.bennett@gmail.com",
            "name": "Dominic J. Bennett",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "An automated pipeline for retrieving orthologous DNA sequences from GenBank in R.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/ropensci/phylotaR"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ropensci/phylotaR",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "license": "MIT",
    "name": "phylotaR",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.3390/life8020020",
            "metadata": {
                "abstract": "© 2018 by the authors. Licensee MDPI, Basel, Switzerland.The exceptional increase in molecular DNA sequence data in open repositories is mirrored by an ever-growing interest among evolutionary biologists to harvest and use those data for phylogenetic inference. Many quality issues, however, are known and the sheer amount and complexity of data available can pose considerable barriers to their usefulness. A key issue in this domain is the high frequency of sequence mislabeling encountered when searching for suitable sequences for phylogenetic analysis. These issues include, among others, the incorrect identification of sequenced species, non-standardized and ambiguous sequence annotation, and the inadvertent addition of paralogous sequences by users. Taken together, these issues likely add considerable noise, error or bias to phylogenetic inference, a risk that is likely to increase with the size of phylogenies or the molecular datasets used to generate them. Here we present a software package, phylotaR that bypasses the above issues by using instead an alignment search tool to identify orthologous sequences. Our package builds on the framework of its predecessor, PhyLoTa, by providing a modular pipeline for identifying overlapping sequence clusters using up-to-date GenBank data and providing new features, improvements and tools. We demonstrate and test our pipeline’s effectiveness by presenting trees generated from phylotaR clusters for two large taxonomic clades: Palms and primates. Given the versatility of this package, we hope that it will become a standard tool for any research aiming to use GenBank data for phylogenetic analysis.",
                "authors": [
                    {
                        "name": "Antonelli A."
                    },
                    {
                        "name": "Bacon C.D."
                    },
                    {
                        "name": "Bennett D.J."
                    },
                    {
                        "name": "Faurby S."
                    },
                    {
                        "name": "Hettling H."
                    },
                    {
                        "name": "Silvestro D."
                    },
                    {
                        "name": "Vos R.A."
                    },
                    {
                        "name": "Zizka A."
                    }
                ],
                "citationCount": 8,
                "date": "2018-06-01T00:00:00Z",
                "journal": "Life",
                "title": "Phylotar: An automated pipeline for retrieving orthologous DNA sequences from GenBank in R"
            },
            "pmcid": "PMC6027284",
            "pmid": "29874797"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Data acquisition",
            "uri": "http://edamontology.org/topic_3077"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        }
    ],
    "validated": 1
}
