{
    "name": "phylotree.js", 
    "description": "It's for developing applications and interactive visualizations involving phylogenetic trees, written as an extension of the D3 hierarchy layout. It generates high quality SVG vector graphics, allows a great degree of customizability (CSS or JavaScript callbacks), and comes with a lot of built-in convenience features.", 
    "homepage": "https://github.com/veg/phylotree.js", 
    "biotoolsID": "phylotree.js", 
    "biotoolsCURIE": "biotools:phylotree.js", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0337", 
                    "term": "Visualisation"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Library"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3293", 
            "term": "Phylogenetics"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "JavaScript"
    ], 
    "license": "MIT", 
    "collectionID": [], 
    "maturity": null, 
    "cost": "Free of charge", 
    "accessibility": [
        "Open access"
    ], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "https://github.com/veg/phylotree.js/tree/master/examples", 
            "type": "Repository", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://phylotree.hyphy.org/documentation", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1186/s12859-018-2283-2", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "phylotree.js - a JavaScript library for application development and interactive data visualization in phylogenetics", 
                "abstract": "© 2018 The Author(s).Background: While several JavaScript packages for visualizing phylogenetic trees exist, most are best characterized as frameworks that are designed with a specific set of tasks in mind. Extending such packages to use cases that are not available as features often ends up being difficult. Moreover, existing packages tend to produce standalone widgets that are not designed to serve as middleware, as opposed to flexible tools that can integrate with other components of an application. Results: phylotree.js is a library that extends the popular data visualization framework d3.js, and is suitable for building JavaScript applications where users can view and interact with phylogenetic trees. The effects of such interactions can be captured and communicated to other package components, making it possible to engineer complex and responsive applications that include phylogenetic trees. phylotree.js implements several abstractions in addition to features, and comes with a documented application programming interface, thus promoting interoperability and extensibility. Example applications include a tool to visualize and annotate phylogenetic trees, a web application for comparative sequence analysis, a structural viewer that interacts with a large phylogenetic tree, and an interactive tanglegram. Conclusions:phylotree.js is a useful tool and application module for a variety of computational biology software applications. The code is available on Github and is released under the MIT license.", 
                "date": "2018-07-25T00:00:00Z", 
                "citationCount": 0, 
                "authors": [
                    {
                        "name": "Shank S.D."
                    }, 
                    {
                        "name": "Weaver S."
                    }, 
                    {
                        "name": "Kosakovsky Pond S.L."
                    }
                ], 
                "journal": "BMC Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": "Stephen D. Shank", 
            "email": "sshank@temple.edu", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "shadi.m", 
    "additionDate": "2018-07-28T12:34:01Z", 
    "lastUpdate": "2018-12-10T12:59:00Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}