{
    "accessibility": "Open access",
    "additionDate": "2024-05-14T13:19:15.197383Z",
    "biotoolsCURIE": "biotools:paintorpipe",
    "biotoolsID": "paintorpipe",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "sarah.djebali@inserm.fr",
            "name": "Sarah Djebali",
            "orcidid": "https://orcid.org/0000-0002-0599-1267",
            "typeEntity": "Person"
        },
        {
            "name": "Zoé Gerber",
            "typeEntity": "Person"
        }
    ],
    "description": "Pipeline for genetic variant fine-mapping using functional annotations.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Linkage disequilibrium calculation",
                    "uri": "http://edamontology.org/operation_0488"
                },
                {
                    "term": "SNP annotation",
                    "uri": "http://edamontology.org/operation_3661"
                },
                {
                    "term": "Variant prioritisation",
                    "uri": "http://edamontology.org/operation_3226"
                }
            ]
        }
    ],
    "homepage": "https://github.com/sdjebali/PaintorPipe",
    "lastUpdate": "2024-11-24T14:00:58.046822Z",
    "name": "PaintorPipe",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bioadv/vbad188",
            "metadata": {
                "abstract": "Motivation: Genome-wide association studies (GWAS) have identified thousands of genetic variants associated with common diseases. These results include a mix of causal and non-causal variants related through strong linkage disequilibrium (LD, i.e. highly correlated). Fine-mapping methods have been developed to decipher the causal from non-causal variants using GWAS results and LD information, assigning to each variant a probability of being causal. In this field, the PAINTOR program has become a standard, one of its advantages being its ability to take into account functional annotations. This approach requires many pre- and post-processing steps. Here, we developed a Nextflow pipeline called PaintorPipe that wraps all these steps and the fine-mapping itself together. PaintorPipe uses three independent sources of information: GWAS summary statistics, LD information and functional annotations, to rank the variants according to their susceptibility to be involved in the disease development. The PAINTOR framework is used to calculate the posterior probability of each variant (single nucleotide polymorphism) to be causal (a.k.a. Bayesian fine-mapping). The resulting credible sets of variants are annotated with their biological functions and visualized using CANVIS. This pipeline requires minimal input from users (a GWAS summary statistics file and a set of functional annotation files) and is designed to be modular and customizable, allowing for an easy integration of diverse functional annotations.",
                "authors": [
                    {
                        "name": "Aschard H."
                    },
                    {
                        "name": "Djebali S."
                    },
                    {
                        "name": "Fisun M."
                    },
                    {
                        "name": "Gerber Z."
                    }
                ],
                "date": "2024-01-01T00:00:00Z",
                "journal": "Bioinformatics Advances",
                "title": "PaintorPipe: A pipeline for genetic variant fine-mapping using functional annotations"
            },
            "pmcid": "PMC10783948",
            "pmid": "38213821"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
