{
    "additionDate": "2021-01-18T10:37:37Z",
    "biotoolsCURIE": "biotools:fmap",
    "biotoolsID": "fmap",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Vittorio Limongelli",
            "typeEntity": "Person"
        }
    ],
    "description": "Funnel-Metadynamics Advanced Protocol (FMAP), which is a flexible and user-friendly graphical user interface (GUI)-based protocol to perform funnel metadynamics, a binding free-energy method that employs a funnel-shape restraint potential to reveal the ligand binding mode and accurately calculate the absolute ligand–protein binding free energy. FMAP guides the user through all phases of the free-energy calculation process, from preparation of the input files, to production simulation, to analysis of the results.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                }
            ]
        }
    ],
    "homepage": "https://github.com/limresgrp/FMAP_v1",
    "language": [
        "C++"
    ],
    "lastUpdate": "2021-03-11T10:29:03Z",
    "license": "CC-BY-NC-4.0",
    "name": "FMAP",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1038/S41596-020-0342-4",
            "metadata": {
                "abstract": "© 2020, The Author(s), under exclusive licence to Springer Nature Limited.The accurate resolution of the binding mechanism of a ligand to its molecular target is fundamental to develop a successful drug design campaign. Free-energy calculations, which provide the energy value of the ligand–protein binding complex, are essential for resolving the binding mode of the ligand. The accuracy of free-energy calculation methods is counteracted by their poor user-friendliness, which hampers their broad application. Here we present the Funnel-Metadynamics Advanced Protocol (FMAP), which is a flexible and user-friendly graphical user interface (GUI)-based protocol to perform funnel metadynamics, a binding free-energy method that employs a funnel-shape restraint potential to reveal the ligand binding mode and accurately calculate the absolute ligand–protein binding free energy. FMAP guides the user through all phases of the free-energy calculation process, from preparation of the input files, to production simulation, to analysis of the results. FMAP delivers the ligand binding mode and the absolute protein–ligand binding free energy as outputs. Alternative binding modes and the role of waters are also elucidated, providing a detailed description of the ligand binding mechanism. The entire protocol on the paradigmatic system benzamidine–trypsin, composed of ~105 k atoms, took ~2.8 d using the Cray XC50 piz Daint cluster at the Swiss National Supercomputing Centre.",
                "authors": [
                    {
                        "name": "Raniolo S."
                    },
                    {
                        "name": "Limongelli V."
                    }
                ],
                "citationCount": 13,
                "date": "2020-09-01T00:00:00Z",
                "journal": "Nature Protocols",
                "title": "Ligand binding free-energy calculations with funnel metadynamics"
            },
            "pmid": "32814837"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Computational chemistry",
            "uri": "http://edamontology.org/topic_3332"
        },
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        }
    ]
}