{
    "additionDate": "2021-01-18T12:24:19Z",
    "biotoolsCURIE": "biotools:spatemhtp",
    "biotoolsID": "spatemhtp",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "J.Kholova@cgiar.org",
            "name": "Jana Kholová",
            "typeEntity": "Person"
        },
        {
            "email": "ksoumya2301@gmail.com",
            "name": "Soumyashree Kar",
            "typeEntity": "Person"
        }
    ],
    "description": "A Data Analysis Pipeline for Efficient Processing and Utilization of Temporal High-Throughput Phenotyping Data.\n\nSpaTempHTP: Processing and data analysis of high throughput phenotyping data.\n\nSpaTempHTP_Validation: Scripts and data to illustrate the functioning of the SpaTempHTP R package.\n\nSpaTempHTP is an R package with functionalities to process and perform data analyses using time series data from (outdoors) high throughput phenotyping platforms.\n\nThe script folder contain a script that allow the user to perform analyses of time series data from high throughput phenotyping (HTP) platforms using the R package SpaTempHTP (https: github.com ICRISAT-GEMS SpaTemHTP).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ICRISAT-GEMS/SpaTemHTP",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-20T10:54:11Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/ICRISAT-GEMS/SpaTemHTP_Validation"
        }
    ],
    "name": "SpaTemHTP",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3389/FPLS.2020.552509",
            "metadata": {
                "abstract": "© Copyright © 2020 Kar, Garin, Kholová, Vadez, Durbha, Tanaka, Iwata, Urban and Adinarayana.The rapid development of phenotyping technologies over the last years gave the opportunity to study plant development over time. The treatment of the massive amount of data collected by high-throughput phenotyping (HTP) platforms is however an important challenge for the plant science community. An important issue is to accurately estimate, over time, the genotypic component of plant phenotype. In outdoor and field-based HTP platforms, phenotype measurements can be substantially affected by data-generation inaccuracies or failures, leading to erroneous or missing data. To solve that problem, we developed an analytical pipeline composed of three modules: detection of outliers, imputation of missing values, and mixed-model genotype adjusted means computation with spatial adjustment. The pipeline was tested on three different traits (3D leaf area, projected leaf area, and plant height), in two crops (chickpea, sorghum), measured during two seasons. Using real-data analyses and simulations, we showed that the sequential application of the three pipeline steps was particularly useful to estimate smooth genotype growth curves from raw data containing a large amount of noise, a situation that is potentially frequent in data generated on outdoor HTP platforms. The procedure we propose can handle up to 50% of missing values. It is also robust to data contamination rates between 20 and 30% of the data. The pipeline was further extended to model the genotype time series data. A change-point analysis allowed the determination of growth phases and the optimal timing where genotypic differences were the largest. The estimated genotypic values were used to cluster the genotypes during the optimal growth phase. Through a two-way analysis of variance (ANOVA), clusters were found to be consistently defined throughout the growth duration. Therefore, we could show, on a wide range of scenarios, that the pipeline facilitated efficient extraction of useful information from outdoor HTP platform data. High-quality plant growth time series data is also provided to support breeding decisions. The R code of the pipeline is available at https://github.com/ICRISAT-GEMS/SpaTemHTP.",
                "authors": [
                    {
                        "name": "Adinarayana J."
                    },
                    {
                        "name": "Durbha S.S."
                    },
                    {
                        "name": "Garin V."
                    },
                    {
                        "name": "Iwata H."
                    },
                    {
                        "name": "Kar S."
                    },
                    {
                        "name": "Kholova J."
                    },
                    {
                        "name": "Tanaka R."
                    },
                    {
                        "name": "Urban M.O."
                    },
                    {
                        "name": "Vadez V."
                    }
                ],
                "citationCount": 1,
                "date": "2020-11-20T00:00:00Z",
                "journal": "Frontiers in Plant Science",
                "title": "SpaTemHTP: A Data Analysis Pipeline for Efficient Processing and Utilization of Temporal High-Throughput Phenotyping Data"
            },
            "pmcid": "PMC7714717",
            "pmid": "33329623"
        }
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
