{
    "additionDate": "2021-10-04T06:43:39.108326Z",
    "biotoolsCURIE": "biotools:scant",
    "biotoolsID": "scant",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "d.labonte@imperial.ac.uk",
            "name": "David Labonte",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "scAnt is an open-source, low-cost macro 3D scanner, designed to automate the creation of digital 3D models of insects of various sizes in full colour. scAnt provides example configurations for the scanning process, as well as scripts for stacking and masking of images to prepare them for the photogrammetry software of your choice.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://github.com/evo-biomech/scAnt",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-10-04T06:47:33.470855Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/evo-biomech/scAnt/issues"
        }
    ],
    "name": "scAnt",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.7717/PEERJ.11155",
            "metadata": {
                "abstract": "Copyright 2021 Plum and Labonte.We present scAnt, an open-source platform for the creation of digital 3D models of arthropods and small objects. scAnt consists of a scanner and a Graphical User Interface, and enables the automated generation of Extended Depth Of Field images from multiple perspectives. These images are then masked with a novel automatic routine which combines random forest-based edge-detection, adaptive thresholding and connected component labelling. The masked images can then be processed further with a photogrammetry software package of choice, including open-source options such as Meshroom, to create high-quality, textured 3D models. We demonstrate how these 3D models can be rigged to enable realistic digital specimen posing, and introduce a novel simple yet effective method to include semi-realistic representations of approximately planar and transparent structures such as wings. As a result of the exclusive reliance on generic hardware components, rapid prototyping and open-source software, scAnt costs only a fraction of available comparable systems. The resulting accessibility of scAnt will (i) drive the development of novel and powerful methods for machine learning-driven behavioural studies, leveraging synthetic data; (ii) increase accuracy in comparative morphometric studies as well as extend the available parameter space with area and volume measurements; (iii) inspire novel forms of outreach; and (iv) aid in the digitisation efforts currently underway in several major natural history collections.",
                "authors": [
                    {
                        "name": "Plum F."
                    },
                    {
                        "name": "Labonte D."
                    }
                ],
                "date": "2021-04-12T00:00:00Z",
                "journal": "PeerJ",
                "title": "scAnt — An open-source platform for the creation of 3D models of arthropods (and other small objects)"
            },
            "pmcid": "PMC8048404",
            "pmid": "33954036",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ]
}