{
    "additionDate": "2021-01-18T11:49:59Z",
    "biotoolsCURIE": "biotools:tn-core",
    "biotoolsID": "tn-core",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "george.dicenzo@queens.ca",
            "typeEntity": "Person"
        }
    ],
    "description": "Functionally Interpreting Transposon-Sequencing Data with Metabolic Network Analysis.\n\nTn-Core is Matlab toolbox for generation of gene-centric, context-specific core metabolic network reconstructions through integration of experimental Tn-seq and RNA-seq datasets. The last named version is version 2.3. As the toolbox will continue to be updated, and to avoid countless version numbers, each change will no longer be associated with a new version number. Instead, changes will be made in Tn-Core Toolbox version stored in the directory entitled Most-Recent-Version. When using this version of the toolbox, the commit number can be used to document the version of the toolbox used.\n\nTransposon-sequencing (TnSeq) and genome-scale constraint-based metabolic modelling are highly complementary experimental and in silico approaches.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Anonymisation",
                    "uri": "http://edamontology.org/operation_3283"
                },
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                },
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                }
            ]
        }
    ],
    "homepage": "http://combo.dbe.unifi.it/tncore",
    "language": [
        "JavaScript",
        "MATLAB",
        "Python"
    ],
    "lastUpdate": "2021-03-20T17:25:44Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://combo.dbe.unifi.it/tncore"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "http://github.com/diCenzo-GC/Tn-Core"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "http://github.com/diCenzo-GC/Tn-Core-webserver"
        }
    ],
    "name": "Tn-Core",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1007/978-1-0716-0822-7_15",
            "metadata": {
                "abstract": "© 2020, Springer Science+Business Media, LLC, part of Springer Nature.Transposon-sequencing (Tn-seq) is a powerful tool facilitating the genome-scale identification of genes required for bacterial growth or survival in an environment of interest. However, Tn-seq suffers from two primary drawbacks: (1) genetic interactions masking phenotypes thereby resulting in important cellular functions remaining undiscovered and (2) a difficulty in easily going from a list of essential genes to a functional understanding of cell physiology. Tn-Core is a computational toolbox to help overcome these limitations through combining the output of Tn-seq studies with in silico genome-scale metabolic networks. In this chapter, we outline how to use Tn-Core to contextualize Tn-seq data (and optionally RNA-seq data) with metabolic models to: (1) generate a complete view of essential metabolism, (2) prepare context-specific metabolic models for further computational analyses, and (3) refine genome-scale metabolic models. All functions of Tn-Core are provided for download from a freely available repository (github.com/diCenzo-GC/Tn-Core), and a web-app requiring limited computational experience is also available (combo.dbe.unifi.it/tncore).",
                "authors": [
                    {
                        "name": "Fondi M."
                    },
                    {
                        "name": "Galardini M."
                    },
                    {
                        "name": "diCenzo G.C."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Methods in Molecular Biology",
                "title": "Tn-Core: Functionally Interpreting Transposon-Sequencing Data with Metabolic Network Analysis"
            },
            "pmid": "33180303"
        }
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
