{
    "additionDate": "2018-04-22T10:25:02Z",
    "biotoolsCURIE": "biotools:probis-charmming",
    "biotoolsID": "probis-charmming",
    "credit": [
        {
            "email": "konc@cmm.ki.si",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Connected the ProBiS and CHARMMing web servers into one functional unit that enables prediction of protein-ligand complexes and allows for their geometry optimization and interaction energy calculation.",
    "documentation": [
        {
            "type": "General",
            "url": "https://probis.nih.gov/download/probis-ligands-apr-22-2014.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                }
            ]
        }
    ],
    "homepage": "https://probis.nih.gov/",
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "ProBiS-CHARMMing",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1021/acs.jcim.5b00534",
            "metadata": {
                "abstract": "© 2015 American Chemical Society. Proteins often exist only as apo structures (unligated) in the Protein Data Bank, with their corresponding holo structures (with ligands) unavailable. However, apoproteins may not represent the amino-acid residue arrangement upon ligand binding well, which is especially problematic for molecular docking. We developed the ProBiS-CHARMMing web interface by connecting the ProBiS (http://probis.cmm.ki.si) and CHARMMing (http://www.charmming.org) web servers into one functional unit that enables prediction of protein-ligand complexes and allows for their geometry optimization and interaction energy calculation. The ProBiS web server predicts ligands (small compounds, proteins, nucleic acids, and single-atom ligands) that may bind to a query protein. This is achieved by comparing its surface structure against a nonredundant database of protein structures and finding those that have binding sites similar to that of the query protein. Existing ligands found in the similar binding sites are then transposed to the query according to predictions from ProBiS. The CHARMMing web server enables, among other things, minimization and potential energy calculation for a wide variety of biomolecular systems, and it is used here to optimize the geometry of the predicted protein-ligand complex structures using the CHARMM force field and to calculate their interaction energies with the corresponding query proteins. We show how ProBiS-CHARMMing can be used to predict ligands and their poses for a particular binding site, and minimize the predicted protein-ligand complexes to obtain representations of holoproteins. The ProBiS-CHARMMing web interface is freely available for academic users at http://probis.nih.gov.",
                "authors": [
                    {
                        "name": "Konc J."
                    },
                    {
                        "name": "Miller B.T."
                    },
                    {
                        "name": "Stular T."
                    },
                    {
                        "name": "Lesnik S."
                    },
                    {
                        "name": "Woodcock H.L."
                    },
                    {
                        "name": "Brooks B.R."
                    },
                    {
                        "name": "Janezic D."
                    }
                ],
                "citationCount": 18,
                "date": "2015-11-23T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "ProBiS-CHARMMing: Web Interface for Prediction and Optimization of Ligands in Protein Binding Sites"
            },
            "pmid": "26509288"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Protein sites, features and motifs",
            "uri": "http://edamontology.org/topic_3510"
        },
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ],
    "validated": 1
}