{
    "additionDate": "2015-01-29T15:47:27Z",
    "biotoolsCURIE": "biotools:webprank",
    "biotoolsID": "webprank",
    "collectionID": [
        "Goldman Tools",
        "EBI Tools"
    ],
    "credit": [
        {
            "name": "Goldman group",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "Ari Loytynoja",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "Nick Goldman",
            "typeRole": [
                "Contributor"
            ]
        },
        {
            "name": "EMBL-EBI",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "ari@ebi.ac.uk",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "ari.loytynoja@helsinki.fi",
            "name": "Ari Loytynoja",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Multiple sequence alignment tool.",
    "documentation": [
        {
            "type": [
                "Terms of use"
            ],
            "url": "http://www.ebi.ac.uk/about/terms-of-use"
        },
        {
            "type": [
                "General"
            ],
            "url": "http://www.ebi.ac.uk/goldman-srv/webprank/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence",
                        "uri": "http://edamontology.org/data_2044"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Sequence alignment",
                        "uri": "http://edamontology.org/data_0863"
                    }
                }
            ]
        }
    ],
    "homepage": "http://www.ebi.ac.uk/goldman-srv/webprank/",
    "lastUpdate": "2018-12-10T12:58:50Z",
    "name": "webPRANK",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "EMBL-EBI",
    "publication": [
        {
            "doi": "10.1186/1471-2105-11-579",
            "metadata": {
                "abstract": "Background: Phylogeny-aware progressive alignment has been found to perform well in phylogenetic alignment benchmarks and to produce superior alignments for the inference of selection on codon sequences. Its implementation in the PRANK alignment program package also allows modelling of complex evolutionary processes and inference of posterior probabilities for sequence sites evolving under each distinct scenario, either simultaneously with the alignment of sequences or as a post-processing step for an existing alignment. This has led to software with many advanced features, and users may find it difficult to generate optimal alignments, visualise the full information in their alignment results, or post-process these results, e.g. by objectively selecting subsets of alignment sites.Results: We have created a web server called webPRANK that provides an easy-to-use interface to the PRANK phylogeny-aware alignment algorithm. The webPRANK server supports the alignment of DNA, protein and codon sequences as well as protein-translated alignment of cDNAs, and includes built-in structure models for the alignment of genomic sequences. The resulting alignments can be exported in various formats widely used in evolutionary sequence analyses. The webPRANK server also includes a powerful web-based alignment browser for the visualisation and post-processing of the results in the context of a cladogram relating the sequences, allowing (e.g.) removal of alignment columns with low posterior reliability. In addition to de novo alignments, webPRANK can be used for the inference of ancestral sequences with phylogenetically realistic gap patterns, and for the annotation and post-processing of existing alignments. The webPRANK server is freely available on the web at http://tinyurl.com/webprank .Conclusions: The webPRANK server incorporates phylogeny-aware multiple sequence alignment, visualisation and post-processing in an easy-to-use web interface. It widens the user base of phylogeny-aware multiple sequence alignment and allows the performance of all alignment-related activity for small sequence analysis projects using only a standard web browser. © 2010 Löytynoja and Goldman; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Loytynoja A."
                    },
                    {
                        "name": "Goldman N."
                    }
                ],
                "citationCount": 251,
                "date": "2010-11-26T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "WebPRANK: A phylogeny-aware multiple sequence aligner with interactive alignment browser"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}