{
    "additionDate": "2021-01-18T09:44:21Z",
    "biotoolsCURIE": "biotools:wilsongen",
    "biotoolsID": "wilsongen",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "vinods@igib.in",
            "name": "Vinod Scaria",
            "typeEntity": "Person"
        },
        {
            "email": "binukumar@igib.in",
            "name": "Binukumar BK",
            "typeEntity": "Person"
        }
    ],
    "description": "WilsonGen a comprehensive clinically annotated genomic variant resource for Wilson's Disease.\n\nWilsonGen is a comprehensive resource of genetic variants in ATP7B gene manually curated from literature and data resources and systematically annotated using the ACMG & AMP guidelines for assessing pathogenicity of genetic variants. The resource therefore serves as a central point for clinicians and geneticists working on Wilson Disease.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Variant classification",
                    "uri": "http://edamontology.org/operation_3225"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "http://clingen.igib.res.in/WilsonGen/",
    "lastUpdate": "2021-03-14T12:23:33Z",
    "name": "WilsonGen",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1038/S41598-020-66099-2",
            "metadata": {
                "abstract": "© 2020, The Author(s).Wilson disease (WD) is one of the most prevalent genetic diseases with an estimated global carrier frequency of 1 in 90 and a prevalence of 1 in 30,000. The disease owes its genesis to Kinnier Wilson who described the disease, and is caused by accumulation of Copper (Cu) in various organs including the liver, central nervous system, cornea, kidney, joints and cardiac muscle which contribute to the characteristic clinical features of WD. A number of studies have reported genetic variants in the ATP7B gene from diverse ethnic and geographical origins. The recent advent of next-generation sequencing approaches has also enabled the discovery of a large number of novel variants in the gene associated with the disease. Previous attempts have been made to compile the knowledgebase and spectrum of genetic variants from across the multitude of publications, but have been limited by the utility due to the significant differences in approaches used to qualify pathogenicity of variants in each of the publications. The recent formulation of guidelines and algorithms for assessment of the pathogenicity of variants jointly put forward by the American College of Medical Genetics and the Association of Molecular Pathologists (ACMG &AMP) has provided a framework for evidence based and systematic assessment of pathogenicity of variants. In this paper, we describe a comprehensive resource of genetic variants in ATP7B gene manually curated from literature and data resources and systematically annotated using the ACMG & AMP guidelines for assessing pathogenicity. The resource therefore serves as a central point for clinicians and geneticists working on WD and to the best of our knowledge is the most comprehensive and only clinically annotated resource for WD. The resource is available at URL http://clingen.igib.res.in/WilsonGen/. We compiled a total of 3662 genetic variants from publications and databases associated with WD. Of these variants compiled, a total of 1458 were found to be unique entries. This is the largest WD database comprising 656 pathogenic/likely pathogenic variants reported classified according to ACMG & AMP guidelines. We also mapped all the pathogenic variants corresponding to ATP7B protein from literature and other databases. In addition, geographical origin and distribution of ATP7B pathogenic variants reported are also mapped in the database.",
                "authors": [
                    {
                        "name": "Kumar M."
                    },
                    {
                        "name": "Gaharwar U."
                    },
                    {
                        "name": "Paul S."
                    },
                    {
                        "name": "Poojary M."
                    },
                    {
                        "name": "Pandhare K."
                    },
                    {
                        "name": "Scaria V."
                    },
                    {
                        "name": "Bk B."
                    }
                ],
                "citationCount": 1,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "WilsonGen a comprehensive clinically annotated genomic variant resource for Wilson’s Disease"
            },
            "pmcid": "PMC7270127",
            "pmid": "32493955"
        }
    ],
    "topic": [
        {
            "term": "Gastroenterology",
            "uri": "http://edamontology.org/topic_3409"
        },
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ]
}