{
    "additionDate": "2017-01-17T15:01:04Z",
    "biotoolsCURIE": "biotools:qdnaseq",
    "biotoolsID": "qdnaseq",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "d.sie@vumc.nl",
            "name": "Daoud Sie",
            "orcidid": "http://orcid.org/0000-0001-6762-2582",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Quantitative DNA sequencing for chromosomal aberrations. The genome is divided into non-overlapping fixed-sized bins, number of sequence reads in each counted, adjusted with a simultaneous two-dimensional loess correction for sequence mappability and GC content, and filtered to remove spurious regions in the genome. Downstream steps of segmentation and calling are also implemented via packages DNAcopy and CGHcall, respectively.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/QDNAseq.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/QDNAseq_1.10.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/QDNAseq.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-10T15:31:24Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Mirror"
            ],
            "url": "https://github.com/ccagc/QDNAseq"
        }
    ],
    "name": "QDNAseq",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1101/gr.175141.114",
            "metadata": {
                "abstract": "© 2014 Scheinin et al.Detection of DNA copy number aberrations by shallow whole-genome sequencing (WGS) faces many challenges, including lack of completion and errors in the human reference genome, repetitive sequences, polymorphisms, variable sample quality, and biases in the sequencing procedures. Formalin-fixed paraffin-embedded (FFPE) archival material, the analysis of which is important for studies of cancer, presents particular analytical difficulties due to degradation of the DNA and frequent lack of matched reference samples. We present a robust, cost-effective WGS method for DNA copy number analysis that addresses these challenges more successfully than currently available procedures. In practice, very useful profiles can be obtained with ∼0.1x genome coverage. We improve on previous methods by first implementing a combined correction for sequence mappability and GC content, and second, by applying this procedure to sequence data from the 1000 Genomes Project in order to develop a blacklist of problematic genome regions. A small subset of these blacklisted regions was previously identified by ENCODE, but the vast majority are novel unappreciated problematic regions. Our procedures are implemented in a pipeline called QDNAseq. We have analyzed over 1000 samples, most of which were obtained from the fixed tissue archives of more than 25 institutions. We demonstrate that for most samples our sequencing and analysis procedures yield genome profiles with noise levels near the statistical limit imposed by read counting. The described procedures also provide better correction of artifacts introduced by low DNA quality than prior approaches and better copy number data than high-resolution microarrays at a substantially lower cost.",
                "authors": [
                    {
                        "name": "Scheinin I."
                    },
                    {
                        "name": "Sie D."
                    },
                    {
                        "name": "Bengtsson H."
                    },
                    {
                        "name": "Van De Wiel M.A."
                    },
                    {
                        "name": "Olshen A.B."
                    },
                    {
                        "name": "Van Thuijl H.F."
                    },
                    {
                        "name": "Van Essen H.F."
                    },
                    {
                        "name": "Eijk P.P."
                    },
                    {
                        "name": "Rustenburg F."
                    },
                    {
                        "name": "Meijer G.A."
                    },
                    {
                        "name": "Reijneveld J.C."
                    },
                    {
                        "name": "Wesseling P."
                    },
                    {
                        "name": "Pinkel D."
                    },
                    {
                        "name": "Albertson D.G."
                    },
                    {
                        "name": "Ylstra B."
                    }
                ],
                "citationCount": 166,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "DNA copy number analysis of fresh and formalin-fixed specimens by shallow whole-genome sequencing with identification and exclusion of problematic regions in the genome assembly"
            },
            "pmcid": "PMC4248318",
            "pmid": "25236618",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1,
    "version": [
        "1.10.0"
    ]
}