{
    "additionDate": "2017-08-20T15:04:04Z",
    "biotoolsCURIE": "biotools:apples",
    "biotoolsID": "apples",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "email": "et22@le.ac.uk",
            "name": "Eran Tauber",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www2.warwick.ac.uk/fac/sci/dcs/people/sascha_ott/tools_and_software/apples"
        }
    ],
    "description": "Set of tools to analyse promoter sequences on a genome-wide scale.",
    "documentation": [
        {
            "type": "General",
            "url": "http://www.wsbc.warwick.ac.uk/peterkrusche/APPLES/docs/"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence feature detection",
                    "uri": "http://edamontology.org/operation_0253"
                }
            ]
        }
    ],
    "homepage": "http://cyverseuk.org/applications/warwick/analysis-of-plant-promoter-linked-elements/",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2019-09-04T08:37:54Z",
    "license": "GPL-3.0",
    "name": "APPLES",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1186/s12862-015-0499-6",
            "metadata": {
                "abstract": "© 2015 Davies et al.Background: Phylogenetic footprinting is a comparative method based on the principle that functional sequence elements will acquire fewer mutations over time than non-functional sequences. Successful comparisons of distantly related species will thus yield highly important sequence elements likely to serve fundamental biological roles. RNA regulatory elements are less well understood than those in DNA. In this study we use the emerging model organism Nasonia vitripennis, a parasitic wasp, in a comparative analysis against 12 insect genomes to identify deeply conserved non-coding elements (CNEs) conserved in large groups of insects, with a focus on 5' UTRs and promoter sequences. Results: We report the identification of 322 CNEs conserved across a broad range of insect orders. The identified regions are associated with regulatory and developmental genes, and contain short footprints revealing aspects of their likely function in translational regulation. The most ancient regions identified in our analysis were all found to overlap transcribed regions of genes, reflecting stronger conservation of translational regulatory elements than transcriptional elements. Further expanding sequence analyses to non-insect species we also report the discovery of, to our knowledge, the two oldest and most ubiquitous CNE's yet described in the animal kingdom (700 MYA). These ancient conserved non-coding elements are associated with the two ribosomal stalk genes, RPLP1 and RPLP2, and were very likely functional in some of the earliest animals. Conclusions: We report the identification of the most deeply conserved CNE's found to date, and several other deeply conserved elements which are without exception, part of 5' untranslated regions of transcripts, and occur in a number of key translational regulatory genes, highlighting translational regulation of translational regulators as a conserved feature of insect genomes.",
                "authors": [
                    {
                        "name": "Davies N.J."
                    },
                    {
                        "name": "Krusche P."
                    },
                    {
                        "name": "Tauber E."
                    },
                    {
                        "name": "Ott S."
                    }
                ],
                "citationCount": 4,
                "date": "2015-12-01T00:00:00Z",
                "journal": "BMC Evolutionary Biology",
                "title": "Analysis of 5' gene regions reveals extraordinary conservation of novel non-coding sequences in a wide range of animals"
            },
            "type": "Primary"
        },
        {
            "doi": "10.1105/tpc.112.103010",
            "metadata": {
                "abstract": "Conserved noncoding sequences (CNSs) in DNA are reliable pointers to regulatory elements controlling gene expression. Using a comparative genomics approach with four dicotyledonous plant species (Arabidopsis thaliana, papaya [Carica papaya], poplar [Populus trichocarpa], and grape [Vitis vinifera]), we detected hundreds of CNSs upstream of Arabidopsis genes. Distinct positioning, length, and enrichment for transcription factor binding sites suggest these CNSs play a functional role in transcriptional regulation. The enrichment of transcription factors within the set of genes associated with CNS is consistent with the hypothesis that together they form part of a conserved transcriptional network whose function is to regulate other transcription factors and control development. We identified a set of promoters where regulatory mechanisms are likely to be shared between the model organism Arabidopsis and other dicots, providing areas of focus for further research. © 2012 American Society of Plant Biologists. All rights reserved.",
                "authors": [
                    {
                        "name": "Baxter L."
                    },
                    {
                        "name": "Jironkin A."
                    },
                    {
                        "name": "Hickman R."
                    },
                    {
                        "name": "Moore J."
                    },
                    {
                        "name": "Barrington C."
                    },
                    {
                        "name": "Krusche P."
                    },
                    {
                        "name": "Dyer N.P."
                    },
                    {
                        "name": "Buchanan-Wollaston V."
                    },
                    {
                        "name": "Tiskin A."
                    },
                    {
                        "name": "Beynon J."
                    },
                    {
                        "name": "Denby K."
                    },
                    {
                        "name": "Ott S."
                    }
                ],
                "citationCount": 37,
                "date": "2012-10-01T00:00:00Z",
                "journal": "Plant Cell",
                "title": "Conserved noncoding sequences highlight shared components of regulatory networks in dicotyledonous plants"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        }
    ],
    "validated": 1
}