{
    "accessibility": "Open access",
    "additionDate": "2022-07-25T21:09:57.236527Z",
    "biotoolsCURIE": "biotools:portfoliodiet.app",
    "biotoolsID": "portfoliodiet.app",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "john.sievenpiper@utoronto.ca",
            "name": "John L Sievenpiper",
            "orcidid": "https://orcid.org/0000-0002-3270-5772",
            "typeEntity": "Person"
        },
        {
            "name": "Cyril W C Kendall",
            "orcidid": "https://orcid.org/0000-0002-0826-5236"
        },
        {
            "name": "David J A Jenkins",
            "orcidid": "https://orcid.org/0000-0003-1192-9571"
        },
        {
            "name": "Lawrence A Leiter",
            "orcidid": "https://orcid.org/0000-0002-1040-6229"
        }
    ],
    "description": "A Web-Based Health Application to Translate Nutrition Therapy for Cardiovascular Risk Reduction in Primary Care (PortfolioDiet.app).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "http://PortfolioDiet.app",
    "lastUpdate": "2022-07-25T21:09:57.240605Z",
    "name": "PortfolioDiet.app",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.2196/34704",
            "metadata": {
                "abstract": "© Meaghan E Kavanagh, Laura Chiavaroli, Andrea J Glenn, Genevieve Heijmans, Shannan M Grant, Chi-Ming Chow, Robert G Josse, Vasanti S Malik, William Watson, Aisha Lofters, Candice Holmes, Julia Rackal, Kristie Srichaikul, Diana Sherifali, Erna Snelgrove-Clarke, Jacob A Udell, Peter Juni, Gillian L Booth, Michael E Farkouh, Lawrence A Leiter, Cyril WC Kendall, David JA Jenkins, John L Sievenpiper.Background: The Portfolio Diet, or Dietary Portfolio, is a therapeutic dietary pattern that combines cholesterol-lowering foods to manage dyslipidemia for the prevention of cardiovascular disease. To translate the Portfolio Diet for primary care, we developed the PortfolioDiet.app as a patient and physician educational and engagement tool for PCs and smartphones. The PortfolioDiet.app is currently being used as an add-on therapy to the standard of care (usual care) for the prevention of cardiovascular disease in primary care. To enhance the adoption of this tool, it is important to ensure that the PortfolioDiet.app meets the needs of its target end users. Objective: The main objective of this project is to undertake user testing to inform modifications to the PortfolioDiet.app as part of ongoing engagement in quality improvement (QI). Methods: We undertook a 2-phase QI project from February 2021 to September 2021. We recruited users by convenience sampling. Users included patients, family physicians, and dietitians, as well as nutrition and medical students. For both phases, users were asked to use the PortfolioDiet.app daily for 7 days. In phase 1, a mixed-form questionnaire was administered to evaluate the users' perceived acceptability, knowledge acquisition, and engagement with the PortfolioDiet.app. The questionnaire collected both quantitative and qualitative data, including 2 open-ended questions. The responses were used to inform modifications to the PortfolioDiet.app. In phase 2, the System Usability Scale was used to assess the usability of the updated PortfolioDiet.app, with a score higher than 70 being considered acceptable. Results: A total of 30 and 19 users were recruited for phase 1 and phase 2, respectively. In phase 1, the PortfolioDiet.app increased users' perceived knowledge of the Portfolio Diet and influenced their perceived food choices. Limitations identified by users included challenges navigating to resources and profile settings, limited information on plant sterols, inaccuracies in points, timed-logout frustration, request for step-by-step pop-up windows, and request for a mobile app version; when looking at positive feedback, the recipe section was the most commonly praised feature. Between the project phases, 6 modifications were made to the PortfolioDiet.app to incorporate and address user feedback. At phase 2, the average System Usability Scale score was 85.39 (SD 11.47), with 100 being the best possible. Conclusions: By undertaking user testing of the PortfolioDiet.app, its limitations and strengths were able to be identified, informing modifications to the application, which resulted in a clinical tool that better meets users' needs. The PortfolioDiet.app educates users on the Portfolio Diet and is considered acceptable by users. Although further refinements to the PortfolioDiet.app will continue to be made before its evaluation in a clinical trial, the result of this QI project is an improved clinical tool.",
                "authors": [
                    {
                        "name": "Booth G.L."
                    },
                    {
                        "name": "Chiavaroli L."
                    },
                    {
                        "name": "Chow C.-M."
                    },
                    {
                        "name": "Farkouh M.E."
                    },
                    {
                        "name": "Glenn A.J."
                    },
                    {
                        "name": "Grant S.M."
                    },
                    {
                        "name": "Heijmans G."
                    },
                    {
                        "name": "Holmes C."
                    },
                    {
                        "name": "Jenkins D.J.A."
                    },
                    {
                        "name": "Josse R.G."
                    },
                    {
                        "name": "Juni P."
                    },
                    {
                        "name": "Kavanagh M.E."
                    },
                    {
                        "name": "Kendall C.W.C."
                    },
                    {
                        "name": "Leiter L.A."
                    },
                    {
                        "name": "Lofters A."
                    },
                    {
                        "name": "Malik V.S."
                    },
                    {
                        "name": "Rackal J."
                    },
                    {
                        "name": "Sherifali D."
                    },
                    {
                        "name": "Sievenpiper J.L."
                    },
                    {
                        "name": "Snelgrove-Clarke E."
                    },
                    {
                        "name": "Srichaikul K."
                    },
                    {
                        "name": "Udell J.A."
                    },
                    {
                        "name": "Watson W."
                    }
                ],
                "date": "2022-04-01T00:00:00Z",
                "journal": "JMIR Human Factors",
                "title": "A Web-Based Health Application to Translate Nutrition Therapy for Cardiovascular Risk Reduction in Primary Care (PortfolioDiet.app): Quality Improvement and Usability Testing Study"
            },
            "pmcid": "PMC9073604",
            "pmid": "35451981"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Cardiology",
            "uri": "http://edamontology.org/topic_3335"
        },
        {
            "term": "Data security",
            "uri": "http://edamontology.org/topic_3263"
        },
        {
            "term": "Nutritional science",
            "uri": "http://edamontology.org/topic_3390"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ],
    "validated": 1
}
