{
    "additionDate": "2020-01-09T17:40:25Z",
    "biotoolsCURIE": "biotools:LeGOO",
    "biotoolsID": "LeGOO",
    "confidence_flag": "tool",
    "description": "An Expertized Knowledge Database for the Model Legume Medicago truncatula.\n\nMedicago truncatula was proposed, about three decades ago, as a model legume to study the Rhizobium-legume symbiosis. It has now been adopted to study a wide range of biological questions, including various developmental processes (in particular root, symbiotic nodule and seed development), symbiotic (nitrogen-fixing and arbuscular mycorrhizal endosymbioses) and pathogenic interactions, as well as responses to abiotic stress. With a number of tools and resources set up in M. truncatula for omics, genetics and reverse genetics approaches, massive amounts of data have been produced, as well as four genome sequence releases. Many of these data were generated with heterogeneous tools, notably for transcriptomics studies, and are consequently difficult to integrate",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Relation extraction",
                    "uri": "http://edamontology.org/operation_3625"
                }
            ]
        }
    ],
    "homepage": "https://www.legoo.org",
    "lastUpdate": "2020-12-22T10:38:42Z",
    "name": "LeGOO",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/PCP/PCZ177",
            "metadata": {
                "abstract": "© The Author(s) 2019.Medicago truncatula was proposed, about three decades ago, as a model legume to study the Rhizobium-legume symbiosis. It has now been adopted to study a wide range of biological questions, including various developmental processes (in particular root, symbiotic nodule and seed development), symbiotic (nitrogen-fixing and arbuscular mycorrhizal endosymbioses) and pathogenic interactions, as well as responses to abiotic stress. With a number of tools and resources set up in M. truncatula for omics, genetics and reverse genetics approaches, massive amounts of data have been produced, as well as four genome sequence releases. Many of these data were generated with heterogeneous tools, notably for transcriptomics studies, and are consequently difficult to integrate. This issue is addressed by the LeGOO (for Legume Graph-Oriented Organizer) knowledge base (https://www.legoo.org), which finds the correspondence between the multiple identifiers of the same gene. Furthermore, an important goal of LeGOO is to collect and represent biological information from peer-reviewed publications, whatever the technical approaches used to obtain this information. The information is modeled in a graph-oriented database, which enables flexible representation, with currently over 200,000 relations retrieved from 298 publications. LeGOO also provides the user with mining tools, including links to the Mt5.0 genome browser and associated information (on gene functional annotation, expression, methylome, natural diversity and available insertion mutants), as well as tools to navigate through different model species. LeGOO is, therefore, an innovative database that will be useful to the Medicago and legume community to better exploit the wealth of data produced on this model species.",
                "authors": [
                    {
                        "name": "Carrere S."
                    },
                    {
                        "name": "Gamas P."
                    },
                    {
                        "name": "Gough C."
                    },
                    {
                        "name": "Gouzy J."
                    },
                    {
                        "name": "Verdenaud M."
                    }
                ],
                "citationCount": 2,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Plant and Cell Physiology",
                "title": "LeGOO: An expertized knowledge database for the model legume medicago truncatula"
            },
            "pmid": "31605615"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
