{
    "additionDate": "2017-01-17T15:03:39Z",
    "biotoolsCURIE": "biotools:compgo",
    "biotoolsID": "compgo",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "A.Waardenberg@victorchang.edu.au",
            "name": "Ashley J. Waardenberg",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "This package contains functions to accomplish several tasks. It can download full genome databases from UCSC, import .bed files, annotate these .bed file regions with genes from aforementioned database dumps, interface with DAVID to create functional annotation and GO enrichment charts based on gene lists and visualise and compare these enrichments using either directed acyclic graphs or scatterplots.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/CompGO.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/CompGO_1.10.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence annotation",
                    "uri": "http://edamontology.org/operation_0361"
                },
                {
                    "term": "Sequence feature comparison",
                    "uri": "http://edamontology.org/operation_0256"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/CompGO.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "license": "GPL-2.0",
    "name": "CompGO",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1186/s12859-015-0701-2",
            "metadata": {
                "abstract": "© 2015 Waardenberg et al. Background: Gene ontology (GO) enrichment is commonly used for inferring biological meaning from systems biology experiments. However, determining differential GO and pathway enrichment between DNA-binding experiments or using the GO structure to classify experiments has received little attention. Results: Herein, we present a bioinformatics tool, CompGO, for identifying Differentially Enriched Gene Ontologies, called DiEGOs, and pathways, through the use of a z-score derivation of log odds ratios, and visualizing these differences at GO and pathway level. Through public experimental data focused on the cardiac transcription factor NKX2-5, we illustrate the problems associated with comparing GO enrichments between experiments using a simple overlap approach. Conclusions: We have developed an R/Bioconductor package, CompGO, which implements a new statistic normally used in epidemiological studies for performing comparative GO analyses and visualizing comparisons from . BED data containing genomic coordinates as well as gene lists as inputs. We justify the statistic through inclusion of experimental data and compare to the commonly used overlap method. CompGO is freely available as a R/Bioconductor package enabling easy integration into existing pipelines and is available at: http://www.bioconductor.org/packages/release/bioc/html/CompGO.htmlpackages/release/bioc/html/CompGO.html",
                "authors": [
                    {
                        "name": "Waardenberg A.J."
                    },
                    {
                        "name": "Basset S.D."
                    },
                    {
                        "name": "Bouveret R."
                    },
                    {
                        "name": "Harvey R.P."
                    }
                ],
                "citationCount": 12,
                "date": "2015-09-02T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "CompGO: An R package for comparing and visualizing Gene Ontology enrichment differences between DNA binding experiments"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1,
    "version": [
        "1.10.0"
    ]
}