{
    "name": "NextSV", 
    "description": "A meta SV caller and a computational pipeline to perform SV calling from low coverage long-read sequencing data. It integrates three aligners and three SV callers and generates two integrated call sets (sensitive/stringent) for different analysis purpose.", 
    "homepage": "http://github.com/Nextomics/NextSV", 
    "biotoolsID": "nextsv", 
    "biotoolsCURIE": "biotools:nextsv", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3228", 
                    "term": "Structural variation detection"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool", 
        "Library"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3168", 
            "term": "Sequencing"
        }, 
        {
            "uri": "http://edamontology.org/topic_3175", 
            "term": "Structural variation"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "Python"
    ], 
    "license": "MIT", 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "https://github.com/Nextomics/nextsv/blob/master/README.md", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1186/s12859-018-2207-1", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "NextSV: A meta-caller for structural variants from low-coverage long-read sequencing data", 
                "abstract": "© 2018 The Author(s). Background: Structural variants (SVs) in human genomes are implicated in a variety of human diseases. Long-read sequencing delivers much longer read lengths than short-read sequencing and may greatly improve SV detection. However, due to the relatively high cost of long-read sequencing, it is unclear what coverage is needed and how to optimally use the aligners and SV callers. Results: In this study, we developed NextSV, a meta-caller to perform SV calling from low coverage long-read sequencing data. NextSV integrates three aligners and three SV callers and generates two integrated call sets (sensitive/stringent) for different analysis purposes. We evaluated SV calling performance of NextSV under different PacBio coverages on two personal genomes, NA12878 and HX1. Our results showed that, compared with running any single SV caller, NextSV stringent call set had higher precision and balanced accuracy (F1 score) while NextSV sensitive call set had a higher recall. At 10X coverage, the recall of NextSV sensitive call set was 93.5 to 94.1% for deletions and 87.9 to 93.2% for insertions, indicating that ~10X coverage might be an optimal coverage to use in practice, considering the balance between the sequencing costs and the recall rates. We further evaluated the Mendelian errors on an Ashkenazi Jewish trio dataset. Conclusions: Our results provide useful guidelines for SV detection from low coverage whole-genome PacBio data and we expect that NextSV will facilitate the analysis of SVs on long-read sequencing data.", 
                "date": "2018-05-23T00:00:00Z", 
                "citationCount": 2, 
                "authors": [
                    {
                        "name": "Fang L."
                    }, 
                    {
                        "name": "Hu J."
                    }, 
                    {
                        "name": "Wang D."
                    }, 
                    {
                        "name": "Wang K."
                    }
                ], 
                "journal": "BMC Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": "Kai Wang", 
            "email": "wangk@email.chop.edu", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "shadi.m", 
    "additionDate": "2018-07-31T17:55:59Z", 
    "lastUpdate": "2018-12-10T12:59:00Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}