{
    "additionDate": "2019-11-14T19:39:10Z",
    "biotoolsCURIE": "biotools:BNNR",
    "biotoolsID": "BNNR",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jxwang@mail.csu.edu.cn",
            "name": "Jianxin Wang",
            "orcidid": "https://orcid.org/0000-0003-1516-0480",
            "typeEntity": "Person"
        }
    ],
    "description": "Drug repositioning based on bounded nuclear norm regularization | BNNR is a novel computational method, which utilizes Bounded Nuclear Norm Regularization algorithm to identify potential novel indications for known or new drugs. The code in this package implements Bounded Nuclear Norm Regularization (BNNR) for drug repositioning, which is implemented in Matlab2014a",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/BioinformaticsCSU/BNNR",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2020-12-09T14:50:53Z",
    "name": "BNNR",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ331",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press.Motivation: Computational drug repositioning is a cost-effective strategy to identify novel indications for existing drugs. Drug repositioning is often modeled as a recommendation system problem. Taking advantage of the known drug-disease associations, the objective of the recommendation system is to identify new treatments by filling out the unknown entries in the drug-disease association matrix, which is known as matrix completion. Underpinned by the fact that common molecular pathways contribute to many different diseases, the recommendation system assumes that the underlying latent factors determining drug-disease associations are highly correlated. In other words, the drug-disease matrix to be completed is low-rank. Accordingly, matrix completion algorithms efficiently constructing low-rank drug-disease matrix approximations consistent with known associations can be of immense help in discovering the novel drug-disease associations. Results: In this article, we propose to use a bounded nuclear norm regularization (BNNR) method to complete the drug-disease matrix under the low-rank assumption. Instead of strictly fitting the known elements, BNNR is designed to tolerate the noisy drug-drug and disease-disease similarities by incorporating a regularization term to balance the approximation error and the rank properties. Moreover, additional constraints are incorporated into BNNR to ensure that all predictedmatrix entry values are within the specific interval. BNNR is carried out on an adjacency matrix of a heterogeneous drug-disease network, which integrates the drug-drug, drug-disease and disease-disease networks. It not only makes full use of available drugs, diseases and their association information, but also is capable of dealing with cold start naturally. Our computational results show that BNNR yields higher drug-disease association prediction accuracy than the current state-of-the-art methods. The most significant gain is in prediction precision measured as the fraction of the positive predictions that are truly positive, which is particularly useful in drug design practice. Cases studies also confirm the accuracy and reliability of BNNR.",
                "authors": [
                    {
                        "name": "Yang M."
                    },
                    {
                        "name": "Luo H."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Wang J."
                    }
                ],
                "citationCount": 24,
                "date": "2019-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Drug repositioning based on bounded nuclear norm regularization"
            },
            "pmcid": "PMC6612853",
            "pmid": "31510658"
        }
    ],
    "topic": [
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Safety sciences",
            "uri": "http://edamontology.org/topic_3377"
        }
    ],
    "validated": 1
}