{
    "additionDate": "2017-01-17T14:56:53Z",
    "biotoolsCURIE": "biotools:rmassbank",
    "biotoolsID": "rmassbank",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "massbank@eawag.ch",
            "name": "RMassBank at Eawag",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Workflow to process tandem MS files and build MassBank records. Functions include automated extraction of tandem MS spectra, formula assignment to tandem MS fragments, recalibration of tandem MS spectra with assigned fragments, spectrum cleanup, automated retrieval of compound information from Internet databases, and export to MassBank records.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/RMassBank.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/RMassBank_2.2.1.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Database metadata",
                        "uri": "http://edamontology.org/data_0957"
                    },
                    "format": [
                        {
                            "term": "XML",
                            "uri": "http://edamontology.org/format_2332"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Mass spectrometry data",
                        "uri": "http://edamontology.org/data_2536"
                    },
                    "format": [
                        {
                            "term": "Mass spectrometry data format",
                            "uri": "http://edamontology.org/format_3245"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/RMassBank.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-09T16:22:15Z",
    "license": "Artistic-2.0",
    "name": "RMassBank",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1002/jms.3131",
            "metadata": {
                "abstract": "High accuracy, high resolution tandem mass spectrometry (MS/MS) is becoming more common in analytical applications, yet databases of these spectra remain limited. Databases require good quality spectra with sufficient compound information, but processing, calibration, noise reduction and retrieval of compound information are time-consuming tasks that prevent many contributions. We present a comprehensive workflow for the automatic processing of MS/MS using formula annotation for recalibration and cleanup to generate high quality spectra of standard compounds for upload to MassBank (www.massbank.jp). Compound information is retrieved via Internet services. Reference standards of 70 pesticides were measured at various collision energies on an LTQ-Orbitrap XL to develop and evaluate the workflow. A total of 944 resulting spectra are now available on MassBank. Evidence of nitrogen adduct formation during MS/MS fragmentation processes was found, highlighting the benefits high accuracy MS/MS offers for spectral interpretation. A database of recalibrated, cleaned-up spectra resulted in the most correct spectra ranked in first place, regardless of whether the search spectra were recalibrated or not, whereas the average rank of the correct molecular formula was improved from 2.55 (uncalibrated) to 1.53 when using recalibrated MS/MS data. The workflow is available as an R package RMassBank capable of generating MassBank records from raw MS and MS/MS data and can be adjusted to process data acquired with different settings and instruments. This workflow is a vital step towards addressing the need for more high quality, high accuracy MS/MS spectra in spectral databases and provides important information for spectral interpretation. Copyright © 2012 John Wiley & Sons, Ltd. Copyright © 2012 John Wiley & Sons, Ltd.",
                "authors": [
                    {
                        "name": "Hollender J."
                    },
                    {
                        "name": "Schymanski E.L."
                    },
                    {
                        "name": "Singer H.P."
                    },
                    {
                        "name": "Stravs M.A."
                    }
                ],
                "citationCount": 60,
                "date": "2013-01-01T00:00:00Z",
                "journal": "Journal of Mass Spectrometry",
                "title": "Automatic recalibration and processing of tandem mass spectra using formula annotation"
            },
            "pmid": "23303751",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        }
    ],
    "validated": 1,
    "version": [
        "2.2.1"
    ]
}
