
{
    "credit": [
        {
            "email": "fpereirapt@gmail.com",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://fpereira.portugene.com/index.html"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://portugene.com/repeataround.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Repeat sequence analysis",
                    "uri": "http://edamontology.org/operation_0237"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Windows"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Sequence composition, complexity and repeats",
                "uri": "http://edamontology.org/topic_0157"
            },
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            },
            {
                "term": "Simulation experiment",
                "uri": "http://edamontology.org/topic_3524"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/repeataround-2-1-find-repeats-circular-genomes.html"
        }
    ],
    "publication": [
        {
            "abstract": "RepeatAround is a Windows based software tool designed to find \"direct repeats\", \"inverted repeats\", \"mirror repeats\" and \"complementary repeats\", from 3 to 64 bp length, in circular genomes. It processes input files directly extracted from GenBank database, providing visualisation of the repeats location in the genomic structure, so that for instance, in most mtDNAs the user can check if the repeats are located in coding or non-coding region (and in the first case in which gene), and how far apart the repeat pair(s) are. Besides the visual tool, it provides other outputs in a spreadsheet containing information on the number and location of the repeats, facilitating graphic analyses. Several genomes can be inputed simultaneously, for phylogenetic comparison purposes. Other capabilities of the software are the generation of random circular genomes, for statistical evaluation of comparison between observed repeats distributions with their shuffled counterparts, as well as the search for specific motifs, allowing an easy confirmation of repeats flanking a newly detected rearrangement. As an example of the programme's applications we analysed the Direct Repeats distribution in a large human mtDNA database. Results showed that Direct Repeats, even the larger ones, are evenly distributed among the human mtDNA haplogroups, enabling us to state that, based only on the repetitive motifs, no haplogroup is particularly more or less prone to mtDNA macrodeletions. © 2006 Mitochondrion Research Society.",
            "authors": [
                "Goios A.",
                "Meirinhos J.",
                "Rocha R.",
                "Lopes R.",
                "Amorim A.",
                "Pereira L."
            ],
            "cit_count": 6,
            "journal": "Mitochondrion",
            "pmid": "16854633",
            "title": "RepeatAround: A software tool for finding and visualizing repeats in circular genomes and its application to a human mtDNA database",
            "year": "2006-08-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:repeataround",
        "biotoolsID": "repeataround",
        "description": "It is designed to find “direct repeats”, “inverted repeats”, “mirror repeats” and “complementary repeats”, from 3 bp to 64 bp length, in circular genomes. It processes input files directly extracted from GenBank database and several genomes can be input simultaneously. The program provides visualisation of the repeats location in the genomic structure and the search for specific motifs is also possible.",
        "homepage": "http://portugene.com/repeataround.html",
        "name": "RepeatAround"
    }
}