{
    "additionDate": "2021-01-18T11:45:19Z",
    "biotoolsCURIE": "biotools:fastafs",
    "biotoolsID": "fastafs",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "y.hoogstrate@erasmusmc.nl",
            "name": "Youri Hoogstrate",
            "typeEntity": "Person"
        }
    ],
    "description": "FASTAFS is toolkit for file system virtualisation of random access compressed FASTA files.\nAlthough it is uncommon, the FASTAFS format denotes the index (a typical header) after the data. The reason for this location is that most metadata can only be known after converting the entire FASTA file to FASTAFS. For instance, the number of nucleotides encoded within 2bit data, the number of N-characters or the checksum.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/yhoogstrate/fastafs/blob/master/doc/FASTAFS-FORMAT-SPECIFICATION.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Format detection",
                    "uri": "http://edamontology.org/operation_3357"
                },
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                }
            ]
        }
    ],
    "homepage": "https://github.com/yhoogstrate/fastafs",
    "language": [
        "C++",
        "Forth",
        "Python"
    ],
    "lastUpdate": "2022-04-02T21:27:02.767791Z",
    "license": "GPL-2.0",
    "name": "FASTAFS",
    "owner": "yhoogstrate",
    "publication": [
        {
            "doi": "10.1186/s12859-021-04455-3",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: The FASTA file format, used to store polymeric sequence data, has become a bioinformatics file standard used for decades. The relatively large files require additional files, beyond the scope of the original format, to identify sequences and to provide random access. Multiple compressors have been developed to archive FASTA files back and forth, but these lack direct access to targeted content or metadata of the archive. Moreover, these solutions are not directly backwards compatible to FASTA files, resulting in limited software integration. Results: We designed a linux based toolkit that virtualises the content of DNA, RNA and protein FASTA archives into the filesystem by using filesystem in userspace. This guarantees in-sync virtualised metadata files and offers fast random-access decompression using bit encodings plus Zstandard (zstd). The toolkit, FASTAFS, can track all its system-wide running instances, allows file integrity verification and can provide, instantly, scriptable access to sequence files and is easy to use and deploy. The file compression ratios were comparable but not superior to other state of the art archival tools, despite the innovative random access feature implemented in FASTAFS. Conclusions: FASTAFS is a user-friendly and easy to deploy backwards compatible generic purpose solution to store and access compressed FASTA files, since it offers file system access to FASTA files as well as in-sync metadata files through file virtualisation. Using virtual filesystems as in-between layer offers format conversion without the need to rewrite code into different programming languages while preserving compatibility.",
                "authors": [
                    {
                        "name": "Hoogstrate Y."
                    },
                    {
                        "name": "Jenster G.W."
                    },
                    {
                        "name": "Werken H.J.G."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "FASTAFS: file system virtualisation of random access compressed FASTA files"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Suite"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
