{
    "accessibility": "Open access",
    "additionDate": "2019-05-17T17:06:38Z",
    "biotoolsCURIE": "biotools:S4TE",
    "biotoolsID": "S4TE",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "sate@cirad.fr",
            "typeEntity": "Project",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Searching algorithm for Type IV effector proteins (S4TE) - software package developed for the prediction of Type IV effector proteins and the analysis of their genomic context.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Post-translation modification site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                }
            ]
        }
    ],
    "homepage": "http://sate.cirad.fr",
    "lastUpdate": "2020-06-16T10:55:22Z",
    "maturity": "Mature",
    "name": "S4TE",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1371/journal.pcbi.1006847",
            "metadata": {
                "abstract": "© 2019 Noroy et al.Bacterial pathogens have evolved numerous strategies to corrupt, hijack or mimic cellular processes in order to survive and proliferate. Among those strategies, Type IV effectors (T4Es) are proteins secreted by pathogenic bacteria to manipulate host cell processes during infection. They are delivered into eukaryotic cells in an ATP-dependent manner via the type IV secretion system, a specialized multiprotein complex. T4Es contain a wide spectrum of features including eukaryotic-like domains, localization signals or a C-terminal translocation signal. A combination of these features enables prediction of T4Es in a given bacterial genome. In this study, we developed a web-based comprehensive suite of tools with a userfriendly graphical interface. This version 2.0 of S4TE (Searching Algorithm for Type IV Effector Proteins; http://sate.cirad.fr) enables accurate prediction and comparison of T4Es. Search parameters and threshold can be customized by the user to work with any genome sequence, whether publicly available or not. Applications range from characterizing effector features and identifying potential T4Es to analyzing the effectors based on the genome G+C composition and local gene density. S4TE 2.0 allows the comparison of putative T4E repertoires of up to four bacterial strains at the same time. The software identifies T4E orthologs among strains and provides a Venn diagram and lists of genes for each intersection. New interactive features offer the best visualization of the location of candidate T4Es and hyperlinks to NCBI and Pfam databases. S4TE 2.0 is designed to evolve rapidly with the publication of new experimentally validated T4Es, which will reinforce the predictive power of the algorithm. The computational methodology can be used to identify a wide spectrum of candidate bacterial effectors that lack sequence conservation but have similar amino acid characteristics. This approach will provide very valuable information about bacterial host-specificity and virulence factors and help identify host targets for the development of new anti-bacterial molecules.",
                "authors": [
                    {
                        "name": "Lefrancois T."
                    },
                    {
                        "name": "Meyer D.F."
                    },
                    {
                        "name": "Noroy C."
                    }
                ],
                "citationCount": 10,
                "date": "2019-03-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Searching algorithm for type IV effector proteins (S4TE) 2.0: Improved tools for type IV effector prediction, analysis and comparison in proteobacteria"
            },
            "pmcid": "PMC6448907",
            "pmid": "30908487",
            "type": [
                "Primary"
            ],
            "version": "2.0"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1,
    "version": [
        "2.0"
    ]
}
