
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "topic": [
            {
                "term": "Computational chemistry",
                "uri": "http://edamontology.org/topic_3332"
            },
            {
                "term": "Molecular dynamics",
                "uri": "http://edamontology.org/topic_0176"
            },
            {
                "term": "Rare diseases",
                "uri": "http://edamontology.org/topic_3325"
            }
        ]
    },
    "link": [
        {
            "type": "REPOSITORY",
            "url": "https://gitlab.com/pyretis/pyretis"
        }
    ],
    "publication": [
        {
            "abstract": "© 2019 The Authors. Journal of Computational Chemistry published by Wiley Periodicals, Inc.The algorithmic development in the field of path sampling has made tremendous progress in recent years. Although the original transition path sampling method was mostly used as a qualitative tool to sample reaction paths, the more recent family of interface-based path sampling methods has paved the way for more quantitative rate calculation studies. Of the exact methods, the replica exchange transition interface sampling (RETIS) method is the most efficient, but rather difficult to implement. This has been the main motivation to develop the open-source Python-based computer library PyRETIS that was released in 2017. PyRETIS is designed to be easily interfaced with any molecular dynamics (MD) package using either classical or ab initio MD. In this study, we report on the principles and the software enhancements that are now included in PyRETIS 2, as well as the recent developments on the user interface, improvements of the efficiency via the implementation of new shooting moves, easier initialization procedures, analysis methods, and supported interfaced software. © 2019 The Authors. Journal of Computational Chemistry published by Wiley Periodicals, Inc.",
            "authors": [
                "Riccardi E.",
                "Lervik A.",
                "Roet S.",
                "Aaroen O.",
                "van Erp T.S."
            ],
            "cit_count": 0,
            "doi": "10.1002/JCC.26112",
            "journal": "Journal of Computational Chemistry",
            "pmid": "31742744",
            "title": "PyRETIS 2: An improbability drive for rare events",
            "year": "2020-02-05"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:PyRETIS_2",
        "biotoolsID": "PyRETIS_2",
        "description": "An improbability drive for rare events.\n\npyretis - Rare Event Simulations with python.\n\nPyRETIS is a Python library for rare event molecular simulations with emphasis on methods based on transition interface sampling and replica exchange transition interface sampling .\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'PyRETIS'",
        "homepage": "http://www.pyretis.org",
        "name": "PyRETIS 2"
    }
}