{
    "accessibility": "Open access",
    "additionDate": "2021-12-09T09:39:16.193192Z",
    "biotoolsCURIE": "biotools:abcnet",
    "biotoolsID": "abcnet",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "liu.yuliang@mail.scut.edu.cn",
            "name": "Yuliang Liu"
        },
        {
            "email": "stanzju@gmail.com",
            "name": "Hao Chen"
        }
    ],
    "description": "Adaptive Bezier-Curve Network for Real-time End-to-end Text Spotting.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://git.io/AdelaiDet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-12-09T09:39:16.195788Z",
    "license": "BSD-2-Clause",
    "name": "ABCNet",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1109/TPAMI.2021.3107437",
            "metadata": {
                "abstract": "IEEEText-spotting, which aims to integrate detection and recognition in a unified framework, has attracted increasing attention due to its simplicity between the two tasks. Here, we address the arbitrarily-shaped scene text spotting by presenting Adaptive Bezier Curve Network v2 (ABCNet v2). Our contributions are four-fold: 1) For the first time, we adaptively fit arbitrarily-shaped text by a parameterized Bezier curve, which can not only provide structured output but also controllable representation. 2) We design a novel BezierAlign layer for extracting accurate convolution features of a text instance with arbitrary shapes. 3) ABCNet v2 maintains an elegant pipeline with the only post-processing non-maximum suppression (NMS). 4) ABCNet v2 further utilizes a simple yet effective coordinate convolution to encode position of the convolutional filters, which leads to a considerable improvement with negligible computation overhead. Comprehensive experiments conducted on various benchmarks demonstrate ABCNet v2 can achieve state-of-the-art performance while maintaining very high efficiency. Most importantly, as there is little work on the research of text spotting quantization, we further exploit the algorithms and practical experience to improve the running time, which can not only advance recent results but also achieve extremely fast inference speed. Code and model are available in https://git.io/AdelaiDet.",
                "authors": [
                    {
                        "name": "Chen H."
                    },
                    {
                        "name": "Chen P."
                    },
                    {
                        "name": "He T."
                    },
                    {
                        "name": "Jin L."
                    },
                    {
                        "name": "Liu C."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Shen C."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Pattern Analysis and Machine Intelligence",
                "title": "ABCNet v2: Adaptive Bezier-Curve Network for Real-time End-to-end Text Spotting"
            },
            "pmid": "34460364"
        }
    ],
    "toolType": [
        "Suite"
    ],
    "topic": [
        {
            "term": "Laboratory techniques",
            "uri": "http://edamontology.org/topic_3361"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "version": [
        "V.2"
    ]
}
