{
    "additionDate": "2021-01-18T11:11:13Z",
    "biotoolsCURIE": "biotools:ncpro-ml",
    "biotoolsID": "ncpro-ml",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "greatchen@ncst.edu.cn",
            "name": "Wei Chen",
            "typeEntity": "Person"
        }
    ],
    "description": "An integrated computational tool for identifying non-coding RNA promoters in multiple species.\n\nThe promoter is located near the transcription start sites and regulates transcription initiation of the gene. Accurate identification of promoters is essential for understanding the mechanism of gene regulation. Since experimental methods are costly and ineffective, developing efficient and accurate computational tools to identify promoters are necessary. Although a series of methods have been proposed for identifying promoters, none of them is able to identify the promoters of non-coding RNA (ncRNA). In the present work, a new method called ncPro-ML was proposed to identify the promoter of ncRNA in Homo sapiens and Mus musculus, in which different kinds of sequence encoding schemes were used to convert DNA sequences into feature vectors. To test the length effect, for each species, datasets including sequences with different lengths were built",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Promoter prediction",
                    "uri": "http://edamontology.org/operation_0440"
                },
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                }
            ]
        }
    ],
    "homepage": "http://www.bio-bigdata.cn/ncPro-ML/",
    "lastUpdate": "2021-03-08T09:47:57Z",
    "name": "ncPro-ML",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/J.CSBJ.2020.09.001",
            "metadata": {
                "abstract": "© 2020 The Author(s)The promoter is located near the transcription start sites and regulates transcription initiation of the gene. Accurate identification of promoters is essential for understanding the mechanism of gene regulation. Since experimental methods are costly and ineffective, developing efficient and accurate computational tools to identify promoters are necessary. Although a series of methods have been proposed for identifying promoters, none of them is able to identify the promoters of non-coding RNA (ncRNA). In the present work, a new method called ncPro-ML was proposed to identify the promoter of ncRNA in Homo sapiens and Mus musculus, in which different kinds of sequence encoding schemes were used to convert DNA sequences into feature vectors. To test the length effect, for each species, datasets including sequences with different lengths were built. The results demonstrated that ncPro-ML achieved the best performance based on the dataset with the sequence length of 221 nucleotides for human and mouse. The performances of ncPro-ML were also satisfying from both independent dataset test and cross-species test. The results indicate that the proposed predictor can server as a powerful tool for the discovery of ncRNA promoters. In addition, a web-server for ncPro-ML was developed, which can be freely accessed at http://www.bio-bigdata.cn/ncPro-ML/.",
                "authors": [
                    {
                        "name": "Tang Q."
                    },
                    {
                        "name": "Nie F."
                    },
                    {
                        "name": "Kang J."
                    },
                    {
                        "name": "Chen W."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Computational and Structural Biotechnology Journal",
                "title": "ncPro-ML: An integrated computational tool for identifying non-coding RNA promoters in multiple species"
            },
            "pmcid": "PMC7509369",
            "pmid": "33005306"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}