{"credit":[{"email":"jzwang@northwestern.edu","name":"Ji-Ping Wang","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"url":"http://bioconductor.org/packages/release/bioc/html/NuPoP.html"}],"download":[{"type":"Source code","url":"http://bioconductor/packages/release/bioc/src/contrib/NuPoP_1.24.0.tar.gz"}],"function":[{"operation":[{"term":"Nucleosome formation or exclusion sequence prediction","uri":"http://edamontology.org/operation_0432"}]}],"labels":{"collectionID":["BioConductor"],"language":["R"],"license":"GPL-2.0","operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool","Library"],"topic":[{"term":"DNA packaging","uri":"http://edamontology.org/topic_3176"},{"term":"Nucleic acid sites, features and motifs","uri":"http://edamontology.org/topic_3511"},{"term":"DNA binding sites","uri":"http://edamontology.org/topic_3125"}]},"publication":[{"abstract":"Background: The nucleosome is the fundamental packing unit of DNAs in eukaryotic cells. Its detailed positioning on the genome is closely related to chromosome functions. Increasing evidence has shown that genomic DNA sequence itself is highly predictive of nucleosome positioning genome-wide. Therefore a fast software tool for predicting nucleosome positioning can help understanding how a genome's nucleosome organization may facilitate genome function.Results: We present a duration Hidden Markov model for nucleosome positioning prediction by explicitly modeling the linker DNA length. The nucleosome and linker models trained from yeast data are re-scaled when making predictions for other species to adjust for differences in base composition. A software tool named NuPoP is developed in three formats for free download.Conclusions: Simulation studies show that modeling the linker length distribution and utilizing a base composition re-scaling method both improve the prediction of nucleosome positioning regarding sensitivity and false discovery rate. NuPoP provides a user-friendly software tool for predicting the nucleosome occupancy and the most probable nucleosome positioning map for genomic sequences of any size. When compared with two existing methods, NuPoP shows improved performance in sensitivity. © 2010 Xi et al; licensee BioMed Central Ltd.","authors":["Xi L.","Fondufe-Mittendorf Y.","Xia L.","Flatow J.","Widom J.","Wang J.-P."],"cit_count":70,"doi":"10.1186/1471-2105-11-346","journal":"BMC Bioinformatics","title":"Predicting nucleosome positioning using a duration Hidden Markov Model","type":"Primary","year":"2010-06-24"}],"summary":{"biotoolsCURIE":"biotools:nupop","biotoolsID":"nupop","description":"R package for Nucleosome Positioning Prediction. This package is built upon a duration hidden Markov model proposed in Xi et al, 2010; Wang et al, 2008. The core of the package was written in Fotran. In addition to the R package, a stand-alone Fortran software tool is also available.","homepage":"http://bioconductor.org/packages/release/bioc/html/NuPoP.html","name":"NuPoP","version":["1.24.0"]}}