{
    "additionDate": "2021-01-18T08:42:00Z",
    "biotoolsCURIE": "biotools:magic_encode",
    "biotoolsID": "magic_encode",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "asroopra@wisc.edu",
            "name": "Avtar Roopra",
            "orcidid": "https://orcid.org/0000-0001-8502-1406",
            "typeEntity": "Person"
        }
    ],
    "description": "A tool for predicting transcription factors and cofactors driving gene sets using ENCODE data.\n\nThe manuscript accompanying this script is: MAGIC: A tool for predicting transcription factors and cofactors driving gene sets using ENCODE data. Roopra, A. 2020 PLoS Computational Biology.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "DNA transcription",
                    "uri": "http://edamontology.org/operation_0372"
                },
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                }
            ]
        }
    ],
    "homepage": "https://go.wisc.edu/magic",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-19T08:54:29Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/asroopra/MAGIC"
        }
    ],
    "name": "MAGIC_Encode",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1007800",
            "metadata": {
                "abstract": "© 2020 Avtar Roopra. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Transcriptomic profiling is an immensely powerful hypothesis generating tool. However, accurately predicting the transcription factors (TFs) and cofactors that drive transcriptomic differences between samples is challenging. A number of algorithms draw on ChIP-seq tracks to define TFs and cofactors behind gene changes. These approaches assign TFs and cofactors to genes via a binary designation of ‘target’, or ‘non-target’ followed by Fisher Exact Tests to assess enrichment of TFs and cofactors. ENCODE archives 2314 ChIP-seq tracks of 684 TFs and cofactors assayed across a 117 human cell lines under a multitude of growth and maintenance conditions. The algorithm presented herein, Mining Algorithm for GenetIc Controllers (MAGIC), uses ENCODE ChIP-seq data to look for statistical enrichment of TFs and cofactors in gene bodies and flanking regions in gene lists without an a priori binary classification of genes as targets or non-targets. When compared to other TF mining resources, MAGIC displayed favourable performance in predicting TFs and cofactors that drive gene changes in 4 settings: 1) A cell line expressing or lacking single TF, 2) Breast tumors divided along PAM50 designations 3) Whole brain samples from WT mice or mice lacking a single TF in a particular neuronal subtype 4) Single cell RNAseq analysis of neurons divided by Immediate Early Gene expression levels. In summary, MAGIC is a standalone application that produces meaningful predictions of TFs and cofactors in transcriptomic experiments.",
                "authors": [
                    {
                        "name": "Roopra A."
                    }
                ],
                "citationCount": 7,
                "date": "2020-04-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "MAgIC: A tool for predicting transcription factors and cofactors driving gene sets using ENCODE data"
            },
            "pmcid": "PMC7162552",
            "pmid": "32251445"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "ChIP-on-chip",
            "uri": "http://edamontology.org/topic_3179"
        }
    ]
}