{
    "accessibility": "Open access",
    "additionDate": "2022-06-07T07:36:33.486354Z",
    "biotoolsCURIE": "biotools:ecodiet",
    "biotoolsID": "ecodiet",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "pierre.yves.hernvann@gmail.com",
            "name": "Pierre-Yves Hernvann",
            "orcidid": "https://orcid.org/0000-0002-0369-7857"
        }
    ],
    "description": "A hierarchical Bayesian model to combine stomach, biotracer, and literature data into diet matrix estimation.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/pyhernvann/EcoDiet",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-06-07T07:36:33.489021Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://zenodo.org/record/4081538"
        }
    ],
    "name": "EcoDiet",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1002/EAP.2521",
            "metadata": {
                "abstract": "© 2021 The Ecological Society of America.Although quantifying trophic interactions is a critical path to understanding and forecasting ecosystem functioning, fitting trophic models to field data remains challenging. It requires flexible statistical tools to combine different sources of information from the literature and fieldwork samples. We present EcoDiet, a hierarchical Bayesian modeling framework to simultaneously estimate food-web topology and diet composition of all consumers in the food web, by combining (1) a priori knowledge from the literature on both food-web topology and diet proportions; (2) stomach content analyses, with frequencies of prey occurrence used as the primary source of data to update the prior knowledge on the topological food-web structure; (3) and biotracers data through a mixing model (MM). Inferences are derived in a Bayesian probabilistic rationale that provides a formal way to incorporate prior information and quantifies uncertainty around both the topological structure of the food web and the dietary proportions. EcoDiet was implemented as an open-source R package, providing a user-friendly interface to execute the model, as well as examples and guidelines to familiarize with its use. We used simulated data to demonstrate the benefits of EcoDiet and how the framework can improve inferences on diet matrix by comparison with classical network MM. We applied EcoDiet to the Celtic Sea ecosystem, and showed how combining multiple data types within an integrated approach provides a more robust and holistic picture of the food-web topology and diet matrices than the literature or classical MM approach alone. EcoDiet has the potential to become a reference method for building diet matrices as a preliminary step of ecosystem modeling and to improve our understanding of prey–predator interactions.",
                "authors": [
                    {
                        "name": "Gascuel D."
                    },
                    {
                        "name": "Hernvann P.-Y."
                    },
                    {
                        "name": "Kopp D."
                    },
                    {
                        "name": "Rivot E."
                    },
                    {
                        "name": "Robert M."
                    }
                ],
                "date": "2022-03-01T00:00:00Z",
                "journal": "Ecological Applications",
                "title": "EcoDiet: A hierarchical Bayesian model to combine stomach, biotracer, and literature data into diet matrix estimation"
            },
            "pmid": "34918402"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
