{
    "additionDate": "2017-01-17T15:02:53Z",
    "biotoolsCURIE": "biotools:champ",
    "biotoolsID": "champ",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "champ450k@gmail.com",
            "name": "Yuan Tian",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The package includes quality control metrics, a selection of normalization methods and novel methods to identify differentially methylated regions and to highlight copy number alterations.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/ChAMP.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/ChAMP_2.4.1.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                },
                {
                    "term": "Methylation analysis",
                    "uri": "http://edamontology.org/operation_3204"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/ChAMP.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-10T15:53:37Z",
    "license": "GPL-3.0",
    "name": "ChAMP",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1016/j.ymeth.2014.10.036",
            "metadata": {
                "abstract": "© 2014 The Authors.The speed and resolution at which we can scour the genome for DNA methylation changes has improved immeasurably in the last 10. years and the advent of the Illumina 450K BeadChip has made epigenome-wide association studies (EWAS) a reality. The resulting datasets are conveniently formatted to allow easy alignment of significant hits to genes and genetic features, however; methods that parse significant hits into discreet differentially methylated regions (DMRs) remain a challenge to implement. In this paper we present details of a novel DMR caller, the Probe Lasso: a flexible window based approach that gathers neighbouring significant-signals to define clear DMR boundaries for subsequent in-depth analysis. The method is implemented in the R package ChAMP (Morris et al., 2014) and returns sets of DMRs according to user-tuned levels of probe filtering (e.g., inclusion of sex chromosomes, polymorphisms) and probe-lasso size distribution. Using a sub-sample of colon cancer- and healthy colon-samples from TCGA we show that Probe Lasso shifts DMR calling away from just probe-dense regions, and calls a range of DMR sizes ranging from tens-of-bases to tens-of-kilobases in scale. Moreover, using TCGA data we show that Probe Lasso leverages more information from the array and highlights a potential role of hypomethylated transcription factor binding motifs not discoverable using a basic, fixed-window approach.",
                "authors": [
                    {
                        "name": "Butcher L.M."
                    },
                    {
                        "name": "Beck S."
                    }
                ],
                "citationCount": 68,
                "date": "2015-01-01T00:00:00Z",
                "journal": "Methods",
                "title": "Probe Lasso: A novel method to rope in differentially methylated regions with 450K DNA methylation data"
            },
            "pmcid": "PMC4304833",
            "pmid": "25461817",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Methylated DNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3674"
        }
    ],
    "validated": 1,
    "version": [
        "2.4.1"
    ]
}