{
    "additionDate": "2015-01-22T11:40:46Z",
    "biotoolsCURIE": "biotools:topologygsa",
    "biotoolsID": "topologygsa",
    "credit": [
        {
            "email": "chiara.romualdi@unipd.it",
            "name": "Chiara Romualdi",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://romualdi.bio.unipd.it/"
        },
        {
            "name": "ELIXIR-ITA-PADOVA",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        }
    ],
    "description": "Novel approach to perform pathway analysis using gene expression data. Given the structure of a graph (a pathway) it introduces two statistical tests to compare the mean and the concentration matrices between two groups. Specifically, these tests can be performed on the graph and on its connected components (cliques).",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://cran.r-project.org/web/packages/topologyGSA/topologyGSA.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "note": "R package. It takes a gene expression matrix (divided into two classes of samples) and a graph-based representation of a biological pathway as inputs and it tests the pathway according to the difference in mean and covariance matrix between classes.",
            "operation": [
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                }
            ]
        }
    ],
    "homepage": "http://cran.r-project.org/web/packages/topologyGSA/index.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-29T15:00:26Z",
    "license": "AGPL-3.0",
    "name": "TopologyGSA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-ITA-PADOVA",
    "publication": [
        {
            "doi": "10.1186/1752-0509-4-121",
            "metadata": {
                "abstract": "© 2010 Massa et al.Background: Recently, a great effort in microarray data analysis is directed towards the study of the so-called gene sets. A gene set is defined by genes that are, somehow, functionally related. For example, genes appearing in a known biological pathway naturally define a gene set. The gene sets are usually identified from a priori biological knowledge. Nowadays, many bioinformatics resources store such kind of knowledge (see, for example, the Kyoto Encyclopedia of Genes and Genomes, among others). Although pathways maps carry important information about the structure of correlation among genes that should not be neglected, the currently available multivariate methods for gene set analysis do not fully exploit it. Results: We propose a novel gene set analysis specifically designed for gene sets defined by pathways. Such analysis, based on graphical models, explicitly incorporates the dependence structure among genes highlighted by the topology of pathways. The analysis is designed to be used for overall surveillance of changes in a pathway in different experimental conditions. In fact, under different circumstances, not only the expression of the genes in a pathway, but also the strength of their relations may change. The methods resulting from the proposal allow both to test for variations in the strength of the links, and to properly account for heteroschedasticity in the usual tests for differential expression. Conclusions: The use of graphical models allows a deeper look at the components of the pathway that can be tested separately and compared marginally. In this way it is possible to test single components of the pathway and highlight only those involved in its deregulation.",
                "authors": [
                    {
                        "name": "Chiogna M."
                    },
                    {
                        "name": "Massa M.S."
                    },
                    {
                        "name": "Romualdi C."
                    }
                ],
                "citationCount": 46,
                "date": "2010-09-01T00:00:00Z",
                "journal": "BMC Systems Biology",
                "title": "Gene set analysis exploiting the topology of a pathway"
            },
            "pmcid": "PMC2945950",
            "pmid": "20809931",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Functional genomics",
            "uri": "http://edamontology.org/topic_0085"
        }
    ],
    "validated": 1,
    "version": [
        "1.4.4"
    ]
}
