{
    "name": "BioExtract", 
    "description": "The BioExtract Server is a platform for the creation of bioinformatic workflows to aid the analysis of genomic data. A series of recorded tasks can be saved and shared. Integrated resources include NCBI databases, EMBL-Bank, UniProt and UniRef, as well as a large number of computational tools such as EMBOSS and KEGG.", 
    "homepage": "http://www.bioextract.org", 
    "biotoolsID": "bioextract", 
    "biotoolsCURIE": "biotools:bioextract", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2409", 
                    "term": "Data handling"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0224", 
                    "term": "Query and retrieval"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0306", 
                    "term": "Text mining"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3489", 
            "term": "Database management"
        }, 
        {
            "uri": "http://edamontology.org/topic_0091", 
            "term": "Bioinformatics"
        }, 
        {
            "uri": "http://edamontology.org/topic_0769", 
            "term": "Workflows"
        }, 
        {
            "uri": "http://edamontology.org/topic_3307", 
            "term": "Computational biology"
        }, 
        {
            "uri": "http://edamontology.org/topic_0081", 
            "term": "Structure analysis"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "Java"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "https://www.bioextract.org/help/index.jsp", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "21546552", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "The BioExtract Server: A web-based bioinformatic workflow platform", 
                "abstract": "The BioExtract Server (bioextract.org) is an open, web-based system designed to aid researchers in the analysis of genomic data by providing a platform for the creation of bioinformatic workflows. Scientific workflows are created within the system by recording tasks performed by the user. These tasks may include querying multiple, distributed data sources, saving query results as searchable data extracts, and executing local and web-accessible analytic tools. The series of recorded tasks can then be saved as a reproducible, sharable workflow available for subsequent execution with the original or modified inputs and parameter settings. Integrated data resources include interfaces to the National Center for Biotechnology Information (NCBI) nucleotide and protein databases, the European Molecular Biology Laboratory (EMBL-Bank) non-redundant nucleotide database, the Universal Protein Resource (UniProt), and the UniProt Reference Clusters (UniRef) database. The system offers access to numerous preinstalled, curated analytic tools and also provides researchers with the option of selecting computational tools from a large list of web services including the European Molecular Biology Open Software Suite (EMBOSS), BioMoby, and the Kyoto Encyclopedia of Genes and Genomes (KEGG). The system further allows users to integrate local command line tools residing on their own computers through a client-side Java applet. © 2011 The Author(s).", 
                "date": "2011-07-01T00:00:00Z", 
                "citationCount": 11, 
                "authors": [
                    {
                        "name": "Lushbough C.M."
                    }, 
                    {
                        "name": "Jennewein D.M."
                    }, 
                    {
                        "name": "Brendel V.P."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }, 
        {
            "doi": null, 
            "pmid": "20150665", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "BioExtract server-An integrated workflow-enabling system to access and analyze heterogeneous, distributed biomolecular data", 
                "abstract": "Many in silico investigations in bioinformatics require access to multiple, distributed data sources and analytic tools. The requisite data sources may include large public data repositories, community databases, and project databases for use in domain-specific research. Different data sources frequently utilize distinct query languages and return results in unique formats, and therefore researchers must either rely upon a small number of primary data sources or become familiar with multiple query languages and formats. Similarly, the associated analytic tools often require specific input formats and produce unique outputs which make it difficult to utilize the output from one tool as input to another. The BioExtract Server (http://bioextract.org) is a Web-based data integration application designed to consolidate, analyze, and serve data from heterogeneous biomolecular databases in the form of a mash-up. The basic operations of the BioExtract Server allow researchers, via their Web browsers, to specify data sources, flexibly query data sources, apply analytic tools, download result sets, and store query results for later reuse. As a researcher works with the system, their steps are saved in the background. At any time, these steps can be preserved long-term as a workflow simply by providing a workflow name and description. © 2006 IEEE.", 
                "date": "2010-01-01T00:00:00Z", 
                "citationCount": 14, 
                "authors": [
                    {
                        "name": "Lushbough C."
                    }, 
                    {
                        "name": "Bergman M.K."
                    }, 
                    {
                        "name": "Lawrence C.J."
                    }, 
                    {
                        "name": "Jennewein D."
                    }, 
                    {
                        "name": "Brendel V."
                    }
                ], 
                "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": "Contact Form", 
            "email": null, 
            "url": "https://www.bioextract.org/feedback", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "ELIXIR-EE", 
    "additionDate": "2017-03-25T18:17:53Z", 
    "lastUpdate": "2018-12-10T12:58:54Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}