{
    "accessibility": "Open access",
    "additionDate": "2024-06-13T14:41:01.342264Z",
    "biotoolsCURIE": "biotools:plantrna",
    "biotoolsID": "plantrna",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "valerie.cognat@cnrs.fr",
            "name": "Valerie Cognat",
            "orcidid": "https://orcid.org/0000-0001-9337-2767",
            "typeEntity": "Person",
            "typeRole": [
                "Contributor"
            ]
        }
    ],
    "description": "The PlantRNA database compiles tRNA gene sequences retrieved from fully annotated nuclear, plastidial and mitochondrial genomes of photosynthetic organisms.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://plantrna.ibmp.cnrs.fr/",
    "lastUpdate": "2024-11-24T13:55:20.404756Z",
    "license": "CC-BY-SA-4.0",
    "maturity": "Mature",
    "name": "plantRNA",
    "owner": "vcognat",
    "publication": [
        {
            "doi": "10.1093/nar/gks935",
            "metadata": {
                "abstract": "PlantRNA database (http://plantrna.ibmp.cnrs.fr/) compiles transfer RNA (tRNA) gene sequences retrieved from fully annotated plant nuclear, plastidial and mitochondrial genomes. The set of annotated tRNA gene sequences has been manually curated for maximum quality and confidence. The novelty of this database resides in the inclusion of biological information relevant to the function of all the tRNAs entered in the library. This includes 5′- and 3′-flanking sequences, A and B box sequences, region of transcription initiation and poly(T) transcription termination stretches, tRNA intron sequences, aminoacyl-tRNA synthetases and enzymes responsible for tRNA maturation and modification. Finally, data on mitochondrial import of nuclear-encoded tRNAs as well as the bibliome for the respective tRNAs and tRNA-binding proteins are also included. The current annotation concerns complete genomes from 11 organisms: five flowering plants (Arabidopsis thaliana, Oryza sativa, Populus trichocarpa, Medicago truncatula and Brachypodium distachyon), a moss (Physcomitrella patens), two green algae (Chlamydomonas rein-hardtii and Ostreococcus tauri), one glaucophyte (Cyanophora paradoxa), one brown alga (Ectocarpus siliculosus) and a pennate diatom (Phaeodactylum tricornutum). The database will be regularly updated and implemented with new plant genome annotations so as to provide extensive information on tRNA biology to the research community. © The Author(s) 2012.",
                "authors": [
                    {
                        "name": "Cognat V."
                    },
                    {
                        "name": "Daujat M."
                    },
                    {
                        "name": "Duchene A.-M."
                    },
                    {
                        "name": "Giege P."
                    },
                    {
                        "name": "Gigant A."
                    },
                    {
                        "name": "Gobert A."
                    },
                    {
                        "name": "Gutmann B."
                    },
                    {
                        "name": "Marechal-Drouard L."
                    },
                    {
                        "name": "Michaud M."
                    },
                    {
                        "name": "Pawlak G."
                    },
                    {
                        "name": "Salinas T."
                    }
                ],
                "citationCount": 55,
                "date": "2013-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PlantRNA, a database for tRNAs of photosynthetic eukaryotes"
            },
            "pmcid": "PMC3531208",
            "pmid": "23066098",
            "type": [
                "Primary"
            ],
            "version": "1.0"
        },
        {
            "doi": "10.1111/tpj.15997",
            "metadata": {
                "abstract": "PlantRNA (http://plantrna.ibmp.cnrs.fr/) is a comprehensive database of transfer RNA (tRNA) gene sequences retrieved from fully annotated nuclear, plastidial and mitochondrial genomes of photosynthetic organisms. In the first release (PlantRNA 1.0), tRNA genes from 11 organisms were annotated. In this second version, the annotation was implemented to 51 photosynthetic species covering the whole phylogenetic tree of photosynthetic organisms, from the most basal group of Archeplastida, the glaucophyte Cyanophora paradoxa, to various land plants. tRNA genes from lower photosynthetic organisms such as streptophyte algae or lycophytes as well as extremophile photosynthetic species such as Eutrema parvulum were incorporated in the database. As a whole, about 37 000 tRNA genes were accurately annotated. In the frame of the tRNA genes annotation from the genome of the Rhodophyte Chondrus crispus, non-canonical splicing sites in the D- or T-regions of tRNA molecules were identified and experimentally validated. As for PlantRNA 1.0, comprehensive biological information including 5′- and 3′-flanking sequences, A and B box sequences, region of transcription initiation and poly(T) transcription termination stretches, tRNA intron sequences and tRNA mitochondrial import are included.",
                "authors": [
                    {
                        "name": "Cognat V."
                    },
                    {
                        "name": "Drouard L."
                    },
                    {
                        "name": "Pawlak G."
                    },
                    {
                        "name": "Pflieger D."
                    }
                ],
                "citationCount": 9,
                "date": "2022-11-01T00:00:00Z",
                "journal": "Plant Journal",
                "title": "PlantRNA 2.0: an updated database dedicated to tRNAs of photosynthetic eukaryotes"
            },
            "pmid": "36196656",
            "type": [
                "Primary"
            ],
            "version": "1.0"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ],
    "version": [
        "2.0"
    ]
}
