{
    "accessibility": "Open access",
    "additionDate": "2022-02-16T07:41:59.087348Z",
    "biotoolsCURIE": "biotools:di2",
    "biotoolsID": "di2",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "leonardoalexandre@tecnico.ulisboa.pt",
            "name": "Leonardo Alexandre",
            "orcidid": "https://orcid.org/0000-0002-7061-4097",
            "typeEntity": "Person"
        }
    ],
    "description": "DI2 (Distribution Discretizer) a prior-free and multi-item discretization of biological data and its applications.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/JupitersMight/DI2",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-02-16T07:41:59.089812Z",
    "license": "MIT",
    "name": "DI2",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04329-8",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: A considerable number of data mining approaches for biomedical data analysis, including state-of-the-art associative models, require a form of data discretization. Although diverse discretization approaches have been proposed, they generally work under a strict set of statistical assumptions which are arguably insufficient to handle the diversity and heterogeneity of clinical and molecular variables within a given dataset. In addition, although an increasing number of symbolic approaches in bioinformatics are able to assign multiple items to values occurring near discretization boundaries for superior robustness, there are no reference principles on how to perform multi-item discretizations. Results: In this study, an unsupervised discretization method, DI2, for variables with arbitrarily skewed distributions is proposed. Statistical tests applied to assess differences in performance confirm that DI2 generally outperforms well-established discretizations methods with statistical significance. Within classification tasks, DI2 displays either competitive or superior levels of predictive accuracy, particularly delineate for classifiers able to accommodate border values. Conclusions: This work proposes a new unsupervised method for data discretization, DI2, that takes into account the underlying data regularities, the presence of outlier values disrupting expected regularities, as well as the relevance of border values. DI2 is available at https://github.com/JupitersMight/DI2",
                "authors": [
                    {
                        "name": "Alexandre L."
                    },
                    {
                        "name": "Costa R.S."
                    },
                    {
                        "name": "Henriques R."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "DI2: prior-free and multi-item discretization of biological data and its applications"
            },
            "pmcid": "PMC8425008",
            "pmid": "34496758"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        }
    ]
}
