
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.ece.drexel.edu/gailr/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/EESI/Fizzy/blob/master/README.md"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid feature detection",
                    "uri": "http://edamontology.org/operation_0415"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Nucleic acid sites, features and motifs",
                "uri": "http://edamontology.org/topic_3511"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/fizzy-feature-selection-for-biological-data-formats.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2015 Ditzler et al.Background: Some of the current software tools for comparative metagenomics provide ecologists with the ability to investigate and explore bacterial communities using aα- & β-diversity. Feature subset selection - a sub-field of machine learning - can also provide a unique insight into the differences between metagenomic or 16S phenotypes. In particular, feature subset selection methods can obtain the operational taxonomic units (OTUs), or functional features, that have a high-level of influence on the condition being studied. For example, in a previous study we have used information-theoretic feature selection to understand the differences between protein family abundances that best discriminate between age groups in the human gut microbiome. Results: We have developed a new Python command line tool, which is compatible with the widely adopted BIOM format, for microbial ecologists that implements information-theoretic subset selection methods for biological data formats. We demonstrate the software tools capabilities on publicly available datasets. Conclusions: We have made the software implementation of Fizzy available to the public under the GNU GPL license. The standalone implementation can be found at http://github.com/EESI/Fizzy.",
            "authors": [
                "Ditzler G.",
                "Morrison J.C.",
                "Lan Y.",
                "Rosen G.L."
            ],
            "cit_count": 10,
            "journal": "BMC Bioinformatics",
            "pmid": "26538306",
            "title": "Fizzy: Feature subset selection for metagenomics",
            "year": "2015-11-04"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:fizzy",
        "biotoolsID": "fizzy",
        "description": "Feature subset selection tool that uses FEAST in the background to run feature selection on biological data formats.",
        "homepage": "https://github.com/EESI/Fizzy",
        "name": "Fizzy"
    }
}