{
    "additionDate": "2020-01-14T09:06:31Z",
    "biotoolsCURIE": "biotools:DrLLPS",
    "biotoolsID": "DrLLPS",
    "confidence_flag": "tool",
    "description": "A data resource of liquid-liquid phase separation in eukaryotes.\n\nHere, we presented a data resource of LLPS (DrLLPS), a comprehensive data resource that contained 437,887 known and computationally detected LLPS-associated proteins in 164 eukaryotic species.\n\nPhase separation, or liquid-liquid phase separation (LLPS), is a ubiquitous and important mechanism for the formation of membraneless condensates in cells",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://llps.biocuckoo.cn/guide.php"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "homepage": "http://llps.biocuckoo.cn/",
    "lastUpdate": "2020-12-22T12:13:49Z",
    "name": "DrLLPS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/NAR/GKZ1027",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press on behalf of Nucleic Acids Research.Here, we presented an integrative database named DrLLPS (http://llps.biocuckoo.cn/) for proteins involved in liquid-liquid phase separation (LLPS), which is a ubiquitous and crucial mechanism for spatiotemporal organization of various biochemical reactions, by creating membraneless organelles (MLOs) in eukaryotic cells. From the literature, we manually collected 150 scaffold proteins that are drivers of LLPS, 987 regulators that contribute in modulating LLPS, and 8148 potential client proteins that might be dispensable for the formation of MLOs, which were then categorized into 40 biomolecular condensates. We searched potential orthologs of these known proteins, and in total DrLLPS contained 437 887 known and potential LLPS-associated proteins in 164 eukaryotes. Furthermore, we carefully annotated LLPS-associated proteins in eight model organisms, by using the knowledge integrated from 110 widely used resources that covered 16 aspects, including protein disordered regions, domain annotations, post-translational modifications (PTMs), genetic variations, cancer mutations, molecular interactions, disease-associated information, drug-target relations, physicochemical property, protein functional annotations, protein expressions/proteomics, protein 3D structures, subcellular localizations, mRNA expressions, DNA & RNA elements, and DNA methylations. We anticipate DrLLPS can serve as a helpful resource for further analysis of LLPS.",
                "authors": [
                    {
                        "name": "Ning W."
                    },
                    {
                        "name": "Guo Y."
                    },
                    {
                        "name": "Lin S."
                    },
                    {
                        "name": "Mei B."
                    },
                    {
                        "name": "Wu Y."
                    },
                    {
                        "name": "Jiang P."
                    },
                    {
                        "name": "Tan X."
                    },
                    {
                        "name": "Zhang W."
                    },
                    {
                        "name": "Chen G."
                    },
                    {
                        "name": "Peng D."
                    },
                    {
                        "name": "Chu L."
                    },
                    {
                        "name": "Xue Y."
                    }
                ],
                "citationCount": 12,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "DrLLPS: A data resource of liquid-liquid phase separation in eukaryotes"
            },
            "pmid": "31691822"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        }
    ],
    "validated": 1
}