{
    "name": "EVA", 
    "description": "Software package aimed at describing inbreeding in a population and predicting genetic contributions of breeding candidates while maximizing response to selection given a penalty on/constraining the rate of inbreeding.", 
    "homepage": "https://www.nordgen.org/en/farm-animals/resources/ocs/", 
    "biotoolsID": "eva_inbred", 
    "biotoolsCURIE": "biotools:eva_inbred", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2423", 
                    "term": "Prediction and recognition"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3056", 
            "term": "Population genetics"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [], 
    "license": "Other", 
    "collectionID": [
        "Animal and Crop Genomics"
    ], 
    "maturity": null, 
    "cost": "Free of charge", 
    "accessibility": [
        "Open access"
    ], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [
        {
            "url": "https://www.nordgen.org/en/farm-animals/resources/ocs/", 
            "type": "Binaries", 
            "note": null, 
            "version": null
        }
    ], 
    "documentation": [
        {
            "url": "https://sites.google.com/a/nordgen.org/workshop-optimal-contribution-selection/download/lectures", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1016/j.livsci.2008.01.027", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Usage", 
            "version": null, 
            "metadata": {
                "title": "Optimal genetic contribution selection in Danish Holstein depends on pedigree quality", 
                "abstract": "The aim of this study was to assess the importance of pedigree depth when performing optimal contribution selection as implemented in the software program EVA. This was done by applying optimal genetic contribution in the breeding program of the major Danish Dairy breed Danish Holstein. In the analyses earlier breeding decisions were considered by including all AI waiting- and young bulls and contract matings. Twenty potential sires, 2169 potential dams, 1421 AI-bulls and 754 contract matings plus pedigree animals were included. Results showed that the outcome was very dependent on quality of pedigree, also for information going more than 25 years (5-7 generations) back. The analyses showed that EVA works satisfactorily as a management tool for planning of breeding schemes with respect to contributions of sires of sons at population level in maximising the genetic gain, while controlling the increase in future inbreeding. The more weight put on the average additive genetic relationship in next generation relative to genetic merit, the lower the average merit of the matings, and the lower average additive genetic relationship among the chosen matings and the present breeding animals. Furthermore more weight on average additive genetic relationship gives a more diverse use of sires of sons. Given the potential sires and dams the average additive genetic relationship among the selected matings and the present breeding animals can be reduced from 0.1621 to 0.1495 at the cost of 0.7 genetic S.D. units at the total merit index. This reduction was obtained when selection was only on reduction of average relationship compared to selection only on genetic merit. Optimal genetic contribution selection is a promising tool for managing breeding schemes for populations facing inbreeding problems, such as Danish Holstein and other dairy breeds. However sufficient pedigree information is a necessity. © 2008 Elsevier B.V. All rights reserved.", 
                "date": "2008-11-01T00:00:00Z", 
                "citationCount": 15, 
                "authors": [
                    {
                        "name": "Sorensen M.K."
                    }, 
                    {
                        "name": "Sorensen A.C."
                    }, 
                    {
                        "name": "Baumung R."
                    }, 
                    {
                        "name": "Borchersen S."
                    }, 
                    {
                        "name": "Berg P."
                    }
                ], 
                "journal": "Livestock Science"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": "anne.praebel@nordgen.org", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": null, 
            "typeRole": [], 
            "note": null
        }
    ], 
    "owner": "vzn529@binf.ku.dk", 
    "additionDate": "2019-01-23T08:25:17Z", 
    "lastUpdate": "2019-01-29T12:09:07Z", 
    "editPermission": {
        "type": "group", 
        "authors": [
            "animalandcropgenomics"
        ]
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}