{
    "additionDate": "2021-01-18T07:03:39Z",
    "biotoolsCURIE": "biotools:transcompp",
    "biotoolsID": "transcompp",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Lisa.Tucker-kellogg@duke-nus.edu.sg",
            "name": "Marie-Véronique Clément",
            "typeEntity": "Person"
        },
        {
            "email": "bchmvc@nus.edu.sg",
            "name": "Lisa Tucker-Kellogg",
            "typeEntity": "Person"
        }
    ],
    "description": "TRANSCOMPP is a tool that allows users to quantify phenotypic plasticity starting from single-cell or bulk measurements of phenotype. TRANSCOMPP uses Markov modeling and optimization to estimate best-fit values for stochastic transition rates, transition rate intervals, and phenotype-specific proliferation parameters.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://github.com/nsuhasj/Transcompp",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-03-03T10:08:43Z",
    "license": "GPL-3.0",
    "name": "Transcompp",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA021",
            "metadata": {
                "abstract": "© 2020 The Author(s). Published by Oxford University Press. All rights reserved.Motivation: Gradual population-level changes in tissues can be driven by stochastic plasticity, meaning rare stochastic transitions of single-cell phenotype. Quantifying the rates of these stochastic transitions requires time-intensive experiments, and analysis is generally confounded by simultaneous bidirectional transitions and asymmetric proliferation kinetics. To quantify cellular plasticity, we developed Transcompp (Transition Rate ANalysis of Single Cells to Observe and Measure Phenotypic Plasticity), a Markov modeling algorithm that uses optimization and resampling to compute best-fit rates and statistical intervals for stochastic cell-state transitions. Results: We applied Transcompp to time-series datasets in which purified subpopulations of stem-like or non-stem cancer cells were exposed to various cell culture environments, and allowed to re-equilibrate spontaneously over time. Results revealed that commonly used cell culture reagents hydrocortisone and cholera toxin shifted the cell population equilibrium toward stem-like or non-stem states, respectively, in the basal-like breast cancer cell line MCF10CA1a. In addition, applying Transcompp to patient-derived cells showed that transition rates computed from short-term experiments could predict long-term trajectories and equilibrium convergence of the cultured cell population.",
                "authors": [
                    {
                        "name": "Suhas Jagannathan N."
                    },
                    {
                        "name": "Ihsan M.O."
                    },
                    {
                        "name": "Ihsan M.O."
                    },
                    {
                        "name": "Kin X.X."
                    },
                    {
                        "name": "Welsch R.E."
                    },
                    {
                        "name": "Clement M.-V."
                    },
                    {
                        "name": "Clement M.-V."
                    },
                    {
                        "name": "Tucker-Kellogg L."
                    }
                ],
                "date": "2020-05-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Transcompp: Understanding phenotypic plasticity by estimating Markov transition rates for cell state transitions"
            },
            "pmid": "31971581"
        }
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Cytometry",
            "uri": "http://edamontology.org/topic_3934"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}