{
    "additionDate": "2021-01-18T07:06:48Z",
    "biotoolsCURIE": "biotools:forestatistics",
    "biotoolsID": "forestatistics",
    "confidence_flag": "tool",
    "description": "ForeStatistics is a Windows-based feature-rich software program for performing statistics in forensic DNA analysis, paternity and relationship testing.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA profiling",
                    "uri": "http://edamontology.org/operation_3894"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "http://zeetu.org/forestatistics.html",
    "lastUpdate": "2021-03-11T10:45:48Z",
    "name": "ForeStatistics",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.FORSCIINT.2020.110142",
            "metadata": {
                "abstract": "© 2020 Elsevier B.V.Forensic science is one of the most modern and applied fields of science, today and comprises of various domains. These include Fingerprints analysis, Questioned document analysis, Forensic DNA and serology, Anthropometry, Cyber and Digital forensics, and many other fields. All these fields aid the process of decision making in the courts of law and legal settings; however, DNA profiling and its analyses are one of the most important aspects of forensic science today. In Forensic DNA analysis, the statistical calculations are very important to estimate the conclusiveness of DNA evidence in forensic cases; and to establish paternity and relatedness in civil and criminal matters. These statistics, when performed manually, leave a chance of error or ambiguity in the calculation, and are hectic and time-taking. Therefore, the computer-aided approaches are opted in forensics to perform DNA statistics calculations. Keeping its importance in mind, a highly accurate windows-based software program namely ForeStatistics is proposed in this study. ForeStatistics is rich in features such as DNA statistical calculations, DNA profile management and its matching. The software can estimate random match probabilities for single-source profiles, combined probability of inclusion for mixed profiles, paternity index of a disputed child in duo and trio cases, paternity of the disputed child when the alleged father is related to mother or biological father and relatedness in cases of grandparents/grandchild, avuncular relation and cousin. It is validated through different protocols and the validation of ForeStatistics depicts that it is highly accurate in terms of performing DNA statistics or DNA profile matching. Thus, it is concluded, that ForeStatistics has a great utility in the field of Forensic DNA analysis and can help DNA scientists, in performing various DNA related statistics, accurately and very efficiently. ForeStatistics can be downloaded freely from (http://zeetu.org/forestatistics.html).",
                "authors": [
                    {
                        "name": "Rasool N."
                    },
                    {
                        "name": "Hussain W."
                    }
                ],
                "citationCount": 2,
                "date": "2020-02-01T00:00:00Z",
                "journal": "Forensic Science International",
                "title": "ForeStatistics: A windows-based feature-rich software program for performing statistics in forensic DNA analysis, paternity and relationship testing"
            },
            "pmid": "31927396"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}