{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2022-07-14T05:01:31.329173Z",
    "biotoolsCURIE": "biotools:adpfunchisq",
    "biotoolsID": "adpfunchisq",
    "confidence_flag": "tool",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "joemsong@cs.nmsu.edu",
            "name": "Mingzhou Song",
            "typeEntity": "Person"
        }
    ],
    "description": "Adapted Functional Chi-squared test (AdpFunChisq) is a model-free functional dependency measure that uses function direction and strength as evidence for causal inference.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://cran.r-project.org/package=FunChisq",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-07-14T05:01:31.331749Z",
    "license": "LGPL-3.0",
    "name": "AdpFunChisq",
    "operatingSystem": [
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAC206",
            "metadata": {
                "abstract": "© 2022 The Author(s). Published by Oxford University Press. All rights reserved.Motivation: Computer inference of biological mechanisms is increasingly approachable due to dynamically rich data sources such as single-cell genomics. Inferred molecular interactions can prioritize hypotheses for wet-lab experiments to expedite biological discovery. However, complex data often come with unwanted biological or technical variations, exposing biases over marginal distribution and sample size in current methods to favor spurious causal relationships. Results: Considering function direction and strength as evidence for causality, we present an adapted functional chi-squared test (AdpFunChisq) that rewards functional patterns over non-functional or independent patterns. On synthetic and three biology datasets, we demonstrate the advantages of AdpFunChisq over 10 methods on overcoming biases that give rise to wide fluctuations in the performance of alternative approaches. On single-cell multiomics data of multiple phenotype acute leukemia, we found that the T-cell surface glycoprotein CD3 delta chain may causally mediate specific genes in the viral carcinogenesis pathway. Using the causality-by-functionality principle, AdpFunChisq offers a viable option for robust causal inference in dynamical systems.",
                "authors": [
                    {
                        "name": "Kumar S."
                    },
                    {
                        "name": "Song M."
                    }
                ],
                "date": "2022-05-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Overcoming biases in causal inference of molecular interactions"
            },
            "pmid": "35385081"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Synthetic biology",
            "uri": "http://edamontology.org/topic_3895"
        }
    ],
    "validated": 1
}
