{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2022-08-01T11:58:50.146020Z",
    "biotoolsCURIE": "biotools:edn",
    "biotoolsID": "edn",
    "confidence_flag": "tool",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "name": "Bo Ren"
        },
        {
            "name": "Yu-Huan Wu",
            "orcidid": "https://orcid.org/0000-0001-8666-3435"
        }
    ],
    "description": "Extremely-Downsampled Network (EDN), which employs an extreme downsampling technique to effectively learn a global view of the whole image, leading to accurate salient object localization.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/yuhuan-wu/EDN",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2022-08-01T11:58:50.148607Z",
    "license": "CC-BY-NC-SA-4.0",
    "name": "EDN",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1109/TIP.2022.3164550",
            "metadata": {
                "abstract": "© 1992-2012 IEEE.Recent progress on salient object detection (SOD) mainly benefits from multi-scale learning, where the high-level and low-level features collaborate in locating salient objects and discovering fine details, respectively. However, most efforts are devoted to low-level feature learning by fusing multi-scale features or enhancing boundary representations. High-level features, which although have long proven effective for many other tasks, yet have been barely studied for SOD. In this paper, we tap into this gap and show that enhancing high-level features is essential for SOD as well. To this end, we introduce an Extremely-Downsampled Network (EDN), which employs an extreme downsampling technique to effectively learn a global view of the whole image, leading to accurate salient object localization. To accomplish better multi-level feature fusion, we construct the Scale-Correlated Pyramid Convolution (SCPC) to build an elegant decoder for recovering object details from the above extreme downsampling. Extensive experiments demonstrate that EDN achieves state-of-the-art performance with real-time speed. Our efficient EDN-Lite also achieves competitive performance with a speed of 316fps. Hence, this work is expected to spark some new thinking in SOD. Code is available at https://github.com/yuhuan-wu/EDN.",
                "authors": [
                    {
                        "name": "Cheng M.-M."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Ren B."
                    },
                    {
                        "name": "Wu Y.-H."
                    },
                    {
                        "name": "Zhang L."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Image Processing",
                "title": "EDN: Salient Object Detection via Extremely-Downsampled Network"
            },
            "pmid": "35412981"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ]
}
