{
    "accessibility": "Open access",
    "additionDate": "2020-05-27T10:52:00Z",
    "biotoolsCURIE": "biotools:ehrtemporalvariability",
    "biotoolsID": "ehrtemporalvariability",
    "credit": [
        {
            "email": "carsaesi@upv.es",
            "name": "Carlos Sáez",
            "note": "Researcher at the Biomedical Data Science Lab, ITACA Institute, Universitat Politècnica de València, Spain",
            "orcidid": "https://orcid.org/0000-0003-2678-8249",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Functions to delineate temporal dataset shifts in Electronic Health Records through the projection and visualization of dissimilarities among data temporal batches. This is done through the estimation of data statistical distributions over time and their projection in non-parametric statistical manifolds, uncovering the patterns of the data latent temporal variability. EHRtemporalVariability is particularly suitable for multi-modal data and categorical variables with a high number of values, common features of biomedical data where traditional statistical process control or time-series methods may not be appropriate. EHRtemporalVariability allows you to explore and identify dataset shifts through visual analytics formats such as Data Temporal heatmaps and Information Geometric Temporal (IGT) plots. An additional EHRtemporalVariability Shiny app can be used to load and explore the package results and even to allow the use of these functions to those users non-experienced in R coding.",
    "documentation": [
        {
            "type": [
                "API documentation"
            ],
            "url": "https://cran.r-project.org/web/packages/EHRtemporalVariability/EHRtemporalVariability.pdf"
        },
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/hms-dbmi/EHRtemporalVariability"
        },
        {
            "type": [
                "Quick start guide"
            ],
            "url": "https://cran.r-project.org/web/packages/EHRtemporalVariability/vignettes/EHRtemporalVariability.html"
        }
    ],
    "download": [
        {
            "type": "Downloads page",
            "url": "https://CRAN.R-project.org/package=EHRtemporalVariability"
        },
        {
            "type": "Downloads page",
            "url": "https://github.com/hms-dbmi/EHRtemporalVariability"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Matrix",
                        "uri": "http://edamontology.org/data_2082"
                    }
                },
                {
                    "data": {
                        "term": "Distance matrix",
                        "uri": "http://edamontology.org/data_2855"
                    },
                    "format": [
                        {
                            "term": "Binary format",
                            "uri": "http://edamontology.org/format_2333"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Electronic health record",
                        "uri": "http://edamontology.org/data_3861"
                    },
                    "format": [
                        {
                            "term": "CSV",
                            "uri": "http://edamontology.org/format_3752"
                        },
                        {
                            "term": "DSV",
                            "uri": "http://edamontology.org/format_3751"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Database comparison",
                    "uri": "http://edamontology.org/operation_3561"
                },
                {
                    "term": "Heat map generation",
                    "uri": "http://edamontology.org/operation_0531"
                },
                {
                    "term": "Multiple sample visualisation",
                    "uri": "http://edamontology.org/operation_3744"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                },
                {
                    "term": "Sample comparison",
                    "uri": "http://edamontology.org/operation_3731"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Heat map",
                        "uri": "http://edamontology.org/data_1636"
                    }
                },
                {
                    "data": {
                        "term": "Quality control report",
                        "uri": "http://edamontology.org/data_3914"
                    }
                },
                {
                    "data": {
                        "term": "Trajectory data",
                        "uri": "http://edamontology.org/data_3870"
                    },
                    "format": [
                        {
                            "term": "Binary format",
                            "uri": "http://edamontology.org/format_2333"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://github.com/hms-dbmi/EHRtemporalVariability",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-06-16T10:55:28Z",
    "license": "Apache-2.0",
    "link": [
        {
            "note": "CRAN package repository",
            "type": [
                "Repository"
            ],
            "url": "https://CRAN.R-project.org/package=EHRtemporalVariability"
        },
        {
            "note": "On-line demo",
            "type": [
                "Service"
            ],
            "url": "http://ehrtemporalvariability.upv.es/"
        }
    ],
    "maturity": "Mature",
    "name": "EHRtemporalVariability",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "carsaesi",
    "publication": [
        {
            "doi": "10.1007/s10618-014-0378-6",
            "metadata": {
                "abstract": "© 2014, The Author(s).Knowledge discovery on biomedical data can be based on on-line, data-stream analyses, or using retrospective, timestamped, off-line datasets. In both cases, changes in the processes that generate data or in their quality features through time may hinder either the knowledge discovery process or the generalization of past knowledge. These problems can be seen as a lack of data temporal stability. This work establishes the temporal stability as a data quality dimension and proposes new methods for its assessment based on a probabilistic framework. Concretely, methods are proposed for (1) monitoring changes, and (2) characterizing changes, trends and detecting temporal subgroups. First, a probabilistic change detection algorithm is proposed based on the Statistical Process Control of the posterior Beta distribution of the Jensen–Shannon distance, with a memoryless forgetting mechanism. This algorithm (PDF-SPC) classifies the degree of current change in three states: In-Control, Warning, and Out-of-Control. Second, a novel method is proposed to visualize and characterize the temporal changes of data based on the projection of a non-parametric information-geometric statistical manifold of time windows. This projection facilitates the exploration of temporal trends using the proposed IGT-plot and, by means of unsupervised learning methods, discovering conceptually-related temporal subgroups. Methods are evaluated using real and simulated data based on the National Hospital Discharge Survey (NHDS) dataset.",
                "authors": [
                    {
                        "name": "Gama J."
                    },
                    {
                        "name": "Garcia-Gomez J.M."
                    },
                    {
                        "name": "Robles M."
                    },
                    {
                        "name": "Rodrigues P.P."
                    },
                    {
                        "name": "Saez C."
                    }
                ],
                "citationCount": 15,
                "date": "2015-07-08T00:00:00Z",
                "journal": "Data Mining and Knowledge Discovery",
                "title": "Probabilistic change detection and visualization methods for the assessment of temporal stability in biomedical data quality"
            },
            "type": [
                "Method"
            ]
        },
        {
            "doi": "10.1016/j.ijmedinf.2018.09.015",
            "metadata": {
                "abstract": "© 2018 Elsevier B.V.Aim: The increasing availability of Big Biomedical Data is leading to large research data samples collected over long periods of time. We propose the analysis of the kinematics of data probability distributions over time towards the characterization of data temporal variability. Methods: First, we propose a kinematic model based on the estimation of a continuous data temporal trajectory, using Functional Data Analysis over the embedding of a non-parametric statistical manifold which points represent data temporal batches, the Information Geometric Temporal (IGT) plot. This model allows measuring the velocity and acceleration of data changes. Next, we propose a coordinate-free method to characterize the oriented seasonality of data based on the parallelism of lagged velocity vectors of the data trajectory throughout the IGT space, the Auto-Parallelism of Velocity Vectors (APVV) and APVVmap. Finally, we automatically explain the maximum variance components of the IGT space coordinates by means of correlating data points with known temporal factors from the domain application. Materials: Methods are evaluated on the US National Hospital Discharge Survey open dataset, consisting of 3,25M hospital discharges between 2000 and 2010. Results: Seasonal and abrupt behaviours were present on the estimated multivariate and univariate data trajectories. The kinematic analysis revealed seasonal effects and punctual increments in data celerity, the latter mainly related to abrupt changes in coding. The APVV and APVVmap revealed oriented seasonal changes on data trajectories. For most variables, their distributions tended to change to the same direction at a 12-month period, with a peak of change of directionality at mid and end of the year. Diagnosis and Procedure codes also included a 9-month periodic component. Kinematics and APVV methods were able to detect seasonal effects on extreme temporal subgrouped data, such as in Procedure code, where Fourier and autocorrelation methods were not able to. The automated explanation of IGT space coordinates was consistent with the results provided by the kinematic and seasonal analysis. Coordinates received different meanings according to the trajectory trend, seasonality and abrupt changes. Discussion: Treating data as a particle moving over time through a multidimensional probabilistic space and studying the kinematics of its trajectory has turned out to a new temporal variability methodology. Its results on the NHDS were aligned with the dataset and population descriptions found in the literature, contributing with a novel temporal variability characterization. We have demonstrated that the APVV and APVVmat are an appropriate tool for the coordinate-free and oriented analysis of trajectories or complex multivariate signals. Conclusion: The proposed methods comprise an exploratory methodology for the characterization of data temporal variability, what may be useful for a reliable reuse of Big Biomedical Data repositories acquired over long periods of time.",
                "authors": [
                    {
                        "name": "Garcia-Gomez J.M."
                    },
                    {
                        "name": "Saez C."
                    }
                ],
                "citationCount": 7,
                "date": "2018-11-01T00:00:00Z",
                "journal": "International Journal of Medical Informatics",
                "title": "Kinematics of Big Biomedical Data to characterize temporal variability and seasonality of data repositories: Functional Data Analysis of data temporal evolution over non-parametric statistical manifolds"
            },
            "type": [
                "Other"
            ]
        },
        {
            "doi": "10.1093/jamia/ocw010",
            "metadata": {
                "abstract": "© The Author 2016. Published by Oxford University Press on behalf of the American Medical Informatics Association. All rights reserved.Objective To assess the variability in data distributions among data sources and over time through a case study of a large multisite repository as a systematic approach to data quality (DQ).Materials and Methods Novel probabilistic DQ control methods based on information theory and geometry are applied to the Public Health Mortality Registry of the Region of Valencia, Spain, with 512 143 entries from 2000 to 2012, disaggregated into 24 health departments. The methods provide DQ metrics and exploratory visualizations for (1) assessing the variability among multiple sources and (2) monitoring and exploring changes with time. The methods are suited to big data and multitype, multivariate, and multimodal data.Results The repository was partitioned into 2 probabilistically separated temporal subgroups following a change in the Spanish National Death Certificate in 2009. Punctual temporal anomalies were noticed due to a punctual increment in the missing data, along with outlying and clustered health departments due to differences in populations or in practices.Discussion Changes in protocols, differences in populations, biased practices, or other systematic DQ problems affected data variability. Even if semantic and integration aspects are addressed in data sharing infrastructures, probabilistic variability may still be present. Solutions include fixing or excluding data and analyzing different sites or time periods separately. A systematic approach to assessing temporal and multisite variability is proposed.Conclusion Multisite and temporal variability in data distributions affects DQ, hindering data reuse, and an assessment of such variability should be a part of systematic DQ procedures.",
                "authors": [
                    {
                        "name": "Garcia-Gomez J.M."
                    },
                    {
                        "name": "Melchor I."
                    },
                    {
                        "name": "Perez-Panades J."
                    },
                    {
                        "name": "Robles M."
                    },
                    {
                        "name": "Saez C."
                    },
                    {
                        "name": "Zurriaga O."
                    }
                ],
                "citationCount": 23,
                "date": "2016-11-01T00:00:00Z",
                "journal": "Journal of the American Medical Informatics Association",
                "title": "Applying probabilistic temporal and multisite data quality control methods to a public health mortality registry in Spain: A systematic approach to quality control of repositories"
            },
            "type": [
                "Benchmarking study"
            ]
        },
        {
            "doi": "10.1101/2020.04.07.20056564",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library",
        "Web application",
        "Workflow"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Data quality management",
            "uri": "http://edamontology.org/topic_3572"
        },
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        }
    ],
    "validated": 1,
    "version": [
        "1.1.1"
    ]
}
