{"collectionID": [], "accessibility": [], "topic": [{"term": "Molecular interactions, pathways and networks", "uri": "http://edamontology.org/topic_0602"}, {"term": "Molecular dynamics", "uri": "http://edamontology.org/topic_0176"}, {"term": "Structure prediction", "uri": "http://edamontology.org/topic_0082"}], "owner": "ELIXIR-EE", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": null, "note": null, "version": null, "pmid": "15860562", "type": null, "pmcid": null, "metadata": {"title": "iGNM: A database of protein functional motions based on Gaussian Network Model", "abstract": "Motivation: The knowledge of protein structure is not sufficient for understanding and controlling its function. Function is a dynamic property. Although protein structural information has been rapidly accumulating in databases, little effort has been invested to date toward systematically characterizing protein dynamics. The recent success of analytical methods based on elastic network models, and in particular the Gaussian Network Model (GNM), permits us to perform a high-throughput analysis of the collective dynamics of proteins. Results: We computed the GNM dynamics for 20 058 structures from the Protein Data Bank, and generated information on the equilibrium dynamics at the level of individual residues. The results are stored on a web-based system called iGNM and configured so as to permit the users to visualize or download the results through a standard web browser using a simple search engine. Static and animated images for describing the conformational mobility of proteins over a broad range of normal modes are accessible, along with an online calculation engine available for newly deposited structures. A case study of the dynamics of 20 non-homologous hydrolases is presented to illustrate the utility of the iGNM database for identifying key residues that control the cooperative motions and revealing the connection between collective dynamics and catalytic activity. © The Author 2005. Published by Oxford University Press. All rights reserved.", "citationCount": 102, "authors": [{"name": "Yang L.-W."}, {"name": "Liu X."}, {"name": "Jursa C.J."}, {"name": "Holliman M."}, {"name": "Rader A.J."}, {"name": "Karimi H.A."}, {"name": "Bahar I."}], "date": "2005-07-01T00:00:00Z", "journal": "Bioinformatics"}}, {"doi": null, "note": null, "version": null, "pmid": "16845002", "type": null, "pmcid": null, "metadata": {"title": "oGNM: Online computation of structural dynamics using the Gaussian Network Model", "abstract": "An assessment of the equilibrium dynamics of biomolecular systems, and in particular their most cooperative fluctuations accessible undernative state conditions, is a first step towards understanding molecular mechanisms relevant to biological function. We present a web-based system, oGNM that enables users to calculate online the shape and dispersion of normal modes of motion for proteins, oligonucleotides and their complexes, or associated biological units, using the Gaussian Network Model (GNM). Computations with the new engine are 5-6 orders of magnitude faster than those using conventional normal mode analyses. Two cases studies illustrate the utility of oGNM. The first shows that the thermal fluctuations predicted for 1250 non-homologous proteins correlate well with X-ray crystallographic data over a broad range [7.3-15 Å] of inter-residue interaction cutoff distances and the correlations improve with increasing observation temperatures. The second study, focused on 64 oligonucleotides and oligonucleotide-protein complexes, shows that good agreement with experiments is achieved by representing each nucleotide by three GNM nodes (as opposed to one-node-per-residue in proteins) along with uniform interaction ranges for all components of the complexes. These results open the way to a rapid assessment of the dynamics of DNA/ RNA-containing complexes. The server can be accessed at http://ignm.ccbb.pitt.edu/ GNM_Online_Calculation.htm. © The Author 2006. Published by Oxford University Press. All rights reserved.", "citationCount": 100, "authors": [{"name": "Yang L.-W."}, {"name": "Rader A.J."}, {"name": "Liu X."}, {"name": "Jursa C.J."}, {"name": "Chen S.C."}, {"name": "Karimi H.A."}, {"name": "Bahar I."}], "date": "2006-07-01T00:00:00Z", "journal": "Nucleic Acids Research"}}, {"doi": null, "note": null, "version": null, "pmid": "9218955", "type": null, "pmcid": null, "metadata": {"title": "Direct evaluation of thermal fluctuations in proteins using a single-parameter harmonic potential", "abstract": "Background: An elastic network model is proposed for the interactions between closely (≤ 7.0 Å) located α-carbon pairs in folded proteins. A single-parameter harmonic potential is adopted for the fluctuations of residues about their mean positions in the crystal structure. The model is based on writing the Kirchhoff adjacency matrix for a protein defining the proximity of residues in space. The elements of the inverse of the Kirchhoff matrix give directly the auto-correlations or cross-correlations of atomic fluctuations. Results: The temperature factors of the Ca atoms of 12 X-ray structures, ranging from a 41 residue subunit to a 633 residue dimer, are accurately predicted. Cross-correlations are also efficiently characterized, in close agreement with results obtained with a normal mode analysis coupled with energy minimization. Conclusions: The simple model and method proposed here provide a satisfactory description of the correlations between atomic fluctuations. Furthermore, this is achieved within computation times at least one order of magnitude shorter than commonly used molecular approaches. © Current Biology Ltd.", "citationCount": 954, "authors": [{"name": "Bahar I."}, {"name": "Atilgan A.R."}, {"name": "Erman B."}], "date": "1997-01-01T00:00:00Z", "journal": "Folding and Design"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": "Hongchun Li", "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "hongchun@pitt.edu"}], "biotoolsCURIE": "biotools:ognm", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "http://ignm.ccbb.pitt.edu/GNM_Online_Calculation.htm", "function": [{"note": null, "input": [], "operation": [{"term": "Protein modelling", "uri": "http://edamontology.org/operation_0477"}, {"term": "Metabolic network modelling", "uri": "http://edamontology.org/operation_3660"}, {"term": "Formatting", "uri": "http://edamontology.org/operation_0335"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:56Z", "otherID": [], "description": "Online Guassian Network Model (oGNM) calculates the equilibrium dynamics of any structure submitted in PDB format, using the Gaussian Network Model (GNM), a network model for representing biomolecules.", "toolType": ["Web application"], "editPermission": {"type": "private", "authors": []}, "language": [], "link": [], "biotoolsID": "ognm", "additionDate": "2017-02-10T14:15:39Z", "name": "oGNM", "license": null, "documentation": [{"url": "http://gnm.csb.pitt.edu/Tutorial.php", "note": null, "type": "General"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux", "Windows", "Mac"]}