{
    "additionDate": "2019-11-14T20:08:15Z",
    "biotoolsCURIE": "biotools:Clus-Ensemble",
    "biotoolsID": "Clus-Ensemble",
    "confidence_flag": "low",
    "credit": [
        {
            "email": "felipekenji.nakano@kuleuven.be",
            "name": "Felipe Kenji Nakano",
            "typeEntity": "Person"
        }
    ],
    "description": "> LOW CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'HMC', 'HMC-GA', 'Machine learning discovering missing wrong protein function annotations', 'FunCat' | Machine learning for discovering missing or wrong protein function annotations | Clus is a decision tree and rule induction system that implements the predictive clustering framework. This framework unifies unsupervised clustering and predictive modelling and allows for a natural extension to more complex prediction settings such as multi-task learning and multi-label classification | Clus is co-developed by the Declarative Languages and Artificial Intelligence group of the Katholieke Universiteit Leuven, Belgium, and the Department of Knowledge Technologies of the Jožef Stefan Institute, Ljubljana, Slovenia | Clus is free software (licensed under the GPL) and can be obtained from this website",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "https://dtai.cs.kuleuven.be/clus/",
    "lastUpdate": "2019-11-14T20:08:15Z",
    "name": "Clus-Ensemble",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3060-6",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: A massive amount of proteomic data is generated on a daily basis, nonetheless annotating all sequences is costly and often unfeasible. As a countermeasure, machine learning methods have been used to automatically annotate new protein functions. More specifically, many studies have investigated hierarchical multi-label classification (HMC) methods to predict annotations, using the Functional Catalogue (FunCat) or Gene Ontology (GO) label hierarchies. Most of these studies employed benchmark datasets created more than a decade ago, and thus train their models on outdated information. In this work, we provide an updated version of these datasets. By querying recent versions of FunCat and GO yeast annotations, we provide 24 new datasets in total. We compare four HMC methods, providing baseline results for the new datasets. Furthermore, we also evaluate whether the predictive models are able to discover new or wrong annotations, by training them on the old data and evaluating their results against the most recent information. Results: The results demonstrated that the method based on predictive clustering trees, Clus-Ensemble, proposed in 2008, achieved superior results compared to more recent methods on the standard evaluation task. For the discovery of new knowledge, Clus-Ensemble performed better when discovering new annotations in the FunCat taxonomy, whereas hierarchical multi-label classification with genetic algorithm (HMC-GA), a method based on genetic algorithms, was overall superior when detecting annotations that were removed. In the GO datasets, Clus-Ensemble once again had the upper hand when discovering new annotations, HMC-GA performed better for detecting removed annotations. However, in this evaluation, there were less significant differences among the methods. Conclusions: The experiments have showed that protein function prediction is a very challenging task which should be further investigated. We believe that the baseline results associated with the updated datasets provided in this work should be considered as guidelines for future studies, nonetheless the old versions of the datasets should not be disregarded since other tasks in machine learning could benefit from them.",
                "authors": [
                    {
                        "name": "Nakano F.K."
                    },
                    {
                        "name": "Lietaert M."
                    },
                    {
                        "name": "Vens C."
                    }
                ],
                "citationCount": 5,
                "date": "2019-09-23T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Machine learning for discovering missing or wrong protein function annotations"
            },
            "pmcid": "PMC6755698",
            "pmid": "31547800"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ]
}