{
    "additionDate": "2021-01-18T08:06:07Z",
    "biotoolsCURIE": "biotools:fhir-pit",
    "biotoolsID": "fhir-pit",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "kfecho@copperlineprofessionalsolutions.com",
            "name": "Karamarie Fecho",
            "orcidid": "https://orcid.org/0000-0002-6704-9306",
            "typeEntity": "Person"
        }
    ],
    "description": "FHIR PIT (Health Level 7 Fast Healthcare Interoperability Resources Patient data Integration Tool) is an open software application for spatiotemporal integration of clinical data and environmental exposures data. FHIR PIT (Patient data Integration Tool) uses geocodes and time stamps of varying resolution (e.g., hour, year) to integrate the clinical data with environmental exposures data from multiple sources before stripping the data of PHI (including the geocodes and time stamps) and binning feature variables to create ICEES tables. Of note, FHIR PIT is modular and extensible and can be adapted for virtually any type of data that requires geocodes and dates for integration with personally identifiable information.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/NCATS-Tangerine/FHIR-PIT",
    "language": [
        "C++",
        "Python",
        "Scala"
    ],
    "lastUpdate": "2021-03-11T08:39:47Z",
    "license": "MIT",
    "name": "FHIR PIT",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.21203/RS.2.19633/V3"
        },
        {
            "doi": "10.1186/S12911-020-1056-9",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Informatics tools to support the integration and subsequent interrogation of spatiotemporal data such as clinical data and environmental exposures data are lacking. Such tools are needed to support research in environmental health and any biomedical field that is challenged by the need for integrated spatiotemporal data to examine individual-level determinants of health and disease. Results: We have developed an open-source software application - FHIR PIT (Health Level 7 Fast Healthcare Interoperability Resources Patient data Integration Tool) - to enable studies on the impact of individual-level environmental exposures on health and disease. FHIR PIT was motivated by the need to integrate patient data derived from our institution's clinical warehouse with a variety of public data sources on environmental exposures and then openly expose the data via ICEES (Integrated Clinical and Environmental Exposures Service). FHIR PIT consists of transformation steps or building blocks that can be chained together to form a transformation and integration workflow. Several transformation steps are generic and thus can be reused. As such, new types of data can be incorporated into the modular FHIR PIT pipeline by simply reusing generic steps or adding new ones. We validated FHIR PIT in the context of a driving use case designed to investigate the impact of airborne pollutant exposures on asthma. Specifically, we replicated published findings demonstrating racial disparities in the impact of airborne pollutants on asthma exacerbations. Conclusions: While FHIR PIT was developed to support our driving use case on asthma, the software can be used to integrate any type and number of spatiotemporal data sources at a level of granularity that enables individual-level study. We expect FHIR PIT to facilitate research in environmental health and numerous other biomedical disciplines.",
                "authors": [
                    {
                        "name": "Ahalt S.C."
                    },
                    {
                        "name": "Champion J."
                    },
                    {
                        "name": "Cox S."
                    },
                    {
                        "name": "Fecho K."
                    },
                    {
                        "name": "Pfaff E."
                    },
                    {
                        "name": "Stillwell L."
                    },
                    {
                        "name": "Xu H."
                    }
                ],
                "citationCount": 1,
                "date": "2020-03-11T00:00:00Z",
                "journal": "BMC Medical Informatics and Decision Making",
                "title": "FHIR PIT: An open software application for spatiotemporal integration of clinical data and environmental exposures data"
            },
            "pmcid": "PMC7066811",
            "pmid": "32160884"
        }
    ],
    "topic": [
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
