{
    "additionDate": "2015-04-24T12:02:51Z",
    "biotoolsCURIE": "biotools:coasim",
    "biotoolsID": "coasim",
    "credit": [
        {
            "name": "birc.au.dk",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "mailund@birc.au.dk",
            "name": "Thomas Mailund",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Simulating the coalescent process.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://users-birc.au.dk/mailund/CoaSim/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "note": "Simulating the coalescent process with recombination and geneconversion under various demographic models. It effectively constructs the ancestral recombination graph for a given number of individuals and uses this to simulate samples of SNP, micro-satellite, and other haplotypes/genotypes. Simulated genotype data",
            "operation": [
                {
                    "term": "Recombination detection",
                    "uri": "http://edamontology.org/operation_0451"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Sequence",
                        "uri": "http://edamontology.org/data_2044"
                    }
                }
            ]
        }
    ],
    "homepage": "http://users-birc.au.dk/mailund/CoaSim/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2019-03-12T13:16:29Z",
    "name": "CoaSim",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "runef@birc.au.dk",
    "publication": [
        {
            "doi": "10.1186/1471-2105-6-252",
            "metadata": {
                "abstract": "Background: Coalescent simulations are playing a large role in interpreting large scale intra-specific sequence or polymorphism surveys and for planning and evaluating association studies. Coalescent simulations of data sets under different models can be compared to the actual data to test the importance of different evolutionary factors and thus get insight into these. Results: We have created the CoaSim application as a flexible environment for Monte Carlo simulation of various types of genetic data under equilibrium and non-equilibrium coalescent processes for a variety of applications. Interaction with the tool is through the Guile version of the Scheme scripting language. Scheme scripts for many standard and advanced applications are provided and these can easily be modified by the user for a much wider range of applications. A graphical user interface with less functionality and flexibility is also included. It is primarily intended as an exploratory and educational tool Conclusions: CoaSim is a powerful tool because of its flexibility and ease of use. This is illustrated through very varied uses of the application, e.g. evaluation of association mapping methods, parametric bootstrapping, and design and choice of markers for specific questions. © 2005 Mailund et al., licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Mailund T."
                    },
                    {
                        "name": "Schierup M.H."
                    },
                    {
                        "name": "Pedersen C.N.S."
                    },
                    {
                        "name": "Mechlenborg P.J.M."
                    },
                    {
                        "name": "Madsen J.N."
                    },
                    {
                        "name": "Schauser L."
                    }
                ],
                "citationCount": 50,
                "date": "2005-10-14T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "CoaSim: A flexible environment for simulating genetic data under coalescent models"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1,
    "version": [
        "4.2.2"
    ]
}