{
    "additionDate": "2022-07-14T04:49:25.561177Z",
    "biotoolsCURIE": "biotools:acconet",
    "biotoolsID": "acconet",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Gongyang Li",
            "orcidid": "https://orcid.org/0000-0001-7324-1196"
        },
        {
            "name": "Haibin Ling",
            "orcidid": "https://orcid.org/0000-0003-4094-8413"
        }
    ],
    "description": "A adjacent context coordination network (ACCoNet) to explore the coordination of adjacent features in an encoder-decoder architecture for RSI-SOD.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/MathLee/ACCoNet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-07-14T04:49:25.564456Z",
    "license": "Not licensed",
    "name": "ACCoNet",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1109/TCYB.2022.3162945",
            "metadata": {
                "abstract": "IEEESalient object detection (SOD) in optical remote sensing images (RSIs), or RSI-SOD, is an emerging topic in understanding optical RSIs. However, due to the difference between optical RSIs and natural scene images (NSIs), directly applying NSI-SOD methods to optical RSIs fails to achieve satisfactory results. In this article, we propose a novel adjacent context coordination network (ACCoNet) to explore the coordination of adjacent features in an encoder-decoder architecture for RSI-SOD. Specifically, ACCoNet consists of three parts: 1) an encoder; 2) adjacent context coordination modules (ACCoMs); and 3) a decoder. As the key component of ACCoNet, ACCoM activates the salient regions of output features of the encoder and transmits them to the decoder. ACCoM contains a local branch and two adjacent branches to coordinate the multilevel features simultaneously. The local branch highlights the salient regions in an adaptive way, while the adjacent branches introduce global information of adjacent levels to enhance salient regions. In addition, to extend the capabilities of the classic decoder block (i.e., several cascaded convolutional layers), we extend it with two bifurcations and propose a bifurcation-aggregation block (BAB) to capture the contextual information in the decoder. Extensive experiments on two benchmark datasets demonstrate that the proposed ACCoNet outperforms 22 state-of-the-art methods under nine evaluation metrics, and runs up to 81 fps on a single NVIDIA Titan X GPU. The code and results of our method are available at https://github.com/MathLee/ACCoNet.",
                "authors": [
                    {
                        "name": "Li G."
                    },
                    {
                        "name": "Lin W."
                    },
                    {
                        "name": "Ling H."
                    },
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Zeng D."
                    }
                ],
                "citationCount": 1,
                "date": "2022-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Cybernetics",
                "title": "Adjacent Context Coordination Network for Salient Object Detection in Optical Remote Sensing Images"
            },
            "pmid": "35417367"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ]
}
