{
    "additionDate": "2015-05-04T12:47:28Z",
    "biotoolsCURIE": "biotools:ndtree",
    "biotoolsID": "ndtree",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "name": "CBS",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "lund@cbs.dtu.dk",
            "name": "Ole Lund",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Phylogenic tree from reads using nucleotide difference method.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://cge.cbs.dtu.dk//services/NDtree/instructions.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence",
                        "uri": "http://edamontology.org/data_2044"
                    },
                    "format": [
                        {
                            "term": "FASTA-like",
                            "uri": "http://edamontology.org/format_2546"
                        }
                    ]
                }
            ],
            "note": "Phylogenic tree from reads using nucleotide difference method",
            "operation": [
                {
                    "term": "Phylogenetic tree generation",
                    "uri": "http://edamontology.org/operation_0323"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Sequence report",
                        "uri": "http://edamontology.org/data_2955"
                    },
                    "format": [
                        {
                            "term": "Binary format",
                            "uri": "http://edamontology.org/format_2333"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://cge.cbs.dtu.dk/services/NDtree/",
    "lastUpdate": "2019-01-10T04:58:57Z",
    "license": "Other",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://cbs.dtu.dk/services"
        }
    ],
    "maturity": "Emerging",
    "name": "NDtree",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "CBS",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0087991",
            "metadata": {
                "abstract": "Salmonella enterica is a common cause of minor and large food borne outbreaks. To achieve successful and nearly 'real-time' monitoring and identification of outbreaks, reliable sub-typing is essential. Whole genome sequencing (WGS) shows great promises for using as a routine epidemiological typing tool. Here we evaluate WGS for typing of S. Typhimurium including different approaches for analyzing and comparing the data. A collection of 34 S. Typhimurium isolates was sequenced. This consisted of 18 isolates from six outbreaks and 16 epidemiologically unrelated background strains. In addition, 8 S. Enteritidis and 5 S. Derby were also sequenced and used for comparison. A number of different bioinformatics approaches were applied on the data; including pan-genome tree, k-mer tree, nucleotide difference tree and SNP tree. The outcome of each approach was evaluated in relation to the association of the isolates to specific outbreaks. The pan-genome tree clustered 65% of the S. Typhimurium isolates according to the pre-defined epidemiology, the k-mer tree 88%, the nucleotide difference tree 100% and the SNP tree 100% of the strains within S. Typhimurium. The resulting outcome of the four phylogenetic analyses were also compared to PFGE reveling that WGS typing achieved the greater performance than the traditional method. In conclusion, for S. Typhimurium, SNP analysis and nucleotide difference approach of WGS data seem to be the superior methods for epidemiological typing compared to other phylogenetic analytic approaches that may be used on WGS. These approaches were also superior to the more classical typing method, PFGE. Our study also indicates that WGS alone is insufficient to determine whether strains are related or un-related to outbreaks. This still requires the combination of epidemiological data and whole genome sequencing results. © 2014 Leekitcharoenphon et al.",
                "authors": [
                    {
                        "name": "Leekitcharoenphon P."
                    },
                    {
                        "name": "Nielsen E.M."
                    },
                    {
                        "name": "Kaas R.S."
                    },
                    {
                        "name": "Lund O."
                    },
                    {
                        "name": "Aarestrup F.M."
                    }
                ],
                "citationCount": 147,
                "date": "2014-02-04T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Evaluation of whole genome sequencing for outbreak detection of salmonella enterica"
            },
            "pmcid": "PMC3913712",
            "pmid": "24505344",
            "type": [
                "Primary"
            ]
        },
        {
            "metadata": {
                "abstract": "Fast and accurate identification and typing of pathogens are essential for effective surveillance and outbreak detection. The current routine procedure is based on a variety of techniques, making the procedure laborious, time-consuming, and expensive. With whole-genome sequencing (WGS) becoming cheaper, it has huge potential in both diagnostics and routine surveillance. The aim of this study was to perform a real-time evaluation of WGS for routine typing and surveillance of verocytotoxin-producing Escherichia coli (VTEC). In Denmark, the Statens Serum Institut (SSI) routinely receives all suspected VTEC isolates. During a 7-week period in the fall of 2012, all incoming isolates were concurrently subjected to WGS using IonTorrent PGM. Real-time bioinformatics analysis was performed using web-tools (www.genomicepidemiology.org) for species determination, multilocus sequence type (MLST) typing, and determination of phylogenetic relationship, and a specific VirulenceFinder for detection of E coli virulence genes was developed as part of this study. In total, 46 suspected VTEC isolates were characterized in parallel during the study. VirulenceFinder proved successful in detecting virulence genes included in routine typing, explicitly verocytotoxin 1(vtx1), verocytotoxin 2(vtx2), and intimin (eae), and also detected additional virulence genes. VirulenceFinder is also a robust method for assigning verocytotoxin (vtx) subtypes. A real-time clustering of isolates in agreement with the epidemiology was established from WGS, enabling discrimination between sporadic and outbreak isolates. Overall, WGS typing produced results faster and at a lower cost than the current routine. Therefore, WGS typing is a superior alternative to conventional typing strategies. This approach may also be applied to typing and surveillance of other pathogens. Copyright © 2014, American Society for Microbiology. All Rights Reserved.",
                "authors": [
                    {
                        "name": "Joensen K.G."
                    },
                    {
                        "name": "Scheutz F."
                    },
                    {
                        "name": "Lund O."
                    },
                    {
                        "name": "Hasman H."
                    },
                    {
                        "name": "Kaas R.S."
                    },
                    {
                        "name": "Nielsen E.M."
                    },
                    {
                        "name": "Aarestrup F.M."
                    }
                ],
                "citationCount": 490,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Journal of Clinical Microbiology",
                "title": "Real-time whole-genome sequencing for routine typing, surveillance, and outbreak detection of verotoxigenic Escherichia coli"
            },
            "pmid": "24574290",
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}