{
    "additionDate": "2017-08-20T15:59:15Z",
    "biotoolsCURIE": "biotools:treemix",
    "biotoolsID": "treemix",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "email": "joseph_pickrell@hms.harvard.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Method for inferring the patterns of population splits and mixtures in the history of a set of populations. In the underlying model, the modern-day populations in a species are related to a common ancestor via a graph of ancestral populations. The allele frequencies in the modern populations are used to infer the structure of this graph.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://bitbucket.org/nygcresearch/treemix/wiki/Home"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                },
                {
                    "term": "Phylogenetic tree generation",
                    "uri": "http://edamontology.org/operation_0323"
                }
            ]
        }
    ],
    "homepage": "https://bitbucket.org/nygcresearch/treemix/wiki/Home",
    "language": [
        "C++"
    ],
    "lastUpdate": "2019-01-29T12:05:49Z",
    "license": "GPL-3.0",
    "name": "TreeMix",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "babaref",
    "publication": [
        {
            "doi": "10.1371/journal.pgen.1002967",
            "metadata": {
                "abstract": "Many aspects of the historical relationships between populations in a species are reflected in genetic data. Inferring these relationships from genetic data, however, remains a challenging task. In this paper, we present a statistical model for inferring the patterns of population splits and mixtures in multiple populations. In our model, the sampled populations in a species are related to their common ancestor through a graph of ancestral populations. Using genome-wide allele frequency data and a Gaussian approximation to genetic drift, we infer the structure of this graph. We applied this method to a set of 55 human populations and a set of 82 dog breeds and wild canids. In both species, we show that a simple bifurcating tree does not fully describe the data; in contrast, we infer many migration events. While some of the migration events that we find have been detected previously, many have not. For example, in the human data, we infer that Cambodians trace approximately 16% of their ancestry to a population ancestral to other extant East Asian populations. In the dog data, we infer that both the boxer and basenji trace a considerable fraction of their ancestry (9% and 25%, respectively) to wolves subsequent to domestication and that East Asian toy breeds (the Shih Tzu and the Pekingese) result from admixture between modern toy breeds and \"ancient\" Asian breeds. Software implementing the model described here, called TreeMix, is available at http://treemix.googlecode.com. © 2012 Pickrell, Pritchard.",
                "authors": [
                    {
                        "name": "Pickrell J.K."
                    },
                    {
                        "name": "Pritchard J.K."
                    }
                ],
                "citationCount": 920,
                "date": "2012-11-01T00:00:00Z",
                "journal": "PLoS Genetics",
                "title": "Inference of Population Splits and Mixtures from Genome-Wide Allele Frequency Data"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        }
    ],
    "validated": 1
}
