
{
    "credit": [
        {
            "email": "jiri@eimb.ru",
            "name": "Youri Kravatsky",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "gk@eimb.ru",
            "name": "Galina Kravatskaya",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "vladimir_chechet@mail.ru",
            "name": "Vladimir Chechetkin",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://ancorr.eimb.ru/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "PHP",
            "JavaScript",
            "Perl",
            "C"
        ],
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web service"
        ],
        "topic": [
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author 2015. Published by Oxford University Press on behalf of Kazusa DNA Research Institute. The broad class of tasks in genetics and epigenetics can be reduced to the study of various features that are distributed over the genome (genome tracks). The rapid and efficient processing of the huge amount of data stored in the genome-scale databases cannot be achieved without the software packages based on the analytical criteria. However, strong inhomogeneity of genome tracks hampers the development of relevant statistics. We developed the criteria for the assessment of genome track inhomogeneity and correlations between two genome tracks. We also developed a software package, Genome Track Analyzer, based on this theory. The theory and software were tested on simulated data and were applied to the study of correlations between CpG islands and transcription start sites in the Homo sapiens genome, between profiles of protein-binding sites in chromosomes of Drosophila melanogaster, and between DNA double-strand breaks and histone marks in the H. sapiens genome. Significant correlations between transcription start sites on the forward and the reverse strands were observed in genomes of D. melanogaster, Caenorhabditis elegans, Mus musculus, H. sapiens, and Danio rerio. The observed correlations may be related to the regulation of gene expression in eukaryotes. Genome Track Analyzer is freely available at http://ancorr.eimb.ru/.",
            "authors": [
                "Kravatsky Y.V.",
                "Chechetkin V.R.",
                "Tchurikov N.A.",
                "Kravatskaya G.I."
            ],
            "cit_count": 7,
            "journal": "DNA Research",
            "pmid": "25627242",
            "title": "Genome-wide study of correlations between genomic features and their relationship with the regulation of gene expression",
            "year": "2015-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:ancorr",
        "biotoolsID": "ancorr",
        "description": "Webserver/tool for evaluation coordinate and ordinal correlations between genomic tracks and/or expression or protein binding profiles.",
        "homepage": "http://ancorr.eimb.ru",
        "name": "AnCorr"
    }
}