{
    "accessibility": "Open access",
    "additionDate": "2022-11-12T19:03:08.306694Z",
    "biotoolsCURIE": "biotools:msdensenet",
    "biotoolsID": "msdensenet",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Dong-Jun Yu"
        },
        {
            "name": "Yu-Hang Yin"
        }
    ],
    "description": "Improving the prediction of DNA-protein binding by integrating multi-scale dense convolutional network with fault-tolerant coding.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA-binding protein prediction",
                    "uri": "http://edamontology.org/operation_3900"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Sequence feature detection",
                    "uri": "http://edamontology.org/operation_0253"
                }
            ]
        }
    ],
    "homepage": "http://202.119.84.36:3079/msdensenet/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:21:14.077814Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Mirror"
            ],
            "url": "https://github.com/csbio-njust-edu/msdensenet"
        }
    ],
    "name": "MSDenseNet",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/j.ab.2022.114878",
            "metadata": {
                "abstract": "Accurate prediction of DNA-protein binding (DPB) is of great biological significance for studying the regulatory mechanism of gene expression. In recent years, with the rapid development of deep learning techniques, advanced deep neural networks have been introduced into the field and shown to significantly improve the prediction performance of DPB. However, these methods are primarily based on the DNA sequences measured by the ChIP-seq technology, failing to consider the possible partial variations of the motif sequences and errors of the sequencing technology itself. To address this, we propose a novel computational method, termed MSDenseNet, which combines a new fault-tolerant coding (FTC) scheme with the dense connectional deep neural networks. Three important factors can be attributed to the success of MSDenseNet: First, MSDenseNet utilizes a powerful feature representation approach, which transforms the raw DNA sequence into fusion coding using the fault-tolerant feature sequence; Second, in terms of network structure, MSDenseNet uses a multi-scale convolution within the dense layer and the multi-scale convolution preceding the dense block. This is shown to be able to significantly improve the network performance and accelerate the network convergence speed, and third, building upon the advanced deep neural network, MSDenseNet is capable of effectively mining the hidden complex relationship between the internal attributes of fusion sequence features to enhance the prediction of DPB. Benchmarking experiments on 690 ChIP-seq datasets show that MSDenseNet achieves an average AUC of 0.933 and outperforms the state-of-the-art method. The source code of MSDenseNet is available at https://github.com/csbio-njust-edu/msdensenet. The results show that MSDenseNet can effectively predict DPB. We anticipate that MSDenseNet will be exploited as a powerful tool to facilitate a more exhaustive understanding of DNA-binding proteins and help toward their functional characterization.",
                "authors": [
                    {
                        "name": "Gao S."
                    },
                    {
                        "name": "Jiang Y."
                    },
                    {
                        "name": "Shen L.-C."
                    },
                    {
                        "name": "Song J."
                    },
                    {
                        "name": "Yin Y.-H."
                    },
                    {
                        "name": "Yu D.-J."
                    }
                ],
                "citationCount": 5,
                "date": "2022-11-01T00:00:00Z",
                "journal": "Analytical Biochemistry",
                "title": "Improving the prediction of DNA-protein binding by integrating multi-scale dense convolutional network with fault-tolerant coding"
            },
            "pmid": "36049552"
        }
    ],
    "toolType": [
        "Script",
        "Web application"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}
