{
    "additionDate": "2021-01-18T11:21:16Z",
    "biotoolsCURIE": "biotools:optimalflow",
    "biotoolsID": "optimalflow",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hristo.inouzhe@gmail.com",
            "name": "Hristo Inouzhe",
            "orcidid": "https://orcid.org/0000-0002-3662-518X",
            "typeEntity": "Person"
        }
    ],
    "description": "Optimal transport approach to flow cytometry gating and population matching.\n\nOptimal-transport techniques applied to supervised flow cytometry gating.\n\noptimalFlow: optimal-transport approach to Flow Cytometry analysis.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://bioconductor.org/packages/optimalFlow",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-15T09:28:18Z",
    "license": "Artistic-2.0",
    "name": "optimalFlow",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03795-W",
            "metadata": {
                "abstract": "© 2020, The Author(s).Background: Data obtained from flow cytometry present pronounced variability due to biological and technical reasons. Biological variability is a well-known phenomenon produced by measurements on different individuals, with different characteristics such as illness, age, sex, etc. The use of different settings for measurement, the variation of the conditions during experiments and the different types of flow cytometers are some of the technical causes of variability. This mixture of sources of variability makes the use of supervised machine learning for identification of cell populations difficult. The present work is conceived as a combination of strategies to facilitate the task of supervised gating. Results: We propose optimalFlowTemplates, based on a similarity distance and Wasserstein barycenters, which clusters cytometries and produces prototype cytometries for the different groups. We show that supervised learning, restricted to the new groups, performs better than the same techniques applied to the whole collection. We also present optimalFlowClassification, which uses a database of gated cytometries and optimalFlowTemplates to assign cell types to a new cytometry. We show that this procedure can outperform state of the art techniques in the proposed datasets. Our code is freely available as optimalFlow, a Bioconductor R package at https://bioconductor.org/packages/optimalFlow. Conclusions: optimalFlowTemplates + optimalFlowClassification addresses the problem of using supervised learning while accounting for biological and technical variability. Our methodology provides a robust automated gating workflow that handles the intrinsic variability of flow cytometry data well. Our main innovation is the methodology itself and the optimal transport techniques that we apply to flow cytometry analysis.",
                "authors": [
                    {
                        "name": "Inouzhe H."
                    },
                    {
                        "name": "Loubes J.-M."
                    },
                    {
                        "name": "Matran C."
                    },
                    {
                        "name": "Mayo-Iscar A."
                    },
                    {
                        "name": "del Barrio E."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "optimalFlow: optimal transport approach to flow cytometry gating and population matching"
            },
            "pmcid": "PMC7590740",
            "pmid": "33109072"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Cytometry",
            "uri": "http://edamontology.org/topic_3934"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
