{
    "additionDate": "2021-03-19T08:56:54Z",
    "biotoolsCURIE": "biotools:fasttrack",
    "biotoolsID": "fasttrack",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "raphael.candelier@sorbonne-universite.fr",
            "name": "Raphaël Candelier",
            "orcidid": "https://orcid.org/0000-0002-1523-6249",
            "typeEntity": "Person"
        }
    ],
    "description": "An open-source software for tracking varying numbers of deformable objects.\n\nThis is the official website of FastTrack, the free tracking software. Targeting scientists, FastTrack focuses on easy and fast objects tracking from video recordings. With easy installation, intuitive interface FastTrack is the tool of choice for every scientist.\n\nFastTrack is a desktop tracking software, easy to install, easy to use, and performant. The software can be downloaded and modified to adapt to any needs. The core of the software can also be embedded easily in any C++/Qt project.\n\nTracking objects in video recording can be tedious. Existing software are expensive, the learning curve can be steep, and the workflow can not be easily adapted when the project evolved.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                }
            ]
        }
    ],
    "homepage": "http://www.fasttrack.sh",
    "language": [
        "C++"
    ],
    "lastUpdate": "2021-04-29T05:58:25Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/FastTrackOrg/FastTrack"
        }
    ],
    "name": "FastTrack",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1008697",
            "metadata": {
                "abstract": "Copyright: © 2021 Gallois, Candelier. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Analyzing the dynamical properties of mobile objects requires to extract trajectories from recordings, which is often done by tracking movies. We compiled a database of two-dimensional movies for very different biological and physical systems spanning a wide range of length scales and developed a general-purpose, optimized, open-source, cross-platform, easy to install and use, self-updating software called FastTrack. It can handle a changing number of deformable objects in a region of interest, and is particularly suitable for animal and cell tracking in two-dimensions. Furthermore, we introduce the probability of incursions as a new measure of a movie’s trackability that doesn’t require the knowledge of ground truth trajectories, since it is resilient to small amounts of errors and can be computed on the basis of an ad hoc tracking. We also leveraged the versatility and speed of FastTrack to implement an iterative algorithm determining a set of nearly-optimized tracking parameters —yet further reducing the amount of human intervention—and demonstrate that FastTrack can be used to explore the space of tracking parameters to optimize the number of swaps for a batch of similar movies. A benchmark shows that FastTrack is orders of magnitude faster than state-of-the-art tracking algorithms, with a comparable tracking accuracy. The source code is available under the GNU GPLv3 at https://github.com/FastTrackOrg/ FastTrack and pre-compiled binaries for Windows, Mac and Linux are available at http://www.fasttrack.sh.",
                "authors": [
                    {
                        "name": "Gallois B."
                    },
                    {
                        "name": "Candelier R."
                    }
                ],
                "date": "2021-02-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "FastTrack: An open-source software for tracking varying numbers of deformable objects"
            },
            "pmcid": "PMC7904165",
            "pmid": "33571205"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ]
}