{
    "accessibility": "Open access",
    "additionDate": "2022-06-11T12:40:13.874491Z",
    "biotoolsCURIE": "biotools:deepfoci",
    "biotoolsID": "deepfoci",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "falk@ibp.cz",
            "name": "Martin Falk",
            "typeEntity": "Person"
        }
    ],
    "description": "Deep learning-based algorithm for fast automatic analysis of DNA double-strand break ionizing radiation-induced foci.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/tomasvicar/DeepFoci",
    "language": [
        "MATLAB",
        "Python"
    ],
    "lastUpdate": "2022-06-11T12:40:13.877008Z",
    "license": "Not licensed",
    "name": "DeepFoci",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.CSBJ.2021.11.019",
            "metadata": {
                "abstract": "© 2021 The AuthorsDNA double-strand breaks (DSBs), marked by ionizing radiation-induced (repair) foci (IRIFs), are the most serious DNA lesions and are dangerous to human health. IRIF quantification based on confocal microscopy represents the most sensitive and gold-standard method in radiation biodosimetry and allows research on DSB induction and repair at the molecular and single-cell levels. In this study, we introduce DeepFoci – a deep learning-based fully automatic method for IRIF counting and morphometric analysis. DeepFoci is designed to work with 3D multichannel data (trained for 53BP1 and γH2AX) and uses U-Net for nucleus segmentation and IRIF detection, together with maximally stable extremal region-based IRIF segmentation. The proposed method was trained and tested on challenging datasets consisting of mixtures of nonirradiated and irradiated cells of different types and IRIF characteristics – permanent cell lines (NHDFs, U-87) and primary cell cultures prepared from tumors and adjacent normal tissues of head and neck cancer patients. The cells were dosed with 0.5–8 Gy γ-rays and fixed at multiple (0–24 h) postirradiation times. Under all circumstances, DeepFoci quantified the number of IRIFs with the highest accuracy among current advanced algorithms. Moreover, while the detection error of DeepFoci remained comparable to the variability between two experienced experts, the software maintained its sensitivity and fidelity across dramatically different IRIF counts per nucleus. In addition, information was extracted on IRIF 3D morphometric features and repair protein colocalization within IRIFs. This approach allowed multiparameter IRIF categorization of single- or multichannel data, thereby refining the analysis of DSB repair processes and classification of patient tumors, with the potential to identify specific cell subclones. The developed software improves IRIF quantification for various practical applications (radiotherapy monitoring, biodosimetry, etc.) and opens the door to advanced DSB focus analysis and, in turn, a better understanding of (radiation-induced) DNA damage and repair.",
                "authors": [
                    {
                        "name": "Falk M."
                    },
                    {
                        "name": "Falkova I."
                    },
                    {
                        "name": "Gumulec J."
                    },
                    {
                        "name": "Kolar R."
                    },
                    {
                        "name": "Kopecna O."
                    },
                    {
                        "name": "Pagacova E."
                    },
                    {
                        "name": "Vicar T."
                    }
                ],
                "citationCount": 2,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Computational and Structural Biotechnology Journal",
                "title": "DeepFoci: Deep learning-based algorithm for fast automatic analysis of DNA double-strand break ionizing radiation-induced foci"
            },
            "pmcid": "PMC8668444",
            "pmid": "34976305"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Cytometry",
            "uri": "http://edamontology.org/topic_3934"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}
