{
    "additionDate": "2022-09-26T06:52:37.224671Z",
    "biotoolsCURIE": "biotools:a-pass",
    "biotoolsID": "a-pass",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Guangyuan Zou"
        },
        {
            "name": "Jia-Hong Gao",
            "orcidid": "https://orcid.org/0000-0002-9311-0297"
        }
    ],
    "description": "A pipeline to automatically process and analyze simultaneously acquired EEG-fMRI data for sleep research",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/guangyuanzou/A-PASS",
    "language": [
        "MATLAB",
        "Python"
    ],
    "lastUpdate": "2022-09-26T06:52:37.227073Z",
    "license": "Not licensed",
    "name": "A-PASS",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1088/1741-2552/AC83F2",
            "metadata": {
                "abstract": "© 2022 IOP Publishing LtdObjective. Concurrent electroencephalography and functional magnetic resonance imaging (EEG-fMRI) signals can be used to uncover the nature of brain activities during sleep. However, analyzing simultaneously acquired EEG-fMRI data is extremely time consuming and experience dependent. Thus, we developed a pipeline, which we named A-PASS, to automatically analyze simultaneously acquired EEG-fMRI data for studying brain activities during sleep. Approach. A deep learning model was trained on a sleep EEG-fMRI dataset from 45 subjects and used to perform sleep stage scoring. Various fMRI indices can be calculated with A-PASS to depict the neurophysiological characteristics across different sleep stages. We tested the performance of A-PASS on an independent sleep EEG-fMRI dataset from 28 subjects. Statistical maps regarding the main effect of sleep stages and differences between each pair of stages of fMRI indices were generated and compared using both A-PASS and manual processing methods. Main results. The deep learning model implemented in A-PASS achieved both an accuracy and F1-score higher than 70% for sleep stage classification on EEG data acquired during fMRI scanning. The statistical maps generated from A-PASS largely resembled those produced from manually scored stages plus a combination of multiple software programs. Significance. A-PASS allowed efficient EEG-fMRI data processing without manual operation and could serve as a reliable and powerful tool for simultaneous EEG-fMRI studies on sleep.",
                "authors": [
                    {
                        "name": "Gao J.-H."
                    },
                    {
                        "name": "Liu J."
                    },
                    {
                        "name": "Zou G."
                    },
                    {
                        "name": "Zou Q."
                    }
                ],
                "date": "2022-08-01T00:00:00Z",
                "journal": "Journal of Neural Engineering",
                "title": "A-PASS: an automated pipeline to analyze simultaneously acquired EEG-fMRI data for studying brain activities during sleep"
            },
            "pmid": "35878599"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
