{
    "additionDate": "2022-09-14T06:14:54.456687Z",
    "biotoolsCURIE": "biotools:exrnadisease",
    "biotoolsID": "exrnadisease",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Dong Dong"
        },
        {
            "name": "Lei Zhao"
        }
    ],
    "description": "exRNADisease is a database designed for providing the landscape of different types of extracellular RNAs (mRNAs, lncRNAs, miRNAs, circRNAs, tRFRNAs and piRNAs) from body fluids in human diseases.",
    "documentation": [
        {
            "type": [
                "Training material"
            ],
            "url": "http://www.origin-gene.cn/database/exRNAdisease/help.html"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                }
            ]
        }
    ],
    "homepage": "http://www.origin-gene.cn/database/exRNAdisease/",
    "language": [
        "JavaScript",
        "PHP"
    ],
    "lastUpdate": "2022-09-14T06:14:54.459175Z",
    "license": "Not licensed",
    "name": "exRNADisease",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.GENE.2022.146662",
            "metadata": {
                "abstract": "© 2022 Elsevier B.V.Extracellular RNAs (exRNAs) are types of RNAs that present outside of the cells with highly stable features. exRNAs have been shown to play important roles in aiding intercellular communication and regulating cellular processes. In clinical settings, exRNAs have the potential to serve as biomarkers indicating the presence of a disease. Recently, the high-throughput technologies such as RNA sequencing (RNAseq) and microarray have generated abundant exRNA expression data about various diseases. Thus, it is highly desirable to have a comprehensive database for disease-related exRNA transcriptome data detected in diverse body fluids. Here, a total of 88 previously published exRNA transcriptome datasets were collected. We developed a web-accessible database, exRNADisease, which is designed as a central repository for exRNAs from body fluids in human diseases and healthy controls. In the current version, a total of 18,265 samples were collected, which includes 10 body fluids and 78 human disease types. Six different types of RNAs were included (messenger RNAs, circular RNAs, long noncoding RNAs, microRNAs, transfer RNA fragments and PIWI-interacting RNA). Literature is also included to provide the robust evidence about the relationship between exRNAs and diseases. A user-friendly interface was constructed to conveniently search and browse disease-related exRNAs. exRNADisease will become a useful platform to provide genome-wide view of exRNA deregulation in human diseases and help to identify novel biomarkers. Availability and implementation: exRNAdisease can be freely accessible at http://www.origin-gene.cn/database/exRNAdisease/.",
                "authors": [
                    {
                        "name": "Dong D."
                    },
                    {
                        "name": "Luo J."
                    },
                    {
                        "name": "Ning Q."
                    },
                    {
                        "name": "Zhao L."
                    },
                    {
                        "name": "Zheng G."
                    }
                ],
                "citationCount": 1,
                "date": "2022-08-20T00:00:00Z",
                "journal": "Gene",
                "title": "exRNAdisease: An extracellular RNA transcriptome atlas in human diseases"
            },
            "pmid": "35690280"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
