{
    "accessibility": "Open access",
    "additionDate": "2023-09-04T17:55:08.572321Z",
    "biotoolsCURIE": "biotools:psrelip",
    "biotoolsID": "psrelip",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "hirsakai@affrc.go.jp",
            "name": "Hiroaki Sakai",
            "typeEntity": "Person"
        }
    ],
    "description": "Integrated pipeline for analysis and visualization of population structure and relatedness based on genome-wide genetic variant data.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence variations",
                        "uri": "http://edamontology.org/data_3498"
                    },
                    "format": [
                        {
                            "term": "BCF",
                            "uri": "http://edamontology.org/format_3020"
                        },
                        {
                            "term": "VCF",
                            "uri": "http://edamontology.org/format_3016"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Heat map",
                        "uri": "http://edamontology.org/data_1636"
                    }
                },
                {
                    "data": {
                        "term": "Quality control report",
                        "uri": "http://edamontology.org/data_3914"
                    }
                }
            ]
        }
    ],
    "homepage": "https://github.com/solelena/PSReliP",
    "language": [
        "Perl",
        "R",
        "Shell"
    ],
    "lastUpdate": "2023-09-04T17:55:08.574919Z",
    "license": "GPL-3.0",
    "name": "PSReliP",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-023-05169-4",
            "metadata": {
                "abstract": "Background: Population structure and cryptic relatedness between individuals (samples) are two major factors affecting false positives in genome-wide association studies (GWAS). In addition, population stratification and genetic relatedness in genomic selection in animal and plant breeding can affect prediction accuracy. The methods commonly used for solving these problems are principal component analysis (to adjust for population stratification) and marker-based kinship estimates (to correct for the confounding effects of genetic relatedness). Currently, many tools and software are available that analyze genetic variation among individuals to determine population structure and genetic relationships. However, none of these tools or pipelines perform such analyses in a single workflow and visualize all the various results in a single interactive web application. Results: We developed PSReliP, a standalone, freely available pipeline for the analysis and visualization of population structure and relatedness between individuals in a user-specified genetic variant dataset. The analysis stage of PSReliP is responsible for executing all steps of data filtering and analysis and contains an ordered sequence of commands from PLINK, a whole-genome association analysis toolset, along with in-house shell scripts and Perl programs that support data pipelining. The visualization stage is provided by Shiny apps, an R-based interactive web application. In this study, we describe the characteristics and features of PSReliP and demonstrate how it can be applied to real genome-wide genetic variant data. Conclusions: The PSReliP pipeline allows users to quickly analyze genetic variants such as single nucleotide polymorphisms and small insertions or deletions at the genome level to estimate population structure and cryptic relatedness using PLINK software and to visualize the analysis results in interactive tables, plots, and charts using Shiny technology. The analysis and assessment of population stratification and genetic relatedness can aid in choosing an appropriate approach for the statistical analysis of GWAS data and predictions in genomic selection. The various outputs from PLINK can be used for further downstream analysis. The code and manual for PSReliP are available at https://github.com/solelena/PSReliP.",
                "authors": [
                    {
                        "name": "Sakai H."
                    },
                    {
                        "name": "Solovieva E."
                    }
                ],
                "citationCount": 1,
                "date": "2023-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "PSReliP: an integrated pipeline for analysis and visualization of population structure and relatedness based on genome-wide genetic variant data"
            },
            "pmcid": "PMC10074814",
            "pmid": "37020193",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Desktop application",
        "Workflow"
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}
