{"credit":[{"email":"patryk.orzechowski@gmail.com","name":"Patryk Orzechowski","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"url":"http://bioconductor.org/packages/release/bioc/manuals/runibic/man/runibic.pdf"}],"download":[{"url":"http://bioconductor.org/packages/release/bioc/src/contrib/runibic_1.2.3.tar.gz"}],"function":[{"operation":[{"term":"Clustering","uri":"http://edamontology.org/operation_3432"}]}],"labels":{"collectionID":["BioConductor"],"cost":"Free of charge","language":["R"],"license":"MIT","operatingSystem":["Linux","Windows","Mac"],"toolType":["Library"],"topic":[{"term":"Gene expression","uri":"http://edamontology.org/topic_0203"},{"term":"Sequencing","uri":"http://edamontology.org/topic_3168"},{"term":"Microarray experiment","uri":"http://edamontology.org/topic_3518"}]},"link":[{"type":"MIRROR","url":"http://github.com/athril/runibic"},{"type":"ISSUE_TRACKER","url":"http://github.com/athril/runibic/issues"}],"publication":[{"abstract":"Biclustering algorithms, which aim to provide an effective and efficient way to analyze gene expression data by finding a group of genes with trend-preserving expression patterns under certain conditions, have been widely developed since Morgan et al. pioneered a work about partitioning a data matrix into submatrices with approximately constant values. However, the identification of general trend-preserving biclusters which are the most meaningful substructures hidden in gene expression data remains a highly challenging problem. We found an elementary method by which biologically meaningful trend-preserving biclusters can be readily identified from noisy and complex large data. The basic idea is to apply the longest common subsequence (LCS) framework to selected pairs of rows in an index matrix derived from an input data matrix to locate a seed for each bicluster to be identified. We tested it on synthetic and real datasets and compared its performance with currently competitive biclustering tools. We found that the new algorithm, named UniBic, outperformed all previous biclustering algorithms in terms of commonly used evaluation scenarios except for BicSPAM on narrow biclusters. The latter was somewhat better at finding narrow biclusters, the task for which it was specifically designed.","authors":["Wang Z.","Li G.","Robinson R.W.","Huang X."],"cit_count":13,"doi":"10.1038/srep23466","journal":"Scientific Reports","title":"UniBic: Sequential row-based biclustering algorithm for analysis of gene expression data","type":"Primary","year":"2016-03-22"},{"doi":"10.1101/210682","type":"Other"}],"summary":{"biotoolsCURIE":"biotools:runibic","biotoolsID":"runibic","description":"This package implements UbiBic algorithm in R. This biclustering algorithm for analysis of gene expression data was introduced by Zhenjia Wang et al. in 2016. It is currently considered the most promising biclustering method for identification of meaningful structures in complex and noisy data.","homepage":"http://bioconductor.org/packages/release/bioc/html/runibic.html","name":"runibic","version":["1.2.3"]}}