{
    "additionDate": "2021-01-18T09:15:58Z",
    "biotoolsCURIE": "biotools:puma-pathway",
    "biotoolsID": "puma-pathway",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "soha@cs.tufts.edu",
            "name": "Soha Hassoun",
            "orcidid": "https://orcid.org/0000-0001-9477-2199",
            "typeEntity": "Person"
        }
    ],
    "description": "Pathway-Activity Likelihood Analysis and Metabolite Annotation for Untargeted Metabolomics Using Probabilistic Modeling.\n\nTo interpret measurements, we present an inference based approach, termed Probabilistic modeling for Untargeted Metabolomics Analysis (PUMA).\n\nUntargeted metabolomics comprehensively characterizes small molecules and elucidates activities of biochemical pathways within a biological sample.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway analysis",
                    "uri": "http://edamontology.org/operation_3928"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "https://github.com/HassounLab/PUMA",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-30T14:05:14Z",
    "name": "PUMA",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3390/METABO10050183",
            "metadata": {
                "abstract": "© 2020 by the authors. Licensee MDPI, Basel, Switzerland.Motivation: Untargeted metabolomics comprehensively characterizes small molecules and elucidates activities of biochemical pathways within a biological sample. Despite computational advances, interpreting collected measurements and determining their biological role remains a challenge. Results: To interpret measurements, we present an inference-based approach, termed Probabilistic modeling for Untargeted Metabolomics Analysis (PUMA). Our approach captures metabolomics measurements and the biological network for the biological sample under study in a generative model and uses stochastic sampling to compute posterior probability distributions. PUMA predicts the likelihood of pathways being active, and then derives probabilistic annotations, which assign chemical identities to measurements. Unlike prior pathway analysis tools that analyze differentially active pathways, PUMA defines a pathway as active if the likelihood that the path generated the observed measurements is above a particular (user-defined) threshold. Due to the lack of “ground truth” metabolomics datasets, where all measurements are annotated and pathway activities are known, PUMA is validated on synthetic datasets that are designed to mimic cellular processes. PUMA, on average, outperforms pathway enrichment analysis by 8%. PUMA is applied to two case studies. PUMA suggests many biological meaningful pathways as active. Annotation results were in agreement to those obtained using other tools that utilize additional information in the form of spectral signatures. Importantly, PUMA annotates many measurements, suggesting 23 chemical identities for metabolites that were previously only identified as isomers, and a significant number of additional putative annotations over spectral database lookups. For an experimentally validated 50-compound dataset, annotations using PUMA yielded 0.833 precision and 0.676 recall.",
                "authors": [
                    {
                        "name": "Hosseini R."
                    },
                    {
                        "name": "Hassanpour N."
                    },
                    {
                        "name": "Liu L.-P."
                    },
                    {
                        "name": "Hassoun S."
                    }
                ],
                "citationCount": 1,
                "date": "2020-05-01T00:00:00Z",
                "journal": "Metabolites",
                "title": "Pathway-activity likelihood analysis and metabolite annotation for untargeted metabolomics using probabilistic modeling"
            },
            "pmcid": "PMC7281100",
            "pmid": "32375258"
        }
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        }
    ]
}