{
    "additionDate": "2021-01-18T11:14:04Z",
    "biotoolsCURIE": "biotools:bags-barcode",
    "biotoolsID": "bags-barcode",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "fcosta@bio.uminho.pt",
            "name": "Filipe O. Costa",
            "typeEntity": "Person"
        }
    ],
    "description": "BAGS is an automated barcode, audit and grade system for DNA barcode reference libraries.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA barcoding",
                    "uri": "http://edamontology.org/operation_3200"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "https://github.com/tadeu95/BAGS",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-29T21:13:22Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://bags.vm.ntnu.no"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/tadeu95/BAGs"
        }
    ],
    "name": "BAGS",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1111/1755-0998.13262",
            "metadata": {
                "abstract": "© 2020 John Wiley & Sons LtdBiodiversity studies greatly benefit from molecular tools, such as DNA metabarcoding, which provides an effective identification tool in biomonitoring and conservation programmes. The accuracy of species-level assignment, and consequent taxonomic coverage, relies on comprehensive DNA barcode reference libraries. The role of these libraries is to support species identification, but accidental errors in the generation of the barcodes may compromise their accuracy. Here, we present an R-based application, Barcode, Audit & Grade System (BAGS) (https://github.com/tadeu95/BAGS), that performs automated auditing and annotation of cytochrome c oxidase subunit I (COI) sequences libraries, for a given taxonomic group of animals, available in the Barcode of Life Data System (BOLD). This is followed by implementing a qualitative ranking system that assigns one of five grades (A to E) to each species in the reference library, according to the attributes of the data and congruency of species names with sequences clustered in barcode index numbers (BINs). Our goal is to allow researchers to obtain the most useful and reliable data, highlighting and segregating records according to their congruency. Different tests were performed to perceive its usefulness and limitations. BAGS fulfils a significant gap in the current landscape of DNA barcoding research tools by quickly screening reference libraries to gauge the congruence status of data and facilitate the triage of ambiguous data for posterior review. Thereby, BAGS has the potential to become a valuable addition in forthcoming DNA metabarcoding studies, in the long term contributing to globally improve the quality and reliability of the public reference libraries.",
                "authors": [
                    {
                        "name": "Fontes J.T."
                    },
                    {
                        "name": "Vieira P.E."
                    },
                    {
                        "name": "Ekrem T."
                    },
                    {
                        "name": "Soares P."
                    },
                    {
                        "name": "Costa F.O."
                    }
                ],
                "citationCount": 5,
                "date": "2021-02-01T00:00:00Z",
                "journal": "Molecular Ecology Resources",
                "title": "BAGS: An automated Barcode, Audit & Grade System for DNA barcode reference libraries"
            },
            "pmid": "33000878"
        }
    ],
    "topic": [
        {
            "term": "Biodiversity",
            "uri": "http://edamontology.org/topic_3050"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ]
}