{
    "accessibility": "Open access",
    "additionDate": "2022-08-01T16:46:53.770830Z",
    "biotoolsCURIE": "biotools:tps",
    "biotoolsID": "tps",
    "collectionID": [
        "PerMedCoE"
    ],
    "cost": "Free of charge",
    "description": "TPS is a tool for combining time series global phosphoproteomic data and protein-protein interaction networks to reconstruct the vast signaling pathways that control post-translational modifications.",
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/koksal/tps"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/koksal/tps",
    "language": [
        "Bash",
        "Python",
        "Scala"
    ],
    "lastUpdate": "2022-08-01T16:47:04.512212Z",
    "license": "MIT",
    "name": "TPS",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "tntiniak",
    "publication": [
        {
            "doi": "10.1016/j.celrep.2018.08.085",
            "metadata": {
                "abstract": "© 2018 The AuthorsWe present a method for automatically discovering signaling pathways from time-resolved phosphoproteomic data. The Temporal Pathway Synthesizer (TPS) algorithm uses constraint-solving techniques first developed in the context of formal verification to explore paths in an interaction network. It systematically eliminates all candidate structures for a signaling pathway where a protein is activated or inactivated before its upstream regulators. The algorithm can model more than one hundred thousand dynamic phosphosites and can discover pathway members that are not differentially phosphorylated. By analyzing temporal data, TPS defines signaling cascades without needing to experimentally perturb individual proteins. It recovers known pathways and proposes pathway connections when applied to the human epidermal growth factor and yeast osmotic stress responses. Independent kinase mutant studies validate predicted substrates in the TPS osmotic stress pathway. Köksal et al. present a computational technique, the temporal pathway synthesizer (TPS), that combines time series global phosphoproteomic data and protein-protein interaction networks to reconstruct the vast signaling pathways that control post-translational modifications.",
                "authors": [
                    {
                        "name": "Beck K."
                    },
                    {
                        "name": "Bodik R."
                    },
                    {
                        "name": "Camp N.D."
                    },
                    {
                        "name": "Cronin D.R."
                    },
                    {
                        "name": "Fisher J."
                    },
                    {
                        "name": "Fraenkel E."
                    },
                    {
                        "name": "Gitter A."
                    },
                    {
                        "name": "Koksal A.S."
                    },
                    {
                        "name": "MacGilvray M.E."
                    },
                    {
                        "name": "McKenna A."
                    },
                    {
                        "name": "Srivastava S."
                    },
                    {
                        "name": "Wolf-Yadlin A."
                    }
                ],
                "citationCount": 12,
                "date": "2018-09-25T00:00:00Z",
                "journal": "Cell Reports",
                "title": "Synthesizing Signaling Pathways from Temporal Phosphoproteomic Data"
            },
            "pmcid": "PMC6295338",
            "pmid": "30257219"
        }
    ],
    "toolType": [
        "Command-line tool"
    ]
}
