{
    "accessibility": "Open access",
    "additionDate": "2025-03-31T08:50:20.800385Z",
    "biotoolsCURIE": "biotools:csdr",
    "biotoolsID": "csdr",
    "cost": "Free of charge",
    "description": "Differential gene coexpression analysis based on the Conserved, Specific, and Differentiated (CSD) method",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://almaaslab.github.io/csdR/",
    "lastUpdate": "2025-03-31T09:00:57.202555Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/AlmaasLab/csdR"
        },
        {
            "type": [
                "Software catalogue"
            ],
            "url": "https://www.bioconductor.org/packages/release/bioc/html/csdR.html"
        }
    ],
    "maturity": "Mature",
    "name": "csdR",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "japet",
    "publication": [
        {
            "doi": "10.1186/s12859-022-04605-1",
            "metadata": {
                "abstract": "Background: Differential co-expression network analysis has become an important tool to gain understanding of biological phenotypes and diseases. The CSD algorithm is a method to generate differential co-expression networks by comparing gene co-expressions from two different conditions. Each of the gene pairs is assigned conserved (C), specific (S) and differentiated (D) scores based on the co-expression of the gene pair between the two conditions. The result of the procedure is a network where the nodes are genes and the links are the gene pairs with the highest C-, S-, and D-scores. However, the existing CSD-implementations suffer from poor computational performance, difficult user procedures and lack of documentation. Results: We created the R-package csdR aimed at reaching good performance together with ease of use, sufficient documentation, and with the ability to play well with other tools for data analysis. csdR was benchmarked on a realistic dataset with 20,645 genes. After verifying that the chosen number of iterations gave sufficient robustness, we tested the performance against the two existing CSD implementations. csdR was superior in performance to one of the implementations, whereas the other did not run. Our implementation can utilize multiple processing cores. However, we were unable to achieve more than ∼ 2.7 parallel speedup with saturation reached at about 10 cores. Conclusion: The results suggest that csdR is a useful tool for differential co-expression analysis and is able to generate robust results within a workday on datasets of realistic sizes when run on a workstation or compute server.",
                "authors": [
                    {
                        "name": "Almaas E."
                    },
                    {
                        "name": "Pettersen J.P."
                    }
                ],
                "citationCount": 3,
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "csdR, an R package for differential co-expression analysis"
            },
            "pmcid": "PMC8858518",
            "pmid": "35183100",
            "type": [
                "Method"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Functional genomics",
            "uri": "http://edamontology.org/topic_0085"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        }
    ]
}
