{
    "accessibility": "Open access",
    "additionDate": "2022-09-01T11:29:57.012150Z",
    "biotoolsCURIE": "biotools:symbiquant",
    "biotoolsID": "symbiquant",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "acwilson@miami.edu",
            "name": "Alex C. C. Wilson",
            "typeEntity": "Person"
        },
        {
            "email": "edward.james@miami.edu",
            "name": "Edward B. James",
            "typeEntity": "Person"
        },
        {
            "name": "Odelia Schwartz"
        },
        {
            "name": "Xu Pan"
        }
    ],
    "description": "A Machine Learning Object Detection Tool for Polyploid Independent Estimates of Endosymbiont Population Size.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Image annotation",
                    "uri": "http://edamontology.org/operation_3553"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/WilsonLabMiami/SymbiQuant",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-09-01T11:29:57.014556Z",
    "license": "Not licensed",
    "name": "SymbiQuant",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/FMICB.2022.816608",
            "metadata": {
                "abstract": "Copyright © 2022 James, Pan, Schwartz and Wilson.Quantifying the size of endosymbiont populations is challenging because endosymbionts are typically difficult or impossible to culture and commonly polyploid. Current approaches to estimating endosymbiont population sizes include quantitative PCR (qPCR) targeting endosymbiont genomic DNA and flow-cytometry. While qPCR captures genome copy number data, it does not capture the number of bacterial cells in polyploid endosymbiont populations. In contrast, flow cytometry can capture accurate estimates of whole host-level endosymbiont population size, but it is not readily able to capture data at the level of endosymbiotic host cells. To complement these existing approaches for estimating endosymbiont population size, we designed and implemented an object detection/segmentation tool for counting the number of endosymbiont cells in micrographs of host tissues. The tool, called SymbiQuant, which makes use of recent advances in deep neural networks includes a graphic user interface that allows for human curation of tool output. We trained SymbiQuant for use in the model aphid/Buchnera endosymbiosis and studied Buchnera population dynamics and phenotype over aphid postembryonic development. We show that SymbiQuant returns accurate counts of endosymbionts, and readily captures Buchnera phenotype. By replacing our training data with data composed of annotated microscopy images from other models of endosymbiosis, SymbiQuant has the potential for broad application. Our tool, which is available on GitHub, adds to the repertoire of methods researchers can use to study endosymbiosis at the organismal, genome, and now endosymbiotic host tissue or cell levels.",
                "authors": [
                    {
                        "name": "James E.B."
                    },
                    {
                        "name": "Pan X."
                    },
                    {
                        "name": "Schwartz O."
                    },
                    {
                        "name": "Wilson A.C.C."
                    }
                ],
                "date": "2022-05-19T00:00:00Z",
                "journal": "Frontiers in Microbiology",
                "title": "SymbiQuant: A Machine Learning Object Detection Tool for Polyploid Independent Estimates of Endosymbiont Population Size"
            },
            "pmcid": "PMC9160162",
            "pmid": "35663891"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Cytometry",
            "uri": "http://edamontology.org/topic_3934"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}
