{
    "additionDate": "2020-01-14T08:56:23Z",
    "biotoolsCURIE": "biotools:AGONOTES",
    "biotoolsID": "AGONOTES",
    "confidence_flag": "tool",
    "description": "A Robot Annotator for Argonaute Proteins.\n\nWelcome to AgoNotes home page! AGONOTES is an online service tool to identify Argonaute protein in proteins of all domains of life and annotate the argonaute domains. Users can submit any protein with fasta formation into the input field, or save proteins as a file ended with .faa, .fasta, .fa or .txt and then upload this file",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                }
            ]
        }
    ],
    "homepage": "http://i.uestc.edu.cn/agonotes/",
    "lastUpdate": "2020-12-01T15:42:40Z",
    "name": "AGONOTES",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/S12539-019-00349-4",
            "metadata": {
                "abstract": "© 2019, International Association of Scientists in the Interdisciplinary Areas.The argonaute protein (Ago) exists in almost all organisms. In eukaryotes, it functions as a regulatory system for gene expression. In prokaryotes, it is a type of defense system against foreign invasive genomes. The Ago system has been engineered for gene silencing and genome editing and plays an important role in biological studies. With an increasing number of genomes and proteomes of various microbes becoming available, computational tools for identifying and annotating argonaute proteins are urgently needed. We introduce AGONOTES (Argonaute Notes). It is a web service especially designed for identifying and annotating Ago. AGONOTES uses the BLASTP similarity search algorithm to categorize all submitted proteins into three groups: prokaryotic argonaute protein (pAgo), eukaryotic argonaute protein (eAgo), and non-argonaute protein (non-Ago). Argonaute proteins can then be aligned to the corresponding standard set of Ago sequences using the multiple sequence alignment program MUSCLE. All functional domains of Ago can further be curated from the alignment results and visualized easily through Bio::Graphic modules in the BioPerl bundle. Compared with existing tools such as CD-Search and available databases such as UniProt and AGONOTES showed a much better performance on domain annotations, which is fundamental in studying the new Ago. AGONOTES can be freely accessed at http://i.uestc.edu.cn/agonotes/. AGONOTES is a friendly tool for annotating Ago domains from a proteome or a series of protein sequences.",
                "authors": [
                    {
                        "name": "Jiang L."
                    },
                    {
                        "name": "Yu M."
                    },
                    {
                        "name": "Zhou Y."
                    },
                    {
                        "name": "Tang Z."
                    },
                    {
                        "name": "Li N."
                    },
                    {
                        "name": "Kang J."
                    },
                    {
                        "name": "He B."
                    },
                    {
                        "name": "Huang J."
                    }
                ],
                "citationCount": 1,
                "date": "2020-03-01T00:00:00Z",
                "journal": "Interdisciplinary Sciences: Computational Life Sciences",
                "title": "AGONOTES: A Robot Annotator for Argonaute Proteins"
            },
            "pmid": "31741225"
        }
    ],
    "topic": [
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Genetic engineering",
            "uri": "http://edamontology.org/topic_3912"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}