{
    "additionDate": "2021-12-06T11:35:07.330164Z",
    "biotoolsCURIE": "biotools:somatosim",
    "biotoolsID": "somatosim",
    "collectionID": [
        "Rare Disease"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "celine.hong@nih.gov",
            "name": "Celine S. Hong",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "SomatoSim is a tool that simulates single nucleotide variants at any variant allele fraction and depth of coverage. SomatoSim takes an analysis ready BAM file as input and SomatoSim outputs a BAM file containing simulated variants. Use SomatoSim to evaluate variant calling tools, algorithms, and pipelines.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BieseckerLab/SomatoSim",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-01-17T12:01:06.050422Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/BieseckerLab/SomatoSim/issues"
        }
    ],
    "name": "SomatoSim",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04024-8",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Somatic single nucleotide variants have gained increased attention because of their role in cancer development and the widespread use of high-throughput sequencing techniques. The necessity to accurately identify these variants in sequencing data has led to a proliferation of somatic variant calling tools. Additionally, the use of simulated data to assess the performance of these tools has become common practice, as there is no gold standard dataset for benchmarking performance. However, many existing somatic variant simulation tools are limited because they rely on generating entirely synthetic reads derived from a reference genome or because they do not allow for the precise customizability that would enable a more focused understanding of single nucleotide variant calling performance. Results: SomatoSim is a tool that lets users simulate somatic single nucleotide variants in sequence alignment map (SAM/BAM) files with full control of the specific variant positions, number of variants, variant allele fractions, depth of coverage, read quality, and base quality, among other parameters. SomatoSim accomplishes this through a three-stage process: variant selection, where candidate positions are selected for simulation, variant simulation, where reads are selected and mutated, and variant evaluation, where SomatoSim summarizes the simulation results. Conclusions: SomatoSim is a user-friendly tool that offers a high level of customizability for simulating somatic single nucleotide variants. SomatoSim is available at https://github.com/BieseckerLab/SomatoSim.",
                "authors": [
                    {
                        "name": "Hawari M.A."
                    },
                    {
                        "name": "Hong C.S."
                    },
                    {
                        "name": "Biesecker L.G."
                    }
                ],
                "citationCount": 1,
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SomatoSim: precision simulation of somatic single nucleotide variants"
            },
            "pmcid": "PMC7936459",
            "pmid": "33676403",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ]
}