{
    "name": "QuPE", 
    "description": "Web application to support the analysis and integration of even complex mass spectrometry-based proteomics experiments. It guides through the process of protein identification, quantification and statistical evaluation of multivariate experimental setups featuring data visualization and normalization methods, significance tests, PCA and cluster analysis. It provides various methods for the calculation of protein abundance ratios from metabolically stable-isotope labeled samples.", 
    "homepage": "https://qupe.cebitec.uni-bielefeld.de", 
    "biotoolsID": "qupe", 
    "biotoolsCURIE": "biotools:qupe", 
    "version": [
        "1.0"
    ], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0313", 
                    "term": "Gene expression clustering"
                }, 
                {
                    "uri": "http://edamontology.org/operation_3214", 
                    "term": "Spectral analysis"
                }, 
                {
                    "uri": "http://edamontology.org/operation_2495", 
                    "term": "Gene expression analysis"
                }, 
                {
                    "uri": "http://edamontology.org/operation_2238", 
                    "term": "Statistical calculation"
                }
            ], 
            "input": [
                {
                    "data": {
                        "uri": "http://edamontology.org/data_2536", 
                        "term": "Mass spectrometry data"
                    }, 
                    "format": [
                        {
                            "uri": "http://edamontology.org/format_3244", 
                            "term": "mzML"
                        }, 
                        {
                            "uri": "http://edamontology.org/format_3245", 
                            "term": "Mass spectrometry data format"
                        }
                    ]
                }
            ], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Workbench"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0121", 
            "term": "Proteomics"
        }, 
        {
            "uri": "http://edamontology.org/topic_3520", 
            "term": "Proteomics experiment"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "Java"
    ], 
    "license": "GPL-2.0", 
    "collectionID": [
        "de.NBI", 
        "de.NBI-BiGi", 
        "Proteomics"
    ], 
    "maturity": "Mature", 
    "cost": "Free of charge", 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "http://www.cebitec.uni-bielefeld.de/brf/index.php/qupe", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btp568", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "Qupe-A rich internet application to take a step forward in the analysis of mass spectrometry-based quantitative proteomics experiments", 
                "abstract": "Motivation: The goal of present -omics sciences is to understand biological systems as a whole in terms of interactions of the individual cellular components. One of the main building blocks in this field of study is proteomics where tandem mass spectrometry (LC-MS/MS) in combination with isotopic labelling techniques provides a common way to obtain a direct insight into regulation at the protein level. Methods to identify and quantify the peptides contained in a sample are well established, and their output usually results in lists of identified proteins and calculated relative abundance values. The next step is to move ahead from these abstract lists and apply statistical inference methods to compare measurements, to identify genes that are significantly up- or down-regulated, or to detect clusters of proteins with similar expression profiles. Results: We introduce the Rich Internet Application (RIA) Qupe providing comprehensive data management and analysis functions for LC-MS/MS experiments. Starting with the import of mass spectra data the system guides the experimenter through the process of protein identification by database search, the calculation of protein abundance ratios, and in particular, the statistical evaluation of the quantification results including multivariate analysis methods such as analysis of variance or hierarchical cluster analysis. While a data model to store these results has been developed, a well-defined programming interface facilitates the integration of novel approaches. A compute cluster is utilized to distribute computationally intensive calculations, and a web service allows to interchange information with other -omics software applications. To demonstrate that Qupe represents a step forward in quantitative proteomics analysis an application study on Corynebacterium glutamicum has been carried out. © The Author 2009. Published by Oxford University Press.", 
                "date": "2009-10-06T00:00:00Z", 
                "citationCount": 20, 
                "authors": [
                    {
                        "name": "Albaum S.P."
                    }, 
                    {
                        "name": "Neuweger H."
                    }, 
                    {
                        "name": "Franzel B."
                    }, 
                    {
                        "name": "Lange S."
                    }, 
                    {
                        "name": "Mertens D."
                    }, 
                    {
                        "name": "Trotschel C."
                    }, 
                    {
                        "name": "Wolters D."
                    }, 
                    {
                        "name": "Kalinowski J."
                    }, 
                    {
                        "name": "Nattkemper T.W."
                    }, 
                    {
                        "name": "Goesmann A."
                    }
                ], 
                "journal": "Bioinformatics"
            }
        }, 
        {
            "doi": "10.1074/mcp.M111.014134", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Other", 
            "version": null, 
            "metadata": {
                "title": "Protein turnover quantification in a multilabeling approach: From data calculation to evaluation", 
                "abstract": "Liquid chromatography coupled to tandem mass spectrometry in combination with stable-isotope labeling is an established and widely spread method to measure gene expression on the protein level. However, it is often not considered that two opposing processes are responsible for the amount of a protein in a cell - the synthesis as well as the degradation. With this work, we provide an integrative, high-throughput method - from the experimental setup to the bioinformatics analysis - to measure synthesis and degradation rates of an organism's proteome. Applicability of the approach is demonstrated with an investigation of heat shock response, a well-understood regulatory mechanism in bacteria, on the biotechnologically relevant Corynebacterium glutamicum. Utilizing a multilabeling approach using both heavy stable nitrogen as well as carbon isotopes cells are metabolically labeled in a pulse-chase experiment to trace the labels' incorporation in newly synthesized proteins and its loss during protein degradation. Our work aims not only at the calculation of protein turnover rates but also at their statistical evaluation, including variance and hierarchical cluster analysis using the rich internet application QuPE. © 2012 by The American Society for Biochemistry and Molecular Biology, Inc.", 
                "date": "2012-08-01T00:00:00Z", 
                "citationCount": 14, 
                "authors": [
                    {
                        "name": "Trotschel C."
                    }, 
                    {
                        "name": "Albaum S.P."
                    }, 
                    {
                        "name": "Wolff D."
                    }, 
                    {
                        "name": "Schrod S."
                    }, 
                    {
                        "name": "Goesmanns A."
                    }, 
                    {
                        "name": "Nattkemper T.W."
                    }, 
                    {
                        "name": "Poetsch A."
                    }
                ], 
                "journal": "Molecular and Cellular Proteomics"
            }
        }
    ], 
    "credit": [
        {
            "name": "Bielefeld University", 
            "email": null, 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Institute", 
            "typeRole": [
                "Provider"
            ], 
            "note": null
        }, 
        {
            "name": "CeBiTec", 
            "email": null, 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Institute", 
            "typeRole": [
                "Provider"
            ], 
            "note": null
        }, 
        {
            "name": "bigi", 
            "email": null, 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Institute", 
            "typeRole": [
                "Provider"
            ], 
            "note": null
        }, 
        {
            "name": null, 
            "email": "qupe-service@cebitec.uni-bielefeld.de", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }, 
        {
            "name": null, 
            "email": null, 
            "url": "http://www.cebitec.uni-bielefeld.de/brf/index.php/qupe", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "bigi", 
    "additionDate": "2016-02-16T16:29:43Z", 
    "lastUpdate": "2019-03-26T08:36:46Z", 
    "editPermission": {
        "type": "group", 
        "authors": [
            "proteomics.bio.tools"
        ]
    }, 
    "validated": 0, 
    "homepage_status": 0, 
    "elixir_badge": 0
}