{
    "additionDate": "2021-01-20T10:55:43Z",
    "biotoolsCURIE": "biotools:trapd",
    "biotoolsID": "trapd",
    "collectionID": [
        "Rare Disease"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mlippincott@mgh.harvard.edu",
            "name": "Margaret F. Lippincott",
            "typeEntity": "Person"
        }
    ],
    "description": "Burden Testing of Rare Variants Identified through Exome Sequencing via Publicly Available Control Data.\n\nFinding genes associated with Mendelian disorders can often be challenging.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Variant filtering",
                    "uri": "http://edamontology.org/operation_3675"
                },
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                }
            ]
        }
    ],
    "homepage": "https://github.com/mhguo1/TRAPD",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2021-05-21T06:28:20.944563Z",
    "license": "MIT",
    "name": "TRAPD",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/J.AJHG.2018.08.016",
            "metadata": {
                "abstract": "© 2018 American Society of Human GeneticsThe genetic causes of many Mendelian disorders remain undefined. Factors such as lack of large multiplex families, locus heterogeneity, and incomplete penetrance hamper these efforts for many disorders. Previous work suggests that gene-based burden testing—where the aggregate burden of rare, protein-altering variants in each gene is compared between case and control subjects—might overcome some of these limitations. The increasing availability of large-scale public sequencing databases such as Genome Aggregation Database (gnomAD) can enable burden testing using these databases as controls, obviating the need for additional control sequencing for each study. However, there exist various challenges with using public databases as controls, including lack of individual-level data, differences in ancestry, and differences in sequencing platforms and data processing. To illustrate the approach of using public data as controls, we analyzed whole-exome sequencing data from 393 individuals with idiopathic hypogonadotropic hypogonadism (IHH), a rare disorder with significant locus heterogeneity and incomplete penetrance against control subjects from gnomAD (n = 123,136). We leveraged presumably benign synonymous variants to calibrate our approach. Through iterative analyses, we systematically addressed and overcame various sources of artifact that can arise when using public control data. In particular, we introduce an approach for highly adaptable variant quality filtering that leads to well-calibrated results. Our approach “re-discovered” genes previously implicated in IHH (FGFR1, TACR3, GNRHR). Furthermore, we identified a significant burden in TYRO3, a gene implicated in hypogonadotropic hypogonadism in mice. Finally, we developed a user-friendly software package TRAPD (Test Rare vAriants with Public Data) for performing gene-based burden testing against public databases.",
                "authors": [
                    {
                        "name": "Guo M.H."
                    },
                    {
                        "name": "Plummer L."
                    },
                    {
                        "name": "Chan Y.-M."
                    },
                    {
                        "name": "Hirschhorn J.N."
                    },
                    {
                        "name": "Lippincott M.F."
                    }
                ],
                "citationCount": 34,
                "date": "2018-10-04T00:00:00Z",
                "journal": "American Journal of Human Genetics",
                "title": "Burden Testing of Rare Variants Identified through Exome Sequencing via Publicly Available Control Data"
            },
            "pmcid": "PMC6174288",
            "pmid": "30269813"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        }
    ]
}