{
    "accessibility": "Open access",
    "additionDate": "2022-08-28T21:49:11.594085Z",
    "biotoolsCURIE": "biotools:iprom-zea",
    "biotoolsID": "iprom-zea",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Hilal Tayara"
        },
        {
            "name": "Jeehong Kim"
        },
        {
            "name": "Muhammad Shujaat"
        }
    ],
    "description": "A two-layer model to identify plant promoters and their types using convolutional neural network.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Nucleic acid sequence",
                        "uri": "http://edamontology.org/data_2977"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Promoter prediction",
                    "uri": "http://edamontology.org/operation_0440"
                },
                {
                    "term": "cis-regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0441"
                }
            ]
        }
    ],
    "homepage": "http://nsclbio.jbnu.ac.kr/tools/iProm-Zea/",
    "lastUpdate": "2022-08-28T21:49:11.597035Z",
    "name": "iProm-Zea",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.YGENO.2022.110384",
            "metadata": {
                "abstract": "© 2022A promoter is a short DNA sequence near the start codon, responsible for initiating the transcription of a specific gene in the genome. The accurate recognition of promoters is important for achieving a better understanding of transcriptional regulation. Because of their importance in the process of biological transcriptional regulation, there is an urgent need to develop in silico tools to identify promoters and their types in a timely and accurate manner. A number of prediction methods have been developed in this regard; however, almost all of them are merely used for identifying promoters and their strength or sigma types. The TATA box region in TATA promoter influences the post-transcriptional processes; therefore, in the current study, we developed a two-layer predictor called “iProm-Zea” using the convolutional neural network (CNN) for identify TATA and TATA less promoters. The first layer can be used to identify a given DNA sequence as a promoter or non-promoter. The second layer can be used to identify whether the recognized promoter is the TATA promoter. To find an optimal feature encoding scheme and model, we employed four feature encoding schemes on different machine learning and CNN algorithms, and based on the evaluation results, we selected a one-hot encoding scheme and a CNN model for iProm-Zea. The 5-fold cross validation testing results demonstrated that the constructed predictor showed great potential for identifying promoters and classifying them as TATA and TATA less promoters. Furthermore, we performed cross-species analysis of iProm-Zea to evaluate its performance in other species. Moreover, to make it easier for other experimental scientists to obtain the results they need, we established a freely accessible and user-friendly web server at http://nsclbio.jbnu.ac.kr/tools/iProm-Zea/.",
                "authors": [
                    {
                        "name": "Kim J."
                    },
                    {
                        "name": "Shujaat M."
                    },
                    {
                        "name": "Tayara H."
                    }
                ],
                "citationCount": 1,
                "date": "2022-05-01T00:00:00Z",
                "journal": "Genomics",
                "title": "iProm-Zea: A two-layer model to identify plant promoters and their types using convolutional neural network"
            },
            "pmid": "35533969"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
