{
    "name": "5_ORF_Extender", 
    "description": "'5'_ORF_Extender' is a tool that can perform a systematic identification of extended coding regions (CDS) at the 5´ end of known mRNAs, using an EST-based approach.", 
    "homepage": "http://apollo11.isto.unibo.it/software/5'_ORF_Extender/5'_ORF_Extender_2.0/", 
    "biotoolsID": "5_ORF_Extender", 
    "biotoolsCURIE": "biotools:5_ORF_Extender", 
    "version": [
        "2.0.1"
    ], 
    "otherID": [], 
    "relation": [], 
    "function": [], 
    "toolType": [
        "Desktop application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3512", 
            "term": "Gene transcripts"
        }
    ], 
    "operatingSystem": [
        "Windows", 
        "Mac"
    ], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [
        {
            "url": "http://apollo11.isto.unibo.it/software/5'_ORF_Extender/5'_ORF_Extender_2.0/mouse/", 
            "type": "Downloads page", 
            "note": null, 
            "version": null
        }
    ], 
    "documentation": [
        {
            "url": "http://apollo11.isto.unibo.it/software/5'_ORF_Extender/5'_ORF_Extender_2.0/mouse/Tutorial/5'_ORF_Extender_2_Tutorial.html", 
            "type": "Tutorial", 
            "note": "The software can be used for all the species with data available, not only mouse"
        }
    ], 
    "publication": [
        {
            "doi": "10.1007/s00335-013-9498-3", 
            "pmid": "24504701", 
            "pmcid": null, 
            "type": "Primary", 
            "version": "2.0.1", 
            "metadata": {
                "title": "Improving mRNA 5′ coding sequence determination in the mouse genome", 
                "abstract": "The incomplete determination of the mRNA 5′ end sequence may lead to the incorrect assignment of the first AUG codon and to errors in the prediction of the encoded protein product. Due to the significance of the mouse as a model organism in biomedical research, we performed a systematic identification of coding regions at the 5′ end of all known mouse mRNAs, using an automated expressed sequence tag (EST)-based approach which we have previously described. By parsing almost 4 million BLAT alignments we found 351 mouse loci, out of 20,221 analyzed, in which an extension of the mRNA 5′ coding region was identified. Proof-of-concept confirmation was obtained by in vitro cloning and sequencing for Apc2 and Mknk2 cDNAs. We also generated a list of 16,330 mouse mRNAs where the presence of an in-frame stop codon upstream of the known start codon indicates completeness of the coding sequence at 5′ end in the current form. Systematic searches in the main mouse genome databases and genome browsers showed that 82 % of our results are original and have not been identified by their annotation pipelines. Moreover, the same information is not easily derivable from RNA-Seq data, due to short sequence length and laboriousness in building full-length transcript structures. In conclusion, our results improve the determination of full-length 5′ coding sequences and might be useful in order to reduce errors when studying mouse gene structure and function in biomedical research. © 2014 Springer Science+Business Media.", 
                "date": "2014-01-01T00:00:00Z", 
                "citationCount": 4, 
                "authors": [
                    {
                        "name": "Piovesan A."
                    }, 
                    {
                        "name": "Caracausi M."
                    }, 
                    {
                        "name": "Pelleri M.C."
                    }, 
                    {
                        "name": "Vitale L."
                    }, 
                    {
                        "name": "Martini S."
                    }, 
                    {
                        "name": "Bassani C."
                    }, 
                    {
                        "name": "Gurioli A."
                    }, 
                    {
                        "name": "Casadei R."
                    }, 
                    {
                        "name": "Solda G."
                    }, 
                    {
                        "name": "Strippoli P."
                    }
                ], 
                "journal": "Mammalian Genome"
            }
        }, 
        {
            "doi": "10.1016/j.ygeno.2012.05.012", 
            "pmid": "22659028", 
            "pmcid": null, 
            "type": "Method", 
            "version": "2.0", 
            "metadata": {
                "title": "Genome-scale analysis of human mRNA 5' coding sequences based on expressed sequence tag (EST) database", 
                "abstract": "The \"5' end mRNA artifact\" issue refers to the incorrect assignment of the first AUG codon in an mRNA, due to the incomplete determination of its 5' end sequence. We performed a systematic identification of coding regions at the 5' end of all human known mRNAs, using an automated expressed sequence tag (EST)-based approach. Following parsing of more than 7. million BLAT alignments, we found 477 human loci, out of 18,665 analyzed, in which an extension of the mRNA 5' coding region was identified. Proof-of-concept confirmation was obtained by in vitro cloning and sequencing for GNB2L1, QARS and TDP2 cDNAs, and the consequences for the functional studies of these loci are discussed. We also generated a list of 20,775 human mRNAs where the presence of an in-frame stop codon upstream of the known start codon indicates completeness of the coding sequence at 5' in the current form. © 2012 Elsevier Inc.", 
                "date": "2012-08-01T00:00:00Z", 
                "citationCount": 11, 
                "authors": [
                    {
                        "name": "Casadei R."
                    }, 
                    {
                        "name": "Piovesan A."
                    }, 
                    {
                        "name": "Vitale L."
                    }, 
                    {
                        "name": "Facchin F."
                    }, 
                    {
                        "name": "Pelleri M.C."
                    }, 
                    {
                        "name": "Canaider S."
                    }, 
                    {
                        "name": "Bianconi E."
                    }, 
                    {
                        "name": "Frabetti F."
                    }, 
                    {
                        "name": "Strippoli P."
                    }
                ], 
                "journal": "Genomics"
            }
        }, 
        {
            "doi": "10.3892/ijmm.2017.2942", 
            "pmid": "28393177", 
            "pmcid": null, 
            "type": "Review", 
            "version": null, 
            "metadata": {
                "title": "Difficulty in obtaining the complete mRNA coding sequence at 5' region (5' end mRNA artifact): Causes, consequences in biology and medicine and possible solutions for obtaining the actual amino acid sequence of proteins (Review)", 
                "abstract": "The known difficulty in obtaining the actual full length, complete sequence of a messenger RNA (mRNA) may lead to the erroneous determination of its coding sequence at the 5' region (5' end mRNA artifact), and consequently to the wrong assignment of the translation start codon, leading to the inaccurate prediction of the encoded polypeptide at its amino terminus. Among the known human genes whose study was affected by this artifact, we can include disco interacting protein 2 homolog A (DIP2A; KIAA0184), Down syndrome critical region 1 (DSCR1), SON DNA binding protein (SON), trefoil factor 3 (TFF3) and URB1 ribosome biogenesis 1 homolog (URB1; KIAA0539) on chromosome 21, as well as receptor for activated C kinase 1 (RACK1, also known as GNB2L1), glutaminyl-tRNA synthetase (QARS) and tyrosyl-DNA phosphodiesterase 2 (TDP2) along with another 474 loci, including interleukin 16 (IL16). In this review, we discuss the causes of this issue, its quantitative incidence in biomedical research, the consequences in biology and medicine, and the possible solutions for obtaining the actual amino acid sequence of proteins in the post-genomics era.", 
                "date": "2017-05-01T00:00:00Z", 
                "citationCount": 2, 
                "authors": [
                    {
                        "name": "Vitale L."
                    }, 
                    {
                        "name": "Caracausi M."
                    }, 
                    {
                        "name": "Casadei R."
                    }, 
                    {
                        "name": "Pelleri M.C."
                    }, 
                    {
                        "name": "Piovesan A."
                    }
                ], 
                "journal": "International Journal of Molecular Medicine"
            }
        }
    ], 
    "credit": [], 
    "owner": "allison.piovesan2", 
    "additionDate": "2019-07-26T16:22:11Z", 
    "lastUpdate": "2019-07-26T16:35:29Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 0, 
    "homepage_status": 0, 
    "elixir_badge": 0
}