{
    "additionDate": "2017-01-13T13:16:06Z",
    "biotoolsCURIE": "biotools:reptile",
    "biotoolsID": "reptile",
    "credit": [
        {
            "email": "xiaoyang@broadinstitute.org",
            "name": "Xiao Yang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A new algorithm for short read error correction that harvests information from k-spectrum and read decomposition.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequencing quality control",
                    "uri": "http://edamontology.org/operation_3218"
                }
            ]
        }
    ],
    "homepage": "http://aluru-sun.ece.iastate.edu/doku.php?id=reptile",
    "homepage_status": 1,
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:54Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "Reptile",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btq468",
            "metadata": {
                "abstract": "Motivation: Error correction is critical to the success of next-generation sequencing applications, such as resequencing and de novo genome sequencing. It is especially important for high-throughput short-read sequencing, where reads are much shorter and more abundant, and errors more frequent than in traditional Sanger sequencing. Processing massive numbers of short reads with existing error correction methods is both compute and memory intensive, yet the results are far from satisfactory when applied to real datasets. Results: We present a novel approach, termed Reptile, for error correction in short-read data from next-generation sequencing. Reptile works with the spectrum of k-mers from the input reads, and corrects errors by simultaneously examining: (i) Hamming distance-based correction possibilities for potentially erroneous k-mers; and (ii) neighboring k-mers from the same read for correct contextual information. By not needing to store input data, Reptile has the favorable property that it can handle data that does not fit in main memory. In addition to sequence data, Reptile can make use of available quality score information. Our experiments show that Reptile outperforms previous methods in the percentage of errors removed from the data and the accuracy in true base assignment. In addition, a significant reduction in run time and memory usage have been achieved compared with previous methods, making it more practical for short-read error correction when sampling larger genomes. © The Author 2010. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Yang X."
                    },
                    {
                        "name": "Dorman K.S."
                    },
                    {
                        "name": "Aluru S."
                    }
                ],
                "citationCount": 97,
                "date": "2010-08-16T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Reptile: Representative tiling for short read error correction"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1
}