{
    "additionDate": "2019-11-14T18:37:32Z",
    "biotoolsCURIE": "biotools:clusterProfile",
    "biotoolsID": "clusterProfile",
    "confidence_flag": "low",
    "credit": [
        {
            "email": "biny_ali@126.com",
            "name": "Libin An",
            "typeEntity": "Person"
        }
    ],
    "description": "> LOW CONFIDENCE! | > COMMON LINK WITH (PUB. & NAME DIFFERENT) bio.tools/clusterprofiler (BIOCONDUCTOR.ORG/packages/release/bioc/html/clusterProfiler.html) | > CORRECT NAME OF TOOL COULD ALSO BE 'pheatmap' (bio.tools/pheatmap), 'limma' (bio.tools/limma), 'injury treadmill', 'treadmill' | MAP‑1B, PACS‑2 and AHCYL1 are regulated by miR‑34A/B/C and miR‑449 in neuroplasticity following traumatic spinal cord injury in rats | statistical analysis and visualization of functional profiles for genes and gene clusters | This package implements methods to analyze and visualize functional profiles (GO and KEGG) of gene and gene clusters | Annotation, Clustering, GO, GeneSetEnrichment, KEGG, MultipleComparison, Pathways, Reactome, Software, Visualization",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Pathway or network comparison",
                    "uri": "http://edamontology.org/operation_0277"
                },
                {
                    "term": "Expression profile clustering",
                    "uri": "http://edamontology.org/operation_0313"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/clusterProfiler.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-11-14T18:37:32Z",
    "license": "Artistic-2.0",
    "name": "clusterProfile",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3892/MMR.2019.10538",
            "metadata": {
                "abstract": "© 2019 Spandidos Publications. All rights reserved.Spinal cord injury (SCI) is a specific type of damage to the central nervous system causing temporary or permanent changes in its function. The present aimed to identify the genetic changes in neuroplasticity following SCI in rats. The GSE52763 microarray dataset, which included 15 samples [3 sham (1 week), 4 injury only (1 week), 4 injury only (3 weeks), 4 injury + treadmill (3 weeks)] was downloaded from the Gene Expression Omnibus database. An empirical Bayes linear regression model in limma package was used to identify the differentially expressed genes (DEGs) in injury vs. sham and treadmill vs. non‑treadmill comparison groups. Subsequently, time series and enrichment analyses were performed using pheatmap and clusterProfile packages, respectively. Additionally, protein‑protein interaction (PPI) and transcription factor (TF)‑microRNA (miRNA)‑target regulatory networks were constructed using Cytoscape software. In total, 159 and 105 DEGs were identified in injury vs. sham groups and treadmill vs. non‑treadmill groups, respectively. There were 40 genes in cluster 1 that presented increased expression levels in the injury (1 week/3 weeks) groups compared with the sham group, and decreased expression levels in the injury + treadmill group compared with the injury only groups; conversely, 52 genes in cluster 2 exhibited decreased expression levels in the injury (1 week/3 weeks) groups compared with the sham group, and increased expression levels in the injury + treadmill group compared with the injury only groups. Enrichment analysis indicated that clusters 1 and 2 were associated with immune response and signal transduction, respectively. Furthermore, microtubule associated protein 1B, phosphofurin acidic cluster sorting protein 2 and adenosylhomocysteinase‑like 1 exhibited the highest degrees in the regulatory network, and were regulated by miRNAs including miR‑34A, miR‑34B, miR‑34C and miR‑449. These miRNAs and their target genes may serve important roles in neuroplasticity following traumatic SCI in rats. Nevertheless, additional in‑depth studies are required to confirm these data.",
                "authors": [
                    {
                        "name": "Cao H."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Chu Z."
                    },
                    {
                        "name": "Zhao B."
                    },
                    {
                        "name": "Wang H."
                    },
                    {
                        "name": "An L."
                    }
                ],
                "citationCount": 1,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Molecular Medicine Reports",
                "title": "MAP‑1B, PACS‑2 and AHCYL1 are regulated by miR‑34A/B/C and miR‑449 in neuroplasticity following traumatic spinal cord injury in rats: Preliminary explorative results from microarray data"
            },
            "pmcid": "PMC6755151",
            "pmid": "31432119"
        }
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ]
}