{
    "accessibility": "Open access",
    "additionDate": "2022-10-19T19:05:35.531372Z",
    "biotoolsCURIE": "biotools:highdicom",
    "biotoolsID": "highdicom",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "mdherrmann@mgh.harvard.edu",
            "name": "Markus D. Herrmann"
        },
        {
            "name": "Jayashree Kalpathy-Cramer"
        },
        {
            "name": "Christopher P. Bridge",
            "orcidid": "http://orcid.org/0000-0002-2242-351X"
        }
    ],
    "description": "A library that provides high-level DICOM abstractions for the Python programming language to facilitate the creation and handling of DICOM objects for image-derived information, including image annotations, and image analysis results.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://highdicom.readthedocs.io/en/latest/"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Image annotation",
                    "uri": "http://edamontology.org/operation_3553"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                }
            ]
        }
    ],
    "homepage": "https://github.com/herrmannlab/highdicom",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-10-19T19:05:35.534011Z",
    "license": "MIT",
    "name": "highdicom",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1007/S10278-022-00683-Y",
            "metadata": {
                "abstract": "© 2022, The Author(s).Machine learning (ML) is revolutionizing image-based diagnostics in pathology and radiology. ML models have shown promising results in research settings, but the lack of interoperability between ML systems and enterprise medical imaging systems has been a major barrier for clinical integration and evaluation. The DICOM® standard specifies information object definitions (IODs) and services for the representation and communication of digital images and related information, including image-derived annotations and analysis results. However, the complexity of the standard represents an obstacle for its adoption in the ML community and creates a need for software libraries and tools that simplify working with datasets in DICOM format. Here we present the highdicom library, which provides a high-level application programming interface (API) for the Python programming language that abstracts low-level details of the standard and enables encoding and decoding of image-derived information in DICOM format in a few lines of Python code. The highdicom library leverages NumPy arrays for efficient data representation and ties into the extensive Python ecosystem for image processing and machine learning. Simultaneously, by simplifying creation and parsing of DICOM-compliant files, highdicom achieves interoperability with the medical imaging systems that hold the data used to train and run ML models, and ultimately communicate and store model outputs for clinical use. We demonstrate through experiments with slide microscopy and computed tomography imaging, that, by bridging these two ecosystems, highdicom enables developers and researchers to train and evaluate state-of-the-art ML models in pathology and radiology while remaining compliant with the DICOM standard and interoperable with clinical systems at all stages. To promote standardization of ML research and streamline the ML model development and deployment process, we made the library available free and open-source at https://github.com/herrmannlab/highdicom.",
                "authors": [
                    {
                        "name": "Bridge C.P."
                    },
                    {
                        "name": "Clunie D.A."
                    },
                    {
                        "name": "Doyle S.W."
                    },
                    {
                        "name": "Fedorov A.Y."
                    },
                    {
                        "name": "Gorman C."
                    },
                    {
                        "name": "Herrmann M.D."
                    },
                    {
                        "name": "Kalpathy-Cramer J."
                    },
                    {
                        "name": "Lennerz J.K."
                    },
                    {
                        "name": "Pieper S."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Journal of Digital Imaging",
                "title": "Highdicom: a Python Library for Standardized Encoding of Image Annotations and Machine Learning Model Outputs in Pathology and Radiology"
            },
            "pmid": "35995898"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ],
    "validated": 1
}
