{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.cbrc.jp/~asai/"}],"documentation":[{"type":"GENERAL","url":"https://academic.oup.com/bioinformatics/article/29/1/119/273243"}],"function":[{"operation":[{"term":"Sequence assembly","uri":"http://edamontology.org/operation_0310"}]}],"labels":{"language":["C"],"operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"Sequence assembly","uri":"http://edamontology.org/topic_0196"},{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"},{"term":"Genomics","uri":"http://edamontology.org/topic_0622"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/pbsim-1-0-3-pacbio-reads-simulator.html"}],"publication":[{"abstract":"Motivation: PacBio sequencers produce two types of characteristic reads (continuous long reads: long and high error rate and circular consensus sequencing: short and low error rate), both of which could be useful for de novo assembly of genomes. Currently, there is no available simulator that targets the specific generation of PacBio libraries.Results: Our analysis of 13 PacBio datasets showed characteristic features of PacBio reads (e.g. the read length of PacBio reads follows a log-normal distribution). We have developed a read simulator, PBSIM, that captures these features using either a model-based or sampling-based method. Using PBSIM, we conducted several hybrid error correction and assembly tests for PacBio reads, suggesting that a continuous long reads coverage depth of at least 15 in combination with a circular consensus sequencing coverage depth of at least 30 achieved extensive assembly results. © The Author(s) 2012. Published by Oxford University Press.","authors":["Ono Y.","Asai K.","Hamada M."],"cit_count":77,"doi":"10.1093/bioinformatics/bts649","journal":"Bioinformatics","title":"PBSIM: PacBio reads simulator - Toward accurate genome assembly","type":"Primary","year":"2013-01-01"}],"summary":{"biotoolsCURIE":"biotools:pbsim","biotoolsID":"pbsim","description":"PacBio sequencers produced two types of characteristic reads: CCS (short and low error rate) and CLR (long and high error rate), both of which could be useful for de novo assembly of genomes. This tool simulates those PacBio reads by using either a model-based or sampling-based simulation.","homepage":"https://code.google.com/p/pbsim/","name":"PBSIM","version":["1.0.3"]}}