{
    "additionDate": "2018-08-25T09:09:03Z",
    "biotoolsCURIE": "biotools:admetlab",
    "biotoolsID": "admetlab",
    "credit": [
        {
            "email": "oriental-cds@163.com",
            "name": "Dong-Sheng Cao",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Provides a user-friendly, freely available web interface for systematic ADMET evaluation of chemical compounds based on a comprehensive database consisting of 288,967 entries.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://admet.scbdd.com/home/interpretation/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular model refinement",
                    "uri": "http://edamontology.org/operation_0322"
                }
            ]
        }
    ],
    "homepage": "http://admet.scbdd.com/",
    "lastUpdate": "2018-12-10T12:59:01Z",
    "name": "ADMETlab",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s13321-018-0283-x",
            "metadata": {
                "abstract": "© The Author(s) 2018. This article is distributed under the terms of the Creative Commons Attribution 4.0 International License.Current pharmaceutical research and development (R&D) is a high-risk investment which is usually faced with some unexpected even disastrous failures in different stages of drug discovery. One main reason for R&D failures is the efficacy and safety deficiencies which are related largely to absorption, distribution, metabolism and excretion (ADME) properties and various toxicities (T). Therefore, rapid ADMET evaluation is urgently needed to minimize failures in the drug discovery process. Here, we developed a web-based platform called ADMETlab for systematic ADMET evalua- tion of chemicals based on a comprehensively collected ADMET database consisting of 288,967 entries. Four function modules in the platform enable users to conveniently perform six types of drug-likeness analysis (five rules and one prediction model), 31 ADMET endpoints prediction (basic property: 3, absorption: 6, distribution: 3, metabolism: 10, elimination: 2, toxicity: 7), systematic evaluation and database/similarity searching. We believe that this web platform will hopefully facilitate the drug discovery process by enabling early drug-likeness evaluation, rapid ADMET virtual screening or filtering and prioritization of chemical structures. The ADMETlab web platform is designed based on the Django framework in Python, and is freely accessible at http://admet.scbdd.com/.",
                "authors": [
                    {
                        "name": "Cao D.-S."
                    },
                    {
                        "name": "Cheng Y."
                    },
                    {
                        "name": "Dong J."
                    },
                    {
                        "name": "Lu A.-P."
                    },
                    {
                        "name": "Ouyang D."
                    },
                    {
                        "name": "Wang N.-N."
                    },
                    {
                        "name": "Yao Z.-J."
                    },
                    {
                        "name": "Zhang L."
                    }
                ],
                "citationCount": 116,
                "date": "2018-01-01T00:00:00Z",
                "journal": "Journal of Cheminformatics",
                "title": "Admetlab: A platform for systematic ADMET evaluation based on a comprehensively collected ADMET database"
            }
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        },
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        }
    ],
    "validated": 1
}
