{
    "name": "Onto-Tools", 
    "description": "Suite of tools for data mining based on information from Gene Ontology (GO). Onto-Tools includes an annotation database and the data mining tools: Onto-Express, Onto-Compare, Onto-Design, Onto-Translate, Onto-Miner, Pathway-Express, Promoter-Express, nsSNPCounter, TAQ, and OE2GO; free registration is required.", 
    "homepage": "http://vortex.cs.wayne.edu/Projects.html", 
    "biotoolsID": "onto-tools", 
    "biotoolsCURIE": "biotools:onto-tools", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0313", 
                    "term": "Gene expression profile clustering"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0533", 
                    "term": "Gene expression profile pathway mapping"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0314", 
                    "term": "Gene expression profiling"
                }, 
                {
                    "uri": "http://edamontology.org/operation_2495", 
                    "term": "Gene expression analysis"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0315", 
                    "term": "Gene expression profile comparison"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0203", 
            "term": "Gene expression"
        }, 
        {
            "uri": "http://edamontology.org/topic_0602", 
            "term": "Molecular interactions, pathways and networks"
        }, 
        {
            "uri": "http://edamontology.org/topic_3518", 
            "term": "Microarray experiment"
        }, 
        {
            "uri": "http://edamontology.org/topic_0749", 
            "term": "Transcription factors and regulatory sites"
        }, 
        {
            "uri": "http://edamontology.org/topic_3297", 
            "term": "Biotechnology"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "http://vortex.cs.wayne.edu/Onto-Tools%20User%20Manual/index.html", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "12664686", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Assessing the functional bias of commercial microarrays using the onto-compare database", 
                "abstract": "Microarrays are at the center of a revolution in biotechnology, allowing researchers to screen tens of thousands of genes simultaneously. Typically, they have been used in exploratory research to help formulate hypotheses. In most cases, this phase is followed by a more focused, hypothesis-driven stage in which certain specific biological processes and pathways are thought to be involved. Since a single biological process can still involve hundreds of genes, microarrays are still the preferred approach as proven by the availability of focused arrays from several manufacturers. Because focused arrays from different manufacturers use different sets of genes, each array will represent any given regulatory pathway to a different extent. We argue that a functional analysis of the arrays available should be the most important criterion used in the array selection. We developed Onto-Compare as a database that can provide this functionality, based on the Gene Ontology Consortium nomenclature. We used this tool to compare several arrays focused on apoptosis, oncogenes, and tumor suppressors. We considered arrays from BD Biosciences Clontech, PerkinElmer, Sigma-Genosys, and SuperArray. We showed that among the oncogene arrays, the PerkinElmer MICROMAX™ oncogene microarray has a better representation of oncogenesis, protein phosphorylation, and negative control of cell proliferation. The comparison of the apoptosis arrays showed that most apoptosis-related biological processes are equally well represented on the arrays considered. However, functional categories such as immune response, cell-cell signaling, cell-surface receptor linked signal transduction, and interleukins are better represented on the Sigma-Genosys Panorama™ human apoptosis array. At the same time, processes such as cell cycle control, oncogenesis, and negative control of cell proliferation are better represented on the BD Biosciences Clontech Atlas Select™ human apoptosis array.", 
                "date": "2003-03-01T00:00:00Z", 
                "citationCount": 17, 
                "authors": [
                    {
                        "name": "Draghici S."
                    }, 
                    {
                        "name": "Khatri P."
                    }, 
                    {
                        "name": "Shah A."
                    }, 
                    {
                        "name": "Tainsky M.A."
                    }
                ], 
                "journal": "BioTechniques"
            }
        }, 
        {
            "doi": null, 
            "pmid": "12824416", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Onto-Tools, the toolkit of the modern biologist: Onto-Express, Onto-Compare, Onto-Design and Onto-Translate", 
                "abstract": "Onto-Tools is a set of four seamlessly integrated databases: Onto-Express, Onto-Compare, Onto-Design and Onto-Translate. Onto-Express is able to automatically translate lists of genes found to be differentially regulated in a given condition into functional profiles characterizing the impact of the condition studied upon various biological processes and pathways. OE constructs functional profiles (using Gene Ontology terms) for the following categories: biochemical function, biological process, cellular role, cellular component, molecular function and chromosome location. Statistical significance values are calculated for each category. Once the initial exploratory analysis identified a number of relevant biological processes, specific mechanisms of interactions can be hypothesized for the conditions studied. Currently, many commercial arrays are available for the investigation of specific mechanisms. Each such array is characterized by a biological bias determined by the extent to which the genes present on the array represent specific pathways. Onto-Compare is a tool that allows efficient comparisons of any sets of commercial or custom arrays. Using Onto-Compare, a researcher can determine quickly which array, or set of arrays, covers best the hypotheses studied. In many situations, no commercial arrays are available for specific biological mechanisms. Onto-Design is a tool that allows the user to select genes that represent given functional categories. Onto-Translate allows the user to translate easily lists of accession numbers, UniGene clusters and Affymetrix probes into one another. All tools above are seamlessly integrated. The Onto-Tools are available online at http://vortex.cs.wayne.edu/Projects.html.", 
                "date": "2003-07-01T00:00:00Z", 
                "citationCount": 283, 
                "authors": [
                    {
                        "name": "Draghici S."
                    }, 
                    {
                        "name": "Khatri P."
                    }, 
                    {
                        "name": "Bhavsar P."
                    }, 
                    {
                        "name": "Shah A."
                    }, 
                    {
                        "name": "Krawetz S.A."
                    }, 
                    {
                        "name": "Tainsky M.A."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }, 
        {
            "doi": null, 
            "pmid": "11829497", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Profiling gene expression using Onto-Express", 
                "abstract": "Gene expression profiles obtained through microarray or data mining analyses often exist as vast data strings. To interpret the biology of these genetic profiles, investigators must analyze this data in the context of other information such as the biological, biochemical, or molecular function of the translated proteins. This is particularly challenging for a human analyst because large quantities of less than relevant data often bury such information. To address this need we implemented an automated routine, called Onto-Express (http://vortex.cs.wayne.edu:8080), to systematically translate genetic fingerprints into functional profiles. Using strings of accession or cluster identification numbers, Onto-Express searches the public databases and returns tables that correlate expression profiles with the cytogenetic locations, biochemical and molecular functions, biological processes, cellular components, and cellular roles of the translated proteins. The profiles created by Onto-Express fundamentally increase the value of gene expression analyses by facilitating the translation of quantitative value sets to records that contain biological implications.", 
                "date": "2001-12-01T00:00:00Z", 
                "citationCount": 355, 
                "authors": [
                    {
                        "name": "Khatri P."
                    }, 
                    {
                        "name": "Draghici S."
                    }, 
                    {
                        "name": "Ostermeier G.Charles"
                    }, 
                    {
                        "name": "Krawetz S.A."
                    }
                ], 
                "journal": "Genomics"
            }
        }, 
        {
            "doi": null, 
            "pmid": "17584796", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Onto-Tools: New additions and improvements in 2006", 
                "abstract": "Onto-Tools is a freely available web-accessible software suite, composed of an annotation database and nine complementary data-mining tools. This article describes a new tool, Onto-Express-to-go (OE2GO), as well as some new features implemented in Pathway-Express and Onto-Miner over the past year. Pathway-Express (PE) has been enhanced to identify significantly perturbed pathways in a given condition using the differentially expressed genes in the input. OE2GO is a tool for functional profiling using custom annotations. The development of this tool was aimed at the researchers working with organisms for which annotations are not yet available in the public domain. OE2GO allows researchers to use either annotation data from the Onto-Tools database, or their own custom annotations. By removing the necessity to use any specific database, OE2GO makes the functional profiling available for all organisms, with annotations using any ontology. The Onto-Tools are freely available at http://vortex.cs.wayne.edu/projects.htm. © 2007 The Author(s).", 
                "date": "2007-07-01T00:00:00Z", 
                "citationCount": 74, 
                "authors": [
                    {
                        "name": "Khatri P."
                    }, 
                    {
                        "name": "Voichita C."
                    }, 
                    {
                        "name": "Kattan K."
                    }, 
                    {
                        "name": "Ansari N."
                    }, 
                    {
                        "name": "Khatri A."
                    }, 
                    {
                        "name": "Georgescu C."
                    }, 
                    {
                        "name": "Tarca A.L."
                    }, 
                    {
                        "name": "Draghici S."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }, 
        {
            "doi": null, 
            "pmid": "16845086", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "New Onto-Tools: Promoter-Express, nsSNPCounter and Onto-Translate", 
                "abstract": "The Onto-Tools suite is composed of an annotation database and eight complementary, web-accessible data mining tools: Onto-Express, Onto-Compare, Onto-Design, Onto-Translate, Onto-Miner, Pathway-Express, Promoter-Express and nsSNPCounter. Promoter-Express is a new tool added to the Onto-Tools ensemble that facilitates the identification of transcription factor binding sites active in specific conditions. nsSNPCounter is another new tool that allows computation and analysis of synonymous and non-synonymous codon substitutions for studying evolutionary rates of protein coding genes. Onto-Translate has also been enhanced to expand its scope and accuracy by fully utilizing the capabilities of the Onto-Tools database. Currently, Onto-Translate allows arbitrary mappings between 28 types of IDs for 53 organisms. Onto-Tools are freely available at http://vortex.cs.wayne.edu/ Projects.html. © The Author 2006. Published by Oxford University Press. All rights reserved.", 
                "date": "2006-07-01T00:00:00Z", 
                "citationCount": 13, 
                "authors": [
                    {
                        "name": "Khatri P."
                    }, 
                    {
                        "name": "Desai V."
                    }, 
                    {
                        "name": "Tarca A.L."
                    }, 
                    {
                        "name": "Sellamuthu S."
                    }, 
                    {
                        "name": "Wildman D.E."
                    }, 
                    {
                        "name": "Romero R."
                    }, 
                    {
                        "name": "Draghici S."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }, 
        {
            "doi": null, 
            "pmid": "12620386", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Global functional profiling of gene expression", 
                "abstract": "The typical result of a microarray experiment is a list of tens or hundreds of genes found to be differentially regulated in the condition under study. Independent of the methods used to select these genes, the common task faced by any researcher is to translate these lists of genes into a better understanding of the biological phenomena involved. Currently, this is done through a tedious combination of searches through the literature and a number of public databases. We developed Onto-Express (OE) as a novel tool able to automatically translate such lists of differentially regulated genes into functional profiles characterizing the impact of the condition studied. OE constructs functional profiles (using Gene Ontology terms) for the following categories: biochemical function, biological process, cellular role, cellular component, molecular function, and chromosome location. Statistical significance values are calculated for each category. We demonstrate the validity and the utility of this comprehensive global analysis of gene function by analyzing two breast cancer datasets from two separate laboratories. OE was able to identify correctly all biological processes postulated by the original authors, as well as discover novel relevant mechanisms. © 2003 Elsevier Science (USA). All rights reserved.", 
                "date": "2003-02-01T00:00:00Z", 
                "citationCount": 454, 
                "authors": [
                    {
                        "name": "Draghici S."
                    }, 
                    {
                        "name": "Khatri P."
                    }, 
                    {
                        "name": "Martins R.P."
                    }, 
                    {
                        "name": "Ostermeier G.C."
                    }, 
                    {
                        "name": "Krawetz S.A."
                    }
                ], 
                "journal": "Genomics"
            }
        }, 
        {
            "doi": null, 
            "pmid": "15980579", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Recent additions and improvements to the Onto-Tools", 
                "abstract": "The Onto-Tools suite is composed of an annotation database and six seamlessly integrated, web-accessible data mining tools: Onto-Express, Onto-Compare, Onto-Design, Onto-Translate, Onto-Miner and Pathway-Express. The Onto-Tools database has been expanded to include various types of data from 12 new databases. Our database now integrates different types of genomic data from 19 sequence, gene, protein and annotation databases. Additionally, our database is also expanded to include complete Gene Ontology (GO) annotations. Using the enhanced database and GO annotations, Onto-Express now allows functional profiling for 24 organisms and supports 17 different types of input IDs. Onto-Translate is also enhanced to fully utilize the capabilities of the new Onto-Tools database with an ultimate goal of providing the users with a non-redundant and complete mapping from any type of identification system to any other type. Currently, Onto-Translate allows arbitrary mappings between 29 types of IDs. Pathway-Express is a new tool that helps the users find the most interesting pathways for their input list of genes. Onto-Tools are freely available at http:// vortex.cs.wayne.edu/Projects.html. © 2005 Oxford University Press.", 
                "date": "2005-07-01T00:00:00Z", 
                "citationCount": 89, 
                "authors": [
                    {
                        "name": "Khatri P."
                    }, 
                    {
                        "name": "Sellamuthu S."
                    }, 
                    {
                        "name": "Malhotra P."
                    }, 
                    {
                        "name": "Amin K."
                    }, 
                    {
                        "name": "Done A."
                    }, 
                    {
                        "name": "Draghici S."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }, 
        {
            "doi": null, 
            "pmid": "15215428", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Onto-Tools: An ensemble of web-accessible ontology-based tools for the functional design and interpretation of high-throughput gene expression experiments", 
                "abstract": "The Onto-Tools suite is composed of an annotation database and five seamlessly integrated web-accessible data mining tools: Onto-Express (OE), Onto-Compare (OC), Onto-Design (OD), Onto-Translate (OT) and Onto-Miner (OM). OM is a new tool that provides a unified access point and an application programming interface for most annotations available. Our database has been enhanced with more than 120 new commercial microarrays and annotations for Rattus norvegicus, Drosophila melanogaster and Carnorhabditis elegans. The Onto-Tools have been redesigned to provide better biological insight, improved performance and user convenience. The new features implemented in OE include support for gene names, LocusLink IDs and Gene Ontology (GO) IDs, ability to specify fold changes for the input genes, links to the KEGG pathway database and detailed output files. OC allows comparisons of the functional bias of more than 170 commercial microarrays. The latest version of OD allows the user to specify keywords if the exact GO term is not known as well as providing more details than the previous version. OE, OC and OD now have an integrated GO browser that allows the user to customize the level of abstraction for each GO category. The Onto-Tools are available online at http://vortex.cs.wayne.edu/Projects.html. © Oxford University Press 2004; all rights reserved.", 
                "date": "2004-07-01T00:00:00Z", 
                "citationCount": 117, 
                "authors": [
                    {
                        "name": "Khatri P."
                    }, 
                    {
                        "name": "Bhavsar P."
                    }, 
                    {
                        "name": "Bawa G."
                    }, 
                    {
                        "name": "Draghici S."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }
    ], 
    "credit": [
        {
            "name": "Dr. Sorin Draghici", 
            "email": "sod@cs.wayne.edu", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "ELIXIR-EE", 
    "additionDate": "2017-03-24T09:34:06Z", 
    "lastUpdate": "2018-12-10T12:58:57Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 1, 
    "elixir_badge": 0
}