
{
    "credit": [
        {
            "email": "Sven.Bergmann@unil.ch",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www2.unil.ch/cbg/index.php?title=Main_Page"
        }
    ],
    "documentation": [
        {
            "url": "https://www2.unil.ch/cbg/index.php?title=ISA#Tutorials"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "Data management",
                "uri": "http://edamontology.org/topic_3071"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/isa-1-0-0-iterative-signature-algorithm.html"
        }
    ],
    "publication": [
        {
            "abstract": "We present an approach for the analysis of genome-wide expression data. Our method is designed to overcome the limitations of traditional techniques, when applied to large-scale data. Rather than alloting each gene to a single cluster, we assign both genes and conditions to context-dependent and potentially overlapping transcription modules. We provide a rigorous definition of a transcription module as the object to be retrieved from the expression data. An efficient algorithm, which searches for the modules encoded in the data by iteratively refining sets of genes and conditions until they match this definition, is established. Each iteration involves a linear map, induced by the normalized expression matrix, followed by the application of a threshold function. We argue that our method is in fact a generalization of singular value decomposition, which corresponds to the special case where no threshold is applied. We show analytically that for noisy expression data our approach leads to better classification due to the implementation of the threshold. This result is confirmed by numerical analyses based on in silico expression data. We discuss briefly results obtained by applying our algorithm to expression data from the yeast Saccharomyces cerevisiae. © 2003 The American Physical Society.",
            "authors": [
                "Bergmann S.",
                "Ihmels J.",
                "Barkai N."
            ],
            "cit_count": 238,
            "journal": "Physical Review E - Statistical Physics, Plasmas, Fluids, and Related Interdisciplinary Topics",
            "pmid": "12689096",
            "title": "Iterative signature algorithm for the analysis of large-scale gene expression data",
            "year": "2003-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:isa",
        "biotoolsID": "isa",
        "description": "Tool designed to reduce the complexity of very large sets of data by decomposing it into so-called “modules”. In the context of gene expression data these modules consist of subsets of genes that exhibit a coherent expression profile only over a subset of microarray experiments.",
        "homepage": "http://www2.unil.ch/cbg/index.php?title=ISA",
        "name": "ISA"
    }
}