{
    "additionDate": "2018-04-29T10:31:13Z",
    "biotoolsCURIE": "biotools:aurea",
    "biotoolsID": "aurea",
    "credit": [
        {
            "name": "Contact form",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://hood-price.systemsbiology.org/contact/"
        }
    ],
    "description": "Open-source software system for accurate and user-friendly identification of relative expression molecular signatures.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://hood-price.systemsbiology.org/research/aurea/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence motif recognition",
                    "uri": "http://edamontology.org/operation_0239"
                },
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://hood-price.systemsbiology.org/research/aurea/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "AUREA",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/1471-2105-14-78",
            "metadata": {
                "abstract": "Background: Public databases such as the NCBI Gene Expression Omnibus contain extensive and exponentially increasing amounts of high-throughput data that can be applied to molecular phenotype characterization. Collectively, these data can be analyzed for such purposes as disease diagnosis or phenotype classification. One family of algorithms that has proven useful for disease classification is based on relative expression analysis and includes the Top-Scoring Pair (TSP), k-Top-Scoring Pairs (k-TSP), Top-Scoring Triplet (TST) and Differential Rank Conservation (DIRAC) algorithms. These relative expression analysis algorithms hold significant advantages for identifying interpretable molecular signatures for disease classification, and have been implemented previously on a variety of computational platforms with varying degrees of usability. To increase the user-base and maximize the utility of these methods, we developed the program AUREA (Adaptive Unified Relative Expression Analyzer)-a cross-platform tool that has a consistent application programming interface (API), an easy-to-use graphical user interface (GUI), fast running times and automated parameter discovery.Results: Herein, we describe AUREA, an efficient, cohesive, and user-friendly open-source software system that comprises a suite of methods for relative expression analysis. AUREA incorporates existing methods, while extending their capabilities and bringing uniformity to their interfaces. We demonstrate that combining these algorithms and adaptively tuning parameters on the training sets makes these algorithms more consistent in their performance and demonstrate the effectiveness of our adaptive parameter tuner by comparing accuracy across diverse datasets.Conclusions: We have integrated several relative expression analysis algorithms and provided a unified interface for their implementation while making data acquisition, parameter fixing, data merging, and results analysis 'point-and-click' simple. The unified interface and the adaptive parameter tuning of AUREA provide an effective framework in which to investigate the massive amounts of publically available data by both 'in silico' and 'bench' scientists. AUREA can be found at http://price.systemsbiology.net/AUREA/. © 2013 Earls et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Earls J.C."
                    },
                    {
                        "name": "Eddy J.A."
                    },
                    {
                        "name": "Funk C.C."
                    },
                    {
                        "name": "Ko Y."
                    },
                    {
                        "name": "Magis A.T."
                    },
                    {
                        "name": "Price N.D."
                    }
                ],
                "citationCount": 6,
                "date": "2013-03-05T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "AUREA: An open-source software system for accurate and user-friendly identification of relative expression molecular signatures"
            },
            "pmcid": "PMC3599560",
            "pmid": "23496976"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1
}