{
    "additionDate": "2020-01-14T20:10:10Z",
    "biotoolsCURIE": "biotools:slnpm",
    "biotoolsID": "slnpm",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhangwen@mail.hzau.edu.cn",
            "name": "Wen Zhang",
            "typeEntity": "Person"
        },
        {
            "email": "niuyanqing@mail.scuec.edu.cn",
            "name": "Yanqing Niu",
            "typeEntity": "Person"
        }
    ],
    "description": "LncRNA-miRNA interaction prediction through sequence-derived linear neighborhood propagation method with information combination.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BioMedicalBigDataMiningLab/SLNPM",
    "lastUpdate": "2021-01-16T13:56:05Z",
    "name": "SLNPM",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12864-019-6284-Y",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Researchers discover lncRNAs can act as decoys or sponges to regulate the behavior of miRNAs. Identification of lncRNA-miRNA interactions helps to understand the functions of lncRNAs, especially their roles in complicated diseases. Computational methods can save time and reduce cost in identifying lncRNA-miRNA interactions, but there have been only a few computational methods. Results: In this paper, we propose a sequence-derived linear neighborhood propagation method (SLNPM) to predict lncRNA-miRNA interactions. First, we calculate the integrated lncRNA-lncRNA similarity and the integrated miRNA-miRNA similarity by combining known lncRNA-miRNA interactions, lncRNA sequences and miRNA sequences. We consider two similarity calculation strategies respectively, namely similarity-based information combination (SC) and interaction profile-based information combination (PC). Second, the integrated lncRNA similarity-based graph and the integrated miRNA similarity-based graph are respectively constructed, and the label propagation processes are implemented on two graphs to score lncRNA-miRNA pairs. Finally, the weighted averages of their outputs are adopted as final predictions. Therefore, we construct two editions of SLNPM: Sequence-derived linear neighborhood propagation method based on similarity information combination (SLNPM-SC) and sequence-derived linear neighborhood propagation method based on interaction profile information combination (SLNPM-PC). The experimental results show that SLNPM-SC and SLNPM-PC predict lncRNA-miRNA interactions with higher accuracy compared with other state-of-the-art methods. The case studies demonstrate that SLNPM-SC and SLNPM-PC help to find novel lncRNA-miRNA interactions for given lncRNAs or miRNAs. Conclusion: The study reveals that known interactions bring the most important information for lncRNA-miRNA interaction prediction, and sequences of lncRNAs (miRNAs) also provide useful information. In conclusion, SLNPM-SC and SLNPM-PC are promising for lncRNA-miRNA interaction prediction.",
                "authors": [
                    {
                        "name": "Zhang W."
                    },
                    {
                        "name": "Tang G."
                    },
                    {
                        "name": "Zhou S."
                    },
                    {
                        "name": "Niu Y."
                    }
                ],
                "citationCount": 15,
                "date": "2019-12-20T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "LncRNA-miRNA interaction prediction through sequence-derived linear neighborhood propagation method with information combination"
            },
            "pmcid": "PMC6923828",
            "pmid": "31856716"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        }
    ],
    "validated": 1
}