{
    "accessibility": "Open access",
    "additionDate": "2023-01-28T12:51:28.723041Z",
    "biotoolsCURIE": "biotools:evanalyzer",
    "biotoolsID": "evanalyzer",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "nicole.meisner-kober@plus.ac.at",
            "name": "Nicole Meisner‐Kober",
            "typeEntity": "Person"
        }
    ],
    "description": "EVAnalyzer is a new open‐source plugin for Fiji, developed for automated single vesicle quantification from fluorescence microscopy images",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Single particle alignment and classification",
                    "uri": "http://edamontology.org/operation_3458"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/joda01/evanalyzer/releases",
    "language": [
        "Java"
    ],
    "lastUpdate": "2023-01-28T12:51:28.726480Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/joda01/evanalyzer/issues"
        }
    ],
    "name": "EVAnalyzer",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1002/JEV2.12282",
            "metadata": {
                "abstract": "© 2022 The Authors. Journal of Extracellular Vesicles published by Wiley Periodicals, LLC on behalf of the International Society for Extracellular Vesicles.Extracellular vesicle (EV) research increasingly demands for quantitative characterisation at the single vesicle level to address heterogeneity and complexity of EV subpopulations. Emerging, commercialised technologies for single EV analysis based on, for example, imaging flow cytometry or imaging after capture on chips generally require dedicated instrumentation and proprietary software not readily accessible to every lab. This limits their implementation for routine EV characterisation in the rapidly growing EV field. We and others have shown that single vesicles can be detected as light diffraction limited fluorescent spots using standard confocal and widefield fluorescence microscopes. Advancing this simple strategy into a process for routine EV quantitation, we developed ‘EVAnalyzer’, an ImageJ/Fiji (Fiji is just ImageJ) plugin for automated, quantitative single vesicle analysis from imaging data. Using EVAnalyzer, we established a robust protocol for capture, (immuno-)labelling and fluorescent imaging of EVs. To exemplify the application scope, the process was optimised and systematically tested for (i) quantification of EV subpopulations, (ii) validation of EV labelling reagents, (iii) in situ determination of antibody specificity, sensitivity and species cross-reactivity for EV markers and (iv) optimisation of genetic EV engineering. Additionally, we show that the process can be applied to synthetic nanoparticles, allowing to determine siRNA encapsulation efficiencies of lipid-based nanoparticles (LNPs) and protein loading of SiO2 nanoparticles. EVAnalyzer further provides a pipeline for automated quantification of cell uptake at the single cell–single vesicle level, thereby enabling high content EV cell uptake assays and plate-based screens. Notably, the entire procedure from sample preparation to the final data output is entirely based on standard reagents, materials, laboratory equipment and open access software. In summary, we show that EVAnalyzer enables rigorous characterisation of EVs with generally accessible tools. Since we further provide the plugin as open-source code, we expect EVAnalyzer to not only be a resource of immediate impact, but an open innovation platform for the EV and nanoparticle research communities.",
                "authors": [
                    {
                        "name": "Benirschke H.M."
                    },
                    {
                        "name": "Blochl C."
                    },
                    {
                        "name": "Danmayr J."
                    },
                    {
                        "name": "Gomes F.G."
                    },
                    {
                        "name": "Heger Z."
                    },
                    {
                        "name": "Heuser T."
                    },
                    {
                        "name": "Himly M."
                    },
                    {
                        "name": "Hintersteiner M."
                    },
                    {
                        "name": "Huber C.G."
                    },
                    {
                        "name": "Jaritsch M."
                    },
                    {
                        "name": "Johnson L."
                    },
                    {
                        "name": "Kiefer J."
                    },
                    {
                        "name": "Klinglmayr E."
                    },
                    {
                        "name": "Kratochvil Z."
                    },
                    {
                        "name": "Matea C.-T."
                    },
                    {
                        "name": "Meisner-Kober N."
                    },
                    {
                        "name": "Miller A."
                    },
                    {
                        "name": "Plank T."
                    },
                    {
                        "name": "Rauter J."
                    },
                    {
                        "name": "Schurz M."
                    },
                    {
                        "name": "Stanojlovic V."
                    },
                    {
                        "name": "Wolf M."
                    },
                    {
                        "name": "Zimmerebner P."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "Journal of Extracellular Vesicles",
                "title": "EVAnalyzer: High content imaging for rigorous characterisation of single extracellular vesicles using standard laboratory equipment and a new open-source ImageJ/Fiji plugin"
            },
            "pmcid": "PMC9702573",
            "pmid": "36437554"
        }
    ],
    "relation": [
        {
            "biotoolsID": "fiji",
            "type": "uses"
        }
    ],
    "toolType": [
        "Plug-in"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Cytometry",
            "uri": "http://edamontology.org/topic_3934"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Lipids",
            "uri": "http://edamontology.org/topic_0153"
        }
    ]
}
