
{
    "credit": [
        {
            "email": "gspyrou@bioacademy.gr",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://bioserver-3.bioacademy.gr/Bioserver/ZoomOut/contact.php"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://bioserver-3.bioacademy.gr/Bioserver/ZoomOut/help.php"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein interaction network analysis",
                    "uri": "http://edamontology.org/operation_0276"
                },
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Systems biology",
                "uri": "http://edamontology.org/topic_2259"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Protein interactions",
                "uri": "http://edamontology.org/topic_0128"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/zoomout-analyzing-multiple-networks-as-single-nodes.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2015 IEEE.We have developed ZoomOut web server in order to provide the research community with a tool for analysis, visualization and clustering of networks as a super network, based on their calculated feature properties. Networks can be analysed and be further treated as single nodes in a super network that describe their relations. Specifically, the user interface is divided into three main sections: the Workspace, the Networks Feature Calculations and the Clustering Networks section. In the Workspace section, users are able to upload and manage multiple networks for further processing. In the Networks Feature Calculations section, a variety of network properties are calculated as features for each uploaded network. In the Clustering Networks section, users are able to apply clustering by selecting from the list of previously calculated features. All processed networks can also be visualized as a super interactive network, were interconnections among networks are based on the calculated clustering distances. To the best of our knowledge, this is the first available web-service that allows users to manage, quantify and visualize multiple networks at the same time, handling them as parts of a larger network with properties calculated in an upper scale.",
            "authors": [
                "Athanasiadis E.I.",
                "Bourdakou M.M.",
                "Spyrou G.M."
            ],
            "cit_count": 2,
            "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
            "pmid": "26451833",
            "title": "ZoomOut: Analyzing multiple networks as single nodes",
            "year": "2015-09-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:zoomout",
        "biotoolsID": "zoomout",
        "description": "Web server in order to provide the research community with a tool for analysis, visualization and clustering of networks as a super network, based on their calculated feature properties.",
        "homepage": "http://bioserver-3.bioacademy.gr/Bioserver/ZoomOut/",
        "name": "ZoomOut"
    }
}