{
    "accessibility": [],
    "additionDate": "2017-02-10T14:13:58Z",
    "biotoolsCURIE": "biotools:metapath_online",
    "biotoolsID": "metapath_online",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": "handorf@physik.hu-berlin.de",
            "gridid": null,
            "name": "Thomas Handorf",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        }
    ],
    "description": "MetaPath Online gives users access to an algorithm for network expansion.  Starting with given metabolites, called seed compounds, the algorithm uses known information about metabolic reactions and pathways to expand the network and define scope.  This systematic investigation of structure-function relationships of metabolic networks can offer evolutionary insights.",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "https://scopes.biologie.hu-berlin.de/index.php?m=path"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                },
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                },
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://scopes.biologie.hu-berlin.de/",
    "homepage_status": 0,
    "language": [],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "license": null,
    "link": [],
    "maturity": null,
    "name": "MetaPath Online",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": null,
            "metadata": {
                "abstract": "The metabolic networks of different species show a large variety in their structural design. In this work, the evolution of functional properties of metabolism in relation with metabolic network structure is investigated. The metabolism of ancestral species is inferred from the metabolism of contemporary species using a Bayesian network model for metabolism evolution. Subsequently, these networks are analysed with the recently developed method of network expansion. This method allows for a structural analysis of metabolic networks as well as a quantification of network functions in terms of their synthesising capacities when they are provided with certain external resources. The evolutionary dynamics of one particular network function: the metabolic expansion of glucose is investigated. © The Institution of Engineering and Technology 2006.",
                "authors": [
                    {
                        "name": "Ebenhoh O."
                    },
                    {
                        "name": "Handorf T."
                    },
                    {
                        "name": "Kahn D."
                    }
                ],
                "citationCount": 12,
                "date": "2006-09-01T00:00:00Z",
                "journal": "IEE Proceedings: Systems Biology",
                "title": "Evolutionary changes of metabolic networks and their biosynthetic capacities"
            },
            "note": null,
            "pmcid": null,
            "pmid": "16986316",
            "type": null,
            "version": null
        },
        {
            "doi": null,
            "metadata": {
                "abstract": "A new method for the mathematical analysis of large metabolic networks is presented. Based on the fact that the occurrence of a metabolic reaction generally requires the existence of other reactions providing its substrates, series of metabolic networks are constructed. In each step of the corresponding expansion process those reactions are incorporated whose substrates are made available by the networks of the previous generations. The method is applied to the set of all metabolic reactions included in the KEGG database. Starting with one or more seed compounds, the expansion results in a final network whose compounds define the scope of the seed. Scopes of all metabolic compounds are calculated and it is shown that large parts of cellular metabolism can be considered as the combined scope of simple building blocks. Analyses of various expansion processes reveal crucial metabolites whose incorporation allows for the increase in network complexity. Among these metabolites are common cofactors such as NAD+, ATP, and coenzyme A. We demonstrate that the outcome of network expansion is in general very robust against elimination of single or few reactions. There exist, however, crucial reactions whose elimination results in a dramatic reduction of scope sizes. It is hypothesized that the expansion process displays characteristics of the evolution of metabolism such as the temporal order of the emergence of metabolic pathways. © Springer Science+Business Media, Inc. 2005.",
                "authors": [
                    {
                        "name": "Handorf T."
                    },
                    {
                        "name": "Ebenhoh O."
                    },
                    {
                        "name": "Heinrich R."
                    }
                ],
                "citationCount": 106,
                "date": "2005-10-01T00:00:00Z",
                "journal": "Journal of Molecular Evolution",
                "title": "Expanding metabolic networks: Scopes of compounds, robustness, and evolution"
            },
            "note": null,
            "pmcid": null,
            "pmid": "16155745",
            "type": null,
            "version": null
        },
        {
            "doi": null,
            "metadata": {
                "abstract": "The concept of scopes is applied to analyse large metabolic networks. Scopes are defined as sets of metabolites that can be synthesised by a metabolic network when it is provided with given seeds (Sets of initial metabolic compounds). Thus, scopes represent synthesising capacities of the seeds in the network. A hierarchy is discussed in the sense that compounds, which are part of the scope of another compound, possess scopes themselves that are subsets of the former scope. This hierarchy is analysed by means of a directed acyclic graph. Using a simple chemical model, it is found that this hierarchy contains specific structures that can, to a large extent, be explained by the chemical composition of the participating compounds. In this way, it represents a new kind of map of metabolic networks, arranging the metabolic compounds according to their chemical capacity. © The Institution of Engineering and Technology 2006.",
                "authors": [
                    {
                        "name": "Handorf T."
                    },
                    {
                        "name": "Ebenhoh O."
                    },
                    {
                        "name": "Kahn D."
                    },
                    {
                        "name": "Heinrich R."
                    }
                ],
                "citationCount": 5,
                "date": "2006-09-01T00:00:00Z",
                "journal": "IEE Proceedings: Systems Biology",
                "title": "Hierarchy of metabolic compounds based on their synthesising capacity"
            },
            "note": null,
            "pmcid": null,
            "pmid": "16986317",
            "type": null,
            "version": null
        },
        {
            "doi": null,
            "metadata": null,
            "note": null,
            "pmcid": null,
            "pmid": "17483511",
            "type": null,
            "version": null
        },
        {
            "doi": null,
            "metadata": {
                "abstract": "Methods are developed for structural analysis of metabolic networks expanding in size. Expansion proceeds in consecutive generations in which new reactions are attached to the network produced in the previous stage. Different rules are applied resulting in various modes of expansion. Expansion is performed on the set of glycolytic reactions as well as on a very large set of reactions taken from the KEGG database. It is shown that reactions and compounds strongly differ in the generation in which they are attached to the network allowing conclusions for the temporal order of the acquisition during network evolution. The expansion provides efficient tools for detecting new structural characteristics such as substrate-product relationships over long distances.",
                "authors": [
                    {
                        "name": "Ebenhoh O."
                    },
                    {
                        "name": "Handorf T."
                    },
                    {
                        "name": "Heinrich R."
                    }
                ],
                "citationCount": 53,
                "date": "2004-01-01T00:00:00Z",
                "journal": "Genome informatics. International Conference on Genome Informatics",
                "title": "Structural analysis of expanding metabolic networks."
            },
            "note": null,
            "pmcid": null,
            "pmid": "15712108",
            "type": null,
            "version": null
        },
        {
            "doi": null,
            "metadata": {
                "abstract": "We compare a large number of organisms with respect to their metabolic network functions. We measure such functions in terms of the synthesizing capacity of a network when it is provided with a few small chemical substances as external resources. We call this measure the scope and show that it is generally robust against structural alterations of the reaction network. Organisms can be separated into two groups, one with a small and one with a large scope. Networks with a high synthesizing capacity also show a high degree of robustness against structural changes, indicating that this network function has been a target in the evolutionary past of the corresponding organisms. A comparison between structural and functional similarities reveals that organisms with a similar structure do not necessarily show similar biological functions. The presented concepts allow for a systematic investigation of structure-function relationships of metabolic networks and may put forth valuable hints on the evolution of metabolic pathways.",
                "authors": [
                    {
                        "name": "Ebenhoh O."
                    },
                    {
                        "name": "Handorf T."
                    },
                    {
                        "name": "Heinrich R."
                    }
                ],
                "citationCount": 23,
                "date": "2005-01-01T00:00:00Z",
                "journal": "Genome informatics. International Conference on Genome Informatics",
                "title": "A cross species comparison of metabolic network functions."
            },
            "note": null,
            "pmcid": null,
            "pmid": "16362923",
            "type": null,
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1,
    "version": []
}