{
    "additionDate": "2019-11-14T19:43:10Z",
    "biotoolsCURIE": "biotools:SpCLUST",
    "biotoolsID": "SpCLUST",
    "confidence_flag": "high",
    "description": "> HOMEPAGE MISSING! | Towards a fast and reliable clustering for potentially divergent biological sequences | This paper presents SpCLUST, a new C++ package that takes a list of sequences as input, aligns them with MUSCLE, computes their similarity matrix in parallel and then performs the clustering. SpCLUST extends a previously released software by integrating additional scoring matrices which enables it to cover the clustering of amino-acid sequences. The similarity matrix is now computed in parallel according to the master slave distributed architecture, using MPI. Performance analysis, realized on two real datasets of 100 nucleotide sequences and 1049 amino-acids ones, show that the resulting library substantially outperforms the original Python package. The proposed package was also intensively evaluated on simulated and real genomic and protein data sets. The clustering results were compared to the most known traditional tools, such as UCLUST, CD-HIT and DNACLUST",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31550555",
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2019-11-14T19:43:10Z",
    "name": "SpCLUST",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.COMPBIOMED.2019.103439",
            "metadata": {
                "abstract": "© 2019 Elsevier LtdThis paper presents SpCLUST, a new C++ package that takes a list of sequences as input, aligns them with MUSCLE, computes their similarity matrix in parallel and then performs the clustering. SpCLUST extends a previously released software by integrating additional scoring matrices which enables it to cover the clustering of amino-acid sequences. The similarity matrix is now computed in parallel according to the master/slave distributed architecture, using MPI. Performance analysis, realized on two real datasets of 100 nucleotide sequences and 1049 amino-acids ones, show that the resulting library substantially outperforms the original Python package. The proposed package was also intensively evaluated on simulated and real genomic and protein data sets. The clustering results were compared to the most known traditional tools, such as UCLUST, CD-HIT and DNACLUST. The comparison showed that SpCLUST outperforms the other tools when clustering divergent sequences, and contrary to the others, it does not require any user intervention or prior knowledge about the input sequences.",
                "authors": [
                    {
                        "name": "Matar J."
                    },
                    {
                        "name": "Khoury H.E."
                    },
                    {
                        "name": "Charr J.-C."
                    },
                    {
                        "name": "Guyeux C."
                    },
                    {
                        "name": "Chretien S."
                    }
                ],
                "date": "2019-11-01T00:00:00Z",
                "journal": "Computers in Biology and Medicine",
                "title": "SpCLUST: Towards a fast and reliable clustering for potentially divergent biological sequences"
            },
            "pmid": "31550555"
        }
    ]
}