{
    "additionDate": "2021-03-19T08:56:28Z",
    "biotoolsCURIE": "biotools:atacgraph",
    "biotoolsID": "atacgraph",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "paoyang@gate.sinica.edu.tw",
            "name": "Pao-Yang Chen",
            "typeEntity": "Person"
        }
    ],
    "description": "ATACgraph is a simple and effective software for the analysis of ATAC-Seq data. It contains 12 analyses to profile (epi)genome. ATACgraph utilizes peak BED files and BigWig files generated by callPeak module to compute peaks abundances between two samples.",
    "download": [
        {
            "type": "Container file",
            "url": "https://hub.docker.com/r/lsbnb/galaxy_atacgraph"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/RitataLU/ATACgraph",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-19T16:08:18Z",
    "license": "GPL-3.0",
    "name": "ATACgraph",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3389/FGENE.2020.618478",
            "metadata": {
                "abstract": "© Copyright © 2021 Lu, Liu, Huang, Yen, Lin and Chen.Assay for transposase-accessible chromatin using sequencing data (ATAC-seq) is an efficient and precise method for revealing chromatin accessibility across the genome. Most of the current ATAC-seq tools follow chromatin immunoprecipitation sequencing (ChIP-seq) strategies that do not consider ATAC-seq-specific properties. To incorporate specific ATAC-seq quality control and the underlying biology of chromatin accessibility, we developed a bioinformatics software named ATACgraph for analyzing and visualizing ATAC-seq data. ATACgraph profiles accessible chromatin regions and provides ATAC-seq-specific information including definitions of nucleosome-free regions (NFRs) and nucleosome-occupied regions. ATACgraph also allows identification of differentially accessible regions between two ATAC-seq datasets. ATACgraph incorporates the docker image with the Galaxy platform to provide an intuitive user experience via the graphical interface. Without tedious installation processes on a local machine or cloud, users can analyze data through activated websites using pre-designed workflows or customized pipelines composed of ATACgraph modules. Overall, ATACgraph is an effective tool designed for ATAC-seq for biologists with minimal bioinformatics knowledge to analyze chromatin accessibility. ATACgraph can be run on any ATAC-seq data with no limit to specific genomes. As validation, we demonstrated ATACgraph on human genome to showcase its functions for ATAC-seq interpretation. This software is publicly accessible and can be downloaded at https://github.com/RitataLU/ATACgraph.",
                "authors": [
                    {
                        "name": "Lu R.J.-H."
                    },
                    {
                        "name": "Liu Y.-T."
                    },
                    {
                        "name": "Huang C.W."
                    },
                    {
                        "name": "Yen M.-R."
                    },
                    {
                        "name": "Lin C.-Y."
                    },
                    {
                        "name": "Chen P.-Y."
                    }
                ],
                "date": "2021-01-13T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "ATACgraph: Profiling Genome-Wide Chromatin Accessibility From ATAC-seq"
            },
            "pmcid": "PMC7874078",
            "pmid": "33584814"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Workflow"
    ],
    "topic": [
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "Chromosome conformation capture",
            "uri": "http://edamontology.org/topic_3940"
        },
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "ChIP-on-chip",
            "uri": "http://edamontology.org/topic_3179"
        }
    ]
}