{
    "additionDate": "2017-08-03T18:37:01Z",
    "biotoolsCURIE": "biotools:bisque",
    "biotoolsID": "bisque",
    "credit": [
        {
            "email": "haiyuan.yu@cornell.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.yulab.org/"
        }
    ],
    "description": "The Biological Sequence Exchange is a bioinformatics tool enabling locus and variant-specific conversion among human gene, transcript, and protein identifiers from several popular databases.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bisque.yulab.org/about.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                }
            ]
        }
    ],
    "homepage": "http://bisque.yulab.org/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:55Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/bisque-a-human-genomic-proteomic-and-transcriptomic-conversion-tool.html"
        }
    ],
    "name": "BISQUE",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2016 The Author 2016. Published by Oxford University Press. All rights reserved. Summary: Biological sequence databases are integral to efforts to characterize and understand biological molecules and share biological data. However, when analyzing these data, scientists are often left holding disparate biological currency - molecular identifiers from different databases. For downstream applications that require converting the identifiers themselves, there are many resources available, but analyzing associated loci and variants can be cumbersome if data is not given in a form amenable to particular analyses. Here we present BISQUE, a web server and customizable command-line tool for converting molecular identifiers and their contained loci and variants between different database conventions. BISQUE uses a graph traversal algorithm to generalize the conversion process for residues in the human genome, genes, transcripts and proteins, allowing for conversion across classes of molecules and in all directions through an intuitive web interface and a URL-based web service. Availability and implementation: BISQUE is freely available via the web using any major web browser (http://bisque.yulab.org/). Source code is available in a public GitHub repository (https://github.com/hyulab/BISQUE).",
                "authors": [
                    {
                        "name": "Meyer M.J."
                    },
                    {
                        "name": "Geske P."
                    },
                    {
                        "name": "Yu H."
                    }
                ],
                "citationCount": 2,
                "date": "2016-05-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "BISQUE: Locus- and variant-specific conversion of genomic, transcriptomic and proteomic database identifiers"
            },
            "pmid": "26803163"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Data submission, annotation and curation",
            "uri": "http://edamontology.org/topic_0219"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ],
    "validated": 1
}