{
    "accessibility": "Open access",
    "additionDate": "2022-09-30T22:33:42.040029Z",
    "biotoolsCURIE": "biotools:nolitia",
    "biotoolsID": "nolitia",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "immo.weber@staff.uni-marburg.de",
            "name": "Immo Weber",
            "typeEntity": "Person"
        },
        {
            "name": "Carina R Oehrn"
        }
    ],
    "description": "NoLiTiA is a free, open-source Matlab toolbox for nonlinear time series analysis. It incorporates methods from dynamical systems theory, recurrence quantification analysis and information theory.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://nolitia.com",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2024-11-24T15:32:50.266576Z",
    "license": "Not licensed",
    "name": "NoLiTiA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/fninf.2022.876012",
            "metadata": {
                "abstract": "In many scientific fields including neuroscience, climatology or physics, complex relationships can be described most parsimoniously by non-linear mechanics. Despite their relevance, many neuroscientists still apply linear estimates in order to evaluate complex interactions. This is partially due to the lack of a comprehensive compilation of non-linear methods. Available packages mostly specialize in only one aspect of non-linear time-series analysis and most often require some coding proficiency to use. Here, we introduce NoLiTiA, a free open-source MATLAB toolbox for non-linear time series analysis. In comparison to other currently available non-linear packages, NoLiTiA offers (1) an implementation of a broad range of classic and recently developed methods, (2) an implementation of newly proposed spatially and time-resolved recurrence amplitude analysis and (3) an intuitive environment accessible even to users with little coding experience due to a graphical user interface and batch-editor. The core methodology derives from three distinct fields of complex systems theory, including dynamical systems theory, recurrence quantification analysis and information theory. Besides established methodology including estimation of dynamic invariants like Lyapunov exponents and entropy-based measures, such as active information storage, we include recent developments of quantifying time-resolved aperiodic oscillations. In general, the toolbox will make non-linear methods accessible to the broad neuroscientific community engaged in time series processing.",
                "authors": [
                    {
                        "name": "Oehrn C.R."
                    },
                    {
                        "name": "Weber I."
                    }
                ],
                "citationCount": 4,
                "date": "2022-06-24T00:00:00Z",
                "journal": "Frontiers in Neuroinformatics",
                "title": "NoLiTiA: An Open-Source Toolbox for Non-linear Time Series Analysis"
            },
            "pmcid": "PMC9263366",
            "pmid": "35811996"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ],
    "validated": 1
}
