
{
    "credit": [
        {
            "name": "BC Cancer Agency Genome Sciences Centre",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "name": "bcgsc.ca",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "sjackman@gmail.com",
            "name": "Shaun Jackman",
            "typeEntity": "Person",
            "typeRoles": [
                "Developer"
            ],
            "url": "http://sjackman.ca"
        },
        {
            "email": "sjackman@gmail.com",
            "name": "Shaun Jackman",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://sjackman.ca"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://github.com/bcgsc/abyss#abyss"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "DNA sequence (raw)",
                        "uri": "http://edamontology.org/data_3497"
                    },
                    "format": [
                        {
                            "term": "FASTQ",
                            "uri": "http://edamontology.org/format_1930"
                        },
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                },
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Sequence assembly",
                        "uri": "http://edamontology.org/data_0925"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++"
        ],
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequence assembly",
                "uri": "http://edamontology.org/topic_0196"
            }
        ]
    },
    "link": [
        {
            "type": "REPOSITORY",
            "url": "https://github.com/bcgsc/abyss"
        }
    ],
    "publication": [
        {
            "abstract": "Widespread adoption of massively parallel deoxyribonucleic acid (DNA) sequencing instruments has prompted the recent development of de novo short read assembly algorithms. A common shortcoming of the available tools is their inability to efficiently assemble vast amounts of data generated from large-scale sequencing projects, such as the sequencing of individual human genomes to catalog natural genetic variation. To address this limitation, we developed ABySS (Assembly By Short Sequences), a parallelized sequence assembler. As a demonstration of the capability of our software, we assembled 3.5 billion paired-end reads from the genome of an African male publicly released by Illumina, Inc. Approximately 2.76 million contigs ≥100 base pairs (bp) in length were created with an N50 size of 1499 bp, representing 68% of the reference human genome. Analysis of these contigs identified polymorphic and novel sequences not present in the human reference assembly, which were validated by alignment to alternate human assemblies and to other primate genomes. © 2009 by Cold Spring Harbor Laboratory Press.",
            "authors": [
                "Simpson J.T.",
                "Wong K.",
                "Jackman S.D.",
                "Schein J.E.",
                "Jones S.J.M.",
                "Birol I."
            ],
            "cit_count": 2053,
            "doi": "10.1101/gr.089532.108",
            "journal": "Genome Research",
            "title": "ABySS: A parallel assembler for short read sequence data",
            "type": "Primary",
            "year": "2009-06-01"
        },
        {
            "abstract": "© 2017 Jackman et al. The assembly of DNA sequences de novo is fundamental to genomics research. It is the first of many steps toward elucidating and characterizing whole genomes. Downstream applications, including analysis of genomic variation between species, between or within individuals critically depend on robustly assembled sequences. In the span of a single decade, the sequence throughput of leading DNA sequencing instruments has increased drastically, and coupled with established and planned large-scale, personalized medicine initiatives to sequence genomes in the thousands and even millions, the development of efficient, scalable and accurate bioinformatics tools for producing high-quality reference draft genomes is timely. With ABySS 1.0, we originally showed that assembling the human genome using short 50-bp sequencing reads was possible by aggregating the half terabyte of compute memory needed over several computers using a standardized message-passing system (MPI). We present here its redesign, which departs from MPI and instead implements algorithms that employ a Bloom filter, a probabilistic data structure, to represent a de Bruijn graph and reduce memory requirements. We benchmarked ABySS 2.0 human genome assembly using a Genome in a Bottle data set of 250-bp Illumina paired-end and 6-kbp matepair libraries from a single individual. Our assembly yielded a NG50 (NGA50) scaffold contiguity of 3.5 (3.0) Mbp using <35 GB of RAM. This is a modest memory requirement by today's standards and is often available on a single computer.We also investigate the use of BioNano Genomics and 10x Genomics' Chromium data to further improve the scaffold NG50 (NGA50) of this assembly to 42 (15) Mbp.",
            "authors": [
                "Jackman S.D.",
                "Vandervalk B.P.",
                "Mohamadi H.",
                "Chu J.",
                "Yeo S.",
                "Hammond S.A.",
                "Jahesh G.",
                "Khan H.",
                "Coombe L.",
                "Warren R.L.",
                "Birol I."
            ],
            "cit_count": 97,
            "doi": "10.1101/gr.214346.116",
            "journal": "Genome Research",
            "title": "ABySS 2.0: Resource-efficient assembly of large genomes using a Bloom filter",
            "type": "Primary",
            "year": "2017-05-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:abyss",
        "biotoolsID": "abyss",
        "description": "De novo genome sequence assembler.",
        "homepage": "https://github.com/bcgsc/abyss/",
        "name": "ABySS",
        "version": [
            "1.9.0"
        ]
    }
}