{
    "accessibility": "Open access",
    "additionDate": "2022-03-21T12:36:31.306716Z",
    "biotoolsCURIE": "biotools:longshot",
    "biotoolsID": "longshot",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "vibansal@ucsd.edu",
            "name": "Vikas Bansal",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Longshot is a variant calling tool for diploid genomes using long error prone reads such as Pacific Biosciences (PacBio) SMRT and Oxford Nanopore Technologies (ONT). It takes as input an aligned BAM file and outputs a phased VCF file with variants and haplotype information. It can also genotype and phase input VCF files. It can output haplotype-separated BAM files that can be used for downstream analysis. Currently, it only calls single nucleotide variants (SNVs), but it can genotype indels if they are given in an input VCF.",
    "documentation": [
        {
            "type": [
                "Installation instructions"
            ],
            "url": "https://bioconda.github.io/recipes/longshot/README.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://github.com/pjedge/longshot",
    "lastUpdate": "2022-03-21T12:43:38.886402Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/pjedge/longshot/issues"
        }
    ],
    "name": "Longshot",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1038/s41467-019-12493-y",
            "metadata": {
                "abstract": "© 2019, The Author(s).Whole-genome sequencing using sequencing technologies such as Illumina enables the accurate detection of small-scale variants but provides limited information about haplotypes and variants in repetitive regions of the human genome. Single-molecule sequencing (SMS) technologies such as Pacific Biosciences and Oxford Nanopore generate long reads that can potentially address the limitations of short-read sequencing. However, the high error rate of SMS reads makes it challenging to detect small-scale variants in diploid genomes. We introduce a variant calling method, Longshot, which leverages the haplotype information present in SMS reads to accurately detect and phase single-nucleotide variants (SNVs) in diploid genomes. We demonstrate that Longshot achieves very high accuracy for SNV detection using whole-genome Pacific Biosciences data, outperforms existing variant calling methods, and enables variant detection in duplicated regions of the genome that cannot be mapped using short reads.",
                "authors": [
                    {
                        "name": "Bansal V."
                    },
                    {
                        "name": "Edge P."
                    }
                ],
                "citationCount": 49,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Nature Communications",
                "title": "Longshot enables accurate variant calling in diploid genomes from single-molecule long read sequencing"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ]
}
