{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.zbh.uni-hamburg.de/en/research/application-oriented-bioinformatics.html"}],"function":[{"operation":[{"term":"Pathway or network analysis","uri":"http://edamontology.org/operation_2497"}]},{"operation":[{"term":"Mapping","uri":"http://edamontology.org/operation_2429"}]}],"labels":{"collectionID":["JIB.tools"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Desktop application"],"topic":[{"term":"ChIP-seq","uri":"http://edamontology.org/topic_3169"},{"term":"Mapping","uri":"http://edamontology.org/topic_0102"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"},{"term":"Data architecture, analysis and design","uri":"http://edamontology.org/topic_3365"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/cassys-interactive-analysis-chip-seq-data.html"},{"note":"CASSys@JIB.tools - a web registry of tools published in the Journal of Integrative Bioinformatics","type":"SOFTWARE_CATALOGUE","url":"https://jib.tools/details.php?id=69"}],"publication":[{"abstract":"We present CisGenome, a software system for analyzing genome-wide chromatin immunoprecipitation (ChIP) data. CisGenome is designed to meet all basic needs of ChIP data analyses, including visualization, data normalization, peak detection, false discovery rate computation, gene-peak association, and sequence and motif analysis. In addition to implementing previously published ChIP-microarray (ChIP-chip) analysis methods, the software contains statistical methods designed specifically for ChlP sequencing (ChIP-seq) data obtained by coupling ChIP with massively parallel sequencing. The modular design of CisGenome enables it to support interactive analyses through a graphic user interface as well as customized batch-mode computation for advanced data mining. A built-in browser allows visualization of array images, signals, gene structure, conservation, and DNA sequence and motif information. We demonstrate the use of these tools by a comparative analysis of ChIP-chip and ChIP-seq data for the transcription factor NRSF/REST, a study of ChIP-seq analysis with or without a negative control sample, and an analysis of a new motif in Nanog- and Sox2-binding regions. © 2008 Nature Publishing Group.","authors":["Ji H.","Jiang H.","Ma W.","Johnson D.S.","Myers R.M.","Wong W.H."],"cit_count":534,"doi":"10.1038/nbt.1505","journal":"Nature Biotechnology","title":"An integrated software system for analyzing ChIP-chip and ChIP-seq data","type":"Primary","year":"2008-11-01"}],"summary":{"biotoolsCURIE":"biotools:cassys","biotoolsID":"cassys","description":"An integrated system that supports all steps of computational ChIP-seq data analysis and supersedes the laborious application of several single command line tools. It provides functionality ranging from quality assessment and -control of short reads, over the mapping of reads against a reference genome (readmapping) and the detection of enriched regions (peakdetection) to various follow-up analyses.","homepage":"http://www.zbh.uni-hamburg.de/en/research/application-oriented-bioinformatics/researchprojects/cassys.html","name":"CASSys"}}