{"credit":[{"email":"mlux@techfak.uni-bielefeld.de","name":"Markus Lux","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://github.com/mlux86/flowLearn"}],"function":[{"operation":[{"term":"Spectral analysis","uri":"http://edamontology.org/operation_3214"}]}],"labels":{"language":["R","Shell"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Library"],"topic":[{"term":"Cell biology","uri":"http://edamontology.org/topic_2229"},{"term":"Population genetics","uri":"http://edamontology.org/topic_3056"},{"term":"Biomarkers","uri":"http://edamontology.org/topic_3360"}]},"publication":[{"abstract":"© The Author(s) 2018. Published by Oxford University Press. All rights reserved. Motivation: Identification of cell populations in flow cytometry is a critical part of the analysis and lays the groundwork for many applications and research discovery. The current paradigm of manual analysis is time consuming and subjective. A common goal of users is to replace manual analysis with automated methods that replicate their results. Supervised tools provide the best performance in such a use case, however they require fine parameterization to obtain the best results. Hence, there is a strong need for methods that are fast to setup, accurate and interpretable. Results: flowLearn is a semi-supervised approach for the quality-checked identification of cell populations. Using a very small number of manually gated samples, through density alignments it is able to predict gates on other samples with high accuracy and speed. On two state-of-the-art datasets, our tool achieves median?F1?-measures exceeding 0.99 for 31%, and 0.90 for 80% of all analyzed populations. Furthermore, users can directly interpret and adjust automated gates on new sample files to iteratively improve the initial training.","authors":["Lux M.","Brinkman R.R.","Chauve C.","Laing A.","Lorenc A.","Abeler-Dorner L.","Hammer B."],"cit_count":2,"doi":"10.1093/bioinformatics/bty082","journal":"Bioinformatics","title":"FlowLearn: Fast and precise identification and quality checking of cell populations in flow cytometry","year":"2018-07-01"}],"summary":{"biotoolsCURIE":"biotools:flowlearn","biotoolsID":"flowlearn","description":"Fast and precise identification and quality checking of cell populations in flow cytometry.","homepage":"https://github.com/mlux86/flowLearn","name":"flowLearn"}}