{
    "additionDate": "2020-01-09T17:57:13Z",
    "biotoolsCURIE": "biotools:TFBSshape",
    "biotoolsID": "TFBSshape",
    "confidence_flag": "tool",
    "description": "an expanded motif database for DNA shape features of transcription factor binding sites.\n\nResponsive Bootstrap 4 Admin & Dashboard Template.\n\nTFBSshape provides DNA shape features for transcription factor binding sites (TFBSs). These structural features refine the description of TF binding specificities and provide mechanistic insights into protein–DNA recognition. The DNA shape features were predicted using our recently published high-throughput method (Zhou et al. NAR 2013) and visualized in the form of heat maps. Users can download these DNA shape feature data and perform further analysis, for example, to identify which DNA shape feature(s) at which position(s) in the target DNA contribute to the DNA binding specificity of a TF. Users can also compare DNA shape profiles, both qualitatively and quantitatively, between two TF datasets from the database, or between a set of uploaded sequences and a TF from the database",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA profiling",
                    "uri": "http://edamontology.org/operation_3894"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                },
                {
                    "term": "Transcription factor binding site prediction",
                    "uri": "http://edamontology.org/operation_0445"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://tfbsshape.usc.edu",
    "lastUpdate": "2024-11-24T20:52:22.028611Z",
    "name": "TFBSshape",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/nar/gkz970",
            "metadata": {
                "abstract": "TFBSshape (https://tfbsshape.usc.edu) is a motif database for analyzing structural profiles of transcription factor binding sites (TFBSs). The main rationale for this database is to be able to derive mechanistic insights in protein-DNA readout modes from sequencing data without available structures. We extended the quantity and dimensionality of TFBSshape, from mostly in vitro to in vivo binding and from unmethylated to methylated DNA. This new release of TFBSshape improves its functionality and launches a responsive and user-friendly web interface for easy access to the data. The current expansion includes new entries from the most recent collections of transcription factors (TFs) from the JASPAR and UniPROBE databases, methylated TFBSs derived from in vitro high-throughput EpiSELEX-seq binding assays and in vivo methylated TFBSs from the MeDReaders database. TFBSshape content has increased to 2428 structural profiles for 1900 TFs from 39 different species. The structural profiles for each TFBS entry now include 13 shape features and minor groove electrostatic potential for standard DNA and four shape features for methylated DNA. We improved the flexibility and accuracy for the shape-based alignment of TFBSs and designed new tools to compare methylated and unmethylated structural profiles of TFs and methods to derive DNA shape-preserving nucleotide mutations in TFBSs.",
                "authors": [
                    {
                        "name": "Chiu T.-P."
                    },
                    {
                        "name": "Markarian N."
                    },
                    {
                        "name": "Rohs R."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Xin B."
                    }
                ],
                "citationCount": 30,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "TFBSshape: An expanded motif database for DNA shape features of transcription factor binding sites"
            },
            "pmcid": "PMC7145579",
            "pmid": "31665425"
        }
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Methylated DNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3674"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
