{
    "additionDate": "2021-01-18T07:39:12Z",
    "biotoolsCURIE": "biotools:promad",
    "biotoolsID": "promad",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hagen.eckert@tu-dresden.de",
            "name": "Hagen Eckert",
            "orcidid": "https://orcid.org/0000-0003-4771-1435",
            "typeEntity": "Person"
        }
    ],
    "description": "semiquantitative densitometric measurement of protein microarrays.\n\npip install -U git+https://github.com/theia-dev/proMAD.git#egg=proMAD.\n\nThere could be missing functionality and undocumented behavior. If you have feedback to improve the service please send your idea to info@promad.dev.\n\nYou can also install the latest version directly from GitHub.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                }
            ]
        }
    ],
    "homepage": "https://promad.dev",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-27T17:56:14Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/theia-dev/proMAD"
        }
    ],
    "name": "proMAD",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12859-020-3402-4",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Protein microarrays are a versatile and widely used tool for analyzing complex protein mixtures. Membrane arrays utilize antibodies which are captured on a membrane to specifically immobilize several proteins of interest at once. Using detection antibodies, the bound protein-Antibody-complex is converted into visual signals, which can be quantified using densitometry. The reliability of such densitometric assessments depends on a variety of factors, not only sample preparation and the choice of acquisition device but also the selected analysis software and the algorithms used for readout and processing data. Currently available software packages use a single image of a membrane at an optimal exposure time selected for that specific experimental framework. This selection is based on a user's best guess and is subject to inter-user variability or the acquisition device algorithm. With modern image acquisition systems proving the capacity to collect signal development over time, this information can be used to improve densitometric measurements. Here we introduce proMAD, a toolkit for protein microarray analysis providing a novel systemic approach for the quantification of membrane arrays based on the kinetics of the analytical reaction. Results: Briefly, our toolkit ensures an exact membrane alignment, utilizing basic computer vision techniques. It also provides a stable method to estimate the background light level. Finally, we model the light production over time, utilizing the knowledge about the reaction kinetics of the underlying horseradish peroxidase-based signal detection method. Conclusion: proMAD incorporates the reaction kinetics of the enzyme to model the signal development over time for each membrane creating an individual, self-referencing concept. Variations of membranes within a given experimental set up can be accounted for, allowing for a better comparison of such. While the open-source library can be implemented in existing workflows and used for highly user-Tailored analytic setups, the web application, on the other hand, provides easy platform-independent access to the core algorithm to a wide range of researchers. proMAD's inherent flexibility has the potential to cover a wide range of use-cases and enables the automation of data analytic tasks.",
                "authors": [
                    {
                        "name": "Bray L.J."
                    },
                    {
                        "name": "Eckert H."
                    },
                    {
                        "name": "Jaeschke A."
                    }
                ],
                "date": "2020-02-24T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "ProMAD: Semiquantitative densitometric measurement of protein microarrays"
            },
            "pmcid": "PMC7041094",
            "pmid": "32093608"
        }
    ],
    "topic": [
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ]
}
