{
    "additionDate": "2021-01-18T07:45:12Z",
    "biotoolsCURIE": "biotools:lumi-pcr",
    "biotoolsID": "lumi-pcr",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "anthony.uren@gmail.com",
            "name": "Anthony G. Uren",
            "orcidid": "https://orcid.org/0000-0002-6019-7111",
            "typeEntity": "Person"
        }
    ],
    "description": "An Illumina platform ligation-mediated PCR protocol for integration site cloning, provides molecular quantitation of integration sites.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Demultiplexing",
                    "uri": "http://edamontology.org/operation_3933"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                },
                {
                    "term": "Primer removal",
                    "uri": "http://edamontology.org/operation_3237"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                }
            ]
        }
    ],
    "homepage": "https://github.com/anthonyuren/LUMI-PCR-pipeline/",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-19T08:04:59Z",
    "name": "LUMI-PCR",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S13100-020-0201-4",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Ligation-mediated PCR protocols have diverse uses including the identification of integration sites of insertional mutagens, integrating vectors and naturally occurring mobile genetic elements. For approaches that employ NGS sequencing, the relative abundance of integrations within a complex mixture is typically determined through the use of read counts or unique fragment lengths from a ligation of sheared DNA; however, these estimates may be skewed by PCR amplification biases and saturation of sequencing coverage. Results: Here we describe a modification of our previous splinkerette based ligation-mediated PCR using a novel Illumina-compatible adapter design that prevents amplification of non-target DNA and incorporates unique molecular identifiers. This design reduces the number of PCR cycles required and improves relative quantitation of integration abundance for saturating sequencing coverage. By inverting the forked adapter strands from a standard orientation, the integration-genome junction can be sequenced without affecting the sequence diversity required for cluster generation on the flow cell. Replicate libraries of murine leukemia virus-infected spleen samples yielded highly reproducible quantitation of clonal integrations as well as a deep coverage of subclonal integrations. A dilution series of DNAs bearing integrations of MuLV or piggyBac transposon shows linearity of the quantitation over a range of concentrations. Conclusions: Merging ligation and library generation steps can reduce total PCR amplification cycles without sacrificing coverage or fidelity. The protocol is robust enough for use in a 96 well format using an automated liquid handler and we include programs for use of a Beckman Biomek liquid handling workstation. We also include an informatics pipeline that maps reads, builds integration contigs and quantitates integration abundance using both fragment lengths and unique molecular identifiers. Suggestions for optimizing the protocol to other target DNA sequences are included. The reproducible distinction of clonal and subclonal integration sites from each other allows for analysis of populations of cells undergoing selection, such as those found in insertional mutagenesis screens.",
                "authors": [
                    {
                        "name": "Bolt B.J."
                    },
                    {
                        "name": "Caceres J.J."
                    },
                    {
                        "name": "Dawes J.C."
                    },
                    {
                        "name": "Dewchand H."
                    },
                    {
                        "name": "Dharmalingam G."
                    },
                    {
                        "name": "Dore M."
                    },
                    {
                        "name": "Game L."
                    },
                    {
                        "name": "Garcia-Diaz C."
                    },
                    {
                        "name": "Iadarola B."
                    },
                    {
                        "name": "Kaczor J."
                    },
                    {
                        "name": "McLatchie A.P."
                    },
                    {
                        "name": "Paccanaro A."
                    },
                    {
                        "name": "Parrinello S."
                    },
                    {
                        "name": "Uren A.G."
                    },
                    {
                        "name": "Webster P."
                    }
                ],
                "date": "2020-02-04T00:00:00Z",
                "journal": "Mobile DNA",
                "title": "LUMI-PCR: An Illumina platform ligation-mediated PCR protocol for integration site cloning, provides molecular quantitation of integration sites"
            },
            "pmcid": "PMC7001329",
            "pmid": "32042315"
        }
    ],
    "toolType": [
        "Library",
        "Script"
    ],
    "topic": [
        {
            "term": "Mobile genetic elements",
            "uri": "http://edamontology.org/topic_0798"
        },
        {
            "term": "PCR experiment",
            "uri": "http://edamontology.org/topic_3519"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
