{
    "additionDate": "2021-01-18T12:31:41Z",
    "biotoolsCURIE": "biotools:pyvisa",
    "biotoolsID": "pyvisa",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "enrico.riccardi@ntnu.no",
            "name": "Enrico Riccardi",
            "typeEntity": "Person"
        }
    ],
    "description": "Visualization and Analysis of path sampling trajectories.\n\nRare event methods applied to molecular simulations are growing in popularity, accessible and customizable software solutions have thus been developed and released. One of the most recent is PyRETIS, an open Python library for performing path sampling simulations. Here, we introduce PyVisA, a postprocessing package for path sampling simulations, which includes visualization and analysis tools for interpreting path sampling outputs. PyVisA integrates PyRETIS functionalities and aims to facilitate the determination of: (a) the correlation of the order parameter with other descriptors; (b) the presence of latent variables; and (c) intermediate meta-stable states. To illustrate some of the main PyVisA features, we investigate the proton transfer reaction in a protonated water trimer simulated via a simple polarizable model (Stillinger-David)",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular surface calculation",
                    "uri": "http://edamontology.org/operation_0387"
                },
                {
                    "term": "Simulation analysis",
                    "uri": "http://edamontology.org/operation_0244"
                },
                {
                    "term": "Trajectory visualization",
                    "uri": "http://edamontology.org/operation_3890"
                }
            ]
        }
    ],
    "homepage": "https://pyvisa.readthedocs.io/en/latest/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-31T11:07:22Z",
    "name": "PyVisA",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1002/JCC.26467",
            "metadata": {
                "abstract": "© 2020 Wiley Periodicals LLC.Rare event methods applied to molecular simulations are growing in popularity, accessible and customizable software solutions have thus been developed and released. One of the most recent is PyRETIS, an open Python library for performing path sampling simulations. Here, we introduce PyVisA, a postprocessing package for path sampling simulations, which includes visualization and analysis tools for interpreting path sampling outputs. PyVisA integrates PyRETIS functionalities and aims to facilitate the determination of: (a) the correlation of the order parameter with other descriptors; (b) the presence of latent variables; and (c) intermediate meta-stable states. To illustrate some of the main PyVisA features, we investigate the proton transfer reaction in a protonated water trimer simulated via a simple polarizable model (Stillinger−David).",
                "authors": [
                    {
                        "name": "Aaroen O."
                    },
                    {
                        "name": "Kiaer H."
                    },
                    {
                        "name": "Riccardi E."
                    }
                ],
                "citationCount": 2,
                "date": "2021-03-05T00:00:00Z",
                "journal": "Journal of Computational Chemistry",
                "title": "PyVisA: Visualization and Analysis of path sampling trajectories"
            },
            "pmid": "33314210"
        }
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Sample collections",
            "uri": "http://edamontology.org/topic_3277"
        }
    ]
}
