{
    "additionDate": "2021-01-18T10:27:19Z",
    "biotoolsCURIE": "biotools:hmvv",
    "biotoolsID": "hmvv",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "pachristensen@houstonmethodist.org",
            "name": "Paul A Christensen",
            "typeEntity": "Person"
        }
    ],
    "description": "Houston Methodist Variant Viewer.\n\nHouston Methodist Variant Viewer (HMVV) is an application to support interpretation of Next Generation Sequencing (NGS) variants.\n\nThe bioinformatics pipeline scripts associated with this application is uploaded to github - please see https://github.com/hmvv/ngs_pipelines. Setup a cron job to run the MAIN_runPipelines.sh script.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Variant filtering",
                    "uri": "http://edamontology.org/operation_3675"
                },
                {
                    "term": "Variant effect prediction",
                    "uri": "http://edamontology.org/operation_0331"
                }
            ]
        }
    ],
    "homepage": "https://github.com/hmvv",
    "language": [
        "Java"
    ],
    "lastUpdate": "2021-01-30T11:58:34Z",
    "license": "AGPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/hmvv/hmvv"
        }
    ],
    "name": "HMVV",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/JAMIAOPEN/OOAA004",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of the American Medical Informatics Association.Objectives: Informatics tools that support next-generation sequencing workflows are essential to deliver timely interpretation of somatic variants in cancer. Here, we describe significant updates to our laboratory developed bioinformatics pipelines and data management application termed Houston Methodist Variant Viewer (HMVV). Materials and Methods: We collected feature requests and workflow improvement suggestions from the end-users of HMVV version 1. Over 1.5 years, we iteratively implemented these features in five sequential updates to HMVV version 3. Results: We improved the performance and data throughput of the application while reducing the opportunity for manual data entry errors. We enabled end-user workflows for pipeline monitoring, variant interpretation and annotation, and integration with our laboratory information system. System maintenance was improved through enhanced defect reporting, heightened data security, and improved modularity in the code and system environments. Discussion and Conclusion: Validation of each HMVV update was performed according to expert guidelines. We enabled an 8⨯ reduction in the bioinformatics pipeline computation time for our longest running assay. Our molecular pathologists can interpret the assay results at least 2 days sooner than was previously possible. The application and pipeline code are publicly available at https://github.com/hmvv.",
                "authors": [
                    {
                        "name": "Christensen P.A."
                    },
                    {
                        "name": "Subedi S."
                    },
                    {
                        "name": "Pepper K."
                    },
                    {
                        "name": "Hendrickson H.L."
                    },
                    {
                        "name": "Li Z."
                    },
                    {
                        "name": "Thomas J.S."
                    },
                    {
                        "name": "Wesley Long S."
                    },
                    {
                        "name": "Olsen R.J."
                    }
                ],
                "date": "2020-07-01T00:00:00Z",
                "journal": "JAMIA Open",
                "title": "Development and validation of Houston Methodist Variant Viewer version 3: Updates to our application for interpretation of next-generation sequencing data"
            },
            "pmcid": "PMC7382636",
            "pmid": "32734171"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}