{
    "additionDate": "2017-02-14T09:35:22Z",
    "biotoolsCURIE": "biotools:tfam",
    "biotoolsID": "tfam",
    "description": "System to classify the function of tRNAs that is based on tRNA structural alignments.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Global structure alignment",
                    "uri": "http://edamontology.org/operation_0510"
                },
                {
                    "term": "Pairwise structure alignment",
                    "uri": "http://edamontology.org/operation_0503"
                },
                {
                    "term": "Structure alignment",
                    "uri": "http://edamontology.org/operation_0295"
                },
                {
                    "term": "Local structure alignment",
                    "uri": "http://edamontology.org/operation_0509"
                }
            ]
        }
    ],
    "homepage": "http://tfam.lcb.uu.se/",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:40Z",
    "name": "TFAM",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "We present TFAM, an automated, statistical method to classify the identity of tRNAs. TFAM, currently optimized for bacteria, classifies initiator tRNAs and predicts the charging identity of both typical and atypical tRNAs such as suppressors with high confidence. We show statistical evidence for extensive variation in tRNA identity determinants among bacterial genomes due to variation in overall tDNA base content. With TFAM we have detected the first case of eukaryotic-like tRNA identity rules in bacteria. An α-proteobacterial clade encompassing Rhizobiales, Caulobacter crescentus Silicibacter pomeroyi, unlike a sister clade containing the Rickettsiales, Zymomonas mobilis and Gluconobacter oxydans, uses the eukaryotic identity element A73 instead of the highly conserved prokaryotic element C73. We confirm divergence of bacterial histidylation rules by demonstrating perfect covariation of α-proteobacterial tRNAHis acceptor stems and residues in the motif IIb tRNA-binding pocket of their histidyl-tRNA synthetases (HisRS). Phylogenomic analysis supports lateral transfer of a eukaryotic-like HisRS into the α-proteobacteria followed by in situ adaptation of the bacterial tDNAHis and identity rule divergence. Our results demonstrate that TFAM is an effective tool for the bioinformatics, comparative genomics and evolutionary study of tRNA identity. © 2006 Oxford University Press.",
                "authors": [
                    {
                        "name": "Ardell D.H."
                    },
                    {
                        "name": "Andersson S.G.E."
                    }
                ],
                "citationCount": 49,
                "date": "2006-03-20T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "TFAM detects co-evolution of tRNA identity rules with lateral transfer of histidyl-tRNA synthetase"
            },
            "pmid": "16473847"
        },
        {
            "pmid": "17591612"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        }
    ],
    "validated": 1
}