{
    "additionDate": "2021-01-18T11:34:06Z",
    "biotoolsCURIE": "biotools:rew-isa",
    "biotoolsID": "rew-isa",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hui.liu@cumt.edu.cn",
            "name": "Hui Liu",
            "orcidid": "https://orcid.org/0000-0002-7404-5231",
            "typeEntity": "Person"
        }
    ],
    "description": "unveiling local functional blocks in epi-transcriptome profiling data via an RNA expression-weighted iterative signature algorithm.\n\nREW-ISA now supports calling in the form of R packages. The Github link of REW-ISA R package is: https://github.com/cst-cumt/REWISA.\n\nREW-ISA is used to find potential local functional blocks (LFB) based on MeRIP-Seq data, where sites are hyper-methylated or hypo-methylated simultaneously across the specific conditions. REW-ISA adopts RNA expression levels of each site as weights to make sites of lower expression level less significant.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Gene methylation analysis",
                    "uri": "http://edamontology.org/operation_3207"
                },
                {
                    "term": "Pathway analysis",
                    "uri": "http://edamontology.org/operation_3928"
                }
            ]
        }
    ],
    "homepage": "https://github.com/cst-cumt/REW-ISA",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-06T14:22:26Z",
    "name": "REW-ISA",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03787-W",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Recent studies have shown that N 6-methyladenosine (m6A) plays a critical role in numbers of biological processes and complex human diseases. However, the regulatory mechanisms of most methylation sites remain uncharted. Thus, in-depth study of the epi-transcriptomic patterns of m6A may provide insights into its complex functional and regulatory mechanisms. Results: Due to the high economic and time cost of wet experimental methods, revealing methylation patterns through computational models has become a more preferable way, and drawn more and more attention. Considering the theoretical basics and applications of conventional clustering methods, an RNA Expression Weighted Iterative Signature Algorithm (REW-ISA) is proposed to find potential local functional blocks (LFBs) based on MeRIP-Seq data, where sites are hyper-methylated or hypo-methylated simultaneously across the specific conditions. REW-ISA adopts RNA expression levels of each site as weights to make sites of lower expression level less significant. It starts from random sets of sites, then follows iterative search strategies by thresholds of rows and columns to find the LFBs in m6A methylation profile. Its application on MeRIP-Seq data of 69,446 methylation sites under 32 experimental conditions unveiled 6 LFBs, which achieve higher enrichment scores than ISA. Pathway analysis and enzyme specificity test showed that sites remained in LFBs are highly relevant to the m6A methyltransferase, such as METTL3, METTL14, WTAP and KIAA1429. Further detailed analyses for each LFB even showed that some LFBs are condition-specific, indicating that methylation profiles of some specific sites may be condition relevant. Conclusions: REW-ISA finds potential local functional patterns presented in m6A profiles, where sites are co-methylated under specific conditions.",
                "authors": [
                    {
                        "name": "Zhang L."
                    },
                    {
                        "name": "Chen S."
                    },
                    {
                        "name": "Zhu J."
                    },
                    {
                        "name": "Meng J."
                    },
                    {
                        "name": "Liu H."
                    }
                ],
                "citationCount": 2,
                "date": "2020-10-09T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "REW-ISA: Unveiling local functional blocks in epi-transcriptome profiling data via an RNA expression-weighted iterative signature algorithm"
            },
            "pmcid": "PMC7547494",
            "pmid": "33036550"
        }
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ]
}