{
    "additionDate": "2022-05-29T17:29:52.704089Z",
    "biotoolsCURIE": "biotools:arraymining.net",
    "biotoolsID": "arraymining.net",
    "credit": [
        {
            "email": "enrico.glaab@uni.lu",
            "name": "Enrico Glaab"
        }
    ],
    "description": "ArrayMining.net is a server for automatic analysis of DNA-microarray data, providing Cross-study normalisation, Feature selection, Clustering, Prediction, Co-Expression Network Analysis and Gene Set analysis (BMC Bioinformatics, 2009, http://www.biomedcentral.com/1471-2105/10/358)",
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://www.arraymining.net/",
    "lastUpdate": "2022-05-29T17:34:23.681845Z",
    "name": "ArrayMining.net",
    "owner": "enricogl",
    "publication": [
        {
            "doi": "10.1186/1471-2105-10-358",
            "metadata": {
                "abstract": "Background: Statistical analysis of DNA microarray data provides a valuable diagnostic tool for the investigation of genetic components of diseases. To take advantage of the multitude of available data sets and analysis methods, it is desirable to combine both different algorithms and data from different studies. Applying ensemble learning, consensus clustering and cross-study normalization methods for this purpose in an almost fully automated process and linking different analysis modules together under a single interface would simplify many microarray analysis tasks. Results: We present ArrayMining.net, a web-application for microarray analysis that provides easy access to a wide choice of feature selection, clustering, prediction, gene set analysis and cross-study normalization methods. In contrast to other microarray-related web-tools, multiple algorithms and data sets for an analysis task can be combined using ensemble feature selection, ensemble prediction, consensus clustering and cross-platform data integration. By interlinking different analysis tools in a modular fashion, new exploratory routes become available, e.g. ensemble sample classification using features obtained from a gene set analysis and data from multiple studies. The analysis is further simplified by automatic parameter selection mechanisms and linkage to web tools and databases for functional annotation and literature mining. Conclusion: ArrayMining.net is a free web-application for microarray analysis combining a broad choice of algorithms based on ensemble and consensus methods, using automatic parameter selection and integration with annotation databases. © 2009 Glaab et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Garibaldi J.M."
                    },
                    {
                        "name": "Glaab E."
                    },
                    {
                        "name": "Krasnogor N."
                    }
                ],
                "citationCount": 89,
                "date": "2009-10-28T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "ArrayMining: A modular web-application for microarray analysis combining ensemble and consensus methods with cross-study normalization"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        },
        {
            "term": "Functional genomics",
            "uri": "http://edamontology.org/topic_0085"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}
