
{
    "credit": [
        {
            "email": "bahman@jhu.edu",
            "name": "Bahman Afsari",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://bioconductor.org/packages/release/bioc/html/GSReg.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/GSReg_1.8.0.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Gene set testing",
                    "uri": "http://edamontology.org/operation_3224"
                },
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "language": [
            "R"
        ],
        "license": "GPL-2.0",
        "operatingSystem": [
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "Molecular genetics",
                "uri": "http://edamontology.org/topic_3321"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2014 the authors, publisher and licensee Libertas academica Limited. Analysis of gene sets can implicate activity in signaling pathways that is responsible for cancer initiation and progression, but is not discernible from the analysis of individual genes. Multiple methods and software packages have been developed to infer pathway activity from expression measurements for set of genes targeted by that pathway. Broadly, three major methodologies have been proposed: over-representation, enrichment, and differential variability. Both over-representation and enrichment analyses are effective techniques to infer differentially regulated pathways from gene sets with relatively consistent differentially expressed (DE) genes. Specifically, these algorithms aggregate statistics from each gene in the pathway. However, they overlook multivariate patterns related to gene interactions and variations in expression. Therefore, the analysis of differential variability of multigene expression patterns can be essential to pathway inference in cancers. The corresponding methodologies and software packages for such multivariate variability analysis of pathways are reviewed here. We also introduce a new, computationally efficient algorithm, expression variation analysis (EVA), which has been implemented along with a previously proposed algorithm, Differential Rank Conservation (DIRAC), in an open source R package, gene set regulation (GSReg). EVA inferred similar pathways as DIRAC at reduced computational costs. Moreover, EVA also inferred different dysregulated pathways than those identified by enrichment analysis.",
            "authors": [
                "Afsari B.",
                "Geman D."
            ],
            "cit_count": 22,
            "doi": "10.4137/CIN.S14066",
            "journal": "Cancer Informatics",
            "title": "Learning Dysregulated Pathways in Cancers from Differential Variability Analysis",
            "type": "Primary",
            "year": "2014-10-16"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:gsreg",
        "biotoolsID": "gsreg",
        "description": "A package for gene set analysis based on the variability of expressions. It implements DIfferential RAnk Conservation (DIRAC) and gene set Expression Variation Analysis (EVA) methods.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/GSReg.html",
        "name": "GSReg",
        "version": [
            "1.8.0"
        ]
    }
}