
{
    "credit": [
        {
            "email": "Aleksandra.Gruca@polsl.pl",
            "name": "Aleksandra Gruca",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://rulego.polsl.pl/documentation;jsessionid=BC79FD75AD9B99A1B5A633CC526913E9"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence annotation",
                    "uri": "http://edamontology.org/operation_0361"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Ontology and terminology",
                "uri": "http://edamontology.org/topic_0089"
            },
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "Gene and protein families",
                "uri": "http://edamontology.org/topic_0623"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Genome-wide expression profiles obtained with the use of DNA microarray technology provide abundance of experimental data on biological and molecular processes. Such amount of data need to be further analyzed and interpreted in order to obtain biological conclusions on the basis of experimental results. The analysis requires a lot of experience and is usually time-consuming process. Thus, frequently various annotation databases are used to improve the whole process of analysis. Here, we present RuleGO - the web-based application that allows the user to describe gene groups on the basis of logical rules that include Gene Ontology (GO) terms in their premises. Presented application allows obtaining rules that reflect coappearance of GO-terms describing genes supported by the rules. The ontology level and number of coappearing GO-terms is adjusted in automatic manner. The user limits the space of possible solutions only. The RuleGO application is freely available at http://rulego.polsl.pl/. © 2011 The Author(s).",
            "authors": [
                "Gruca A.",
                "Sikora M.",
                "Polanski A."
            ],
            "cit_count": 10,
            "journal": "Nucleic Acids Research",
            "pmid": "21715384",
            "title": "RuleGO: A logical rules-based tool for description of gene groups by means of Gene Ontology",
            "year": "2011-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:rulego",
        "biotoolsID": "rulego",
        "description": "RuleGO is a web tool for description of gene groups by means of Gene Ontology. The user is able to describe gene groups on the basis of logical rules that include GO-terms in their premises.",
        "homepage": "http://rulego.polsl.pl",
        "name": "RuleGO"
    }
}