{
    "accessibility": "Open access",
    "additionDate": "2017-02-10T11:34:44Z",
    "biotoolsCURIE": "biotools:pipealign",
    "biotoolsID": "pipealign",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "akress@unistra.fr",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Takes one or more protein sequences as input and analyzes them in a five-step process during which searches for sequence homologues, analyses of multiple sequence alignments, and hierarchical relationships between protein subfamilies are performed.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                },
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                },
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "homepage": "http://www.lbgi.fr/pipealign",
    "lastUpdate": "2024-11-24T21:03:24.978595Z",
    "license": "Unlicense",
    "maturity": "Mature",
    "name": "PipeAlign2",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": "10.1093/nar/28.15.2919",
            "metadata": {
                "abstract": "DbClustal addresses the important problem of the automatic multiple alignment of the top scoring full-length sequences detected by a database homology search. By combining the advantages of both local and global alignment algorithms into a single system, DbClustal is able to provide accurate global alignments of highly divergent, complex sequence sets. Local alignment information is incorporated into a ClustalW global alignment in the form of a list of anchor points between pairs of sequences. The method is demonstrated using anchors supplied by the Blast post-processing program, Ballast. The rapidity and reliability of DbClustal have been demonstrated using the recently annotated Pyrococcus abyssi proteome where the number of alignments with totally misaligned sequences was reduced from 20% to <2%. A web site has been implemented proposing BlastP database searches with automatic alignment of the top hits by DbClustal.",
                "authors": [
                    {
                        "name": "Plewniak F."
                    },
                    {
                        "name": "Poch O."
                    },
                    {
                        "name": "Thierry J.-C."
                    },
                    {
                        "name": "Thompson J.D."
                    }
                ],
                "citationCount": 164,
                "date": "2000-08-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "DbClustal: Rapid and reliable global multiple alignments of protein sequences detected by database searches"
            },
            "pmcid": "PMC102675",
            "pmid": "10908355"
        },
        {
            "doi": "10.1093/nar/gkf511",
            "metadata": {
                "abstract": "With the increasing amount of data produced by high-throughput technologies in many fields of science, clustering has become an integral step in exploratory data analysis in order to group similar elements into classes. However, many clustering algorithms can only work properly if aided by human expertise. For example, one parameter which is crucial and often manually set is the number of clusters present in the analyzed set. We present a novel stopping rule to find the optimal number of clusters based on the comparison of the density of points inside the clusters and between them. The method is evaluated on synthetic as well as on real transcriptomic data and compared with two current methods. Finally, we illustrate its usefulness in the analysis of the expression profiles of promyelocytic cells before and after treatment with all-trans retinoic acid. Simultaneous clustering for gene regulation and absolute initial expression levels allowed the identification of numerous genes associated with signal transduction revealing the complexity of retinoic acid signaling.",
                "authors": [
                    {
                        "name": "Dembele D."
                    },
                    {
                        "name": "Poch O."
                    },
                    {
                        "name": "Raffelsberger W."
                    },
                    {
                        "name": "Wicker N."
                    }
                ],
                "citationCount": 20,
                "date": "2002-09-15T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Density of points clustering, application to transcriptomic data analysis"
            },
            "pmcid": "PMC137097",
            "pmid": "12235383"
        },
        {
            "doi": "10.1093/nar/gkg518",
            "metadata": {
                "abstract": "PipeAlign is a protein family analysis tool integrating a five step process ranging from the search for sequence homologues in protein and 3D structure databases to the definition of the hierarchical relationships within and between subfamilies. The complete, automatic pipeline takes a single sequence or a set of sequences as input and constructs a high-quality, validated MACS (multiple alignment of complete sequences) in which sequences are clustered into potential functional subgroups. For the more experienced user, the PipeAlign server also provides numerous options to run only a part of the analysis, with the possibility to modify the default parameters of each software module. For example, the user can choose to enter an existing multiple sequence alignment for refinement, validation and subsequent clustering of the sequences. The aim is to provide an interactive workbench for the validation, integration and presentation of a protein family, not only at the sequence level, but also at the structural and functional levels. PipeAlign is available at http://igbmc.u-strasbg.fr/PipeAlign/. © Oxford University Press 2001.",
                "authors": [
                    {
                        "name": "Bianchetti L."
                    },
                    {
                        "name": "Brelivet Y."
                    },
                    {
                        "name": "Carles A."
                    },
                    {
                        "name": "Chalmel F."
                    },
                    {
                        "name": "Lecompte O."
                    },
                    {
                        "name": "Mochel T."
                    },
                    {
                        "name": "Moulinier L."
                    },
                    {
                        "name": "Muller A."
                    },
                    {
                        "name": "Muller J."
                    },
                    {
                        "name": "Plewniak F."
                    },
                    {
                        "name": "Poch O."
                    },
                    {
                        "name": "Prigent V."
                    },
                    {
                        "name": "Ripp R."
                    },
                    {
                        "name": "Thierry J.-C."
                    },
                    {
                        "name": "Thompson J.D."
                    },
                    {
                        "name": "Wicker N."
                    }
                ],
                "citationCount": 107,
                "date": "2003-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PipeAlign: A new toolkit for protein family analysis"
            },
            "pmcid": "PMC168925",
            "pmid": "12824430"
        },
        {
            "doi": "10.1093/nar/gkh294",
            "metadata": {
                "abstract": "Sequence alignments are fundamental to a wide range of applications, including database searching, functional residue identification and structure prediction techniques. These applications predict or propagate structural/functional/evolutionary information based on a presumed homology between the aligned sequences. If the initial hypothesis of homology is wrong, no subsequent application, however sophisticated, can be expected to yield accurate results. Here we present a novel method, LEON, to predict homology between proteins based on a multiple alignment of complete sequences (MACS). In MACS, weak signals from distantly related proteins can be considered in the overall context of the family. Intermediate sequences and the combination of individual weak matches are used to increase the significance of low-scoring regions. Residue composition is also taken into account by incorporation of several existing methods for the detection of compositionally biased sequence segments. The accuracy and reliability of the predictions is demonstrated in large-scale comparisons with structural and sequence family databases, where the specificity was shown to be >99% and the sensitivity was estimated to be ∼76%. LEON can thus be used to reliably identify the complex relationships between large multidomain proteins and should be useful for automatic high-throughput genome annotations, 2D/3D structure predictions, protein-protein interaction predictions etc. © Oxford University Press 2004; all rights reserved.",
                "authors": [
                    {
                        "name": "Poch O."
                    },
                    {
                        "name": "Prigent V."
                    },
                    {
                        "name": "Thompson J.D."
                    }
                ],
                "citationCount": 23,
                "date": "2004-07-14T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "LEON: Multiple alignment evaluation of neighbours"
            },
            "pmcid": "PMC390283",
            "pmid": "14982955"
        },
        {
            "doi": "10.1093/bioinformatics/16.9.750",
            "metadata": {
                "abstract": "Motivation: Blast programs are very efficient in finding relatively strong similarities but some very distantly related sequences are given a very high Expect value and are ranked very low in Blast results. We have developed Ballast, a program to predict local maximum segments (LMSs-i.e. sequence segments conserved relatively to their flanking regions) from a single Blast database search and to highlight these divergent homologues. The TBlastN database searches can also be processed with the help of information from a joint BlastP search. Results: We have applied the Ballast algorithm to BlastP searches performed with sequences belonging to well described dispersed families (aminoacyl-tRNA synthetases; helicases) against the SwissProt 38 database. We show that Ballast is able to build an appropriate conservation profile and that LMSs are predicted that are consistent with the signatures and motifs described in the literature. Furthermore, by comparing the Blast, PsiBlast and Bal-last results obtained on a well defined database of structurally related sequences, we show that the LMSs provide a scoring scheme that can concentrate on top ranking distant homologues better than Blast. Using the graphical user interface available on the Web, specific LMSs may be selected to detect divergent homologues sharing the corresponding properties with the query sequence without requiring any additional database search.",
                "authors": [
                    {
                        "name": "Plewniak F."
                    },
                    {
                        "name": "Poch O."
                    },
                    {
                        "name": "Thompson J.D."
                    }
                ],
                "citationCount": 18,
                "date": "2000-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Ballast: Blast post-processing based on locally conserved segments"
            },
            "pmid": "11108697"
        },
        {
            "doi": "10.1093/bioinformatics/btg133",
            "metadata": {
                "abstract": "Motivation: Most multiple sequence alignment programs use heuristics that sometimes introduce errors into the alignment. The most commonly used methods to correct these errors use iterative techniques to maximize an objective function. We present here an alternative, knowledge-based approach that combines a number of recently developed methods into a two-step refinement process. The alignment is divided horizontally and vertically to form a 'lattice' in which well aligned regions can be differentiated. Alignment correction is then restricted to the less reliable regions, leading to a more reliable and efficient refinement strategy. Results: The accuracy and reliability of RASCAL is demonstrated using: (i) alignments from the BAliBASE benchmark database, where significant improvements were often observed, with no deterioration of the existing high-quality regions, (ii) a large scale study involving 946 alignments from the ProDom protein domain database, where alignment quality was increased in 68% of the cases; and (iii) an automatic pipeline to obtain a high-quality alignment of 695 full-length nuclear receptor proteins, which took 11 min on a DEC Alpha 6100 computer.",
                "authors": [
                    {
                        "name": "Poch O."
                    },
                    {
                        "name": "Thierry J.C."
                    },
                    {
                        "name": "Thompson J.D."
                    }
                ],
                "citationCount": 119,
                "date": "2003-06-12T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "RASCAL: Rapid scanning and correction of multiple sequence alignments"
            },
            "pmid": "12801878"
        },
        {
            "doi": "10.1093/oxfordjournals.molbev.a003929",
            "metadata": {
                "abstract": "With the huge increase of protein data, an important problem is to estimate, within a large protein family, the number of sensible subsets for subsequent in-depth structural, functional, and evolutionary analyses. To tackle this problem, we developed a new program, Secator, which implements the principle of an ascending hierarchical method using a distance matrix based on a multiple alignment of protein sequences. Dissimilarity values assigned to the nodes of a deduced phylogenetic tree are partitioned by a new stopping rule introduced to automatically determine the significant dissimilarity values. The quality of the clusters obtained by Secator is verified by a separate Jackknife study. The method is demonstrated on 24 large protein families covering a wide spectrum of structural and sequence conservation and its usefulness and accuracy with real biological data is illustrated on two well-studied protein families (the Sm proteins and the nuclear receptors).",
                "authors": [
                    {
                        "name": "Perrin G.R."
                    },
                    {
                        "name": "Poch O."
                    },
                    {
                        "name": "Thierry J.C."
                    },
                    {
                        "name": "Wicker N."
                    }
                ],
                "citationCount": 66,
                "date": "2001-01-01T00:00:00Z",
                "journal": "Molecular Biology and Evolution",
                "title": "Secator: A program for inferring protein subfamilies from phylogenetic trees"
            },
            "pmid": "11470834"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein sites, features and motifs",
            "uri": "http://edamontology.org/topic_3510"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Sequence composition, complexity and repeats",
            "uri": "http://edamontology.org/topic_0157"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
