{
    "additionDate": "2021-01-18T11:16:36Z",
    "biotoolsCURIE": "biotools:mf-towmut",
    "biotoolsID": "mf-towmut",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "kuiz@mtu.edu",
            "name": "Kui Zhang",
            "typeEntity": "Person"
        }
    ],
    "description": "Testing an optimally weighted combination of common and rare variants with multiple traits using family data.\n\nR program to implement MF-TOWmuT, a new method developed for large-scale genome wide association study with multiple genetic variants and multiple phenotypes using family data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Collapsing methods",
                    "uri": "http://edamontology.org/operation_3791"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://github.com/gaochengPRC/MF-TOWmuT",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-22T08:40:35Z",
    "name": "MF-TOWmuT",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1002/GEPI.22355",
            "metadata": {
                "abstract": "© 2020 Wiley Periodicals LLCWith rapid advancements of sequencing technologies and accumulations of electronic health records, a large number of genetic variants and multiple correlated human complex traits have become available in many genetic association studies. Thus, it becomes necessary and important to develop new methods that can jointly analyze the association between multiple genetic variants and multiple traits. Compared with methods that only use a single marker or trait, the joint analysis of multiple genetic variants and multiple traits is more powerful since such an analysis can fully incorporate the correlation structure of genetic variants and/or traits and their mutual dependence patterns. However, most of existing methods that simultaneously analyze multiple genetic variants and multiple traits are only applicable to unrelated samples. We develop a new method called MF-TOWmuT to detect association of multiple phenotypes and multiple genetic variants in a genomic region with family samples. MF-TOWmuT is based on an optimally weighted combination of variants. Our method can be applied to both rare and common variants and both qualitative and quantitative traits. Our simulation results show that (1) the type I error of MF-TOWmuT is preserved; (2) MF-TOWmuT outperforms two existing methods such as Multiple Family-based Quasi-Likelihood Score Test and Multivariate Family-based Rare Variant Association Test in terms of power. We also illustrate the usefulness of MF-TOWmuT by analyzing genotypic and phenotipic data from the Genetics of Kidneys in Diabetes study. R program is available at https://github.com/gaochengPRC/MF-TOWmuT.",
                "authors": [
                    {
                        "name": "Gao C."
                    },
                    {
                        "name": "Sha Q."
                    },
                    {
                        "name": "Zhang S."
                    },
                    {
                        "name": "Zhang K."
                    }
                ],
                "date": "2021-02-01T00:00:00Z",
                "journal": "Genetic Epidemiology",
                "title": "MF-TOWmuT: Testing an optimally weighted combination of common and rare variants with multiple traits using family data"
            },
            "pmid": "33047835"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ]
}