{
    "additionDate": "2017-12-18T00:15:35Z",
    "biotoolsCURIE": "biotools:rcnet",
    "biotoolsID": "rcnet",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://compbio.cs.umn.edu/"
        }
    ],
    "description": "Online resource to predict associations between disease phenotypes and gene sets. Its algorithms combine known disease-gene associations in OMIM with the topological information in the disease phenotype similarity network and the gene-gene interaction network to analyze the association between a gene set and disease phenotypes.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://phegenex-umh.cs.umn.edu:8080/PheGenEx/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                }
            ]
        }
    ],
    "homepage": "http://phegenex-umh.cs.umn.edu:8080/PheGenEx/",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:59Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/rcnet-web-tool-inferring-disease-gene-set-association.html"
        }
    ],
    "name": "rcNet",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btr463",
            "metadata": {
                "abstract": "Motivation: To validate the candidate disease genes identified from high-throughput genomic studies, a necessary step is to elucidate the associations between the set of candidate genes and disease phenotypes. The conventional gene set enrichment analysis often fails to reveal associations between disease phenotypes and the gene sets with a short list of poorly annotated genes, because the existing annotations of disease-causative genes are incomplete. This article introduces a network-based computational approach called rcNet to discover the associations between gene sets and disease phenotypes. A learning framework is proposed to maximize the coherence between the predicted phenotype-gene set relations and the known disease phenotype-gene associations. An efficient algorithm coupling ridge regression with label propagation and two variants are designed to find the optimal solution to the objective functions of the learning framework. Results: We evaluated the rcNet algorithms with leave-one-out cross-validation on Online Mendelian Inheritance in Man (OMIM) data and an independent test set of recently discovered disease-gene associations. In the experiments, the rcNet algorithms achieved best overall rankings compared with the baselines. To further validate the reproducibility of the performance, we applied the algorithms to identify the target diseases of novel candidate disease genes obtained from recent studies of Genome-Wide Association Study (GWAS), DNA copy number variation analysis and gene expression profiling. The algorithms ranked the target disease of the candidate genes at the top of the rank list in many cases across all the three case studies. © The Author 2011. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Hwang T."
                    },
                    {
                        "name": "Zhang W."
                    },
                    {
                        "name": "Xie M."
                    },
                    {
                        "name": "Liu J."
                    },
                    {
                        "name": "Kuang R."
                    }
                ],
                "citationCount": 31,
                "date": "2011-10-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Inferring disease and gene set associations with rank coherence in networks"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Disease",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Gene expression profiling",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1
}