{
    "accessibility": "Open access",
    "additionDate": "2019-11-14T19:44:44Z",
    "biotoolsCURIE": "biotools:PyBioNetFit",
    "biotoolsID": "PyBioNetFit",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "wish@lanl.gov",
            "name": "William S. Hlavacek",
            "orcidid": "https://orcid.org/0000-0003-4383-8711",
            "typeEntity": "Person"
        },
        {
            "name": "Eshan D. Mitra"
        },
        {
            "name": "Richard G. Posner"
        }
    ],
    "description": "A general-purpose program for parameterizing biological models specified using the BioNetGen rule-based modeling language (BNGL) or the Systems Biology Markup Language (SBML).",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://pybnf.readthedocs.io/en/latest/"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "http://bionetfit.nau.edu/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-06-11T23:48:30.019466Z",
    "license": "BSD-3-Clause",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/lanl/PyBNF"
        }
    ],
    "name": "PyBioNetFit",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.ISCI.2019.08.045",
            "metadata": {
                "abstract": "© 2019 The Author(s)In systems biology modeling, important steps include model parameterization, uncertainty quantification, and evaluation of agreement with experimental observations. To help modelers perform these steps, we developed the software PyBioNetFit, which in addition supports checking models against known system properties and solving design problems. PyBioNetFit introduces Biological Property Specification Language (BPSL) for the formal declaration of system properties. BPSL allows qualitative data to be used alone or in combination with quantitative data. PyBioNetFit performs parameterization with parallelized metaheuristic optimization algorithms that work directly with existing model definition standards: BioNetGen Language (BNGL) and Systems Biology Markup Language (SBML). We demonstrate PyBioNetFit's capabilities by solving various example problems, including the challenging problem of parameterizing a 153-parameter model of cell cycle control in yeast based on both quantitative and qualitative data. We demonstrate the model checking and design applications of PyBioNetFit and BPSL by analyzing a model of targeted drug interventions in autophagy signaling. © 2019 The Author(s)Biological Sciences; Bioinformatics; Systems Biology; Complex Systems; Computer Science; Parallel System",
                "authors": [
                    {
                        "name": "Colvin J."
                    },
                    {
                        "name": "Hlavacek W.S."
                    },
                    {
                        "name": "Hu A."
                    },
                    {
                        "name": "Ionkov A."
                    },
                    {
                        "name": "Mitra E.D."
                    },
                    {
                        "name": "Posner R.G."
                    },
                    {
                        "name": "Sauro H.M."
                    },
                    {
                        "name": "Suderman R."
                    }
                ],
                "citationCount": 22,
                "date": "2019-09-27T00:00:00Z",
                "journal": "iScience",
                "title": "PyBioNetFit and the Biological Property Specification Language"
            },
            "pmcid": "PMC6744527",
            "pmid": "31522114"
        },
        {
            "doi": "10.1093/bioinformatics/btac004",
            "metadata": {
                "abstract": "© 2022 The Author(s) 2022. Published by Oxford University Press. All rights reserved.Summary: Bayesian inference in biological modeling commonly relies on Markov chain Monte Carlo (MCMC) sampling of a multidimensional and non-Gaussian posterior distribution that is not analytically tractable. Here, we present the implementation of a practical MCMC method in the open-source software package PyBioNetFit (PyBNF), which is designed to support parameterization of mathematical models for biological systems. The new MCMC method, am, incorporates an adaptive move proposal distribution. For warm starts, sampling can be initiated at a specified location in parameter space and with a multivariate Gaussian proposal distribution defined initially by a specified covariance matrix. Multiple chains can be generated in parallel using a computer cluster. We demonstrate that am can be used to successfully solve real-world Bayesian inference problems, including forecasting of new Coronavirus Disease 2019 case detection with Bayesian quantification of forecast uncertainty.",
                "authors": [
                    {
                        "name": "Chen Y."
                    },
                    {
                        "name": "Colvin J."
                    },
                    {
                        "name": "Duprat A.T."
                    },
                    {
                        "name": "Hlavacek W.S."
                    },
                    {
                        "name": "Lin Y.T."
                    },
                    {
                        "name": "Mallela A."
                    },
                    {
                        "name": "Miller E.F."
                    },
                    {
                        "name": "Neumann J."
                    },
                    {
                        "name": "Posner R.G."
                    }
                ],
                "date": "2022-03-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Implementation of a practical Markov chain Monte Carlo sampling algorithm in PyBioNetFit"
            },
            "pmid": "34986226"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        }
    ],
    "validated": 1
}
