{
    "additionDate": "2019-11-14T19:44:44Z",
    "biotoolsCURIE": "biotools:PyBioNetFit",
    "biotoolsID": "PyBioNetFit",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "wish@lanl.gov",
            "name": "William S. Hlavacek",
            "typeEntity": "Person"
        }
    ],
    "description": "> COMMON LINK WITH (PUB. & NAME DIFFERENT) bio.tools/bionetfit (BIONETFIT.NAU.EDU) | PyBioNetFit and the Biological Property Specification Language | A fitting tool for biological models | PyBioNetFit (PyBNF) is a general-purpose program for parameterizing biological models specified using the BioNetGen rule-based modeling language (BNGL) or the Systems Biology Markup Language (SBML). PyBioNetFit offers a suite of parallelized metaheuristic algorithms (differential evolution, particle swarm optimization, scatter search) for parameter optimization. In addition to model parameterization, PyBioNetFit supports uncertainty quantification by bootstrapping and Bayesian approaches, and model checking. PyBioNetFit includes the Biological Property Specification Language (BPSL) for defining qualitative data for use in parameterization or checking. It runs on most Linux and macOS workstations as well on computing clusters",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "http://bionetfit.nau.edu/",
    "lastUpdate": "2020-12-10T12:55:21Z",
    "name": "PyBioNetFit",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.ISCI.2019.08.045",
            "metadata": {
                "abstract": "© 2019 The Author(s)In systems biology modeling, important steps include model parameterization, uncertainty quantification, and evaluation of agreement with experimental observations. To help modelers perform these steps, we developed the software PyBioNetFit, which in addition supports checking models against known system properties and solving design problems. PyBioNetFit introduces Biological Property Specification Language (BPSL) for the formal declaration of system properties. BPSL allows qualitative data to be used alone or in combination with quantitative data. PyBioNetFit performs parameterization with parallelized metaheuristic optimization algorithms that work directly with existing model definition standards: BioNetGen Language (BNGL) and Systems Biology Markup Language (SBML). We demonstrate PyBioNetFit's capabilities by solving various example problems, including the challenging problem of parameterizing a 153-parameter model of cell cycle control in yeast based on both quantitative and qualitative data. We demonstrate the model checking and design applications of PyBioNetFit and BPSL by analyzing a model of targeted drug interventions in autophagy signaling. © 2019 The Author(s)Biological Sciences; Bioinformatics; Systems Biology; Complex Systems; Computer Science; Parallel System",
                "authors": [
                    {
                        "name": "Colvin J."
                    },
                    {
                        "name": "Hlavacek W.S."
                    },
                    {
                        "name": "Hu A."
                    },
                    {
                        "name": "Ionkov A."
                    },
                    {
                        "name": "Mitra E.D."
                    },
                    {
                        "name": "Posner R.G."
                    },
                    {
                        "name": "Sauro H.M."
                    },
                    {
                        "name": "Suderman R."
                    }
                ],
                "citationCount": 16,
                "date": "2019-09-27T00:00:00Z",
                "journal": "iScience",
                "title": "PyBioNetFit and the Biological Property Specification Language"
            },
            "pmcid": "PMC6744527",
            "pmid": "31522114"
        }
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        }
    ],
    "validated": 1
}
