{
    "additionDate": "2019-11-14T20:01:06Z",
    "biotoolsCURIE": "biotools:MCT",
    "biotoolsID": "MCT",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "melkebir@illinois.edu",
            "name": "Mohammed El-Kebir",
            "typeEntity": "Person"
        }
    ],
    "description": "> MEDIUM CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'multiple consensus trees', 'Multiple Consensus Tree' | Summarizing the solution space in tumor phylogeny inference by multiple consensus trees | Algorithms for summarizing cancer phylogenies using multiple consensus trees | MCT-Solver - Multiple Consensus Tree Solver | Multiple Consensus Tree (MCT) is a problem that takes a set of input trees on the same set of vertices and an integer k as input, find k consensus trees and a k-clustering of the input trees such that the sum of the distance of each input tree to its corresponding consensus tree is minimized. MCT-Solver contains 3 approaches to this problem, Brute Force, MILP, and Coordinate Ascent",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree generation (consensus)",
                    "uri": "http://edamontology.org/operation_0555"
                },
                {
                    "term": "Phylogenetic tree distances calculation",
                    "uri": "http://edamontology.org/operation_0557"
                },
                {
                    "term": "Phylogenetic tree reconstruction",
                    "uri": "http://edamontology.org/operation_3478"
                }
            ]
        }
    ],
    "homepage": "https://github.com/elkebir-group/MCT",
    "language": [
        "C++"
    ],
    "lastUpdate": "2019-11-14T20:01:06Z",
    "name": "MCT",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ312",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Motivation: Cancer phylogenies are key to studying tumorigenesis and have clinical implications. Due to the heterogeneous nature of cancer and limitations in current sequencing technology, current cancer phylogeny inference methods identify a large solution space of plausible phylogenies. To facilitate further downstream analyses, methods that accurately summarize such a set T of cancer phylogenies are imperative. However, current summary methods are limited to a single consensus tree or graph and may miss important topological features that are present in different subsets of candidate trees. Results: We introduce the Multiple Consensus Tree (MCT) problem to simultaneously cluster T and infer a consensus tree for each cluster. We show that MCT is NP-hard, and present an exact algorithm based on mixed integer linear programming (MILP). In addition, we introduce a heuristic algorithm that efficiently identifies high-quality consensus trees, recovering all optimal solutions identified by the MILP in simulated data at a fraction of the time. We demonstrate the applicability of our methods on both simulated and real data, showing that our approach selects the number of clusters depending on the complexity of the solution space T.",
                "authors": [
                    {
                        "name": "Aguse N."
                    },
                    {
                        "name": "Qi Y."
                    },
                    {
                        "name": "El-Kebir M."
                    }
                ],
                "date": "2019-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Summarizing the solution space in tumor phylogeny inference by multiple consensus trees"
            },
            "pmcid": "PMC6612807",
            "pmid": "31510657"
        }
    ],
    "topic": [
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        }
    ]
}