{
    "additionDate": "2018-07-26T14:32:21Z",
    "biotoolsCURIE": "biotools:fimtyper",
    "biotoolsID": "fimtyper",
    "credit": [
        {
            "email": "loro@ssi.dk",
            "name": "Louise Roer",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Escherichia coli Subtyping Based on fimH Alleles.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://bitbucket.org/genomicepidemiology/fimtyper/overview"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Classification",
                    "uri": "http://edamontology.org/operation_2990"
                }
            ]
        }
    ],
    "homepage": "https://bitbucket.org/genomicepidemiology/fimtyper",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "license": "Apache-2.0",
    "name": "FimTyper",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1128/JCM.00737-17",
            "metadata": {
                "abstract": "The aim of this study was to construct a valid publicly available method for in silico fimH subtyping of Escherichia coli particularly suitable for differentiation of fine-resolution subgroups within clonal groups defined by standard multilocus sequence typing (MLST). FimTyper was constructed as a FASTA database containing all currently known fimH alleles. The software source code is publicly available at https://bitbucket.org/genomicepidemiology/fimtyper, the database is freely available at https://bitbucket.org/genomicepidemiology/fimtyper-db, and a service implementing the software is available at https://cge.cbs.dtu.dk/services/FimTyper. FimTyper was validated on three data sets: one containing Sanger sequences of fimH alleles of 42 E. coli isolates generated prior to the current study (data set 1), one containing whole-genome sequence (WGS) data of 243 third-generation-cephalosporin-resistant E. coli isolates (data set 2), and one containing a randomly chosen subset of 40 E. coli isolates from data set 2 that were subjected to conventional fimH subtyping (data set 3). The combination of the three data sets enabled an evaluation and comparison of FimTyper on both Sanger sequences and WGS data. FimTyper correctly predicted all 42 fimH subtypes from the Sanger sequences from data set 1 and successfully analyzed all 243 draft genomes from data set 2. FimTyper subtyping of the Sanger sequences and WGS data from data set 3 were in complete agreement. Additionally, fimH subtyping was evaluated on a phylogenetic network of 122 sequence type 131 (ST131) E. coli isolates. There was perfect concordance between the typology and fimH-based subclones within ST131, with accurate identification of the pandemic multidrug-resistant clonal subgroup ST131-H30. FimTyper provides a standardized tool, as a rapid alternative to conventional fimH subtyping, highly suitable for surveillance and outbreak detection.",
                "authors": [
                    {
                        "name": "Roer L."
                    },
                    {
                        "name": "Tchesnokova V."
                    },
                    {
                        "name": "Allesoe R."
                    },
                    {
                        "name": "Muradova M."
                    },
                    {
                        "name": "Chattopadhyay S."
                    },
                    {
                        "name": "Ahrenfeldt J."
                    },
                    {
                        "name": "Thomsen M.C.F."
                    },
                    {
                        "name": "Lund O."
                    },
                    {
                        "name": "Hansen F."
                    },
                    {
                        "name": "Hammerum A.M."
                    },
                    {
                        "name": "Sokurenko E."
                    },
                    {
                        "name": "Hasman H."
                    }
                ],
                "citationCount": 43,
                "date": "2017-08-01T00:00:00Z",
                "journal": "Journal of Clinical Microbiology",
                "title": "Development of a web tool for Escherichia coli subtyping based on fimh alleles"
            },
            "pmcid": "PMC5527432",
            "pmid": "28592545"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        }
    ],
    "validated": 1
}