{
    "additionDate": "2021-01-18T10:01:26Z",
    "biotoolsCURIE": "biotools:ccprd",
    "biotoolsID": "ccprd",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "guzemao@mail.hzau.edu.cn",
            "name": "Zemao Gu",
            "typeEntity": "Person"
        }
    ],
    "description": "CCPRD is a novel analytical framework for comprehensive proteomic reference database construction of non-model organisms.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Peptide identification",
                    "uri": "http://edamontology.org/operation_3631"
                },
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Coding region prediction",
                    "uri": "http://edamontology.org/operation_0436"
                }
            ]
        }
    ],
    "homepage": "https://github.com/qingxiangguo/CCPRD",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2021-02-09T08:07:27Z",
    "license": "MIT",
    "name": "CCPRD",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1021/ACSOMEGA.0C01278",
            "metadata": {
                "abstract": "© 2020 American Chemical Society.Protein reference databases are a critical part of producing efficient proteomic analyses. However, the method for constructing clean, efficient, and comprehensive protein reference databases of nonmodel organisms is lacking. Existing methods either do not have contamination control procedures, or these methods rely on a three-frame and/or six-frame translation that sharply increases the search space and the need for computational resources. Herein, we propose a framework for constructing a customized comprehensive proteomic reference database (CCPRD) from draft genomes and deep sequencing transcriptomes. Its effectiveness is demonstrated by incorporating the proteomes of nematocysts from endoparasitic cnidarian: myxozoans. By applying customized contamination removal procedures, contaminations in omic data were successfully identified and removed. This is an effective method that does not result in overdecontamination. This can be shown by comparing the CCPRD MS results with an artificially contaminated database and another database with removed contaminations in genomes and transcriptomes added back. CCPRD outperformed traditional frame-based methods by identifying 35.2-50.7% more peptides and 35.8-43.8% more proteins, with a maximum of 84.6% in size reduction. A BUSCO analysis showed that the CCPRD maintained a relatively high level of completeness compared to traditional methods. These results confirm the superiority of the CCPRD over existing methods in peptide and protein identification numbers, database size, and completeness. By providing a general framework for generating the reference database, the CCPRD, which does not need a high-quality genome, can potentially be applied to nonmodel organisms and significantly contribute to proteomic research.",
                "authors": [
                    {
                        "name": "Guo Q."
                    },
                    {
                        "name": "Li D."
                    },
                    {
                        "name": "Zhai Y."
                    },
                    {
                        "name": "Gu Z."
                    }
                ],
                "citationCount": 2,
                "date": "2020-06-30T00:00:00Z",
                "journal": "ACS Omega",
                "title": "CCPRD: A Novel Analytical Framework for the Comprehensive Proteomic Reference Database Construction of NonModel Organisms"
            },
            "pmcid": "PMC7331046",
            "pmid": "32637811"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ]
}