{
    "additionDate": "2020-01-09T18:04:06Z",
    "biotoolsCURIE": "biotools:MIC_Locator",
    "biotoolsID": "MIC_Locator",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "fan_yang@hms.harvard.edu",
            "name": "Fan Yang",
            "orcidid": "https://orcid.org/0000-0001-5591-5919",
            "typeEntity": "Person"
        }
    ],
    "description": "A novel image-based protein subcellular location multi-label prediction model based on multi-scale monogenic signal representation and intensity encoding strategy.\n\nThe dataset for MIC_Locator can be downloaded from the website (https://pan.baidu.com/s/1dvvyT9OuJUcQYkCxidABDw)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                },
                {
                    "term": "Protein structure validation",
                    "uri": "http://edamontology.org/operation_0321"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ProteinLocator/MIC_Locator",
    "lastUpdate": "2020-12-28T10:24:16Z",
    "name": "MIC_Locator",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3136-3",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Protein subcellular localization plays a crucial role in understanding cell function. Proteins need to be in the right place at the right time, and combine with the corresponding molecules to fulfill their functions. Furthermore, prediction of protein subcellular location not only should be a guiding role in drug design and development due to potential molecular targets but also be an essential role in genome annotation. Taking the current status of image-based protein subcellular localization as an example, there are three common drawbacks, i.e., obsolete datasets without updating label information, stereotypical feature descriptor on spatial domain or grey level, and single-function prediction algorithm's limited capacity of handling single-label database. Results: In this paper, a novel human protein subcellular localization prediction model MIC_Locator is proposed. Firstly, the latest datasets are collected and collated as our benchmark dataset instead of obsolete data while training prediction model. Secondly, Fourier transformation, Riesz transformation, Log-Gabor filter and intensity coding strategy are employed to obtain frequency feature based on three components of monogenic signal with different frequency scales. Thirdly, a chained prediction model is proposed to handle multi-label instead of single-label datasets. The experiment results showed that the MIC_Locator can achieve 60.56% subset accuracy and outperform the existing majority of prediction models, and the frequency feature and intensity coding strategy can be conducive to improving the classification accuracy. Conclusions: Our results demonstrate that the frequency feature is more beneficial for improving the performance of model compared to features extracted from spatial domain, and the MIC_Locator proposed in this paper can speed up validation of protein annotation, knowledge of protein function and proteomics research.",
                "authors": [
                    {
                        "name": "Yang F."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Yin Z."
                    },
                    {
                        "name": "Yang Z."
                    }
                ],
                "citationCount": 4,
                "date": "2019-10-26T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "MIC_Locator: A novel image-based protein subcellular location multi-label prediction model based on multi-scale monogenic signal representation and intensity encoding strategy"
            },
            "pmcid": "PMC6815465",
            "pmid": "31655541"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Protein targeting and localisation",
            "uri": "http://edamontology.org/topic_0140"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        }
    ],
    "validated": 1
}