{"credit":[{"email":"khan@inha.ac.kr","name":"K. Han","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://interviewer.inha.ac.kr/"}],"function":[{"operation":[{"term":"Protein interaction network analysis","uri":"http://edamontology.org/operation_0276"},{"term":"Pathway or network prediction","uri":"http://edamontology.org/operation_3439"},{"term":"Pathway or network visualisation","uri":"http://edamontology.org/operation_3083"}]}],"labels":{"operatingSystem":["Linux"],"toolType":["Web application"],"topic":[{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"},{"term":"Protein interactions","uri":"http://edamontology.org/topic_0128"}]},"publication":[{"abstract":"Molecular interaction networks, such as those involving protein-protein and protein-DNA interactions, often consist of thousands of nodes or even more, which severely limits the usefulness of many graph drawing tools because they become too slow for interactive analysis of the networks and because they produce cluttered drawings with many edge crossings. We present a new, fast- layout algorithm and its implementation called WebInterViewer for visualizing large-scale molecular interaction networks. WebInterViewer (i) finds a layout of the connected components of an entire network, (ii) finds a global layout of nodes with respect to pivot nodes within the connected components and (iii) refines the local layout of each connected component by first relocating midnodes with respect to their cutvertices and the direct neighbors of the cutvertices, and then relocating all nodes with respect to their neighbors within distance 2. The advantages of WebInterViewer over classical graph drawing methods include the facts that (i) it is an order of magnitude faster, (ii) it can visualize data directly from protein interaction databases and (iii) it provides several abstraction and comparison operations for analyzing large-scale biological networks effectively. WebIntViewer is accessible at http://interviewer.inha.ac.kr/. © Oxford University Press 2004; all rights reserved.","authors":["Han K.","Ju B.-H.","Jung H."],"cit_count":23,"journal":"Nucleic Acids Research","pmid":"15215357","title":"WebInterViewer: Visualizing and analyzing molecular interaction nerworks","year":"2004-07-01"}],"summary":{"biotoolsCURIE":"biotools:webinterviewer","biotoolsID":"webinterviewer","description":"WebInterViewer is a tool for visualizing molecular interaction networks.  It employs a fast-layout algorithm, and can visualize data from interaction databases directly.","homepage":"http://interviewer.inha.ac.kr/","name":"WebInterViewer"}}