{
    "additionDate": "2020-01-09T17:52:13Z",
    "biotoolsCURIE": "biotools:MAGI-S",
    "biotoolsID": "MAGI-S",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "fhormozd@ucdavis.edu",
            "name": "Fereydoun Hormozdiari",
            "orcidid": "https://orcid.org/0000-0003-2703-9274",
            "typeEntity": "Person"
        }
    ],
    "description": "Dissecting the genetic basis of comorbid epilepsy phenotypes in neurodevelopmental disorders.\n\nSeed-centric method to identify gene modules of similar interaction and co-expression characteristics.\n\nM erge A ffected G enes into I ntegrated networks.\n\n||| COMMON LINK WITH (PUB. & NAME DIFFERENT) bio.tools/cadd_phred (GS.WASHINGTON.EDU), bio.tools/primus (GS.WASHINGTON.EDU), bio.tools/seattlesnps (GS.WASHINGTON.EDU)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jchow32/magi-s",
    "language": [
        "C++",
        "C"
    ],
    "lastUpdate": "2020-01-09T17:52:13Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://eichlerlab.gs.washington.edu/MAGI/"
        }
    ],
    "name": "MAGI-S",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S13073-019-0678-Y",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Neurodevelopmental disorders (NDDs) such as autism spectrum disorder, intellectual disability, developmental disability, and epilepsy are characterized by abnormal brain development that may affect cognition, learning, behavior, and motor skills. High co-occurrence (comorbidity) of NDDs indicates a shared, underlying biological mechanism. The genetic heterogeneity and overlap observed in NDDs make it difficult to identify the genetic causes of specific clinical symptoms, such as seizures. Methods: We present a computational method, MAGI-S, to discover modules or groups of highly connected genes that together potentially perform a similar biological function. MAGI-S integrates protein-protein interaction and co-expression networks to form modules centered around the selection of a single \"seed\" gene, yielding modules consisting of genes that are highly co-expressed with the seed gene. We aim to dissect the epilepsy phenotype from a general NDD phenotype by providing MAGI-S with high confidence NDD seed genes with varying degrees of association with epilepsy, and we assess the enrichment of de novo mutation, NDD-associated genes, and relevant biological function of constructed modules. Results: The newly identified modules account for the increased rate of de novo non-synonymous mutations in autism, intellectual disability, developmental disability, and epilepsy, and enrichment of copy number variations (CNVs) in developmental disability. We also observed that modules seeded with genes strongly associated with epilepsy tend to have a higher association with epilepsy phenotypes than modules seeded at other neurodevelopmental disorder genes. Modules seeded with genes strongly associated with epilepsy (e.g., SCN1A, GABRA1, and KCNB1) are significantly associated with synaptic transmission, long-term potentiation, and calcium signaling pathways. On the other hand, modules found with seed genes that are not associated or weakly associated with epilepsy are mostly involved with RNA regulation and chromatin remodeling. Conclusions: In summary, our method identifies modules enriched with de novo non-synonymous mutations and can capture specific networks that underlie the epilepsy phenotype and display distinct enrichment in relevant biological processes.",
                "authors": [
                    {
                        "name": "Chow J."
                    },
                    {
                        "name": "Jensen M."
                    },
                    {
                        "name": "Amini H."
                    },
                    {
                        "name": "Hormozdiari F."
                    },
                    {
                        "name": "Penn O."
                    },
                    {
                        "name": "Shifman S."
                    },
                    {
                        "name": "Girirajan S."
                    },
                    {
                        "name": "Hormozdiari F."
                    }
                ],
                "citationCount": 1,
                "date": "2019-10-25T00:00:00Z",
                "journal": "Genome Medicine",
                "title": "Dissecting the genetic basis of comorbid epilepsy phenotypes in neurodevelopmental disorders"
            },
            "pmcid": "PMC6815046",
            "pmid": "31653223"
        }
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        }
    ]
}