{
    "accessibility": "Open access",
    "additionDate": "2023-03-27T21:10:12.114642Z",
    "biotoolsCURIE": "biotools:ibrap",
    "biotoolsID": "ibrap",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "j.a.wang@qmul.ac.uk",
            "name": "Jun Wang",
            "typeEntity": "Person"
        },
        {
            "name": "Connor H Knight"
        },
        {
            "name": "Faraz Khan"
        },
        {
            "name": "Jessica Okosun"
        }
    ],
    "description": "Integrated Benchmarking Single-cell RNA-sequencing Analytical Pipeline.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/connorhknight/IBRAP",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T14:51:06.730047Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://connorhknight.github.io/IBRAP/index.html"
        }
    ],
    "name": "IBRAP",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/bib/bbad061",
            "metadata": {
                "abstract": "Single-cell ribonucleic acid (RNA)-sequencing (scRNA-seq) is a powerful tool to study cellular heterogeneity. The high dimensional data generated from this technology are complex and require specialized expertise for analysis and interpretation. The core of scRNAseq data analysis contains several key analytical steps, which include pre-processing, quality control, normalization, dimensionality reduction, integration and clustering. Each step often has many algorithms developed with varied underlying assumptions and implications. With such a diverse choice of tools available, benchmarking analyses have compared their performances and demonstrated that tools operate differentially according to the data types and complexity. Here, we present Integrated Benchmarking scRNA-seq Analytical Pipeline (IBRAP), which contains a suite of analytical components that can be interchanged throughout the pipeline alongside multiple benchmarking metrics that enable users to compare results and determine the optimal pipeline combinations for their data. We apply IBRAP to single- and multi-sample integration analysis using primary pancreatic tissue, cancer cell line and simulated data accompanied with ground truth cell labels, demonstrating the interchangeable and benchmarking functionality of IBRAP. Our results confirm that the optimal pipelines are dependent on individual samples and studies, further supporting the rationale and necessity of our tool. We then compare reference-based cell annotation with unsupervised analysis, both included in IBRAP, and demonstrate the superiority of the reference-based method in identifying robust major and minor cell types. Thus, IBRAP presents a valuable tool to integrate multiple samples and studies to create reference maps of normal and diseased tissues, facilitating novel biological discovery using the vast volume of scRNA-seq data available.",
                "authors": [
                    {
                        "name": "Gill U.S."
                    },
                    {
                        "name": "Khan F."
                    },
                    {
                        "name": "Knight C.H."
                    },
                    {
                        "name": "Okosun J."
                    },
                    {
                        "name": "Patel A."
                    },
                    {
                        "name": "Wang J."
                    }
                ],
                "citationCount": 4,
                "date": "2023-03-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "IBRAP: integrated benchmarking single-cell RNA-sequencing analytical pipeline"
            },
            "pmcid": "PMC10025434",
            "pmid": "36847692"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
