{
    "additionDate": "2021-01-18T10:20:52Z",
    "biotoolsCURIE": "biotools:cameratransform",
    "biotoolsID": "cameratransform",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "richard.gerum@fau.de",
            "name": "Richard C. Gerum",
            "typeEntity": "Person"
        }
    ],
    "description": "cameratransform is a python package which can be used to fit camera transformations and apply them to project points from the camera space to the world space and back.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://cameratransform.readthedocs.org/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/rgerum/cameratransform",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-09T07:15:13Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://pypi.org/project/cameratransform/"
        }
    ],
    "name": "CameraTransform",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.SOFTX.2019.100333",
            "metadata": {
                "abstract": "© 2019 The AuthorsCamera images and video recordings are simple and non-invasive tools to investigate animals in their natural habitat. Quantitative evaluations, however, often require an exact reconstruction of object positions, sizes, and distances in the image. Here, we provide an open source software package to perform such calculations. Our approach allows the user to correct for perspective distortion, transform images to “bird's-eye” view projections, or transform image-coordinates to real-world coordinates and vice versa. The extrinsic camera parameters that are necessary to perform such image corrections and transformations (elevation, tilt/roll angle, and heading of the camera) are obtained from the image using contextual information such as a visible horizon, GPS coordinates of landmarks, known object sizes, or images of the same object obtained from different viewing angles. All mathematical operations are implemented in the Python package CameraTransform. The performance of the implementation is evaluated using computer-generated synthetic images with known camera parameters. Moreover, we test our algorithm on images of emperor penguin colonies, and demonstrate that the camera tilt and roll angles can be estimated with an error of less than one degree, and the camera elevation with an error of less than 5%. The CameraTransform software package simplifies camera matrix-based image transformations and the extraction of quantitative image information. An extensive documentation and usage examples in an ecological context are provided at http://cameratransform.readthedocs.io.",
                "authors": [
                    {
                        "name": "Fabry B."
                    },
                    {
                        "name": "Gerum R.C."
                    },
                    {
                        "name": "Le Bohec C."
                    },
                    {
                        "name": "Mark C."
                    },
                    {
                        "name": "Richter S."
                    },
                    {
                        "name": "Winterl A."
                    },
                    {
                        "name": "Zitterbart D.P."
                    }
                ],
                "citationCount": 4,
                "date": "2019-07-01T00:00:00Z",
                "journal": "SoftwareX",
                "title": "CameraTransform: A Python package for perspective corrections and image mapping"
            },
            "pmcid": "PMC7453838",
            "pmid": "32864407"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        }
    ]
}
