{
    "additionDate": "2021-01-18T10:08:03Z",
    "biotoolsCURIE": "biotools:dxr-interact-profile",
    "biotoolsID": "dxr-interact-profile",
    "confidence_flag": "tool",
    "description": "Dopamine Receptors Interaction Profile is a resource for understanding the binding specificity of G-Protein Coupled Receptors (GPCR) toward G-proteins and arrestins in the case of dopamine.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Transmembrane protein prediction",
                    "uri": "http://edamontology.org/operation_0269"
                },
                {
                    "term": "Sequence classification",
                    "uri": "http://edamontology.org/operation_2995"
                },
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                }
            ]
        }
    ],
    "homepage": "http://www.moreiralab.com/resources/dxr",
    "lastUpdate": "2021-03-11T14:42:47Z",
    "name": "Dopamine Receptors Interaction Profile",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.0C00371",
            "metadata": {
                "abstract": "© 2020 American Chemical Society.G-Protein coupled receptors (GPCRs) are involved in a myriad of pathways key for human physiology through the formation of complexes with intracellular partners such as G-proteins and arrestins (Arrs). However, the structural and dynamical determinants of these complexes are still largely unknown. Herein, we developed a computational big-data pipeline that enables the structural characterization of GPCR complexes with no available structure. This pipeline was used to study a well-known group of catecholamine receptors, the human dopamine receptor (DXR) family and its complexes, producing novel insights into the physiological properties of these important drug targets. A detailed description of the protein interfaces of all members of the DXR family (D1R, D2R, D3R, D4R, and D5R) and the corresponding protein interfaces of their binding partners (Arrs: Arr2 and Arr3; G-proteins: Gi1, Gi2, Gi3, Go, Gob, Gq, Gslo, Gssh, Gt2, and Gz) was generated. To produce reliable structures of the DXR family in complex with either G-proteins or Arrs, we performed homology modeling using as templates the structures of the β2-adrenergic receptor (β2AR) bound to Gs, the rhodopsin bound to Gi, and the recently acquired neurotensin receptor-1 (NTSR1) and muscarinic 2 receptor (M2R) bound to arrestin (Arr). Among others, the work demonstrated that the three partner groups, Arrs and Gs- and Gi-proteins, are all structurally and dynamically distinct. Additionally, it was revealed the involvement of different structural motifs in G-protein selective coupling between D1- and D2-like receptors. Having constructed and analyzed 50 models involving DXR, this work represents an unprecedented large-scale analysis of GPCR-intracellular partner interface determinants. All data is available at www.moreiralab.com/resources/dxr.",
                "authors": [
                    {
                        "name": "Preto A.J."
                    },
                    {
                        "name": "Barreto C.A.V."
                    },
                    {
                        "name": "Baptista S.J."
                    },
                    {
                        "name": "Almeida J.G.D."
                    },
                    {
                        "name": "Lemos A."
                    },
                    {
                        "name": "Melo A."
                    },
                    {
                        "name": "Cordeiro M.N.D.S."
                    },
                    {
                        "name": "Kurkcuoglu Z."
                    },
                    {
                        "name": "Melo R."
                    },
                    {
                        "name": "Moreira I.S."
                    }
                ],
                "citationCount": 2,
                "date": "2020-08-24T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "Understanding the Binding Specificity of G-Protein Coupled Receptors toward G-Proteins and Arrestins: Application to the Dopamine Receptor Family"
            },
            "pmid": "32692555"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Membrane and lipoproteins",
            "uri": "http://edamontology.org/topic_0820"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Protein structural motifs and surfaces",
            "uri": "http://edamontology.org/topic_0166"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        }
    ]
}