{
    "additionDate": "2017-08-03T18:46:01Z",
    "biotoolsCURIE": "biotools:hmm-frame",
    "biotoolsID": "hmm-frame",
    "credit": [
        {
            "email": "zhangy72@msu.edu",
            "name": "Yuan Zhang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.cse.msu.edu/~zhangy72/hmmframe/contact.html"
        },
        {
            "email": "yannisun@msu.edu",
            "name": "Yanni Sun",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.cse.msu.edu/~zhangy72/hmmframe/contact.html"
        }
    ],
    "description": "Protein domain classification tool based on an augmented Viterbi algorithm that can incorporate error models from different sequencing platforms. It corrects sequencing errors and classifies putative gene fragments into domain families. It achieved high error detection sensitivity and specificity in a data set with annotated errors.",
    "documentation": [
        {
            "type": "General",
            "url": "http://www.cse.msu.edu/~zhangy72/hmmframe/source_code.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence classification",
                    "uri": "http://edamontology.org/operation_2995"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Protein domain recognition",
                    "uri": "http://edamontology.org/operation_0246"
                }
            ]
        }
    ],
    "homepage": "http://sourceforge.net/projects/hmm-frame/",
    "lastUpdate": "2018-12-10T12:58:55Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/hmm-frame-3-16-protein-domain-classification-sequencing-reads-frameshift-errors.html"
        }
    ],
    "name": "HMM-FRAME",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: Protein domain classification is an important step in metagenomic annotation. The state-of-the-art method for protein domain classification is profile HMM-based alignment. However, the relatively high rates of insertions and deletions in homopolymer regions of pyrosequencing reads create frameshifts, causing conventional profile HMM alignment tools to generate alignments with marginal scores. This makes error-containing gene fragments unclassifiable with conventional tools. Thus, there is a need for an accurate domain classification tool that can detect and correct sequencing errors.Results: We introduce HMM-FRAME, a protein domain classification tool based on an augmented Viterbi algorithm that can incorporate error models from different sequencing platforms. HMM-FRAME corrects sequencing errors and classifies putative gene fragments into domain families. It achieved high error detection sensitivity and specificity in a data set with annotated errors. We applied HMM-FRAME in Targeted Metagenomics and a published metagenomic data set. The results showed that our tool can correct frameshifts in error-containing sequences, generate much longer alignments with significantly smaller E-values, and classify more sequences into their native families.Conclusions: HMM-FRAME provides a complementary protein domain classification tool to conventional profile HMM-based methods for data sets containing frameshifts. Its current implementation is best used for small-scale metagenomic data sets. The source code of HMM-FRAME can be downloaded at http://www.cse.msu.edu/~zhangy72/hmmframe/ and at https://sourceforge.net/projects/hmm-frame/. © 2011 Zhang and Sun; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Sun Y."
                    }
                ],
                "citationCount": 37,
                "date": "2011-05-24T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "HMM-FRAME: Accurate protein domain classification for metagenomic sequences containing frameshift errors"
            },
            "pmid": "21609463"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Nucleic acids",
            "uri": "http://edamontology.org/topic_0077"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        }
    ],
    "validated": 1
}