{
    "additionDate": "2016-04-25T12:59:22Z",
    "biotoolsCURIE": "biotools:proteo",
    "biotoolsID": "proteo",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "name": "CNIC",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "name": "CNIO",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "name": "cnio.es",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "mtress@cnio.es",
            "name": "Michael Tress",
            "typeRole": [
                "Support"
            ],
            "url": "http://ubio.bioinfo.cnio.es/people/mtress/"
        },
        {
            "email": "mtress@cnio.es",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Peptides that were identified, in collaboration, by Spanish National Cancer Research Centre (CNIO) and Centro Nacional de Investigaciones Cardiovasculares (CNIC).\n\nWe interrogate peptides from eight large-scale human proteomics experiments and databases, irrespective of tissue or cell type, for the vast majority of the protein-coding genes in these experiments. The peptide has to be included in at least 2 experiments.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://apprisws.bioinfo.cnio.es/trackHubPROTEO/docs/PROTEO.html"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "homepage": "http://proteo.bioinfo.cnio.es",
    "lastUpdate": "2019-03-26T08:34:43Z",
    "name": "PROTEO: Peptide evidence for the human genome",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "jmrodriguez@cnio.es",
    "publication": [
        {
            "doi": "10.1021/pr501286b",
            "metadata": {
                "abstract": "© 2015 American Chemical Society. Although eukaryotic cells express a wide range of alternatively spliced transcripts, it is not clear whether genes tend to express a range of transcripts simultaneously across cells, or produce dominant isoforms in a manner that is either tissue-specific or regardless of tissue. To date, large-scale investigations into the pattern of transcript expression across distinct tissues have produced contradictory results. Here, we attempt to determine whether genes express a dominant splice variant at the protein level. We interrogate peptides from eight large-scale human proteomics experiments and databases and find that there is a single dominant protein isoform, irrespective of tissue or cell type, for the vast majority of the protein-coding genes in these experiments, in partial agreement with the conclusions from the most recent large-scale RNAseq study. Remarkably, the dominant isoforms from the experimental proteomics analyses coincided overwhelmingly with the reference isoforms selected by two completely orthogonal sources, the consensus coding sequence variants, which are agreed upon by separate manual genome curation teams, and the principal isoforms from the APPRIS database, predicted automatically from the conservation of protein sequence, structure, and function.",
                "authors": [
                    {
                        "name": "Ezkurdia I."
                    },
                    {
                        "name": "Rodriguez J.M."
                    },
                    {
                        "name": "Carrillo-De Santa Pau E."
                    },
                    {
                        "name": "Vazquez J."
                    },
                    {
                        "name": "Valencia A."
                    },
                    {
                        "name": "Tress M.L."
                    }
                ],
                "citationCount": 34,
                "date": "2015-01-01T00:00:00Z",
                "journal": "Journal of Proteome Research",
                "title": "Most highly expressed protein-coding genes have a single dominant isoform"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web API"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        }
    ],
    "version": [
        "1"
    ]
}