{
    "additionDate": "2021-01-18T11:12:53Z",
    "biotoolsCURIE": "biotools:phyloflash",
    "biotoolsID": "phyloflash",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hgruber@mpi-bremen.de",
            "name": "Harald R. Gruber-Vodicka",
            "orcidid": "https://orcid.org/0000-0001-5819-1549",
            "typeEntity": "Person"
        }
    ],
    "description": "Rapid Small-Subunit rRNA Profiling and Targeted Assembly from Metagenomes.\n\nby Harald Gruber-Vodicka, Elmar A. Pruesse, and Brandon Seah.\n\nphyloFlash is a pipeline to rapidly reconstruct the SSU rRNAs and explore phylogenetic composition of an Illumina (meta)genomic or transcriptomic dataset. Manual.\n\nphyloFlash is a pipeline to rapidly reconstruct the SSU rRNAs and explore the phylogenetic composition of an Illumina (meta)genomic dataset.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                },
                {
                    "term": "k-mer counting",
                    "uri": "http://edamontology.org/operation_3472"
                },
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                }
            ]
        }
    ],
    "homepage": "https://github.com/HRGV/phyloFlash",
    "language": [
        "Perl",
        "R"
    ],
    "lastUpdate": "2021-01-23T15:46:19Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://hrgv.github.io/phyloFlash/"
        }
    ],
    "name": "phyloFlash",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1128/MSYSTEMS.00920-20",
            "metadata": {
                "abstract": "Copyright © 2020 Gruber-Vodicka et al. This is an open-access article distributed under the terms of the Creative Commons Attribution 4.0 International license.The small-subunit rRNA (SSU rRNA) gene is the key marker in molecular ecology for all domains of life, but it is largely absent from metagenome-assembled genomes that often are the only resource available for environmental microbes. Here, we present phyloFlash, a pipeline to overcome this gap with rapid, SSU rRNA-centered taxonomic classification, targeted assembly, and graph-based binning of full metagenomic assemblies. We show that a cleanup of artifacts is pivotal even with a curated reference database. With such a filtered database, the general-purpose mapper BBmap extracts SSU rRNA reads five times faster than the rRNA-specialized tool SortMeRNA with similar sensitivity and higher selectivity on simulated metagenomes. Reference-based targeted assemblers yielded either highly fragmented assemblies or high levels of chimerism, so we employ the general-purpose genomic assembler SPAdes. Our optimized implementation is independent of reference database composition and has satisfactory levels of chimera formation. phyloFlash quickly processes Illumina (meta)genomic data, is straightforward to use, even as part of high-throughput quality control, and has user-friendly output reports. The software is available at https://github.com/HRGV/phyloFlash (GPL3 license) and is documented with an online manual. IMPORTANCE To track organisms across all domains of life, the SSU rRNA gene is the gold standard. Many environmental microbes are known only from high-throughput sequence data, but the SSU rRNA gene, the key to visualization by molecular probes and link to existing literature, is often missing from metagenome-assembled genomes (MAGs). The easy-to-use phyloFlash software suite tackles this gap with rapid, SSU rRNA-centered taxonomic classification, targeted assembly, and graph-based linking to MAGs. Starting from a cleaned reference database, phyloFlash profiles the taxonomic diversity and assembles the sorted SSU rRNA reads. The phyloFlash design is domain agnostic and covers eukaryotes, archaea, and bacteria alike. phyloFlash also provides utilities to visualize multisample comparisons and to integrate the recovered SSU rRNAs in a metagenomics workflow by linking them to MAGs using assembly graph parsing.",
                "authors": [
                    {
                        "name": "Gruber-Vodicka H.R."
                    },
                    {
                        "name": "Seah B.K.B."
                    },
                    {
                        "name": "Pruesse E."
                    }
                ],
                "citationCount": 4,
                "date": "2020-10-27T00:00:00Z",
                "journal": "mSystems",
                "title": "Phyloflash: Rapid small-subunit rrna profiling and targeted assembly from metagenomes"
            },
            "pmcid": "PMC7593591",
            "pmid": "33109753"
        }
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Metatranscriptomics",
            "uri": "http://edamontology.org/topic_3941"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        }
    ],
    "validated": 1
}