{"collectionID": ["BIG N2N", "UGent"], "accessibility": [], "topic": [{"term": "Genotype and phenotype", "uri": "http://edamontology.org/topic_0625"}], "owner": "Katrijn.Vannerum@ugent.be", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": "10.1186/s12863-014-0154-z", "note": null, "version": null, "pmid": null, "type": "Primary", "pmcid": null, "metadata": {"title": "Heuristic exploitation of genetic structure in marker-assisted gene pyramiding problems", "abstract": "© 2015 De Beukelaer et al.Background: Over the last decade genetic marker-based plant breeding strategies have gained increasing attention because genotyping technologies are no longer limiting. Now the challenge is to optimally use genetic markers in practical breeding schemes. For simple traits such as some disease resistances it is possible to target a fixed multi-locus allele configuration at a small number of causal or linked loci. Efficiently obtaining this genetic ideotype from a given set of parental genotypes is known as the marker-assisted gene pyramiding problem. Previous methods either imposed strong restrictions or used black box integer programming solutions, while this paper explores the power of an explicit heuristic approach that exploits the underlying genetic structure to prune the search space. Results: Gene Stacker is introduced as a novel approach to marker-assisted gene pyramiding, combining an explicit directed acyclic graph model with a pruned generation algorithm inspired by a simple exhaustive search. Both exact and heuristic pruning criteria are applied to reduce the number of generated schedules. It is shown that this approach can effectively be used to obtain good solutions for stacking problems of varying complexity. For more complex problems, the heuristics allow to obtain valuable approximations. For smaller problems, fewer heuristics can be applied, resulting in an interesting quality-runtime tradeoff. Gene Stacker is competitive with previous methods and often finds better and/or additional solutions within reasonable time, because of the powerful heuristics. Conclusions: The proposed approach was confirmed to be feasible in combination with heuristics to cope with realistic, complex stacking problems. The inherent flexibility of this approach allows to easily address important breeding constraints so that the obtained schedules can be widely used in practice without major modifications. In addition, the ideas applied for Gene Stacker can be incorporated in and extended for a plant breeding context that e.g. also addresses complex quantitative traits or conservation of genetic background. Gene Stacker is freely available as open source software at http://genestacker.ugent.be. The website also provides documentation and examples of how to use Gene Stacker.", "citationCount": 2, "authors": [{"name": "De Beukelaer H."}, {"name": "De Meyer G."}, {"name": "Fack V."}], "date": "2014-12-16T00:00:00Z", "journal": "BMC Genetics"}}], "homepage_status": 0, "credit": [{"typeRole": ["Provider"], "name": "ugent.be", "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": "Institute", "email": null}, {"typeRole": ["Primary contact"], "name": null, "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "Veerle.Fack@Ugent.be"}], "biotoolsCURIE": "biotools:gene_stacker", "elixirPlatform": [], "elixirNode": [], "version": ["1.9"], "elixir_badge": 0, "homepage": "http://genestacker.ugent.be/", "function": [{"note": null, "input": [{"data": {"term": "Genotype and phenotype annotation ID", "uri": "http://edamontology.org/data_1081"}, "format": [{"term": "XML", "uri": "http://edamontology.org/format_2332"}]}], "operation": [{"term": "Genotyping", "uri": "http://edamontology.org/operation_3196"}], "cmd": null, "output": [{"data": {"term": "Image", "uri": "http://edamontology.org/data_2968"}, "format": []}]}], "lastUpdate": "2018-12-10T12:58:52Z", "otherID": [], "description": "Open source tool for marker-assisted gene pyramiding.", "toolType": ["Command-line tool", "Desktop application"], "editPermission": {"type": "private", "authors": []}, "language": ["Java"], "link": [], "biotoolsID": "gene_stacker", "additionDate": "2016-05-17T10:19:01Z", "name": "Gene Stacker", "license": "Apache-2.0", "documentation": [{"url": "http://genestacker.ugent.be/usage.php", "note": null, "type": "General"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux", "Mac"]}