{
    "accessibility": "Open access",
    "additionDate": "2022-03-27T15:35:36.201034Z",
    "biotoolsCURIE": "biotools:smrt_R",
    "biotoolsID": "smrt_R",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "tinn@unr.edu",
            "name": "Tin Nguyen",
            "typeEntity": "Person"
        },
        {
            "name": "Adam Cassell"
        },
        {
            "name": "Sergiu Dascalu"
        },
        {
            "name": "Sorin Draghici"
        }
    ],
    "description": "Randomized Data Transformation for Cancer Subtyping and Big Data Analysis.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                }
            ]
        }
    ],
    "homepage": "http://SMRT.tinnguyen-lab.com",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-03-27T15:35:36.203582Z",
    "name": "SMRT",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/FONC.2021.725133",
            "metadata": {
                "abstract": "© Copyright © 2021 Nguyen, Tran, Tran, Roy, Cassell, Dascalu, Draghici and Nguyen.Cancer is an umbrella term that includes a range of disorders, from those that are fast-growing and lethal to indolent lesions with low or delayed potential for progression to death. The treatment options, as well as treatment success, are highly dependent on the correct subtyping of individual patients. With the advancement of high-throughput platforms, we have the opportunity to differentiate among cancer subtypes from a holistic perspective that takes into consideration phenomena at different molecular levels (mRNA, methylation, etc.). This demands powerful integrative methods to leverage large multi-omics datasets for a better subtyping. Here we introduce Subtyping Multi-omics using a Randomized Transformation (SMRT), a new method for multi-omics integration and cancer subtyping. SMRT offers the following advantages over existing approaches: (i) the scalable analysis pipeline allows researchers to integrate multi-omics data and analyze hundreds of thousands of samples in minutes, (ii) the ability to integrate data types with different numbers of patients, (iii) the ability to analyze un-matched data of different types, and (iv) the ability to offer users a convenient data analysis pipeline through a web application. We also improve the efficiency of our ensemble-based, perturbation clustering to support analysis on machines with memory constraints. In an extensive analysis, we compare SMRT with eight state-of-the-art subtyping methods using 37 TCGA and two METABRIC datasets comprising a total of almost 12,000 patient samples from 28 different types of cancer. We also performed a number of simulation studies. We demonstrate that SMRT outperforms other methods in identifying subtypes with significantly different survival profiles. In addition, SMRT is extremely fast, being able to analyze hundreds of thousands of samples in minutes. The web application is available at http://SMRT.tinnguyen-lab.com. The R package will be deposited to CRAN as part of our PINSPlus software suite.",
                "authors": [
                    {
                        "name": "Cassell A."
                    },
                    {
                        "name": "Dascalu S."
                    },
                    {
                        "name": "Draghici S."
                    },
                    {
                        "name": "Nguyen H."
                    },
                    {
                        "name": "Nguyen T."
                    },
                    {
                        "name": "Roy M."
                    },
                    {
                        "name": "Tran B."
                    },
                    {
                        "name": "Tran D."
                    }
                ],
                "citationCount": 1,
                "date": "2021-10-20T00:00:00Z",
                "journal": "Frontiers in Oncology",
                "title": "SMRT: Randomized Data Transformation for Cancer Subtyping and Big Data Analysis"
            },
            "pmcid": "PMC8563705",
            "pmid": "34745946"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biobank",
            "uri": "http://edamontology.org/topic_3337"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
