{
    "additionDate": "2019-07-29T12:34:35Z",
    "biotoolsCURIE": "biotools:RainBio",
    "biotoolsID": "RainBio",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jean-baptiste.lamy@univ-paris13.fr",
            "name": "Jean-Baptiste Lamy",
            "orcidid": "https://orcid.org/0000-0002-5477-180X",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.lesfleursdunormal.fr"
        },
        {
            "name": "LIMICS",
            "typeEntity": "Division"
        }
    ],
    "description": "RainBio is a visual tool for comparing gene sets or protein sets, in a proportional way.\n\nRainBio is an alternative to the classical Venn diagrams and Euler diagrams. In particular, RainBio can compare up to 15 sets, while Venn diagrams are limited to 6, and proportional Venn diagram are approximated above 4 sets. RainBio can perform the exact proportional visualization of up to 6 sets, and support intersection clustering, allowing to visualize up to 15 sets.\n\nRainBio uses the same file format that InteractiVenn. Several demo datasets are available on the website.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence set",
                        "uri": "http://edamontology.org/data_0850"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Genome comparison",
                    "uri": "http://edamontology.org/operation_3209"
                },
                {
                    "term": "Multiple sample visualisation",
                    "uri": "http://edamontology.org/operation_3744"
                }
            ]
        }
    ],
    "homepage": "http://www.lesfleursdunormal.fr/static/appliweb/rainbio/index.html",
    "language": [
        "Python"
    ],
    "lastUpdate": "2019-08-01T11:36:06Z",
    "license": "LGPL-3.0",
    "maturity": "Emerging",
    "name": "RainBio",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "jiba",
    "publication": [
        {
            "doi": "10.1109/TVCG.2019.2921544",
            "metadata": {
                "abstract": "© 1995-2012 IEEE.Set visualization is a well-known task in information visualization. In biology, it is used for comparing visually sets of genes or proteins, typically using Venn diagrams. However, limitations of the Venn diagram are well-known: they are limited to 6 sets and difficult to read above 4. Many other set visualization techniques have been proposed, but they have never been widely used in biology. In this paper, we introduce RainBio, a technique for visualizing sets in biology and aimed at providing a global overview showing the size of the main intersections, in a proportional way, and the similarities between sets. We adapt rainbow boxes, a technique for visualizing small datasets, to the visualization of larger sets, using element aggregation and intersection clustering. We present the application of RainBio to three datasets, with 5, 6 and 12 sets. We also describe a small user study comparing RainBio with Venn diagrams, involving 30 students in biology. Results showed that RainBio led to significantly fewer errors on 6-set dataset, and that the majority of students preferred RainBio. RainBio is proposed as a web-based tool for up to 15 sets.",
                "authors": [
                    {
                        "name": "Lamy J.-B."
                    },
                    {
                        "name": "Tsopra R."
                    }
                ],
                "citationCount": 4,
                "date": "2020-11-01T00:00:00Z",
                "journal": "IEEE Transactions on Visualization and Computer Graphics",
                "title": "RainBio: Proportional Visualization of Large Sets in Biology"
            },
            "pmid": "31180862",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        },
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}