{"credit":[],"function":[{"operation":[{"term":"Essential dynamics","uri":"http://edamontology.org/operation_3891"}]}],"labels":{"language":["Delphi"],"topic":[{"term":"Transcription factors and regulatory sites","uri":"http://edamontology.org/topic_0749"},{"term":"Critical care medicine","uri":"http://edamontology.org/topic_3403"},{"term":"Medicines research and development","uri":"http://edamontology.org/topic_3376"}]},"publication":[{"abstract":"© 2019 American Pharmacists Association®Objectives: To develop a pharmacist patient care services intervention reporting checklist to be used in conjunction with existing primary reporting tools. The tool should enhance consistent reporting of pharmacist patient care interventions. Tool use in pharmacist-patient care intervention reporting may increase: (1) likelihood for inclusion in higher order analyses and (2) successful replication. Methods: Adhering to principles of the Equator Network, a modified Delphi approach was used. An expert group identified guidance need, conducted a thorough literature search confirming need, developed a comprehensive list of potential elements, refined the list via multiple rounds, finalized language and structure, and published the checklist. Multiple rounds of iterative input were completed face to face, in conference calls, and during public comment periods. The finalized list of elements was organized into a logical flow with the use of clear and concise language and then transformed into an intuitive checklist. Results: The core task force identified 9 critical components over a 4-year period Collectively, the input represented more than 200 stakeholders. Stakeholders overwhelmingly supported the inclusion (89%; n = 29) and clarity (91%; n = 26) of each element. The final 9 elements were organized into a checklist to enhance pharmacist patient care intervention reporting (PaCIR). Accompanying each element is a specific explanation justifying its inclusion. An appendix containing published and created examples of how authors may satisfactorily meet each element is provided. Conclusion: Use of the PaCIR checklist will enhance the quality of reporting of pharmacist patient care intervention studies. This enhanced quality can support replication of the studies and increase the likelihood these studies will be considered for inclusion in systematic reviews and meta-analyses. Researchers are urged to consider use of reporting guides such as PaCIR during the project design phase.","authors":["Clay P.G.","Burns A.L.","Isetts B.J.","Hirsch J.D.","Kliethermes M.A.","Planas L.G."],"cit_count":0,"doi":"10.1016/J.JAPH.2019.07.008","journal":"Journal of the American Pharmacists Association","pmid":"31400991","title":"PaCIR: A tool to enhance pharmacist patient care intervention reporting","year":"2019-09-01"}],"summary":{"biotoolsCURIE":"biotools:PaCIR","biotoolsID":"PaCIR","description":"> MEDIUM CONFIDENCE! | > HOMEPAGE MISSING! | > CORRECT NAME OF TOOL COULD ALSO BE 'pharmacist' | A tool to enhance pharmacist patient care intervention reporting | OBJECTIVES:To develop a pharmacist patient care services intervention reporting checklist to be used in conjunction with existing primary reporting tools. The tool should enhance consistent reporting of pharmacist patient care interventions. Tool use in pharmacist-patient care intervention reporting may increase: (1) likelihood for inclusion in higher order analyses and (2) successful replication. METHODS:Adhering to principles of the Equator Network, a modified Delphi approach was used. An expert group identified guidance need, conducted a thorough literature search confirming need, developed a comprehensive list of potential elements, refined the list via multiple rounds, finalized language and structure, and published the checklist","homepage":"https://www.ncbi.nlm.nih.gov/pubmed/?term=31400991","name":"PaCIR"}}