
{
    "credit": [
        {
            "email": "l.wessels@nki.nl",
            "name": "Lodewyk F. A. Wessels",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://ccb.nki.nl/software/bcm/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Service composition",
                    "uri": "http://edamontology.org/operation_3762"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R",
            "C++"
        ],
        "license": "MPL-2.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "Systems biology",
                "uri": "http://edamontology.org/topic_2259"
            },
            {
                "term": "Statistics and probability",
                "uri": "http://edamontology.org/topic_2269"
            },
            {
                "term": "Software engineering",
                "uri": "http://edamontology.org/topic_3372"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2016 The Author(s). Background: Computational models in biology are characterized by a large degree of uncertainty. This uncertainty can be analyzed with Bayesian statistics, however, the sampling algorithms that are frequently used for calculating Bayesian statistical estimates are computationally demanding, and each algorithm has unique advantages and disadvantages. It is typically unclear, before starting an analysis, which algorithm will perform well on a given computational model. Results: We present BCM, a toolkit for the Bayesian analysis of Computational Models using samplers. It provides efficient, multithreaded implementations of eleven algorithms for sampling from posterior probability distributions and for calculating marginal likelihoods. BCM includes tools to simplify the process of model specification and scripts for visualizing the results. The flexible architecture allows it to be used on diverse types of biological computational models. In an example inference task using a model of the cell cycle based on ordinary differential equations, BCM is significantly more efficient than existing software packages, allowing more challenging inference problems to be solved. Conclusions: BCM represents an efficient one-stop-shop for computational modelers wishing to use sampler-based Bayesian statistics.",
            "authors": [
                "Thijssen B.",
                "Dijkstra T.M.H.",
                "Heskes T.",
                "Wessels L.F.A."
            ],
            "cit_count": 6,
            "doi": "10.1186/s12918-016-0339-3",
            "journal": "BMC Systems Biology",
            "title": "BCM: Toolkit for Bayesian analysis of Computational Models using samplers",
            "year": "2016-10-21"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:bcm",
        "biotoolsID": "bcm",
        "description": "Toolkit for Bayesian analysis of Computational Models using samplers.",
        "homepage": "http://ccb.nki.nl/software/bcm/",
        "name": "BCM"
    }
}