{
    "additionDate": "2016-10-10T07:21:30Z",
    "biotoolsCURIE": "biotools:busco",
    "biotoolsID": "busco",
    "credit": [
        {
            "email": "evgeny.zdobnov@unige.ch",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "SIB Swiss Institute of Bioinformatics",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        }
    ],
    "description": "Provides measures for quantitative assessment of genome assembly, gene set, and transcriptome completeness based on evolutionarily informed expectations of gene content from near-universal single-copy orthologs.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://busco.ezlab.org/busco_userguide.html"
        }
    ],
    "editPermission": {
        "authors": [
            "ELIXIR-CZ",
            "sergitobara",
            "vdicola"
        ],
        "type": "group"
    },
    "elixirNode": [
        "Switzerland"
    ],
    "elixirPlatform": [
        "Tools"
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence set (nucleic acid)",
                        "uri": "http://edamontology.org/data_1234"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Sequence assembly validation",
                    "uri": "http://edamontology.org/operation_3180"
                },
                {
                    "term": "Transcriptome assembly",
                    "uri": "http://edamontology.org/operation_3258"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Sequence report",
                        "uri": "http://edamontology.org/data_2955"
                    }
                }
            ]
        }
    ],
    "homepage": "https://busco.ezlab.org/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T13:55:22.898312Z",
    "name": "BUSCO",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "SIB",
    "publication": [
        {
            "doi": "10.1093/molbev/msab199",
            "metadata": {
                "abstract": "Methods for evaluating the quality of genomic and metagenomic data are essential to aid genome assembly procedures and to correctly interpret the results of subsequent analyses. BUSCO estimates the completeness and redundancy of processed genomic data based on universal single-copy orthologs. Here, we present new functionalities and major improvements of the BUSCO software, as well as the renewal and expansion of the underlying data sets in sync with the OrthoDB v10 release. Among the major novelties, BUSCO now enables phylogenetic placement of the input sequence to automatically select the most appropriate BUSCO data set for the assessment, allowing the analysis of metagenome-Assembled genomes of unknown origin. A newly introduced genome workflow increases the efficiency and runtimes especially on large eukaryotic genomes. BUSCO is the only tool capable of assessing both eukaryotic and prokaryotic species, and can be applied to various data types, from genome assemblies and metagenomic bins, to transcriptomes and gene sets.",
                "authors": [
                    {
                        "name": "Berkeley M.R."
                    },
                    {
                        "name": "Manni M."
                    },
                    {
                        "name": "Seppey M."
                    },
                    {
                        "name": "Simao F.A."
                    },
                    {
                        "name": "Zdobnov E.M."
                    }
                ],
                "citationCount": 2020,
                "date": "2021-10-01T00:00:00Z",
                "journal": "Molecular Biology and Evolution",
                "title": "BUSCO Update: Novel and Streamlined Workflows along with Broader and Deeper Phylogenetic Coverage for Scoring of Eukaryotic, Prokaryotic, and Viral Genomes"
            },
            "pmcid": "PMC8476166",
            "pmid": "34320186"
        },
        {
            "doi": "10.1093/molbev/msx319",
            "metadata": {
                "abstract": "Genomics promises comprehensive surveying of genomes and metagenomes, but rapidly changing technologies and expanding data volumes make evaluation of completeness a challenging task. Technical sequencing quality metrics can be complemented by quantifying completeness of genomic data sets in terms of the expected gene content of Benchmarking Universal Single-Copy Orthologs (BUSCO, http://busco.ezlab.org). The latest software release implements a complete refactoring of the code tomake itmore flexible and extendable to facilitate high-Throughput assessments. The original six lineage assessment data sets have been updated with improved species sampling, 34 new subsets have been built for vertebrates, arthropods, fungi, and prokaryotes that greatly enhance resolution, and data sets are now also available for nematodes, protists, and plants. Here, we present BUSCO v3 with example analyses that highlight the wideranging utility of BUSCO assessments, which extend beyond quality control of genomics data sets to applications in comparative genomics analyses, gene predictor training, metagenomics, and phylogenomics.",
                "authors": [
                    {
                        "name": "Ioannidis P."
                    },
                    {
                        "name": "Klioutchnikov G."
                    },
                    {
                        "name": "Kriventseva E.V."
                    },
                    {
                        "name": "Manni M."
                    },
                    {
                        "name": "Seppey M."
                    },
                    {
                        "name": "Simao F.A."
                    },
                    {
                        "name": "Waterhouse R.M."
                    },
                    {
                        "name": "Zdobnov E.M."
                    }
                ],
                "citationCount": 1418,
                "date": "2018-03-01T00:00:00Z",
                "journal": "Molecular Biology and Evolution",
                "title": "BUSCO applications from quality assessments to gene prediction and phylogenomics"
            },
            "pmcid": "PMC5850278",
            "pmid": "29220515"
        },
        {
            "doi": "10.1002/cpz1.323",
            "metadata": {
                "abstract": "Evaluation of the quality of genomic “data products” such as genome assemblies or gene sets is of critical importance in order to recognize possible issues and correct them during the generation of new data. It is equally essential to guide subsequent or comparative analyses with existing data, as the correct interpretation of the results necessarily requires knowledge about the quality level and reliability of the inputs. Using datasets of near universal single-copy orthologs derived from OrthoDB, BUSCO can estimate the completeness and redundancy of genomic data by providing biologically meaningful metrics based on expected gene content. These can complement technical metrics such as contiguity measures (e.g., number of contigs/scaffolds, and N50 values). Here, we describe the use of the BUSCO tool suite to assess different data types that can range from genome assemblies of single isolates and assembled transcriptomes and annotated gene sets to metagenome-assembled genomes where the taxonomic origin of the species is unknown. BUSCO is the only tool capable of assessing all these types of sequences from both eukaryotic and prokaryotic species. The protocols detail the various BUSCO running modes and the novel workflows introduced in versions 4 and 5, including the batch analysis on multiple inputs, the auto-lineage workflow to run assessments without specifying a dataset, and a workflow for the evaluation of (large) eukaryotic genomes. The protocols further cover the BUSCO setup, guidelines to interpret the results, and BUSCO “plugin” workflows for performing common operations in genomics using BUSCO results, such as building phylogenomic trees and visualizing syntenies. © 2021 The Authors. Current Protocols published by Wiley Periodicals LLC. Basic Protocol 1: Assessing an input sequence with a BUSCO dataset specified manually. Basic Protocol 2: Assessing an input sequence with a dataset automatically selected by BUSCO. Basic Protocol 3: Assessing multiple inputs. Alternate Protocol: Decreasing analysis runtime when assessing a large number of small genomes with BUSCO auto-lineage workflow and Snakemake. Support Protocol 1: BUSCO setup. Support Protocol 2: Visualizing BUSCO results. Support Protocol 3: Building phylogenomic trees.",
                "authors": [
                    {
                        "name": "Berkeley M.R."
                    },
                    {
                        "name": "Manni M."
                    },
                    {
                        "name": "Seppey M."
                    },
                    {
                        "name": "Zdobnov E.M."
                    }
                ],
                "citationCount": 399,
                "date": "2021-12-01T00:00:00Z",
                "journal": "Current Protocols",
                "title": "BUSCO: Assessing Genomic Data Quality and Beyond"
            },
            "pmid": "34936221"
        },
        {
            "doi": "10.1093/bioinformatics/btv351",
            "metadata": {
                "abstract": "Motivation: Genomics has revolutionized biological research, but quality assessment of the resulting assembled sequences is complicated and remains mostly limited to technical measures like N50. Results: We propose a measure for quantitative assessment of genome assembly and annotation completeness based on evolutionarily informed expectations of gene content. We implemented the assessment procedure in open-source software, with sets of Benchmarking Universal Single-Copy Orthologs, named BUSCO.",
                "authors": [
                    {
                        "name": "Ioannidis P."
                    },
                    {
                        "name": "Kriventseva E.V."
                    },
                    {
                        "name": "Simao F.A."
                    },
                    {
                        "name": "Waterhouse R.M."
                    },
                    {
                        "name": "Zdobnov E.M."
                    }
                ],
                "citationCount": 7999,
                "date": "2015-10-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "BUSCO: Assessing genome assembly and annotation completeness with single-copy orthologs"
            },
            "pmid": "26059717"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}
