{
    "additionDate": "2019-11-14T18:37:37Z",
    "biotoolsCURIE": "biotools:DyNeuSR",
    "biotoolsID": "DyNeuSR",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "saggar@stanford.edu",
            "name": "Manish Saggar",
            "typeEntity": "Person"
        }
    ],
    "description": "Generating dynamical neuroimaging spatiotemporal representations (DyNeuSR) using topological data analysis | Geniesse, C., Sporns, O., Petri, G., Saggar, M. (in-press) Generating dynamical neuroimaging spatiotemporal representations (DyNeuSR) using topological data analysis. Network Neuroscience",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                }
            ]
        }
    ],
    "homepage": "https://braindynamicslab.github.io/dyneusr/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-25T10:57:42Z",
    "license": "BSD-3-Clause",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/braindynamicslab/dyneusr"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/braindynamicslab/dyneusr/issues"
        }
    ],
    "name": "DyNeuSR",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1162/NETN_A_00093",
            "metadata": {
                "abstract": "© 2019 Massachusetts Institute of Technology.In this article, we present an open source neuroinformatics platform for exploring, analyzing, and validating distilled graphical representations of high-dimensional neuroimaging data extracted using topological data analysis (TDA). TDA techniques like Mapper have been recently applied to examine the brain’s dynamical organization during ongoing cognition without averaging data in space, in time, or across participants at the outset. Such TDA-based approaches mark an important deviation from standard neuroimaging analyses by distilling complex high-dimensional neuroimaging data into simple—yet neurophysiologically valid and behaviorally relevant—representations that can be interactively explored at the single-participant level. To facilitate wider use of such techniques within neuroimaging and general neuroscience communities, our work provides several tools for visualizing, interacting with, and grounding TDA-generated graphical representations in neurophysiology. Through Python-based Jupyter notebooks and open datasets, we provide a platform to assess and visualize different intermittent stages of Mapper and examine the influence of Mapper parameters on the generated representations. We hope this platform could enable researchers and clinicians alike to explore topological representations of neuroimaging data and generate biological insights underlying complex mental disorders.",
                "authors": [
                    {
                        "name": "Geniesse C."
                    },
                    {
                        "name": "Sporns O."
                    },
                    {
                        "name": "Petri G."
                    },
                    {
                        "name": "Saggar M."
                    }
                ],
                "citationCount": 9,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Network Neuroscience",
                "title": "Generating dynamical neuroimaging spatiotemporal representations (DyNeuSR) using topological data analysis"
            },
            "pmcid": "PMC6663215",
            "pmid": "31410378"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        }
    ],
    "validated": 1
}