{
    "accessibility": "Open access",
    "additionDate": "2023-11-07T12:46:11.148858Z",
    "biotoolsCURIE": "biotools:gdaphen",
    "biotoolsID": "gdaphen",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "herault@igbmc.fr",
            "name": "Yann Herault",
            "orcidid": "https://orcid.org/0000-0001-7049-6900",
            "typeEntity": "Person"
        },
        {
            "email": "munizmorenomariadelmar@gmail.com",
            "name": "Maria del Mar Muñiz Moreno",
            "typeEntity": "Person"
        },
        {
            "name": "Claire Gavériaux-Ruff",
            "typeEntity": "Person"
        }
    ],
    "description": "R pipeline to identify the most important qualitative and quantitative predictor variables from phenotypic data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/munizmom/gdaphen",
    "language": [
        "R"
    ],
    "lastUpdate": "2023-11-07T12:46:11.151596Z",
    "license": "GPL-3.0",
    "name": "Gdaphen",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-022-05111-0",
            "metadata": {
                "abstract": "Background: In individuals or animals suffering from genetic or acquired diseases, it is important to identify which clinical or phenotypic variables can be used to discriminate between disease and non-disease states, the response to treatments or sexual dimorphism. However, the data often suffers from low number of samples, high number of variables or unbalanced experimental designs. Moreover, several parameters can be recorded in the same test. Thus, correlations should be assessed, and a more complex statistical framework is necessary for the analysis. Packages already exist that provide analysis tools, but they are not found together, rendering the decision method and implementation difficult for non-statisticians. Result: We present Gdaphen, a fast joint-pipeline allowing the identification of most important qualitative and quantitative predictor variables to discriminate between genotypes, treatments, or sex. Gdaphen takes as input behavioral/clinical data and uses a Multiple Factor Analysis (MFA) to deal with groups of variables recorded from the same individuals or anonymize genotype-based recordings. Gdaphen uses as optimized input the non-correlated variables with 30% correlation or higher on the MFA-Principal Component Analysis (PCA), increasing the discriminative power and the classifier’s predictive model efficiency. Gdaphen can determine the strongest variables that predict gene dosage effects thanks to the General Linear Model (GLM)-based classifiers or determine the most discriminative not linear distributed variables thanks to Random Forest (RF) implementation. Moreover, Gdaphen provides the efficacy of each classifier and several visualization options to fully understand and support the results as easily readable plots ready to be included in publications. We demonstrate Gdaphen capabilities on several datasets and provide easily followable vignettes. Conclusions: Gdaphen makes the analysis of phenotypic data much easier for medical or preclinical behavioral researchers, providing an integrated framework to perform: (1) pre-processing steps as data imputation or anonymization; (2) a full statistical assessment to identify which variables are the most important discriminators; and (3) state of the art visualizations ready for publication to support the conclusions of the analyses. Gdaphen is open-source and freely available at https://github.com/munizmom/gdaphen, together with vignettes, documentation for the functions and examples to guide you in each own implementation.",
                "authors": [
                    {
                        "name": "Gaveriaux-Ruff C."
                    },
                    {
                        "name": "Herault Y."
                    },
                    {
                        "name": "Muniz Moreno M.M."
                    }
                ],
                "date": "2023-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Gdaphen, R pipeline to identify the most important qualitative and quantitative predictor variables from phenotypic data"
            },
            "pmcid": "PMC9878791",
            "pmid": "36703114"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
