{
    "additionDate": "2021-01-18T12:21:24Z",
    "biotoolsCURIE": "biotools:vsampler",
    "biotoolsID": "vsampler",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hongchengyaonk@gmail.com",
            "name": "Hongcheng Yao",
            "typeEntity": "Person"
        },
        {
            "email": "mulinli@connect.hku.hk",
            "name": "Mulin Jun Li",
            "typeEntity": "Person"
        }
    ],
    "description": "vSampler is both a web-based tool and a local program to support matched control variant sampling. Given input variants, vSampler could randomly sample control variants with matched minor allele frequency (MAF), distance to closet transcription start site (DTCT), number of nearby genes, number of variants in LD, GC content and many other properties. These matched random controls could be used to construct null distribution for GWAS enrichment analysis to estimate significance of enrichment empirically or serve as negative training/test data for regulatory variant prediction methods.\n\nvSampler runs significantly faster than existing tools, supports both SNPs and indels and provides comprehensive state of art variant annotations as matching properties. A novel data structure and algorithm were developed to achieve this performance improvement.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                }
            ]
        }
    ],
    "homepage": "http://mulinlab.org/vsampler",
    "lastUpdate": "2021-03-13T15:50:46Z",
    "name": "vSampler",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA883",
            "metadata": {
                "abstract": "© 2021 Oxford University Press. All rights reserved.Summary: Sampling of control variants having matched properties with input variants is widely used in enrichment analysis of genome-wide association studies/quantitative trait loci and negative data construction for pathogenic/regulatory variant prediction methods. Spurious enrichment results because of confounding factors, such as minor allele frequency and linkage disequilibrium pattern, can be avoided by calibration of statistical significance based on matched controls. Here, we presented vSampler which can generate sets of randomly drawn variants with comprehensive choices of matching properties, such as tissue/cell type-specific epigenomic features. Importantly, the development of a novel data structure and sampling algorithms for vSamplermakes it significantly fast than existing tools. Availability and implementation: vSampler web server and local program are available at http://mulinlab.org/ vsampler.",
                "authors": [
                    {
                        "name": "Huang D."
                    },
                    {
                        "name": "Wang Z."
                    },
                    {
                        "name": "Zhou Y."
                    },
                    {
                        "name": "Liang Q."
                    },
                    {
                        "name": "Sham P.C."
                    },
                    {
                        "name": "Yao H."
                    },
                    {
                        "name": "Li M.J."
                    }
                ],
                "date": "2021-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "VSampler: Fast and annotation-based matched variant sampling tool"
            },
            "pmid": "33270826"
        }
    ],
    "topic": [
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        }
    ]
}