{
    "additionDate": "2023-07-18T12:50:46.876566Z",
    "biotoolsCURIE": "biotools:pygomodo",
    "biotoolsID": "pygomodo",
    "description": "pyGOMoDo is a Python library to perform homology modeling and docking specifically designed for human GPCRs. pyGOMoDo is a python wrap-up of the updated functionalities of GOMoDo web-service (https://gomodo.grs.kfa-juelich.de). It was designed for convenient use with Jupyter notebooks.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/rribeiro-sci/pygomodo",
    "lastUpdate": "2023-07-18T12:50:46.878942Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/rribeiro-sci/pygomodo"
        }
    ],
    "name": "pyGOMoDo",
    "owner": "laasfeld",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btad294",
            "metadata": {
                "abstract": "Motivation: We present pyGOMoDo, a Python library to perform homology modeling and docking, specifically designed for human GPCRs. pyGOMoDo is a python wrap-up of the updated functionalities of GOMoDo web server (https://molsim.sci.univr.it/gomodo). It was developed having in mind its usage through Jupyter notebooks, where users can create their own protocols of modeling and docking of GPCRs. In this article, we focus on the internal structure and general capabilities of pyGOMoDO and on how it can be useful for carrying out structural biology studies of GPCRs. Results: The source code is freely available at https://github.com/rribeiro-sci/pygomodo under the Apache 2.0 license. Tutorial notebooks containing minimal working examples can be found at https://github.com/rribeiro-sci/pygomodo/tree/main/examples.",
                "authors": [
                    {
                        "name": "Giorgetti A."
                    },
                    {
                        "name": "Ribeiro R.P."
                    }
                ],
                "date": "2023-05-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "pyGOMoDo: GPCRs modeling and docking with python"
            },
            "type": [
                "Primary"
            ]
        }
    ]
}
