{
    "accessibility": "Open access",
    "additionDate": "2023-03-17T14:23:32.556746Z",
    "biotoolsCURIE": "biotools:scmags",
    "biotoolsID": "scmags",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Berat Doğan"
        },
        {
            "name": "Yusuf Baran",
            "orcidid": "https://orcid.org/0000-0003-3423-0771"
        }
    ],
    "description": "Marker gene selection from scRNA-seq data for spatial transcriptomics studies.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://scmags.readthedocs.io/en/latest/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                }
            ]
        }
    ],
    "homepage": "https://github.com/doganlab/scmags",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:54:36.978588Z",
    "license": "Apache-2.0",
    "name": "scMAGS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/j.compbiomed.2023.106634",
            "metadata": {
                "abstract": "Single-Cell RNA sequencing (scRNA-seq) has provided unprecedented opportunities for exploring gene expression and thus uncovering regulatory relationships between genes at the single-cell level. However, scRNA-seq relies on isolating cells from tissues. Therefore, the spatial context of the regulatory processes is lost. A recent technological innovation, spatial transcriptomics, allows for the measurement of gene expression while preserving spatial information. An initial step in the spatial transcriptomic analysis is to identify the cell type, which requires a careful selection of cell-specific marker genes. For this purpose, currently, scRNA-seq data is used to select a limited number of marker genes from among all genes that distinguish cell types from each other. This study proposes scMAGS (single-cell MArker Gene Selection), a novel method for marker gene selection from scRNA-seq data for spatial transcriptomics studies. scMAGS uses a filtering step in which the candidate genes are identified before the marker gene selection step. For the selection of marker genes, cluster validity indices, the Silhouette index, or the Calinski-Harabasz index (for large datasets) are utilized. Experimental results showed that, in comparison to the existing methods, scMAGS is scalable, fast, and accurate. Even for large datasets with millions of cells, scMAGS could find the required number of marker genes in a reasonable amount of time with fewer memory requirements. scMAGS is made freely available at https://github.com/doganlab/scmags and can be downloaded from the Python Package Directory (PyPI) software repository with the command pip install scmags.",
                "authors": [
                    {
                        "name": "Baran Y."
                    },
                    {
                        "name": "Dogan B."
                    }
                ],
                "citationCount": 2,
                "date": "2023-03-01T00:00:00Z",
                "journal": "Computers in Biology and Medicine",
                "title": "scMAGS: Marker gene selection from scRNA-seq data for spatial transcriptomics studies"
            },
            "pmid": "36774895"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
