{
    "additionDate": "2021-01-18T12:00:36Z",
    "biotoolsCURIE": "biotools:vcfview",
    "biotoolsID": "vcfview",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Cathal.Seoighe@nuigalway.ie",
            "name": "Cathal Seoighe",
            "typeEntity": "Person"
        }
    ],
    "description": "An Extensible Data Visualization and Quality Assurance Platform for Integrated Somatic Variant Analysis.\n\nAn interactive Rshiny tool designed to support the evaluation of somatic mutation calls from cancer sequencing data. The tool takes as input a single variant call format (VCF) file and enables researchers to explore the impacts of analytical choices on the mutant allele frequency spectrum, on mutational signatures and on annotated somatic variants in genes of interest. It allows variants that have failed caller filters to be re-examined in order to improve sensitivity or guide strategies for optimal sample / sequencing preparation. It is extensible allowing other algorithms to take advantage of its VCF preprocessing capabilities.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Variant filtering",
                    "uri": "http://edamontology.org/operation_3675"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BrianOSullivanGit/vcfView",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-11T10:21:35Z",
    "license": "GPL-3.0",
    "name": "vcfView",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1177/1176935120972377",
            "metadata": {
                "abstract": "© The Author(s) 2020.Motivation: Somatic mutations can have critical prognostic and therapeutic implications for cancer patients. Although targeted methods are often used to assay specific cancer driver mutations, high throughput sequencing is frequently applied to discover novel driver mutations and to determine the status of less-frequent driver mutations. The task of recovering somatic mutations from these data is nontrivial as somatic mutations must be distinguished from germline variants, sequencing errors, and other artefacts. Consequently, bioinformatics pipelines for recovery of somatic mutations from high throughput sequencing typically involve a large number of analytical choices in the form of quality filters. Results: We present vcfView, an interactive tool designed to support the evaluation of somatic mutation calls from cancer sequencing data. The tool takes as input a single variant call format (VCF) file and enables researchers to explore the impacts of analytical choices on the mutant allele frequency spectrum, on mutational signatures and on annotated somatic variants in genes of interest. It allows variants that have failed variant caller filters to be re-examined to improve sensitivity or guide the design of future experiments. It is extensible, allowing other algorithms to be incorporated easily. Availability: The shiny application can be downloaded from GitHub (https://github.com/BrianOSullivanGit/vcfView). All data processing is performed within R to ensure platform independence. The app has been tested on RStudio, version 1.1.456, with base R 3.6.2 and Shiny 1.4.0. A vignette based on a publicly available data set is also available on GitHub.",
                "authors": [
                    {
                        "name": "O'Sullivan B."
                    },
                    {
                        "name": "Seoighe C."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Cancer Informatics",
                "title": "vcfView: An Extensible Data Visualization and Quality Assurance Platform for Integrated Somatic Variant Analysis"
            },
            "pmcid": "PMC7672756",
            "pmid": "33239857"
        }
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Quality affairs",
            "uri": "http://edamontology.org/topic_3393"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ]
}