{
    "additionDate": "2019-11-14T19:29:24Z",
    "biotoolsCURIE": "biotools:CytoConverter",
    "biotoolsID": "CytoConverter",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "Thomas.LaFramboise@case.edu",
            "name": "Thomas LaFramboise",
            "orcidid": "https://orcid.org/0000-0003-1793-4777",
            "typeEntity": "Person"
        }
    ],
    "description": "a web-based tool to convert karyotypes to genomic coordinates | Sequence-Cytogenetic Bulk Conversion | Bulk Sequence - Cytogenetic Conversion Service | Use this page to get cytogenetic locations for features or sequence locations, or get sequence locations for cytogenetic locations | Organism: Drosophila melanogaster Homo sapiens Mus musculus Rattus norvegicus",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/projects/cytoconverter/",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-11-14T19:29:24Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://www.ncbi.nlm.nih.gov/genome/tools/cyto_convert/"
        }
    ],
    "name": "CytoConverter",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3062-4",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Cytogenetic nomenclature is used to describe chromosomal aberrations (or lack thereof) in a collection of cells, referred to as the cells' karyotype. The nomenclature identifies locations on chromosomes using a system of cytogenetic bands, each with a unique name and region on a chromosome. Each band is microscopically visible after staining, and encompasses a large portion of the chromosome. More modern analyses employ genomic coordinates, which precisely specify a chromosomal location according to its distance from the end of the chromosome. Currently, there is no tool to convert cytogenetic nomenclature into genomic coordinates. Since locations of genes and other genomic features are usually specified by genomic coordinates, a conversion tool will facilitate the identification of the features that are harbored in the regions of chromosomal gain and loss that are implied by a karyotype. Results: Our tool, termed CytoConverter, takes as input either a single karyotype or a file consisting of multiple karyotypes from several individuals. All net chromosomal gains and losses implied by the karyotype are returned in standard genomic coordinates, along with the numbers of cells harboring each aberration if included in the input. CytoConverter also returns graphical output detailing areas of gains and losses of chromosomes and chromosomal segments. Conclusions: CytoConverter is available as a web-based application at https://jxw773.shinyapps.io/Cytogenetic-software/and as an R script at https://sourceforge.net/projects/cytoconverter/. Supplemental Material detailing the underlying algorithms is available.",
                "authors": [
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Laframboise T."
                    }
                ],
                "citationCount": 1,
                "date": "2019-09-11T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "CytoConverter: A web-based tool to convert karyotypes to genomic coordinates"
            },
            "pmcid": "PMC6739950",
            "pmid": "31510921"
        }
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ]
}