{
    "additionDate": "2017-01-13T13:16:26Z",
    "biotoolsCURIE": "biotools:sherman",
    "biotoolsID": "sherman",
    "credit": [
        {
            "email": "simon.andrews@babraham.ac.uk",
            "name": "Simon Andrews",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "bisulfite-treated Read FastQ Simulator",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "http://www.bioinformatics.babraham.ac.uk/projects/sherman/",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2021-05-16T12:28:41.175096Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "Sherman",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_001294"
        }
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "doi": "10.1186/1471-2164-16-S12-S14",
            "metadata": {
                "abstract": "© 2015 Lee et al.Background: Whole genome bisulfite sequencing (WGBS) is a high-throughput technique for profiling genome-wide DNA methylation at single nucleotide resolution. However, the applications of WGBS are limited by low accuracy resulting from bisulfite-induced damage on DNA fragments. Although many computer programs have been developed for accurate detecting, most of the programs have barely succeeded in improving either quantity or quality of the methylation results. To improve both, we attempted to develop a novel integration of most widely used bisulfite-read mappers: Bismark, BSMAP, and BS-seeker2. Results: A comprehensive analysis of the three mappers revealed that the mapping results of the mappers were mutually complementary under diverse read conditions. Therefore, we sought to integrate the characteristics of the mappers by scoring them to gain robustness against artifacts. As a result, the integration significantly increased detection accuracy compared with the individual mappers. In addition, the amount of detected cytosine was higher than that by Bismark. Furthermore, the integration successfully reduced the fluctuation of detection accuracy induced by read conditions. We applied the integration to real WGBS samples and succeeded in classifying the samples according to the originated tissues by both CpG and CpH methylation patterns. Conclusions: In this study, we improved both quality and quantity of methylation results from WGBS data by integrating the mapping results of three bisulfite-read mappers. Also, we succeeded in combining and comparing WGBS samples by reducing the effects of read heterogeneity on methylation detection. This study contributes to DNA methylation researches by improving efficiency of methylation detection from WGBS data and facilitating the comprehensive analysis of public WGBS data.",
                "authors": [
                    {
                        "name": "Lee J.-H."
                    },
                    {
                        "name": "Park S.-J."
                    },
                    {
                        "name": "Kenta N."
                    }
                ],
                "citationCount": 6,
                "date": "2015-12-09T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "An integrative approach for efficient analysis of whole genome bisulfite sequencing data"
            },
            "type": [
                "Review"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        }
    ],
    "validated": 1
}