{
    "additionDate": "2017-01-17T14:59:54Z",
    "biotoolsCURIE": "biotools:csar",
    "biotoolsID": "csar",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "jose.muino@wur.nl",
            "name": "Jose M. Muino",
            "orcidid": "http://orcid.org/0000-0002-6403-7262",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Statistical tools for ChIP-seq data analysis. Taking the average DNA fragment size subjected to sequencing into account, the software calculates genomic single-nucleotide read-enrichment values. After normalization, sample and control are compared using a test based on the Poisson distribution. Test statistic thresholds to control the false discovery rate are obtained through random permutation.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/CSAR.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/CSAR_1.26.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid sequence analysis",
                    "uri": "http://edamontology.org/operation_2478"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/CSAR.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-30T16:00:01Z",
    "license": "Artistic-2.0",
    "name": "CSAR",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1186/1746-4811-7-11",
            "metadata": {
                "abstract": "Background: In vivo detection of protein-bound genomic regions can be achieved by combining chromatin-immunoprecipitation with next-generation sequencing technology (ChIP-seq). The large amount of sequence data produced by this method needs to be analyzed in a statistically proper and computationally efficient manner. The generation of high copy numbers of DNA fragments as an artifact of the PCR step in ChIP-seq is an important source of bias of this methodology.Results: We present here an R package for the statistical analysis of ChIP-seq experiments. Taking the average size of DNA fragments subjected to sequencing into account, the software calculates single-nucleotide read-enrichment values. After normalization, sample and control are compared using a test based on the ratio test or the Poisson distribution. Test statistic thresholds to control the false discovery rate are obtained through random permutations. Computational efficiency is achieved by implementing the most time-consuming functions in C++ and integrating these in the R package. An analysis of simulated and experimental ChIP-seq data is presented to demonstrate the robustness of our method against PCR-artefacts and its adequate control of the error rate.Conclusions: The software ChIP-seq Analysis in R (CSAR) enables fast and accurate detection of protein-bound genomic regions through the analysis of ChIP-seq experiments. Compared to existing methods, we found that our package shows greater robustness against PCR-artefacts and better control of the error rate. © 2011 Muiño et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Angenent G.C."
                    },
                    {
                        "name": "Kaufmann K."
                    },
                    {
                        "name": "Krajewski P."
                    },
                    {
                        "name": "Muino J.M."
                    },
                    {
                        "name": "van Ham R.C.H.J."
                    }
                ],
                "citationCount": 45,
                "date": "2011-05-09T00:00:00Z",
                "journal": "Plant Methods",
                "title": "ChIP-seq Analysis in R (CSAR): An R package for the statistical detection of protein-bound genomic regions"
            },
            "pmcid": "PMC3114017",
            "pmid": "21554688",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        }
    ],
    "validated": 1,
    "version": [
        "1.26.0"
    ]
}
