{
    "additionDate": "2022-10-07T08:44:42.999390Z",
    "biotoolsCURIE": "biotools:covsampler",
    "biotoolsID": "covsampler",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhy@ism.cams.cn",
            "name": "Hang-Yu Zhou",
            "typeEntity": "Person"
        },
        {
            "name": "Aiping Wu",
            "orcidid": "https://orcid.org/0000-0002-5869-651X",
            "typeEntity": "Person"
        }
    ],
    "description": "A Subsampling Method with Balanced Genetic Diversity for Large-Scale SARS-CoV-2 Genome Data Sets.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic inference",
                    "uri": "http://edamontology.org/operation_0323"
                }
            ]
        }
    ],
    "homepage": "https://www.covsampler.net",
    "lastUpdate": "2024-11-24T15:29:18.121314Z",
    "license": "Other",
    "name": "covSampler",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/ve/veac071",
            "metadata": {
                "abstract": "Phylogenetic analysis has been widely used to describe, display, and infer the evolutionary patterns of viruses. The unprecedented accumulation of severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) genomes has provided valuable materials for the real-time study of SARS-CoV-2 evolution. However, the large number of SARS-CoV-2 genome sequences also poses great challenges for data analysis. Several methods for subsampling these large data sets have been introduced. However, current methods mainly focus on the spatiotemporal distribution of genomes without considering their genetic diversity, which might lead to post-subsampling bias. In this study, a subsampling method named covSampler was developed for the subsampling of SARS-CoV-2 genomes with consideration of both their spatiotemporal distribution and their genetic diversity. First, covSampler clusters all genomes according to their spatiotemporal distribution and genetic variation into groups that we call divergent pathways. Then, based on these divergent pathways, two kinds of subsampling strategies, representative subsampling and comprehensive subsampling, were provided with adjustable parameters to meet different users' requirements. Our performance and validation tests indicate that covSampler is efficient and stable, with an abundance of options for user customization. Overall, our work has developed an easy-to-use tool and a webserver (https://www.covsampler.net) for the subsampling of SARS-CoV-2 genome sequences.",
                "authors": [
                    {
                        "name": "Chen Z."
                    },
                    {
                        "name": "Cheng Y."
                    },
                    {
                        "name": "Han N."
                    },
                    {
                        "name": "Ji C."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Xu L."
                    },
                    {
                        "name": "Yang R."
                    },
                    {
                        "name": "Zhou H.-Y."
                    }
                ],
                "citationCount": 4,
                "date": "2022-07-01T00:00:00Z",
                "journal": "Virus Evolution",
                "title": "covSampler: A subsampling method with balanced genetic diversity for large-scale SARS-CoV-2 genome data sets"
            },
            "pmcid": "PMC9384632",
            "pmid": "36533145"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        }
    ],
    "validated": 1
}
