{
    "additionDate": "2019-11-14T18:30:05Z",
    "biotoolsCURIE": "biotools:DISSEQT",
    "biotoolsID": "DISSEQT",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "fontes.magnus@gene.com",
            "name": "M Fontes",
            "typeEntity": "Person"
        }
    ],
    "description": "The complete analysis of deep sequencing data from the DISSEQT paper is available at the collaborative science platform Synapse here. In order to view and download files you must create a Synapse account. (The scripts are also available in the examples folder for reference, but note that you will need a Synapse account to access the data files.)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                },
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://github.com/rasmushenningsson/DISSEQT.jl",
    "language": [
        "Julia"
    ],
    "lastUpdate": "2020-12-22T08:25:08Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/rasmushenningsson/DISSEQT.jl/issues"
        }
    ],
    "name": "Distribution-based modeling of Sequence space time dynamics (DISSEQT)",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/VE/VEZ028",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Rapidly evolving microbes are a challenge to model because of the volatile, complex, and dynamic nature of their populations. We developed the DISSEQT pipeline (DIStribution-based SEQuence space Time dynamics) for analyzing, visualizing, and predicting the evolution of heterogeneous biological populations in multidimensional genetic space, suited for population-based modeling of deep sequencing and high-throughput data. The pipeline is openly available on GitHub (https://github.com/rasmushenningsson/DISSEQT.jl, accessed 23 June 2019) and Synapse (https://www.synapse.org/#!Synapse: syn11425758, accessed 23 June 2019), covering the entire workflow from read alignment to visualization of results. Our pipeline is centered around robust dimension and model reduction algorithms for analysis of genotypic data with additional capabilities for including phenotypic features to explore dynamic genotype-phenotype maps. We illustrate its utility and capacity with examples from evolving RNA virus populations, which present one of the highest degrees of genetic heterogeneity within a given population found in nature. Using our pipeline, we empirically reconstruct the evolutionary trajectories of evolving populations in sequence space and genotype-phenotype fitness landscapes. We show that while sequence space is vastly multidimensional, the relevant genetic space of evolving microbial populations is of intrinsically low dimension. In addition, evolutionary trajectories of these populations can be faithfully monitored to identify the key minority genotypes contributing most to evolution. Finally, we show that empirical fitness landscapes, when reconstructed to include minority variants, can predict phenotype from genotype with high accuracy.",
                "authors": [
                    {
                        "name": "Henningsson R."
                    },
                    {
                        "name": "Moratorio G."
                    },
                    {
                        "name": "Borderia A.V."
                    },
                    {
                        "name": "Vignuzzi M."
                    },
                    {
                        "name": "Fontes M."
                    }
                ],
                "date": "2019-07-01T00:00:00Z",
                "journal": "Virus Evolution",
                "title": "Disseqt-distribution-based modeling of sequence space time dynamics"
            },
            "pmcid": "PMC6680062",
            "pmid": "31392032"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Applied mathematics",
            "uri": "http://edamontology.org/topic_3569"
        }
    ],
    "validated": 1
}