{
    "additionDate": "2020-01-14T09:04:53Z",
    "biotoolsCURIE": "biotools:ASA-PS",
    "biotoolsID": "ASA-PS",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mudumbai@stanford.edu",
            "name": "Seshadri C. Mudumbai",
            "orcidid": "https://orcid.org/0000-0001-8486-9966",
            "typeEntity": "Person"
        }
    ],
    "description": "Development and validation of a predictive model for American Society of Anesthesiologists Physical Status.\n\nBACKGROUND:The American Society of Anesthesiologists Physical Status (ASA-PS) classification system was developed to categorize the fitness of patients before surgery. Increasingly, the ASA-PS has been applied to other uses including justification of inpatient admission. Our objectives were to develop and cross-validate a statistical model for predicting ASA-PS; and 2) assess the concurrent and predictive validity of the model by assessing associations between model-derived ASA-PS, observed ASA-PS, and a diverse set of 30-day outcomes. METHODS:Using the 2014 American College of Surgeons National Surgical Quality Improvement Program (ACS NSQIP) Participant Use Data File, we developed and internally cross-validated multinomial regression models to predict ASA-PS using preoperative NSQIP data. Accuracy was assessed with C-Statistics and calibration plots",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://s-spire-clintools.shinyapps.io/ASA_PS_Estimator/",
    "lastUpdate": "2020-12-02T15:06:52Z",
    "name": "ASA-PS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12913-019-4640-X",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: The American Society of Anesthesiologists Physical Status (ASA-PS) classification system was developed to categorize the fitness of patients before surgery. Increasingly, the ASA-PS has been applied to other uses including justification of inpatient admission. Our objectives were to develop and cross-validate a statistical model for predicting ASA-PS; and 2) assess the concurrent and predictive validity of the model by assessing associations between model-derived ASA-PS, observed ASA-PS, and a diverse set of 30-day outcomes. Methods: Using the 2014 American College of Surgeons National Surgical Quality Improvement Program (ACS NSQIP) Participant Use Data File, we developed and internally cross-validated multinomial regression models to predict ASA-PS using preoperative NSQIP data. Accuracy was assessed with C-Statistics and calibration plots. We assessed both concurrent and predictive validity of model-derived ASA-PS relative to observed ASA-PS and 30-day outcomes. To aid further research and use of the ASA-PS model, we implemented it into an online calculator. Results: Of the 566,797 elective procedures in the final analytic dataset, 8.9% were ASA-PS 1, 48.9% were ASA-PS 2, 39.1% were ASA-PS 3, and 3.2% were ASA-PS 4. The accuracy of the 21-variable model to predict ASA-PS was C = 0.77 +/- 0.0025. The model-derived ASA-PS had stronger association with key indicators of preoperative status including comorbidities and higher BMI (concurrent validity) compared to observed ASA-PS, but less strong associations with postoperative complications (predictive validity). The online ASA-PS calculator may be accessed at https://s-spire-clintools.shinyapps.io/ASA_PS_Estimator/ Conclusions: Model-derived ASA-PS better tracked key indicators of preoperative status compared to observed ASA-PS. The ability to have an electronically derived measure of ASA-PS can potentially be useful in research, quality measurement, and clinical applications.",
                "authors": [
                    {
                        "name": "Mudumbai S.C."
                    },
                    {
                        "name": "Pershing S."
                    },
                    {
                        "name": "Bowe T."
                    },
                    {
                        "name": "Kamal R.N."
                    },
                    {
                        "name": "Sears E.D."
                    },
                    {
                        "name": "Finlay A.K."
                    },
                    {
                        "name": "Eisenberg D."
                    },
                    {
                        "name": "Hawn M.T."
                    },
                    {
                        "name": "Weng Y."
                    },
                    {
                        "name": "Trickey A.W."
                    },
                    {
                        "name": "Mariano E.R."
                    },
                    {
                        "name": "Harris A.H.S."
                    }
                ],
                "citationCount": 3,
                "date": "2019-11-21T00:00:00Z",
                "journal": "BMC Health Services Research",
                "title": "Development and validation of a predictive model for American Society of Anesthesiologists Physical Status"
            },
            "pmcid": "PMC6868867",
            "pmid": "31752856"
        }
    ],
    "topic": [
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        }
    ],
    "validated": 1
}