{
    "additionDate": "2020-01-14T09:02:25Z",
    "biotoolsCURIE": "biotools:OmicsARules",
    "biotoolsID": "OmicsARules",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "jzxu01@stu.edu.cn",
            "name": "Jianzhen Xu",
            "orcidid": "https://orcid.org/0000-0002-0697-9075",
            "typeEntity": "Person"
        }
    ],
    "description": "a R package for integration of multi-omics datasets via association rules mining.\n\ntool for the analysis of multimodal high-throughput data.\n\nOmicsARules is a tool for the analysis of multi-omics high-throughput data based on the use of association rules mining. OmicsARules supports to identify recurrent and associated patterns, and provides a new dimension for exploring single or multiple omics data across sequencing platforms or across samples. Besides, a new rule-interestingness measure Lamda3 is embeded in OmicsARules, it can be used to evaluate the association rules and identify biologically significant patterns. Association rule mining and visualizing were implemented in R environment using package arules and ggplot2",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BioinformaticsSTU/OmicsARules",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-01-14T09:02:25Z",
    "name": "OmicsARules",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3171-0",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: The improvements of high throughput technologies have produced large amounts of multi-omics experiments datasets. Initial analysis of these data has revealed many concurrent gene alterations within single dataset or/and among multiple omics datasets. Although powerful bioinformatics pipelines have been developed to store, manipulate and analyze these data, few explicitly find and assess the recurrent co-occurring aberrations across multiple regulation levels. Results: Here, we introduced a novel R-package (called OmicsARules) to identify the concerted changes among genes under association rules mining framework. OmicsARules embedded a new rule-interestingness measure, Lamda3, to evaluate the associated pattern and prioritize the most biologically meaningful gene associations. As demonstrated with DNA methlylation and RNA-seq datasets from breast invasive carcinoma (BRCA), esophageal carcinoma (ESCA) and lung adenocarcinoma (LUAD), Lamda3 achieved better biological significance over other rule-ranking measures. Furthermore, OmicsARules can illustrate the mechanistic connections between methlylation and transcription, based on combined omics dataset. OmicsARules is available as a free and open-source R package. Conclusions: OmicsARules searches for concurrent patterns among frequently altered genes, thus provides a new dimension for exploring single or multiple omics data across sequencing platforms.",
                "authors": [
                    {
                        "name": "Chen D."
                    },
                    {
                        "name": "Zhang F."
                    },
                    {
                        "name": "Zhao Q."
                    },
                    {
                        "name": "Xu J."
                    }
                ],
                "date": "2019-11-08T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "OmicsARules: a R package for integration of multi-omics datasets via association rules mining"
            },
            "pmcid": "PMC6839229",
            "pmid": "31703610"
        }
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ]
}