{
    "additionDate": "2016-01-31T16:34:53Z",
    "biotoolsCURIE": "biotools:evex",
    "biotoolsID": "evex",
    "collectionID": [
        "BIG N2N",
        "Plant Systems Biology",
        "UGent",
        "VIB"
    ],
    "credit": [
        {
            "email": "yves.vandepeer@psb.vib-ugent.be",
            "name": "Yves Van de Peer",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://bioinformatics.psb.ugent.be/beg"
        },
        {
            "email": "ginter@cs.utu.fi",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "PSB",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        }
    ],
    "description": "A text mining resource built on top of PubMed abstracts and PubMed Central full texts.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://evexdb.org/tutorial/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Identifier",
                        "uri": "http://edamontology.org/data_0842"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Literature search",
                    "uri": "http://edamontology.org/operation_0305"
                },
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Text mining report",
                        "uri": "http://edamontology.org/data_0972"
                    }
                }
            ]
        }
    ],
    "homepage": "http://evexdb.org",
    "lastUpdate": "2024-11-24T20:32:22.153865Z",
    "name": "EVEX",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_010509"
        }
    ],
    "owner": "PSB",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0055814",
            "metadata": {
                "abstract": "Text mining for the life sciences aims to aid database curation, knowledge summarization and information retrieval through the automated processing of biomedical texts. To provide comprehensive coverage and enable full integration with existing biomolecular database records, it is crucial that text mining tools scale up to millions of articles and that their analyses can be unambiguously linked to information recorded in resources such as UniProt, KEGG, BioGRID and NCBI databases. In this study, we investigate how fully automated text mining of complex biomolecular events can be augmented with a normalization strategy that identifies biological concepts in text, mapping them to identifiers at varying levels of granularity, ranging from canonicalized symbols to unique gene and proteins and broad gene families. To this end, we have combined two state-of-the-art text mining components, previously evaluated on two community-wide challenges, and have extended and improved upon these methods by exploiting their complementary nature. Using these systems, we perform normalization and event extraction to create a large-scale resource that is publicly available, unique in semantic scope, and covers all 21.9 million PubMed abstracts and 460 thousand PubMed Central open access full-text articles. This dataset contains 40 million biomolecular events involving 76 million gene/protein mentions, linked to 122 thousand distinct genes from 5032 species across the full taxonomic tree. Detailed evaluations and analyses reveal promising results for application of this data in database and pathway curation efforts. The main software components used in this study are released under an open-source license. Further, the resulting dataset is freely accessible through a novel API, providing programmatic and customized access (http://www.evexdb.org/api/v001/). Finally, to allow for large-scale bioinformatic analyses, the entire resource is available for bulk download from http://evexdb.org/download/, under the Creative Commons - Attribution - Share Alike (CC BY-SA) license.",
                "authors": [
                    {
                        "name": "Ananiadou S."
                    },
                    {
                        "name": "Bjorne J."
                    },
                    {
                        "name": "Ginter F."
                    },
                    {
                        "name": "Hakala K."
                    },
                    {
                        "name": "Kao H.-Y."
                    },
                    {
                        "name": "Lu Z."
                    },
                    {
                        "name": "Pyysalo S."
                    },
                    {
                        "name": "Salakoski T."
                    },
                    {
                        "name": "Wei C.-H."
                    },
                    {
                        "name": "van Landeghem S."
                    },
                    {
                        "name": "van de Peer Y."
                    }
                ],
                "citationCount": 90,
                "date": "2013-04-17T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Large-Scale Event Extraction from Literature with Multi-Level Gene Normalization"
            },
            "pmcid": "PMC3629104",
            "pmid": "23613707",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}
