{
    "additionDate": "2021-01-18T11:51:57Z",
    "biotoolsCURIE": "biotools:upefinder",
    "biotoolsID": "upefinder",
    "confidence_flag": "tool",
    "description": "A Bioinformatic Tool for the Study of Uncharacterized Proteins Based on Gene Expression Correlation and the PageRank Algorithm.\n\nThe Human Proteome Project (HPP) is leading the international effort to characterize the human proteome.\n\nneXtProt Ensemble Id Gene Name GO Term GO Id MSIG Term Disease Chromosome.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "https://upefinder.proteored.org",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-09T18:29:23Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/ubioinformat/UPEfinder"
        }
    ],
    "name": "UPEFinder",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1021/ACS.JPROTEOME.0C00364",
            "metadata": {
                "abstract": "© The Human Proteome Project (HPP) is leading the international effort to characterize the human proteome. Although the main goal of this project was first focused on the detection of missing proteins, a new challenge arose from the need to assign biological functions to the uncharacterized human proteins and describe their implications in human diseases. Not only the proteins with experimental evidence (uPE1 proteins) but also the uncharacterized missing proteins (uMPs) were the objects of study in this challenge, neXt-CP50. In this work, we developed a new bioinformatic approach to infer biological annotations for the uPE1 proteins and uMPs based on a \"guilt-by-association\"analysis using public RNA-Seq data sets. We used the correlation of these proteins with the well-characterized PE1 proteins to construct a network. In this way, we applied the PageRank algorithm to this network to identify the most relevant nodes, which were the biological annotations of the uncharacterized proteins. All of the generated information was stored in a database. In addition, we implemented the web application UPEFinder (https://upefinder.proteored.org) to facilitate the access to this new resource. This information is especially relevant for the researchers of the HPP who are interested in the generation and validation of new hypotheses about the functions of these proteins. Both the database and the web application are publicly available (https://github.com/ubioinformat/UPEfinder).",
                "authors": [
                    {
                        "name": "Corrales F.J."
                    },
                    {
                        "name": "Gonzalez-Gomariz J."
                    },
                    {
                        "name": "Guruceaga E."
                    },
                    {
                        "name": "Segura V."
                    },
                    {
                        "name": "Serrano G."
                    },
                    {
                        "name": "Tilve-Alvarez C.M."
                    }
                ],
                "date": "2020-12-04T00:00:00Z",
                "journal": "Journal of Proteome Research",
                "title": "UPEFinder: A Bioinformatic Tool for the Study of Uncharacterized Proteins Based on Gene Expression Correlation and the PageRank Algorithm"
            },
            "pmid": "33155801"
        }
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ]
}
