{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://ritchielab.psu.edu/"}],"documentation":[{"type":"GENERAL","url":"http://visualization.ritchielab.org/synthesis_views/document"}],"function":[{"operation":[{"term":"Visualisation","uri":"http://edamontology.org/operation_0337"}]},{"operation":[{"term":"Analysis","uri":"http://edamontology.org/operation_2945"}]}],"labels":{"language":["Ruby"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Desktop application"],"topic":[{"term":"SNP","uri":"http://edamontology.org/topic_2885"},{"term":"Genetics","uri":"http://edamontology.org/topic_3053"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/synthesis-view-visualization-interpretation-snp-association-results.html"}],"publication":[{"abstract":"Background. Initial genome-wide association study (GWAS) discoveries are being further explored through the use of large cohorts across multiple and diverse populations involving meta-analyses within large consortia and networks. Many of the additional studies characterize less than 100 single nucleotide polymorphisms (SNPs), often include multiple and correlated phenotypic measurements, and can include data from multiple-sites, multiple-studies, as well as multiple race/ethnicities. New approaches for visualizing resultant data are necessary in order to fully interpret results and obtain a broad view of the trends between DNA variation and phenotypes, as well as provide information on specific SNP and phenotype relationships. Results. The Synthesis-View software tool was designed to visually synthesize the results of the aforementioned types of studies. Presented herein are multiple examples of the ways Synthesis-View can be used to report results from association studies of DNA variation and phenotypes, including the visual integration of p-values or other metrics of significance, allele frequencies, sample sizes, effect size, and direction of effect. Conclusions. To truly allow a user to visually integrate multiple pieces of information typical of a genetic association study, innovative views are needed to integrate multiple pieces of information. As a result, we have created \"Synthesis-View\" software for the visualization of genotype-phenotype association data in multiple cohorts. Synthesis-View is freely available for non-commercial research institutions, for full details see https://chgr.mc.vanderbilt.edu/synthesisview. © 2010 Pendergrass et al; licensee BioMed Central Ltd.","authors":["Pendergrass S.A.","Dudek S.M.","Crawford D.C.","Ritchie M.D."],"cit_count":35,"doi":"10.1186/1756-0381-3-10","journal":"BioData Mining","title":"Synthesis-View: Visualization and interpretation of SNP association results for multi-cohort, multi-phenotype data and meta-analysis","type":"Primary","year":"2010-12-20"}],"summary":{"biotoolsCURIE":"biotools:synthesis-view","biotoolsID":"synthesis-view","description":"Data visualization application extended from the previous software “LD-Plus” which also uses a flexible data display format of multiple data “tracks” that can be viewed. Through the use of stacked data-tracks, information on SNP genomic locations, presence of the SNP in a specific study or analysis, as well as related information such as genetic effect size and summary phenotype information, are available for plotting according to user preference.","homepage":"http://visualization.ritchielab.psu.edu/synthesis_views/plot","name":"Synthesis-View"}}