{
    "additionDate": "2021-01-18T11:35:48Z",
    "biotoolsCURIE": "biotools:farmtest",
    "biotoolsID": "farmtest",
    "confidence_flag": "tool",
    "description": "FarmTest (FarmTest: Factor-Adjusted Robust Multiple Testing) Performs robust multiple testing for means in the presence of known and unknown latent factors.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/package=FarmTest",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-10T20:04:25Z",
    "license": "GPL-3.0",
    "name": "FarmTest",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1080/01621459.2018.1527700",
            "metadata": {
                "abstract": "© 2019, © 2019 American Statistical Association.Large-scale multiple testing with correlated and heavy-tailed data arises in a wide range of research areas from genomics, medical imaging to finance. Conventional methods for estimating the false discovery proportion (FDP) often ignore the effect of heavy-tailedness and the dependence structure among test statistics, and thus may lead to inefficient or even inconsistent estimation. Also, the commonly imposed joint normality assumption is arguably too stringent for many applications. To address these challenges, in this article we propose a factor-adjusted robust multiple testing (FarmTest) procedure for large-scale simultaneous inference with control of the FDP. We demonstrate that robust factor adjustments are extremely important in both controlling the FDP and improving the power. We identify general conditions under which the proposed method produces consistent estimate of the FDP. As a byproduct that is of independent interest, we establish an exponential-type deviation inequality for a robust U-type covariance estimator under the spectral norm. Extensive numerical experiments demonstrate the advantage of the proposed method over several state-of-the-art methods especially when the data are generated from heavy-tailed distributions. The proposed procedures are implemented in the R-package FarmTest. Supplementary materials for this article are available online.",
                "authors": [
                    {
                        "name": "Fan J."
                    },
                    {
                        "name": "Ke Y."
                    },
                    {
                        "name": "Sun Q."
                    },
                    {
                        "name": "Zhou W.-X."
                    }
                ],
                "citationCount": 12,
                "date": "2019-10-02T00:00:00Z",
                "journal": "Journal of the American Statistical Association",
                "title": "FarmTest: Factor-Adjusted Robust Multiple Testing With Approximate False Discovery Control"
            },
            "pmcid": "PMC7539891",
            "pmid": "33033420"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
