
{
    "credit": [
        {
            "email": "kuang@cs.umn.edu",
            "name": "Rui Kuang",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://compbio.cs.umn.edu/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://compbio.cs.umn.edu/Net-RSTQ/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "MATLAB"
        ],
        "operatingSystem": [
            "Linux",
            "Windows"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "RNA-Seq",
                "uri": "http://edamontology.org/topic_3170"
            },
            {
                "term": "Transcriptomics",
                "uri": "http://edamontology.org/topic_3308"
            },
            {
                "term": "Oncology",
                "uri": "http://edamontology.org/topic_2640"
            },
            {
                "term": "Gene transcripts",
                "uri": "http://edamontology.org/topic_3512"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/net-rstq-network-based-method-for-rna-seq-based-transcript-quantification.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2015 Zhang et al.High-throughput mRNA sequencing (RNA-Seq) is widely used for transcript quantification of gene isoforms. Since RNA-Seq data alone is often not sufficient to accurately identify the read origins from the isoforms for quantification, we propose to explore protein domain-domain interactions as prior knowledge for integrative analysis with RNA-Seq data. We introduce a Network-based method for RNA-Seq-based Transcript Quantification (Net-RSTQ) to integrate protein domain-domain interaction network with short read alignments for transcript abundance estimation. Based on our observation that the abundances of the neighboring isoforms by domain-domain interactions in the network are positively correlated, Net-RSTQ models the expression of the neighboring transcripts as Dirichlet priors on the likelihood of the observed read alignments against the transcripts in one gene. The transcript abundances of all the genes are then jointly estimated with alternating optimization of multiple EM problems. In simulation Net-RSTQ effectively improved isoform transcript quantifications when isoform co-expressions correlate with their interactions. qRT-PCR results on 25 multi-isoform genes in a stem cell line, an ovarian cancer cell line, and a breast cancer cell line also showed that Net-RSTQ estimated more consistent isoform proportions with RNA-Seq data. In the experiments on the RNA-Seq data in The Cancer Genome Atlas (TCGA), the transcript abundances estimated by Net-RSTQ are more informative for patient sample classification of ovarian cancer, breast cancer and lung cancer. All experimental results collectively support that Net-RSTQ is a promising approach for isoform quantification. Net-RSTQ toolbox is available at http://compbio.cs.umn.edu/Net-RSTQ/.",
            "authors": [
                "Zhang W.",
                "Chang J.-W.",
                "Lin L.",
                "Minn K.",
                "Wu B.",
                "Chien J.",
                "Yong J.",
                "Zheng H.",
                "Kuang R."
            ],
            "cit_count": 3,
            "journal": "PLoS Computational Biology",
            "pmid": "26699225",
            "title": "Network-Based Isoform Quantification with RNA-Seq Data for Cancer Transcriptome Analysis",
            "year": "2015-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:net-rstq",
        "biotoolsID": "net-rstq",
        "description": "Software to integrate protein domain-domain interaction network with short read alignments for transcript abundance estimation.",
        "homepage": "http://compbio.cs.umn.edu/Net-RSTQ/",
        "name": "Net-RSTQ"
    }
}