{
    "accessibility": [],
    "additionDate": "2018-08-11T10:03:15Z",
    "biotoolsCURIE": "biotools:odg",
    "biotoolsID": "odg",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": "guhli007@umn.edu",
            "gridid": null,
            "name": null,
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        },
        {
            "email": "joseph.guhlin@gmail.com",
            "gridid": null,
            "name": "Joseph Guhlin",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        }
    ],
    "description": "Tool for generating, querying, and analyzing multi-omics comparative databases to facilitate biological understanding.",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "https://github.com/jguhlin/ODG/blob/master/README.md"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Annotation",
                    "uri": "http://edamontology.org/operation_0226"
                },
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                }
            ],
            "output": []
        }
    ],
    "homepage": "https://github.com/jguhlin/odg",
    "homepage_status": 0,
    "language": [
        "C"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": null,
    "link": [],
    "maturity": null,
    "name": "ODG",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "otherID": [],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1186/s12859-017-1777-7",
            "metadata": {
                "abstract": "© 2017 The Author(s). Background: Rapid generation of omics data in recent years have resulted in vast amounts of disconnected datasets without systemic integration and knowledge building, while individual groups have made customized, annotated datasets available on the web with few ways to link them to in-lab datasets. With so many research groups generating their own data, the ability to relate it to the larger genomic and comparative genomic context is becoming increasingly crucial to make full use of the data. Results: The Omics Database Generator (ODG) allows users to create customized databases that utilize published genomics data integrated with experimental data which can be queried using a flexible graph database. When provided with omics and experimental data, ODG will create a comparative, multi-dimensional graph database. ODG can import definitions and annotations from other sources such as InterProScan, the Gene Ontology, ENZYME, UniPathway, and others. This annotation data can be especially useful for studying new or understudied species for which transcripts have only been predicted, and rapidly give additional layers of annotation to predicted genes. In better studied species, ODG can perform syntenic annotation translations or rapidly identify characteristics of a set of genes or nucleotide locations, such as hits from an association study. ODG provides a web-based user-interface for configuring the data import and for querying the database. Queries can also be run from the command-line and the database can be queried directly through programming language hooks available for most languages. ODG supports most common genomic formats as well as generic, easy to use tab-separated value format for user-provided annotations. Conclusions: ODG is a user-friendly database generation and query tool that adapts to the supplied data to produce a comparative genomic database or multi-layered annotation database. ODG provides rapid comparative genomic annotation and is therefore particularly useful for non-model or understudied species. For species for which more data are available, ODG can be used to conduct complex multi-omics, pattern-matching queries.",
                "authors": [
                    {
                        "name": "Guhlin J."
                    },
                    {
                        "name": "Silverstein K.A.T."
                    },
                    {
                        "name": "Zhou P."
                    },
                    {
                        "name": "Tiffin P."
                    },
                    {
                        "name": "Young N.D."
                    }
                ],
                "citationCount": 1,
                "date": "2017-08-10T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "ODG: Omics database generator - a tool for generating, querying, and analyzing multi-omics comparative databases to facilitate biological understanding"
            },
            "note": null,
            "pmcid": null,
            "pmid": null,
            "type": "Primary",
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Comparative genomics",
            "uri": "http://edamontology.org/topic_0797"
        },
        {
            "term": "Data integration and warehousing",
            "uri": "http://edamontology.org/topic_3366"
        }
    ],
    "validated": 1,
    "version": []
}