{"credit":[],"function":[{"operation":[{"term":"Genome annotation","uri":"http://edamontology.org/operation_0362"}]}],"labels":{"topic":[{"term":"Enzymes","uri":"http://edamontology.org/topic_0821"},{"term":"Metagenomics","uri":"http://edamontology.org/topic_3174"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"}]},"publication":[{"abstract":"Copyright © 2019 American Chemical Society.The assignment of functions to uncharacterized proteins discovered in genome projects requires easily accessible tools and computational resources for large-scale, user-friendly leveraging of the protein, genome, and metagenome databases by experimentalists. This article describes the web resource developed by the Enzyme Function Initiative (EFI; accessed at https://efi.igb.illinois.edu/) that provides \"genomic enzymology\" tools (\"web tools\") for (1) generating sequence similarity networks (SSNs) for protein families (EFI-EST); (2) analyzing and visualizing genome context of the proteins in clusters in SSNs (in genome neighborhood networks, GNNs, and genome neighborhood diagrams, GNDs) (EFI-GNT); and (3) prioritizing uncharacterized SSN clusters for functional assignment based on metagenome abundance (chemically guided functional profiling, CGFP) (EFI-CGFP). The SSNs generated by EFI-EST are used as the input for EFI-GNT and EFI-CGFP, enabling easy transfer of information among the tools. The networks are visualized and analyzed using Cytoscape, a widely used desktop application; GNDs and CGFP heatmaps summarizing metagenome abundance are viewed within the tools. We provide a detailed example of the integrated use of the tools with an analysis of glycyl radical enzyme superfamily (IPR004184) found in the human gut microbiome. This analysis demonstrates that (1) SwissProt annotations are not always correct, (2) large-scale genome context analyses allow the prediction of novel metabolic pathways, and (3) metagenome abundance can be used to identify/prioritize uncharacterized proteins for functional investigation.","authors":["Zallot R.","Oberg N.","Gerlt J.A."],"cit_count":0,"doi":"10.1021/ACS.BIOCHEM.9B00735","journal":"Biochemistry","pmid":"31553576","title":"The EFI Web Resource for Genomic Enzymology Tools: Leveraging Protein, Genome, and Metagenome Databases to Discover Novel Enzymes and Metabolic Pathways","year":"2019-10-15"}],"summary":{"biotoolsCURIE":"biotools:EFI","biotoolsID":"EFI","description":"> CORRECT NAME OF TOOL COULD ALSO BE 'EFI-CGFP', 'EFI-GNT' | Leveraging Protein, Genome, and Metagenome Databases to Discover Novel Enzymes and Metabolic Pathways | Enzyme Function Initiative Tools | This website contains a collection of webtools for creating and interacting with sequence similarity networks (SSNs) and genome neighborhood networks (GNNs). These tools originated in the Enzyme Function Initiative, a NIH-funded research project to develop a sequence / structure-based strategy for facilitating discovery of in vitro enzymatic and in vivo metabolic / physiological functions of unknown enzymes discovered in genome projects | The Enzyme Function Initiative tools are hosted at the Carl R | If you use the EFI web tools, please cite us: | A \"From The Bench\" article was recently published in Biochemistry and is available on the training resources page","homepage":"https://efi.igb.illinois.edu/","name":"EFI"}}