{
    "additionDate": "2022-10-09T10:36:58.196121Z",
    "biotoolsCURIE": "biotools:cmic",
    "biotoolsID": "cmic",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "chenjh@ynu.edu.cn",
            "name": "Jianhua Chen",
            "orcidid": "https://orcid.org/0000-0002-3637-2565",
            "typeEntity": "Person"
        }
    ],
    "description": "An efficient quality score compressor with random access functionality.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Humonex/Cmic",
    "language": [
        "C++"
    ],
    "lastUpdate": "2022-10-09T10:36:58.198851Z",
    "license": "Apache-2.0",
    "name": "CMIC",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/S12859-022-04837-1",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: Over the past few decades, the emergence and maturation of new technologies have substantially reduced the cost of genome sequencing. As a result, the amount of genomic data that needs to be stored and transmitted has grown exponentially. For the standard sequencing data format, FASTQ, compression of the quality score is a key and difficult aspect of FASTQ file compression. Throughout the literature, we found that the majority of the current quality score compression methods do not support random access. Based on the above consideration, it is reasonable to investigate a lossless quality score compressor with a high compression rate, a fast compression and decompression speed, and support for random access. Results: In this paper, we propose CMIC, an adaptive and random access supported compressor for lossless compression of quality score sequences. CMIC is an acronym of the four steps (classification, mapping, indexing and compression) in the paper. Its framework consists of the following four parts: classification, mapping, indexing, and compression. The experimental results show that our compressor has good performance in terms of compression rates on all the tested datasets. The file sizes are reduced by up to 21.91% when compared with LCQS. In terms of compression speed, CMIC is better than all other compressors on most of the tested cases. In terms of random access speed, the CMIC is faster than the LCQS, which provides a random access function for compressed quality scores. Conclusions: CMIC is a compressor that is especially designed for quality score sequences, which has good performance in terms of compression rate, compression speed, decompression speed, and random access speed. The CMIC can be obtained in the following way: https://github.com/Humonex/Cmic.",
                "authors": [
                    {
                        "name": "Chen H."
                    },
                    {
                        "name": "Chen J."
                    },
                    {
                        "name": "Lu Z."
                    },
                    {
                        "name": "Wang R."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "CMIC: an efficient quality score compressor with random access functionality"
            },
            "pmcid": "PMC9308261",
            "pmid": "35870880"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
