{
    "additionDate": "2021-01-18T09:34:14Z",
    "biotoolsCURIE": "biotools:advit",
    "biotoolsID": "advit",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "description": "ADVIT is an Automated Dorsum Vein Identification Tool, which helps to perform human identification through hand dorsum vein images. The program can be requested using the form.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA profiling",
                    "uri": "http://edamontology.org/operation_3894"
                }
            ]
        }
    ],
    "homepage": "http://zeetu.org/advit.html",
    "lastUpdate": "2021-01-21T14:24:45Z",
    "name": "ADVIT",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.FORSCIINT.2020.110345",
            "metadata": {
                "abstract": "© 2020 Elsevier B.V.The identification of an individual is one of the main applications of forensic science, used in legal settings for deciding cases in courts of law. Different methods have been developed for the identification of a person, including fingerprints, DNA profiling, retina scan, facial features and many others. The reliable and accurate identification mainly relies upon substantial variability of structures and features of evidence corresponding to reference material. During the last decade, human identification through hand vein patterns has been focused in various studies and shown promising results. However, most of the reported methods require extensive human efforts for manual feature calculation. Herein, we propose a novel identification tool namely ADVIT for the identification of humans based on their dorsum veins pattern. The samples of the dorsum of the right or left hand were collected from 50 participants in the form of images. Initially, images were preprocessed and noise (in terms of hair on the skin and other details) was removed. Later on, the vein skeleton was extracted from the preprocessed images and a binary image of veins pattern (veins in the foreground and every other detail as background) was generated. Two different types of the feature were computed and based on these features, three different experiments were performed and the evaluation metrics were computed. Merging of hand-crafted grid-based features and deep representation from RESNET-50 showed maximum results in terms of Sensitivity (0.8803), Specificity (0.8890), Precision (0.8849), False Positive Rate (0.1074), Accuracy (0.8861), F1 Score (0.8817), and MCC (0.7636). These results depicted that the model is accurate and sensitive for identification through dorsum veins pattern. The proposed model can aid forensic scientists to identify perpetrator using hand images. ADVIT is freely available at (http://zeetu.org/advit.html).",
                "authors": [
                    {
                        "name": "Hussain W."
                    },
                    {
                        "name": "Rasool N."
                    },
                    {
                        "name": "Yaseen M."
                    }
                ],
                "date": "2020-08-01T00:00:00Z",
                "journal": "Forensic Science International",
                "title": "ADVIT: Using the potentials of deep representations incorporated with grid-based features of dorsum vein patterns for human identification"
            },
            "pmid": "32505803"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        }
    ],
    "validated": 1
}