{
    "additionDate": "2017-03-25T17:08:03Z",
    "biotoolsCURIE": "biotools:t-rmsd",
    "biotoolsID": "t-rmsd",
    "credit": [
        {
            "email": "cedric.notredame@europe.com",
            "name": "Cedric Notredame",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A web server that allows a fine-grained structural classification of proteins using the T-RMSD method (Tree based on Root Mean Square Deviation). Providing a set of proteins sequences, it produces a structural tree with support values for each cluster node, reminiscent to bootstrap values. These values, associated with the tree topology, allow a quantitative estimate of structural distances between proteins or group of proteins defined by the tree topology.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://tcoffee.crg.cat/apps/tcoffee/tutorial_trmsd.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Structure classification",
                    "uri": "http://edamontology.org/operation_2996"
                }
            ]
        }
    ],
    "homepage": "http://tcoffee.crg.cat/apps/tcoffee/do:trmsd",
    "lastUpdate": "2018-12-10T12:58:47Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/t-rmsd-allows-fine-grained-structural-clustering-of-a-given-group-of-related-protein-domains.html"
        }
    ],
    "name": "T-RMSD",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "This article introduces the T-RMSD web server (tree-based on root-mean-square deviation), a service allowing the online computation of structure-based protein classification. It has been developed to address the relation between structural and functional similarity in proteins, and it allows a fine-grained structural clustering of a given protein family or group of structurally related proteins using distance RMSD (dRMSD) variations. These distances are computed between all pairs of equivalent residues, as defined by the ungapped columns within a given multiple sequence alignment. Using these generated distance matrices (one per equivalent position), T-RMSD produces a structural tree with support values for each cluster node, reminiscent of bootstrap values. These values, associated with the tree topology, allow a quantitative estimate of structural distances between proteins or group of proteins defined by the tree topology. The clusters thus defined have been shown to be structurally and functionally informative. The T-RMSD web server is a free website open to all users and available at http://tcoffee.crg.cat/apps/tcoffee/do:trmsd.",
                "authors": [
                    {
                        "name": "Magis C."
                    },
                    {
                        "name": "Di Tommaso P."
                    },
                    {
                        "name": "Notredame C."
                    }
                ],
                "citationCount": 3,
                "date": "2013-01-01T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "T-RMSD: a web server for automated fine-grained protein structural classification."
            },
            "pmid": "23716642"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Structural genomics",
            "uri": "http://edamontology.org/topic_0122"
        }
    ],
    "validated": 1
}