{
    "additionDate": "2021-01-18T09:52:08Z",
    "biotoolsCURIE": "biotools:ganon",
    "biotoolsID": "ganon",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "bernhard.renard@hpi.de",
            "name": "Bernhard Y Renard",
            "typeEntity": "Person"
        }
    ],
    "description": "Precise metagenomics classification against large and up-to-date sets of reference sequences.\n\nbenchmarking pipeline used to evaluate ganon as presented in https://www.biorxiv.org/content/10.1101/406017v3.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                },
                {
                    "term": "k-mer counting",
                    "uri": "http://edamontology.org/operation_3472"
                }
            ]
        }
    ],
    "homepage": "https://gitlab.com/rki_bioinformatics/ganon",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-02-10T09:35:13.140885Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/pirovc/ganon_benchmark"
        }
    ],
    "name": "Ganon",
    "owner": "pirovc",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA458",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press.Motivation: The exponential growth of assembled genome sequences greatly benefits metagenomics studies. However, currently available methods struggle to manage the increasing amount of sequences and their frequent updates. Indexing the current RefSeq can take days and hundreds of GB of memory on large servers. Few methods address these issues thus far, and even though many can theoretically handle large amounts of references, time/ memory requirements are prohibitive in practice. As a result, many studies that require sequence classification use often outdated and almost never truly up-to-date indices. Results: Motivated by those limitations, we created ganon, a k-mer-based read classification tool that uses Interleaved Bloom Filters in conjunction with a taxonomic clustering and a k-mer counting/filtering scheme. Ganon provides an efficient method for indexing references, keeping them updated. It requires <55 min to index the complete RefSeq of bacteria, archaea, fungi and viruses. The tool can further keep these indices up-to-date in a fraction of the time necessary to create them. Ganon makes it possible to query against very large reference sets and therefore it classifies significantly more reads and identifies more species than similar methods. When classifying a high-complexity CAMI challenge dataset against complete genomes from RefSeq, ganon shows strongly increased precision with equal or better sensitivity compared with state-of-the-art tools. With the same dataset against the complete RefSeq, ganon improved the F1-score by 65% at the genus level. It supports taxonomy- and assembly-level classification, multiple indices and hierarchical classification. Availability and implementation: The software is open-source and available at: https://gitlab.com/rki_bioinformatics/ganon.",
                "authors": [
                    {
                        "name": "Dadi T.H."
                    },
                    {
                        "name": "Piro V.C."
                    },
                    {
                        "name": "Reinert K."
                    },
                    {
                        "name": "Renard B.Y."
                    },
                    {
                        "name": "Seiler E."
                    }
                ],
                "citationCount": 6,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "ganon: precise metagenomics classification against large and up-to-date sets of reference sequences"
            },
            "pmcid": "PMC7355301",
            "pmid": "32657362"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        }
    ],
    "validated": 1
}
