{
    "additionDate": "2016-04-27T12:29:15Z",
    "biotoolsCURIE": "biotools:vipr",
    "biotoolsID": "vipr",
    "collectionID": [
        "COVID-19"
    ],
    "credit": [
        {
            "name": "rki.de",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.viprbrc.org/brc/staticContent.spg?decorator=vipr&type=ViprInfo&subtype=Team"
        },
        {
            "email": "bpickett@jcvi.org",
            "name": "Brett Pickett",
            "orcidid": "http://orcid.org/0000-0001-7930-8160",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "This database supports the research of viral pathogens in the NIAID Category A-C Priority Pathogen lists and those causing (re)emerging infectious diseases. It integrates data from external sources (GenBank, UniProt, Immune Epitope Database, Protein Data Bank, etc.), direct submissions, and internal curation and analysis pipelines, and provides a suite of bioinformatics analysis and visualization tools to expedite virology research.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://www.viprbrc.org/brc/home.spg?decorator=vipr"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Phylogenetic tree generation",
                    "uri": "http://edamontology.org/operation_0323"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                }
            ]
        }
    ],
    "homepage": "http://www.viprbrc.org/brc/home.spg?decorator=vipr",
    "lastUpdate": "2020-03-26T14:13:49Z",
    "name": "Virus Pathogen Resource (ViPR)",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "dabrowskiw@rki.de",
    "publication": [
        {
            "doi": "10.1093/nar/gkr859",
            "metadata": {
                "abstract": "The Virus Pathogen Database and Analysis Resource (ViPR, www.ViPRbrc.org) is an integrated repository of data and analysis tools for multiple virus families, supported by the National Institute of Allergy and Infectious Diseases (NIAID) Bioinformatics Resource Centers (BRC) program. ViPR contains information for human pathogenic viruses belonging to the Arenaviridae, Bunyaviridae, Caliciviridae, Coronaviridae, Flaviviridae, Filoviridae, Hepeviridae, Herpesviridae, Paramyxoviridae, Picornaviridae, Poxviridae, Reoviridae, Rhabdoviridae and Togaviridae families, with plans to support additional virus families in the future. ViPR captures various types of information, including sequence records, gene and protein annotations, 3D protein structures, immune epitope locations, clinical and surveillance metadata and novel data derived from comparative genomics analysis. Analytical and visualization tools for metadata-driven statistical sequence analysis, multiple sequence alignment, phylogenetic tree construction, BLAST comparison and sequence variation determination are also provided. Data filtering and analysis workflows can be combined and the results saved in personal 'Workbenches' for future use. ViPR tools and data are available without charge as a service to the virology research community to help facilitate the development of diagnostics, prophylactics and therapeutics for priority pathogens and other viruses. © The Author(s) 2011.",
                "authors": [
                    {
                        "name": "Pickett B.E."
                    },
                    {
                        "name": "Sadat E.L."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Noronha J.M."
                    },
                    {
                        "name": "Squires R.B."
                    },
                    {
                        "name": "Hunt V."
                    },
                    {
                        "name": "Liu M."
                    },
                    {
                        "name": "Kumar S."
                    },
                    {
                        "name": "Zaremba S."
                    },
                    {
                        "name": "Gu Z."
                    },
                    {
                        "name": "Zhou L."
                    },
                    {
                        "name": "Larson C.N."
                    },
                    {
                        "name": "Dietrich J."
                    },
                    {
                        "name": "Klem E.B."
                    },
                    {
                        "name": "Scheuermann R.H."
                    }
                ],
                "citationCount": 316,
                "date": "2012-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "ViPR: An open bioinformatics database and analysis resource for virology research"
            },
            "pmcid": "PMC3245011",
            "pmid": "22006842",
            "type": [
                "Primary"
            ]
        },
        {
            "metadata": {
                "abstract": "Several viruses within the Coronaviridae family have been categorized as either emerging or re-emerging human pathogens, with Severe Acute Respiratory Syndrome Coronavirus (SARS-CoV) being the most well known. The NIAID-sponsored Virus Pathogen Database and Analysis Resource (ViPR, www.viprbrc.org) supports bioinformatics workflows for a broad range of human virus pathogens and other related viruses, including the entire Coronaviridae family. ViPR provides access to sequence records, gene and protein annotations, immune epitopes, 3D structures, host factor data, and other data types through an intuitive web-based search interface. Records returned from these queries can then be subjected to web-based analyses including: multiple sequence alignment, phylogenetic inference, sequence variation determination, BLAST comparison, and metadata-driven comparative genomics statistical analysis. Additional tools exist to display multiple sequence alignments, view phylogenetic trees, visualize 3D protein structures, transfer existing reference genome annotations to new genomes, and store or share results from any search or analysis within personal private 'Workbench' spaces for future access. All of the data and integrated analysis and visualization tools in ViPR are made available without charge as a service to the Coronaviridae research community to facilitate the research and development of diagnostics, prophylactics, vaccines and therapeutics against these human pathogens. © 2012 by the authors; licensee MDPI, Basel, Switzerland.",
                "authors": [
                    {
                        "name": "Pickett B.E."
                    },
                    {
                        "name": "Greer D.S."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Stewart L."
                    },
                    {
                        "name": "Zhou L."
                    },
                    {
                        "name": "Sun G."
                    },
                    {
                        "name": "Gu Z."
                    },
                    {
                        "name": "Kumar S."
                    },
                    {
                        "name": "Zaremba S."
                    },
                    {
                        "name": "Larsen C.N."
                    },
                    {
                        "name": "Jen W."
                    },
                    {
                        "name": "Klem E.B."
                    },
                    {
                        "name": "Scheuermann R.H."
                    }
                ],
                "citationCount": 65,
                "date": "2012-11-01T00:00:00Z",
                "journal": "Viruses",
                "title": "Virus pathogen Database and Analysis Resource (ViPR): A comprehensive bioinformatics Database and Analysis Resource for the Coronavirus research community"
            },
            "pmid": "23202522",
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Web application",
        "Database portal",
        "Workbench"
    ],
    "topic": [
        {
            "term": "Virology",
            "uri": "http://edamontology.org/topic_0781"
        }
    ],
    "validated": 1
}