{
    "additionDate": "2021-01-18T11:56:40Z",
    "biotoolsCURIE": "biotools:cppsite",
    "biotoolsID": "cppsite",
    "confidence_flag": "tool",
    "description": "CPPsite is a Database of Cell Penetrating Peptides. It contains cell penetrating peptides (CPPs) alongwith their secondary & tertiary structure. This database maintains experimentally validated CPPs (linear & cyclic; modified & non-natural residues) and wide range of cargos (nucleic acids, proteins, nanoparticles, PNA) delivered in cells using these peptides.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA structure prediction",
                    "uri": "http://edamontology.org/operation_2442"
                },
                {
                    "term": "Protein structure validation",
                    "uri": "http://edamontology.org/operation_0321"
                },
                {
                    "term": "RNA structure prediction",
                    "uri": "http://edamontology.org/operation_2441"
                }
            ]
        }
    ],
    "homepage": "https://webs.iiitd.edu.in/raghava/cppsite",
    "lastUpdate": "2021-02-18T14:36:58Z",
    "name": "CPPsite",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.JMB.2020.11.002",
            "metadata": {
                "abstract": "© 2020 Elsevier LtdOne of the biggest barriers in drug and vaccine development is to find an effective delivery system. Cell-penetrating peptides (CPPs) play a crucial role for delivery of biological cargoes and pass them through the membranes. Several databases have been developed for therapeutic peptides as potential drug candidates and delivery vehicles. A rapid growth has occurred in many patents and research articles on CPPs as therapeutic peptides. To save time and cost in laboratories, prediction and design of CPPs before in vitro/in vivo experiments using computational methods and online web servers are rational. Various online web servers which provide prediction of CPPs including CellPPD, CPPpred, CPPred-RF and MLCPP, and also different curated databases that present validated information of CPPs such as CPPsite 2.0 have been developed up to now. Two methods including CellPPD and CPPpred were applied to predict and design potent CPPs. CPPsite 2.0 is a user-friendly updated database that provides various information about CPPs and contains 1855 entries. This database provides comprehensive information on experimentally tested CPPs and prediction of their secondary and tertiary structures to realize their structure–function relationship. Furthermore, each entry presents information of a CPP including chirality, origin, nature of peptide, sub-cellular localization, uptake mechanism and efficiency, amino acid composition, hydrophobicity, and physicochemical properties. One of main goals of CPPsite 2.0 database is to provide the latest datasets of CPPs for analysis and development of CPP prediction methods. CPPsite 2.0 is freely available at https://webs.iiitd.edu.in/raghava/cppsite.",
                "authors": [
                    {
                        "name": "Bolhassani A."
                    },
                    {
                        "name": "Kardani K."
                    }
                ],
                "citationCount": 6,
                "date": "2021-05-28T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "Cppsite 2.0: An Available Database of Experimentally Validated Cell-Penetrating Peptides Predicting their Secondary and Tertiary Structures"
            },
            "pmid": "33186582"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Biotherapeutics",
            "uri": "http://edamontology.org/topic_3374"
        },
        {
            "term": "Nucleic acids",
            "uri": "http://edamontology.org/topic_0077"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "version": [
        "2.0"
    ]
}
