{
    "additionDate": "2020-01-14T19:32:33Z",
    "biotoolsCURIE": "biotools:DatView",
    "biotoolsID": "DatView",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "n.zatsepin@latrobe.edu.au",
            "name": "Nadia Zatsepin",
            "orcidid": "https://orcid.org/0000-0003-1757-0205",
            "typeEntity": "Person"
        },
        {
            "name": "Natasha Stander",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        }
    ],
    "description": "A graphical user interface for visualizing and querying large data sets in serial femtosecond crystallography.\nDatView displays plots of tabular data and syncs selections across plots. It was initially developed for serial crystallography data analysis with CrystFEL output files and includes a frame viewer for displaying 1D and 2D data from HDF5/CXI files.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://zatsepinlab.atlassian.net/wiki/spaces/DAT/overview"
        },
        {
            "type": [
                "Quick start guide"
            ],
            "url": "https://zatsepinlab.atlassian.net/wiki/spaces/DAT/pages/827785219/Tutorial+2019"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                }
            ]
        }
    ],
    "homepage": "https://github.com/nstander/DatView",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-17T13:25:53Z",
    "name": "DatView",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1107/S1600576719012044",
            "metadata": {
                "abstract": "© 2019 Wiley-Blackwell. All rights reserved.DatView is a new graphical user interface (GUI) for plotting parameters to explore correlations, identify outliers and export subsets of data. It was designed to simplify and expedite analysis of very large unmerged serial femtosecond crystallography (SFX) data sets composed of indexing results from hundreds of thousands of microcrystal diffraction patterns. However, DatView works with any tabulated data, offering its functionality to many applications outside serial crystallography. In DatView's user-friendly GUI, selections are drawn onto plots and synchronized across all other plots, so correlations between multiple parameters in large multi-parameter data sets can be rapidly identified. It also includes an item viewer for displaying images in the current selection alongside the associated metadata. For serial crystallography data processed by indexamajig from CrystFEL [White, Kirian, Martin, Aquila, Nass, Barty & Chapman (2012). J. Appl. Cryst. 45, 335-341], DatView generates a table of parameters and metadata from stream files and, optionally, the associated HDF5 files. By combining the functionality of several commonly needed tools for SFX in a single GUI that operates on tabulated data, the time needed to load and calculate statistics from large data sets is reduced. This paper describes how DatView facilitates (i) efficient feedback during data collection by examining trends in time, sample position or any parameter, (ii) determination of optimal indexing and integration parameters via the comparison mode, (iii) identification of systematic errors in unmerged SFX data sets, and (iv) sorting and highly flexible data filtering (plot selections, Boolean filters and more), including direct export of subset CrystFEL stream files for further processing.",
                "authors": [
                    {
                        "name": "Stander N."
                    },
                    {
                        "name": "Fromme P."
                    },
                    {
                        "name": "Zatsepin N."
                    }
                ],
                "date": "2019-12-01T00:00:00Z",
                "journal": "Journal of Applied Crystallography",
                "title": "DatView: A graphical user interface for visualizing and querying large data sets in serial femtosecond crystallography"
            },
            "pmcid": "PMC6878877",
            "pmid": "31798364"
        }
    ],
    "topic": [
        {
            "term": "X-ray diffraction",
            "uri": "http://edamontology.org/topic_2828"
        },
        {
            "term": "RNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3794"
        }
    ],
    "validated": 1
}