{
    "additionDate": "2024-04-08T09:18:08.571358Z",
    "biotoolsCURIE": "biotools:framedna",
    "biotoolsID": "framedna",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jtuck@ncsu.edu",
            "name": "James M Tuck",
            "orcidid": "https://orcid.org/0000-0001-8975-0294",
            "typeEntity": "Person"
        },
        {
            "email": "kvolkel@ncsu.edu",
            "name": "Kevin D Volkel",
            "orcidid": "https://orcid.org/0000-0002-5200-5909",
            "typeEntity": "Person"
        }
    ],
    "description": "Framework for DNA-based data storage design, verification, and validation.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "https://github.com/dna-storage/framed/tree/v2.0.0",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-04-08T09:18:08.573861Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://zenodo.org/records/10139944"
        }
    ],
    "name": "FrameD",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAD572",
            "metadata": {
                "abstract": "Motivation: DNA-based data storage is a quickly growing field that hopes to harness the massive theoretical information density of DNA molecules to produce a competitive next-generation storage medium suitable for archival data. In recent years, many DNA-based storage system designs have been proposed. Given that no common infrastructure exists for simulating these storage systems, comparing many different designs along with many different error models is increasingly difficult. To address this challenge, we introduce FrameD, a simulation infrastructure for DNA storage systems that leverages the underlying modularity of DNA storage system designs to provide a framework to express different designs while being able to reuse common components. Results: We demonstrate the utility of FrameD and the need for a common simulation platform using a case study. Our case study compares designs that utilize strand copies differently, some that align strand copies using multiple sequence alignment algorithms and others that do not. We found that the choice to include multiple sequence alignment in the pipeline is dependent on the error rate and the type of errors being injected and is not always beneficial. In addition to supporting a wide range of designs, FrameD provides the user with transparent parallelism to deal with a large number of reads from sequencing and the need for many fault injection iterations. We believe that FrameD fills a void in the tools publicly available to the DNA storage community by providing a modular and extensible framework with support for massive parallelism. As a result, it will help accelerate the design process of future DNA-based storage systems.",
                "authors": [
                    {
                        "name": "Hook P.W."
                    },
                    {
                        "name": "Keung A.J."
                    },
                    {
                        "name": "Lin K.N."
                    },
                    {
                        "name": "Timp W."
                    },
                    {
                        "name": "Tuck J.M."
                    },
                    {
                        "name": "Volkel K.D."
                    }
                ],
                "date": "2023-10-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "FrameD: framework for DNA-based data storage design, verification, and validation"
            },
            "pmcid": "PMC10563143",
            "pmid": "37713474"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
