{
    "additionDate": "2021-03-19T08:45:22Z",
    "biotoolsCURIE": "biotools:phyto-lrr",
    "biotoolsID": "phyto-lrr",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "tiscchen@163.com",
            "name": "Tianshu Chen",
            "orcidid": "https://orcid.org/0000-0002-2566-4394",
            "typeEntity": "Person"
        }
    ],
    "description": "Identification and characterization of the LRR repeats in plant LRR-RLKs.\n\nThe predict-phytolrr program could identify LRRs effectively, especially for LRR motifs in plant LRR-RLKs.\n\nThe program is based on the position specific scoring matrix (PSSM) algorithm and its training dataset are 4000 LRR motifs highly conserved sequences (HCSs) from LRR-RLKs of 17 land plant species.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                },
                {
                    "term": "Sequence motif recognition",
                    "uri": "http://edamontology.org/operation_0239"
                },
                {
                    "term": "Phylogenetic analysis",
                    "uri": "http://edamontology.org/operation_0324"
                }
            ]
        }
    ],
    "homepage": "https://phytolrr.com/findlrr",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-28T10:04:23Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "http://github.com/phytolrr"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/phytolrr/predict-phytolrr"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/phytolrr/database"
        }
    ],
    "name": "Phyto-LRR",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12860-021-00344-Y",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Leucine-rich-repeat receptor-like kinases (LRR-RLKs) play central roles in sensing various signals to regulate plant development and environmental responses. The extracellular domains (ECDs) of plant LRR-RLKs contain LRR motifs, consisting of highly conserved residues and variable residues, and are responsible for ligand perception as a receptor or co-receptor. However, there are few comprehensive studies on the ECDs of LRR-RLKs due to the difficulty in effectively identifying the divergent LRR repeats. Results: In the current study, an efficient LRR motif prediction program, the “Phyto-LRR prediction” program, was developed based on the position-specific scoring matrix algorithm (PSSM) with some optimizations. This program was trained by 16-residue plant-specific LRR-highly conserved segments (HCS) from LRR-RLKs of 17 represented land plant species and a database containing more than 55,000 predicted LRRs based on this program was constructed. Both the prediction tool and database are freely available at http://phytolrr.com/ for website usage and at http://github.com/phytolrr for local usage. The LRR-RLKs were classified into 18 subgroups (SGs) according to the maximum-likelihood phylogenetic analysis of kinase domains (KDs) of the sequences. Based on the database and the SGs, the characteristics of the LRR motifs in the ECDs of the LRR-RLKs were examined, such as the arrangement of the LRRs, the solvent accessibility, the variable residues, and the N-glycosylation sites, revealing a comprehensive profile of the plant LRR-RLK ectodomains. Conclusion: The “Phyto-LRR prediction” program is effective in predicting the LRR segments in plant LRR-RLKs, which, together with the database, will facilitate the exploration of plant LRR-RLKs functions. Based on the database, comprehensive sequential characteristics of the plant LRR-RLK ectodomains were profiled and analyzed.",
                "authors": [
                    {
                        "name": "Chen T."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Molecular and Cell Biology",
                "title": "Identification and characterization of the LRR repeats in plant LRR-RLKs"
            },
            "pmcid": "PMC7841916",
            "pmid": "33509084"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Biological databases",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}