{"credit":[],"documentation":[{"type":"GENERAL","url":"https://bibiserv.cebitec.uni-bielefeld.de/aim"}],"download":[{"url":"https://bibiserv.cebitec.uni-bielefeld.de/applications/aim/resources/downloads/aim-0.82-linux.i586.tar.gz"}],"function":[{"operation":[{"term":"Image analysis","uri":"http://edamontology.org/operation_3443"}]},{"operation":[{"term":"Expression data rendering","uri":"http://edamontology.org/operation_0571"}]}],"labels":{"accessibility":["Open access"],"cost":"Free of charge","language":["C"],"license":"Unlicense","maturity":"Mature","operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"Microarray experiment","uri":"http://edamontology.org/topic_3518"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/aim-0-82-automatic-image-processing-microarrays.html"}],"publication":[{"abstract":"This paper describes image processing methods for automatic spotted microarray image analysis. Automatic gridding is important to achieve constant data quality and is, therefore, especially interesting for large-scale experiments as well as for integration of microarray expression data from different sources. We propose a Markov random field (MRF) based approach to high-level grid segmentation, which is robust to common problems encountered with array images and does not require calibration. We also propose an active contour method for single-spot segmentation. Active contour models describe objects in images by properties of their boundaries. Both MRFs and active contour models have been used in various other computer vision applications. The traditional active contour model must be generalized for successful application to microarray spot segmentation. Our active contour model is employed for spot detection in the MRF score functions as well as for spot signal segmentation in quantitative array image analysis. An evaluation using several image series from different sources shows the robustness of our methods.","authors":["Katzer M.","Kummert F.","Sagerer G."],"cit_count":65,"journal":"IEEE Transactions on Nanobioscience","pmid":"15376910","title":"Methods for automatic microarray image segmentation","year":"2003-01-01"}],"summary":{"biotoolsCURIE":"biotools:aim","biotoolsID":"aim","description":"The Automatic Image Processing for Microarrays tool is designed for uncalibrated microarray gridding and quantitative image analysis. Uncalibrated microarray image analysis supports integration of expression data from different sources and can improve reproducibility.","homepage":"http://bibiserv.techfak.uni-bielefeld.de/aim/","name":"AIM"}}