{
    "additionDate": "2021-01-18T07:38:08Z",
    "biotoolsCURIE": "biotools:cellphonedb",
    "biotoolsID": "cellphonedb",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Roser Vento-Tormo",
            "typeEntity": "Person"
        }
    ],
    "description": "CellPhoneDB is a publicly available repository of curated receptors, ligands and their interactions. Subunit architecture is included for both ligands and receptors, representing heteromeric complexes accurately. This is crucial, as cell-cell communication relies on multi-subunit protein complexes that go beyond the binary representation used in most databases and studies.",
    "download": [
        {
            "type": "Downloads page",
            "url": "https://cellphonedb.org/downloads"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Dot plot plotting",
                    "uri": "http://edamontology.org/operation_0490"
                },
                {
                    "term": "Network visualisation",
                    "uri": "http://edamontology.org/operation_3925"
                }
            ]
        }
    ],
    "homepage": "http://www.CellPhoneDB.org",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-10T20:13:38Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/Teichlab/cellphonedb"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/Teichlab/cellphonedb-data"
        }
    ],
    "name": "CellPhoneDB",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1038/S41596-020-0292-X",
            "metadata": {
                "abstract": "© 2020, The Author(s), under exclusive licence to Springer Nature Limited.Cell–cell communication mediated by ligand–receptor complexes is critical to coordinating diverse biological processes, such as development, differentiation and inflammation. To investigate how the context-dependent crosstalk of different cell types enables physiological processes to proceed, we developed CellPhoneDB, a novel repository of ligands, receptors and their interactions. In contrast to other repositories, our database takes into account the subunit architecture of both ligands and receptors, representing heteromeric complexes accurately. We integrated our resource with a statistical framework that predicts enriched cellular interactions between two cell types from single-cell transcriptomics data. Here, we outline the structure and content of our repository, provide procedures for inferring cell–cell communication networks from single-cell RNA sequencing data and present a practical step-by-step guide to help implement the protocol. CellPhoneDB v.2.0 is an updated version of our resource that incorporates additional functionalities to enable users to introduce new interacting molecules and reduces the time and resources needed to interrogate large datasets. CellPhoneDB v.2.0 is publicly available, both as code and as a user-friendly web interface; it can be used by both experts and researchers with little experience in computational genomics. In our protocol, we demonstrate how to evaluate meaningful biological interactions with CellPhoneDB v.2.0 using published datasets. This protocol typically takes ~2 h to complete, from installation to statistical analysis and visualization, for a dataset of ~10 GB, 10,000 cells and 19 cell types, and using five threads.",
                "authors": [
                    {
                        "name": "Efremova M."
                    },
                    {
                        "name": "Vento-Tormo M."
                    },
                    {
                        "name": "Teichmann S.A."
                    },
                    {
                        "name": "Vento-Tormo R."
                    }
                ],
                "citationCount": 186,
                "date": "2020-04-01T00:00:00Z",
                "journal": "Nature Protocols",
                "title": "CellPhoneDB: inferring cell–cell communication from combined expression of multi-subunit ligand–receptor complexes"
            },
            "pmid": "32103204"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        }
    ]
}