{
    "accessibility": "Open access",
    "additionDate": "2022-04-11T13:20:11.584679Z",
    "biotoolsCURIE": "biotools:mzinbva",
    "biotoolsID": "mzinbva",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "neowangtao@sjtu.edu.cn",
            "name": "Tao Wang",
            "typeEntity": "Person"
        },
        {
            "name": "Peirong Xu"
        },
        {
            "name": "Tiantian Liu"
        },
        {
            "name": "Yueyao Du"
        }
    ],
    "description": "Variational approximation for multilevel zero-inflated negative-binomial models for association analysis in microbiome surveys.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "https://github.com/liudoubletian/MZINBVA",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-04-11T13:20:11.587310Z",
    "license": "Not licensed",
    "name": "MZINBVA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAB443",
            "metadata": {
                "abstract": "© 2021 The Author(s) 2021. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.As our understanding of the microbiome has expanded, so has the recognition of its critical role in human health and disease, thereby emphasizing the importance of testing whether microbes are associated with environmental factors or clinical outcomes. However, many of the fundamental challenges that concern microbiome surveys arise from statistical and experimental design issues, such as the sparse and overdispersed nature of microbiome count data and the complex correlation structure among samples. For example, in the human microbiome project (HMP) dataset, the repeated observations across time points (level 1) are nested within body sites (level 2), which are further nested within subjects (level 3). Therefore, there is a great need for the development of specialized and sophisticated statistical tests. In this paper, we propose multilevel zero-inflated negative-binomial models for association analysis in microbiome surveys. We develop a variational approximation method for maximum likelihood estimation and inference. It uses optimization, rather than sampling, to approximate the log-likelihood and compute parameter estimates, provides a robust estimate of the covariance of parameter estimates and constructs a Wald-Type test statistic for association testing. We evaluate and demonstrate the performance of our method using extensive simulation studies and an application to the HMP dataset. We have developed an R package MZINBVA to implement the proposed method, which is available from the GitHub repository https://github.com/liudoubletian/MZINBVA.",
                "authors": [
                    {
                        "name": "Du Y."
                    },
                    {
                        "name": "Liu T."
                    },
                    {
                        "name": "Lu H."
                    },
                    {
                        "name": "Wang T."
                    },
                    {
                        "name": "Xu P."
                    },
                    {
                        "name": "Zhao H."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "MZINBVA: Variational approximation for multilevel zero-inflated negative-binomial models for association analysis in microbiome surveys"
            },
            "pmid": "34718406"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Metatranscriptomics",
            "uri": "http://edamontology.org/topic_3941"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
