{
    "additionDate": "2018-08-06T09:50:03Z",
    "biotoolsCURIE": "biotools:recoittv",
    "biotoolsID": "recoittv",
    "credit": [
        {
            "email": "desco@hggm.es",
            "name": "Manuel Desco",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "It's an accelerated implementation of an iterative method for CBCT following the Split Bregman formulation, which reduces computational time through GPU-accelerated kernels. The implementation enables the reconstruction of large volumes (>10243 pixels) using partitioning strategies in forward- and back-projection operations.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/arcosuc3m/recoittv/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://github.com/arcosuc3m/recoittv",
    "language": [
        "C"
    ],
    "lastUpdate": "2024-11-25T14:27:55.072063Z",
    "name": "RecoItTV",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "shadi.m",
    "publication": [
        {
            "doi": "10.1186/s12859-018-2169-3",
            "metadata": {
                "abstract": "Background: Standard cone-beam computed tomography (CBCT) involves the acquisition of at least 360 projections rotating through 360 degrees. Nevertheless, there are cases in which only a few projections can be taken in a limited angular span, such as during surgery, where rotation of the source-detector pair is limited to less than 180 degrees. Reconstruction of limited data with the conventional method proposed by Feldkamp, Davis and Kress (FDK) results in severe artifacts. Iterative methods may compensate for the lack of data by including additional prior information, although they imply a high computational burden and memory consumption. Results: We present an accelerated implementation of an iterative method for CBCT following the Split Bregman formulation, which reduces computational time through GPU-accelerated kernels. The implementation enables the reconstruction of large volumes (>10243 pixels) using partitioning strategies in forward-and back-projection operations. We evaluated the algorithm on small-animal data for different scenarios with different numbers of projections, angular span, and projection size. Reconstruction time varied linearly with the number of projections and quadratically with projection size but remained almost unchanged with angular span. Forward-and back-projection operations represent 60% of the total computational burden. Conclusion: Efficient implementation using parallel processing and large-memory management strategies together with GPU kernels enables the use of advanced reconstruction approaches which are needed in limited-data scenarios. Our GPU implementation showed a significant time reduction (up to 48 ×) compared to a CPU-only implementation, resulting in a total reconstruction time from several hours to few minutes.",
                "authors": [
                    {
                        "name": "Abella M."
                    },
                    {
                        "name": "Carretero J."
                    },
                    {
                        "name": "Desco M."
                    },
                    {
                        "name": "Garcia-Blas J."
                    },
                    {
                        "name": "Serrano E."
                    },
                    {
                        "name": "de Molina C."
                    }
                ],
                "citationCount": 11,
                "date": "2018-05-15T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "GPU-accelerated iterative reconstruction for limited-data tomography in CBCT systems"
            },
            "pmcid": "PMC5952580",
            "pmid": "29764362",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ],
    "validated": 1,
    "version": [
        "1.4.1"
    ]
}
