{
    "additionDate": "2018-06-18T19:08:12Z",
    "biotoolsCURIE": "biotools:disco_segmentation",
    "biotoolsID": "disco_segmentation",
    "credit": [
        {
            "email": "mcrane2@uw.edu",
            "name": "Matthew M Crane",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Framework for using the physical constraints imposed by microfluidic traps, the shape based morphological constraints of budding yeast and temporal information about cell growth and motion to allow tracking and segmentation of cells in microfluidic devices.",
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/pswain/segmentation-software/tree/master/Documentation"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Spectral counting",
                    "uri": "http://edamontology.org/operation_3637"
                }
            ]
        }
    ],
    "homepage": "https://github.com/pswain/segmentation-software",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "DISCO",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btx550",
            "metadata": {
                "abstract": "© 2017 The Author. Motivation: Although high-content image cytometry is becoming increasingly routine, processing the large amount of data acquired during time-lapse experiments remains a challenge. The majority of approaches for automated single-cell segmentation focus on flat, uniform fields of view covered with a single layer of cells. In the increasingly popular microfluidic devices that trap individual cells for long term imaging, these conditions are not met. Consequently, most techniques for segmentation perform poorly. Although potentially constraining the generalizability of software, incorporating information about the microfluidic features, flow of media and the morphology of the cells can substantially improve performance. Results: Here we present DISCO (Data Informed Segmentation of Cell Objects), a framework for using the physical constraints imposed by microfluidic traps, the shape based morphological constraints of budding yeast and temporal information about cell growth and motion to allow tracking and segmentation of cells in microfluidic devices. Using manually curated datasets, we demonstrate substantial improvements in both tracking and segmentation when compared with existing software.",
                "authors": [
                    {
                        "name": "Bakker E."
                    },
                    {
                        "name": "Swain P.S."
                    },
                    {
                        "name": "Crane M.M."
                    }
                ],
                "citationCount": 3,
                "date": "2018-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Morphologically constrained and data informed cell segmentation of budding yeast"
            }
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ],
    "validated": 1
}