{
    "additionDate": "2018-05-08T14:39:49Z",
    "biotoolsCURIE": "biotools:mantis",
    "biotoolsID": "mantis",
    "credit": [
        {
            "email": "jose.lourenco@zoo.ox.ac.uk",
            "name": "Jose Lourenco",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "An R package that simulates multilocus models of pathogen evolution.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://www.dropbox.com/s/p7r4ni617hehyuo/MANTIS_3.0_manual.pdf?raw=1"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "note": "simulates multilocus models of pathogen evolution",
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "https://www.eeid.ox.ac.uk/mantis",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "license": "GPL-3.0",
    "name": "MANTIS",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/S12859-015-0598-9",
            "metadata": {
                "abstract": "© 2015 Lourenço et al. licensee BioMed Central.Background: In host-pathogen systems the development of immunity by the host places pressure on pathogens, by setting up competition between genetic variants due to the establishment of cross-protective responses. These pressures can lead to pathogen-specific, ubiquitous dynamic behaviours. Understanding the evolutionary forces that shape these patterns is one of the key goals of computationally simulated epidemiological models. Despite the contribution of such research methods in recent years to our current understanding of pathogen evolution, the availability of free software tools for the general public remains scarce. Results: We developed the Multilocus ANTIgenic Simulator (MANTIS) software package for the R statistical environment. MANTIS can simulate and analyse epidemiological time-series generated under the biological assumptions of the strain theory of host-pathogen systems by Gupta et al. Conclusions: MANTIS wraps a C/C++ ordinary-differential equations system and Runge-Kutta solver into a set of user-friendly R functions. These include routines to numerically simulate the system and others to analyse, visualize and export results. For this, the package offers its own set of time-series plotting and exportation functions. MANTIS's main goal is to serve as a free, ready-to-use academic software tool. Its open source nature further provides an opportunity for users with advanced programming skills to expand its capabilities. Here, we describe the background theory, implementation, basic functionality and usage of this package. MANTIS is freely available from http://www.eeid.ox.ac.uk/mantis under the GPL license.",
                "authors": [
                    {
                        "name": "Lourenco J."
                    },
                    {
                        "name": "Wikramaratna P.S."
                    },
                    {
                        "name": "Gupta S."
                    }
                ],
                "citationCount": 5,
                "date": "2015-12-12T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "MANTIS: An R package that simulates multilocus models of pathogen evolution"
            },
            "pmcid": "PMC4445977",
            "pmid": "26017358"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Simulation experiment",
            "uri": "http://edamontology.org/topic_3524"
        }
    ],
    "validated": 1
}