{
    "additionDate": "2017-12-18T00:06:05Z",
    "biotoolsCURIE": "biotools:ensembleclust",
    "biotoolsID": "ensembleclust",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.dna.bio.keio.ac.jp/"
        }
    ],
    "description": "EnsembleClust enables fast and accurate clustering of ncRNAs.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bpla-kernel.dna.bio.keio.ac.jp/clustering/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "http://bpla-kernel.dna.bio.keio.ac.jp/clustering/",
    "language": [
        "Ruby",
        "Perl",
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/ensembleclust-1-0-fast-and-accurate-clustering-of-noncoding-rnas.html"
        }
    ],
    "name": "EnsembleClust",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-12-S1-S48",
            "metadata": {
                "abstract": "Background: Clustering of unannotated transcripts is an important task to identify novel families of noncoding RNAs (ncRNAs). Several hierarchical clustering methods have been developed using similarity measures based on the scores of structural alignment. However, the high computational cost of exact structural alignment requires these methods to employ approximate algorithms. Such heuristics degrade the quality of clustering results, especially when the similarity among family members is not detectable at the primary sequence level.Results: We describe a new similarity measure for the hierarchical clustering of ncRNAs. The idea is that the reliability of approximate algorithms can be improved by utilizing the information of suboptimal solutions in their dynamic programming frameworks. We approximate structural alignment in a more simplified manner than the existing methods. Instead, our method utilizes all possible sequence alignments and all possible secondary structures, whereas the existing methods only use one optimal sequence alignment and one optimal secondary structure. We demonstrate that this strategy can achieve the best balance between the computational cost and the quality of the clustering. In particular, our method can keep its high performance even when the sequence identity of family members is less than 60%.Conclusions: Our method enables fast and accurate clustering of ncRNAs. The software is available for download at http://bpla-kernel.dna.bio.keio.ac.jp/clustering/. © 2011 Saito et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Saito Y."
                    },
                    {
                        "name": "Sato K."
                    },
                    {
                        "name": "Sakakibara Y."
                    }
                ],
                "citationCount": 8,
                "date": "2011-02-15T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Fast and accurate clustering of noncoding RNAs using ensembles of sequence alignments and secondary structures"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}