{
    "additionDate": "2021-09-28T18:53:12.148173Z",
    "biotoolsCURIE": "biotools:ipcarf",
    "biotoolsID": "ipcarf",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "dailingyun_1@163.com",
            "name": "Ling-Yun Dai",
            "orcidid": "https://orcid.org/0000-0002-5473-323X",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "IPCARF is a tools for improving lncRNA-disease association prediction using incremental principal component analysis feature selection and a random forest classifier.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Principal component analysis",
                    "uri": "http://edamontology.org/operation_3960"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                }
            ]
        }
    ],
    "homepage": "https://github.com/zhurong1942/IPCARF_zr1",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-09-28T18:53:12.150897Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/zhurong1942/IPCARF_zr1/issues"
        }
    ],
    "name": "IPCARF",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04104-9",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Identifying lncRNA-disease associations not only helps to better comprehend the underlying mechanisms of various human diseases at the lncRNA level but also speeds up the identification of potential biomarkers for disease diagnoses, treatments, prognoses, and drug response predictions. However, as the amount of archived biological data continues to grow, it has become increasingly difficult to detect potential human lncRNA-disease associations from these enormous biological datasets using traditional biological experimental methods. Consequently, developing new and effective computational methods to predict potential human lncRNA diseases is essential. Results: Using a combination of incremental principal component analysis (IPCA) and random forest (RF) algorithms and by integrating multiple similarity matrices, we propose a new algorithm (IPCARF) based on integrated machine learning technology for predicting lncRNA-disease associations. First, we used two different models to compute a semantic similarity matrix of diseases from a directed acyclic graph of diseases. Second, a characteristic vector for each lncRNA-disease pair is obtained by integrating disease similarity, lncRNA similarity, and Gaussian nuclear similarity. Then, the best feature subspace is obtained by applying IPCA to decrease the dimension of the original feature set. Finally, we train an RF model to predict potential lncRNA-disease associations. The experimental results show that the IPCARF algorithm effectively improves the AUC metric when predicting potential lncRNA-disease associations. Before the parameter optimization procedure, the AUC value predicted by the IPCARF algorithm under 10-fold cross-validation reached 0.8529; after selecting the optimal parameters using the grid search algorithm, the predicted AUC of the IPCARF algorithm reached 0.8611. Conclusions: We compared IPCARF with the existing LRLSLDA, LRLSLDA-LNCSIM, TPGLDA, NPCMF, and ncPred prediction methods, which have shown excellent performance in predicting lncRNA-disease associations. The compared results of 10-fold cross-validation procedures show that the predictions of the IPCARF method are better than those of the other compared methods.",
                "authors": [
                    {
                        "name": "Zhu R."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Liu J.-X."
                    },
                    {
                        "name": "Dai L.-Y."
                    }
                ],
                "citationCount": 1,
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "IPCARF: improving lncRNA-disease association prediction using incremental principal component analysis feature selection and a random forest classifier"
            },
            "pmcid": "PMC8017839",
            "pmid": "33794766",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}