{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:19:55Z",
    "biotoolsCURIE": "biotools:LinkeDomics",
    "biotoolsID": "LinkeDomics",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "cxh0663@126.com",
            "name": "Xiaohua Chen",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Publicly available portal that includes multi-omics data from all 32 TCGA Cancer types. It also includes mass spectrometry-based proteomics data generated by the Clinical Proteomics Tumor Analysis Consortium (CPTAC) for TCGA breast, colorectal and ovarian tumors.",
    "documentation": [
        {
            "note": "Tutorial material",
            "type": [
                "Training material"
            ],
            "url": "http://www.linkedomics.org/Manual/LinkedOmics_Workshop_10042017.pdf"
        },
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.linkedomics.org/Manual/LinkedOmicsManual_1.1.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                }
            ]
        }
    ],
    "homepage": "http://www.linkedomics.org",
    "lastUpdate": "2020-06-16T10:55:25Z",
    "license": "Unlicense",
    "maturity": "Mature",
    "name": "LinkeDomics",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1097/MD.0000000000015774",
            "metadata": {
                "abstract": "Copyright © 2019 the Author(s). Published by Wolters Kluwer Health, Inc. This is an open access article distributed under the terms of the Creative Commons Attribution-Non Commercial-No Derivatives License 4.0 (CCBY-NCND), where it is permissible to download and share the work provided it is properly cited.Background: Melanoma-associated antigen-A (MAGE-A) was recognized as high-expressed in many solid tumors including esophageal carcinoma (EC), nevertheless, was reported to be low/not-expressed in normal tissues. Thus, it was considered as an extraordinary appropriate target for treatment especially in immunotherapy. Therefore, it demanded more detail knowledge on the precise function of MAGE-A. Methods: In this study, we used the data from the Cancer Genome Atlas dataset (TCGA-ESCA) to analyze the expression and survival for MAGE A3/4/11 (the subtype of MAGE-A) using the online tool of UALCAN. Furthermore, the high-throughput sequencing data of the patients with esophageal squamous-cell carcinoma (ESCC) from TCGA dataset were performed to analyze the correlation test, gene ontology (GO), and Kyoto Encyclopedia of Genes and Genomes (KEGG) pathway enrichment of MAGE A3/4/9/11 using LinkeDomics (online tool) and ClueGO (inner software of Cytoscape). Finally, relative gene expressions of MAGE A3/4/9/11 were verified by quantitative real-time PCR (q-PCR) in the patients with EC. Results: MAGE A3/4/11 was high-expressed in tissues of patients with ESCC, and there was no difference in survival time for patients between the high-expressed with the low/medium-expressed. The Go enrichment analysis showed that the 4 MAGE-A subtypes (MAGE-A3/4/9/11) were enriched in the regulation of the adaptive immune response, translational initiation, interleukin-4 production, response to type I interferon, and skin development, respectively. The KEGG results showed that they were enriched in T cell receptor signaling pathway (MAGE-A3), Th1 and Th2 differentiation, antigen processing and presentation (MAGE-A4), cytokine-cytokine receptor interaction (MAGE-A9), and chemokine signaling pathway (MAGE-A11). Conclusion: MAGE A3/4/9/11 was high-expressed in EC, and were enrolled in the regulation of immune response. They may consider as candidate immune target for EC treatment and provided the messages for further research in the function of MAGE-A.",
                "authors": [
                    {
                        "name": "Cai S."
                    },
                    {
                        "name": "Cao X."
                    },
                    {
                        "name": "Chen X."
                    },
                    {
                        "name": "Li W."
                    },
                    {
                        "name": "Wang L."
                    },
                    {
                        "name": "Zhang X."
                    }
                ],
                "citationCount": 1,
                "date": "2019-05-01T00:00:00Z",
                "journal": "Medicine (United States)",
                "title": "Analysis of the function of MAGE-A in esophageal carcinoma by bioinformatics"
            },
            "pmcid": "PMC6571408",
            "pmid": "31124967",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Immunoproteins, genes and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ],
    "validated": 1
}
