{
    "additionDate": "2018-10-31T10:17:24Z",
    "biotoolsCURIE": "biotools:dismiss",
    "biotoolsID": "dismiss",
    "credit": [
        {
            "email": "mts11@aber.ac.uk",
            "name": "Martin T. Swain",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "DISMISS is a new software package that detects strand-associated DNA methylation from existing MeDIP-Seq analyses",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://uhkniazi.github.io/dismiss/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "homepage": "http://uhkniazi.github.io/dismiss/",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/uhkniazi/dismiss"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/uhkniazi/dismiss/issues"
        }
    ],
    "name": "DISMISS",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1186/s12859-016-1158-7",
            "metadata": {
                "abstract": "© 2016 The Author(s).Background: DNA methylation is an important regulator of gene expression and chromatin structure. Methylated DNA immunoprecipitation sequencing (MeDIP-Seq) is commonly used to identify regions of DNA methylation in eukaryotic genomes. Within MeDIP-Seq libraries, methylated cytosines can be found in both double-stranded (symmetric) and single-stranded (asymmetric) genomic contexts. While symmetric CG methylation has been relatively well-studied, asymmetric methylation in any dinucleotide context has received less attention. Importantly, no currently available software for processing MeDIP-Seq reads is able to resolve these strand-specific DNA methylation signals. Here we introduce DISMISS, a new software package that detects strand-associated DNA methylation from existing MeDIP-Seq analyses. Results: Using MeDIP-Seq datasets derived from Apis mellifera (honeybee), an invertebrate species that contains more asymmetric- than symmetric- DNA methylation, we demonstrate that DISMISS can identify strand-specific DNA methylation signals with similar accuracy as bisulfite sequencing (BS-Seq; single nucleotide resolution methodology). Specifically, DISMISS is able to confidently predict where DNA methylation predominates (plus or minus DNA strands - asymmetric DNA methylation; plus and minus DNA stands - symmetric DNA methylation) in MeDIP-Seq datasets derived from A. mellifera samples. When compared to DNA methylation data derived from BS-Seq analysis of A. mellifera worker larva, DISMISS-mediated identification of strand-specific methylated cytosines is 80 % accurate. Furthermore, DISMISS can correctly (p <0.0001) detect the origin (sense vs antisense DNA strands) of DNA methylation at splice site junctions in A. mellifera MeDIP-Seq datasets with a precision close to BS-Seq analysis. Finally, DISMISS-mediated identification of DNA methylation signals associated with upstream, exonic, intronic and downstream genomic loci from A. mellifera MeDIP-Seq datasets outperforms MACS2 (Model-based Analysis of ChIP-Seq2; a commonly used MeDIP-Seq analysis software) and closely approaches the results achieved by BS-Seq. Conclusions: While asymmetric DNA methylation is increasingly being found in growing numbers of eukaryotic species and is the predominant pattern observed in some invertebrate genomes, it has been difficult to detect in MeDIP-Seq datasets using existing software. DISMISS now enables more sensitive examinations of MeDIP-Seq datasets and will be especially useful for the study of genomes containing either low levels of DNA methylation or for genomes containing relatively high amounts of asymmetric methylation.",
                "authors": [
                    {
                        "name": "Niazi U."
                    },
                    {
                        "name": "Geyer K.K."
                    },
                    {
                        "name": "Vickers M.J."
                    },
                    {
                        "name": "Hoffmann K.F."
                    },
                    {
                        "name": "Swain M.T."
                    }
                ],
                "citationCount": 2,
                "date": "2016-07-29T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "DISMISS: Detection of stranded methylation in MeDIP-Seq data"
            },
            "pmcid": "PMC4966778",
            "pmid": "27473283",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Plug-in"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}