{
    "accessibility": "Open access",
    "additionDate": "2022-08-17T11:06:08.203924Z",
    "biotoolsCURIE": "biotools:qrat",
    "biotoolsID": "qrat",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "daniel.flatschacher@uibk.ac.at",
            "name": "Daniel Flatschacher",
            "orcidid": "https://orcid.org/0000-0001-8221-9695",
            "url": "https://www.uibk.ac.at/microbiology/services/qrat/"
        }
    ],
    "description": "qRAT is a R based standalone desktop application to automate the processing of raw Quantification Cycle (Cq) data files exported from virtually any qPCR instrument using well established and state-of-the-art statistical and graphical techniques. The purpose of this tool is to provide a comprehensive, straightforward, and easy-to-use solution for the relative quantification of RT-qPCR data that requires no programming knowledge or additional software installation.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://fileshare.uibk.ac.at/f/c7f80a4cb9bd45bc9ee2/?dl=1"
        }
    ],
    "download": [
        {
            "type": "Downloads page",
            "url": "https://www.uibk.ac.at/microbiology/services/qrat/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                },
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://www.uibk.ac.at/microbiology/services/qrat/",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-08-17T11:11:17.234625Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/DaniFlat/qRAT"
        }
    ],
    "maturity": "Mature",
    "name": "qRAT - qPCR relative expression analysis tool",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "danielf",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: Reverse transcription quantitative real-time PCR (RT-qPCR) is a well-established method for analysing gene expression. Most RT-qPCR experiments in the field of microbiology aim for the detection of transcriptional changes by relative quantification, which means the comparison of the expression level of a specific gene between different samples by the application of a calibration condition and internal reference genes. Due to the numerous data processing procedures and factors that can influence the final result, relative expression analysis and interpretation of RT-qPCR data are still not trivial and often necessitate the use of multiple separate software packages capable of performing specific functions. Results: Here we present qRAT, a stand-alone desktop application based on R that automatically processes raw output data from any qPCR machine using well-established and state-of-the-art statistical and graphical techniques. The ability of qRAT to analyse RT-qPCR data was evaluated using two example datasets generated in our laboratory. The tool successfully completed the procedure in both cases, returning the expected results. The current implementation includes functionalities for parsing, filtering, normalizing and visualisation of relative RT-qPCR data, like the determination of the relative quantity and the fold change of differentially expressed genes as well as the correction of inter-plate variation for multiple-plate experiments. Conclusion: qRAT provides a comprehensive, straightforward, and easy-to-use solution for the relative quantification of RT-qPCR data that requires no programming knowledge or additional software installation. All application features are available for free and without requiring a login or registration.",
                "authors": [
                    {
                        "name": "Flatschacher D."
                    },
                    {
                        "name": "Speckbacher V."
                    },
                    {
                        "name": "Zeilinger S."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "qRAT: an R-based stand-alone application for relative expression analysis of RT-qPCR data"
            },
            "pmid": "35854213"
        }
    ],
    "toolType": [
        "Desktop application",
        "Script",
        "Web application"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "PCR experiment",
            "uri": "http://edamontology.org/topic_3519"
        }
    ]
}
