{
    "additionDate": "2020-01-14T20:02:46Z",
    "biotoolsCURIE": "biotools:MLVAType",
    "biotoolsID": "MLVAType",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jerome.ambroise@uclouvain.be",
            "name": "Jérôme Ambroise",
            "orcidid": "https://orcid.org/0000-0002-1218-6143",
            "typeEntity": "Person"
        }
    ],
    "description": "Backward compatibility of whole genome sequencing data with MLVA typing using a new MLVAtype shiny application for Vibrio cholerae.\n\npython-dev (sudo apt-get install python-dev),.\n\nregex (https://launchpad.net/ubuntu/+archive/primary/+files/python-regex_0.1.20170117.orig.tar.gz).",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence motif analysis",
                    "uri": "http://edamontology.org/operation_2404"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                }
            ]
        }
    ],
    "homepage": "https://github.com/dpchris/MLVA",
    "language": [
        "R",
        "Python"
    ],
    "lastUpdate": "2020-12-29T09:33:49Z",
    "name": "MLVAType",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0225848",
            "metadata": {
                "abstract": "© 2019 Ambroise et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Background Multiple-Locus Variable Number of Tandem Repeats (VNTR) Analysis (MLVA) is widely used by laboratory-based surveillance networks for subtyping pathogens causing foodborne and water-borne disease outbreaks. However, Whole Genome Sequencing (WGS) has recently emerged as the new more powerful reference for pathogen subtyping, making a data conversion method necessary which enables the users to compare the MLVA identified by either method. The MLVAType shiny application was designed to extract MLVA profiles of Vibrio cholerae isolates from WGS data while ensuring backward compatibility with traditional MLVA typing methods. Methods To test and validate the MLVAType algorithm, WGS-derived MLVA profiles of nineteen Vibrio cholerae isolates from Democratic Republic of the Congo (n = 9) and Uganda (n = 10) were compared to MLVA profiles generated by an in silico PCR approach and Sanger sequencing, the latter being used as the reference method. Results Results obtained by Sanger sequencing and MLVAType were totally concordant. However, the latter were affected by censored estimations whose percentage was inversely proportional to the k-mer parameter used during genome assembly. With a k-mer of 127, less than 15% estimation of V. cholerae VNTR was censored. Preventing censored estimation was only achievable when using a longer k-mer size (i.e. 175), which is not proposed in the SPAdes v.3.13.0 software. Conclusion As NGS read lengths and qualities tend to increase with time, one may expect the increase of k-mer size in a near future. Using MLVAType application with a longer k-mer size will then efficiently retrieve MLVA profiles from WGS data while avoiding censored estimation.",
                "authors": [
                    {
                        "name": "Ambroise J."
                    },
                    {
                        "name": "Irenge L.M."
                    },
                    {
                        "name": "Durant J.-F."
                    },
                    {
                        "name": "Bearzatto B."
                    },
                    {
                        "name": "Bwire G."
                    },
                    {
                        "name": "Colin Stine O."
                    },
                    {
                        "name": "Gala J.-L."
                    }
                ],
                "citationCount": 2,
                "date": "2019-12-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Backward compatibility of whole genome sequencing data with MLVA typing using a new MLVAtype shiny application for Vibrio cholerae"
            },
            "pmcid": "PMC6905556",
            "pmid": "31825986"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "PCR experiment",
            "uri": "http://edamontology.org/topic_3519"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        }
    ],
    "validated": 1
}