{
    "additionDate": "2020-01-09T18:08:20Z",
    "biotoolsCURIE": "biotools:DistAA",
    "biotoolsID": "DistAA",
    "confidence_flag": "medium",
    "description": "Database of amino acid distances in proteins and web application for statistical review of distances.\n\nThree-dimensional structure of a protein chain is determined by its amino acid interactions. One approach to the analysis of amino acid interactions refers to geometric distances of amino acid pairs in polypeptide chains. For a detailed analysis of the amino acid distances, the database with three types of amino acid distances in a set of chains was created. Web application Distances of Amino Acids has also been developed to enable scientists to explore interactions of amino acids with different properties based on distances stored in the database. Web application calculates and displays descriptive statistics and graphs of amino acid pair distances with selected properties, such as geometric distance threshold, corresponding SCOP class of proteins and secondary structure types.\n\n||| HOMEPAGE MISSING!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'aadis_dynamic', 'distances'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein secondary structure comparison",
                    "uri": "http://edamontology.org/operation_2488"
                },
                {
                    "term": "Residue contact prediction",
                    "uri": "http://edamontology.org/operation_0272"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31593887",
    "lastUpdate": "2020-01-09T18:08:20Z",
    "name": "DistAA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.COMPBIOLCHEM.2019.107130",
            "metadata": {
                "abstract": "© 2019 Elsevier LtdThree-dimensional structure of a protein chain is determined by its amino acid interactions. One approach to the analysis of amino acid interactions refers to geometric distances of amino acid pairs in polypeptide chains. For a detailed analysis of the amino acid distances, the database with three types of amino acid distances in a set of chains was created. Web application Distances of Amino Acids has also been developed to enable scientists to explore interactions of amino acids with different properties based on distances stored in the database. Web application calculates and displays descriptive statistics and graphs of amino acid pair distances with selected properties, such as geometric distance threshold, corresponding SCOP class of proteins and secondary structure types. In addition to the analysis of pre-calculated distances stored in the database, the amino acid distances of a single protein with the specified PDB identifier can also be analyzed. The web application is available at http://andromeda.matf.bg.ac.rs/aadis_dynamic/.",
                "authors": [
                    {
                        "name": "Maljkovic M.M."
                    }
                ],
                "date": "2019-12-01T00:00:00Z",
                "journal": "Computational Biology and Chemistry",
                "title": "DistAA: Database of amino acid distances in proteins and web application for statistical review of distances"
            },
            "pmid": "31593887"
        }
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ]
}