{
    "additionDate": "2022-10-04T09:12:14.063169Z",
    "biotoolsCURIE": "biotools:ednassay",
    "biotoolsID": "ednassay",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "John A. Kronenberger"
        },
        {
            "name": "Michael K. Schwartz"
        }
    ],
    "description": "A machine learning tool that accurately predicts qPCR cross-amplification.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://NationalGenomicsCenter.shinyapps.io/eDNAssay",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-10-04T09:12:14.065845Z",
    "license": "Not licensed",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/NationalGenomicsCenter/eDNAssay"
        }
    ],
    "name": "eDNAssay",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1111/1755-0998.13681",
            "metadata": {
                "abstract": "Published 2022. This article is a U.S. Government work and is in the public domain in the USA.Environmental DNA (eDNA) sampling is a highly sensitive and cost-effective technique for wildlife monitoring, notably through the use of qPCR assays. However, it can be difficult to ensure assay specificity when many closely related species co-occur. In theory, specificity may be assessed in silico by determining whether assay oligonucleotides have enough base-pair mismatches with nontarget sequences to preclude amplification. However, the mismatch qualities required are poorly understood, making in silico assessments difficult and often necessitating extensive in vitro testing—typically the greatest bottleneck in assay development. Increasing the accuracy of in silico assessments would therefore streamline the assay development process. In this study, we paired 10 qPCR assays with 82 synthetic gene fragments for 530 specificity tests using SYBR Green intercalating dye (n = 262) and TaqMan hydrolysis probes (n = 268). Test results were used to train random forest classifiers to predict amplification. The primer-only model (SYBR Green results) and full-assay model (TaqMan probe-based results) were 99.6% and 100% accurate, respectively, in cross-validation. We further assessed model performance using six independent assays not used in model training. In these tests the primer-only model was 92.4% accurate (n = 119) and the full-assay model was 96.5% accurate (n = 144). The high performance achieved by these models makes it possible for eDNA practitioners to more quickly and confidently develop assays specific to the intended target. Practitioners can access the full-assay model online via eDNAssay (https://NationalGenomicsCenter.shinyapps.io/eDNAssay), a user-friendly tool for predicting qPCR cross-amplification.",
                "authors": [
                    {
                        "name": "Franklin T.W."
                    },
                    {
                        "name": "Kronenberger J.A."
                    },
                    {
                        "name": "Mason D.H."
                    },
                    {
                        "name": "McKelvey K.S."
                    },
                    {
                        "name": "Schwartz M.K."
                    },
                    {
                        "name": "Wilcox T.M."
                    },
                    {
                        "name": "Young M.K."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Molecular Ecology Resources",
                "title": "eDNAssay: A machine learning tool that accurately predicts qPCR cross-amplification"
            },
            "pmid": "35778862"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        }
    ],
    "validated": 1
}
