{
    "additionDate": "2017-12-18T00:10:14Z",
    "biotoolsCURIE": "biotools:pdzpepint",
    "biotoolsID": "pdzpepint",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.bioinf.uni-freiburg.de//?en"
        }
    ],
    "description": "It is a cluster based prediction tool to predict binding peptides of PDZ domains in human, mouse, fly and worm. Peptides are represented as 5 C-terminal sequences of binding proteins. Depending on the user requirement Gene Ontology database can be used for getting reliable interactions. Additionally, it will also consider the C-terminal peptides that are intrinsically unstructured for getting high confidence interactions.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://modpepint.informatik.uni-freiburg.de/Help.jsp?toolName=PDZPepInt"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "homepage": "http://modpepint.informatik.uni-freiburg.de/PDZPepInt/Input.jsp",
    "lastUpdate": "2018-12-10T12:58:59Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/pdzpepint-1-0-0-pdz-peptide-interaction-prediction.html"
        }
    ],
    "name": "PDZPepInt",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2164-15-S1-S5",
            "metadata": {
                "abstract": "© 2014 Kundu and Backofen.Background: PDZ domains are one of the most promiscuous protein recognition modules that bind with short linear peptides and play an important role in cellular signaling. Recently, few high-throughput techniques (e.g. protein microarray screen, phage display) have been applied to determine in-vitro binding specificity of PDZ domains. Currently, many computational methods are available to predict PDZ-peptide interactions but they often provide domain specific models and/or have a limited domain coverage. Results: Here, we composed the largest set of PDZ domains derived from human, mouse, fly and worm proteomes and defined binding models for PDZ domain families to improve the domain coverage and prediction specificity. For that purpose, we first identified a novel set of 138 PDZ families, comprising of 548 PDZ domains from aforementioned organisms, based on efficient clustering according to their sequence identity. For 43 PDZ families, covering 226 PDZ domains with available interaction data, we built specialized models using a support vector machine approach. The advantage of family-wise models is that they can also be used to determine the binding specificity of a newly characterized PDZ domain with sufficient sequence identity to the known families. Since most current experimental approaches provide only positive data, we have to cope with the class imbalance problem. Thus, to enrich the negative class, we introduced a powerful semi-supervised technique to generate high confidence non-interaction data. We report competitive predictive performance with respect to state-of-the-art approaches. Conclusions: Our approach has several contributions. First, we show that domain coverage can be increased by applying accurate clustering technique. Second, we developed an approach based on a semi-supervised strategy to get high confidence negative data. Third, we allowed high order correlations between the amino acid positions in the binding peptides. Fourth, our method is general enough and will easily be applicable to other peptide recognition modules such as SH2 domains and finally, we performed a genome-wide prediction for 101 human and 102 mouse PDZ domains and uncovered novel interactions with biological relevance. We make all the predictive models and genome-wide predictions freely available to the scientific community.",
                "authors": [
                    {
                        "name": "Backofen R."
                    },
                    {
                        "name": "Kundu K."
                    }
                ],
                "citationCount": 13,
                "date": "2014-01-24T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Cluster based prediction of PDZ-peptide interactions"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Interactions",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Peptides",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Sequences",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1,
    "version": [
        "1.0.0"
    ]
}
