{
    "additionDate": "2017-08-03T19:02:49Z",
    "biotoolsCURIE": "biotools:tipr",
    "biotoolsID": "tipr",
    "credit": [
        {
            "email": "megrawm@science.oregonstate.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://megraw.cgrb.oregonstate.edu/"
        }
    ],
    "description": "A sequence-based machine learning model that identifies TSSs with high accuracy and resolution for multiple spatial distribution patterns along the genome, including broadly distributed TSS patterns that have previously been difficult to characterize.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://megraw.cgrb.oregonstate.edu/sites/default/files/files/TIPR_Supplementary_Materials.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Transcriptional regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0438"
                }
            ]
        }
    ],
    "homepage": "http://megraw.cgrb.oregonstate.edu/software/TIPR/",
    "language": [
        "Perl",
        "Python",
        "Shell"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/tipr-transcription-initiation-pattern-recognition-on-a-genome-scale.html"
        }
    ],
    "name": "TIPR",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© The Author 2015. Published by Oxford University Press. All rights reserved.Motivation: The computational identification of gene transcription start sites (TSSs) can provide insights into the regulation and function of genes without performing expensive experiments, particularly in organisms with incomplete annotations. High-resolution general-purpose TSS prediction remains a challenging problem, with little recent progress on the identification and differentiation of TSSs which are arranged in different spatial patterns along the chromosome. Results: In this work, we present the Transcription Initiation Pattern Recognizer (TIPR), a sequence-based machine learning model that identifies TSSs with high accuracy and resolution for multiple spatial distribution patterns along the genome, including broadly distributed TSS patterns that have previously been difficult to characterize. TIPR predicts not only the locations of TSSs but also the expected spatial initiation pattern each TSS will form along the chromosome - a novel capability for TSS prediction algorithms. As spatial initiation patterns are associated with spatiotemporal expression patterns and gene function, this capability has the potential to improve gene annotations and our understanding of the regulation of transcription initiation. The high nucleotide resolution of this model locates TSSs within 10 nucleotides or less on average.",
                "authors": [
                    {
                        "name": "Megraw M."
                    },
                    {
                        "name": "Morton T."
                    },
                    {
                        "name": "Wong W.-K."
                    }
                ],
                "citationCount": 2,
                "date": "2015-06-18T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "TIPR: Transcription initiation pattern recognition on a genome scale"
            },
            "pmid": "26254489"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
