{
    "additionDate": "2017-08-03T19:02:37Z",
    "biotoolsCURIE": "biotools:teak",
    "biotoolsID": "teak",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.cs.wayne.edu/dzhu"
        }
    ],
    "description": "An open source GUI software consisting of two modules: Topology Enrichment Analysis frameworK  and Query Structure Enrichment Analysis. TEAK is used to find biologically activated KEGG subpathways given molecular profiling data whereas QSEA is used to perform hierarchical querying of the KEGG pathways.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://code.google.com/archive/p/teak/"
        }
    ],
    "editPermission": {
        "authors": [
            "tntiniak"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                }
            ]
        }
    ],
    "homepage": "https://code.google.com/p/teak/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2022-08-01T18:40:36.881878Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/teak-20130207-topology-enrichment-analysis-framework.html"
        }
    ],
    "name": "TEAK",
    "operatingSystem": [
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "To mine gene expression data sets effectively, analysis frameworks need to incorporate methods that identify intergenic relationships within enriched biologically relevant subpathways. For this purpose, we developed the Topology Enrichment Analysis frameworK (TEAK). TEAK employs a novel inhouse algorithm and a tailor-made CliquePercolation Method to extract linear and nonlinear KEGG subpathways, respectively. TEAK scores subpathways using the Bayesian Information Criterion for context specific data and the Kullback-Leibler divergence for case-control data. In this article, we utilized TEAK with experimental studies to analyze microarray data sets profiling stress responses in the model eukaryote Saccharomyces cerevisiae. Using a public microarray data set, we identified via TEAK linear sphingolipid metabolic subpathways activated during the yeast response to nitrogen stress, and phenotypic analyses of the corresponding deletion strains indicated previously unreported fitness defects for the dpl1D and lag1D mutants under conditions of nitrogen limitation. In addition, we studied the yeast filamentous response to nitrogen stress by profiling changes in transcript levels upon deletion of two key filamentous growth transcription factors, FLO8 and MSS11. Via TEAK we identified a nonlinear glycerophospholipid metabolism subpathway involving the SLC1 gene, which we found via mutational analysis to be required for yeast filamentous growth. © 2012 The Author(s) 2012. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Johnson C."
                    },
                    {
                        "name": "Judeh T."
                    },
                    {
                        "name": "Kumar A."
                    },
                    {
                        "name": "Zhu D."
                    }
                ],
                "citationCount": 35,
                "date": "2013-02-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "TEAK: Topology Enrichment Analysis frameworK for detecting activated biological subpathways"
            },
            "pmid": "23268448"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        }
    ],
    "validated": 1
}
