{
    "accessibility": "Open access",
    "additionDate": "2023-01-25T21:09:35.972808Z",
    "biotoolsCURIE": "biotools:syblars",
    "biotoolsID": "syblars",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ivisatbilkent@gmail.com",
            "name": "Ugur Dogrusoz",
            "orcidid": "https://orcid.org/0000-0002-7153-0784",
            "typeEntity": "Person"
        },
        {
            "name": "Perman Atayev"
        },
        {
            "name": "Yusuf Ziya Ozgul"
        },
        {
            "name": "Hasan Balci",
            "orcidid": "https://orcid.org/0000-0001-8319-7758"
        }
    ],
    "description": "A web service for laying out, rendering and mining biological maps in SBGN, SBML and more.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                },
                {
                    "term": "Pathway analysis",
                    "uri": "http://edamontology.org/operation_3928"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://syblars.cs.bilkent.edu.tr",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2024-11-24T15:09:38.038317Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/iVis-at-Bilkent/syblars"
        }
    ],
    "name": "SyBLaRS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1371/journal.pcbi.1010635",
            "metadata": {
                "abstract": "Visualization is a key recurring requirement for effective analysis of relational data. Biology is no exception. It is imperative to annotate and render biological models in standard, widely accepted formats. Finding graph-theoretical properties of pathways as well as identifying certain paths or subgraphs of interest in a pathway are also essential for effective analysis of pathway data. Given the size of available biological pathway data nowadays, automatic layout is crucial in understanding the graphical representations of such data. Even though there are many available software tools that support graphical display of biological pathways in various formats, there is none available as a service for on-demand or batch processing of biological pathways for automatic layout, customized rendering and mining paths or subgraphs of interest. In addition, there are many tools with fine rendering capabilities lacking decent automatic layout support. To fill this void, we developed a web service named SyBLaRS (Systems Biology Layout and Rendering Service) for automatic layout of biological data in various standard formats as well as construction of customized images in both raster image and scalable vector formats of these maps. Some of the supported standards are more generic such as GraphML and JSON, whereas others are specialized to biology such as SBGNML (The Systems Biology Graphical Notation Markup Language) and SBML (The Systems Biology Markup Language). In addition, SyBLaRS supports calculation and highlighting of a number of wellknown graph-theoretical properties as well as some novel graph algorithms turning a specified set of objects of interest to a minimal pathway of interest. We demonstrate that SyBLaRS can be used both as an offline layout and rendering service to construct customized and annotated pictures of pathway models and as an online service to provide layout and rendering capabilities for systems biology software tools. SyBLaRS is open source and publicly available on GitHub and freely distributed under the MIT license. In addition, a sample deployment is available here for public consumption.",
                "authors": [
                    {
                        "name": "Atayev P."
                    },
                    {
                        "name": "Balci H."
                    },
                    {
                        "name": "Dogrusoz U."
                    },
                    {
                        "name": "Ozgul Y.Z."
                    }
                ],
                "date": "2022-11-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "SyBLaRS: A web service for laying out, rendering and mining biological maps in SBGN, SBML and more"
            },
            "pmcid": "PMC9704760",
            "pmid": "36374853"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        }
    ],
    "validated": 1
}
