{
    "additionDate": "2020-01-14T19:57:19Z",
    "biotoolsCURIE": "biotools:CycloNovo",
    "biotoolsID": "CycloNovo",
    "confidence_flag": "tool",
    "description": "De Novo Peptide Sequencing Reveals Many Cyclopeptides in the Human Gut and Other Environments.\n\nCycloNovo: Algorithm for de novo cyclopeptide analysis of high-resolution tandem mass spectra.\n\nCycloNovo is a new algorithm that identifies spectra generated from cyclopeptides in large mass spectrometry datasets. CycloNovo can also de novo sequence the cyclopeptides represented by identified cyclospectra",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Spectrum calculation",
                    "uri": "http://edamontology.org/operation_3860"
                },
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "de Novo sequencing",
                    "uri": "http://edamontology.org/operation_3644"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bbehsaz/cyclonovo",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-17T11:54:45Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/bbehsaz/cyclonovo/issues"
        }
    ],
    "name": "CycloNovo",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.CELS.2019.11.007",
            "metadata": {
                "abstract": "© 2019Cyclic and branch cyclic peptides (cyclopeptides) represent a class of bioactive natural products that include many antibiotics and anti-tumor compounds. Despite the recent advances in metabolomics analysis, still little is known about the cyclopeptides in the human gut and their possible interactions due to a lack of computational analysis pipelines that are applicable to such compounds. Here, we introduce CycloNovo, an algorithm for automated de novo cyclopeptide analysis and sequencing that employs de Bruijn graphs, the workhorse of DNA sequencing algorithms, to identify cyclopeptides in spectral datasets. CycloNovo reconstructed 32 previously unreported cyclopeptides (to the best of our knowledge) in the human gut and reported over a hundred cyclopeptides in other environments represented by various spectra on Global Natural Products Social Molecular Network (GNPS). https://github.com/bbehsaz/cyclonovo We present a computational pipeline for automated analysis and discovery of cyclic and branch cyclic peptides (cyclopeptides). Cyclopeptides represent an important class of bioactive natural products that includes many antibiotics and anti-tumor compounds. Our CycloNovo algorithm for de novo cyclopeptide sequencing of spectral datasets reconstructed many previously unreported cyclopeptides (to the best of our knowledge) that were validated with matching transcriptomics and genome or metagenome mining. CycloNovo revealed several cyclopeptides from food that survived the complete human gastrointestinal tract, raising the question of how these compounds might affect the human microbiome.",
                "authors": [
                    {
                        "name": "Behsaz B."
                    },
                    {
                        "name": "Mohimani H."
                    },
                    {
                        "name": "Gurevich A."
                    },
                    {
                        "name": "Prjibelski A."
                    },
                    {
                        "name": "Fisher M."
                    },
                    {
                        "name": "Vargas F."
                    },
                    {
                        "name": "Smarr L."
                    },
                    {
                        "name": "Dorrestein P.C."
                    },
                    {
                        "name": "Mylne J.S."
                    },
                    {
                        "name": "Pevzner P.A."
                    }
                ],
                "citationCount": 10,
                "date": "2020-01-22T00:00:00Z",
                "journal": "Cell Systems",
                "title": "De Novo Peptide Sequencing Reveals Many Cyclopeptides in the Human Gut and Other Environments"
            },
            "pmid": "31864964"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}