{
    "additionDate": "2017-05-16T12:28:29Z",
    "biotoolsCURIE": "biotools:cad-score",
    "biotoolsID": "cad-score",
    "credit": [
        {
            "email": "office@bti.vu.lt",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.ibt.lt/en/laboratories/bioinfo_en.html"
        }
    ],
    "description": "New evaluation function quantifying differences between physical contacts in a model and the reference structure.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://bitbucket.org/kliment/cadscore/wiki/Home"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Comparison",
                    "uri": "http://edamontology.org/operation_2424"
                }
            ]
        }
    ],
    "homepage": "http://bioinformatics.lt/software/cad-score",
    "lastUpdate": "2021-02-06T21:07:11Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/cad-score-20121208-evaluation-protein-structural-models-reference-structure.html"
        }
    ],
    "name": "CAD-score",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": "10.1002/prot.24172",
            "metadata": {
                "abstract": "Evaluation of protein models against the native structure is essential for the development and benchmarking of protein structure prediction methods. Although a number of evaluation scores have been proposed to date, many aspects of model assessment still lack desired robustness. In this study we present CAD-score, a new evaluation function quantifying differences between physical contacts in a model and the reference structure. The new score uses the concept of residue-residue contact area difference (CAD) introduced by Abagyan and Totrov (J Mol Biol 1997; 268:678-685). Contact areas, the underlying basis of the score, are derived using the Voronoi tessellation of protein structure. The newly introduced CAD-score is a continuous function, confined within fixed limits, free of any arbitrary thresholds or parameters. The built-in logic for treatment of missing residues allows consistent ranking of models of any degree of completeness. We tested CAD-score on a large set of diverse models and compared it to GDT-TS, a widely accepted measure of model accuracy. Similarly to GDT-TS, CAD-score showed a robust performance on single-domain proteins, but displayed a stronger preference for physically more realistic models. Unlike GDT-TS, the new score revealed a balanced assessment of domain rearrangement, removing the necessity for different treatment of single-domain, multi-domain, and multi-subunit structures. Moreover, CAD-score makes it possible to assess the accuracy of inter-domain or inter-subunit interfaces directly. In addition, the approach offers an alternative to the superposition-based model clustering. The CAD-score implementation is available both as a web server and a standalone software package at http://www.ibt.lt/bioinformatics/cad-score/. Proteins 2013. © 2012 Wiley Periodicals, Inc.",
                "authors": [
                    {
                        "name": "Olechnovic K."
                    },
                    {
                        "name": "Kulberkyte E."
                    },
                    {
                        "name": "Venclovas C."
                    }
                ],
                "citationCount": 68,
                "date": "2013-01-01T00:00:00Z",
                "journal": "Proteins: Structure, Function and Bioinformatics",
                "title": "CAD-score: A new contact area difference-based function for evaluation of protein structural models"
            },
            "pmid": "22933340"
        },
        {
            "doi": "10.1007/978-1-0716-0270-6_6",
            "metadata": {
                "abstract": "© 2020, Springer Science+Business Media, LLC, part of Springer Nature.Quantifying discrepancies between computationally derived and native (reference) structures is an essential step in the development and comparison of protein modeling and protein-protein docking methods. Measuring conformational differences of proteins or protein complexes is also important in other areas of structural biology such as molecular dynamics and crystallography. There are multiple scores to do that. However, nearly all of them, whether superposition-based (e.g., RMSD) or superposition-free, use distances to measure similarity. CAD-score is conceptually different as it uses physical contacts represented as contact areas. Such representation makes it possible to quantify differences of both structures and surfaces (e.g., protein-protein interfaces and binding sites) using the same framework. A number of studies have found CAD-score to be among the most robust scores. The method is implemented both as a web server and as standalone software available at http://bioinformatics.lt/software/cad-score. Here, we describe how to use the standalone CAD-score software for comparison and analysis of protein structures, interfaces, and binding sites.",
                "authors": [
                    {
                        "name": "Olechnovic K."
                    },
                    {
                        "name": "Venclovas C."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Methods in Molecular Biology",
                "title": "Contact Area-Based Structural Analysis of Proteins and Their Complexes Using CAD-Score"
            },
            "pmid": "32006279"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Nucleic acid sites, features and motifs",
            "uri": "http://edamontology.org/topic_3511"
        },
        {
            "term": "Protein sites, features and motifs",
            "uri": "http://edamontology.org/topic_3510"
        }
    ],
    "validated": 1
}