{
    "accessibility": [],
    "additionDate": "2017-08-03T18:45:49Z",
    "biotoolsCURIE": "biotools:hapsim",
    "biotoolsID": "hapsim",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": null,
            "gridid": null,
            "name": "Bernard North",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.smd.qmul.ac.uk/statgen/bvnorth.html"
        }
    ],
    "description": "Program for generating case-control multi-locus genotype data under a specified disease model.",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "http://www.davecurtis.net/bvnorth/software.html"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Generation",
                    "uri": "http://edamontology.org/operation_3429"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://www.davecurtis.net/bvnorth/software.html",
    "homepage_status": 0,
    "language": [
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "license": null,
    "link": [
        {
            "note": null,
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/hapsim-produce-case-control-multilocus-genotype-data.html"
        }
    ],
    "maturity": null,
    "name": "HAPSIM",
    "operatingSystem": [
        "Linux"
    ],
    "otherID": [],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": null,
            "metadata": {
                "abstract": "Biallelic markers, such as single nucleotide polymorphisms (SNPs), provide greater information for localising disease loci when treated as multilocus haplotypes, but often haplotypes are not immediately available from multilocus genotypes in case-control studies. An artificial neural network allows investigation of association between disease phenotype and tightly linked markers without requiring haplotype phase and without modelling any evolutionary history for the disease-related haplotypes. The network assesses whether marker haplotypes differ between cases and controls to the extent that classification of disease status based on multi-marker genotypes is achievable. The network is \"trained\" to \"recognise\" affection status based on supplied marker genotypes, and then for each multi-marker genotype it produces outputs which aim to approximate the associated affection status. Next, the genotypes are permuted relative to affection status to produce many random datasets and the process of training and recording of outputs is repeated. The extent to which the ability to predict affection for the real dataset exceeds that for the random datasets measures the statistical significance of the association between multi-marker genotype and affection. This permutation test performs well with simulated case-control datasets, particularly when major gene effects are present. We have explored the effects of systematically varying different network parameters in order to identify their optimal values. We have applied the permutation test to 4 SNPs of the calpain 10 (CAPN10) gene typed in a case-control sample of subjects with type 2 diabetes, impaired glucose tolerance, and controls. We show that the neural network produces more highly significant evidence for association than do single marker tests corrected for the number of markers genotyped. The use of a permutation test could potentially allow conditional analyses which could incorporate known risk factors alongside marker genotypes. Permuting only the marker genotypes relative to affection status and these risk factors would allow the contribution of the markers to disease risk to be independently assessed. © University College London 2003.",
                "authors": [
                    {
                        "name": "North B.V."
                    },
                    {
                        "name": "Curtis D."
                    },
                    {
                        "name": "Cassell P.G."
                    },
                    {
                        "name": "Hitman G.A."
                    },
                    {
                        "name": "Sham P.C."
                    }
                ],
                "citationCount": 35,
                "date": "2003-07-01T00:00:00Z",
                "journal": "Annals of Human Genetics",
                "title": "Assessing optimal neural network architecture for identifying disease-associated multi-marker genotypes using a permutation test, and application to calpain 10 polymorphisms associated with diabetes"
            },
            "note": null,
            "pmcid": null,
            "pmid": "12914569",
            "type": null,
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ],
    "validated": 1,
    "version": []
}