{
    "additionDate": "2021-01-18T11:10:36Z",
    "biotoolsCURIE": "biotools:tcrdb",
    "biotoolsID": "tcrdb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "leiqian@hust.edu.cn",
            "name": "Qian Lei",
            "typeEntity": "Person"
        },
        {
            "email": "guoay@hust.edu.cn",
            "name": "An-Yuan Guo",
            "typeEntity": "Person"
        }
    ],
    "description": "TCRdb: A comprehensive database of T-cell receptor sequences in various conditions.\n\nTCRdb contains more than 277 million highly reliable TCR sequences from over 8265 TCR-Seq samples across hundreds of tissues/clinical conditions/cell types. The unique features of TCRdb include:.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.life.hust.edu.cn/TCRdb/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-26T17:50:58Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/GuoBioinfoLab/TCRdb"
        }
    ],
    "name": "TCRdb",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA796",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research. This is an Open Access article distributed under the terms of the Creative Commons Attribution Non-Commercial License (http://creativecommons.org/licenses/by-nc/4.0/), which permits non-commercial re-use, distribution, and reproduction in any medium, provided the original work is properly cited.T cells and the T-cell receptor (TCR) repertoire play pivotal roles in immune response and immunotherapy. TCR sequencing (TCR-Seq) technology has enabled accurate profiling TCR repertoire and currently a large number of TCR-Seq data are available in public. Based on the urgent need to effectively reuse these data, we developed TCRdb, a comprehensive human TCR sequences database, by a uniform pipeline to characterize TCR sequences on TCR-Seq data. TCRdb contains more than 277 million highly reliable TCR sequences from over 8265 TCR-Seq samples across hundreds of tissues/clinical conditions/cell types. The unique features of TCRdb include: (i) comprehensive and reliable sequences for TCR repertoire in different samples generated by a strict and uniform pipeline of TCRdb; (ii) powerful search function, allowing users to identify their interested TCR sequences in different conditions; (iii) categorized sample metadata, enabling comparison of TCRs in different sample types; (iv) interactive data visualization charts, describing the TCR repertoire in TCR diversity, length distribution and V-J gene utilization. The TCRdb database is freely available at http://bioinfo.life.hust.edu.cn/TCRdb/ and will be a useful resource in the research and application community of T cell immunology.",
                "authors": [
                    {
                        "name": "Chen S.-Y."
                    },
                    {
                        "name": "Yue T."
                    },
                    {
                        "name": "Lei Q."
                    },
                    {
                        "name": "Guo A.-Y."
                    }
                ],
                "citationCount": 1,
                "date": "2021-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "TCRdb: A comprehensive database for T-cell receptor sequences with powerful search function"
            },
            "pmid": "32990749"
        }
    ],
    "topic": [
        {
            "term": "Immunology",
            "uri": "http://edamontology.org/topic_0804"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        }
    ]
}