{
    "additionDate": "2018-08-03T14:50:20Z",
    "biotoolsCURIE": "biotools:clonocalc",
    "biotoolsID": "clonocalc",
    "credit": [
        {
            "email": "faehnrich@anat.uni-luebeck.de",
            "name": "Anke Fähnrich",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "GUI for the sub-tasks of processing raw NGS data by wrapping available implementations of various algorithms.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://bitbucket.org/ClonoSuite/clonocalc-plot"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "homepage": "https://bitbucket.org/ClonoSuite/clonocalc-plot",
    "language": [
        "R",
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "license": "GPL-3.0",
    "name": "ClonoCalc",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s12859-017-1575-2",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: Next generation sequencing (NGS) technologies enable studies and analyses of the diversity of both T and B cell receptors (TCR and BCR) in human and animal systems to elucidate immune functions in health and disease. Over the last few years, several algorithms and tools have been developed to support respective analyses of raw sequencing data of the immune repertoire. These tools focus on distinct aspects of the data processing and require a strong bioinformatics background. To facilitate the analysis of T and B cell repertoires by less experienced users, software is needed that combines the most common tools for repertoire analysis. Results: We introduce a graphical user interface (GUI) providing a complete analysis pipeline for processing raw NGS data for human and animal TCR and BCR clonotype determination and advanced differential repertoire studies. It provides two applications. ClonoCalc prepares the raw data for downstream analyses. It combines a demultiplexer for barcode splitting and employs MiXCR for paired-end read merging and the extraction of human and animal TCR/BCR sequences. ClonoPlot wraps the R package tcR and further contributes self-developed plots for the descriptive comparative investigation of immune repertoires. Conclusion: This workflow reduces the amount of programming required to perform the respective analyses and supports both communication and training between scientists and technicians, and across scientific disciplines. The Open Source development in Java and R is modular and invites advanced users to extend its functionality. Software and documentation are freely available at https://bitbucket.org/ClonoSuite/clonocalc-plot.",
                "authors": [
                    {
                        "name": "Fahnrich A."
                    },
                    {
                        "name": "Krebbel M."
                    },
                    {
                        "name": "Decker N."
                    },
                    {
                        "name": "Leucker M."
                    },
                    {
                        "name": "Lange F.D."
                    },
                    {
                        "name": "Kalies K."
                    },
                    {
                        "name": "Moller S."
                    }
                ],
                "citationCount": 11,
                "date": "2017-03-11T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "ClonoCalc and ClonoPlot: Immune repertoire analysis from raw files to publication figures with graphical user interface"
            },
            "pmcid": "PMC5346239",
            "pmid": "28284194"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "NGS",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        },
        {
            "term": "Immunology",
            "uri": "http://edamontology.org/topic_0804"
        }
    ],
    "validated": 1
}