{
    "additionDate": "2021-01-18T08:06:31Z",
    "biotoolsCURIE": "biotools:ftmsranalysis",
    "biotoolsID": "ftmsranalysis",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "lisa.bramer@pnnl.gov",
            "name": "Lisa M. Bramer",
            "orcidid": "https://orcid.org/0000-0002-8384-1926",
            "typeEntity": "Person"
        }
    ],
    "description": "ftmsRanalysis is an R package for exploratory data analysis and interactive visualization of FT-MS data. This R package provides functionality for data formatting, preprocessing, filtering, exploratory data analysis and visualization of fourier transform (FT) mass spectrometry (MS) data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Peak detection",
                    "uri": "http://edamontology.org/operation_3215"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://github.com/EMSL-Computing/ftmsRanalysis",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-11T13:01:22Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://emsl-computing.github.io/ftmsRanalysis/"
        }
    ],
    "name": "ftmsRanalysis",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1007654",
            "metadata": {
                "abstract": "© 2020 Bramer et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.The high-resolution and mass accuracy of Fourier transform mass spectrometry (FT-MS) has made it an increasingly popular technique for discerning the composition of soil, plant and aquatic samples containing complex mixtures of proteins, carbohydrates, lipids, lignins, hydrocarbons, phytochemicals and other compounds. Thus, there is a growing demand for informatics tools to analyze FT-MS data that will aid investigators seeking to understand the availability of carbon compounds to biotic and abiotic oxidation and to compare fundamental chemical properties of complex samples across groups. We present ftmsRanalysis, an R package which provides an extensive collection of data formatting and processing, filtering, visualization, and sample and group comparison functionalities. The package provides a suite of plotting methods and enables expedient, flexible and interactive visualization of complex datasets through functions which link to a powerful and interactive visualization user interface, Trelliscope. Example analysis using FT-MS data from a soil microbiology study demonstrates the core functionality of the package and highlights the capabilities for producing interactive visualizations.",
                "authors": [
                    {
                        "name": "Bramer L.M."
                    },
                    {
                        "name": "Claborne D."
                    },
                    {
                        "name": "Hofmockel K."
                    },
                    {
                        "name": "McCue L.A."
                    },
                    {
                        "name": "Stratton K.G."
                    },
                    {
                        "name": "Thompson A.M."
                    },
                    {
                        "name": "White A.M."
                    }
                ],
                "citationCount": 5,
                "date": "2020-01-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "FtmsRanalysis: An R package for exploratory data analysis and interactive visualization of FT-MS data"
            },
            "pmcid": "PMC7098629",
            "pmid": "32176690"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Carbohydrates",
            "uri": "http://edamontology.org/topic_0152"
        },
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        },
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ]
}
