{
    "additionDate": "2017-01-17T15:01:19Z",
    "biotoolsCURIE": "biotools:brainstars",
    "biotoolsID": "brainstars",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "dritoshi@gmail.com",
            "name": "Itoshi NIKAIDO",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "This package can search and get gene expression data and plots from the BrainStars quantitative expression database of the adult mouse brain, which has genome-wide expression profile at 51 adult mouse CNS regions.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/BrainStars.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/BrainStars_1.18.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/BrainStars.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "license": "Artistic-2.0",
    "name": "BrainStars",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1097/HTR.0b013e3181a7ecb0",
            "metadata": {
                "abstract": "Objective: To conduct and evaluate an educational/consultation program for parents and teachers of children who have acquired brain injury (ABI). PARTICIPANTS: Parents, regular and special educators, and related school personnel of 30 students who had ABI and serious school problems. INTERVENTION: BrainSTARS (Brain Injury: Strategies for Teams and Re-education for Students), an individualized consultation program that includes a comprehensive manual on pediatric ABI. The intervention included 3 meetings in the school of the child identified with ABI. DESIGN: A pre/post single group design assessed the impact of BrainSTARS on ABI-related competencies in the adult participants as well as on measures of child behaviors. RESULTS: Significant improvement was shown in the participants' self-rated proficiency in working with children who have ABI as well as on their ratings of student performance in targeted neurodevelopmental areas. There was no significant change on standardized measures of child behavior (the Behavior Rating Inventory of Executive Functions and the Behavior Assessment System for Children). CONCLUSIONS: BrainSTARS appears to increase the competencies of parents and educators related to students who have ABI; further study of BrainSTARS' impact on student performance and capacity to produce long-standing results is called for. © 2009 Lippincott Williams & Wilkins, Inc.",
                "authors": [
                    {
                        "name": "Dise-Lewis J.E."
                    },
                    {
                        "name": "Lewis H.C."
                    },
                    {
                        "name": "Reichardt C.S."
                    }
                ],
                "citationCount": 15,
                "date": "2009-05-01T00:00:00Z",
                "journal": "Journal of Head Trauma Rehabilitation",
                "title": "BrainSTARS: Pilot data on a team-based intervention program for students who have acquired brain injury"
            },
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1,
    "version": [
        "1.18.0"
    ]
}