{
    "accessibility": "Open access",
    "additionDate": "2019-08-03T16:35:00Z",
    "biotoolsCURIE": "biotools:CellProfiler",
    "biotoolsID": "CellProfiler",
    "cost": "Free of charge",
    "description": "Tool for quantifying data from biological images, particularly in high-throughput experiments.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://cellprofiler-manual.s3.amazonaws.com/CellProfiler-3.1.8/index.html"
        }
    ],
    "download": [
        {
            "type": "Downloads page",
            "url": "https://cellprofiler.org/releases/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                }
            ]
        }
    ],
    "homepage": "https://cellprofiler.org/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-08-20T05:49:09.645152Z",
    "license": "BSD-3-Clause",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/CellProfiler/CellProfiler"
        }
    ],
    "maturity": "Mature",
    "name": "CellProfiler",
    "operatingSystem": [
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.2144/000112257",
            "metadata": {
                "abstract": "Careful visual examination of biological samples is quite powerful, but many visual analysis tasks done in the laboratory are repetitive, tedious, and subjective. Here we describe the use of the open-source software, CellProfiler™, to automatically identify and measure a variety of biological objects in images. The applications demonstrated here include yeast colony counting and classifying, cell microarray annotation, yeast patch assays, mouse tumor quantification, wound healing assays, and tissue topology measurement. The software automatically identifies objects in digital images, counts them, and records a full spectrum of measurements for each object, including location within the image, size, shape, color intensity, degree of correlation between colors, texture (smoothness), and number of neighbors. Small numbers of images can be processed automatically on a personal computer, and hundreds of thousands can be analyzed using a computing cluster. This free, easy-to-use software enables biologists to comprehensively and quantitatively address many questions that previously would have required custom programming, thereby facilitating discovery in a variety of biological fields of study.",
                "authors": [
                    {
                        "name": "Lamprecht M.R."
                    },
                    {
                        "name": "Sabatini D.M."
                    },
                    {
                        "name": "Carpenter A.E."
                    }
                ],
                "citationCount": 557,
                "date": "2007-01-01T00:00:00Z",
                "journal": "BioTechniques",
                "title": "CellProfiler™: Free, versatile software for automated biological image analysis"
            },
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1002/cpz1.89",
            "metadata": {
                "abstract": "© 2021 Wiley Periodicals LLCImageJ and CellProfiler have long been leading open-source platforms in the field of bioimage analysis. ImageJ's traditional strength is in single-image processing and investigation, while CellProfiler is designed for building large-scale, modular analysis pipelines. Although many image analysis problems can be well solved with one or the other, using these two platforms together in a single workflow can be powerful. Here, we share two pipelines demonstrating mechanisms for productively and conveniently integrating ImageJ and CellProfiler for (1) studying cell morphology and migration via tracking, and (2) advanced stitching techniques for handling large, tiled image sets to improve segmentation. No single platform can provide all the key and most efficient functionality needed for all studies. While both programs can be and are often used separately, these pipelines demonstrate the benefits of using them together for image analysis workflows. ImageJ and CellProfiler are both committed to interoperability between their platforms, with ongoing development to improve how both are leveraged from the other. © 2021 Wiley Periodicals LLC. Basic Protocol 1: Studying cell morphology and cell migration in time-lapse datasets using TrackMate (Fiji) and CellProfiler. Basic Protocol 2: Creating whole plate montages to easily assess adaptability of segmentation parameters.",
                "authors": [
                    {
                        "name": "Dobson E.T.A."
                    },
                    {
                        "name": "Cimini B."
                    },
                    {
                        "name": "Klemm A.H."
                    },
                    {
                        "name": "Wahlby C."
                    },
                    {
                        "name": "Carpenter A.E."
                    },
                    {
                        "name": "Eliceiri K.W."
                    }
                ],
                "date": "2021-05-01T00:00:00Z",
                "journal": "Current Protocols",
                "title": "ImageJ and CellProfiler: Complements in Open-Source Bioimage Analysis"
            }
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ],
    "validated": 1
}