{"credit":[],"documentation":[{"url":"http://cellprofiler-manual.s3.amazonaws.com/CellProfiler-3.1.8/index.html"}],"download":[{"type":"Downloads page","url":"https://cellprofiler.org/releases/"}],"function":[{"operation":[{"term":"Quantification","uri":"http://edamontology.org/operation_3799"},{"term":"Image analysis","uri":"http://edamontology.org/operation_3443"},{"term":"Parsing","uri":"http://edamontology.org/operation_1812"}]}],"labels":{"accessibility":["Open access"],"cost":"Free of charge","language":["Python"],"license":"BSD-3-Clause","maturity":"Mature","operatingSystem":["Windows","Mac"],"toolType":["Desktop application"],"topic":[{"term":"Imaging","uri":"http://edamontology.org/topic_3382"},{"term":"Microarray experiment","uri":"http://edamontology.org/topic_3518"},{"term":"Genotype and phenotype","uri":"http://edamontology.org/topic_0625"}]},"link":[{"type":"REPOSITORY","url":"https://github.com/CellProfiler/CellProfiler"}],"publication":[{"abstract":"Careful visual examination of biological samples is quite powerful, but many visual analysis tasks done in the laboratory are repetitive, tedious, and subjective. Here we describe the use of the open-source software, CellProfiler™, to automatically identify and measure a variety of biological objects in images. The applications demonstrated here include yeast colony counting and classifying, cell microarray annotation, yeast patch assays, mouse tumor quantification, wound healing assays, and tissue topology measurement. The software automatically identifies objects in digital images, counts them, and records a full spectrum of measurements for each object, including location within the image, size, shape, color intensity, degree of correlation between colors, texture (smoothness), and number of neighbors. Small numbers of images can be processed automatically on a personal computer, and hundreds of thousands can be analyzed using a computing cluster. This free, easy-to-use software enables biologists to comprehensively and quantitatively address many questions that previously would have required custom programming, thereby facilitating discovery in a variety of biological fields of study.","authors":["Lamprecht M.R.","Sabatini D.M.","Carpenter A.E."],"cit_count":419,"doi":"10.2144/000112257","journal":"BioTechniques","title":"CellProfiler™: Free, versatile software for automated biological image analysis","type":"Primary","year":"2007-01-01"}],"summary":{"biotoolsCURIE":"biotools:CellProfiler","biotoolsID":"CellProfiler","description":"Tool for quantifying data from biological images, particularly in high-throughput experiments.","homepage":"https://cellprofiler.org/","name":"CellProfiler"}}