{
    "additionDate": "2020-01-09T17:41:57Z",
    "biotoolsCURIE": "biotools:unfold-eeg",
    "biotoolsID": "unfold-eeg",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "behinger@uos.de",
            "name": "Benedikt V. Ehinger",
            "orcidid": "https://orcid.org/0000-0002-6276-3332",
            "typeEntity": "Person"
        },
        {
            "email": "olaf.dimigen@hu-berlin.de",
            "name": "Olaf Dimigen",
            "orcidid": "https://orcid.org/0000-0002-2507-2823",
            "typeEntity": "Person"
        }
    ],
    "description": "an integrated toolbox for overlap correction, non-linear modeling, and regression-based EEG analysis.\n\nA matlab EEG toolbox to perform overlap correction and non-linear & linear regression.\n\nEEG Deconvolution Toolbox — Unfold EEG Toolbox.\n\nUnfold - EEG Deconvolution Toolbox.\n\nA toolbox for deconvolution of overlapping EEG (Pupil, LFP etc.) signals and (non)-linear modeling.\n\nA toolbox for deconvolution of overlapping EEG signals and (non)-linear modeling.\n\ngit clone https://github.com/unfoldtoolbox/unfold.\n\nIf you use the toolbox, please cite us as: Ehinger BV & Dimigen O, Unfold: An integrated toolbox for overlap correction, non-linear modeling, and regression-based EEG analysis, bioRxiv, https://doi.org/10.1101/360156.\n\nModel specification using R-style formulas (EEG~1+face+age).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein globularity prediction",
                    "uri": "http://edamontology.org/operation_0408"
                },
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "http://www.unfoldtoolbox.org",
    "language": [
        "MATLAB",
        "Fortran"
    ],
    "lastUpdate": "2021-01-02T09:49:27Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/unfoldtoolbox/unfold"
        }
    ],
    "name": "unfold",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.7717/PEERJ.7838",
            "metadata": {
                "abstract": "© Copyright 2019 Ehinger and Dimigen.Electrophysiological research with event-related brain potentials (ERPs) is increasingly moving from simple, strictly orthogonal stimulation paradigms towards more complex, quasi-experimental designs and naturalistic situations that involve fast, multisensory stimulation and complex motor behavior. As a result, electrophysiological responses from subsequent events often overlap with each other. In addition, the recorded neural activity is typically modulated by numerous covariates, which influence the measured responses in a linear or non-linear fashion. Examples of paradigms where systematic temporal overlap variations and low-level confounds between conditions cannot be avoided include combined electroencephalogram (EEG)/eye-tracking experiments during natural vision, fast multisensory stimulation experiments, and mobile brain/body imaging studies. However, even “traditional,” highly controlled ERP datasets often contain a hidden mix of overlapping activity (e.g., from stimulus onsets, involuntary microsaccades, or button presses) and it is helpful or even necessary to disentangle these components for a correct interpretation of the results. In this paper, we introduce unfold, a powerful, yet easy-to-use MATLAB toolbox for regression-based EEG analyses that combines existing concepts of massive univariate modeling (“regression-ERPs”), linear deconvolution modeling, and non-linear modeling with the generalized additive model into one coherent and flexible analysis framework. The toolbox is modular, compatible with EEGLAB and can handle even large datasets efficiently. It also includes advanced options for regularization and the use of temporal basis functions (e.g., Fourier sets). We illustrate the advantages of this approach for simulated data as well as data from a standard face recognition experiment. In addition to traditional and non-conventional EEG/ERP designs, unfold can also be applied to other overlapping physiological signals, such as pupillary or electrodermal responses. It is available as open-source software at http://www.unfoldtoolbox.org.",
                "authors": [
                    {
                        "name": "Ehinger B.V."
                    },
                    {
                        "name": "Dimigen O."
                    }
                ],
                "citationCount": 15,
                "date": "2019-01-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "Unfold: An integrated toolbox for overlap correction, non-linear modeling, and regression-based EEG analysis"
            },
            "pmcid": "PMC6815663",
            "pmid": "31660265"
        }
    ],
    "topic": [
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        }
    ],
    "validated": 1
}