{
    "additionDate": "2019-11-14T20:06:46Z",
    "biotoolsCURIE": "biotools:marker-free",
    "biotoolsID": "marker-free",
    "confidence_flag": "low",
    "credit": [
        {
            "email": "mxu1@cs.cmu.edu",
            "name": "Min Xu",
            "typeEntity": "Person"
        },
        {
            "email": "xin.gao@kaust.edu.sa",
            "name": "Xin Gao",
            "typeEntity": "Person"
        }
    ],
    "description": "> LOW CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'landmarks', 'tilt', 'MOTIVATION:Electron', 'interrelationship' | A joint method for marker-free alignment of tilt series in electron tomography | This is an alpha version of the joint method for marker-free alignment. Currently, it may be not so robust and include third-part modules. The third-part modules will be removed in beta version | The files is build in fedora 25. To use the exe, please add the bin to the $PATH in the computer",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Read binning",
                    "uri": "http://edamontology.org/operation_3798"
                }
            ]
        }
    ],
    "homepage": "https://github.com/icthrm/joint-marker-free-alignment",
    "language": [
        "C++",
        "C"
    ],
    "lastUpdate": "2019-11-14T20:06:46Z",
    "name": "marker-free",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ323",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Motivation: Electron tomography (ET) is a widely used technology for 3D macro-molecular structure reconstruction. To obtain a satisfiable tomogram reconstruction, several key processes are involved, one of which is the calibration of projection parameters of the tilt series. Although fiducial marker-based alignment for tilt series has been well studied, marker-free alignment remains a challenge, which requires identifying and tracking the identical objects (landmarks) through different projections. However, the tracking of these landmarks is usually affected by the pixel density (intensity) change caused by the geometry difference in different views. The tracked landmarks will be used to determine the projection parameters. Meanwhile, different projection parameters will also affect the localization of landmarks. Currently, there is no alignment method that takes interrelationship between the projection parameters and the landmarks. Results: Here, we propose a novel, joint method for marker-free alignment of tilt series in ET, by utilizing the information underlying the interrelationship between the projection model and the landmarks. The proposed method is the first joint solution that combines the extrinsic (track-based) alignment and the intrinsic (intensity-based) alignment, in which the localization of landmarks and projection parameters keep refining each other until convergence. This iterative approach makes our solution robust to different initial parameters and extreme geometric changes, which ensures a better reconstruction for marker-free ET. Comprehensive experimental results on three real datasets show that our new method achieved a significant improvement in alignment accuracy and reconstruction quality, compared to the state-of-the-art methods.",
                "authors": [
                    {
                        "name": "Han R."
                    },
                    {
                        "name": "Bao Z."
                    },
                    {
                        "name": "Zeng X."
                    },
                    {
                        "name": "Niu T."
                    },
                    {
                        "name": "Zhang F."
                    },
                    {
                        "name": "Xu M."
                    },
                    {
                        "name": "Gao X."
                    }
                ],
                "citationCount": 4,
                "date": "2019-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "A joint method for marker-free alignment of tilt series in electron tomography"
            },
            "pmcid": "PMC6612841",
            "pmid": "31510669"
        }
    ],
    "topic": [
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ]
}