{
    "additionDate": "2017-08-03T19:00:06Z",
    "biotoolsCURIE": "biotools:snpidentifier",
    "biotoolsID": "snpidentifier",
    "credit": [
        {
            "email": "zhu@iastate.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.animalgenome.org/bioinfo/community/team.html"
        }
    ],
    "description": "Predicts the location of SNPs from clusters of ESTs produced by the program CAP3. It is designed for ESTs without accompanying chromatogram sequence quality information, and therefore it performs quality control checks on all data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://www.animalgenome.org/tools/share/SNPidentifier/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                }
            ]
        }
    ],
    "homepage": "http://www.animalgenome.org/tools/share/SNPidentifier/",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/snpidentifier-1-10-discover-snps-based-cap3-alignments.html"
        }
    ],
    "name": "SNPidentifier",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Litopenaeus vannamei (Pacific white shrimp) have been farmed in the Americas for many years and are growing in popularity in Asia with the development of specific pathogen-free stocks. The full genomic sequence of this species might not be available in the near future, so other tools are needed to discover the location of polymorphic sites for quantitative trait loci mapping, association studies and subsequent marker-assisted selection. Currently, 25 937 L. vannamei expressed sequence tags (ESTs) are publicly available. These sequences were manually screened, masked for tandem repeats and inputted into CAP3 for clustering. The resulting 3532 contigs were analysed for possible single nucleotide polymorphisms (SNPs) with snpidentifier, a newly developed computer program for predicting SNPs. snpidentifier is designed for ESTs without accompanying chromatogram sequence quality information, and therefore it performs quality control checks on all data. snpidentifier sets a threshold such that the sequences used have a poor quality nucleotide (N) frequency <0.1, and it trims off the first 10 bases of every sequence to ensure higher sequence quality. For a base to be predicted as an SNP, the minor nucleotide (allele) frequency must be >0.1, it must be observed at least four times and the 15 bases on either side must exactly match the consensus sequence. Using these conservative parameters, 504 SNPs were predicted from 141 contigs for L. vannamei. A small sample of 18 individuals from three lines have been sequenced to verify prediction results and 17 of 39 (44%) of the tested SNPs have been confirmed. © 2008 The Authors.",
                "authors": [
                    {
                        "name": "Gorbach D.M."
                    },
                    {
                        "name": "Hu Z.-L."
                    },
                    {
                        "name": "Du Z.-Q."
                    },
                    {
                        "name": "Rothschild M.F."
                    }
                ],
                "citationCount": 17,
                "date": "2009-02-01T00:00:00Z",
                "journal": "Animal Genetics",
                "title": "SNP discovery in Litopenaeus vannamei with a new computational pipeline"
            },
            "pmid": "18828861"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1
}