{
    "accessibility": "Open access",
    "additionDate": "2019-05-28T09:26:49Z",
    "biotoolsCURIE": "biotools:matTFA",
    "biotoolsID": "matTFA",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Laboratory of Computational Systems Biotechnology",
            "typeEntity": "Division",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://lcsb.epfl.ch/"
        }
    ],
    "description": "Matlab implementation of Thermodynamics-based Flux Analysis.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/EPFL-LCSB/matTFA",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2020-06-16T10:55:22Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "matTFA",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/bty499",
            "metadata": {
                "abstract": "© 2018 The Author(s). Published by Oxford University Press.pyTFA and matTFA are the first published implementations of the original TFA paper. Specifically, they include explicit formulation of Gibbs energies and metabolite concentrations, which enables straightforward integration of metabolite concentration measurements. Motivation High-throughput analytic technologies provide a wealth of omics data that can be used to perform thorough analyses for a multitude of studies in the areas of Systems Biology and Biotechnology. Nevertheless, most studies are still limited to constraint-based Flux Balance Analyses (FBA), neglecting an important physicochemical constraint: Thermodynamics. Thermodynamics-based Flux Analysis (TFA) in metabolic models enables the integration of quantitative metabolomics data to study their effects on the net-flux directionality of reactions in the network. In addition, it allows us to estimate how far each reaction operates from thermodynamic equilibrium, which provides critical information for guiding metabolic engineering decisions. Results We present a Python package (pyTFA) and a Matlab toolbox (matTFA) that implement TFA. We show an example of application on both a reduced and a genome-scale model of E. coli., and demonstrate TFA and data integration through TFA reduce the feasible flux space with respect to FBA. Availability and implementation Documented implementation of TFA framework both in Python (pyTFA) and Matlab (matTFA) are available on www.github.com/EPFL-LCSB/.",
                "authors": [
                    {
                        "name": "Salvy P."
                    },
                    {
                        "name": "Fengos G."
                    },
                    {
                        "name": "Ataman M."
                    },
                    {
                        "name": "Pathier T."
                    },
                    {
                        "name": "Soh K.C."
                    },
                    {
                        "name": "Hatzimanikatis V."
                    }
                ],
                "citationCount": 13,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "PyTFA and matTFA: A Python package and a Matlab toolbox for Thermodynamics-based Flux Analysis"
            },
            "pmcid": "PMC6298055",
            "pmid": "30561545",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        }
    ]
}