{
    "additionDate": "2017-08-03T18:36:32Z",
    "biotoolsCURIE": "biotools:asymmetry",
    "biotoolsID": "asymmetry",
    "credit": [
        {
            "email": "mcdonald@udel.edu",
            "name": "McDonald, J.H",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://udel.edu/~mcdonald/"
        }
    ],
    "description": "AmbiguityRemover removes ambiguously aligned sites from protein sequence alignments, for input into AsymmetryCounter. AsymmetryCounter counts the number of amino acid substitutions in each direction between pairs of protein sequences. \nAsymmetryScaler takes the results from AsymmetryCounter and summarizes substitutional asymmetry data in a single scale.",
    "documentation": [
        {
            "type": "General",
            "url": "http://udel.edu/~mcdonald/asymmetry.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "homepage": "http://udel.edu/~mcdonald/asymmetry.html",
    "lastUpdate": "2018-12-10T12:58:43Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/asymmetry-20060215-test-protein-sequence-data-substitutional-asymmetry.html"
        },
        {
            "type": "Software catalogue",
            "url": "http://udel.edu/~mcdonald/asymmetry.html"
        }
    ],
    "name": "Asymmetry",
    "operatingSystem": [
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "It has long been known that amino acid substitutions in proteins of organisms living at moderate and high temperatures (mesophiles and thermophiles, respectively) are not all symmetrical; for example, more aligned sites have lysine in mesophiles and arginine in thermophiles than have the opposite pattern. This is generally taken to indicate that certain amino acids are favored over others by selection at different temperatures. Previous comparisons of protein sequences from mesophiles and thermophiles have used relatively small numbers of sequences from a diverse array of species, meaning that only the most common amino acid substitutions could be examined and any taxon-specific patterns would be obscured. Here, we compare a large number of proteins between mesophiles and thermophiles in the archaeal genus Methanococcus and the bacterial genus Bacillus. Each genus exhibits dramatically asymmetrical substitution patterns for many pairs of amino acids. There are several pairs of amino acids for which one amino acid is favored in thermophilic Bacillus and the other is favored in thermophilic Methanococcus; this appears to result from the higher G+C content of the DNA of thermophilic Bacillus, a complication not seen in Methanococcus.",
                "authors": [
                    {
                        "name": "McDonald J.H."
                    },
                    {
                        "name": "Grasso A.M."
                    },
                    {
                        "name": "Rejto L.K."
                    }
                ],
                "citationCount": 45,
                "date": "1999-01-01T00:00:00Z",
                "journal": "Molecular Biology and Evolution",
                "title": "Patterns of temperature adaptation in proteins from Methanococcus and Bacillus"
            },
            "pmid": "10605119"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Comparative genomics",
            "uri": "http://edamontology.org/topic_0797"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}