{
    "additionDate": "2020-01-09T18:12:43Z",
    "biotoolsCURIE": "biotools:i.segment",
    "biotoolsID": "i.segment",
    "confidence_flag": "tool",
    "description": "An example of SAR-derived image segmentation for landslides detection.\n\nNote: A new GRASS GIS stable version has been released: GRASS GIS 7.8, available here.\n\ni.segment - Identifies segments (objects) from imagery data.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://grass.osgeo.org/grass74/manuals/i.segment.html",
    "lastUpdate": "2020-12-11T08:15:29Z",
    "name": "i.segment",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.7287/PEERJ.PREPRINTS.27212V2",
            "metadata": {
                "abstract": "© 2020 Asociacion Colombiana de Infectologia. All rights reserved.A rapid assessment of the areal extent of landslide disasters is one of the main challenges facing by the scientific community. Satellite radar data represent a powerful tool for the rapid detection of landslides over large spatial scales, even in case of persistent cloud cover. To define landslide locations, radar data need to be firstly pre-processed and then elaborated for the extraction of the required information. Segmentation represents one of the most useful procedures for identifying land cover changes induced by landslides. In this study, we present an application of the i.segment module of GRASS GIS software for segmenting radar-derived data. As study area, we selected the Tagari River valley in Papua New Guinea, where massive landslides were triggered by a M7.5 earthquake on February 25, 2018. A comparison with ground truth data revealed a suitable performance of i.segment. Particular segmentation patterns, in fact, resulted in the areas affected by landslides with respect to the external ones, or to the same areas before the earthquake. These patterns highlighted a relevant contrast of radar backscattering values recorded before and after the landslides. With our procedure, we were able to define the extension of the mass movements that occurred in the study area, just three days after the M7.5 earthquake.",
                "authors": [
                    {
                        "name": "Esposito G."
                    },
                    {
                        "name": "Marchesini I."
                    },
                    {
                        "name": "Mondini A.C."
                    },
                    {
                        "name": "Reichenbach P."
                    },
                    {
                        "name": "Rossi M."
                    },
                    {
                        "name": "Salvati P."
                    }
                ],
                "citationCount": 1,
                "date": "2018-01-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "An example of SAR-derived image segmentation for landslides detection"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ],
    "validated": 1
}
