{
    "accessibility": "Open access",
    "additionDate": "2019-08-18T18:40:03Z",
    "biotoolsCURIE": "biotools:CellMinerCDB",
    "biotoolsID": "CellMinerCDB",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "Webadmin@discover.nci.nih.gov",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Web application for exploration and analysis of cancer cell line pharmacogenomic data across different sources.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://discover.nci.nih.gov/cellminercdb/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "RNA-Seq quantification",
                    "uri": "http://edamontology.org/operation_3800"
                },
                {
                    "term": "Splice transcript prediction",
                    "uri": "http://edamontology.org/operation_0264"
                }
            ]
        }
    ],
    "homepage": "https://discover.nci.nih.gov/cellminercdb/",
    "lastUpdate": "2020-12-14T11:37:40Z",
    "license": "Unlicense",
    "maturity": "Mature",
    "name": "CellMinerCDB",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1016/J.ISCI.2019.10.059",
            "metadata": {
                "abstract": "© 2019 The Author(s)Biological Sciences; Systems Biology; Proteomics; Cancer Systems Biology © 2019 The Author(s)Here we describe a proteomic data resource for the NCI-60 cell lines generated by pressure cycling technology and SWATH mass spectrometry. We developed the DIA-expert software to curate and visualize the SWATH data, leading to reproducible detection of over 3,100 SwissProt proteotypic proteins and systematic quantification of pathway activities. Stoichiometric relationships of interacting proteins for DNA replication, repair, the chromatin remodeling NuRD complex, β-catenin, RNA metabolism, and prefoldins are more evident than that at the mRNA level. The data are available in CellMiner (discover.nci.nih.gov/cellminercdb and discover.nci.nih.gov/cellminer), allowing casual users to test hypotheses and perform integrative, cross-database analyses of multi-omic drug response correlations for over 20,000 drugs. We demonstrate the value of proteome data in predicting drug response for over 240 clinically relevant chemotherapeutic and targeted therapies. In summary, we present a novel proteome resource for the NCI-60, together with relevant software tools, and demonstrate the benefit of proteome analyses.",
                "authors": [
                    {
                        "name": "Aebersold R."
                    },
                    {
                        "name": "Auwerx C."
                    },
                    {
                        "name": "Banaei-Esfahani A."
                    },
                    {
                        "name": "Beck M."
                    },
                    {
                        "name": "Bi R."
                    },
                    {
                        "name": "Bork P."
                    },
                    {
                        "name": "Buljan M."
                    },
                    {
                        "name": "Calzone L."
                    },
                    {
                        "name": "Elloumi F."
                    },
                    {
                        "name": "Gao H."
                    },
                    {
                        "name": "Garnett M.J."
                    },
                    {
                        "name": "Gillet L."
                    },
                    {
                        "name": "Guo T."
                    },
                    {
                        "name": "Iskar M."
                    },
                    {
                        "name": "Koh C.C."
                    },
                    {
                        "name": "Liu K."
                    },
                    {
                        "name": "Liu W."
                    },
                    {
                        "name": "Luna A."
                    },
                    {
                        "name": "Martignetti L."
                    },
                    {
                        "name": "Menden M.P."
                    },
                    {
                        "name": "Ori A."
                    },
                    {
                        "name": "Pommier Y."
                    },
                    {
                        "name": "Qiu P."
                    },
                    {
                        "name": "Rajapakse V.N."
                    },
                    {
                        "name": "Reinhold W.C."
                    },
                    {
                        "name": "Saez-Rodriguez J."
                    },
                    {
                        "name": "Sander C."
                    },
                    {
                        "name": "Schmitt U."
                    },
                    {
                        "name": "Sun Y."
                    },
                    {
                        "name": "Varma S."
                    },
                    {
                        "name": "Wild P.J."
                    },
                    {
                        "name": "Wu Z."
                    },
                    {
                        "name": "Xu C."
                    },
                    {
                        "name": "Yu C."
                    },
                    {
                        "name": "Zhang H."
                    },
                    {
                        "name": "Zhang J."
                    },
                    {
                        "name": "Zhang Q."
                    },
                    {
                        "name": "Zhong Q."
                    },
                    {
                        "name": "Zhu Y."
                    }
                ],
                "citationCount": 12,
                "date": "2019-11-22T00:00:00Z",
                "journal": "iScience",
                "title": "Quantitative Proteome Landscape of the NCI-60 Cancer Cell Lines"
            },
            "pmcid": "PMC6889472",
            "pmid": "31733513"
        },
        {
            "doi": "10.1158/0008-5472.CAN-18-2047",
            "metadata": {
                "abstract": "© 2019 American Association for Cancer Research.CellMiner (http://discover.nci.nih.gov/cellminer) and CellMinerCDB (https://discover.nci.nih.gov/cellminercdb/) are web-based applications for mining publicly available genomic, molecular, and pharmacologic datasets of human cancer cell lines including the NCI-60, Cancer Cell Line Encyclopedia, Genomics of Drug Sensitivity in Cancer, Cancer Therapeutics Response Portal, NCI/DTP small cell lung cancer, and NCI Almanac cell line sets. Here, we introduce our RNA sequencing (RNA-seq) data for the NCI-60 and their access and integration with the other databases. Correlation to transcript microarray expression levels for identical genes and identical cell lines across CellMinerCDB demonstrates the high quality of these new RNA-seq data. We provide composite and isoform transcript expression data and demonstrate diversity in isoform composition for individual cancer-and pharmacologically relevant genes, including HRAS, PTEN, EGFR, RAD51, ALKBH2, BRCA1, ERBB2, TP53, FGFR2, and CTNND1. We reveal cell-specific differences in the overall levels of isoforms and show their linkage to expression of RNA processing and splicing genes as well as resultant alterations in cancer and pharmacologic gene sets. Gene-drug pairings linked by pathways or functions show specific correlations to isoforms compared with composite gene expression, including ALKBH2-benzaldehyde, AKT3-vandetanib, BCR-imatinib, CDK1 and 20-palbociclib, CASP1-imexon, and FGFR3-pazopanib. Loss of MUC1 20 amino acid variable number tandem repeats, which is used to elicit immune response, and the presence of the androgen receptor AR-V4 and-V7 isoforms in all NCI-60 tissue of origin types demonstrate translational relevance. In summary, we introduce RNA-seq data to our CellMiner and CellMinerCDB web applications, allowing their exploration for both research and translational purposes. Significance: The current study provides RNA sequencing data for the NCI-60 cell lines made accessible through both CellMiner and CellMinerCDB and is an important pharmacogenomics resource for the field.",
                "authors": [
                    {
                        "name": "Doroshow J.H."
                    },
                    {
                        "name": "Elloumi F."
                    },
                    {
                        "name": "Lee S."
                    },
                    {
                        "name": "Meltzer P.S."
                    },
                    {
                        "name": "Ofori-Atta K."
                    },
                    {
                        "name": "Pommier Y."
                    },
                    {
                        "name": "Reinhold W.C."
                    },
                    {
                        "name": "Sunshine M."
                    },
                    {
                        "name": "Trepel J.B."
                    },
                    {
                        "name": "Varma S."
                    }
                ],
                "citationCount": 14,
                "date": "2019-07-01T00:00:00Z",
                "journal": "Cancer Research",
                "title": "RNA sequencing of the NCI-60: Integration into CellMiner and CellMiner CDB"
            },
            "pmcid": "PMC6615556",
            "pmid": "31113817",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Pharmacogenomics",
            "uri": "http://edamontology.org/topic_0208"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
