
{
    "credit": [
        {
            "email": "jothi@mail.nih.gov",
            "name": "Raja Jothi",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://en.wikipedia.org/wiki/Domine_Database"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Protein-protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2464"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "SQL"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Protein interactions",
                "uri": "http://edamontology.org/topic_0128"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Protein folds and structural domains",
                "uri": "http://edamontology.org/topic_0736"
            },
            {
                "term": "Structure prediction",
                "uri": "http://edamontology.org/topic_0082"
            },
            {
                "term": "Protein interaction experiment",
                "uri": "http://edamontology.org/topic_3557"
            }
        ]
    },
    "publication": [
        {
            "abstract": "DOMINE is a comprehensive collection of known and predicted domain-domain interactions (DDIs) compiled from 15 different sources. The updated DOMINE includes 2285 new domain-domain interactions (DDIs) inferred from experimentally characterized high-resolution three-dimensional structures, and about 3500 novel predictions by five computational approaches published over the last 3 years. These additions bring the total number of unique DDIs in the updated version to 26 219 among 5140 unique Pfam domains, a 23% increase compared to 20 513 unique DDIs among 4346 unique domains in the previous version. The updated version now contains 6634 known DDIs, and features a new classification scheme to assign confidence levels to predicted DDIs. DOMINE will serve as a valuable resource to those studying protein and domain interactions. Most importantly, DOMINE will not only serve as an excellent reference to bench scientists testing for new interactions but also to bioinformaticans seeking to predict novel protein-protein interactions based on the DDIs. The contents of the DOMINE are available at http:// domine.utdallas.edu. © The Author(s) 2010.",
            "authors": [
                "Yellaboina S.",
                "Tasneem A.",
                "Zaykin D.V.",
                "Raghavachari B.",
                "Jothi R."
            ],
            "cit_count": 115,
            "journal": "Nucleic Acids Research",
            "pmid": "21113022",
            "title": "DOMINE: A comprehensive collection of known and predicted domain-domain interactions",
            "year": "2011-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:domine",
        "biotoolsID": "domine",
        "description": "Collection of known and predicted domain-domain interactions (DDIs) compiled from 15 different sources. The updated version includes 2285 new domain-domain interactions (DDIs) inferred from experimentally characterized high-resolution three-dimensional structures, and about 3500 novel predictions by five computational approaches published over the last 3 years. New features include a new classification scheme to assign confidence levels to predicted DDIs.",
        "homepage": "http://domine.utdallas.edu",
        "name": "DOMINE"
    }
}