{
    "additionDate": "2017-08-03T18:46:35Z",
    "biotoolsCURIE": "biotools:hotnet2",
    "biotoolsID": "hotnet2",
    "collectionID": [
        "HotNet"
    ],
    "credit": [
        {
            "name": "imada.sdu.dk",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "vandinfa@imada.sdu.dk",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A tool identifies significantly mutated groups of interacting genes from large cancer sequencing studies.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/raphael-group/hotnet2"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                }
            ]
        }
    ],
    "homepage": "https://github.com/raphael-group/hotnet2",
    "language": [
        "Python",
        "Fortran",
        "C"
    ],
    "lastUpdate": "2019-02-26T09:48:43Z",
    "name": "HotNet2",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1089/cmb.2010.0265",
            "metadata": {
                "abstract": "Recent genome sequencing studies have shown that the somatic mutations that drive cancer development are distributed across a large number of genes. This mutational heterogeneity complicates efforts to distinguish functional mutations from sporadic, passenger mutations. Since cancer mutations are hypothesized to target a relatively small number of cellular signaling and regulatory pathways, a common practice is to assess whether known pathways are enriched for mutated genes. We introduce an alternative approach that examines mutated genes in the context of a genome-scale gene interaction network. We present a computationally efficient strategy for de novo identification of subnetworks in an interaction network that are mutated in a statistically significant number of patients. This framework includes two major components. First, we use a diffusion process on the interaction network to define a local neighborhood of \"influence\" for each mutated gene in the network. Second, we derive a two-stage multiple hypothesis test to bound the false discovery rate (FDR) associated with the identified subnetworks. We test these algorithms on a large human protein-protein interaction network using somatic mutation data from glioblastoma and lung adenocarcinoma samples. We successfully recover pathways that are known to be important in these cancers and also identify additional pathways that have been implicated in other cancers but not previously reported as mutated in these samples. We anticipate that our approach will find increasing use as cancer genome studies increase in size and scope. © Copyright 2011, Mary Ann Liebert, Inc.",
                "authors": [
                    {
                        "name": "Vandin F."
                    },
                    {
                        "name": "Upfal E."
                    },
                    {
                        "name": "Raphael B.J."
                    }
                ],
                "citationCount": 252,
                "date": "2011-03-01T00:00:00Z",
                "journal": "Journal of Computational Biology",
                "title": "Algorithms for detecting significantly mutated pathways in cancer"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        }
    ],
    "validated": 1,
    "version": [
        "2"
    ]
}