{
    "additionDate": "2021-06-14T13:44:09Z",
    "biotoolsCURIE": "biotools:breastimplantanalyzer",
    "biotoolsID": "breastimplantanalyzer",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "l.levine4@med.miami.edu",
            "name": "Lance Levine",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "BreastImplantAnalyzer is an easy-to-use, validated tool for calculating breast implant volume from MRI data. BreastImplantAnalyzer was designed to be as easy-to-use as possible for plastic surgeons. Using a simple interface, a patient's MRI can be loaded into the application and a semi-automated algorithm will determine the volume of the implant.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://www.breastimplantanalyzer.com/",
    "lastUpdate": "2021-08-18T09:51:34.040066Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/lancelevine/SlicerBreastImplantAnalyzer"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/lancelevine/SlicerBreastImplantAnalyzer/issues"
        }
    ],
    "name": "BreastImplantAnalyzer",
    "operatingSystem": [
        "Mac",
        "Windows"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.BJPS.2021.03.068",
            "metadata": {
                "abstract": "© 2021 Elsevier LtdBackground: Given the prevalence of breast augmentation and prosthetic-based breast reconstruction, it is common for the plastic surgeon to see patients presenting for revisional implant surgery. A frequent issue encountered in such procedures is uncertainty of implant size, which presents numerous challenges and may lead to undesired outcomes for both the patient and the surgeon. There is currently no tool available with the purpose of measuring implant volume from magnetic resonance imaging (MRI) data. In this study, such a program was designed and tested. Methods: An open-source software was developed that provides volume measurement of a chosen breast implant with minimal interaction from the user, allowing for precision in the planning of breast implant revisional surgery. It was developed to be as easy to use as possible for clinicians who may not have experience with imaging analysis platforms. The program was tested on patients who underwent revisional implant surgery and had documented implant volumes and pre-operative breast MRIs. Twenty-two implants were tested in total, including saline and both smooth and textured silicone implants. Results: The software has shown to be highly accurate with an average accuracy of 98.6%. A Spearman correlation coefficient of 0.967 was obtained. The software also performed faster than previously proposed methods. Conclusion: Plastic surgeons can easily calculate breast implant volume pre-operatively using BreastImplantAnalyzer, which is available to download for free from www.BreastImplantAnalyzer.com or as an extension for the popular medical imaging platform 3D Slicer.",
                "authors": [
                    {
                        "name": "Levine L."
                    },
                    {
                        "name": "Kassira W."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Journal of Plastic, Reconstructive and Aesthetic Surgery",
                "title": "BreastImplantAnalyzer: An easy-to-use, validated tool for calculating breast implant volume from MRI data"
            },
            "pmid": "33972201",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        }
    ]
}