{
    "additionDate": "2021-01-18T08:47:14Z",
    "biotoolsCURIE": "biotools:nlpexplorer",
    "biotoolsID": "nlpexplorer",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "singh.mayank@iitgn.ac.in",
            "name": "Mayank Singh",
            "typeEntity": "Person"
        }
    ],
    "description": "Exploring the Universe of NLP Papers.\n\nUnderstanding the current research trends, problems, and their innovative solutions remains a bottleneck due to the ever-increasing volume of scientific articles. In this paper, we propose NLPExplorer, a completely automatic portal for indexing, searching, and visualizing Natural Language Processing (NLP) research volume. NLPExplorer presents interesting insights from papers, authors, venues, and topics.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://nlpexplorer.org",
    "lastUpdate": "2021-03-08T14:08:39Z",
    "name": "NLPExplorer",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1007/978-3-030-45442-5_61",
            "metadata": {
                "abstract": "© Springer Nature Switzerland AG 2020.Understanding the current research trends, problems, and their innovative solutions remains a bottleneck due to the ever-increasing volume of scientific articles. In this paper, we propose NLPExplorer, a completely automatic portal for indexing, searching, and visualizing Natural Language Processing (NLP) research volume. NLPExplorer presents interesting insights from papers, authors, venues, and topics. In contrast to previous topic modelling based approaches, we manually curate five course-grained non-exclusive topical categories namely Linguistic Target (Syntax, Discourse, etc.), Tasks (Tagging, Summarization, etc.), Approaches (unsupervised, supervised, etc.), Languages (English, Chinese, etc.) and Dataset types (news, clinical notes, etc.). Some of the novel features include a list of young popular authors, popular URLs and datasets, list of topically diverse papers and recent popular papers. Also, it provides temporal statistics such as yearwise popularity of topics, datasets, and seminal papers. To facilitate future research and system development, we make all the processed dataset accessible through API calls. The current system is available at http://nlpexplorer.org.",
                "authors": [
                    {
                        "name": "Parmar M."
                    },
                    {
                        "name": "Jain N."
                    },
                    {
                        "name": "Jain P."
                    },
                    {
                        "name": "Jayakrishna Sahit P."
                    },
                    {
                        "name": "Pachpande S."
                    },
                    {
                        "name": "Singh S."
                    },
                    {
                        "name": "Singh M."
                    }
                ],
                "citationCount": 2,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics)",
                "title": "NLPExplorer: Exploring the universe of NLP papers"
            },
            "pmcid": "PMC7148103"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Data architecture, analysis and design",
            "uri": "http://edamontology.org/topic_3365"
        },
        {
            "term": "Data acquisition",
            "uri": "http://edamontology.org/topic_3077"
        }
    ]
}