{
    "additionDate": "2020-01-14T08:53:45Z",
    "biotoolsCURIE": "biotools:oRNAment",
    "biotoolsID": "oRNAment",
    "confidence_flag": "tool",
    "description": "A database of putative RNA binding protein target sites in the transcriptomes of model species.\n\nDashboard - Overview of the database.\n\nWelcome to oRNAment - o RNA motifs enrichment in complete transcriptomes.\n\nHere, we developed a computational tool to enable the global mapping of putative RBP target motifs across full transcriptomes, including messenger RNAs (mRNAs) and non-coding RNAs, in multiple species. The oRNAment database provides a user-friendly interface to parse the motif scan data. See tutorial for further detail",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "In vitro selection",
                    "uri": "http://edamontology.org/operation_3795"
                },
                {
                    "term": "Sequence motif recognition",
                    "uri": "http://edamontology.org/operation_0239"
                },
                {
                    "term": "RNA binding site prediction",
                    "uri": "http://edamontology.org/operation_3902"
                },
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                }
            ]
        }
    ],
    "homepage": "http://rnabiology.ircm.qc.ca/oRNAment/",
    "lastUpdate": "2021-01-04T14:31:24Z",
    "name": "oRNAment",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/NAR/GKZ986",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press on behalf of Nucleic Acids Research.Protein-RNA interactions are essential for controlling most aspects of RNA metabolism, including synthesis, processing, trafficking, stability and degradation. In vitro selection methods, such as RNAcompete and RNA Bind-n-Seq, have defined the consensus target motifs of hundreds of RNA-binding proteins (RBPs). However, readily available information about the distribution features of these motifs across full transcriptomes was hitherto lacking. Here, we introduce oRNAment (o RNA motifs enrichment in transcriptomes), a database that catalogues the putative motif instances of 223 RBPs, encompassing 453 motifs, in a transcriptome-wide fashion. The database covers 525 718 complete coding and non-coding RNA species across the transcriptomes of human and four prominent model organisms: Caenorhabditis elegans, Danio rerio, Drosophila melanogaster and Mus musculus. The unique features of oRNAment include: (i) hosting of the most comprehensive mapping of RBP motif instances to date, with 421 133 612 putative binding sites described across five species; (ii) options for the user to filter the data according to a specific threshold; (iii) a user-friendly interface and efficient back-end allowing the rapid querying of the data through multiple angles (i.e. transcript, RBP, or sequence attributes) and (iv) generation of several interactive data visualization charts describing the results of user queries. oRNAment is freely available at http://rnabiology.ircm.qc.ca/oRNAment/.",
                "authors": [
                    {
                        "name": "Benoit Bouvrette L.P."
                    },
                    {
                        "name": "Bovaird S."
                    },
                    {
                        "name": "Blanchette M."
                    },
                    {
                        "name": "Lecuyer E."
                    }
                ],
                "citationCount": 12,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "ORNAment: A database of putative RNA binding protein target sites in the transcriptomes of model species"
            },
            "pmid": "31724725"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        }
    ],
    "validated": 1
}