
{
    "credit": [
        {
            "email": "claudia.cava@ibfm.cnr.it",
            "name": "Claudia Cava",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://bioconductor.org/packages/release/bioc/html/SpidermiR.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/SpidermiR_1.4.4.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                },
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "language": [
            "R"
        ],
        "license": "GPL-3.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "Functional, regulatory and non-coding RNA",
                "uri": "http://edamontology.org/topic_0659"
            },
            {
                "term": "Gene regulation",
                "uri": "http://edamontology.org/topic_0204"
            }
        ]
    },
    "link": [
        {
            "type": "Mirror",
            "url": "https://github.com/claudiacava/SpidermiR"
        }
    ],
    "publication": [
        {
            "abstract": "© 2017 by the authors; licensee MDPI, Basel, Switzerland.Gene Regulatory Networks (GRNs) control many biological systems, but how such network coordination is shaped is still unknown. GRNs can be subdivided into basic connections that describe how the network members interact e.g., co-expression, physical interaction, co-localization, genetic influence, pathways, and shared protein domains. The important regulatory mechanisms of these networks involve miRNAs. We developed an R/Bioconductor package, namely SpidermiR, which offers an easy access to both GRNs and miRNAs to the end user, and integrates this information with differentially expressed genes obtained from The Cancer Genome Atlas. Specifically, SpidermiR allows the users to: (i) query and download GRNs and miRNAs from validated and predicted repositories; (ii) integrate miRNAs with GRNs in order to obtain miRNA–gene–gene and miRNA–protein–protein interactions, and to analyze miRNA GRNs in order to identify miRNA–gene communities; and (iii) graphically visualize the results of the analyses. These analyses can be performed through a single interface and without the need for any downloads. The full data sets are then rapidly integrated and processed locally.",
            "authors": [
                "Cava C.",
                "Colaprico A.",
                "Bertoli G.",
                "Graudenzi A.",
                "Silva T.C.",
                "Olsen C.",
                "Noushmehr H.",
                "Bontempi G.",
                "Mauri G.",
                "Castiglioni I."
            ],
            "cit_count": 11,
            "doi": "10.3390/ijms18020274",
            "journal": "International Journal of Molecular Sciences",
            "title": "SpidermiR: An R/bioconductor package for integrative analysis with miRNA data",
            "type": "Primary",
            "year": "2017-02-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:spidermir",
        "biotoolsID": "spidermir",
        "description": "Aims: i) Facilitate the network open-access data retrieval from GeneMania data, ii) prepare the data with appropriate gene nomenclature, iii) integration of miRNA data in a specific network, iv) provide different standard analyses and v) allow the user to visualize the results. In more detail, the package provides multiple methods for query, prepare and download network data, and the integration with validated and predicted miRNA data, the use of standard analysis and visualization methods.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/SpidermiR.html",
        "name": "SpidermiR",
        "version": [
            "1.4.4"
        ]
    }
}