{"credit":[{"email":"jose.castresana@ibe.upf-csic.es","name":"Castresana Villamor, José","typeEntity":"Person","typeRoles":["Primary contact"],"url":"https://www.ibe.upf-csic.es/entry/-/-/19818/adscripcion/jos%C3%A9-castresana"}],"documentation":[{"type":"GENERAL","url":"http://molevol.cmima.csic.es/castresana/Ktreedist/Ktreedist_documentation.html"}],"function":[{"operation":[{"term":"Phylogenetic tree comparison","uri":"http://edamontology.org/operation_0325"}]}],"labels":{"language":["Perl"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Script"],"topic":[{"term":"Phylogenetics","uri":"http://edamontology.org/topic_3293"},{"term":"Evolutionary biology","uri":"http://edamontology.org/topic_3299"},{"term":"Phylogeny","uri":"http://edamontology.org/topic_0084"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/ktreedist-1-0-calculation-minimum-branch-length-distance-k-tree-score-phylogenetic-trees.html"}],"publication":[{"abstract":"Summary: We introduce a new phylogenetic comparison method that measures overall differences in the relative branch length and topology of two phylogenetic trees. To do this, the algorithm first scales one of the trees to have a global divergence as similar as possible to the other tree. Then, the branch length distance, which takes differences in topology and branch lengths into account, is applied to the two trees. We thus obtain the minimum branch length distance or K tree score. Two trees with very different relative branch lengths get a high K score whereas two trees that follow a similar among-lineage rate variation get a low score, regardless of the overall rates in both trees. There are several applications of the K tree score, two of which are explained here in more detail. First, this score allows the evaluation of the performance of phylogenetic algorithms, not only with respect to their topological accuracy, but also with respect to the reproduction of a given branch length variation. In a second example, we show how the K score allows the selection of orthologous genes by choosing those that better follow the overall shape of a given reference tree. © The Author 2007. Published by Oxford University Press. All rights reserved.","authors":["Soria-Carrasco V.","Talavera G.","Igea J.","Castresana J."],"cit_count":61,"journal":"Bioinformatics","pmid":"17890735","title":"The K tree score: Quantification of differences in the relative branch length and topology of phylogenetic trees","year":"2007-11-01"}],"summary":{"biotoolsCURIE":"biotools:ktreedist","biotoolsID":"ktreedist","description":"Computer program written in Perl that calculates the minimum branch length distance from one phylogenetic tree to another, providing a measure of the difference in topology and relative branch lengths (shape) between two trees.","homepage":"http://molevol.cmima.csic.es/castresana/Ktreedist.html","name":"Ktreedist"}}