{
    "accessibility": "Open access",
    "additionDate": "2017-03-24T14:34:25Z",
    "biotoolsCURIE": "biotools:hhomp",
    "biotoolsID": "hhomp",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "mpi-toolkit@tuebingen.mpg.de",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Web server for prediction and classification of outer membrane proteins (OMPs). Beginning with sequence similarity of a protein to known OMPs, it builds a hidden markov model (HMM) and compares the input sequence to a database of OMPs by pairwise HMM comparison. The OMP database contains profile HMMs for over 20,000 putative OMP sequences.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                }
            ]
        }
    ],
    "homepage": "https://toolkit.tuebingen.mpg.de/#/tools/hhomp",
    "lastUpdate": "2020-06-16T10:55:24Z",
    "maturity": "Mature",
    "name": "HHomp",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Outer membrane proteins (OMPs) are the transmembrane proteins found in the outer membranes of Gram-negative bacteria, mitochondria and plastids. Most prediction methods have focused on analogous features, such as alternating hydrophobicity patterns. Here, we start from the observation that almost all β-barrel OMPs are related by common ancestry. We identify proteins as OMPs by detecting their homologous relationships to known OMPs using sequence similarity. Given an input sequence, HHomp builds a profile hidden Markov model (HMM) and compares it with an OMP database by pairwise HMM comparison, integrating OMP predictions by PROFtmb. A crucial ingredient is the OMP database, which contains profile HMMs for over 20 000 putative OMP sequences. These were collected with the exhaustive, transitive homology detection method HHsenser, starting from 23 representative OMPs in the PDB database. In a benchmark on TransportDB, HHomp detects 63.5% of the true positives before including the first false positive. This is 70% more than PROFtmb, four times more than BOMP and 10 times more than TMB-Hunt. In Escherichia coli, HHomp identifies 57 out of 59 known OMPs and correctly assigns them to their functional subgroups. HHomp can be accessed at http://toolkit.tuebingen.mpg.de/hhomp.",
                "authors": [
                    {
                        "name": "Remmert M."
                    },
                    {
                        "name": "Linke D."
                    },
                    {
                        "name": "Lupas A.N."
                    },
                    {
                        "name": "Soding J."
                    }
                ],
                "citationCount": 73,
                "date": "2009-08-04T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "HHomp - Prediction and classification of outer membrane proteins"
            },
            "pmid": "19429691",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Membrane and lipoproteins",
            "uri": "http://edamontology.org/topic_0820"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        }
    ],
    "validated": 1
}