{
    "additionDate": "2018-07-30T12:35:03Z",
    "biotoolsCURIE": "biotools:mpd-primer",
    "biotoolsID": "mpd-primer",
    "credit": [
        {
            "email": "seqam1@gmail.com",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Multiplex primer design for next-generation targeted sequencing.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://wingolab-org.github.io/mpd-c/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                }
            ]
        }
    ],
    "homepage": "https://wingolab-org.github.io/mpd-c/",
    "language": [
        "Perl",
        "C"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "license": "GPL-3.0",
    "name": "MPD",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s12859-016-1453-3",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: Targeted resequencing offers a cost-effective alternative to whole-genome and whole-exome sequencing when investigating regions known to be associated with a trait or disease. There are a number of approaches to targeted resequencing, including microfluidic PCR amplification, which may be enhanced by multiplex PCR. Currently, there is no open-source software that can design next-generation multiplex PCR experiments that ensures primers are unique at a genome-level and efficiently pools compatible primers. Results: We present MPD, a software package that automates the design of multiplex PCR primers for next-generation sequencing. The core of MPD is implemented in C for speed and uses a hashed genome to ensure primer uniqueness, avoids placing primers over sites of known variation, and efficiently pools compatible primers. A JavaScript web application (http://multiplexprimer.io) utilizing the MPD Perl package provides a convenient platform for users to make designs. Using a realistic set of genes identified by genome-wide association studies (GWAS), we achieve 90% coverage of all exonic regions using stringent design criteria. Using the first 47 primer pools for wet-lab validation, we sequenced ~25Kb at 99.7% completeness with a mean coverage of 300X among 313 samples simultaneously and identified 224 variants. The number and nature of variants we observe are consistent with high quality sequencing. Conclusions: MPD can successfully design multiplex PCR experiments suitable for next-generation sequencing, and simplifies retooling targeted resequencing pipelines to focus on new targets as new genetic evidence emerges.",
                "authors": [
                    {
                        "name": "Wingo T.S."
                    },
                    {
                        "name": "Kotlar A."
                    },
                    {
                        "name": "Cutler D.J."
                    }
                ],
                "citationCount": 10,
                "date": "2017-01-05T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "MPD: Multiplex primer design for next-generation targeted sequencing"
            },
            "pmcid": "PMC5217220",
            "pmid": "28056760"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "NGS",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "PCR experiment",
            "uri": "http://edamontology.org/topic_3519"
        }
    ],
    "validated": 1
}