{
    "additionDate": "2017-07-20T18:20:28Z",
    "biotoolsCURIE": "biotools:bridgedb_api",
    "biotoolsID": "bridgedb_api",
    "collectionID": [
        "Rare Disease",
        "BridgeDb"
    ],
    "credit": [
        {
            "email": "bridgedb-discuss@googlegroups.com",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "BridgeDb is a framework for finding and mapping equivalent database identifiers. It has many facets: it is both a framework, live services, and are identifier mapping files for genes, proteins, and metabolites.",
    "documentation": [
        {
            "type": "General",
            "url": "https://www.bridgedb.org/"
        }
    ],
    "editPermission": {
        "authors": [
            "ChrisEvelo",
            "LanfearJ"
        ],
        "type": "group"
    },
    "elixirNode": [
        "Netherlands"
    ],
    "elixirPlatform": [
        "Interoperability"
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Data",
                        "uri": "http://edamontology.org/data_0006"
                    }
                },
                {
                    "data": {
                        "term": "Identifier",
                        "uri": "http://edamontology.org/data_0842"
                    }
                },
                {
                    "data": {
                        "term": "Identifier",
                        "uri": "http://edamontology.org/data_0842"
                    }
                }
            ],
            "note": "Returns a list of xrefs that map to a given identifier, and data source. Optionally restrict results to a given data source.",
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Data",
                        "uri": "http://edamontology.org/data_0006"
                    }
                }
            ]
        },
        {
            "input": [
                {
                    "data": {
                        "term": "Species name",
                        "uri": "http://edamontology.org/data_1045"
                    }
                },
                {
                    "data": {
                        "term": "Identifier",
                        "uri": "http://edamontology.org/data_0842"
                    }
                },
                {
                    "data": {
                        "term": "Identifier",
                        "uri": "http://edamontology.org/data_0842"
                    }
                }
            ],
            "note": "Returns `true` or `false` based on whether or not an xref exists in the database given an identifier, data source, and organism.",
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Data",
                        "uri": "http://edamontology.org/data_0006"
                    }
                }
            ]
        }
    ],
    "homepage": "http://www.bridgedb.org/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2019-11-27T09:31:52Z",
    "name": "BridgeDb API",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "egonw",
    "publication": [
        {
            "doi": "10.1186/1471-2105-11-5",
            "metadata": {
                "abstract": "Background: Endocrine disruptors (EDs) and their broad range of potential adverse effects in humans and other animals have been a concern for nearly two decades. Many putative EDs are widely used in commercial products regulated by the Food and Drug Administration (FDA) such as food packaging materials, ingredients of cosmetics, medical and dental devices, and drugs. The Endocrine Disruptor Knowledge Base (EDKB) project was initiated in the mid 1990's by the FDA as a resource for the study of EDs. The EDKB database, a component of the project, contains data across multiple assay types for chemicals across a broad structural diversity. This paper demonstrates the utility of EDKB database, an integral part of the EDKB project, for understanding and prioritizing EDs for testing.Results: The EDKB database currently contains 3,257 records of over 1,800 EDs from different assays including estrogen receptor binding, androgen receptor binding, uterotropic activity, cell proliferation, and reporter gene assays. Information for each compound such as chemical structure, assay type, potency, etc. is organized to enable efficient searching. A user-friendly interface provides rapid navigation, Boolean searches on EDs, and both spreadsheet and graphical displays for viewing results. The search engine implemented in the EDKB database enables searching by one or more of the following fields: chemical structure (including exact search and similarity search), name, molecular formula, CAS registration number, experiment source, molecular weight, etc. The data can be cross-linked to other publicly available and related databases including TOXNET, Cactus, ChemIDplus, ChemACX, Chem Finder, and NCI DTP. . Conclusion: The EDKB database enables scientists and regulatory reviewers to quickly access ED data from multiple assays for specific or similar compounds. The data have been used to categorize chemicals according to potential risks for endocrine activity, thus providing a basis for prioritizing chemicals for more definitive but expensive testing. The EDKB database is publicly available and can be found online at http://edkb.fda.gov/webstart/edkb/index.html.Disclaimer:The views presented in this article do not necessarily reflect those of the US Food and Drug Administration. © 2010 Tong et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Ding D."
                    },
                    {
                        "name": "Xu L."
                    },
                    {
                        "name": "Fang H."
                    },
                    {
                        "name": "Hong H."
                    },
                    {
                        "name": "Perkins R."
                    },
                    {
                        "name": "Harris S."
                    },
                    {
                        "name": "Bearden E.D."
                    },
                    {
                        "name": "Shi L."
                    },
                    {
                        "name": "Tong W."
                    }
                ],
                "citationCount": 54,
                "date": "2010-10-07T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "The EDKB: An established knowledge base for endocrine disrupting chemicals"
            }
        }
    ],
    "toolType": [
        "Web API"
    ],
    "topic": [
        {
            "term": "Data identity and mapping",
            "uri": "http://edamontology.org/topic_3345"
        }
    ]
}