{
    "additionDate": "2021-01-18T07:58:54Z",
    "biotoolsCURIE": "biotools:leukmir",
    "biotoolsID": "leukmir",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "lekha@ccmb.res.in",
            "name": "Lekha Dinesh Kumar",
            "typeEntity": "Person"
        }
    ],
    "description": "A database for miRNAs and their targets in acute lymphoblastic leukemia.\n\nAcute Lymphoblastic Leukemia (ALL) is one of the most common heterogeneous diseases observed in paediatric age group and it differs in both, immunophenotypic and molecular characters.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                }
            ]
        }
    ],
    "homepage": "http://tdb.ccmb.res.in/LeukmiR/",
    "lastUpdate": "2021-02-12T11:37:19Z",
    "name": "LeukmiR",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAZ151",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press.Acute lymphoblastic leukemia (ALL) is one of the most common hematological malignancies in children. Recent studies suggest the involvement of multiple microRNAs in the tumorigenesis of various leukemias. However, until now, no comprehensive database exists for miRNAs and their cognate target genes involved specifically in ALL. Therefore, we developed 'LeukmiR' a dynamic database comprising in silico predicted microRNAs, and experimentally validated miRNAs along with the target genes they regulate in mouse and human. LeukmiR is a user-friendly platform with search strings for ALL-associated microRNAs, their sequences, description of target genes, their location on the chromosomes and the corresponding deregulated signaling pathways. For the user query, different search modules exist where either quick search can be carried out using any fuzzy term or by providing exact terms in specific modules. All entries for both human and mouse genomes can be retrieved through multiple options such as miRNA ID, their accession number, sequence, target genes, Ensemble-ID or Entrez-ID. User can also access miRNA: mRNA interaction networks in different signaling pathways, the genomic location of the targeted regions such as 3′UTR, 5′UTR and exons with their gene ontology and disease ontology information in both human and mouse systems. Herein, we also report 51 novel microRNAs which are not described earlier for ALL. Thus, LeukmiR database will be a valuable source of information for researchers to understand and investigate miRNAs and their targets with diagnostic and therapeutic potential in ALL. Database URL: http://tdb.ccmb.res.in/LeukmiR/.",
                "authors": [
                    {
                        "name": "Kumar L.D."
                    },
                    {
                        "name": "Nair R.A."
                    },
                    {
                        "name": "Rawoof A."
                    },
                    {
                        "name": "Swaminathan G."
                    },
                    {
                        "name": "Tiwari S."
                    }
                ],
                "citationCount": 5,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Database",
                "title": "LeukmiR: A database for miRNAs and their targets in acute lymphoblastic leukemia"
            },
            "pmcid": "PMC7054207",
            "pmid": "32128558"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Paediatrics",
            "uri": "http://edamontology.org/topic_3418"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
