{
    "additionDate": "2017-02-14T09:36:27Z",
    "biotoolsCURIE": "biotools:metaboanalyst_2.0",
    "biotoolsID": "metaboanalyst_2.0",
    "credit": [
        {
            "name": "Xia lab",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.xialab.ca/"
        }
    ],
    "description": "Web-based pipeline for metabolomic data processing, statistical analysis and functional interpretation. It performs data processing and normalization for various metabolomic data types. It provides various univariate and multivariate statistical analysis for two/multi-group, one/two-factor, as well time-series data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.metaboanalyst.ca/faces/docs/Tutorial.xhtml"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                },
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                },
                {
                    "term": "Over-representation analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "http://www.metaboanalyst.ca",
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "MetaboAnalyst 2.0",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Metabolomics is a newly emerging field of 'omics' research that is concerned with characterizing large numbers of metabolites using NMR, chromatography and mass spectrometry. It is frequently used in biomarker identification and the metabolic profiling of cells, tissues or organisms. The data processing challenges in metabolomics are quite unique and often require specialized (or expensive) data analysis software and a detailed knowledge of cheminformatics, bioinformatics and statistics. In an effort to simplify metabolomic data analysis while at the same time improving user accessibility, we have developed a freely accessible, easy-to-use web server for metabolomic data analysis called MetaboAnalyst. Fundamentally, MetaboAnalyst is a web-based metabolomic data processing tool not unlike many of today's web-based microarray analysis packages. It accepts a variety of input data (NMR peak lists, binned spectra, MS peak lists, compound/concentration data) in a wide variety of formats. It also offers a number of options for metabolomic data processing, data normalization, multivariate statistical analysis, graphing, metabolite identification and pathway mapping. In particular, MetaboAnalyst supports such techniques as: fold change analysis, t-tests, PCA, PLS-DA, hierarchical clustering and a number of more sophisticated statistical or machine learning methods. It also employs a large library of reference spectra to facilitate compound identification from most kinds of input spectra. MetaboAnalyst guides users through a step-by-step analysis pipeline using a variety of menus, information hyperlinks and check boxes. Upon completion, the server generates a detailed report describing each method used, embedded with graphical and tabular outputs. MetaboAnalyst is capable of handling most kinds of metabolomic data and was designed to perform most of the common kinds of metabolomic data analyses. MetaboAnalyst is accessible at http://www.metaboanalyst.ca.",
                "authors": [
                    {
                        "name": "Xia J."
                    },
                    {
                        "name": "Psychogios N."
                    },
                    {
                        "name": "Young N."
                    },
                    {
                        "name": "Wishart D.S."
                    }
                ],
                "citationCount": 731,
                "date": "2009-08-04T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "MetaboAnalyst: A web server for metabolomic data analysis and interpretation"
            },
            "pmid": "19429898"
        },
        {
            "metadata": {
                "abstract": "First released in 2009, MetaboAnalyst (www.metaboanalyst.ca) was a relatively simple web server designed to facilitate metabolomic data processing and statistical analysis. With continuing advances in metabolomics along with constant user feedback, it became clear that a substantial upgrade to the original server was necessary. MetaboAnalyst 2.0, which is the successor to MetaboAnalyst, represents just such an upgrade. MetaboAnalyst 2.0 now contains dozens of new features and functions including new procedures for data filtering, data editing and data normalization. It also supports multi-group data analysis, two-factor analysis as well as time-series data analysis. These new functions have also been supplemented with: (i) a quality-control module that allows users to evaluate their data quality before conducting any analysis, (ii) a functional enrichment analysis module that allows users to identify biologically meaningful patterns using metabolite set enrichment analysis and (iii) a metabolic pathway analysis module that allows users to perform pathway analysis and visualization for 15 different model organisms. In developing MetaboAnalyst 2.0 we have also substantially improved its graphical presentation tools. All images are now generated using anti-aliasing and are available over a range of resolutions, sizes and formats (PNG, TIFF, PDF, PostScript, or SVG). To improve its performance, MetaboAnalyst 2.0 is now hosted on a much more powerful server with substantially modified code to take advantage the server's multi-core CPUs for computationally intensive tasks. MetaboAnalyst 2.0 also maintains a collection of 50 or more FAQs and more than a dozen tutorials compiled from user queries and requests. A downloadable version of MetaboAnalyst 2.0, along detailed instructions for local installation is now available as well. © 2012 The Author(s).",
                "authors": [
                    {
                        "name": "Xia J."
                    },
                    {
                        "name": "Mandal R."
                    },
                    {
                        "name": "Sinelnikov I.V."
                    },
                    {
                        "name": "Broadhurst D."
                    },
                    {
                        "name": "Wishart D.S."
                    }
                ],
                "citationCount": 741,
                "date": "2012-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "MetaboAnalyst 2.0-a comprehensive server for metabolomic data analysis"
            },
            "pmid": "22553367"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        }
    ],
    "validated": 1
}