{
    "additionDate": "2021-10-25T07:50:49.927540Z",
    "biotoolsCURIE": "biotools:nidm",
    "biotoolsID": "nidm",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "limin@mail.csu.edu.cn",
            "name": "Min Li",
            "orcidid": "https://orcid.org/0000-0002-0188-1394",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "NIDM is a tool for network impulsive dynamics on multiplex biological network for disease-gene prediction.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "http://bioinformatics.csu.edu.cn/DGP/NID.jsp",
    "lastUpdate": "2021-10-25T07:51:06.027827Z",
    "name": "NIDM",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAB080",
            "metadata": {
                "abstract": "© The Author(s) 2021. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.The prediction of genes related to diseases is important to the study of the diseases due to high cost and time consumption of biological experiments. Network propagation is a popular strategy for disease-gene prediction. However, existing methods focus on the stable solution of dynamics while ignoring the useful information hidden in the dynamical process, and it is still a challenge to make use of multiple types of physical/functional relationships between proteins/genes to effectively predict disease-related genes. Therefore, we proposed a framework of network impulsive dynamics on multiplex biological network (NIDM) to predict disease-related genes, along with four variants of NIDM models and four kinds of impulsive dynamical signatures (IDSs). NIDM is to identify disease-related genes by mining the dynamical responses of nodes to impulsive signals being exerted at specific nodes. By a series of experimental evaluations in various types of biological networks, we confirmed the advantage of multiplex network and the important roles of functional associations in disease-gene prediction, demonstrated superior performance of NIDM compared with four types of network-based algorithms and then gave the effective recommendations of NIDM models and IDS signatures. To facilitate the prioritization and analysis of (candidate) genes associated to specific diseases, we developed a user-friendly web server, which provides three kinds of filtering patterns for genes, network visualization, enrichment analysis and a wealth of external links (http://bioinformatics.csu.edu.cn/DGP/NID.jsp). NIDM is a protocol for disease-gene prediction integrating different types of biological networks, which may become a very useful computational tool for the study of disease-related genes.",
                "authors": [
                    {
                        "name": "Li M."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Xiang J."
                    },
                    {
                        "name": "Zhang J."
                    },
                    {
                        "name": "Zheng R."
                    }
                ],
                "citationCount": 2,
                "date": "2021-09-02T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "NIDM: network impulsive dynamics on multiplex biological network for disease-gene prediction"
            },
            "pmid": "33866352",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Cytogenetics",
            "uri": "http://edamontology.org/topic_3959"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        },
        {
            "term": "Protein interaction experiment",
            "uri": "http://edamontology.org/topic_3957"
        }
    ]
}
