{
    "additionDate": "2019-11-14T18:00:24Z",
    "biotoolsCURIE": "biotools:FeptideDB",
    "biotoolsID": "FeptideDB",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "fsciktc@ku.ac.th",
            "name": "Kiattawee Choowongkomon",
            "typeEntity": "Person"
        },
        {
            "email": "orathai.saw@ku.th",
            "name": "Orathai Sawatdichaikul",
            "typeEntity": "Person"
        }
    ],
    "description": "A web application for new bioactive peptides from food protein | [1] Minkiewicz, P., Dziuba, J., Iwaniak, A., Dziuba, M., Darewicz, M., 2008. BIOPEP database and other programs for processing bioactive peptide sequences. J AOAC Int. 91, 965-980 | [2] Wang, G., Li, X., Wang, Z., 2016. APD3: the antimicrobial peptide database as a tool for research and education. Nucleic Acids Res. 44, D1087-D1093. doi: 10.1093/nar/gkv1278",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence cleavage",
                    "uri": "http://edamontology.org/operation_0366"
                },
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                },
                {
                    "term": "Peptide database search",
                    "uri": "http://edamontology.org/operation_3646"
                }
            ]
        }
    ],
    "homepage": "http://www4g.biotec.or.th/FeptideDB/",
    "lastUpdate": "2019-11-14T18:00:24Z",
    "name": "FeptideDB",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.HELIYON.2019.E02076",
            "metadata": {
                "abstract": "© 2019 The Author(s)Background: Bioactive peptides derived from food are important sources for alternative medicine and possess therapeutic activity. Several biochemical methods have been achieved to isolate bioactive peptides from food, which are tedious and time consuming. In silico methods are an alternative process to reduce cost and time with respect to bioactive peptide production. In this paper, FeptideDB was used to collect bioactive peptide (BP) data from both published research articles and available bioactive peptide databases. FeptideDB was developed to assist in forecasting bioactive peptides from food by combining peptide cleavage tools and database matching. Furthermore, this application was able to predict the potential of cleaved peptides from ‘enzyme digestion module’ to identify new ACE (angiotensin converting enzyme) inhibitors using an automatic molecular docking approach. Results: The FeptideDB web application contains tools for generating all possible peptides cleaved from input protein by various available enzymes. This database was also used for analysis and visualization to assist in bioactive peptide discovery. One module of FeptideDB has the ability to create 3-dimensional peptide structures to further predict inhibitors for the target protein, ACE (angiotensin converting enzyme). Conclusions: FeptideDB is freely available to researchers who are interested in exploring bioactive peptides. The FeptideDB interface is easy to use, allowing users to rapidly retrieve data based on desired search criteria. FeptideDB is freely available at http://www4g.biotec.or.th/FeptideDB/. Ultimately, FeptideDB is a computational aid for assessing peptide bioactivities.",
                "authors": [
                    {
                        "name": "Panyayai T."
                    },
                    {
                        "name": "Ngamphiw C."
                    },
                    {
                        "name": "Tongsima S."
                    },
                    {
                        "name": "Mhuantong W."
                    },
                    {
                        "name": "Limsripraphan W."
                    },
                    {
                        "name": "Choowongkomon K."
                    },
                    {
                        "name": "Sawatdichaikul O."
                    }
                ],
                "citationCount": 3,
                "date": "2019-07-01T00:00:00Z",
                "journal": "Heliyon",
                "title": "FeptideDB: A web application for new bioactive peptides from food protein"
            },
            "pmcid": "PMC6656964",
            "pmid": "31372542"
        }
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Biochemistry",
            "uri": "http://edamontology.org/topic_3292"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        }
    ]
}