{
    "additionDate": "2017-04-25T12:30:04Z",
    "biotoolsCURIE": "biotools:drug2gene",
    "biotoolsID": "drug2gene",
    "credit": [
        {
            "email": "bertram.weiss@bayer.com",
            "name": "Bertram Weiss",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Free database unifying popular public resources to provide structured and organized information for identified and reported relations between genes/proteins and drugs/compounds. You can flag, comment and update relations, import new drug-gene relations valuable for a specific project. Gene orthology and similarity info is matched to certain entries assisting the prediction of new unreported drug-gene associations. Available links to the original source of the reported relation.",
    "documentation": [
        {
            "type": "General",
            "url": "http://www.metalife.com/products/metalife_trinity/drug2gene.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "homepage": "http://www.metalife.com/products/metalife_trinity/drug2gene.html",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:51Z",
    "name": "Drug2Gene",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: Information about drug-target relations is at the heart of drug discovery. There are now dozens of databases providing drug-target interaction data with varying scope, and focus. Therefore, and due to the large chemical space, the overlap of the different data sets is surprisingly small. As searching through these sources manually is cumbersome, time-consuming and error-prone, integrating all the data is highly desirable. Despite a few attempts, integration has been hampered by the diversity of descriptions of compounds, and by the fact that the reported activity values, coming from different data sets, are not always directly comparable due to usage of different metrics or data formats. Description: We have built Drug2Gene, a knowledge base, which combines the compound/drug-gene/protein information from 19 publicly available databases. A key feature is our rigorous unification and standardization process which makes the data truly comparable on a large scale, allowing for the first time effective data mining in such a large knowledge corpus. As of version 3.2, Drug2Gene contains 4,372,290 unified relations between compounds and their targets most of which include reported bioactivity data. We extend this set with putative (i.e. homology-inferred) relations where sufficient sequence homology between proteins suggests they may bind to similar compounds. Drug2Gene provides powerful search functionalities, very flexible export procedures, and a user-friendly web interface.Conclusions: Drug2Gene v3.2 has become a mature and comprehensive knowledge base providing unified, standardized drug-target related information gathered from publicly available data sources. It can be used to integrate proprietary data sets with publicly available data sets. Its main goal is to be a 'one-stop shop' to identify tool compounds targeting a given gene product or for finding all known targets of a drug. Drug2Gene with its integrated data set of public compound-target relations is freely accessible without restrictions at http://www.drug2gene.com. © 2014 Roider et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Roider H.G."
                    },
                    {
                        "name": "Pavlova N."
                    },
                    {
                        "name": "Kirov I."
                    },
                    {
                        "name": "Slavov S."
                    },
                    {
                        "name": "Slavov T."
                    },
                    {
                        "name": "Uzunov Z."
                    },
                    {
                        "name": "Weiss B."
                    }
                ],
                "citationCount": 15,
                "date": "2014-03-11T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Drug2Gene: An exhaustive resource to explore effectively the drug-target relation network"
            },
            "pmid": "24618344"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Drug development",
            "uri": "http://edamontology.org/topic_3373"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}