{
    "name": "globaltest", 
    "description": "Tests groups of covariates (or features) for association with a response variable. This package implements the test with diagnostic plots and multiple testing utilities, along with several functions to facilitate the use of this test for gene set testing of GO and KEGG terms.", 
    "homepage": "http://bioconductor.org/packages/release/bioc/html/globaltest.html", 
    "biotoolsID": "globaltest", 
    "biotoolsCURIE": "biotools:globaltest", 
    "version": [
        "5.28.0"
    ], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3224", 
                    "term": "Gene set testing"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool", 
        "Library"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3053", 
            "term": "Genetics"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "R"
    ], 
    "license": "GPL-2.0", 
    "collectionID": [
        "BioConductor"
    ], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [
        {
            "url": "http://bioconductor/packages/release/bioc/src/contrib/globaltest_5.28.0.tar.gz", 
            "type": "Source code", 
            "note": null, 
            "version": null
        }
    ], 
    "documentation": [
        {
            "url": "http://bioconductor.org/packages/release/bioc/html/globaltest.html", 
            "type": "Manual", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1002/gepi.21915", 
            "pmid": "26282998", 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "A Novel Statistic for Global Association Testing Based on Penalized Regression", 
                "abstract": "© 2015 Wiley Periodicals, Inc.Natural genetic structures like genes may contain multiple variants that work as a group to determine a biologic outcome. The effect of rare variants, mutations occurring in less than 5% of samples, is hypothesized to be explained best as groups collectively associated with a biologic function. Therefore, it is important to develop powerful association tests to identify a true association between an outcome of interest and a group of variants, in particular a group with many rare variants. In this article we first delineate a novel penalized regression-based global test for the association between sets of variants and a disease phenotype. Next, we use Genetic Analysis Workshop 18 (GAW18) data to assess the power of the new global association test to capture a relationship between an aggregated group of variants and a simulated hypertension status. Rare variant only, common variant only, and combined variant groups are studied. The power values are compared to those obtained from eight well-regarded global tests (Score, Sum, SSU, SSUw, UminP, aSPU, aSPUw, and sequence kernel association test (SKAT)) that do not use penalized regression and a set of tests using either the SSU or score statistics and least absolute shrinkage and selection operator penalty (LASSO) logistic regression. Association testing of rare variants with our method was the top performer when there was low linkage disequilibrium (LD) between and within causal variants. This was similarly true when simultaneously testing rare and common variants in low LD scenarios. Finally, our method was able to provide meaningful variant-specific association information.", 
                "date": "2015-01-01T00:00:00Z", 
                "citationCount": 1, 
                "authors": [
                    {
                        "name": "Austin E."
                    }, 
                    {
                        "name": "Shen X."
                    }, 
                    {
                        "name": "Pan W."
                    }
                ], 
                "journal": "Genetic Epidemiology"
            }
        }
    ], 
    "credit": [
        {
            "name": "Jelle Goeman", 
            "email": "j.j.goeman@lumc.nl", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "bioconductor_import", 
    "additionDate": "2017-01-17T15:02:15Z", 
    "lastUpdate": "2019-01-11T01:18:03Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}