{
    "additionDate": "2021-01-18T09:07:37Z",
    "biotoolsCURIE": "biotools:standep",
    "biotoolsID": "standep",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "nlewisres@ucsd.edu",
            "name": "Nathan E. Lewis",
            "orcidid": "https://orcid.org/0000-0001-7700-3654",
            "typeEntity": "Person"
        }
    ],
    "description": "Capturing transcriptomic variability improves context-specific metabolic models.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                },
                {
                    "term": "Expression profile clustering",
                    "uri": "http://edamontology.org/operation_0313"
                },
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                }
            ]
        }
    ],
    "homepage": "https://github.com/LewisLabUCSD/StanDep",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-02-21T16:24:10Z",
    "name": "StanDep",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1007764",
            "metadata": {
                "abstract": "© 2020 Joshi et al.Diverse algorithms can integrate transcriptomics with genome-scale metabolic models (GEMs) to build context-specific metabolic models. These algorithms require identification of a list of high confidence (core) reactions from transcriptomics, but parameters related to identification of core reactions, such as thresholding of expression profiles, can significantly change model content. Importantly, current thresholding approaches are burdened with setting singular arbitrary thresholds for all genes; thus, resulting in removal of enzymes needed in small amounts and even many housekeeping genes. Here, we describe StanDep, a novel heuristic method for using transcriptomics to identify core reactions prior to building contextspecific metabolic models. StanDep clusters gene expression data based on their expression pattern across different contexts and determines thresholds for each cluster using data-dependent statistics, specifically standard deviation and mean. To demonstrate the use of StanDep, we built hundreds of models for the NCI-60 cancer cell lines. These models successfully increased the inclusion of housekeeping reactions, which are often lost in models built using standard thresholding approaches. Further, StanDep also provided a transcriptomic explanation for inclusion of lowly expressed reactions that were otherwise only supported by model extraction methods. Our study also provides novel insights into how cells may deal with context-specific and ubiquitous functions.",
                "authors": [
                    {
                        "name": "Joshi C.J."
                    },
                    {
                        "name": "Schinn S.-M."
                    },
                    {
                        "name": "Richelle A."
                    },
                    {
                        "name": "Shamie I."
                    },
                    {
                        "name": "O'Rourke E.J."
                    },
                    {
                        "name": "Lewis N.E."
                    }
                ],
                "citationCount": 4,
                "date": "2020-05-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "StanDep: Capturing transcriptomic variability improves context-specific metabolic models"
            },
            "pmcid": "PMC7244210",
            "pmid": "32396573"
        }
    ],
    "topic": [
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ]
}