{
    "accessibility": [
        "Open access"
    ],
    "additionDate": "2019-06-20T15:34:00Z",
    "biotoolsCURIE": "biotools:LncVar",
    "biotoolsID": "LncVar",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "crs@sun5.ibp.ac.cn",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "chenxiaowei@moon.ibp.ac.cn",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Database of genetic variations associated with long noncoding genes.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bioinfo.ibp.ac.cn/LncVar/faqs.php"
        }
    ],
    "download": [
        {
            "type": "Biological data",
            "url": "http://bioinfo.ibp.ac.cn/LncVar/download.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Gene expression QTL analysis",
                    "uri": "http://edamontology.org/operation_3232"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.ibp.ac.cn/LncVar",
    "lastUpdate": "2019-06-20T15:34:00Z",
    "maturity": "Mature",
    "name": "LncVar",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1007/978-1-4939-8808-2_14",
            "metadata": {
                "abstract": "© Springer Science+Business Media, LLC, part of Springer Nature 2019.Long noncoding RNAs (lncRNAs) are pervasively transcribed in various species and play important roles in many biological processes. The biological functions of most lncRNAs remain to be explored. Previous studies have revealed that a large amount of disease-associated variations are located in the lncRNA gene regions. To evaluate the effects of genetic variations on lncRNAs, we constructed a database of genetic variations associated with long noncoding genes, LncVar. In this chapter, we describe the process of collecting data (including lncRNAs, transcription factor binding sites and m6A modification sites of lncRNAs, putatively translated open reading frames in lncRNAs) and steps of evaluating the effects of variations on the transcriptional regulation and modification of lncRNAs.",
                "authors": [
                    {
                        "name": "Chen X."
                    },
                    {
                        "name": "Hao Y."
                    },
                    {
                        "name": "Cui Y."
                    },
                    {
                        "name": "Fan Z."
                    },
                    {
                        "name": "Chen R."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Methods in Molecular Biology",
                "title": "LncVar: Deciphering genetic variations associated with long noncoding genes"
            },
            "pmid": "30539556",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/bioinformatics/btw581",
            "metadata": {
                "abstract": "© The Author 2016. Published by Oxford University Press. All rights reserved.Motivation: Long non-coding RNAs (lncRNAs) are essential in many molecular pathways, and are frequently associated with disease but the mechanisms of most lncRNAs have not yet been characterized. Genetic variations, including single nucleotide polymorphisms (SNPs) and structural variations, are widely distributed in the genome, including lncRNA gene regions. As the number of studies on lncRNAs grows rapidly, it is necessary to evaluate the effects of genetic variations on lncRNAs. Results: Here, we present LncVar, a database of genetic variation associated with long non-coding genes in six species. We collected lncRNAs from the NONCODE database, and evaluated their conservation. We systematically integrated transcription factor binding sites and m6A modification sites of lncRNAs and provided comprehensive effects of SNPs on transcription and modification of lncRNAs. We collected putatively translated open reading frames (ORFs) in lncRNAs, and identified both synonymous and non-synonymous SNPs in ORFs. We also collected expression quantitative trait loci of lncRNAs from the literature. Furthermore, we identified lncRNAs in CNV regions as prognostic biomarker candidates of cancers and predicted lncRNA gene fusion events from RNAseq data from cell lines. The LncVar database can be used as a resource to evaluate the effects of the variations on the biological function of lncRNAs.",
                "authors": [
                    {
                        "name": "Chen X."
                    },
                    {
                        "name": "Hao Y."
                    },
                    {
                        "name": "Cui Y."
                    },
                    {
                        "name": "Fan Z."
                    },
                    {
                        "name": "He S."
                    },
                    {
                        "name": "Luo J."
                    },
                    {
                        "name": "Chen R."
                    }
                ],
                "citationCount": 11,
                "date": "2017-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "LncVar: A database of genetic variation associated with long non-coding genes"
            },
            "pmid": "27605101",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application",
        "Database portal"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        }
    ]
}