{
    "additionDate": "2025-01-08T04:55:10.922667Z",
    "biotoolsCURIE": "biotools:diffcorr",
    "biotoolsID": "diffcorr",
    "credit": [
        {
            "email": "afukushima@kpu.ac.jp",
            "name": "Atsushi Fukushima",
            "orcidid": "http://orcid.org/0000-0001-9015-1694"
        }
    ],
    "description": "An R package to analyze and visualize differential correlations in biological networks. This package can explore differential correlations between 2 conditions in the context of post-genomics data types, namely transcriptomics and metabolomics. DiffCorr is simple to use in calculating differential correlations and is suitable for the first step towards inferring causal relationships and detecting biomarker candidates.",
    "documentation": [
        {
            "type": [
                "Quick start guide"
            ],
            "url": "https://cran.r-project.org/web/packages/DiffCorr/vignettes/DiffCorr.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://CRAN.R-project.org/package=DiffCorr",
    "language": [
        "R"
    ],
    "lastUpdate": "2025-01-08T05:23:17.072582Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/afukushima/DiffCorr"
        }
    ],
    "name": "DiffCorr",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "atfukush",
    "publication": [
        {
            "doi": "10.1016/j.gene.2012.11.028",
            "metadata": {
                "abstract": "Large-scale \"omics\" data, such as microarrays, can be used to infer underlying cellular regulatory networks in organisms, enabling us to better understand the molecular basis of disease and important traits. Correlation approaches, such as a hierarchical cluster analysis, have been widely used to analyze omics data. In addition to the changes in the mean levels of molecules in the omics data, it is important to know about the changes in the correlation relationship among molecules between 2 experimental conditions. The development of a tool to identify differential correlation patterns in omics data in an efficient and unbiased manner is therefore desirable. We developed the DiffCorr package, a simple method for identifying pattern changes between 2 experimental conditions in correlation networks, which builds on a commonly used association measure, such as Pearson's correlation coefficient. DiffCorr calculates correlation matrices for each dataset, identifies the first principal component-based \"eigen-molecules\" in the correlation networks, and tests differential correlation between the 2 groups based on Fisher's z-test. We illustrated its utility by demonstrating biologically relevant, differentially correlated molecules in transcriptome coexpression and metabolite-to-metabolite correlation networks. DiffCorr can explore differential correlations between 2 conditions in the context of post-genomics data types, namely transcriptomics and metabolomics. DiffCorr is simple to use in calculating differential correlations and is suitable for the first step towards inferring causal relationships and detecting biomarker candidates. The package can be downloaded from the following website: http://diffcorr.sourceforge.net/. © 2012 Elsevier B.V.",
                "authors": [
                    {
                        "name": "Fukushima A."
                    }
                ],
                "citationCount": 131,
                "date": "2013-04-10T00:00:00Z",
                "journal": "Gene",
                "title": "DiffCorr: An R package to analyze and visualize differential correlations in biological networks"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Omics",
            "uri": "http://edamontology.org/topic_3391"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "version": [
        "0.4.4"
    ]
}
