{
    "additionDate": "2021-06-14T13:06:39Z",
    "biotoolsCURIE": "biotools:bio-gats",
    "biotoolsID": "bio-gats",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "shoba.ranganathan@mq.edu.au",
            "name": "Shoba Ranganathan",
            "typeEntity": "Person"
        }
    ],
    "description": "Biophysical approach for GPCRs Automated Template Selection (Bio-GATS) is a tool for automated GPCR template selection through a biophysical approach for homology modeling.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                },
                {
                    "term": "Transmembrane protein prediction",
                    "uri": "http://edamontology.org/operation_0269"
                },
                {
                    "term": "Sequence classification",
                    "uri": "http://edamontology.org/operation_2995"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "https://github.com/amara86/Bio-GATS",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-08-13T10:39:17.349061Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/amara86/Bio-GATS/issues"
        }
    ],
    "name": "Bio-GATS",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3389/FMOLB.2021.617176",
            "metadata": {
                "abstract": "© Copyright © 2021 Jabeen, Vijayram and Ranganathan.G protein-coupled receptors (GPCRs) are the largest family of membrane proteins with more than 800 members. GPCRs are involved in numerous physiological functions within the human body and are the target of more than 30% of the United States Food and Drug Administration (FDA) approved drugs. At present, over 400 experimental GPCR structures are available in the Protein Data Bank (PDB) representing 76 unique receptors. The absence of an experimental structure for the majority of GPCRs demand homology models for structure-based drug discovery workflows. The generation of good homology models requires appropriate templates. The commonly used methods for template selection are based on sequence identity. However, there exists low sequence identity among the GPCRs. Sequences with similar patterns of hydrophobic residues are often structural homologs, even with low sequence identity. Extending this, we propose a biophysical approach for template selection based principally on hydrophobicity correspondence between the target and the template. Our approach takes into consideration other relevant parameters, including resolution, similarity within the orthosteric binding pocket of GPCRs, and structure completeness, for template selection. The proposed method was implemented in the form of a free tool called Bio-GATS, to provide the user with easy selection of the appropriate template for a query GPCR sequence. Bio-GATS was successfully validated with recent published benchmarking datasets. An application to an olfactory receptor to select an appropriate template has also been provided as a case study.",
                "authors": [
                    {
                        "name": "Jabeen A."
                    },
                    {
                        "name": "Vijayram R."
                    },
                    {
                        "name": "Ranganathan S."
                    }
                ],
                "date": "2021-04-07T00:00:00Z",
                "journal": "Frontiers in Molecular Biosciences",
                "title": "BIO-GATS: A Tool for Automated GPCR Template Selection Through a Biophysical Approach for Homology Modeling"
            },
            "pmcid": "PMC8059640",
            "pmid": "33898512",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Suite"
    ],
    "topic": [
        {
            "term": "Biophysics",
            "uri": "http://edamontology.org/topic_3306"
        },
        {
            "term": "Membrane and lipoproteins",
            "uri": "http://edamontology.org/topic_0820"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        }
    ]
}