
{
    "credit": [
        {
            "name": "George Kritikos",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://github.com/critichu"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://critichu.github.io/Iris/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Imaging",
                "uri": "http://edamontology.org/topic_3382"
            },
            {
                "term": "Microbiology",
                "uri": "http://edamontology.org/topic_3301"
            },
            {
                "term": "Genotype and phenotype",
                "uri": "http://edamontology.org/topic_0625"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2017 Macmillan Publishers Limited, part of Springer Nature. All rights reserved. Advances in our ability to systematically introduce and track controlled genetic variance in microorganisms have, in the past decade, fuelled high-throughput reverse genetics approaches. When coupled to quantitative readouts, such approaches are extremely powerful at elucidating gene function and providing insights into the underlying pathways and the overall cellular network organization. Yet, until now, all efforts to quantify microbial macroscopic phenotypes have been restricted to monitoring growth in a small number of model microorganisms. We have developed an image analysis software named Iris, which allows for systematic exploration of a number of orthogonal-to-growth processes, including biofilm formation, colony morphogenesis, envelope biogenesis, sporulation and reporter activity. In addition, Iris provides more sensitive growth measurements than currently available software and is compatible with a variety of different microorganisms, as well as with endpoint or kinetic data. We used Iris to reanalyse existing chemical genomics data in Escherichia coli and to perform proof-of-principle screens on colony biofilm formation and morphogenesis of different bacterial species and the pathogenic fungus Candida albicans. We thereby recapitulated existing knowledge but also identified a plethora of additional genes and pathways involved in both processes.",
            "authors": [
                "Kritikos G.",
                "Banzhaf M.",
                "Herrera-Dominguez L.",
                "Koumoutsi A.",
                "Wartel M.",
                "Zietek M.",
                "Typas A."
            ],
            "cit_count": 13,
            "doi": "10.1038/nmicrobiol.2017.14",
            "journal": "Nature Microbiology",
            "title": "A tool named Iris for versatile high-throughput phenotyping in microorganisms",
            "year": "2017-02-17"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:iris",
        "biotoolsID": "iris",
        "description": "Image processing software that automatically quantifies several features of microbial colonies in high throughput.",
        "homepage": "http://critichu.github.io/Iris/",
        "name": "Iris"
    }
}