{
    "additionDate": "2017-01-17T15:08:19Z",
    "biotoolsCURIE": "biotools:gprofiler",
    "biotoolsID": "gprofiler",
    "collectionID": [
        "GO Tools"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "email": "biit.support@ut.ee",
            "name": "Institute of Computer Science, University of Tartu",
            "typeEntity": "Institute",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://biit.cs.ut.ee/gprofiler/page/contact"
        },
        {
            "email": "biit.support@ut.ee",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Public web server with several tools to perform functional enrichment analyses and mine additional information about gene functions. The used data is synchronized with Ensembl database in quarterly updates.",
    "documentation": [
        {
            "type": "FAQ",
            "url": "https://biit.cs.ut.ee/gprofiler/page/faq"
        },
        {
            "type": "API documentation",
            "url": "https://biit.cs.ut.ee/gprofiler/page/apis"
        },
        {
            "type": "User manual",
            "url": "https://biit.cs.ut.ee/gprofiler/page/docs"
        },
        {
            "type": "Citation instructions",
            "url": "https://biit.cs.ut.ee/gprofiler/page/citing"
        },
        {
            "type": "User manual",
            "url": "https://biit.cs.ut.ee/gprofiler/page/r"
        }
    ],
    "download": [
        {
            "type": "Software package",
            "url": "https://pypi.python.org/pypi/gprofiler-official"
        },
        {
            "type": "Tool wrapper (Galaxy)",
            "url": "https://toolshed.g2.bx.psu.edu/repository?repository_id=2d3d786121020d7a"
        }
    ],
    "editPermission": {
        "authors": [
            "ELIXIR-EE",
            "JohanaK"
        ],
        "type": "group"
    },
    "elixirNode": [
        "Estonia"
    ],
    "elixirPlatform": [
        "Tools"
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "ID list",
                        "uri": "http://edamontology.org/data_2872"
                    },
                    "format": [
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                },
                {
                    "term": "Gene functional annotation",
                    "uri": "http://edamontology.org/operation_3672"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Over-representation data",
                        "uri": "http://edamontology.org/data_3753"
                    },
                    "format": [
                        {
                            "term": "PNG",
                            "uri": "http://edamontology.org/format_3603"
                        },
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        },
                        {
                            "term": "xls",
                            "uri": "http://edamontology.org/format_3468"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "ID list",
                        "uri": "http://edamontology.org/data_2872"
                    },
                    "format": [
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "https://biit.cs.ut.ee/gprofiler/",
    "lastUpdate": "2020-02-20T08:50:59.678803Z",
    "license": "Freeware",
    "link": [
        {
            "type": "Helpdesk",
            "url": "https://biit.cs.ut.ee/gprofiler/page/contact"
        },
        {
            "note": "Announcements of updates",
            "type": "Mailing list",
            "url": "https://lists.ut.ee/wws/subscribe/gprofiler.announcements"
        }
    ],
    "name": "g:Profiler",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "training_go_import",
    "publication": [
        {
            "doi": "10.1093/nar/gkw199",
            "metadata": {
                "abstract": "© The Author(s) 2016. Published by Oxford University Press on behalf of Nucleic Acids Research.Functional enrichment analysis is a key step in interpreting gene lists discovered in diverse high-throughput experiments. g:Profiler studies flat and ranked gene lists and finds statistically significant Gene Ontology terms, pathways and other gene function related terms. Translation of hundreds of gene identifiers is another core feature of g:Profiler. Since its first publication in 2007, our web server has become a popular tool of choice among basic and translational researchers. Timeliness is a major advantage of g:Profiler as genome and pathway information is synchronized with the Ensembl database in quarterly updates. g:Profiler supports 213 species including mammals and other vertebrates, plants, insects and fungi. The 2016 update of g:Profiler introduces several novel features. We have added further functional datasets to interpret gene lists, including transcription factor binding site predictions, Mendelian disease annotations, information about protein expression and complexes and gene mappings of human genetic polymorphisms. Besides the interactive web interface, g:Profiler can be accessed in computational pipelines using our R package, Python interface and BioJS component. g:Profiler is freely available at http://biit.cs.ut.ee/gprofiler/.",
                "authors": [
                    {
                        "name": "Reimand J."
                    },
                    {
                        "name": "Arak T."
                    },
                    {
                        "name": "Adler P."
                    },
                    {
                        "name": "Kolberg L."
                    },
                    {
                        "name": "Reisberg S."
                    },
                    {
                        "name": "Peterson H."
                    },
                    {
                        "name": "Vilo J."
                    }
                ],
                "citationCount": 414,
                "date": "2016-07-08T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "g:Profiler-a web server for functional interpretation of gene lists (2016 update)"
            },
            "version": "2016 update"
        },
        {
            "doi": "10.1093/nar/gkz369",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press on behalf of Nucleic Acids Research.Biological data analysis often deals with lists of genes arising from various studies. The g:Profiler toolset is widely used for finding biological categories enriched in gene lists, conversions between gene identifiers and mappings to their orthologs. The mission of g:Profiler is to provide a reliable service based on up-to-date high quality data in a convenient manner across many evidence types, identifier spaces and organisms. g:Profiler relies on Ensembl as a primary data source and follows their quarterly release cycle while updating the other data sources simultaneously. The current update provides a better user experience due to a modern responsive web interface, standardised API and libraries. The results are delivered through an interactive and configurable web design. Results can be downloaded as publication ready visualisations or delimited text files. In the current update we have extended the support to 467 species and strains, including vertebrates, plants, fungi, insects and parasites. By supporting user uploaded custom GMT files, g:Profiler is now capable of analysing data from any organism. All past releases are maintained for reproducibility and transparency. The 2019 update introduces an extensive technical rewrite making the services faster and more flexible. g:Profiler is freely available at https://biit.cs.ut.ee/gprofiler.",
                "authors": [
                    {
                        "name": "Raudvere U."
                    },
                    {
                        "name": "Kolberg L."
                    },
                    {
                        "name": "Kuzmin I."
                    },
                    {
                        "name": "Arak T."
                    },
                    {
                        "name": "Adler P."
                    },
                    {
                        "name": "Peterson H."
                    },
                    {
                        "name": "Vilo J."
                    }
                ],
                "citationCount": 27,
                "date": "2019-07-02T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "g:Profiler: a web server for functional enrichment analysis and conversions of gene lists (2019 update)"
            },
            "version": "2019 update"
        },
        {
            "doi": "10.1093/nar/gkm226",
            "metadata": {
                "abstract": "g:Profiler (http://biit.cs.ut.ee/gprofiler/) is a public web server for characterising and manipulating gene lists resulting from mining high-throughput genomic data. g:Profiler has a simple, user-friendly web interface with powerful visualisation for capturing Gene Ontology (GO), pathway, or transcription factor binding site enrichments down to individual gene levels. Besides standard multiple testing corrections, a new improved method for estimating the true effect of multiple testing over complex structures like GO has been introduced. Interpreting ranked gene lists is supported from the same interface with very efficient algorithms. Such ordered lists may arise when studying the most significantly affected genes from high-throughput data or genes co-expressed with the query gene. Other important aspects of practical data analysis are supported by modules tightly integrated with g:Profiler. These are: g:Convert for converting between different database identifiers; g:Orth for finding orthologous genes from other species; and g:Sorter for searching a large body of public gene expression data for co-expression. g:Profiler supports 31 different species, and underlying data is updated regularly from sources like the Ensembl database. Bioinformatics communities wishing to integrate with g:Profiler can use alternative simple textual outputs. © 2007 The Author(s).",
                "authors": [
                    {
                        "name": "Reimand J."
                    },
                    {
                        "name": "Kull M."
                    },
                    {
                        "name": "Peterson H."
                    },
                    {
                        "name": "Hansen J."
                    },
                    {
                        "name": "Vilo J."
                    }
                ],
                "citationCount": 414,
                "date": "2007-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "G:Profiler-a web-based toolset for functional profiling of gene lists from large-scale experiments"
            }
        },
        {
            "doi": "10.1093/nar/gkr378",
            "metadata": {
                "abstract": "Functional interpretation of candidate gene lists is an essential task in modern biomedical research. Here, we present the 2011 update of g:Profiler (http://biit.cs.ut.ee/gprofiler/), a popular collection of web tools for functional analysis. g:GOSt and g:Cocoa combine comprehensive methods for interpreting gene lists, ordered lists and list collections in the context of biomedical ontologies, pathways, transcription factor and microRNA regulatory motifs and protein-protein interactions. Additional tools, namely the biomolecule ID mapping service (g:Convert), gene expression similarity searcher (g:Sorter) and gene homology searcher (g:Orth) provide numerous ways for further analysis and interpretation. In this update, we have implemented several features of interest to the community: (i) functional analysis of single nucleotide polymorphisms and other DNA polymorphisms is supported by chromosomal queries; (ii) network analysis identifies enriched protein-protein interaction modules in gene lists; (iii) functional analysis covers human disease genes; and (iv) improved statistics and filtering provide more concise results. g:Profiler is a regularly updated resource that is available for a wide range of species, including mammals, plants, fungi and insects. © 2011 The Author(s).",
                "authors": [
                    {
                        "name": "Reimand J."
                    },
                    {
                        "name": "Arak T."
                    },
                    {
                        "name": "Vilo J."
                    }
                ],
                "citationCount": 341,
                "date": "2011-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "G:Profiler - A web server for functional interpretation of gene lists (2011 update)"
            },
            "version": "2011 update"
        }
    ],
    "toolType": [
        "Web application",
        "Suite"
    ],
    "topic": [
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Function analysis",
            "uri": "http://edamontology.org/topic_1775"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}