
{
    "credit": [
        {
            "email": "sylvia.richardson@mrc-bsu.cam.ac.uk",
            "name": "Sylvia Richardson",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://github.com/Bayesian-Omics"
        },
        {
            "email": "lb664@cam.ac.uk",
            "name": "Leonardo Bottolo",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/Bayesian-Omics/CHESS"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++"
        ],
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "Omics",
                "uri": "http://edamontology.org/topic_3391"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/mt-hess-simultaneous-association-detection-in-omics-datasets.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2015 The Author 2015. Published by Oxford University Press. Motivation: Analysing the joint association between a large set of responses and predictors is a fundamental statistical task in integrative genomics, exemplified by numerous expression Quantitative Trait Loci (eQTL) studies. Of particular interest are the so-called 'hotspots', important genetic variants that regulate the expression of many genes. Recently, attention has focussed on whether eQTLs are common to several tissues, cell-types or, more generally, conditions or whether they are specific to a particular condition. Results: We have implemented MT-HESS, a Bayesian hierarchical model that analyses the association between a large set of predictors, e.g. SNPs, and many responses, e.g. gene expression, in multiple tissues, cells or conditions. Our Bayesian sparse regression algorithm goes beyond 'one-at-a-time' association tests between SNPs and responses and uses a fully multivariate model search across all linear combinations of SNPs, coupled with a model of the correlation between condition/tissue-specific responses. In addition, we use a hierarchical structure to leverage shared information across different genes, thus improving the detection of hotspots. We show the increase of power resulting from our new approach in an extensive simulation study. Our analysis of two case studies highlights new hotspots that would remain undetected by standard approaches and shows how greater prediction power can be achieved when several tissues are jointly considered. Availability and implementation: C++ source code and documentation including compilation instructions are available under GNU licence at http://www.mrc-bsu.cam.ac.uk/software/.",
            "authors": [
                "Lewin A.",
                "Saadi H.",
                "Peters J.E.",
                "Moreno-Moral A.",
                "Lee J.C.",
                "Smith K.G.C.",
                "Petretto E.",
                "Bottolo L.",
                "Richardson S."
            ],
            "cit_count": 8,
            "journal": "Bioinformatics",
            "pmid": "26504141",
            "title": "MT-HESS: An efficient Bayesian approach for simultaneous association detection in OMICS datasets, with application to eQTL mapping in multiple tissues",
            "year": "2015-09-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:mt-hess",
        "biotoolsID": "mt-hess",
        "description": "Bayesain hierarchical model that analyses the association between a large set of predictors, e.g. SNPs (single nucleotide polymorphisms), and many responses, e.g. gene expression, in multiple tissues, cells or conditions.",
        "homepage": "https://github.com/Bayesian-Omics/CHESS",
        "name": "MT-HESS"
    }
}