{
    "additionDate": "2019-11-14T18:05:31Z",
    "biotoolsCURIE": "biotools:VIST",
    "biotoolsID": "VIST",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "leser@informatik.hu-berlin.de",
            "name": "Ulf Leser",
            "typeEntity": "Person"
        }
    ],
    "description": "> COMMON LINK WITH (PUB. & NAME DIFFERENT) bio.tools/geneview (INFORMATIK.HU-BERLIN.DE) | a Variant-Information Search Tool for precision oncology | The Variant Information Search Tool developed @ WBI",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Named-entity and concept recognition",
                    "uri": "http://edamontology.org/operation_3280"
                }
            ]
        }
    ],
    "homepage": "https://vist.informatik.hu-berlin.de/",
    "lastUpdate": "2019-11-14T18:05:31Z",
    "name": "VIST",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-2958-3",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Diagnosis and treatment decisions in cancer increasingly depend on a detailed analysis of the mutational status of a patient's genome. This analysis relies on previously published information regarding the association of variations to disease progression and possible interventions. Clinicians to a large degree use biomedical search engines to obtain such information; however, the vast majority of scientific publications focus on basic science and have no direct clinical impact. We develop the Variant-Information Search Tool (VIST), a search engine designed for the targeted search of clinically relevant publications given an oncological mutation profile. Results: VIST indexes all PubMed abstracts and content from ClinicalTrials.gov. It applies advanced text mining to identify mentions of genes, variants and drugs and uses machine learning based scoring to judge the clinical relevance of indexed abstracts. Its functionality is available through a fast and intuitive web interface. We perform several evaluations, showing that VIST's ranking is superior to that of PubMed or a pure vector space model with regard to the clinical relevance of a document's content. Conclusion: Different user groups search repositories of scientific publications with different intentions. This diversity is not adequately reflected in the standard search engines, often leading to poor performance in specialized settings. We develop a search engine for the specific case of finding documents that are clinically relevant in the course of cancer treatment. We believe that the architecture of our engine, heavily relying on machine learning algorithms, can also act as a blueprint for search engines in other, equally specific domains. VIST is freely available at https://vist.informatik.hu-berlin.de/.",
                "authors": [
                    {
                        "name": "Seva J."
                    },
                    {
                        "name": "Wiegandt D.L."
                    },
                    {
                        "name": "Gotze J."
                    },
                    {
                        "name": "Lamping M."
                    },
                    {
                        "name": "Rieke D."
                    },
                    {
                        "name": "Schafer R."
                    },
                    {
                        "name": "Jahnichen P."
                    },
                    {
                        "name": "Kittner M."
                    },
                    {
                        "name": "Pallarz S."
                    },
                    {
                        "name": "Starlinger J."
                    },
                    {
                        "name": "Keilholz U."
                    },
                    {
                        "name": "Leser U."
                    }
                ],
                "citationCount": 1,
                "date": "2019-08-16T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "VIST - A Variant-Information Search Tool for precision oncology"
            },
            "pmcid": "PMC6697931",
            "pmid": "31419935"
        }
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ]
}