{
    "additionDate": "2021-01-18T07:30:58Z",
    "biotoolsCURIE": "biotools:gsalign",
    "biotoolsID": "gsalign",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hsu@iis.sinica.edu.tw",
            "name": "Wen-Lian Hsu",
            "typeEntity": "Person"
        }
    ],
    "description": "An efficient sequence alignment tool for intra-species genomes.\n\nGSAlign: an ultra-fast sequence alignment algorithm for intra-species genome comparison.\n\nDevelopers: Dr. Hsin-Nan Lin and Dr. Wen-Lian Hsu Institute of Information Science, Academia Sinica, Taiwan.\n\nPersonal genomics and comparative genomics are two fields that are more and more important in clinical practices and genome researches.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome indexing",
                    "uri": "http://edamontology.org/operation_3211"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                },
                {
                    "term": "Genome comparison",
                    "uri": "http://edamontology.org/operation_3209"
                },
                {
                    "term": "Sequence alignment comparison",
                    "uri": "http://edamontology.org/operation_0259"
                },
                {
                    "term": "Indel detection",
                    "uri": "http://edamontology.org/operation_0452"
                }
            ]
        }
    ],
    "homepage": "https://github.com/hsinnan75/GSAlign",
    "language": [
        "C",
        "C++"
    ],
    "lastUpdate": "2021-01-25T11:34:57Z",
    "license": "MIT",
    "name": "GSAlign",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12864-020-6569-1",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Personal genomics and comparative genomics are becoming more important in clinical practice and genome research. Both fields require sequence alignment to discover sequence conservation and variation. Though many methods have been developed, some are designed for small genome comparison while some are not efficient for large genome comparison. Moreover, most existing genome comparison tools have not been evaluated the correctness of sequence alignments systematically. A wrong sequence alignment would produce false sequence variants. Results: In this study, we present GSAlign that handles large genome sequence alignment efficiently and identifies sequence variants from the alignment result. GSAlign is an efficient sequence alignment tool for intra-species genomes. It identifies sequence variations from the sequence alignments. We estimate performance by measuring the correctness of predicted sequence variations. The experiment results demonstrated that GSAlign is not only faster than most existing state-of-The-Art methods, but also identifies sequence variants with high accuracy. Conclusions: As more genome sequences become available, the demand for genome comparison is increasing. Therefore an efficient and robust algorithm is most desirable. We believe GSAlign can be a useful tool. It exhibits the abilities of ultra-fast alignment as well as high accuracy and sensitivity for detecting sequence variations.",
                "authors": [
                    {
                        "name": "Lin H.-N."
                    },
                    {
                        "name": "Hsu W.-L."
                    }
                ],
                "citationCount": 1,
                "date": "2020-02-24T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "GSAlign: An efficient sequence alignment tool for intra-species genomes"
            },
            "pmcid": "PMC7041101",
            "pmid": "32093618"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        }
    ],
    "validated": 1
}