{"collectionID": [], "accessibility": [], "topic": [{"term": "Small molecules", "uri": "http://edamontology.org/topic_0154"}, {"term": "Medicinal chemistry", "uri": "http://edamontology.org/topic_0209"}, {"term": "Drug discovery", "uri": "http://edamontology.org/topic_3336"}, {"term": "Molecular interactions, pathways and networks", "uri": "http://edamontology.org/topic_0602"}], "owner": "ELIXIR-EE", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": null, "note": null, "version": null, "pmid": "20430828", "type": null, "pmcid": null, "metadata": {"title": "PharmMapper server: A web server for potential drug target identification using pharmacophore mapping approach", "abstract": "In silico drug target identification, which includes many distinct algorithms for finding disease genes and proteins, is the first step in the drug discovery pipeline. When the 3D structures of the targets are available, the problem of target identification is usually converted to finding the best interaction mode between the potential target candidates and small molecule probes. Pharmacophore, which is the spatial arrangement of features essential for a molecule to interact with a specific target receptor, is an alternative method for achieving this goal apart from molecular docking method. PharmMapper server is a freely accessed web server designed to identify potential target candidates for the given small molecules (drugs, natural products or other newly discovered compounds with unidentified binding targets) using pharmacophore mapping approach. PharmMapper hosts a large, in-house repertoire of pharmacophore database (namely PharmTargetDB) annotated from all the targets information in TargetBank, BindingDB, DrugBank and potential drug target database, including over 7000 receptor-based pharmacophore models (covering over 1500 drug targets information). PharmMapper automatically finds the best mapping poses of the query molecule against all the pharmacophore models in PharmTargetDB and lists the top N best-fitted hits with appropriate target annotations, as well as respective molecule's aligned poses are presented. Benefited from the highly efficient and robust triangle hashing mapping method, PharmMapper bears high throughput ability and only costs 1 h averagely to screen the whole PharmTargetDB. The protocol was successful in finding the proper targets among the top 300 pharmacophore candidates in the retrospective benchmarking test of tamoxifen. PharmMapper is available at http://59.78.96.61/pharmmapper. © The Author(s) 2010. Published by Oxford University Press.", "citationCount": 279, "authors": [{"name": "Liu X."}, {"name": "Ouyang S."}, {"name": "Yu B."}, {"name": "Liu Y."}, {"name": "Huang K."}, {"name": "Gong J."}, {"name": "Zheng S."}, {"name": "Li Z."}, {"name": "Li H."}, {"name": "Jiang H."}], "date": "2010-04-29T00:00:00Z", "journal": "Nucleic Acids Research"}}], "homepage_status": 1, "credit": [], "biotoolsCURIE": "biotools:pharmmapper", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "http://59.78.96.61/pharmmapper", "function": [{"note": null, "input": [], "operation": [{"term": "Protein subcellular localisation prediction", "uri": "http://edamontology.org/operation_2489"}, {"term": "Protein interaction prediction", "uri": "http://edamontology.org/operation_2492"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:40Z", "otherID": [], "description": "Web server that identifies potential drug targets from its PharmTargetDB for a given input molecule. Potential targets are identified from a prediction of the spatial arrangement of features essential for a given molecule to interact with a target.", "toolType": ["Web application"], "editPermission": {"type": "private", "authors": []}, "language": [], "link": [], "biotoolsID": "pharmmapper", "additionDate": "2017-02-14T09:36:32Z", "name": "PharmMapper", "license": null, "documentation": [], "maturity": null, "confidence_flag": null, "operatingSystem": []}