{
    "additionDate": "2017-12-18T00:10:07Z",
    "biotoolsCURIE": "biotools:pcadmix",
    "biotoolsID": "pcadmix",
    "credit": [
        {
            "email": "cdbustam@stanford.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Method that estimates local ancestry via principal components analysis (PCA) using phased haplotypes.  The method considers data chromosome by chromosome.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://sites.google.com/site/pcadmix/home"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Principal component plotting",
                    "uri": "http://edamontology.org/operation_2939"
                },
                {
                    "term": "Ancestral reconstruction",
                    "uri": "http://edamontology.org/operation_3745"
                }
            ]
        }
    ],
    "homepage": "https://sites.google.com/site/pcadmix/home",
    "language": [
        "R",
        "C++",
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/pcadmix-1-0-local-ancestry-deconvolution.html"
        }
    ],
    "name": "PCAdmix",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1371/journal.pgen.1002397",
            "metadata": {
                "abstract": "North African populations are distinct from sub-Saharan Africans based on cultural, linguistic, and phenotypic attributes; however, the time and the extent of genetic divergence between populations north and south of the Sahara remain poorly understood. Here, we interrogate the multilayered history of North Africa by characterizing the effect of hypothesized migrations from the Near East, Europe, and sub-Saharan Africa on current genetic diversity. We present dense, genome-wide SNP genotyping array data (730,000 sites) from seven North African populations, spanning from Egypt to Morocco, and one Spanish population. We identify a gradient of likely autochthonous Maghrebi ancestry that increases from east to west across northern Africa; this ancestry is likely derived from \"back-to-Africa\" gene flow more than 12,000 years ago (ya), prior to the Holocene. The indigenous North African ancestry is more frequent in populations with historical Berber ethnicity. In most North African populations we also see substantial shared ancestry with the Near East, and to a lesser extent sub-Saharan Africa and Europe. To estimate the time of migration from sub-Saharan populations into North Africa, we implement a maximum likelihood dating method based on the distribution of migrant tracts. In order to first identify migrant tracts, we assign local ancestry to haplotypes using a novel, principal component-based analysis of three ancestral populations. We estimate that a migration of western African origin into Morocco began about 40 generations ago (approximately 1,200 ya); a migration of individuals with Nilotic ancestry into Egypt occurred about 25 generations ago (approximately 750 ya). Our genomic data reveal an extraordinarily complex history of migrations, involving at least five ancestral populations, into North Africa. © 2012 Henn et al.",
                "authors": [
                    {
                        "name": "Henn B.M."
                    },
                    {
                        "name": "Botigue L.R."
                    },
                    {
                        "name": "Gravel S."
                    },
                    {
                        "name": "Wang W."
                    },
                    {
                        "name": "Brisbin A."
                    },
                    {
                        "name": "Byrnes J.K."
                    },
                    {
                        "name": "Fadhlaoui-Zid K."
                    },
                    {
                        "name": "Zalloua P.A."
                    },
                    {
                        "name": "Moreno-Estrada A."
                    },
                    {
                        "name": "Bertranpetit J."
                    },
                    {
                        "name": "Bustamante C.D."
                    },
                    {
                        "name": "Comas D."
                    }
                ],
                "citationCount": 181,
                "date": "2012-01-01T00:00:00Z",
                "journal": "PLoS Genetics",
                "title": "Genomic ancestry of North Africans supports back-to-Africa migrations"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}