{
    "accessibility": "Open access",
    "additionDate": "2022-01-28T01:43:11.273842Z",
    "biotoolsCURIE": "biotools:snappnet",
    "biotoolsID": "snappnet",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "charles-elie.rabier@umontpellier.fr",
            "name": "Charles-Elie Rabier",
            "orcidid": "https://orcid.org/0000-0002-6736-877X",
            "typeEntity": "Person"
        },
        {
            "email": "celine.scornavacca@umontpellier.fr",
            "name": "Celine Scornavacca",
            "typeEntity": "Person"
        },
        {
            "name": "Fabio Pardi",
            "orcidid": "https://orcid.org/0000-0001-8084-1464"
        },
        {
            "name": "Marnus Stoltz",
            "orcidid": "https://orcid.org/0000-0002-5118-5223"
        }
    ],
    "description": "SnappNet is a new Bayesian method that directly relies on DNA sequences. Our method is implemented in BEAST 2 (Bouckaert et al., 2014) , an improved version of the popular version BEAST 1.x dedicated to Bayesian evolutionary analyses. Our SnappNet package is built on two BEAST packages, Snapp (Bryant et al, 2012), and SpeciesNetwork (Zhang et al., 2017). It incorporates the novel MCMC operators of SpeciesNetwork to move through the network space, and also benefits from operators specific to the mathematical model behind Snapp (e.g. population sizes, mutation rates ...) and extended to handle networks.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://charles-elie.rabier.pagesperso-orange.fr/doc/SnappNet.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic inference",
                    "uri": "http://edamontology.org/operation_0323"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Tree dating",
                    "uri": "http://edamontology.org/operation_3942"
                }
            ]
        }
    ],
    "homepage": "https://github.com/rabier/MySnappNet",
    "language": [
        "Java",
        "C++"
    ],
    "lastUpdate": "2022-01-28T01:43:11.276198Z",
    "license": "Not licensed",
    "link": [
        {
            "note": "For analyzing simulated data",
            "type": [
                "Repository"
            ],
            "url": "https://github.com/rabier/SimSnappNet"
        }
    ],
    "name": "SnappNet",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1008380",
            "metadata": {
                "abstract": "© 2021 Rabier et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.For various species, high quality sequences and complete genomes are nowadays available for many individuals. This makes data analysis challenging, as methods need not only to be accurate, but also time efficient given the tremendous amount of data to process. In this article, we introduce an efficient method to infer the evolutionary history of individuals under the multispecies coalescent model in networks (MSNC). Phylogenetic networks are an extension of phylogenetic trees that can contain reticulate nodes, which allow to model complex biological events such as horizontal gene transfer, hybridization and introgression. We present a novel way to compute the likelihood of biallelic markers sampled along genomes whose evolution involved such events. This likelihood computation is at the heart of a Bayesian network inference method called SNAPPNET, as it extends the SNAPP method inferring evolutionary trees under the multispecies coalescent model, to networks. SNAPPNET is available as a package of the well-known BEAST 2 software. Recently, the MCMC_BiMarkers method, implemented in PhyloNet, also extended SNAPP to networks. Both methods take biallelic markers as input, rely on the same model of evolution and sample networks in a Bayesian framework, though using different methods for computing priors. However, SNAPPNET relies on algorithms that are exponentially more timeefficient on non-trivial networks. Using simulations, we compare performances of SNAPPNET and MCMC_BiMarkers. We show that both methods enjoy similar abilities to recover simple networks, but SNAPPNET is more accurate than MCMC_BiMarkers on more complex network scenarios. Also, on complex networks, SNAPPNET is found to be extremely faster than MCMC_BiMarkers in terms of time required for the likelihood computation. We finally illustrate SNAPPNET performances on a rice data set. SNAPPNET infers a scenario that is consistent with previous results and provides additional understanding of rice evolution.",
                "authors": [
                    {
                        "name": "Rabier C.-E."
                    },
                    {
                        "name": "Berry V."
                    },
                    {
                        "name": "Stoltz M."
                    },
                    {
                        "name": "Santos J.D."
                    },
                    {
                        "name": "Wang W."
                    },
                    {
                        "name": "Glaszmann J.-C."
                    },
                    {
                        "name": "Pardi F."
                    },
                    {
                        "name": "Scornavacca C."
                    }
                ],
                "date": "2021-09-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "On the inference of complex phylogenetic networks by Markov Chain Monte-Carlo"
            },
            "pmcid": "PMC8445492",
            "pmid": "34478440"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Phylogenomics",
            "uri": "http://edamontology.org/topic_0194"
        }
    ]
}