{
    "accessibility": "Open access",
    "additionDate": "2023-02-23T22:10:57.134188Z",
    "biotoolsCURIE": "biotools:lnm",
    "biotoolsID": "lnm",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "chengliangyin@163.com",
            "name": "Chengliang Yin",
            "typeEntity": "Person"
        },
        {
            "email": "dxzhao@jlu.edu.cn",
            "name": "Dongxu Zhao",
            "typeEntity": "Person"
        },
        {
            "email": "zhouhui@tmu.edu.cnn",
            "name": "Hui Zhou",
            "typeEntity": "Person"
        },
        {
            "name": "Wenle Li",
            "typeEntity": "Person"
        }
    ],
    "description": "Early distinction of lymph node metastasis in patients with soft tissue sarcoma and individualized survival prediction using the online available nomograms.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Incident curve plotting",
                    "uri": "http://edamontology.org/operation_3503"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://tyxupup.shinyapps.io/OSofSTSpatientswithLNM/",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T14:58:52.485997Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://share.streamlit.io/liuwencai4/renal_lnm/main/renal_lnm.py"
        },
        {
            "type": [
                "Other"
            ],
            "url": "https://tyxupup.shinyapps.io/CSSofSTSpatientswithLNM/"
        },
        {
            "type": [
                "Other"
            ],
            "url": "https://tyxupup.shinyapps.io/probabilityofLNMforSTSpatients/"
        }
    ],
    "name": "LNM",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/fendo.2022.1054358",
            "metadata": {
                "abstract": "Background: Lymph node metastasis (LNM) is associated with the prognosis of patients with kidney cancer. This study aimed to provide reliable machine learning-based (ML-based) models to predict the probability of LNM in kidney cancer. Methods: Data on patients diagnosed with kidney cancer were extracted from the Surveillance, Epidemiology and Outcomes (SEER) database from 2010 to 2017, and variables were filtered by least absolute shrinkage and selection operator (LASSO), univariate and multivariate logistic regression analyses. Statistically significant risk factors were used to build predictive models. We used 10-fold cross-validation in the validation of the model. The area under the receiver operating characteristic curve (AUC) was used to assess the performance of the model. Correlation heat maps were used to investigate the correlation of features using permutation analysis to assess the importance of predictors. Probability density functions (PDFs) and clinical utility curves (CUCs) were used to determine clinical utility thresholds. Results: The training cohort of this study included 39,016 patients, and the validation cohort included 771 patients. In the two cohorts, 2544 (6.5%) and 66 (8.1%) patients had LNM, respectively. Pathological grade, liver metastasis, M stage, primary site, T stage, and tumor size were independent predictive factors of LNM. In both model validation, the XGB model significantly outperformed any of the machine learning models with an AUC value of 0.916.A web calculator (https://share.streamlit.io/liuwencai4/renal_lnm/main/renal_lnm.py) were built based on the XGB model. Based on the PDF and CUC, we suggested 54.6% as a threshold probability for guiding the diagnosis of LNM, which could distinguish about 89% of LNM patients. Conclusions: The predictive tool based on machine learning can precisely indicate the probability of LNM in kidney cancer patients and has a satisfying application prospect in clinical practice.",
                "authors": [
                    {
                        "name": "Feng X."
                    },
                    {
                        "name": "Hong T."
                    },
                    {
                        "name": "Li T."
                    },
                    {
                        "name": "Li W."
                    },
                    {
                        "name": "Li W."
                    },
                    {
                        "name": "Liu W."
                    },
                    {
                        "name": "Song Y."
                    },
                    {
                        "name": "Xu C."
                    },
                    {
                        "name": "Yang B."
                    },
                    {
                        "name": "Yin C."
                    },
                    {
                        "name": "Zhou H."
                    }
                ],
                "citationCount": 14,
                "date": "2022-11-18T00:00:00Z",
                "journal": "Frontiers in Endocrinology",
                "title": "Development and validation of a machine learning model to predict the risk of lymph node metastasis in renal carcinoma"
            },
            "pmcid": "PMC9716136",
            "pmid": "36465636"
        },
        {
            "doi": "10.3389/fonc.2022.959804",
            "metadata": {
                "abstract": "Background: The presence of metastatic tumor cells in regional lymph nodes is considered as a significant indicator for inferior prognosis. This study aimed to construct some predictive models to quantify the probability of lymph node metastasis (LNM) and survival rate of patients with soft tissue sarcoma (STS) with LNM. Methods: Research data were extracted from the Surveillance, Epidemiology, and End Results (SEER) database between 2004 and 2017, and data of patients with STS from our medical institution were collected to form an external testing set. Univariate and multivariate logistic regression analyses were used to determine the independent risk factors for developing LNM. On the basis of the identified variables, we developed a diagnostic nomogram to predict the risk of LNM in patients with STS. Those patients with STS presenting with LNM were retrieved to build a cohort for identifying the independent prognostic factors through univariate and multivariate Cox regression analysis. Then, two nomograms incorporating the independent prognostic predictors were developed to predict the overall survival (OS) and cancer-specific survival (CSS) for patients with STS with LNM. Kaplan–Meier (K-M) survival analysis was conducted to study the survival difference. Moreover, validations of these nomograms were performed by the receiver operating characteristic curves, the area under the curve, calibration curves, and the decision curve analysis (DCA). Results: A total of 16,601 patients with STS from the SEER database were enrolled in our study, of which 659 (3.97%) had LNM at the initial diagnosis. K-M survival analysis indicated that patients with LNM had poorer survival rate. Sex, histology, primary site, grade, M stage, and T stage were found to be independently related with development of LNM in patients with STS. Age, grade, histology, M stage, T stage, chemotherapy, radiotherapy, and surgery were identified as the independent prognostic factors for OS of patients with STS with LNM, and age, grade, M stage, T stage, radiotherapy, and surgery were determined as the independent prognostic factors for CSS. Subsequently, we constructed three nomograms, and their online versions are as follows: https://tyxupup.shinyapps.io/probabilityofLNMforSTSpatients/, https://tyxupup.shinyapps.io/OSofSTSpatientswithLNM/, and https://tyxupup.shinyapps.io/CSSofSTSpatientswithLNM/. The areas under the curve (AUCs) of diagnostic nomogram were 0.839 in the training set, 0.811 in the testing set, and 0.852 in the external testing set. For prognostic nomograms, the AUCs of 24-, 36-, and 48-month OS were 0.820, 0.794, and 0.792 in the training set and 0.759, 0.728, and 0.775 in the testing set, respectively; the AUCs of 24-, 36-, and 48-month CSS were 0.793, 0.777, and 0.775 in the training set and 0.775, 0.744, and 0.738 in the testing set, respectively. Furthermore, calibration curves suggested that the predicted values were consistent with the actual values. For the DCA, our nomograms showed a superior net benefit across a wider scale of threshold probabilities for the prediction of risk and survival rate for patients with STS with LNM. Conclusion: These newly proposed nomograms promise to be useful tools in predicting the risk of LNM for patients with STS and individualized survival prediction for patients with STS with LNM, which may help to guide clinical practice.",
                "authors": [
                    {
                        "name": "Cui Y."
                    },
                    {
                        "name": "Gong Y."
                    },
                    {
                        "name": "Jiang L."
                    },
                    {
                        "name": "Pi Y."
                    },
                    {
                        "name": "Tong Y."
                    },
                    {
                        "name": "Zhao D."
                    }
                ],
                "citationCount": 3,
                "date": "2022-12-07T00:00:00Z",
                "journal": "Frontiers in Oncology",
                "title": "Early distinction of lymph node metastasis in patients with soft tissue sarcoma and individualized survival prediction using the online available nomograms: A population-based analysis"
            },
            "pmcid": "PMC9767978",
            "pmid": "36568161"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        },
        {
            "term": "Urology and nephrology",
            "uri": "http://edamontology.org/topic_3422"
        }
    ]
}
