{
    "accessibility": "Open access",
    "additionDate": "2023-03-18T09:05:19.317528Z",
    "biotoolsCURIE": "biotools:dockey",
    "biotoolsID": "dockey",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Kelei Zhao"
        }
    ],
    "description": "An integrated graphic user interface tool for molecular docking and virtual screening.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://dockey.readthedocs.io/en/latest/"
        }
    ],
    "download": [
        {
            "type": "Downloads page",
            "url": "https://github.com/lmdu/dockey/releases"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/lmdu/dockey",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:50:22.991369Z",
    "license": "MIT",
    "name": "Dockey",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Debojyati",
    "publication": [
        {
            "doi": "10.1093/bib/bbad047",
            "metadata": {
                "abstract": "Molecular docking is a structure-based and computer-aided drug design approach that plays a pivotal role in drug discovery and pharmaceutical research. AutoDock is the most widely used molecular docking tool for study of protein–ligand interactions and virtual screening. Although many tools have been developed to streamline and automate the AutoDock docking pipeline, some of them still use outdated graphical user interfaces and have not been updated for a long time. Meanwhile, some of them lack cross-platform compatibility and evaluation metrics for screening lead compound candidates. To overcome these limitations, we have developed Dockey, a flexible and intuitive graphical interface tool with seamless integration of several useful tools, which implements a complete docking pipeline covering molecular sanitization, molecular preparation, paralleled docking execution, interaction detection and conformation visualization. Specifically, Dockey can detect the non-covalent interactions between small molecules and proteins and perform cross-docking between multiple receptors and ligands. It has the capacity to automatically dock thousands of ligands to multiple receptors and analyze the corresponding docking results in parallel. All the generated data will be kept in a project file that can be shared between any systems and computers with the pre-installation of Dockey. We anticipate that these unique characteristics will make it attractive for researchers to conduct large-scale molecular docking without complicated operations, particularly for beginners. Dockey is implemented in Python and freely available at https://github.com/lmdu/dockey.",
                "authors": [
                    {
                        "name": "Chu Y."
                    },
                    {
                        "name": "Du L."
                    },
                    {
                        "name": "Geng C."
                    },
                    {
                        "name": "Huang T."
                    },
                    {
                        "name": "Tang J."
                    },
                    {
                        "name": "Zeng Q."
                    },
                    {
                        "name": "Zhao K."
                    }
                ],
                "citationCount": 15,
                "date": "2023-03-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "Dockey: a modern integrated tool for large-scale molecular docking and virtual screening"
            },
            "pmid": "36764832"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
