{
    "accessibility": "Open access",
    "additionDate": "2022-05-12T19:35:32.150319Z",
    "biotoolsCURIE": "biotools:drr4covid",
    "biotoolsID": "drr4covid",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "aeople@126.com",
            "name": "Xiaoqiong Li",
            "typeEntity": "Person"
        },
        {
            "name": "Pengyi Zhang"
        },
        {
            "name": "Xiaoying Tang"
        },
        {
            "name": "Yulin Deng"
        },
        {
            "name": "Yunxin Zhong"
        }
    ],
    "description": "Learning Automated COVID-19 Infection Segmentation From Digitally Reconstructed Radiographs.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image annotation",
                    "uri": "http://edamontology.org/operation_3553"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/PengyiZhang/DRR4Covid",
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2022-05-12T19:35:49.383924Z",
    "license": "MIT",
    "name": "DRR4Covid",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1109/ACCESS.2020.3038279",
            "metadata": {
                "abstract": "© 2013 IEEE.Automated infection measurement and COVID-19 diagnosis based on Chest X-ray (CXR) imaging is important for faster examination, where infection segmentation is an essential step for assessment and quantification. However, due to the heterogeneity of X-ray imaging and the difficulty of annotating infected regions precisely, learning automated infection segmentation on CXRs remains a challenging task. We propose a novel approach, called DRR4Covid, to learn COVID-19 infection segmentation on CXRs from digitally reconstructed radiographs (DRRs). DRR4Covid consists of an infection-aware DRR generator, a segmentation network, and a domain adaptation module. Given a labeled Computed Tomography scan, the infection-aware DRR generator can produce infection-aware DRRs with pixel-level annotations of infected regions for training the segmentation network. The domain adaptation module is designed to enable the segmentation network trained on DRRs to generalize to CXRs. The statistical analyses made on experiment results have indicated that our infection-aware DRRs are significantly better than standard DRRs in learning COVID-19 infection segmentation (p < 0.05) and the domain adaptation module can improve the infection segmentation performance on CXRs significantly (p < 0.05). Without using any annotations of CXRs, our network has achieved a classification score of (Accuracy: 0.949, AUC: 0.987, F1-score: 0.947) and a segmentation score of (Accuracy: 0.956, AUC: 0.980, F1-score: 0.955) on a test set with 558 normal cases and 558 positive cases. Besides, by adjusting the strength of radiological signs of COVID-19 infection in infection-aware DRRs, we estimate the detection limit of X-ray imaging in detecting COVID-19 infection. The estimated detection limit, measured by the percent volume of the lung that is infected by COVID-19, is 19.43% ± 16.29%, and the estimated lower bound of infected voxel contribution rate for significant radiological signs of COVID-19 infection is 20.0%. Our codes are made publicly available at https://github.com/PengyiZhang/DRR4Covid.",
                "authors": [
                    {
                        "name": "Deng Y."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Tang X."
                    },
                    {
                        "name": "Zhang P."
                    },
                    {
                        "name": "Zhong Y."
                    }
                ],
                "citationCount": 2,
                "date": "2020-01-01T00:00:00Z",
                "journal": "IEEE Access",
                "title": "Drr4covid: Learning Automated COVID-19 Infection Segmentation from Digitally Reconstructed Radiographs"
            },
            "pmcid": "PMC8545269",
            "pmid": "34812368"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ]
}
