{
    "accessibility": "Open access",
    "additionDate": "2022-03-23T17:37:11.268805Z",
    "biotoolsCURIE": "biotools:phylobayesmpi",
    "biotoolsID": "phylobayesmpi",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "description": "A Bayesian software for phylogenetic reconstruction using mixture models",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/bayesiancook/pbmpi/blob/master/pb_mpiManual1.8.pdf"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/bayesiancook/pbmpi/releases/tag/v1.8c"
        }
    ],
    "editPermission": {
        "authors": [
            "sergitobara"
        ],
        "type": "group"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence",
                        "uri": "http://edamontology.org/data_2044"
                    },
                    "format": [
                        {
                            "term": "PHYLIP format",
                            "uri": "http://edamontology.org/format_1997"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Phylogenetic reconstruction",
                    "uri": "http://edamontology.org/operation_3478"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bayesiancook/pbmpi",
    "language": [
        "C++"
    ],
    "lastUpdate": "2022-07-05T16:36:36.916251Z",
    "license": "GPL-2.0",
    "name": "phylobayesmpi",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/sysbio/syt022",
            "metadata": {
                "abstract": "Modeling across site variation of the substitution process is increasingly recognized as important for obtaining more accurate phylogenetic reconstructions. Both finite and infinite mixture models have been proposed and have been shown to significantly improve on classical single-matrix models. Compared with their finite counterparts, infinite mixtures have a greater expressivity.However, they are computationally more challenging. This has resulted in practical compromises in the design of infinite mixture models. In particular, a fast but simplified version of a Dirichlet process model over equilibrium frequency profiles implemented in PhyloBayes has often been used in recent phylogenomics studies, while more refined model structures, more realistic and empirically more fit, have been practically out of reach. We introduce a message passing interface version ofPhyloBayes,implementing the Dirichletprocess mixture models aswell as more classical empirical matrices and finite mixtures. The parallelization is made efficient thanks to the combination of two algorithmic strategies: a partial Gibbs sampling update of the tree topology and the use of a truncated stick-breaking representation for the Dirichlet process prior. The implementation shows close to linear gains in computational speed for up to 64 cores, thus allowing faster phylogenetic reconstruction under complex mixture models. PhyloBayes MPI is freely available from our website www.phylobayes.org. [Bayesian inference; Dirichlet process; mixture models; phylogenetics; phylogenomics.] © The Author(s) 2013.",
                "authors": [
                    {
                        "name": "Lartillot N."
                    },
                    {
                        "name": "Richer J."
                    },
                    {
                        "name": "Rodrigue N."
                    },
                    {
                        "name": "Stubbs D."
                    }
                ],
                "citationCount": 431,
                "date": "2013-07-01T00:00:00Z",
                "journal": "Systematic Biology",
                "title": "Phylobayes mpi: Phylogenetic reconstruction with infinite mixtures of profiles in a parallel environment"
            },
            "pmid": "23564032"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
