{"credit":[{"email":"mapmanserver@googlemail.com","name":"MapMan Team","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.mpimp-golm.mpg.de/2168/en"}],"documentation":[{"type":"GENERAL","url":"http://mapman.gabipd.org/mapman-download"}],"function":[{"operation":[{"term":"Visualisation","uri":"http://edamontology.org/operation_0337"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Desktop application"],"topic":[{"term":"Systems biology","uri":"http://edamontology.org/topic_2259"},{"term":"Gene expression","uri":"http://edamontology.org/topic_0203"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/mapman-3-5-1-displays-large-datasets-diagrams-metabolic-pathways.html"}],"publication":[{"abstract":"MAPMAN is a user-driven tool that displays large data sets onto diagrams of metabolic pathways or other processes. SCAVENGER modules assign the measured parameters to hierarchical categories (formed 'BINs', 'subBINs'). A first build of TRANSCRIPTSCAVENGER groups genes on the Arabidopsis Affymetrix 22K array into >200 hierarchical categories, providing a breakdown of central metabolism (for several pathways, down to the single enzyme level), and an overview of secondary metabolism and cellular processes. METABOLITE-SCAVENGER groups hundreds of metabolites into pathways or groups of structurally related compounds. An IMAGEANNOTATOR module uses these groupings to organise and display experimental data sets onto diagrams of the users' choice. A modular structure allows users to edit existing categories, add new categories and develop SCAVENGER modules for other sorts of data. MAPMAN is used to analyse two sets of 22K Affymetrix arrays that investigate the response of Arabidopsis rosettes to low sugar: one investigates the response to a 6-h extension of the night, and the other compares wild-type Columbia-0 (Col-0) and the starchless pgm mutant (plastid phosphoglucomutase) at the end of the night. There were qualitatively similar responses in both treatments. Many genes involved in photosynthesis, nutrient acquisition, amino acid, nucleotide, lipid and cell wall synthesis, cell wall modification, and RNA and protein synthesis were repressed. Many genes assigned to amino acid, nucleotide, lipid and cell wall breakdown were induced. Changed expression of genes for trehalose metabolism point to a role for trehalose-6-phosphate (Tre6P) as a starvation signal. Widespread changes in the expression of genes encoding receptor kinases, transcription factors, components of signalling pathways, proteins involved in post-translational modification and turn-over, and proteins involved in the synthesis and sensing of cytokinins, abscisic acid (ABA) and ethylene revealing large-scale rewiring of the regulatory network is an early response to sugar depletion.","authors":["Thimm O.","Blasing O.","Gibon Y.","Nagel A.","Meyer S.","Kruger P.","Selbig J.","Muller L.A.","Rhee S.Y.","Stitt M."],"cit_count":1784,"journal":"Plant Journal","pmid":"14996223","title":"MAPMAN: A user-driven tool to display genomics data sets onto diagrams of metabolic pathways and other biological processes","year":"2004-03-01"}],"summary":{"biotoolsCURIE":"biotools:mapman","biotoolsID":"mapman","description":"User-driven tool that displays large datasets (e.g. gene expression data from Arabidopsis Affymetrix arrays) onto diagrams of metabolic pathways or other processes.","homepage":"http://mapman.gabipd.org/web/guest/home","name":"MapMan"}}