
{
    "credit": [
        {
            "email": "probelynx-mail@sfu.ca",
            "name": "ProbeLynx team",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://koch.pathogenomics.ca/probelynx/contact.php"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://koch.pathogenomics.ca/probelynx/documentation.php"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Microarray probe design",
                    "uri": "http://edamontology.org/operation_0309"
                }
            ]
        }
    ],
    "labels": {
        "maturity": "Legacy",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Probes and primers",
                "uri": "http://edamontology.org/topic_0632"
            },
            {
                "term": "Microarray experiment",
                "uri": "http://edamontology.org/topic_3518"
            },
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            },
            {
                "term": "Small molecules",
                "uri": "http://edamontology.org/topic_0154"
            }
        ]
    },
    "publication": [
        {
            "abstract": "As genome sequence data and gene prediction improve, probes developed for a given microarray experiment should be continuously re-evaluated for their specificity for given genes. ProbeLynx (www.pathogenomics.ca/probelynx) is a new web servicewhichusescurrentgenomicsequenceinformation to re-examine microarray probe specificity and provide annotation updates relevant to determining which gene(s) and transcript(s) are associated with a given probe. Probe sequences (either oligonucleotide- or cDNA-based) are uploaded in FASTA format and the results returned as a tab-delimited flat file for insertion into a spreadsheet application or database management system for further analysis. ProbeLynx has been initially developed to focus on arrays derived from human, mouse, chicken and bovine genomes, but may be expanded to handle other genomic datasets. ProbeLynx offers microarray users the important ability to continuously assess the potential of a probe to cross-hybridize to paralogous genes and the suitability of a given probe to investigate a transcript of interest. By also including the latest gene function annotation information in the output, ProbeLynx provides the critical first step in updating microarray data annotation. © Oxford University Press 2004; all rights reserved.",
            "authors": [
                "Roche F.M.",
                "Hokamp K.",
                "Acab M.",
                "Babiuk L.A.",
                "Hancock R.E.W.",
                "Brinkman F.S.L."
            ],
            "cit_count": 10,
            "journal": "Nucleic Acids Research",
            "pmid": "15215432",
            "title": "ProbeLynx: A tool for updating the association of microarray probes to genes",
            "year": "2004-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:probelynx",
        "biotoolsID": "probelynx",
        "description": "Using current releases of genomic sequence data, this tool allows users to assess the specificity of probe sequences used for microarray experiments. The user provides probe sequences in FASTA or tab-delimited format, and the tool reports specificity information for each probe and functional annotations from Ensembl or TIGR for each probe target hit.",
        "homepage": "http://www.pathogenomics.ca/probelynx",
        "name": "ProbeLynx"
    }
}