{"credit":[{"name":"Department of Molecular Medicine, University of Padua","typeEntity":"Institute","typeRoles":["Provider"],"url":"http://www.medicinamolecolare.unipd.it/"},{"name":"ELIXIR-ITA-PADOVA","typeEntity":"Project","typeRoles":["Support"],"url":"http://elixir.bio.unipd.it/"},{"email":"stefano.toppo@unipd.it","name":"Stefano Toppo","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://www.medcomp.medicina.unipd.it/funtaxis/help/"}],"function":[{"operation":[{"term":"Taxonomic classification","uri":"http://edamontology.org/operation_3460"}]}],"labels":{"maturity":"Mature","operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Taxonomy","uri":"http://edamontology.org/topic_0637"}]},"publication":[{"abstract":"The advances of omics technologies have triggered the production of an enormous volume of data coming from thousands of species. Meanwhile, joint international efforts like the Gene Ontology (GO) consortium have worked to provide functional information for a vast amount of proteins. With these data available, we have developed FunTaxIS, a tool that is the first attempt to infer functional taxonomy (i.e. how functions are distributed over taxa) combining functional and taxonomic information. FunTaxIS is able to define a taxon specific functional space by exploiting annotation frequencies in order to establish if a function can or cannot be used to annotate a certain species. The tool generates constraints between GO terms and taxa and then propagates these relations over the taxonomic tree and the GO graph. Since these constraints nearly cover the whole taxonomy, it is possible to obtain the mapping of a function over the taxonomy. FunTaxIS can be used to make functional comparative analyses among taxa, to detect improper associations between taxa and functions, and to discover how functional knowledge is either distributed or missing. A benchmark test set based on six different model species has been devised to get useful insights on the generated taxonomic rules.","authors":["Falda M.","Lavezzo E.","Fontana P.","Bianco L.","Berselli M.","Formentin E.","Toppo S."],"cit_count":1,"doi":"10.1038/srep31971","journal":"Scientific Reports","title":"Eliciting the Functional Taxonomy from protein annotations and taxa","type":"Primary","year":"2016-08-18"}],"summary":{"biotoolsCURIE":"biotools:funtaxis","biotoolsID":"funtaxis","description":"Web server attempts to automatically infer which functional specificities and commonalities exist among different taxa.","homepage":"http://www.medcomp.medicina.unipd.it/funtaxis","name":"Funtaxis","version":["1.0"]}}