{
    "additionDate": "2017-01-13T13:16:04Z",
    "biotoolsCURIE": "biotools:readdepth",
    "biotoolsID": "readdepth",
    "credit": [
        {
            "email": "amilosav@bcm.edu",
            "name": "Aleksandar Milosavljevic",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Detects copy number aberrations in deep sequencing data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/chrisamiller/readDepth/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequencing quality control",
                    "uri": "http://edamontology.org/operation_3218"
                }
            ]
        }
    ],
    "homepage": "https://github.com/chrisamiller/readDepth",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:53Z",
    "name": "ReadDepth",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Copy number alterations are important contributors to many genetic diseases, including cancer. We present the readDepth package for R, which can detect these aberrations by measuring the depth of coverage obtained by massively parallel sequencing of the genome. In addition to achieving higher accuracy than existing packages, our tool runs much faster by utilizing multi-core architectures to parallelize the processing of these large data sets. In contrast to other published methods, readDepth does not require the sequencing of a reference sample, and uses a robust statistical model that accounts for overdispersed data. It includes a method for effectively increasing the resolution obtained from low-coverage experiments by utilizing breakpoint information from paired end sequencing to do positional refinement. We also demonstrate a method for inferring copy number using reads generated by whole-genome bisulfite sequencing, thus enabling integrative study of epigenomic and copy number alterations. Finally, we apply this tool to two genomes, showing that it performs well on genomes sequenced to both low and high coverage. The readDepth package runs on Linux and MacOSX, is released under the Apache 2.0 license, and is available at http://code.google.com/p/readdepth/. © 2011 Ren et al.",
                "authors": [
                    {
                        "name": "Coarfa C."
                    },
                    {
                        "name": "Hampton O."
                    },
                    {
                        "name": "Miller C.A."
                    },
                    {
                        "name": "Milosavljevic A."
                    }
                ],
                "citationCount": 141,
                "date": "2011-02-09T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "ReadDepth: A parallel R package for detecting copy number alterations from short sequencing reads"
            },
            "pmid": "21305028"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Data quality management",
            "uri": "http://edamontology.org/topic_3572"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
