{
    "accessibility": [],
    "additionDate": "2017-08-03T19:02:43Z",
    "biotoolsCURIE": "biotools:tgs-tb",
    "biotoolsID": "tgs-tb",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": "info@nih.go.jp",
            "gridid": null,
            "name": null,
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://gph.niid.go.jp/tgs-tb/"
        }
    ],
    "description": "An all-in-one web-based tool for genotyping Mtb to facilitate multiple genotyping platforms using NGS for spoligotyping and the detection of phylogenies with core genomic SNVs, IS6110 insertion sites, and 43 customized loci for variable number tandem repeat (VNTR) through a user-friendly, simple click interface.",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "https://gph.niid.go.jp/tgs-tb/"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ],
            "output": []
        }
    ],
    "homepage": "https://gph.niid.go.jp/tgs-tb/",
    "homepage_status": 0,
    "language": [],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "license": null,
    "link": [
        {
            "note": null,
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/tgs-tb-total-genotyping-solution-for-mycobacterium-tuberculosis.html"
        }
    ],
    "maturity": null,
    "name": "TGS-TB",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": null,
            "metadata": {
                "abstract": "© 2016 Sekizuka et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited. Whole-genome sequencing (WGS) with next-generation DNA sequencing (NGS) is an increasingly accessible and affordable method for genotyping hundreds of Mycobacterium tuberculosis (Mtb) isolates, leading to more effective epidemiological studies involving single nucleotide variations (SNVs) in core genomic sequences based on molecular evolution. We developed an all-in-one web-based tool for genotyping Mtb, referred to as the Total Genotyping Solution for TB (TGS-TB), to facilitate multiple genotyping platforms using NGS for spoligotyping and the detection of phylogenies with core genomic SNVs, IS6110 insertion sites, and 43 customized loci for variable number tandem repeat (VNTR) through a user-friendly, simple click interface. This methodology is implemented with a KvarQ script to predict MTBC lineages/sublineages and potential antimicrobial resistance. Seven Mtb isolates (JP01 to JP07) in this study showing the same VNTR profile were accurately discriminated through median-joining network analysis using SNVs unique to those isolates. An additional IS6110 insertion was detected in one of those isolates as supportive genetic information in addition to core genomic SNVs. The results of in silico analyses using TGS-TB are consistent with those obtained using conventional molecular genotyping methods, suggesting that NGS short reads could provide multiple genotypes to discriminate multiple strains of Mtb, although longer NGS reads (≥300-mer) will be required for full genotyping on the TGS-TB web site. Most available short reads (∼100-mer) can be utilized to discriminate the isolates based on the core genome phylogeny. TGS-TB provides a more accurate and discriminative strain typing for clinical and epidemiological investigations; NGS strain typing offers a total genotyping solution for Mtb outbreak and surveillance. TGS-TB web site: https://gph.niid.go.jp/tgs-tb/.",
                "authors": [
                    {
                        "name": "Sekizuka T."
                    },
                    {
                        "name": "Yamashita A."
                    },
                    {
                        "name": "Murase Y."
                    },
                    {
                        "name": "Iwamoto T."
                    },
                    {
                        "name": "Mitarai S."
                    },
                    {
                        "name": "Kato S."
                    },
                    {
                        "name": "Kuroda M."
                    }
                ],
                "citationCount": 28,
                "date": "2015-11-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "TGS-TB: Total genotyping solution for Mycobacterium tuberculosis using short-read whole-genome sequencing"
            },
            "note": null,
            "pmcid": null,
            "pmid": "26565975",
            "type": null,
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1,
    "version": []
}