{
    "accessibility": "Open access",
    "additionDate": "2017-03-27T12:32:23Z",
    "biotoolsCURIE": "biotools:greenphyldb",
    "biotoolsID": "greenphyldb",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "m.rouard@cgiar.org",
            "name": "Mathieu Rouard",
            "orcidid": "https://orcid.org/0000-0003-0284-1885",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "v.guignon@cgiar.org",
            "name": "Valentin Guignon"
        }
    ],
    "description": "A database designed for comparative and functional genomics based on complete genomes. It contains full genomes of members of the plantae kingdom, ranging from algae to angiosperms, automatically clustered into gene families. Gene families are manually annotated and then analyzed phylogenetically in order to elucidate orthologous and paralogous relationships. The database offers various lists of gene families including plant, phylum and species specific gene families.",
    "editPermission": {
        "authors": [
            "mrouard"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence clustering",
                    "uri": "http://edamontology.org/operation_0291"
                },
                {
                    "term": "Phylogenetic tree analysis (gene family prediction)",
                    "uri": "http://edamontology.org/operation_0553"
                },
                {
                    "term": "Sequence motif analysis",
                    "uri": "http://edamontology.org/operation_2404"
                },
                {
                    "term": "Gene functional annotation",
                    "uri": "http://edamontology.org/operation_3672"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Protein alignment",
                        "uri": "http://edamontology.org/data_3154"
                    }
                },
                {
                    "data": {
                        "term": "Phylogenetic tree",
                        "uri": "http://edamontology.org/data_0872"
                    }
                },
                {
                    "data": {
                        "term": "Sequence search results",
                        "uri": "http://edamontology.org/data_0857"
                    }
                }
            ]
        }
    ],
    "homepage": "http://www.greenphyl.org/",
    "lastUpdate": "2020-06-16T10:55:25Z",
    "maturity": "Mature",
    "name": "GreenPhylDB",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mrouard",
    "publication": [
        {
            "metadata": {
                "abstract": "GreenPhylDB is a database designed for comparative and functional genomics based on complete genomes. Version 2 now contains sixteen full genomes of members of the plantae kingdom, ranging from algae to angiosperms, automatically clustered into gene families. Gene families are manually annotated and then analyzed phylogenetically in order to elucidate orthologous and paralogous relationships. The database offers various lists of gene families including plant, phylum and species specific gene families. For each gene cluster or gene family, easy access to gene composition, protein domains, publications, external links and orthologous gene predictions is provided. Web interfaces have been further developed to improve the navigation through information related to gene families. New analysis tools are also available, such as a gene family ontology browser that facilitates exploration. GreenPhylDB is a component of the South Green Bioinformatics Platform (http:// southgreen.cirad.fr/) and is accessible at http:// greenphyl.cirad.fr. It enables comparative genomics in a broad taxonomy context to enhance the understanding of evolutionary processes and thus tends to speed up gene discovery. © The Author(s) 2010.",
                "authors": [
                    {
                        "name": "Rouard M."
                    },
                    {
                        "name": "Guignon V."
                    },
                    {
                        "name": "Aluome C."
                    },
                    {
                        "name": "Laporte M.-A."
                    },
                    {
                        "name": "Droc G."
                    },
                    {
                        "name": "Walde C."
                    },
                    {
                        "name": "Zmasek C.M."
                    },
                    {
                        "name": "Perin C."
                    },
                    {
                        "name": "Conte M.G."
                    }
                ],
                "citationCount": 86,
                "date": "2011-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "GreenPhylDB v2.0: Comparative and functional genomics in plants"
            },
            "pmid": "20864446"
        },
        {
            "doi": "10.1093/nar/gkm934",
            "metadata": {
                "abstract": "GreenPhylDB (http://greenphyl.cirad.fr) is a comprehensive platform designed to facilitate comparative functional genomics in Oryza sativa and Arabidopsis thaliana genomes. The main functions of GreenPhylDB are to assign O. sativa and A. thaliana sequences to gene families using a semi-automatic clustering procedure and to create 'orthologous' groups using a phylogenomic approach. To date, GreenPhylDB comprises the most complete list of plant gene families, which have been manually curated (6421 families). GreenPhylDB also contains all of the phylogenomic relationships computed for 4375 families. A total of 492 TAIR, 1903 InterPro and 981 KEGG families and subfamilies were manually curated using the clusters created with the TribeMCL software. GreenPhylDB integrates information from several other databases including UniProt, KEGG, InterPro, TAIR and TIGR. Several entry points can be used to display phylogenomic relationships for A. thaliana or O. sativa sequences, using TAIR, TIGR gene ID, family name, InterPro, gene alias, UniProt or protein/nucleic sequence. Finally, a powerful phylogenomics tool, GreenPhyl Ortholog Search Tool (GOST), was incorporated into GreenPhylDB to predict orthologous relationships between O. sativa/A. thaliana protein(s) and sequences from other plant species. © 2007 The Author(s).",
                "authors": [
                    {
                        "name": "Conte M.G."
                    },
                    {
                        "name": "Gaillard S."
                    },
                    {
                        "name": "Lanau N."
                    },
                    {
                        "name": "Rouard M."
                    },
                    {
                        "name": "Perin C."
                    }
                ],
                "citationCount": 63,
                "date": "2008-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "GreenPhylDB: A database for plant comparative genomics"
            }
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1,
    "version": [
        "v4"
    ]
}