
{
    "credit": [
        {
            "email": "akittas@gmail.com",
            "name": "Aristotelis Kittas",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://bitbucket.org/akittas/cytoasp"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java",
            "Python"
        ],
        "license": "MIT",
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Systems biology",
                "uri": "http://edamontology.org/topic_2259"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Data visualisation",
                "uri": "http://edamontology.org/topic_0092"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2015 Kittas et al. Background: Qualitative reasoning frameworks, such as the Sign Consistency Model (SCM), enable modelling regulatory networks to check whether observed behaviour can be explained or if unobserved behaviour can be predicted. The BioASP software collection offers ideal tools for such analyses. Additionally, the Cytoscape platform can offer extensive functionality and visualisation capabilities. However, specialist programming knowledge is required to use BioASP and no methods exist to integrate both of these software platforms effectively. Results: We report the implementation of CytoASP, an app that allows the use of BioASP for influence graph consistency checking, prediction and repair operations through Cytoscape. While offering inherent benefits over traditional approaches using BioASP, it provides additional advantages such as customised visualisation of predictions and repairs, as well as the ability to analyse multiple networks in parallel, exploiting multi-core architecture. We demonstrate its usage in a case study of a yeast genetic network, and highlight its capabilities in reasoning over regulatory networks. Conclusion: We have presented a user-friendly Cytoscape app for the analysis of regulatory networks using BioASP. It allows easy integration of qualitative modelling, combining the functionality of BioASP with the visualisation and processing capability in Cytoscape, and thereby greatly simplifying qualitative network modelling, promoting its use in relevant projects.",
            "authors": [
                "Kittas A.",
                "Barozet A.",
                "Sereshti J.",
                "Grabe N.",
                "Tsoka S."
            ],
            "cit_count": 0,
            "doi": "10.1186/s12918-015-0179-6",
            "journal": "BMC Systems Biology",
            "title": "CytoASP: A Cytoscape app for qualitative consistency reasoning, prediction and repair in biological networks",
            "year": "2015-07-11"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:cytoasp",
        "biotoolsID": "cytoasp",
        "description": "A Cytoscape app for qualitative consistency analysis, prediction and repair in biological networks.",
        "homepage": "https://bitbucket.org/akittas/cytoasp",
        "name": "CytoASP"
    }
}