{
    "accessibility": [
        "Open access"
    ],
    "additionDate": "2018-06-25T11:37:39Z",
    "biotoolsCURIE": "biotools:bowhead",
    "biotoolsID": "bowhead",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "linding@lindinglab.org",
            "name": "Rune Linding",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A package for analyzing cell velocity from time series of wound healing experiments.",
    "documentation": [
        {
            "type": "General",
            "url": "https://bowhead.lindinglab.org/"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://gitlab.com/engel/bowhead"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Cell migration track image",
                        "uri": "http://edamontology.org/data_3449"
                    },
                    "format": [
                        {
                            "term": "Image format",
                            "uri": "http://edamontology.org/format_3547"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Cell migration analysis",
                    "uri": "http://edamontology.org/operation_3446"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Report",
                        "uri": "http://edamontology.org/data_2048"
                    }
                }
            ]
        }
    ],
    "homepage": "https://bowhead.lindinglab.org/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "Bowhead",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": "10.1371/journal.pcbi.1005900",
            "metadata": {
                "abstract": "© 2018 Engel et al.Cell migration is a central biological process that requires fine coordination of molecular events in time and space. A deregulation of the migratory phenotype is also associated with pathological conditions including cancer where cell motility has a causal role in tumor spreading and metastasis formation. Thus cell migration is of critical and strategic importance across the complex disease spectrum as well as for the basic understanding of cell phenotype. Experimental studies of the migration of cells in monolayers are often conducted with ‘wound healing’ assays. Analysis of these assays has traditionally relied on how the wound area changes over time. However this method does not take into account the shape of the wound. Given the many options for creating a wound healing assay and the fact that wound shape invariably changes as cells migrate this is a significant flaw. Here we present a novel software package for analyzing concerted cell velocity in wound healing assays. Our method encompasses a wound detection algorithm based on cell confluency thresholding and employs a Bayesian approach in order to estimate concerted cell velocity with an associated likelihood. We have applied this method to study the effect of siRNA knockdown on the migration of a breast cancer cell line and demonstrate that cell velocity can track wound healing independently of wound shape and provides a more robust quantification with significantly higher signal to noise ratios than conventional analyses of wound area. The software presented here will enable other researchers in any field of cell biology to quantitatively analyze and track live cell migratory processes and is therefore expected to have a significant impact on the study of cell migration, including cancer relevant processes. Installation instructions, documentation and source code can be found at http://bowhead.lindinglab.science licensed under GPLv3.",
                "authors": [
                    {
                        "name": "Engel M."
                    },
                    {
                        "name": "Longden J."
                    },
                    {
                        "name": "Ferkinghoff-Borg J."
                    },
                    {
                        "name": "Robin X."
                    },
                    {
                        "name": "Saginc G."
                    },
                    {
                        "name": "Linding R."
                    }
                ],
                "date": "2018-01-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Bowhead: Bayesian modelling of cell velocity during concerted cell migration"
            }
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Regenerative medicine",
            "uri": "http://edamontology.org/topic_3395"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}