{
    "additionDate": "2021-01-20T10:58:08Z",
    "biotoolsCURIE": "biotools:cellrouter",
    "biotoolsID": "cellrouter",
    "collectionID": [
        "Rare Disease"
    ],
    "confidence_flag": "tool",
    "description": "Trajectory Algorithms to Infer Stem Cell Fate Decisions.\n\nNew version available! Please, check our updated tutorial. Updates include:.\n\nRaw count/UMI data can be provided as input.\n\nPerform quality control on genes and cells.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                },
                {
                    "term": "Simulation analysis",
                    "uri": "http://edamontology.org/operation_0244"
                },
                {
                    "term": "Trajectory visualization",
                    "uri": "http://edamontology.org/operation_3890"
                }
            ]
        }
    ],
    "homepage": "https://github.com/edroaldo/cellrouter",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-05-13T06:34:07Z",
    "name": "CellRouter",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1007/978-1-4939-9224-9_9",
            "metadata": {
                "abstract": "© Springer Science+Business Media, LLC, part of Springer Nature 2019.Single-cell trajectory analysis is an active research area in single-cell genomics aiming at developing sophisticated algorithms to reconstruct complex cell-state transition trajectories. Here, we present a step-by-step protocol to use CellRouter, a multifaceted single-cell analysis platform that integrates subpopulation identification, gene regulatory networks, and trajectory inference to precisely and flexibly reconstruct complex single-cell trajectories. Subpopulations are either user-defined or identified by a graph-clustering approach in which a k-nearest neighbor graph (kNN) is created from cell-to-cell distances in a low-dimensional embedding. Edges in this graph are weighted by network similarity metrics (e.g., Jaccard index) to robustly encode phenotypic relatedness, creating a representation of single-cell transcriptomes suitable for community detection algorithms to identify clusters of densely connected cells. This subpopulation structure represents a map of putative cell-state transitions. CellRouter implements a flow network algorithm to explore this map and reconstruct cell-state transitions in complex single-cell, multidimensional omics datasets. We describe a step-by-step application of CellRouter to hematopoietic stem and progenitor cell differentiation toward four major lineages-erythrocytes, megakaryocytes, monocytes, and granulocytes-to demonstrate key components of CellRouter for single-cell trajectory analysis.",
                "authors": [
                    {
                        "name": "Lummertz da Rocha E."
                    },
                    {
                        "name": "Malleshaiah M."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Methods in Molecular Biology",
                "title": "Trajectory algorithms to infer stem cell fate decisions"
            },
            "pmid": "31062311"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
