{
    "additionDate": "2021-01-18T12:20:14Z",
    "biotoolsCURIE": "biotools:qcssmdhomo",
    "biotoolsID": "qcssmdhomo",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "douglaszhang@um.edu.mo",
            "name": "Xiaohua Douglas Zhang",
            "typeEntity": "Person"
        },
        {
            "email": "heping.zhang@yale.edu",
            "name": "Heping Zhang",
            "typeEntity": "Person"
        }
    ],
    "description": "Issues Of Z-factor and an approach to avoid them for quality control in high-throughput screening studies.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Karena6688/qcSSMDhomo",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-31T11:52:07Z",
    "name": "qcSSMDhomo",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA1049",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: High-throughput screening (HTS) is a vital automation technology in biomedical research in both industry and academia. The well-known Z-factor has been widely used as a gatekeeper to assure assay quality in an HTS study. However, many researchers and users may not have realized that Z-factor has major issues. Results: In this article, the following four major issues are explored and demonstrated so that researchers may use the Z-factor appropriately. First, the Z-factor violates the Pythagorean theorem of statistics. Second, there is no adjustment of sampling error in the application of the Z-factor for quality control (QC) in HTS studies. Third, the expectation of the sample-based Z-factor does not exist. Fourth, the thresholds in the Z-factor-based criterion lack a theoretical basis. Here, an approach to avoid these issues was proposed and new QC criteria under homoscedasticity were constructed so that researchers can choose a statistically grounded criterion for QC in the HTS studies. We implemented this approach in an R package and demonstrated its utility in multiple CRISPR/CAS9 or siRNA HTS studies.",
                "authors": [
                    {
                        "name": "Zhang X.D."
                    },
                    {
                        "name": "Wang D."
                    },
                    {
                        "name": "Sun S."
                    },
                    {
                        "name": "Zhang H."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Issues of Z-factor and an approach to avoid them for quality control in high-throughput screening studies"
            },
            "pmid": "33346821"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Quality affairs",
            "uri": "http://edamontology.org/topic_3393"
        }
    ]
}