{
    "accessibility": [],
    "additionDate": "2015-01-22T11:40:38Z",
    "biotoolsCURIE": "biotools:bonb",
    "biotoolsID": "bonb",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": null,
            "gridid": null,
            "name": "ELIXIR-ITA-PADOVA",
            "note": null,
            "orcidid": null,
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ],
            "url": null
        },
        {
            "email": "francesco.sambo@dei.unipd.it",
            "gridid": null,
            "name": "Francesco Sambo",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.dei.unipd.it/~sambofra"
        }
    ],
    "description": "Software for genetic marker selection and subjects classification from the simultaneous analysis of genome-wide SNP data. It is based on the Naive Bayes classification framework, enriched by three main features: bootstrap aggregating of an ensemble of Naive Bayes classifiers, a novel strategy for ranking and selecting the attributes used by each classifier in the ensemble and a permutation-based procedure for selecting significant biomarkers.",
    "documentation": [],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": "(BoNB) is a software for genetic marker selection and subjects classification from the simultaneous analysis of case-control genome-wide SNP data.",
            "operation": [
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://sysbiobig.dei.unipd.it/?q=Software#Bonb",
    "homepage_status": 0,
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:53Z",
    "license": "GPL-3.0",
    "link": [],
    "maturity": null,
    "name": "BoNB",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "ELIXIR-ITA-PADOVA",
    "publication": [
        {
            "doi": "10.1186/1471-2105-13-S14-S2",
            "metadata": {
                "abstract": "Background: Multifactorial diseases arise from complex patterns of interaction between a set of genetic traits and the environment. To fully capture the genetic biomarkers that jointly explain the heritability component of a disease, thus, all SNPs from a genome-wide association study should be analyzed simultaneously. Results: In this paper, we present Bag of Naïve Bayes (BoNB), an algorithm for genetic biomarker selection and subjects classification from the simultaneous analysis of genome-wide SNP data. BoNB is based on the Naïve Bayes classification framework, enriched by three main features: bootstrap aggregating of an ensemble of Naïve Bayes classifiers, a novel strategy for ranking and selecting the attributes used by each classifier in the ensemble and a permutation-based procedure for selecting significant biomarkers, based on their marginal utility in the classification process. BoNB is tested on the Wellcome Trust Case-Control study on Type 1 Diabetes and its performance is compared with the ones of both a standard Naïve Bayes algorithm and HyperLASSO, a penalized logistic regression algorithm from the state-of-the-art in simultaneous genome-wide data analysis. Conclusions: The significantly higher classification accuracy obtained by BoNB, together with the significance of the biomarkers identified from the Type 1 Diabetes dataset, prove the effectiveness of BoNB as an algorithm for both classification and biomarker selection from genome-wide SNP data.Availability: Source code of the BoNB algorithm is released under the GNU General Public Licence and is available at http://www.dei.unipd.it/~sambofra/bonb.html. © 2012 Sambo et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Sambo F."
                    },
                    {
                        "name": "Trifoglio E."
                    },
                    {
                        "name": "Di Camillo B."
                    },
                    {
                        "name": "Toffolo G.M."
                    },
                    {
                        "name": "Cobelli C."
                    }
                ],
                "citationCount": 16,
                "date": "2012-09-07T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Bag of Naïve Bayes: Biomarker selection and classification from genome-wide SNP data"
            },
            "note": null,
            "pmcid": null,
            "pmid": null,
            "type": "Primary",
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        }
    ],
    "validated": 1,
    "version": [
        "1.2"
    ]
}