{
    "additionDate": "2024-04-19T10:41:09.190574Z",
    "biotoolsCURIE": "biotools:vibes",
    "biotoolsID": "vibes",
    "confidence_flag": "high",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "twheeler@arizona.edu",
            "name": "Travis J. Wheeler",
            "typeEntity": "Person"
        }
    ],
    "description": "Workflow for annotating and visualizing viral sequences integrated into bacterial genomes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/TravisWheelerLab/VIBES",
    "language": [
        "Perl",
        "Python"
    ],
    "lastUpdate": "2024-04-19T10:41:09.193087Z",
    "license": "BSD-3-Clause",
    "name": "VIBES",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/nargab/lqae030",
            "metadata": {
                "abstract": "Bacteriophages are viruses that infect bacteria. Many bacteriophages integrate their genomes into the bacterial chromosome and become prophages. Prophages may substantially burden or benefit host bacteria fitness, acting in some cases as parasites and in others as mutualists. Some prophages have been demonstrated to increase host virulence. The increasing ease of bacterial genome sequencing provides an opportunity to deeply explore prophage prevalence and insertion sites. Here we present VIBES (Viral Integrations in Bacterial genomES), a workflow intended to automate prophage annotation in complete bacterial genome sequences. VIBES provides additional context to prophage annotations by annotating bacterial genes and viral proteins in user-provided bacterial and viral genomes. The VIBES pipeline is implemented as a Nextflow-driven workflow, providing a simple, unified interface for execution on local, cluster and cloud computing environments. For each step of the pipeline, a container including all necessary software dependencies is provided. VIBES produces results in simple tab-separated format and generates intuitive and interactive visualizations for data exploration. Despite VIBES's primary emphasis on prophage annotation, its generic alignment-based design allows it to be deployed as a general-purpose sequence similarity search manager. We demonstrate the utility of the VIBES prophage annotation workflow by searching for 178 Pf phage genomes across 1072 Pseudomonas spp. genomes.",
                "authors": [
                    {
                        "name": "Copeland C.J."
                    },
                    {
                        "name": "Roddy J.W."
                    },
                    {
                        "name": "Schmidt A.K."
                    },
                    {
                        "name": "Secor P.R."
                    },
                    {
                        "name": "Wheeler T.J."
                    }
                ],
                "date": "2024-06-01T00:00:00Z",
                "journal": "NAR Genomics and Bioinformatics",
                "title": "VIBES: a workflow for annotating and visualizing viral sequences integrated into bacterial genomes"
            }
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Computer science",
            "uri": "http://edamontology.org/topic_3316"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
