{
    "additionDate": "2024-06-12T11:53:54.372718Z",
    "biotoolsCURIE": "biotools:cosap",
    "biotoolsID": "cosap",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "baysanm@itu.edu.tr",
            "name": "Mehmet Baysan",
            "typeEntity": "Person"
        }
    ],
    "description": "Comparative Sequencing Analysis Platform.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Variant classification",
                    "uri": "http://edamontology.org/operation_3225"
                },
                {
                    "term": "Variant filtering",
                    "uri": "http://edamontology.org/operation_3675"
                }
            ]
        }
    ],
    "homepage": "https://cosap.bio",
    "lastUpdate": "2024-06-12T11:53:54.375116Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://cosap.bio/portal"
        }
    ],
    "name": "COSAP",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/s12859-024-05756-z",
            "metadata": {
                "abstract": "Background: Recent improvements in sequencing technologies enabled detailed profiling of genomic features. These technologies mostly rely on short reads which are merged and compared to reference genome for variant identification. These operations should be done with computers due to the size and complexity of the data. The need for analysis software resulted in many programs for mapping, variant calling and annotation steps. Currently, most programs are either expensive enterprise software with proprietary code which makes access and verification very difficult or open-access programs that are mostly based on command-line operations without user interfaces and extensive documentation. Moreover, a high level of disagreement is observed among popular mapping and variant calling algorithms in multiple studies, which makes relying on a single algorithm unreliable. User-friendly open-source software tools that offer comparative analysis are an important need considering the growth of sequencing technologies. Results: Here, we propose Comparative Sequencing Analysis Platform (COSAP), an open-source platform that provides popular sequencing algorithms for SNV, indel, structural variant calling, copy number variation, microsatellite instability and fusion analysis and their annotations. COSAP is packed with a fully functional user-friendly web interface and a backend server which allows full independent deployment for both individual and institutional scales. COSAP is developed as a workflow management system and designed to enhance cooperation among scientists with different backgrounds. It is publicly available at https://cosap.bio and https://github.com/MBaysanLab/cosap/. The source code of the frontend and backend services can be found at https://github.com/MBaysanLab/cosap-webapi/ and https://github.com/MBaysanLab/cosap_frontend/ respectively. All services are packed as Docker containers as well. Pipelines that combine algorithms can be customized and new algorithms can be added with minimal coding through modular structure. Conclusions: COSAP simplifies and speeds up the process of DNA sequencing analyses providing commonly used algorithms for SNV, indel, structural variant calling, copy number variation, microsatellite instability and fusion analysis as well as their annotations. COSAP is packed with a fully functional user-friendly web interface and a backend server which allows full independent deployment for both individual and institutional scales. Standardized implementations of popular algorithms in a modular platform make comparisons much easier to assess the impact of alternative pipelines which is crucial in establishing reproducibility of sequencing analyses.",
                "authors": [
                    {
                        "name": "Bakisli B."
                    },
                    {
                        "name": "Baysan M."
                    },
                    {
                        "name": "Cinal O."
                    },
                    {
                        "name": "Emul A.A."
                    },
                    {
                        "name": "Ergun M.A."
                    }
                ],
                "date": "2024-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "COSAP: Comparative Sequencing Analysis Platform"
            },
            "pmcid": "PMC10967217",
            "pmid": "38532317"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Copy number variation",
            "uri": "http://edamontology.org/topic_3958"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
