{
    "accessibility": "Open access",
    "additionDate": "2019-08-11T17:10:47Z",
    "biotoolsCURIE": "biotools:ABPS",
    "biotoolsID": "ABPS",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "schutz@mathgen.ch",
            "name": "Frédéric Schütz",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "R Package for Calculating the Abnormal Blood Profile Score.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://cran.r-project.org/web/packages/ABPS/ABPS.pdf"
        }
    ],
    "download": [
        {
            "type": "Software package",
            "url": "https://cran.r-project.org/src/contrib/ABPS_0.3.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://cran.r-project.org/package=ABPS",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-06-16T10:55:25Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "ABPS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.3389/fphys.2018.01638",
            "metadata": {
                "abstract": "Copyright © 2018 Schütz and Zollinger. This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms.The Abnormal Blood Profile Score (ABPS) is used to identify blood doping in sport. It combines seven hematological markers, including hemoglobin level, reticulocytes percent, and haematocrit level, using two different machine learning algorithms in order to create a single score that has a better ability to identify doping than each parameter taken alone. The resulting score allows the detection of several types of doping using a single score and is part of the current Athlete Biological Passport program managed by World Anti-Doping Agency (WADA). We describe ≪ ABPS ≫, an R package that allows the calculation of this score. This is the first software implementation calculating this score that is released publicly. The package also contains functions to calculate the OFF-score (another score used for detection of doping), as well as several test datasets. The package is useful for laboratories conducting anti-doping analyses and for researchers working on anti-doping research projects. In particular, it has been successfully used in projects estimating the prevalence of blood doping.",
                "authors": [
                    {
                        "name": "Schutz F."
                    },
                    {
                        "name": "Zollinger A."
                    }
                ],
                "citationCount": 7,
                "date": "2018-11-21T00:00:00Z",
                "journal": "Frontiers in Physiology",
                "title": "ABPs: An R package for calculating the abnormal blood profile score"
            },
            "pmcid": "PMC6258961",
            "pmid": "30519191",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Haematology",
            "uri": "http://edamontology.org/topic_3408"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}
