
{
    "credit": [
        {
            "name": "ELIXIR-PT",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "dsobral@igc.gulbenkian.pt",
            "name": "Daniel Sobral",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://corkoakdb.org/libraries"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence similarity search",
                    "uri": "http://edamontology.org/operation_0346"
                },
                {
                    "term": "Sequence database search",
                    "uri": "http://edamontology.org/operation_0338"
                }
            ]
        }
    ],
    "labels": {
        "elixirNode": [
            "Portugal"
        ],
        "elixirPlatform": [
            "Data"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Plant biology",
                "uri": "http://edamontology.org/topic_0780"
            },
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Background: Cork oak (Quercus suber) is one of the rare trees with the ability to produce cork, a material widely used to make wine bottle stoppers, flooring and insulation materials, among many other uses. The molecular mechanisms of cork formation are still poorly understood, in great part due to the difficulty in studying a species with a long life-cycle and for which there is scarce molecular/genomic information. Cork oak forests are of great ecological importance and represent a major economic and social resource in Southern Europe and Northern Africa. However, global warming is threatening the cork oak forests by imposing thermal, hydric and many types of novel biotic stresses. Despite the economic and social value of the Q. suber species, few genomic resources have been developed, useful for biotechnological applications and improved forest management. Results: We generated in excess of 7 million sequence reads, by pyrosequencing 21 normalized cDNA libraries derived from multiple Q. suber tissues and organs, developmental stages and physiological conditions. We deployed a stringent sequence processing and assembly pipeline that resulted in the identification of ~159,000 unigenes. These were annotated according to their similarity to known plant genes, to known Interpro domains, GO classes and E.C. numbers. The phylogenetic extent of this ESTs set was investigated, and we found that cork oak revealed a significant new gene space that is not covered by other model species or EST sequencing projects. The raw data, as well as the full annotated assembly, are now available to the community in a dedicated web portal at www.corkoakdb.org. Conclusions: This genomic resource represents the first trancriptome study in a cork producing species. It can be explored to develop new tools and approaches to understand stress responses and developmental processes in forest trees, as well as the molecular cascades underlying cork differentiation and disease response.",
            "authors": [
                "Pereira-Leal J.B.",
                "Abreu I.A.",
                "Alabaca C.S.",
                "Almeida M.H.",
                "Almeida P.",
                "Almeida T.",
                "Amorim M.I.",
                "Araujo S.",
                "Azevedo H.",
                "Badia A.",
                "Batista D.",
                "Bohn A.",
                "Capote T.",
                "Carrasquinho I.",
                "Chaves I.",
                "Coelho A.C.",
                "Costa M.M.R.",
                "Costa R.",
                "Cravador A.",
                "Egas C.",
                "Faro C.",
                "Fortes A.M.",
                "Fortunato A.S.",
                "Gaspar M.J.",
                "Goncalves S.",
                "Graca J.",
                "Horta M.",
                "Inacio V.",
                "Leitao J.M.",
                "Lino-Neto T.",
                "Marum L.",
                "Matos J.",
                "Mendonca D.",
                "Miguel A.",
                "Miguel C.M.",
                "Morais-Cecilio L.",
                "Neves I.",
                "Nobrega F.",
                "Oliveira M.M.",
                "Oliveira R.",
                "Pais M.S.",
                "Paiva J.A.P.",
                "Paulo O.S.",
                "Pinheiro M.",
                "Raimundo J.A.P.",
                "Ramalho J.C.",
                "Ribeiro A.I.",
                "Ribeiro T.",
                "Rocheta M.",
                "Rodrigues A.I.",
                "Rodrigues J.C.",
                "Saibo N.J.M.",
                "Santo T.E.",
                "Santos A.M.",
                "Sa-Pereira P.",
                "Sebastiana M.",
                "Simoes F.",
                "Sobral R.S.",
                "Tavares R.",
                "Teixeira R.",
                "Varela C.",
                "Veloso M.M.",
                "Ricardo C.P.P."
            ],
            "cit_count": 21,
            "doi": "10.1186/1471-2164-15-371",
            "journal": "BMC Genomics",
            "title": "A comprehensive assessment of the transcriptome of Cork oak (Quercus suber) through EST sequencing",
            "type": "Primary",
            "year": "2014-05-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:corkoakdb",
        "biotoolsID": "corkoakdb",
        "description": "Database of Cork Oak EST sequences from the Portuguese Cork Oak sequencing project.",
        "homepage": "http://corkoakdb.org/",
        "name": "CorkOakDB"
    }
}