{
    "additionDate": "2019-11-14T19:44:49Z",
    "biotoolsCURIE": "biotools:cellHarmony",
    "biotoolsID": "cellHarmony",
    "confidence_flag": "tool",
    "description": "Cell-level matching and holistic comparison of single-cell transcriptomes | To understand the molecular pathogenesis of human disease, precision analyses to define alterations within and between disease-associated cell populations are desperately needed. Single-cell genomics represents an ideal platform to enable the identification and comparison of normal and diseased transcriptional cell populations. We created cellHarmony, an integrated solution for the unsupervised analysis, classification, and comparison of cell types from diverse single-cell RNA-Seq datasets. cellHarmony efficiently and accurately matches single-cell transcriptomes using a community-clustering and alignment strategy to compute differences in cell-type specific gene expression over potentially dozens of cell populations",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.altanalyze.org/cellHarmony/"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/AltAnalyze/cellHarmony-Align",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-10T15:26:04Z",
    "name": "cellHarmony",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/NAR/GKZ789",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press on behalf of Nucleic Acids Research.To understand the molecular pathogenesis of human disease, precision analyses to define alterations within and between disease-associated cell populations are desperately needed. Single-cell genomics represents an ideal platform to enable the identification and comparison of normal and diseased transcriptional cell populations. We created cellHarmony, an integrated solution for the unsupervised analysis, classification, and comparison of cell types from diverse single-cell RNA-Seq datasets. cellHarmony efficiently and accurately matches single-cell transcriptomes using a community-clustering and alignment strategy to compute differences in cell-type specific gene expression over potentially dozens of cell populations. Such transcriptional differences are used to automatically identify distinct and shared gene programs among cell-types and identify impacted pathways and transcriptional regulatory networks to understand the impact of perturbations at a systems level. cellHarmony is implemented as a python package and as an integrated workflow within the software AltAnalyze. We demonstrate that cellHarmony has improved or equivalent performance to alternative label projection methods, is able to identify the likely cellular origins of malignant states, stratify patients into clinical disease subtypes from identified gene programs, resolve discrete disease networks impacting specific cell-types, and illuminate therapeutic mechanisms. Thus, this approach holds tremendous promise in revealing the molecular and cellular origins of complex disease.",
                "authors": [
                    {
                        "name": "DePasquale E.A.K."
                    },
                    {
                        "name": "Schnell D."
                    },
                    {
                        "name": "Dexheimer P."
                    },
                    {
                        "name": "Ferchen K."
                    },
                    {
                        "name": "Hay S."
                    },
                    {
                        "name": "Chetal K."
                    },
                    {
                        "name": "Valiente-Alandi I."
                    },
                    {
                        "name": "Blaxall B.C."
                    },
                    {
                        "name": "Grimes H.L."
                    },
                    {
                        "name": "Salomonis N."
                    }
                ],
                "citationCount": 8,
                "date": "2019-12-02T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "cellHarmony: cell-level matching and holistic comparison of single-cell transcriptomes"
            },
            "pmcid": "PMC6868361",
            "pmid": "31529053"
        }
    ],
    "topic": [
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}