{
    "additionDate": "2021-01-18T08:09:50Z",
    "biotoolsCURIE": "biotools:grgmf",
    "biotoolsID": "grgmf",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "leouyang@szu.edu.cn",
            "name": "Le Ou-Yang",
            "typeEntity": "Person"
        }
    ],
    "description": "A graph regularized generalized matrix factorization model for predicting links in biomedical bipartite networks.\n\nThis code is the implementation of GRGMF, which is both CPU and CUDA compatible(CUDA is preferred).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Promoter prediction",
                    "uri": "http://edamontology.org/operation_0440"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                }
            ]
        }
    ],
    "homepage": "https://github.com/happyalfred2016/GRGMF",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-25T10:50:35Z",
    "license": "GPL-2.0",
    "name": "GRGMF",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA157",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved.Motivation: Predicting potential links in biomedical bipartite networks can provide useful insights into the diagnosis and treatment of complex diseases and the discovery of novel drug targets. Computational methods have been proposed recently to predict potential links for various biomedical bipartite networks. However, existing methods are usually rely on the coverage of known links, which may encounter difficulties when dealing with new nodes without any known link information. Results: In this study, we propose a new link prediction method, named graph regularized generalized matrix factorization (GRGMF), to identify potential links in biomedical bipartite networks. First, we formulate a generalized matrix factorization model to exploit the latent patterns behind observed links. In particular, it can take into account the neighborhood information of each node when learning the latent representation for each node, and the neighborhood information of each node can be learned adaptively. Second, we introduce two graph regularization terms to draw support from affinity information of each node derived from external databases to enhance the learning of latent representations. We conduct extensive experiments on six real datasets. Experiment results show that GRGMF can achieve competitive performance on all these datasets, which demonstrate the effectiveness of GRGMF in prediction potential links in biomedical bipartite networks.",
                "authors": [
                    {
                        "name": "Li X.-L."
                    },
                    {
                        "name": "Ou-Yang L."
                    },
                    {
                        "name": "Wu M."
                    },
                    {
                        "name": "Zhang X.-F."
                    },
                    {
                        "name": "Zhang Z.-C."
                    },
                    {
                        "name": "Zhao X.-M."
                    }
                ],
                "citationCount": 5,
                "date": "2020-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "A graph regularized generalized matrix factorization model for predicting links in biomedical bipartite networks"
            },
            "pmid": "32145009"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
