{
    "additionDate": "2021-01-18T09:32:56Z",
    "biotoolsCURIE": "biotools:ddeep3m",
    "biotoolsID": "ddeep3m",
    "confidence_flag": "tool",
    "description": "DDeep3M is a dockerized deep-learning model for image segmentation of MOST, based on CDeep3M. The model was verified for brain tumors segmentation in BraTS too.",
    "download": [
        {
            "type": "Container file",
            "url": "https://hub.docker.com/r/taoyuhang/ddeep3m"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://github.com/cakuba/DDeep3m",
    "lastUpdate": "2021-02-22T16:13:36Z",
    "name": "DDeep3M",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.JNEUMETH.2020.108804",
            "metadata": {
                "abstract": "© 2020 Elsevier B.V.Background: Deep learning models are turning out to be increasingly popular in biomedical image processing. The fruitful utilization of these models, in most cases, is substantially restricted by the complicated configuration of computational environments, resulting in the noteworthy increment of the time and endeavors to reproduce the outcomes of the models. New method: We thus present a Docker-based method for better use of deep learning models and quicker reproduction of model performance for multiple data sources, permitting progressively more biomedical scientists to attempt the new technology conveniently in their domain. Here, we introduce a Docker-powered deep learning model, named as DDeep3M and validated it with the electron microscopy data volumes (microscale). Results: DDeep3M is utilized to the 3D optical microscopy image stack in mouse brain for the image segmentation (mesoscale). It achieves high accuracy on both vessels and somata structures with all the recall/precision scores and Dice indexes over 0.96. DDeep3M also reports the state-of-the-art performance in the MRI data (macroscale) for brain tumor segmentation. Comparison with existing methods: We compare the performance and efficiency of DDeep3M with three existing models on image datasets varying from micro- to macro-scales. Conclusion: DDeep3M is a friendly, convenient and efficient tool for image segmentations in biomedical research. DDeep3M is open sourced with the codes and pretrained model weights available at https://github.com/cakuba/DDeep3m.",
                "authors": [
                    {
                        "name": "Wu X."
                    },
                    {
                        "name": "Chen S."
                    },
                    {
                        "name": "Huang J."
                    },
                    {
                        "name": "Li A."
                    },
                    {
                        "name": "Xiao R."
                    },
                    {
                        "name": "Cui X."
                    }
                ],
                "citationCount": 2,
                "date": "2020-08-01T00:00:00Z",
                "journal": "Journal of Neuroscience Methods",
                "title": "DDeep3M: Docker-powered deep learning for biomedical image segmentation"
            },
            "pmid": "32565223"
        }
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Electron microscopy",
            "uri": "http://edamontology.org/topic_0611"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        }
    ]
}