
{
    "credit": [
        {
            "name": "DRCAT",
            "typeEntity": "Project",
            "typeRoles": [
                "Documentor"
            ]
        },
        {
            "email": "tuberculist@epfl.ch",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://tuberculist.epfl.ch/"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence accession (nucleic acid)",
                        "uri": "http://edamontology.org/data_1097"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Gene report",
                        "uri": "http://edamontology.org/data_0916"
                    },
                    "format": [
                        {
                            "term": "HTML",
                            "uri": "http://edamontology.org/format_2331"
                        }
                    ]
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "DRCAT"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Model organisms",
                "uri": "http://edamontology.org/topic_0621"
            }
        ]
    },
    "publication": [
        {
            "abstract": "TubercuList (http://tuberculist.epfl.ch/), the relational database that presents genome-derived information about H37Rv, the paradigm strain of Mycobacterium tuberculosis, has been active for ten years and now presents its twentieth release. Here, we describe some of the recent changes that have resulted from manual annotation with information from the scientific literature. Through manual curation, TubercuList strives to provide current gene-based information and is thus distinguished from other online sources of genome sequence data for M. tuberculosis. New, mostly small, genes have been discovered and the coordinates of some existing coding sequences have been changed when bioinformatics or experimental data suggest that this is required. Nucleotides that are polymorphic between different sources of H37Rv are annotated and gene essentiality data have been updated. A host of functional information has been gleaned from the literature and many new activities of proteins and RNAs have been included. To facilitate basic and translational research, TubercuList also provides links to other specialized databases that present diverse datasets such as 3D-structures, expression profiles, drug development criteria and drug resistance information, in addition to direct access to PubMed articles pertinent to particular genes. TubercuList has been and remains a highly valuable tool for the tuberculosis research community with >75,000 visitors per month. © 2010 Elsevier Ltd. All rights reserved.",
            "authors": [
                "Lew J.M.",
                "Kapopoulou A.",
                "Jones L.M.",
                "Cole S.T."
            ],
            "cit_count": 237,
            "doi": "10.1016/j.tube.2010.09.008",
            "journal": "Tuberculosis",
            "pmid": "20980199",
            "title": "TubercuList - 10 years after",
            "type": "Primary",
            "year": "2011-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:tuberculist",
        "biotoolsID": "tuberculist",
        "description": "Knowledge base integrates genome details, protein information, drug and transcriptome data, mutant and operon annotation, bibliography, structural views and comparative genomics, in a structured manner required for the rational development of new diagnostic, therapeutic and prophylactic measures against tuberculosis. With the means of expert curation and continuous updates, we deliver a broad view of the Mycobacterium tuberculosis genome.",
        "homepage": "http://genolist.pasteur.fr/TubercuList/",
        "name": "TubercuList"
    }
}