{
    "additionDate": "2018-02-12T11:40:43Z",
    "biotoolsCURIE": "biotools:a-game",
    "biotoolsID": "a-game",
    "credit": [
        {
            "email": "david.horner@unimi.it",
            "name": "David Horner",
            "orcidid": "https://orcid.org/0000-0002-6739-2657",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://beaconlab.it/agame"
        },
        {
            "name": "MATTEO CHIARA",
            "orcidid": "https://orcid.org/0000-0003-3983-4961",
            "typeEntity": "Person"
        },
        {
            "name": "ELIXIR-ITA-MILANO",
            "typeEntity": "Consortium",
            "typeRole": [
                "Provider"
            ],
            "url": "http://beaconlab.it"
        }
    ],
    "description": "A web service incorporating state of the art tools and workflows for the analysis of eDNA sequence data.  Dedicated tools available in A-GAME allow efficient analysis of pooled libraries and rapid identification of candidate genes, reducing sequencing costs and saving the need for laborious manual annotation.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene functional annotation",
                    "uri": "http://edamontology.org/operation_3672"
                }
            ]
        }
    ],
    "homepage": "http://beaconlab.it/agame",
    "lastUpdate": "2018-12-16T16:25:19Z",
    "name": "A-GAME",
    "owner": "ELIXIR-ITA-MILANO",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2018 The Author(s).Background: Expression screening of environmental DNA (eDNA) libraries is a popular approach for the identification and characterization of novel microbial enzymes with promising biotechnological properties. In such \"functional metagenomics\" experiments, inserts, selected on the basis of activity assays, are sequenced with high throughput sequencing technologies. Assembly is followed by gene prediction, annotation and identification of candidate genes that are subsequently evaluated for biotechnological applications. Results: Here we present A-GAME (A GAlaxy suite for functional MEtagenomics), a web service incorporating state of the art tools and workflows for the analysis of eDNA sequence data. We illustrate the potential of A-GAME workflows using real functional metagenomics data, showing that they outperform alternative metagenomics assemblers. Dedicated tools available in A-GAME allow efficient analysis of pooled libraries and rapid identification of candidate genes, reducing sequencing costs and saving the need for laborious manual annotation. Conclusion: In conclusion, we believe A-GAME will constitute a valuable resource for the functional metagenomics community. A-GAME is publicly available at http://beaconlab.it/agame.",
                "authors": [
                    {
                        "name": "Ceci L.R."
                    },
                    {
                        "name": "Chiara M."
                    },
                    {
                        "name": "Horner D.S."
                    },
                    {
                        "name": "Pesole G."
                    },
                    {
                        "name": "Picardi E."
                    },
                    {
                        "name": "Placido A."
                    }
                ],
                "citationCount": 3,
                "date": "2018-01-12T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "A-GAME: Improving the assembly of pooled functional metagenomics sequence data"
            },
            "pmid": "29329522",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}
