{
    "additionDate": "2023-03-02T15:59:01.322250Z",
    "biotoolsCURIE": "biotools:patpat",
    "biotoolsID": "patpat",
    "description": "Patpat stands for Proteomics Aiders Telescope, a public proteomics dataset search framework that simply passes in protein identifiers to search for relevant datasets and returns metadata to aid your research.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/henry-leo/Patpat/wiki"
        }
    ],
    "download": [
        {
            "type": "Software package",
            "url": "https://github.com/henry-leo/Patpat/releases"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/henry-leo/Patpat",
    "lastUpdate": "2023-03-02T15:59:01.325220Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/henry-leo/Patpat"
        }
    ],
    "name": "Patpat",
    "owner": "henryleo",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btad076",
            "metadata": {
                "abstract": "SUMMARY: As the FAIR (Findable, Accessible, Interoperable, Reusable) principles have become widely accepted in the proteomics field, under the guidance of ProteomeXchange and The Human Proteome Organization Proteomics Standards Initiative, proteomics public databases have been providing Application Programming Interfaces for programmatic access. Based on generating logic from proteomics data, we present Patpat, an extensible framework for searching public datasets, merging results from multiple databases to help researchers find their proteins of interest in the vast mass spectrometry. Patpat's 2D strategy of combining results from multiple databases allows users to provide only protein identifiers to obtain metadata for relevant datasets, improving the 'Findable' of proteomics data. AVAILABILITY AND IMPLEMENTATION: The Patpat framework is released under the Apache 2.0 license open source, and the source code is stored on GitHub (https://github.com/henry-leo/Patpat) and is freely available. SUPPLEMENTARY INFORMATION: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Liao W."
                    },
                    {
                        "name": "Zhang X."
                    }
                ],
                "date": "2023-02-03T00:00:00Z",
                "journal": "Bioinformatics (Oxford, England)",
                "title": "Patpat: a public proteomics dataset search framework"
            },
            "pmcid": "PMC9933831",
            "pmid": "36744907",
            "type": [
                "Usage"
            ]
        }
    ]
}
