{
    "accessibility": "Open access",
    "additionDate": "2018-05-22T10:49:31Z",
    "biotoolsCURIE": "biotools:hieranoid",
    "biotoolsID": "hieranoid",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Stockholm Bioinformatics Centre",
            "typeEntity": "Institute",
            "url": "http://www.sbc.su.se/"
        },
        {
            "email": "mateusz.kaduk@scilifelab.se",
            "name": "Mateusz Kaduk",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Orthology inference method using a hierarchical approach. Hieranoid performs pairwise orthology analysis using InParanoid at each node in a guide tree as it progresses from its leaves to the root. This concept reduces the total runtime complexity from a quadratic to a linear function of the number of species. The tree hierarchy provides a natural structure in multi-species ortholog groups, and the aggregation of multiple sequences allows for multiple alignment similarity searching techniques.",
    "download": [
        {
            "type": "Biological data",
            "url": "http://hieranoid.sbc.su.se/download/H2/"
        },
        {
            "type": "Source code",
            "url": "http://software.sbc.su.se/cgi-bin/request.cgi?project=hieranoid2"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "homepage": "http://hieranoidb.sbc.su.se/",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2020-06-16T10:55:20Z",
    "name": "Hieranoid",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "javi-gv94",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btw774",
            "metadata": {
                "abstract": "© 2017 The Author. Published by Oxford University Press. All rights reserved.Motivation: The initial step in many orthology inference methods is the computationally demanding establishment of all pairwise protein similarities across all analysed proteomes. The quadratic scaling with proteomes has become a major bottleneck. A remedy is offered by the Hieranoid algorithm which reduces the complexity to linear by hierarchically aggregating ortholog groups from InParanoid along a species tree. Results: We have further developed the Hieranoid algorithm in many ways. Major improvements have been made to the construction of multiple sequence alignments and consensus sequences. Hieranoid version 2 was evaluated with standard benchmarks that reveal a dramatic increase in the coverage/accuracy tradeoff over version 1, such that it now compares favourably with the best methods. The new parallelized cluster mode allows Hieranoid to be run on large data sets in a much shorter timespan than InParanoid, yet at similar accuracy.",
                "authors": [
                    {
                        "name": "Kaduk M."
                    },
                    {
                        "name": "Sonnhammer E."
                    }
                ],
                "citationCount": 8,
                "date": "2017-04-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Improved orthology inference with Hieranoid 2"
            },
            "pmid": "28096085"
        },
        {
            "doi": "10.1093/nar/gkw923",
            "metadata": {
                "abstract": "© The Author(s) 2016.HieranoiDB (http://hieranoiDB.sbc.su.se) is a freely available on-line database for hierarchical groups of orthologs inferred by the Hieranoid algorithm. It infers orthologs at each node in a species guide tree with the InParanoid algorithm as it progresses from the leaves to the root. Here we present a database HieranoiDB with a web interface that makes it easy to search and visualize the output of Hieranoid, and to download it in various formats. Searching can be performed using protein description, identifier or sequence. In this first version, orthologs are available for the 66 Quest for Orthologs reference proteomes. The ortholog trees are shown graphically and interactively with marked speciation and duplication nodes that show the inferred evolutionary scenario, and allow for correct extraction of predicted orthologs from the Hieranoid trees.",
                "authors": [
                    {
                        "name": "Kaduk M."
                    },
                    {
                        "name": "Riegler C."
                    },
                    {
                        "name": "Lemp O."
                    },
                    {
                        "name": "Sonnhammer E.L.L."
                    }
                ],
                "citationCount": 9,
                "date": "2017-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "HieranoiDB: A database of orthologs inferred by Hieranoid"
            },
            "pmcid": "PMC5210627",
            "pmid": "27742821"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Database portal"
    ],
    "topic": [
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Function analysis",
            "uri": "http://edamontology.org/topic_1775"
        },
        {
            "term": "Comparative genomics",
            "uri": "http://edamontology.org/topic_0797"
        }
    ],
    "validated": 1,
    "version": [
        "2"
    ]
}