{"credit":[],"function":[{"operation":[{"term":"Metabolic network modelling","uri":"http://edamontology.org/operation_3660"},{"term":"Visualisation","uri":"http://edamontology.org/operation_0337"}]}],"labels":{"language":["Python"],"topic":[{"term":"Endocrinology and metabolism","uri":"http://edamontology.org/topic_3407"},{"term":"Small molecules","uri":"http://edamontology.org/topic_0154"},{"term":"Metabolomics","uri":"http://edamontology.org/topic_3172"}]},"publication":[{"abstract":"© 2019 Elsevier B.V.Metabolic networks can model the behavior of metabolism in the cell. Since analyzing the whole metabolic networks is not easy, network modulation is an important issue to be investigated. Decomposing metabolic networks is a strategy to obtain better insight into metabolic functions. Additionally, decomposing these networks facilitates using computational methods, which are very slow when applied to the original genome-scale network. Several methods have been proposed for decomposing of the metabolic network. Therefore, it is necessary to evaluate these methods by suitable criteria. In this study, we introduce a web server package for decomposing of metabolic networks with 10 different methods, 9 datasets and the ability of computing 12 criteria, to evaluate and compare the results of different methods using ten previously defined and two new criteria which are based on Chebi ontology and Co-expression_of_Enzymes information. This package visualizes the obtained modules via “gephi” software. The ability of this package is that the user can examine whether two metabolites or reactions are in the same module or not. The functionality of the package can be easily extended to include new datasets and criteria. It also has the ability to compare the results of novel methods with the results of previously developed methods. The package is implemented in python and is available at http://eslahchilab.ir/softwares/dmn.","authors":["Yassaee Meybodi F.","Emdadi A.","Rezvan A.","Eslahchi C."],"cit_count":0,"doi":"10.1016/J.BIOSYSTEMS.2019.104081","journal":"BioSystems","pmid":"31838143","title":"CAMND: Comparative analysis of metabolic network decomposition based on previous and two new criteria, a web based application","year":"2020-03-01"}],"summary":{"biotoolsCURIE":"biotools:CAMND","biotoolsID":"CAMND","description":"Comparative analysis of metabolic network decomposition based on previous and two new criteria.\n\nMetabolic networks can model the behavior of metabolism in the cell. Since analyzing the whole metabolic networks is not easy, network modulation is an important issue to be investigated. Decomposing metabolic networks is a strategy to obtain better insight into metabolic functions. Additionally, decomposing these networks facilitates using computational methods, which are very slow when applied to the original genome-scale network. Several methods have been proposed for decomposing of the metabolic network. Therefore, it is necessary to evaluate these methods by suitable criteria.\n\n||| HOMEPAGE MISSING!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'decomposing networks', 'decomposing metabolic networks', 'decomposing metabolic network', 'decomposing'","homepage":"https://www.ncbi.nlm.nih.gov/pubmed/?term=31838143","name":"CAMND"}}