{"credit":[{"email":"sam.meyer@insa-lyon.fr","name":"Sam Meyer","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://github.com/sammeyer2017/ThreaDNA"}],"function":[{"operation":[{"term":"Sequence motif recognition","uri":"http://edamontology.org/operation_0239"}]}],"labels":{"language":["Python"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool","Web application"],"topic":[{"term":"Genomics","uri":"http://edamontology.org/topic_0622"},{"term":"Sequence sites, features and motifs","uri":"http://edamontology.org/topic_0160"},{"term":"DNA","uri":"http://edamontology.org/topic_0654"}]},"publication":[{"abstract":"© The Author 2017. Published by Oxford University Press. All rights reserved. For Permissions, please e-mail: journals.permissions@oup.com. Motivation Many DNA-binding proteins recognize their target sequences indirectly, by sensing DNA's response to mechanical distortion. ThreaDNA estimates this response based on high-resolution structures of the protein-DNA complex of interest. Implementing an efficient nanoscale modeling of DNA deformations involving essentially no adjustable parameters, it returns the profile of deformation energy along whole genomes, at base-pair resolution, within minutes on usual laptop/desktop computers. Our predictions can also be easily combined with estimations of direct selectivity through a generalized form of position-weight-matrices. The formalism of ThreaDNA is accessible to a wide audience. Results We demonstrate the importance of indirect readout for the nucleosome as well as the bacterial regulators Fis and CRP. Combined with the direct contribution provided by usual sequence motifs, it significantly improves the prediction of sequence selectivity, and allows quantifying the two distinct physical mechanisms underlying it. Availability and implementation Python software available at bioinfo.insa-lyon.fr, natively executable on Linux/MacOS systems with a user-friendly graphical interface. Galaxy webserver version available. Contact sam.meyer@insa-lyon.fr Supplementary informationSupplementary dataare available at Bioinformatics online.","authors":["Cevost J.","Vaillant C.","Meyer S."],"cit_count":2,"doi":"10.1093/bioinformatics/btx634","journal":"Bioinformatics","title":"ThreaDNA: Predicting DNA mechanics' contribution to sequence selectivity of proteins along whole genomes","year":"2018-02-15"}],"summary":{"biotoolsCURIE":"biotools:threadna","biotoolsID":"threadna","description":"Predicting DNA mechanics’ contribution to sequence selectivity of proteins along whole genomes.","homepage":"http://bioinfo.insa-lyon.fr/prod.php","name":"ThreaDNA"}}