{
    "additionDate": "2021-01-18T10:39:06Z",
    "biotoolsCURIE": "biotools:gen2vcf",
    "biotoolsID": "gen2vcf",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "khryu@tdtu.edu.vn",
            "name": "Keun Ho Ryu",
            "orcidid": "https://orcid.org/0000-0003-0394-9054",
            "typeEntity": "Person"
        },
        {
            "email": "inthistime@korea.kr",
            "name": "Young Jin Kim",
            "orcidid": "https://orcid.org/0000-0002-4132-4437",
            "typeEntity": "Person"
        }
    ],
    "description": "A converter for human genome imputation output format to VCF format.\n\nBACKGROUND:For a genome-wide association study in humans, genotype imputation is an essential analysis tool for improving association mapping power. When IMPUTE software is used for imputation analysis, an imputation output (GEN format) should be converted to variant call format (VCF) with imputed genotype dosage for association analysis.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://bitbucket.org/4shin/division-of-genome-research/src/master/",
    "lastUpdate": "2021-01-22T18:49:32Z",
    "name": "GEN2VCF",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1007/S13258-020-00982-0",
            "metadata": {
                "abstract": "© 2020, The Author(s).Background: For a genome-wide association study in humans, genotype imputation is an essential analysis tool for improving association mapping power. When IMPUTE software is used for imputation analysis, an imputation output (GEN format) should be converted to variant call format (VCF) with imputed genotype dosage for association analysis. However, the conversion requires multiple software packages in a pipeline with a large amount of processing time. Objective: We developed GEN2VCF, a fast and convenient GEN format to VCF conversion tool with dosage support. Methods: The performance of GEN2VCF was compared to BCFtools, QCTOOL, and Oncofunco. The test data set was a 1 Mb GEN-formatted file of 5000 samples. To determine the performance of various sample sizes, tests were performed from 1000 to 5000 samples with a step size of 1000. Runtime and memory usage were used as performance measures. Results: GEN2VCF showed drastically increased performances with respect to runtime and memory usage. Runtime and memory usage of GEN2VCF was at least 1.4- and 7.4-fold lower compared to other methods, respectively. Conclusions: GEN2VCF provides users with efficient conversion from GEN format to VCF with the best-guessed genotype, genotype posterior probabilities, and genotype dosage, as well as great flexibility in implementation with other software packages in a pipeline.",
                "authors": [
                    {
                        "name": "Shin D.M."
                    },
                    {
                        "name": "Hwang M.Y."
                    },
                    {
                        "name": "Kim B.-J."
                    },
                    {
                        "name": "Ryu K.H."
                    },
                    {
                        "name": "Kim Y.J."
                    }
                ],
                "date": "2020-10-01T00:00:00Z",
                "journal": "Genes and Genomics",
                "title": "GEN2VCF: a converter for human genome imputation output format to VCF format"
            },
            "pmcid": "PMC7497724",
            "pmid": "32803703"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        }
    ],
    "validated": 1
}