{
    "accessibility": "Open access",
    "additionDate": "2022-06-07T06:32:01.366524Z",
    "biotoolsCURIE": "biotools:deepavppred",
    "biotoolsID": "deepavppred",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Ritesh Sharma"
        }
    ],
    "description": "Artificial intelligence driven discovery of peptide drugs for viral infections.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://deep-avppred.anvil.app",
    "lastUpdate": "2022-06-07T06:32:01.368915Z",
    "name": "Deep-AVPpred",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1109/JBHI.2021.3130825",
            "metadata": {
                "abstract": "IEEERapid increase in viral outbreaks has resulted in the spread of viral diseases in diverse species and across geographical boundaries. The zoonotic viral diseases have greatly affected the well-being of humans, and the COVID-19 pandemic is a burning example. The existing antivirals have low efficacy, severe side effects, high toxicity, and limited market availability. As a result, natural substances have been tested for antiviral activity. The host defense molecules like antiviral peptides (AVPs) are present in plants and animals and protect them from invading viruses. However, obtaining AVPs from natural sources for preparing synthetic peptide drugs is expensive and time-consuming. As a result, an in-silico model is required for identifying new AVPs. We proposed Deep-AVPpred, a deep learning classifier for discovering AVPs in protein sequences, which utilises the concept of transfer learning with a deep learning algorithm. The proposed classifier outperformed state-of-the-art classifiers and achieved approximately 94% and 93% precision on validation and test sets, respectively. The high precision indicates that Deep-AVPpred can be used to propose new AVPs for synthesis and experimentation. By utilising Deep-AVPpred, we identified novel AVPs in human interferons- family proteins. These AVPs can be chemically synthesised and experimentally verified for their antiviral activity against different viruses. The Deep-AVPpred is deployed as a web server and is made freely available at https://deep-avppred.anvil.app, which can be utilised to predict novel AVPs for developing antiviral compounds for use in human and veterinary medicine.",
                "authors": [
                    {
                        "name": "Kumar A."
                    },
                    {
                        "name": "Saxena S."
                    },
                    {
                        "name": "Sharma R."
                    },
                    {
                        "name": "Shrivastava S."
                    },
                    {
                        "name": "Singh A.K."
                    },
                    {
                        "name": "Singh S.K."
                    }
                ],
                "citationCount": 3,
                "date": "2021-01-01T00:00:00Z",
                "journal": "IEEE Journal of Biomedical and Health Informatics",
                "title": "Deep-AVPpred: Artificial intelligence driven discovery of peptide drugs for viral infections"
            },
            "pmid": "34822333"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Veterinary medicine",
            "uri": "http://edamontology.org/topic_3397"
        }
    ],
    "validated": 1
}
