{
    "additionDate": "2020-01-09T17:35:48Z",
    "biotoolsCURIE": "biotools:EuRBPDB",
    "biotoolsID": "EuRBPDB",
    "confidence_flag": "tool",
    "description": "A comprehensive database for eukaryotic RNA binding proteins. EuRBPDB is a comprehensive and user-friendly database for eukaryotic RNA binding proteins (RBPs). It contains 315,222 RBPs (forms 6,368 ortholog groups) from 162 eukaryotic species, including human, mouse, fly, worm and yeast. EuRBPDB provides precise and comprehensive list of RBPs of each eukaryote with annotations collected from various public databases",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "RNA binding site prediction",
                    "uri": "http://edamontology.org/operation_3902"
                },
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "homepage": "http://EuRBPDB.syshospital.org",
    "lastUpdate": "2021-01-14T14:48:52Z",
    "name": "EuRBPDB",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/NAR/GKZ823",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press on behalf of Nucleic Acids Research.RNA binding proteins (RBPs) are a large protein family that plays important roles at almost all levels of gene regulation through interacting with RNAs, and contributes to numerous biological processes. However, the complete list of eukaryotic RBPs including human is still unavailable. Here, we systematically identified RBPs in 162 eukaryotic species based on both computational analysis of RNA binding domains (RBDs) and large-scale RNA binding proteomic data, and established a comprehensive eukaryotic RBP database, EuRBPDB (http://EuRBPDB.syshospital.org). We identified a total of 311 571 RBPs with RBDs (corresponding to 6368 ortholog groups) and 3,651 non-canonical RBPs without known RBDs. EuRBPDB provides detailed annotations for each RBP, including basic information and functional annotation. Moreover, we systematically investigated RBPs in the context of cancer biology based on published literatures, PPI-network and large-scale omics data. To facilitate the exploration of the clinical relevance of RBPs, we additionally designed a cancer web interface to systematically and interactively display the biological features of RBPs in various types of cancers. EuRBPDB has a user-friendly web interface with browse and search functions, as well as data downloading function. We expect that EuRBPDB will be a widely-used resource and platform for both the communities of RNA biology and cancer biology.",
                "authors": [
                    {
                        "name": "Liao J.-Y."
                    },
                    {
                        "name": "Yang B."
                    },
                    {
                        "name": "Zhang Y.-C."
                    },
                    {
                        "name": "Wang X.-J."
                    },
                    {
                        "name": "Ye Y."
                    },
                    {
                        "name": "Peng J.-W."
                    },
                    {
                        "name": "Yang Z.-Z."
                    },
                    {
                        "name": "He J.-H."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Hu K."
                    },
                    {
                        "name": "Lin D.-C."
                    },
                    {
                        "name": "Yin D."
                    }
                ],
                "citationCount": 13,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "EuRBPDB: A comprehensive resource for annotation, functional and oncological investigation of eukaryotic RNA binding proteins (RBPs)"
            },
            "pmid": "31598693"
        }
    ],
    "toolType": [
        "Bioinformatics portal"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ],
    "validated": 1
}