{
    "additionDate": "2017-02-10T11:35:04Z",
    "biotoolsCURIE": "biotools:expressyourself",
    "biotoolsID": "expressyourself",
    "credit": [
        {
            "email": "nicholas.luscombe@yale.edu",
            "name": "Nicholas Luscombe",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "ExpressYourself is a web-based platform to process microarray data. It includes tools for background correction, normalization, data processing and filtering.",
    "documentation": [
        {
            "type": "User manual",
            "url": "http://array.mbb.yale.edu/analysis/manual/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                },
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://array.mbb.yale.edu/analysis/",
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "ExpressYourself",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "DNA microarrays are widely used in biological research; by analyzing differential hybridization on a single microarray slide, one can detect changes in mRNA expression levels, increases in DNA copy numbers and the location of transcription factor binding sites on a genomic scale. Having performed the experiments, the major challenge is to process large, noisy datasets in order to identify the specific array elements that are significantly differentially hybridized. This normally requires aggregating different, often incompatible programs into a multi-step pipeline. Here we present ExpressYourself, a fully integrated platform for processing microarray data. In completely automated fashion, it will correct the background array signal, normalize the Cy5 and Cy3 signals, score levels of differential hybridization, combine the results of replicate experiments, filter problematic regions of the array and assess the quality of individual and replicate experiments. ExpressYourself is designed with a highly modular architecture so various types of microarray analysis algorithms can readily be incorporated as they are developed; for example, the system currently implements several normalization methods, including those that simultaneously consider signal intensity and slide location. The processed data are presented using a web-based graphical interface to facilitate comparison with the original images of the array slides. In particular, Express Yourself is able to regenerate images of the original microarray after applying various steps of processing, which greatly facilities identification of position-specific artifacts. The program is freely available for use at http://bioinfo.mbb.yale.edu/expressyourself.",
                "authors": [
                    {
                        "name": "Luscombe N.M."
                    },
                    {
                        "name": "Royce T.E."
                    },
                    {
                        "name": "Bertone P."
                    },
                    {
                        "name": "Echols N."
                    },
                    {
                        "name": "Horak C.E."
                    },
                    {
                        "name": "Chang J.T."
                    },
                    {
                        "name": "Snyder M."
                    },
                    {
                        "name": "Gerstein M."
                    }
                ],
                "citationCount": 31,
                "date": "2003-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Express yourself: A modular platform for processing and visualizing microarray data"
            },
            "pmid": "12824348"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1
}