{
    "additionDate": "2020-01-09T17:45:38Z",
    "biotoolsCURIE": "biotools:microbiomeDASim",
    "biotoolsID": "microbiomeDASim",
    "confidence_flag": "tool",
    "description": "MicrobiomeDASim: Simulating longitudinal differential abundance for microbiome data.\n\nTools to simulate longitudinal differential abundance for microbiome data.\n\nMicrobiome Differential Abundance Simulation.\n\nA toolkit for simulating differential microbiome data designed for longitudinal analyses. Several functional forms may be specified for the mean trend. Observations are drawn from a multivariate normal model. The objective of this package is to be able to simulate data in order to accurately compare different longitudinal methods for differential abundance.\n\nMicrobiome, Software, Visualization.\n\nAfter installing Jupyter and the appopriate kernel you can access an interactive simulation session of microbiomeDASim using mvrnorm_demo.ipynb.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/microbiomeDASim",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-28T10:38:29Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/williazo/microbiomeDASim"
        }
    ],
    "name": "microbiomeDASim",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.12688/F1000RESEARCH.20660.1",
            "metadata": {
                "abstract": "© 2020 Williams J et al.An increasing emphasis on understanding the dynamics of microbial communities in various settings has led to the proliferation of longitudinal metagenomic sampling studies. Data from whole metagenomic shotgun sequencing and marker-gene survey studies have characteristics that drive novel statistical methodological development for estimating time intervals of differential abundance. In designing a study and the frequency of collection prior to a study, one may wish to model the ability to detect an effect, e.g., there may be issues with respect to cost, ease of access, etc. Additionally, while every study is unique, it is possible that in certain scenarios one statistical framework may be more appropriate than another. Here, we present a simulation paradigm implemented in the R Bioconductor software package microbiomeDASim available at http://bioconductor.org/packages/microbiomeDASim microbiomeDASim. microbiomeDASim allows investigators to simulate longitudinal differential abundant microbiome features with a variety of known functional forms with flexible parameters to control desired signal-to-noise ratio. We present metrics of success results on one particular method called metaSplines.",
                "authors": [
                    {
                        "name": "Bravo H.C."
                    },
                    {
                        "name": "Paulson J.N."
                    },
                    {
                        "name": "Tom J."
                    },
                    {
                        "name": "Williams J."
                    }
                ],
                "citationCount": 1,
                "date": "2020-01-01T00:00:00Z",
                "journal": "F1000Research",
                "title": "MicrobiomeDASim: Simulating longitudinal differential abundance for microbiome data"
            }
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Metagenomic sequencing",
            "uri": "http://edamontology.org/topic_3837"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        }
    ],
    "validated": 1
}
