{
    "additionDate": "2018-05-07T14:25:16Z",
    "biotoolsCURIE": "biotools:dcgor",
    "biotoolsID": "dcgor",
    "credit": [
        {
            "email": "hfang@well.ox.ac.uk",
            "name": "Hai Fang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "An R Package for Analysing Ontologies and Protein Domain Annotations.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://supfam.org/dcGOR/vignettes/dcGOR.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Ontology comparison",
                    "uri": "http://edamontology.org/operation_3352"
                },
                {
                    "term": "Sequence annotation",
                    "uri": "http://edamontology.org/operation_0361"
                }
            ]
        }
    ],
    "homepage": "http://supfam.org/dcGOR/",
    "homepage_status": 1,
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "dcGOR",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1003929",
            "metadata": {
                "abstract": "© 2014 Hai Fang.I introduce an open-source R package ‘dcGOR’ to provide the bioinformatics community with the ease to analyse ontologies and protein domain annotations, particularly those in the dcGO database. The dcGO is a comprehensive resource for protein domain annotations using a panel of ontologies including Gene Ontology. Although increasing in popularity, this database needs statistical and graphical support to meet its full potential. Moreover, there are no bioinformatics tools specifically designed for domain ontology analysis. As an add-on package built in the R software environment, dcGOR offers a basic infrastructure with great flexibility and functionality. It implements new data structure to represent domains, ontologies, annotations, and all analytical outputs as well. For each ontology, it provides various mining facilities, including: (i) domain-based enrichment analysis and visualisation; (ii) construction of a domain (semantic similarity) network according to ontology annotations; and (iii) significance analysis for estimating a contact (statistical significance) network. To reduce runtime, most analyses support high-performance parallel computing. Taking as inputs a list of protein domains of interest, the package is able to easily carry out in-depth analyses in terms of functional, phenotypic and diseased relevance, and network-level understanding. More importantly, dcGOR is designed to allow users to import and analyse their own ontologies and annotations on domains (taken from SCOP, Pfam and InterPro) and RNAs (from Rfam) as well. The package is freely available at CRAN for easy installation, and also at GitHub for version control. The dedicated website with reproducible demos can be found at http://supfam.org/dcGOR.",
                "authors": [
                    {
                        "name": "Fang H."
                    }
                ],
                "citationCount": 8,
                "date": "2014-01-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "dcGOR: An R Package for Analysing Ontologies and Protein Domain Annotations"
            },
            "pmcid": "PMC4214615",
            "pmid": "25356683"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        }
    ],
    "validated": 1
}
