{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2021-05-05T10:52:24Z",
    "biotoolsCURIE": "biotools:hdxfit",
    "biotoolsID": "hdxfit",
    "collectionID": [
        "MATLAB",
        "File Exchange"
    ],
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "name": "Darko Babic",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.mathworks.com/matlabcentral/profile/10152165-darko-babic"
        }
    ],
    "description": "HDXfit is a package for fitting the site exchange probabilities to peptide mass envelopes from hydrogen/deuterium exchange of a protein.",
    "download": [
        {
            "type": "Screenshot",
            "url": "https://www.mathworks.com//matlabcentral/mlc-downloads/downloads/a22f7931-6edd-4129-b5b5-fdbf31a011f3/e300c73b-f9b9-4978-8f0a-bc0904bef256/images/screenshot.gif"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Tag-based peptide identification",
                    "uri": "http://edamontology.org/operation_3643"
                }
            ]
        }
    ],
    "homepage": "https://www.mathworks.com/matlabcentral/fileexchange/69415-hdxfit",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-05-13T18:54:21.635022Z",
    "name": "HDXfit",
    "operatingSystem": [
        "Windows",
        "Linux",
        "Mac"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1073/pnas.1315532110",
            "metadata": {
                "abstract": "Hydrogen exchange technology provides a uniquely powerful instrument for measuring protein structural and biophysical properties, quantitatively and in a nonperturbing way, and determining how these properties are implemented to produce protein function. A developing hydrogen exchange-mass spectrometry method (HX MS) is able to analyze large biologically important protein systems while requiring only minuscule amounts of experimental material. The major remaining deficiency of the HX MS method is the inability to deconvolve HX results to individual amino acid residue resolution. To pursue this goal we used an iterative optimization program (HDsite) that integrates recent progress in multiple peptide acquisition together with previously unexamined isotopic envelope-shape information and a site-resolved backexchange correction. To test this approach, residue-resolved HX rates computed from HX MS data were compared with extensive HX NMR measurements, and analogous comparisons were made in simulation trials. These tests found excellent agreement and revealed the important computational determinants.",
                "authors": [
                    {
                        "name": "Kan Z.-Y."
                    },
                    {
                        "name": "Walters B.T."
                    },
                    {
                        "name": "Mayne L."
                    },
                    {
                        "name": "Englander S.W."
                    }
                ],
                "citationCount": 91,
                "date": "2013-10-08T00:00:00Z",
                "journal": "Proceedings of the National Academy of Sciences of the United States of America",
                "title": "Protein hydrogen exchange at residue resolution by proteolytic fragmentation mass spectrometry analysis"
            },
            "type": [
                "Method"
            ]
        },
        {
            "doi": "10.1002/rcm.8460",
            "metadata": {
                "abstract": "© 2019 John Wiley & Sons, Ltd.Rationale: Mass spectra processing in protein hydrogen/deuterium (H/D) exchange has been remarkably improved by the introduction of fitting of the amide exchange probabilities to peptide isotopic envelope intensities (Kan et al., 2013), in contrast to methods in which only the peptide deuterium uptakes (centroid shifts of isotopic envelopes) are used. However, the known implementations are based on the general fitting routines that use only the objective function values. Besides, applicability of more than one fitting method makes necessary their comparative evaluation. Methods: Two fitting methods were considered: the common least squares and the fitting of the multinomial distribution representing the number of deuterium atoms exchanged in the individual peptides. Both methods were applied either directly to the isotopic envelope data or to the deuterium distributions obtained by envelope deconvolution (i.e. de-isotoping). Results: An autonomous Matlab script was prepared, based on the exact expressions for the gradient and Hessian of the objective function, with the trust-region algorithm implemented in the compact analytical form recently made available. The least-squares fitting to the envelope data produced the best results, with the greatest precision and good coverage of exact values by the confidence intervals. The deuterium distributions were sensitive to the (simulated) experimental error whose progression by envelope deconvolution caused degradation in accuracy. The multinomial distribution fitting exhibited poor performance due to inadequate representation of the experimental error and missing of the appropriate weight parameters. Some specific peptide arrangement details were discussed as potential sources of ambiguity in the fitting results. Conclusions: The method of fitting to peptide isotopic envelopes has been improved by using the exact gradient and Hessian of the objective function. The fitting should be repeated with different initial guesses in order to find not only the global minimum, but also the local minima with similar depths which may exist due to eventual ambiguity of the fitting results.",
                "authors": [
                    {
                        "name": "Babic D."
                    },
                    {
                        "name": "Kazazic S."
                    },
                    {
                        "name": "Smith D.M."
                    }
                ],
                "citationCount": 2,
                "date": "2019-08-15T00:00:00Z",
                "journal": "Rapid Communications in Mass Spectrometry",
                "title": "Resolution of protein hydrogen/deuterium exchange by fitting amide exchange probabilities to the peptide isotopic envelopes"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ],
    "version": [
        "1.0.2.1"
    ]
}