{
    "additionDate": "2021-01-18T08:32:38Z",
    "biotoolsCURIE": "biotools:intassoplot",
    "biotoolsID": "intassoplot",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "wanghw@yangtzeu.edu.cn",
            "name": "Hongwei Wang",
            "typeEntity": "Person"
        },
        {
            "email": "qinfeng@cau.edu.cn",
            "name": "Feng Qin",
            "typeEntity": "Person"
        }
    ],
    "description": "An R Package for Integrated Visualization of Genome-Wide Association Study Results With Gene Structure and Linkage Disequilibrium Matrix.\n\nIntAssoPlot: Visualize Genome-Wide Association Study with Gene Annotation and Linkage Disequiblism.\n\nGNU General Public License, GPLv3.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Collapsing methods",
                    "uri": "http://edamontology.org/operation_3791"
                }
            ]
        }
    ],
    "homepage": "https://github.com/whweve/IntAssoPlot",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-05T07:15:22Z",
    "license": "GPL-3.0",
    "name": "IntAssoPlot",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.3389/FGENE.2020.00260",
            "metadata": {
                "abstract": "© Copyright © 2020 He, Ding, Wang and Qin.Genome-wide association study (GWAS), exploring the historical and evolutionary recombinations at the population level, is a major method adopted to identify quantitative trait loci (QTL) for complex traits. However, to summarize GWAS results, gene structure, and linkage disequilibrium (LD) in a single view, multiple tools are required. It is tedious to generate these three results and manually put them together; moreover, it may eventually lead to inaccuracies. On the other hand, genotype markers are usually detected by DNA- and/or RNA-Seq. For GWAS analysis based on RNA-Seq, markers from DNA-Seq provide more genetic information when displaying LD. The currently released software package does not have this function for an integrated analysis of LD, using genotypic markers different from that in association analysis. Here, we present an R package, IntAssoPlot, which provides an integrated visual display of GWAS results, along with LD and gene structure information, in a publication-ready format. The main panel of an IntAssoPlot plot has a connecting line linking the genome-wide association P-values on the -log10 scale with the gene structure and LD matrix. Importantly, IntAssoPlot is designed to plot GWAS results with LD calculated from genotypes different from those in GWAS analysis. IntAssoPlot provides a powerful visualization tool to gain an integrated insight into GWAS results. The functions provided by IntAssoPlot increase the efficiency by revealing GWAS results in a publication-ready format. Inspection of the output image can provide important biological information, including the loci that passed the genome-wide significance threshold, genes located at or near the significant loci, and the extent of LD within the selected region.",
                "authors": [
                    {
                        "name": "He F."
                    },
                    {
                        "name": "Ding S."
                    },
                    {
                        "name": "Wang H."
                    },
                    {
                        "name": "Qin F."
                    }
                ],
                "citationCount": 1,
                "date": "2020-03-20T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "IntAssoPlot: An R Package for Integrated Visualization of Genome-Wide Association Study Results With Gene Structure and Linkage Disequilibrium Matrix"
            },
            "pmcid": "PMC7100855",
            "pmid": "32265990"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        }
    ]
}