{"credit":[{"email":"paul.thompson@manchester.ac.uk","name":"Paul Thompson","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://www.nactem.ac.uk/PHAEDRA/"}],"function":[{"operation":[{"term":"Text mining","uri":"http://edamontology.org/operation_0306"}]}],"labels":{"license":"CC-BY-2.0","operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Cheminformatics","uri":"http://edamontology.org/topic_2258"},{"term":"Drug discovery","uri":"http://edamontology.org/topic_3336"},{"term":"Medicinal chemistry","uri":"http://edamontology.org/topic_0209"},{"term":"Natural language processing","uri":"http://edamontology.org/topic_0218"}]},"publication":[{"abstract":"© 2018, The Author(s). Pharmacovigilance (PV) databases record the benefits and risks of different drugs, as a means to ensure their safe and effective use. Creating and maintaining such resources can be complex, since a particular medication may have divergent effects in different individuals, due to specific patient characteristics and/or interactions with other drugs being administered. Textual information from various sources can provide important evidence to curators of PV databases about the usage and effects of drug targets in different medical subjects. However, the efficient identification of relevant evidence can be challenging, due to the increasing volume of textual data. Text mining (TM) techniques can support curators by automatically detecting complex information, such as interactions between drugs, diseases and adverse effects. This semantic information supports the quick identification of documents containing information of interest (e.g., the different types of patients in which a given adverse drug reaction has been observed to occur). TM tools are typically adapted to different domains by applying machine learning methods to corpora that are manually labelled by domain experts using annotation guidelines to ensure consistency. We present a semantically annotated corpus of 597 MEDLINE abstracts, PHAEDRA, encoding rich information on drug effects and their interactions, whose quality is assured through the use of detailed annotation guidelines and the demonstration of high levels of inter-annotator agreement (e.g., 92.6% F-Score for identifying named entities and 78.4% F-Score for identifying complex events, when relaxed matching criteria are applied). To our knowledge, the corpus is unique in the domain of PV, according to the level of detail of its annotations. To illustrate the utility of the corpus, we have trained TM tools based on its rich labels to recognise drug effects in text automatically. The corpus and annotation guidelines are available at: http://www.nactem.ac.uk/PHAEDRA/.","authors":["Thompson P.","Daikou S.","Ueno K.","Batista-Navarro R.","Tsujii J.","Ananiadou S."],"cit_count":0,"doi":"10.1186/s13321-018-0290-y","journal":"Journal of Cheminformatics","title":"Annotation and detection of drug effects in text for pharmacovigilance","year":"2018-12-01"}],"summary":{"biotoolsCURIE":"biotools:phaedra","biotoolsID":"phaedra","description":"semantically annotated corpus for pharmacovigilence (PV), consisting of 597 MEDLINE abstracts. Its fine-grained, multiple levels of annotation, added by domain-experts, make it a unique resource within the field, and aim to encourage the development/adaption of novel machine learning tools for extracting PV-related information from text.","homepage":"http://www.nactem.ac.uk/PHAEDRA/","name":"PHAEDRA"}}