{
    "additionDate": "2017-03-25T12:40:50Z",
    "biotoolsCURIE": "biotools:genecodis3",
    "biotoolsID": "genecodis3",
    "credit": [
        {
            "email": "fbio@cnb.csic.es",
            "name": "GeneCoDis3 Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Originally designed in 2007 for modular enrichment analysis, GeneCodis assists in functional analysis of gene lists, integrating information from different sources. GeneCodis also finds regulatory patterns, and singular and modular patterns of interrelated annotations. Noisy and redundant output data has been removed from enrichment results, and greater comparative analyses are possible.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://genecodis.cnb.csic.es/help"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Gene functional annotation",
                    "uri": "http://edamontology.org/operation_3672"
                }
            ]
        }
    ],
    "homepage": "http://genecodis.cnb.csic.es/",
    "language": [
        "Ruby",
        "C++"
    ],
    "lastUpdate": "2021-04-18T12:37:57Z",
    "name": "GeneCodis3",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_006943"
        }
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "GeneCodis is a web server application for functional analysis of gene lists that integrates different sources of information and finds modular patterns of interrelated annotations. This integrative approach has proved to be useful for the interpretation of high-throughput experiments and therefore a new version of the system has been developed to expand its functionality and scope. GeneCodis now expands the functional information with regulatory patterns and user-defined annotations, offering the possibility of integrating all sources of information in the same analysis. Traditional singular enrichment is now permitted and more organisms and gene identifiers have been added to the database. The application has been re-engineered to improve performance, accessibility and scalability. In addition, GeneCodis can now be accessed through a public SOAP web services interface, enabling users to perform analysis from their own scripts and workflows. The application is freely available at http://genecodis.dacya.ucm.es.",
                "authors": [
                    {
                        "name": "Nogales-Cadenas R."
                    },
                    {
                        "name": "Carmona-Saez P."
                    },
                    {
                        "name": "Vazquez M."
                    },
                    {
                        "name": "Vicente C."
                    },
                    {
                        "name": "Yang X."
                    },
                    {
                        "name": "Tirado F."
                    },
                    {
                        "name": "Carazo J.M."
                    },
                    {
                        "name": "Pascual-Montano A."
                    }
                ],
                "citationCount": 330,
                "date": "2009-08-04T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "GeneCodis: Interpreting gene lists through enrichment analysis and integration of diverse biological information"
            },
            "pmid": "19465387"
        },
        {
            "metadata": {
                "abstract": "Since its first release in 2007, GeneCodis has become a valuable tool to functionally interpret results from experimental techniques in genomics. This web-based application integrates different sources of information to finding groups of genes with similar biological meaning. This process, known as enrichment analysis, is essential in the interpretation of high-throughput experiments. The frequent feedbacks and the natural evolution of genomics and bioinformatics have allowed the growth of the tool and the development of this third release. In this version, a special effort has been made to remove noisy and redundant output from the enrichment results with the inclusion of a recently reported algorithm that summarizes significantly enriched terms and generates functionally coherent modules of genes and terms. A new comparative analysis has been added to allow the differential analysis of gene sets. To expand the scope of the application, new sources of biological information have been included, such as genetic diseases, drugs-genes interactions and Pubmed information among others. Finally, the graphic section has been renewed with the inclusion of new interactive graphics and filtering options. The application is freely available at http://genecodis.cnb.csic.es. © 2012 The Author(s).",
                "authors": [
                    {
                        "name": "Tabas-Madrid D."
                    },
                    {
                        "name": "Nogales-Cadenas R."
                    },
                    {
                        "name": "Pascual-Montano A."
                    }
                ],
                "citationCount": 423,
                "date": "2012-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "GeneCodis3: A non-redundant and modular enrichment analysis tool for functional genomics"
            },
            "pmid": "22573175"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ],
    "validated": 1
}