{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"https://bioinformatics.cineca.it/expedit/"}],"function":[{"operation":[{"term":"Editing","uri":"http://edamontology.org/operation_3096"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"RNA-Seq","uri":"http://edamontology.org/topic_3170"},{"term":"RNA","uri":"http://edamontology.org/topic_0099"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/expedit-webserver-to-explore-human-rna-editing-in-rna-seq-experiments.html"}],"publication":[{"abstract":"RNA editing can be broadly defined as any site-specific alteration in an RNA sequence that could have been copied from the template, excluding changes due to processes such as RNA splicing and polyadenylation. Changes in gene expression attributed to editing have been described in organisms from unicellular protozoa to man, and can affect the mRNAs, tRNAs, and rRNAs present in all cellular compartments. These sequence revisions, which include both the insertion and deletion of nucleotides, and the conversion of one base to another, involve a wide range of largely unrelated mechanisms. Recent advances in the development of in vitro editing and transgenic systems for these varied modifications have provided a better understanding of similarities and differences between the biochemical strategies, regulatory sequences, and cellular factors responsible for such RNA processing events.","authors":["Gott J.M.","Emeson R.B."],"cit_count":274,"doi":"10.1146/annurev.genet.34.1.499","journal":"Annual Review of Genetics","title":"Functions and mechanisms of RNA editing","type":"Primary","year":"2000-01-01"}],"summary":{"biotoolsCURIE":"biotools:expedit","biotoolsID":"expedit","description":"Web application for assessing RNA editing in human at known or user-specified sites supported by transcript data obtained by RNA-Seq experiments.","homepage":"https://bioinformatics.cineca.it/expedit/","name":"ExpEdit"}}