{
    "additionDate": "2021-01-18T11:22:34Z",
    "biotoolsCURIE": "biotools:metaclean",
    "biotoolsID": "metaclean",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Gaurav Pandey",
            "typeEntity": "Person"
        },
        {
            "name": "Lauren Petrick",
            "typeEntity": "Person"
        }
    ],
    "description": "A machine learning-based classifier for reduced false positive peak detection in untargeted LC-MS metabolomics data.\n\nDetection of Low-Quality Peaks in Untargeted Metabolomics Data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Peak detection",
                    "uri": "http://edamontology.org/operation_3215"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "https://CRAN.R-project.org/package=MetaClean",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-22T07:31:03Z",
    "license": "GPL-3.0",
    "name": "MetaClean",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1007/S11306-020-01738-3",
            "metadata": {
                "abstract": "© 2020, Springer Science+Business Media, LLC, part of Springer Nature.Introduction: Despite the availability of several pre-processing software, poor peak integration remains a prevalent problem in untargeted metabolomics data generated using liquid chromatography high–resolution mass spectrometry (LC–MS). As a result, the output of these pre-processing software may retain incorrectly calculated metabolite abundances that can perpetuate in downstream analyses. Objectives: To address this problem, we propose a computational methodology that combines machine learning and peak quality metrics to filter out low quality peaks. Methods: Specifically, we comprehensively and systematically compared the performance of 24 different classifiers generated by combining eight classification algorithms and three sets of peak quality metrics on the task of distinguishing reliably integrated peaks from poorly integrated ones. These classifiers were compared to using a residual standard deviation (RSD) cut-off in pooled quality-control (QC) samples, which aims to remove peaks with analytical error. Results: The best performing classifier was found to be a combination of the AdaBoost algorithm and a set of 11 peak quality metrics previously explored in untargeted metabolomics and proteomics studies. As a complementary approach, applying our framework to peaks retained after filtering by 30% RSD across pooled QC samples was able to further distinguish poorly integrated peaks that were not removed from filtering alone. An R implementation of these classifiers and the overall computational approach is available as the MetaClean package at https://CRAN.R-project.org/package=MetaClean. Conclusion: Our work represents an important step forward in developing an automated tool for filtering out unreliable peak integrations in untargeted LC–MS metabolomics data.",
                "authors": [
                    {
                        "name": "Chetnik K."
                    },
                    {
                        "name": "Pandey G."
                    },
                    {
                        "name": "Petrick L."
                    }
                ],
                "citationCount": 4,
                "date": "2020-11-01T00:00:00Z",
                "journal": "Metabolomics",
                "title": "MetaClean: a machine learning-based classifier for reduced false positive peak detection in untargeted LC–MS metabolomics data"
            },
            "pmid": "33085002"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
