{"credit":[{"name":"Charles Chapple","typeEntity":"Person","typeRoles":["Developer"]},{"name":"Marco Mariotti","typeRoles":["Contributor"]},{"name":"Lab Roderic Guigo Group","typeEntity":"Institute","typeRoles":["Provider"]},{"name":"crg.eu","typeEntity":"Institute","typeRoles":["Provider"]},{"email":"didac.santesmasses@crg.eu","name":"Didac Santesmasses & Charles Chapple","typeEntity":"Person","typeRoles":["Primary contact"]}],"function":[{"input":[{"data":{"term":"Nucleic acid sequence","uri":"http://edamontology.org/data_2977"}}],"note":"SECISaln will predict a eukaryotic SECIS element in a nucleotide sequence, split it into its structural units and then align each unit against the SECISes in our database. SECISaln can distiguish between typeI and typeII SECIS elements and will align the submitted sequence against others of the same type. All sequences used by SECISaln have been collected from either GenBank or EGO\n\nSECISaln is not intended to replace SECISearch as a SECIS element predictor. In fact, SECISaln uses SECISearch to predict SECIS elements. The objective of this tool is to provide researchers with an easy way to compare structural features of SECIS elements. It should only be used on sequences known to contain a SECIS element. The pattern used by SECISaln to recognise SECIS elements is very permissive and would result in false positives when run on unknown sequences.","operation":[{"term":"Sequence annotation","uri":"http://edamontology.org/operation_0361"}],"output":[{"data":{"term":"Sequence-profile alignment","uri":"http://edamontology.org/data_0869"}}]}],"labels":{"toolType":["Web application"],"topic":[{"term":"Sequence sites, features and motifs","uri":"http://edamontology.org/topic_0160"}]},"publication":[{"abstract":"Summary: Selenoproteins contain the 21st amino acid selenocysteine which is encoded by an inframe UGA codon, usually read as a stop. In eukaryotes, its co-translational recoding requires the presence of an RNA stem-loop structure, the SECIS element in the 3 untranslated region of (UTR) selenoprotein mRNAs. Despite little sequence conservation, SECIS elements share the same overall secondary structure. Until recently, the lack of a significantly high number of selenoprotein mRNA sequences hampered the identification of other potential sequence conservation. In this work, the web-based tool SECISaln provides for the first time an extensive structure-based sequence alignment of SECIS elements resulting from the well-defined secondary structure of the SECIS RNA and the increased size of the eukaryotic selenoproteome. We have used SECISaln to improve our knowledge of SECIS secondary structure and to discover novel, conserved nucleotide positions and we believe it will be a useful tool for the selenoprotein and RNA scientific communities. © 2009 The Author(s).","authors":["Chapple C.E.","Guigo R.","Krol A."],"cit_count":28,"doi":"10.1093/bioinformatics/btp020","journal":"Bioinformatics","title":"SECISaln, a web-based tool for the creation of structure-based alignments of eukaryotic SECIS elements","type":"Primary","year":"2009-03-01"}],"summary":{"biotoolsCURIE":"biotools:secisaln","biotoolsID":"secisaln","description":"Predict a SECIS element in the query sequence, split it into its constituent parts and align these against a precompiled database of eukaryotic SECIS elements.","homepage":"http://big.crg.cat/services/secisaln","name":"SECISaln","version":["1"]}}