
{
    "credit": [
        {
            "email": "m.walkinshaw@ed.ac.uk",
            "name": "Malcolm D. Walkinshaw",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Residue distance calculation",
                    "uri": "http://edamontology.org/operation_2950"
                },
                {
                    "term": "Protein property calculation",
                    "uri": "http://edamontology.org/operation_0250"
                },
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java",
            "SQL"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Small molecules",
                "uri": "http://edamontology.org/topic_0154"
            },
            {
                "term": "Biophysics",
                "uri": "http://edamontology.org/topic_3306"
            },
            {
                "term": "Structure analysis",
                "uri": "http://edamontology.org/topic_0081"
            },
            {
                "term": "Data mining",
                "uri": "http://edamontology.org/topic_3473"
            }
        ]
    },
    "publication": [
        {
            "abstract": "We present the relational database EDULISS (EDinburgh University Ligand Selection System), which stores structural, physicochemical and pharmacophoric properties of small molecules. The database comprises a collection of over 4 million commercially available compounds from 28 different suppliers. A user-friendly web-based interface for EDULISS (available at http://eduliss .bch.ed.ac.uk/) has been established providing a number of data-mining possibilities. For each compound a single 3D conformer is stored along with over 1600 calculated descriptor values (molecular properties). A very efficient method for unique compound recognition, especially for a large scale database, is demonstrated by making use of small subgroups of the descriptors. Many of the shape and distance descriptors are held as pre-calculated bit strings permitting fast and efficient similarity and pharmacophore searches which can be used to identify families of related compounds for biological testing. Two ligand searching applications are given to demonstrate how EDULISS can be used to extract families of molecules with selected structural and biophysical features. © The Author(s) 2010.",
            "authors": [
                "Hsin K.-Y.",
                "Morgan H.P.",
                "Shave S.R.",
                "Hinton A.C.",
                "Taylor P.",
                "Walkinshaw M.D."
            ],
            "cit_count": 17,
            "journal": "Nucleic Acids Research",
            "pmid": "21051336",
            "title": "EDULISS: A small-molecule database with data-mining and pharmacophore searching capabilities",
            "year": "2011-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:eduliss",
        "biotoolsID": "eduliss",
        "description": "Database stores structural, physicochemical and pharmacophoric properties of small molecules. For each compound a single 3D conformer is stored along with over 1600 calculated descriptor values (molecular properties). A very efficient method for unique compound recognition is demonstrated by making use of small subgroups of the descriptors.",
        "homepage": "http://eduliss.bch.ed.ac.uk/",
        "name": "EDULISS"
    }
}