{
    "name": "GUILDify", 
    "description": "Uses network-topology based prioritization algorithms in GUILD to score relevance of gene products with respect to given keywords. First, BIANA knowledge base containing data integrated from publicly available major data repositories is queried for gene products associated with the keywords. These gene products are fed to a species-specific interaction network as seed proteins. Finally, a score of relevance for each gene product in the network is calculated by the prioritization algorithm.", 
    "homepage": "http://sbi.imim.es/web/GUILDify.php", 
    "biotoolsID": "guildify", 
    "biotoolsCURIE": "biotools:guildify", 
    "version": [
        "1.0"
    ], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3501", 
                    "term": "Enrichment analysis"
                }
            ], 
            "input": [
                {
                    "data": {
                        "uri": "http://edamontology.org/data_2339", 
                        "term": "Ontology concept name"
                    }, 
                    "format": [
                        {
                            "uri": "http://edamontology.org/format_1963", 
                            "term": "UniProtKB format"
                        }
                    ]
                }
            ], 
            "output": [
                {
                    "data": {
                        "uri": "http://edamontology.org/data_2600", 
                        "term": "Pathway or network"
                    }, 
                    "format": [
                        {
                            "uri": "http://edamontology.org/format_3619", 
                            "term": "sif"
                        }
                    ]
                }
            ], 
            "note": "Gene prioritization of genes associated with phenotype and diseases Starting seeds: genes associated with a disease\nor\nKeyword(s) of a phenotype or disease Network of associated proteins and drugs", 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web API"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3396", 
            "term": "Systems medicine"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "http://sbi.imim.es/web/GUILDify.php/doc", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btu092", 
            "pmid": "24532728", 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "GUILDify: A web server for phenotypic characterization of genes through biological data integration and network-based prioritization algorithms", 
                "abstract": "Determining genetic factors underlying various phenotypes is hindered by the involvement of multiple genes acting cooperatively. Over the past years, disease-gene prioritization has been central to identify genes implicated in human disorders. Special attention has been paid on using physical interactions between the proteins encoded by the genes to link them with diseases. Such methods exploit the guilt-by-association principle in the protein interaction network to uncover novel disease-gene associations. These methods rely on the proximity of a gene in the network to the genes associated with a phenotype and require a set of initial associations. Here, we present GUILDify, an easy-to-use web server for the phenotypic characterization of genes. GUILDify offers a prioritization approach based on the protein-protein interaction network where the initial phenotype-gene associations are retrieved via free text search on biological databases. GUILDify web server does not restrict the prioritization to any predefined phenotype, supports multiple species and accepts user-specified genes. It also prioritizes drugs based on the ranking of their targets, unleashing opportunities for repurposing drugs for novel therapies. © 2014 The Author. Published by Oxford University Press. All rights reserved.", 
                "date": "2014-06-15T00:00:00Z", 
                "citationCount": 16, 
                "authors": [
                    {
                        "name": "Guney E."
                    }, 
                    {
                        "name": "Garcia-Garcia J."
                    }, 
                    {
                        "name": "Oliva B."
                    }
                ], 
                "journal": "Bioinformatics"
            }
        }, 
        {
            "doi": null, 
            "pmid": "23028459", 
            "pmcid": null, 
            "type": "Other", 
            "version": null, 
            "metadata": {
                "title": "Exploiting Protein-Protein Interaction Networks for Genome-Wide Disease-Gene Prioritization", 
                "abstract": "Complex genetic disorders often involve products of multiple genes acting cooperatively. Hence, the pathophenotype is the outcome of the perturbations in the underlying pathways, where gene products cooperate through various mechanisms such as protein-protein interactions. Pinpointing the decisive elements of such disease pathways is still challenging. Over the last years, computational approaches exploiting interaction network topology have been successfully applied to prioritize individual genes involved in diseases. Although linkage intervals provide a list of disease-gene candidates, recent genome-wide studies demonstrate that genes not associated with any known linkage interval may also contribute to the disease phenotype. Network based prioritization methods help highlighting such associations. Still, there is a need for robust methods that capture the interplay among disease-associated genes mediated by the topology of the network. Here, we propose a genome-wide network-based prioritization framework named GUILD. This framework implements four network-based disease-gene prioritization algorithms. We analyze the performance of these algorithms in dozens of disease phenotypes. The algorithms in GUILD are compared to state-of-the-art network topology based algorithms for prioritization of genes. As a proof of principle, we investigate top-ranking genes in Alzheimer's disease (AD), diabetes and AIDS using disease-gene associations from various sources. We show that GUILD is able to significantly highlight disease-gene associations that are not used a priori. Our findings suggest that GUILD helps to identify genes implicated in the pathology of human disorders independent of the loci associated with the disorders. © 2012 Guney, Oliva.", 
                "date": "2012-09-21T00:00:00Z", 
                "citationCount": 49, 
                "authors": [
                    {
                        "name": "Guney E."
                    }, 
                    {
                        "name": "Oliva B."
                    }
                ], 
                "journal": "PLoS ONE"
            }
        }
    ], 
    "credit": [
        {
            "name": "Emre Guney", 
            "email": "emre.guney@upf.edu", 
            "url": null, 
            "orcidid": "http://orcid.org/0000-0002-3466-6535", 
            "typeEntity": "Person", 
            "typeRole": [
                "Developer"
            ], 
            "note": null
        }, 
        {
            "name": "Javier Garcia-Garcia", 
            "email": null, 
            "url": null, 
            "orcidid": "http://orcid.org/0000-0001-9539-2606", 
            "typeEntity": null, 
            "typeRole": [
                "Contributor"
            ], 
            "note": null
        }, 
        {
            "name": "UPF", 
            "email": null, 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Institute", 
            "typeRole": [
                "Provider"
            ], 
            "note": null
        }, 
        {
            "name": "MICINN/MINECO & FEBS BIO2011-22568", 
            "email": null, 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Funding agency", 
            "typeRole": [
                "Contributor"
            ], 
            "note": null
        }, 
        {
            "name": "upf.edu", 
            "email": null, 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Institute", 
            "typeRole": [
                "Provider"
            ], 
            "note": null
        }, 
        {
            "name": null, 
            "email": "baldo.oliva@upf.edu", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "baldo.oliva@upf.edu", 
    "additionDate": "2016-04-22T11:32:13Z", 
    "lastUpdate": "2019-01-10T05:02:13Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}