{
    "additionDate": "2019-11-14T20:08:56Z",
    "biotoolsCURIE": "biotools:wenda",
    "biotoolsID": "wenda",
    "confidence_flag": "low",
    "credit": [
        {
            "email": "lisa.handl@uni-tuebingen.de",
            "name": "Lisa Handl",
            "typeEntity": "Person"
        },
        {
            "email": "pfeifer@informatik.uni-tuebingen.de",
            "name": "Nico Pfeifer",
            "typeEntity": "Person"
        }
    ],
    "description": "> LOW CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'IMPLEMENTATION:Source', 'unsupervised', 'MOTIVATION:Predictive' | Weighted elastic net for unsupervised domain adaptation with application to age prediction from DNA methylation data | Weighted elastic net for domain adaptation | Wenda: Weighted Elastic Net for Unsupervised Domain Adaptation | This repository contains the source code for wenda, a method for unsupervised domain adaptation based on a weighted elastic net. The details of the method are published here:",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Post-translation modification site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                }
            ]
        }
    ],
    "homepage": "https://github.com/PfeiferLabTue/wenda",
    "language": [
        "Python"
    ],
    "lastUpdate": "2019-11-14T20:08:56Z",
    "license": "GPL-3.0",
    "name": "wenda",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ338",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Motivation: Predictive models are a powerful tool for solving complex problems in computational biology. They are typically designed to predict or classify data coming from the same unknown distribution as the training data. In many real-world settings, however, uncontrolled biological or technical factors can lead to a distribution mismatch between datasets acquired at different times, causing model performance to deteriorate on new data. A common additional obstacle in computational biology is scarce data with many more features than samples. To address these problems, we propose a method for unsupervised domain adaptation that is based on a weighted elastic net. The key idea of our approach is to compare dependencies between inputs in training and test data and to increase the cost of differently behaving features in the elastic net regularization term. In doing so, we encourage the model to assign a higher importance to features that are robust and behave similarly across domains. Results: We evaluate our method both on simulated data with varying degrees of distribution mismatch and on real data, considering the problem of age prediction based on DNA methylation data across multiple tissues. Compared with a non-adaptive standard model, our approach substantially reduces errors on samples with a mismatched distribution. On real data, we achieve far lower errors on cerebellum samples, a tissue which is not part of the training data and poorly predicted by standard models. Our results demonstrate that unsupervised domain adaptation is possible for applications in computational biology, even with many more features than samples.",
                "authors": [
                    {
                        "name": "Handl L."
                    },
                    {
                        "name": "Jalali A."
                    },
                    {
                        "name": "Scherer M."
                    },
                    {
                        "name": "Eggeling R."
                    },
                    {
                        "name": "Pfeifer N."
                    }
                ],
                "date": "2019-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Weighted elastic net for unsupervised domain adaptation with application to age prediction from DNA methylation data"
            },
            "pmcid": "PMC6612879",
            "pmid": "31510704"
        }
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Geriatric medicine",
            "uri": "http://edamontology.org/topic_3399"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}