{
    "additionDate": "2021-01-18T11:37:08Z",
    "biotoolsCURIE": "biotools:3d-xguide",
    "biotoolsID": "3d-xguide",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Ina Vernikouskaya",
            "typeEntity": "Person"
        }
    ],
    "description": "3D-XGuide is a software framework providing a foundation for rapid prototyping of new approaches in the field of XR navigation guidance. Actual software release offers graphical user interface with basic functionality including data import and handling, calculation of projection geometry and transformations between related coordinate systems, rigid 3D-3D registration, and template-matching-based tracking and motion compensation algorithms in 2D and 3D.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ExCaVI-Ulm/3D-XGuide",
    "language": [
        "C++"
    ],
    "lastUpdate": "2021-01-19T10:45:41Z",
    "license": "BSD-2-Clause",
    "name": "3D-XGuide",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1007/S11548-020-02274-0",
            "metadata": {
                "abstract": "© 2020, The Author(s).Purpose: With the growing availability and variety of imaging modalities, new methods of intraoperative support have become available for all kinds of interventions. The basic principles of image fusion and image guidance have been widely adopted and are commercialized through a number of platforms. Although multimodal systems have been found to be useful for guiding interventional procedures, they all have their limitations. The integration of more advanced guidance techniques into the product functionality is, however, not easy due to the proprietary solutions of the vendors. Therefore, the purpose of this work is to introduce a software system for image fusion, real-time navigation, and working points documentation during transcatheter interventions performed under X-ray (XR) guidance. Methods: An interactive software system for cross-modal registration and image fusion of XR fluoroscopy with CT or MRI-derived anatomic 3D models is implemented using Qt application framework and VTK visualization pipeline. DICOM data can be imported in retrospective mode. Live XR data input is realized by a video capture card application interface. Results: The actual software release offers a graphical user interface with basic functionality including data import and handling, calculation of projection geometry and transformations between related coordinate systems, rigid 3D-3D registration, and template matching-based tracking and motion compensation algorithms in 2D and 3D. The link to the actual software release on GitHub including source code and executable is provided to support independent research and development in the field of intervention guidance. Conclusion: The introduced system provides a common foundation for the rapid prototyping of new approaches in the field of XR fluoroscopic guidance. As a pure software solution, the developed system is potentially vendor-independent and can be easily extended to be used with the XR systems of different manufacturers.",
                "authors": [
                    {
                        "name": "Vernikouskaya I."
                    },
                    {
                        "name": "Bertsche D."
                    },
                    {
                        "name": "Rottbauer W."
                    },
                    {
                        "name": "Rasche V."
                    }
                ],
                "citationCount": 1,
                "date": "2021-01-01T00:00:00Z",
                "journal": "International Journal of Computer Assisted Radiology and Surgery",
                "title": "3D-XGuide: open-source X-ray navigation guidance system"
            },
            "pmid": "33057891"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Echography",
            "uri": "http://edamontology.org/topic_3954"
        },
        {
            "term": "Anatomy",
            "uri": "http://edamontology.org/topic_3067"
        }
    ],
    "validated": 1
}