{
    "additionDate": "2021-01-18T09:01:58Z",
    "biotoolsCURIE": "biotools:retip",
    "biotoolsID": "retip",
    "confidence_flag": "tool",
    "description": "Retention Time Prediction for Compound Annotation in Untargeted Metabolomics.\n\nRetip is an R package for predicting Retention Time (RT) for small molecules in a high pressure liquid chromatography (HPLC) Mass Spectrometry analysis.\n\nRetip - Retention Time prediction for Metabolomics.\n\nRetip: Retention Time Prediction for Compound Annotation in Untargeted Metabolomics Paolo Bonini, Tobias Kind, Hiroshi Tsugawa, Dinesh Kumar Barupal, and Oliver Fiehn Analytical Chemistry 2020 92 (11), 7515-7522 DOI: 10.1021/acs.analchem.9b05765.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Retention time prediction",
                    "uri": "http://edamontology.org/operation_3633"
                },
                {
                    "term": "Spectrum calculation",
                    "uri": "http://edamontology.org/operation_3860"
                },
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                }
            ]
        }
    ],
    "homepage": "https://www.retip.app",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-06T13:53:15Z",
    "name": "Retip",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1021/ACS.ANALCHEM.9B05765",
            "metadata": {
                "abstract": "Copyright © 2020 American Chemical Society.Unidentified peaks remain a major problem in untargeted metabolomics by LC-MS/MS. Confidence in peak annotations increases by combining MS/MS matching and retention time. We here show how retention times can be predicted from molecular structures. Two large, publicly available data sets were used for model training in machine learning: the Fiehn hydrophilic interaction liquid chromatography data set (HILIC) of 981 primary metabolites and biogenic amines,and the RIKEN plant specialized metabolome annotation (PlaSMA) database of 852 secondary metabolites that uses reversed-phase liquid chromatography (RPLC). Five different machine learning algorithms have been integrated into the Retip R package: the random forest, Bayesian-regularized neural network, XGBoost, light gradient-boosting machine (LightGBM), and Keras algorithms for building the retention time prediction models. A complete workflow for retention time prediction was developed in R. It can be freely downloaded from the GitHub repository (https://www.retip.app). Keras outperformed other machine learning algorithms in the test set with minimum overfitting, verified by small error differences between training, test, and validation sets. Keras yielded a mean absolute error of 0.78 min for HILIC and 0.57 min for RPLC. Retip is integrated into the mass spectrometry software tools MS-DIAL and MS-FINDER, allowing a complete compound annotation workflow. In a test application on mouse blood plasma samples, we found a 68% reduction in the number of candidate structures when searching all isomers in MS-FINDER compound identification software. Retention time prediction increases the identification rate in liquid chromatography and subsequently leads to an improved biological interpretation of metabolomics data.",
                "authors": [
                    {
                        "name": "Bonini P."
                    },
                    {
                        "name": "Kind T."
                    },
                    {
                        "name": "Tsugawa H."
                    },
                    {
                        "name": "Barupal D.K."
                    },
                    {
                        "name": "Fiehn O."
                    }
                ],
                "citationCount": 12,
                "date": "2020-06-02T00:00:00Z",
                "journal": "Analytical Chemistry",
                "title": "Retip: Retention Time Prediction for Compound Annotation in Untargeted Metabolomics"
            },
            "pmid": "32390414"
        }
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        },
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        }
    ]
}