{
    "additionDate": "2021-03-19T09:03:07Z",
    "biotoolsCURIE": "biotools:cancer-sigvar",
    "biotoolsID": "cancer-sigvar",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "xiongyun@genomics.cn",
            "name": "Yun Xiong",
            "typeEntity": "Person"
        }
    ],
    "description": "Cancer SIGVARA is a semiautomated interpretation tool for germline variants of hereditary cancer-related genes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant classification",
                    "uri": "http://edamontology.org/operation_3225"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Variant filtering",
                    "uri": "http://edamontology.org/operation_3675"
                },
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "homepage": "http://cancersigvar.bgi.com/",
    "lastUpdate": "2021-04-22T07:32:23Z",
    "name": "Cancer SIGVAR",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1002/HUMU.24177",
            "metadata": {
                "abstract": "© 2021 Wiley Periodicals LLCCancer is one of the most important health issues globally and the accuracy of interpretation of cancer-related variants is critical for the clinical management of hereditary cancer. ClinGen Sequence Variant Interpretation Working Groups have developed many adaptations of American College of Medical Genetics and Genomics and the Association of Molecular Pathologists guidelines to improve the consistency of interpretation. We combined the most recent adaptations to expand the number of the criteria from 28 to 48 and developed a tool called Cancer SIGVAR to help genetic counselors interpret the clinical significance of cancer germline variants. Our tool can accept VCF files as input and realize fully automated interpretation based on 21 criteria and semiautomated interpretation based on 48 criteria. We validated the performance of our tool with the ClinVar and CLINVITAE benchmark databases, achieving an average consistency for pathogenic and benign assessment up to 93.71% and 79.38%, respectively. We compared Cancer SIGVAR with two similar tools, InterVar and PathoMAN, and analyzed the main differences in criteria and implementation. Furthermore, we selected 911 variants from another two in-house benchmark databases, and semiautomated interpretation reached an average classification consistency of 98.35%. Our findings highlight the need to optimize automated interpretation tools based on constantly updated guidelines. Cancer SIGVAR is publicly available at http://cancersigvar.bgi.com/.",
                "authors": [
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "Liu S."
                    },
                    {
                        "name": "Wang S."
                    },
                    {
                        "name": "Zeng Q."
                    },
                    {
                        "name": "Chen Y."
                    },
                    {
                        "name": "Fang T."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Zhou Y."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Wang K."
                    },
                    {
                        "name": "Yan Z."
                    },
                    {
                        "name": "Qiang C."
                    },
                    {
                        "name": "Xu M."
                    },
                    {
                        "name": "Chai X."
                    },
                    {
                        "name": "Yuan Y."
                    },
                    {
                        "name": "Huang M."
                    },
                    {
                        "name": "Zhang H."
                    },
                    {
                        "name": "Xiong Y."
                    }
                ],
                "date": "2021-04-01T00:00:00Z",
                "journal": "Human Mutation",
                "title": "Cancer SIGVAR: A semiautomated interpretation tool for germline variants of hereditary cancer-related genes"
            },
            "pmid": "33565189"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ]
}