{
    "additionDate": "2022-05-29T17:37:23.895655Z",
    "biotoolsCURIE": "biotools:repexplore",
    "biotoolsID": "repexplore",
    "collectionID": [
        "LCSB",
        "LCSB-BDS",
        "UniLu"
    ],
    "credit": [
        {
            "email": "enrico.glaab@uni.lu",
            "name": "Enrico Glaab",
            "orcidid": "https://orcid.org/0000-0003-3977-7469"
        }
    ],
    "description": "RepExplore is a web-service for omics data analysis exploiting the information captured in the variance of technical replicates to provide more reliable and informative differential expression and abundance statistics, as well as low-dimensional data visualizations.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://lcsb-repexplore.uni.lu",
    "lastUpdate": "2022-07-21T11:28:36.718818Z",
    "name": "RepExplore",
    "owner": "enricogl",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2015 The Author 2015. Published by Oxford University Press.Summary: High-throughput omics datasets often contain technical replicates included to account for technical sources of noise in the measurement process. Although summarizing these replicate measurements by using robust averages may help to reduce the influence of noise on downstream data analysis, the information on the variance across the replicate measurements is lost in the averaging process and therefore typically disregarded in subsequent statistical analyses. We introduce RepExplore, a web-service dedicated to exploit the information captured in the technical replicate variance to provide more reliable and informative differential expression and abundance statistics for omics datasets. The software builds on previously published statistical methods, which have been applied successfully to biomedical omics data but are difficult to use without prior experience in programming or scripting. RepExplore facilitates the analysis by providing a fully automated data processing and interactive ranking tables, whisker plot, heat map and principal component analysis visualizations to interpret omics data and derived statistics. Availability and implementation: Freely available at http://www.repexplore.tk.",
                "authors": [
                    {
                        "name": "Glaab E."
                    },
                    {
                        "name": "Schneider R."
                    }
                ],
                "citationCount": 11,
                "date": "2015-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "RepExplore: Addressing technical replicate variance in proteomics and metabolomics data analysis"
            },
            "pmid": "25717197"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        },
        {
            "term": "Functional genomics",
            "uri": "http://edamontology.org/topic_0085"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}
