
{
    "credit": [
        {
            "email": "hongshan.jiang@gmail.com",
            "name": "Jiang Hongshan",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://sourceforge.net/p/skewer/wiki/Home/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Read pre-processing",
                    "uri": "http://edamontology.org/operation_3219"
                },
                {
                    "term": "Primer removal",
                    "uri": "http://edamontology.org/operation_3237"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++"
        ],
        "maturity": "Mature",
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "RNA-Seq",
                "uri": "http://edamontology.org/topic_3170"
            },
            {
                "term": "Sequence assembly",
                "uri": "http://edamontology.org/topic_0196"
            },
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Background: Adapter trimming is a prerequisite step for analyzing next-generation sequencing (NGS) data when the reads are longer than the target DNA/RNA fragments. Although typically used in small RNA sequencing, adapter trimming is also used widely in other applications, such as genome DNA sequencing and transcriptome RNA/cDNA sequencing, where fragments shorter than a read are sometimes obtained because of the limitations of NGS protocols. For the newly emerged Nextera long mate-pair (LMP) protocol, junction adapters are located in the middle of all properly constructed fragments; hence, adapter trimming is essential to gain the correct paired reads. However, our investigations have shown that few adapter trimming tools meet both efficiency and accuracy requirements simultaneously. The performances of these tools can be even worse for paired-end and/or mate-pair sequencing.Results: To improve the efficiency of adapter trimming, we devised a novel algorithm, the bit-masked k-difference matching algorithm, which has O(kn) expected time with O(m) space, where k is the maximum number of differences allowed, n is the read length, and m is the adapter length. This algorithm makes it possible to fully enumerate all candidates that meet a specified threshold, e.g. error ratio, within a short period of time. To improve the accuracy of this algorithm, we designed a simple and easy-to-explain statistical scoring scheme to evaluate candidates in the pattern matching step. We also devised scoring schemes to fully exploit the paired-end/mate-pair information when it is applicable. All these features have been implemented in an industry-standard tool named Skewer (https://sourceforge.net/projects/skewer). Experiments on simulated data, real data of small RNA sequencing, paired-end RNA sequencing, and Nextera LMP sequencing showed that Skewer outperforms all other similar tools that have the same utility. Further, Skewer is considerably faster than other tools that have comparative accuracies; namely, one times faster for single-end sequencing, more than 12 times faster for paired-end sequencing, and 49% faster for LMP sequencing.Conclusions: Skewer achieved as yet unmatched accuracies for adapter trimming with low time bound. © 2014 Jiang et al.; licensee BioMed Central Ltd.",
            "authors": [
                "Jiang H.",
                "Lei R.",
                "Ding S.-W.",
                "Zhu S."
            ],
            "cit_count": 174,
            "journal": "BMC Bioinformatics",
            "pmid": "24925680",
            "title": "Skewer: A fast and accurate adapter trimmer for next-generation sequencing paired-end reads",
            "year": "2014-06-12"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:skewer",
        "biotoolsID": "skewer",
        "description": "Skewer implements a novel dynamic programming algorithm dedicated to the task of adapter trimming and it is specially designed for processing illumina paired-end sequences.",
        "homepage": "https://sourceforge.net/projects/skewer/",
        "name": "Skewer"
    }
}