{
    "additionDate": "2021-01-18T10:05:13Z",
    "biotoolsCURIE": "biotools:recbic",
    "biotoolsID": "recbic",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "guojunsdu@gmail.com",
            "name": "Guojun Li",
            "typeEntity": "Person"
        }
    ],
    "description": "A fast and accurate algorithm recognizing trend-preserving biclusters.",
    "download": [
        {
            "type": "Source code",
            "url": "https://zenodo.org/record/3842717"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression profile clustering",
                    "uri": "http://edamontology.org/operation_0313"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "homepage": "https://github.com/holyzews/RecBic/tree/master/RecBic/",
    "lastUpdate": "2021-03-20T10:38:40Z",
    "name": "RecBic",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA630",
            "metadata": {
                "abstract": "© The Author(s) 2020.Motivation: Biclustering has emerged as a powerful approach to identifying functional patterns in complex biological data. However, existing tools are limited by their accuracy and efficiency to recognize various kinds of complex biclusters submerged in ever large datasets. We introduce a novel fast and highly accurate algorithm RecBic to identify various forms of complex biclusters in gene expression datasets. Results: We designed RecBic to identify various trend-preserving biclusters, particularly, those with narrow shapes, i.e. clusters where the number of genes is larger than the number of conditions/samples. Given a gene expression matrix, RecBic starts with a column seed, and grows it into a full-sized bicluster by simply repetitively comparing real numbers. When tested on simulated datasets in which the elements of implanted trend-preserving biclusters and those of the background matrix have the same distribution, RecBic was able to identify the implanted biclusters in a nearly perfect manner, outperforming all the compared salient tools in terms of accuracy and robustness to noise and overlaps between the clusters. Moreover, RecBic also showed superiority in identifying functionally related genes in real gene expression datasets.",
                "authors": [
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Li D."
                    },
                    {
                        "name": "Liu J."
                    },
                    {
                        "name": "Su Z."
                    },
                    {
                        "name": "Li G."
                    }
                ],
                "citationCount": 3,
                "date": "2020-10-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "RecBic: A fast and accurate algorithm recognizing trend-preserving biclusters"
            },
            "pmid": "32653907"
        }
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}