{
    "additionDate": "2021-01-18T09:10:56Z",
    "biotoolsCURIE": "biotools:gcncda",
    "biotoolsID": "gcncda",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "leiwang@ms.xjb.ac.cn",
            "name": "Lei Wang",
            "orcidid": "https://orcid.org/0000-0003-0184-307X",
            "typeEntity": "Person"
        },
        {
            "email": "zhuhongyou@ms.xjb.ac.cn",
            "name": "Zhu-Hong You",
            "orcidid": "https://orcid.org/0000-0003-1266-2696",
            "typeEntity": "Person"
        }
    ],
    "description": "A new method for predicting circRNA-disease associations based on Graph Convolutional Network Algorithm.\n\n\n\n||| HOMEPAGE BROKEN!",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Recombination detection",
                    "uri": "http://edamontology.org/operation_0451"
                }
            ]
        }
    ],
    "homepage": "https://github.com/wjq0323/GCNCDA",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-01-22T17:56:18Z",
    "name": "GCNCDA",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1007568",
            "metadata": {
                "abstract": "© 2020 Wang et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Numerous evidences indicate that Circular RNAs (circRNAs) are widely involved in the occurrence and development of diseases. Identifying the association between circRNAs and diseases plays a crucial role in exploring the pathogenesis of complex diseases and improving the diagnosis and treatment of diseases. However, due to the complex mechanisms between circRNAs and diseases, it is expensive and time-consuming to discover the new circRNA-disease associations by biological experiment. Therefore, there is increasingly urgent need for utilizing the computational methods to predict novel circRNA-disease associations. In this study, we propose a computational method called GCNCDA based on the deep learning Fast learning with Graph Convolutional Networks (FastGCN) algorithm to predict the potential disease-associated circRNAs. Specifically, the method first forms the unified descriptor by fusing disease semantic similarity information, disease and circRNA Gaussian Interaction Profile (GIP) kernel similarity information based on known circRNAdisease associations. The FastGCN algorithm is then used to objectively extract the high-level features contained in the fusion descriptor. Finally, the new circRNA-disease associations are accurately predicted by the Forest by Penalizing Attributes (Forest PA) classifier. The 5-fold cross-validation experiment of GCNCDA achieved 91.2% accuracy with 92.78% sensitivity at the AUC of 90.90% on circR2Disease benchmark dataset. In comparison with different classifier models, feature extraction models and other state-of-the-art methods, GCNCDA shows strong competitiveness. Furthermore, we conducted case study experiments on diseases including breast cancer, glioma and colorectal cancer. The results showed that 16, 15 and 17 of the top 20 candidate circRNAs with the highest prediction scores were respectively confirmed by relevant literature and databases. These results suggest that GCNCDA can effectively predict potential circRNA-disease associations and provide highly credible candidates for biological experiments.",
                "authors": [
                    {
                        "name": "Huang Y.-A."
                    },
                    {
                        "name": "Li Y.-M."
                    },
                    {
                        "name": "Wang L."
                    },
                    {
                        "name": "You Z.-H."
                    },
                    {
                        "name": "Zheng K."
                    }
                ],
                "citationCount": 17,
                "date": "2020-05-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "GCNCDA: A new method for predicting circRNA-disease associations based on Graph Convolutional Network Algorithm"
            },
            "pmcid": "PMC7266350",
            "pmid": "32433655"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Electron microscopy",
            "uri": "http://edamontology.org/topic_0611"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}
