{
    "additionDate": "2018-07-02T23:37:25Z",
    "biotoolsCURIE": "biotools:gwas4d",
    "biotoolsID": "gwas4d",
    "credit": [
        {
            "email": "mulin0424.li@gmail.com",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Systematically evaluates GWAS signals and identifies context-specific regulatory variants. The updated web server includes six major features: (i) updates the regulatory variant prioritization method with our new algorithm; (ii) incorporates 127 tissue/cell type-specific epigenomes data; (iii) integrates motifs of 1480 transcriptional regulators from 13 public resources; (iv) uniformly processes Hi-C data and generates significant interactions at 5 kb resolution across 60 tissues/cell types; (v) adds comprehensive non-coding variant functional annotations; (vi) equips a highly interactive visualization function for SNP-target interaction.",
    "documentation": [
        {
            "type": [
                "Training material"
            ],
            "url": "http://mulinlab.tmu.edu.cn/gwas4d/gwas4d/gwas4d/gwas4d_help"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Transcriptional regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0438"
                }
            ]
        }
    ],
    "homepage": "http://mulinlab.tmu.edu.cn/gwas4d",
    "language": [
        "JavaScript",
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "GWAS4D",
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.1093/nar/gky407",
            "metadata": {
                "abstract": "© The Author(s) 2018. Published by Oxford University Press on behalf of Nucleic Acids Research.Genome-wide association studies have generated over thousands of susceptibility loci for many human complex traits, and yet for most of these associations the true causal variants remain unknown. Tissue/cell type-specific prediction and prioritization of non-coding regulatory variants will facilitate the identification of causal variants and underlying pathogenic mechanisms for particular complex diseases and traits. By leveraging recent large-scale functional genomics/epigenomics data, we develop an intuitive web server, GWAS4D (http://mulinlab.tmu.edu.cn/gwas4d or http://mulinlab.org/gwas4d), that systematically evaluates GWAS signals and identifies context-specific regulatory variants. The updated web server includes six major features: (i) updates the regulatory variant prioritization method with our new algorithm; (ii) incorporates 127 tissue/cell type-specific epigenomes data; (iii) integrates motifs of 1480 transcriptional regulators from 13 public resources; (iv) uniformly processes Hi-C data and generates significant interactions at 5 kb resolution across 60 tissues/cell types; (v) adds comprehensive non-coding variant functional annotations; (vi) equips a highly interactive visualization function for SNP-target interaction. Using a GWAS fine-mapped set for 161 coronary artery disease risk loci, we demonstrate that GWAS4D is able to efficiently prioritize disease-causal regulatory variants.",
                "authors": [
                    {
                        "name": "Huang D."
                    },
                    {
                        "name": "Yi X."
                    },
                    {
                        "name": "Zhang S."
                    },
                    {
                        "name": "Zheng Z."
                    },
                    {
                        "name": "Wang P."
                    },
                    {
                        "name": "Xuan C."
                    },
                    {
                        "name": "Sham P.C."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Li M.J."
                    }
                ],
                "citationCount": 12,
                "date": "2018-07-02T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "GWAS4D: Multidimensional analysis of context-specific regulatory variant for human complex diseases and traits"
            }
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}