{
    "additionDate": "2017-08-03T18:37:43Z",
    "biotoolsCURIE": "biotools:biocellion",
    "biotoolsID": "biocellion",
    "collectionID": [
        "PerMedCoE"
    ],
    "credit": [
        {
            "email": "info@biocellion.com",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.systemsbiology.org/shmulevich-group"
        }
    ],
    "description": "Agent-PDE (Partial Differential Equation) based simulation framework, designed for solving general models of multicellular biological systems.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://biocellion.com/documentation/Biocellion-1.2.pdf"
        }
    ],
    "editPermission": {
        "authors": [
            "tntiniak"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "http://biocellion.com/",
    "lastUpdate": "2022-04-28T14:24:58.076480Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/biocellion-1-1-computer-simulation-of-living-cell-systems.html"
        }
    ],
    "name": "Biocellion",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© The Author 2014. Published by Oxford University Press.Motivation: Biological system behaviors are often the outcome of complex interactions among a large number of cells and their biotic and abiotic environment. Computational biologists attempt to understand, predict and manipulate biological system behavior through mathematical modeling and computer simulation. Discrete agent-based modeling (in combination with high-resolution grids to model the extracellular environment) is a popular approach for building biological system models. However, the computational complexity of this approach forces computational biologists to resort to coarser resolution approaches to simulate large biological systems. High-performance parallel computers have the potential to address the computing challenge, but writing efficient software for parallel computers is difficult and time-consuming. Results: We have developed Biocellion, a high-performance software framework, to solve this computing challenge using parallel computers. To support a wide range of multicellular biological system models, Biocellion asks users to provide their model specifics by filling the function body of pre-defined model routines. Using Biocellion, modelers without parallel computing expertise can efficiently exploit parallel computers with less effort than writing sequential programs from scratch. We simulate cell sorting, microbial patterning and a bacterial system in soil aggregate as case studies.",
                "authors": [
                    {
                        "name": "Flann N."
                    },
                    {
                        "name": "Kahan S."
                    },
                    {
                        "name": "Kang S."
                    },
                    {
                        "name": "McDermott J."
                    },
                    {
                        "name": "Shmulevich I."
                    }
                ],
                "citationCount": 53,
                "date": "2014-05-28T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Biocellion: Accelerating computer simulation of multicellular biological system models"
            },
            "pmid": "25064572"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Applied mathematics",
            "uri": "http://edamontology.org/topic_3569"
        },
        {
            "term": "Simulation experiment",
            "uri": "http://edamontology.org/topic_3524"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        }
    ],
    "validated": 1
}
