{
    "additionDate": "2017-02-14T09:36:48Z",
    "biotoolsCURIE": "biotools:miru-vntrplus",
    "biotoolsID": "miru-vntrplus",
    "credit": [
        {
            "name": "Contact form",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.miru-vntrplus.org/MIRU/contact.faces;jsessionid=71885ACDD91E0D1F6A503FF6B754E145"
        }
    ],
    "description": "Allows users to analyze genotyping data of their Mycobacterium tuberculosis strains either alone or in comparison with the reference DB of strains. The web server also includes tools to search for similar strains, phylogenetic analysis and mapping of geographic information.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.miru-vntrplus.org/MIRU/help/help.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree comparison",
                    "uri": "http://edamontology.org/operation_0325"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "homepage": "http://www.miru-vntrplus.org",
    "lastUpdate": "2018-12-10T12:58:55Z",
    "name": "MIRU-VNTRplus",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Harmonized typing of bacteria and easy identification of locally or internationally circulating clones are essential for epidemiological surveillance and disease control. For Mycobacterium tuberculosis complex (MTBC) species, multi-locus variable number tandem repeat analysis (MLVA) targeting mycobacterial interspersed repetitive units (MIRU) has been internationally adopted as the new standard, portable, reproducible and discriminatory typing method. However, no specialized bioinformatics web tools are available for analysing MLVA data in combination with other, complementary typing data. Therefore, we have developed the web application MIRU-VNTRplus (http://www.miruvntrplus. org). This freely accessible service allows users to analyse genotyping data of their strains alone or in comparison with a reference database of strains representing the major MTBC lineages. Analysis and comparisons of genotypes can be based on MLVA-, spoligotype-, large sequence polymorphism and single nucleotide polymorphism data, or on a weighted combination of these markers. Tools for data exploration include search for similar strains, creation of phylogenetic and minimum spanning trees and mapping of geographic information. To facilitate scientific communication, an expanding genotype nomenclature (MLVA MtbC15-9 type) that can be queried via a web-or a SOAP-interface has been implemented. An extensive documentation guides users through all application functions. © The Author(s) 2010. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Weniger T."
                    },
                    {
                        "name": "Krawczyk J."
                    },
                    {
                        "name": "Supply P."
                    },
                    {
                        "name": "Niemann S."
                    },
                    {
                        "name": "Harmsen D."
                    }
                ],
                "citationCount": 258,
                "date": "2010-05-10T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "MIRU-VNTRplus: A web tool for polyphasic genotyping of Mycobacterium tuberculosis complex bacteria"
            },
            "pmid": "20457747"
        },
        {
            "metadata": {
                "abstract": "Because of its portable data, discriminatory power, and recently proposed standardization, mycobacterial interspersed repetitive-unit-variable-number tandem-repeat (MIRU-VNTR) typing has become a major method for the epidemiological tracking of Mycobacterium tuberculosis complex (MTBC) clones. However, no public MIRU-VNTR database based on well-characterized reference strains has been available hitherto for easy strain identification. Therefore, a collection of 186 reference strains representing the primary MTBC lineages was used to build a database, which is freely accessible at http://www.MIRU- VNTRplus.org. The geographical origin and the drug susceptibility profile of each strain were stored together with comprehensive genetic lineage information, including the 24-locus MIRU-VNTR profile, the spoligotyping pattern, the single-nucleotide- and large-sequence-polymorphism profiles, and the IS6110 restriction fragment length polymorphism fingerprint. Thanks to flexible import functions, a single or multiple user strains can be analyzed, e.g., for lineage identification with or without the use of reference strains, by best-match or tree-based analyses with single or combined marker data sets. The results can easily be exported. In the present study, we evaluated the database consistency and various analysis parameters both by testing the reference collection against itself and by using an external population-based data set comprising 629 different strains. Under the optimal conditions found, lineage predictions based on typing by 24-locus MIRU-VNTR analysis optionally combined with spoligotyping were verified in >99% of the cases. On the basis of this evaluation, a user strategy was defined, which consisted of best-match analysis followed, if necessary, by tree-based analysis. The MIRU-VNTRplus database is a powerful tool for high-resolution clonal identification and has little equivalent in terms of functionalities among the bacterial genotyping databases available so far. Copyright © 2008, American Society for Microbiology. All Rights Reserved.",
                "authors": [
                    {
                        "name": "Allix-Beguec C."
                    },
                    {
                        "name": "Harmsen D."
                    },
                    {
                        "name": "Weniger T."
                    },
                    {
                        "name": "Supply P."
                    },
                    {
                        "name": "Niemann S."
                    }
                ],
                "citationCount": 327,
                "date": "2008-08-01T00:00:00Z",
                "journal": "Journal of Clinical Microbiology",
                "title": "Evaluation and strategy for use of MIRU-VNTRplus, a multifunctional database for online analysis of genotyping data and phylogenetic identification of Mycobacterium tuberculosis complex isolates"
            },
            "pmid": "18550737"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        }
    ],
    "validated": 1
}