{
    "additionDate": "2021-01-18T11:30:25Z",
    "biotoolsCURIE": "biotools:memrgc",
    "biotoolsID": "memrgc",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Jinyan.Li@uts.edu.au",
            "name": "Jinyan Li",
            "typeEntity": "Person"
        }
    ],
    "description": "Allowing mutations in maximal matches boosts genome compression performance.\n\nMemrgc is a tool for compression genome sequence. The program is written in C++11 and tested on Red Hat Enterprise Linux 7.5 (64 bit).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Genome indexing",
                    "uri": "http://edamontology.org/operation_3211"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "https://github.com/yuansliu/memRGC",
    "language": [
        "C++",
        "C",
        "Shell"
    ],
    "lastUpdate": "2021-02-20T18:00:59Z",
    "license": "GPL-3.0",
    "name": "memRGC",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA572",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: A maximal match between two genomes is a contiguous non-extendable sub-sequence common in the two genomes. DNA bases mutate very often from the genome of one individual to another. When a mutation occurs in a maximal match, it breaks the maximal match into shorter match segments. The coding cost using these broken segments for reference-based genome compression is much higher than that of using the maximal match which is allowed to contain mutations. Results: We present memRGC, a novel reference-based genome compression algorithm that leverages mutation-containing matches (MCMs) for genome encoding. MemRGC detects maximal matches between two genomes using a coprime double-window k-mer sampling search scheme, the method then extends these matches to cover mismatches (mutations) and their neighbouring maximal matches to form long and MCMs. Experiments reveal that memRGC boosts the compression performance by an average of 27% in reference-based genome compression. MemRGC is also better than the best state-of-The-Art methods on all of the benchmark datasets, sometimes better by 50%. Moreover, memRGC uses much less memory and de-compression resources, while providing comparable compression speed. These advantages are of significant benefits to genome data storage and transmission.",
                "authors": [
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Wong L."
                    },
                    {
                        "name": "Li J."
                    }
                ],
                "citationCount": 2,
                "date": "2020-09-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Allowing mutations in maximal matches boosts genome compression performance"
            },
            "pmid": "33118018"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ]
}