{
    "accessibility": "Open access",
    "additionDate": "2022-05-17T17:31:58.127198Z",
    "biotoolsCURIE": "biotools:samp-pfpdeep",
    "biotoolsID": "samp-pfpdeep",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "waqar-hussain@umt.edu.pk",
            "name": "Waqar Hussain",
            "orcidid": "https://orcid.org/0000-0001-8991-9424",
            "typeEntity": "Person"
        }
    ],
    "description": "Improving accuracy of short antimicrobial peptides prediction using three different sequence encodings and deep neural networks.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Small molecule design",
                    "uri": "http://edamontology.org/operation_4009"
                }
            ]
        }
    ],
    "homepage": "https://github.com/WaqarHusain/sAMP-PFPDeep",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-05-17T17:31:58.130627Z",
    "license": "Not licensed",
    "name": "sAMP-PFPDeep",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAB487",
            "metadata": {
                "abstract": "© The Author(s) 2021. Published by Oxford University Press. All rights reserved.Short antimicrobial peptides (sAMPs) belong to a significant repertoire of antimicrobial agents and are known to possess enhanced antimicrobial activity, higher stability and less toxicity to human cells, as well as less complex than other large biological drugs. As these molecules are significantly important, herein, a prediction method for sAMPs (with a sequence length ≤ 30 residues) is proposed for accurate and efficient prediction of sAMPs instead of laborious and costly experimental approaches. Benchmark dataset was collected from a recently reported study and sequences were converted into three channel images comprising information related to the position, frequency and sum of 12 physiochemical features as the first, second and third channels, respectively. Two image-based deep neural networks (DNNs), i.e. RESNET-50 and VGG-16 were trained and evaluated using various metrics while a comparative analysis with previous techniques was also performed. Validation of sAMP-PFPDeep was also performed by using molecular docking based analysis. The results showed that VGG-16 provided more accurate results, i.e. 98.30% training accuracy and 87.37% testing accuracy for predicting sAMPs as compared to those of RESNET-50 having 96.14% training accuracy and 83.87% testing accuracy. However, the comparative analysis revealed that both these models outperformed previously reported state-of-the-art methods. Based on the results, it is concluded that sAMP-PFPDeep can help identify antimicrobial peptides with promising accuracy and efficiency. It can help biologists and scientists to identify antimicrobial peptides, by further aiding the computer-aided drug design and discovery, as well as virtual screening protocols against various pathologies. sAMP-PFPDeep is available at (https://github.com/WaqarHusain/sA MP-PFPDeep).",
                "authors": [
                    {
                        "name": "Hussain W."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "sAMP-PFPDeep: Improving accuracy of short antimicrobial peptides prediction using three different sequence encodings and deep neural networks"
            },
            "pmid": "34849586"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
