{
    "additionDate": "2018-07-30T11:24:48Z",
    "biotoolsCURIE": "biotools:samselect",
    "biotoolsID": "samselect",
    "credit": [
        {
            "email": "hwhuo@mail.xidian.edu.cn",
            "name": "Hongwei Huo",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Solver for sample sequence selection from large DNA datasets for quorum planted motif search",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/qyu071/samselect/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Motif discovery",
                    "uri": "http://edamontology.org/operation_0238"
                }
            ]
        }
    ],
    "homepage": "https://github.com/qyu071/samselect",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "SamSelect",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "shadi.m",
    "publication": [
        {
            "doi": "10.1186/s12859-018-2242-y",
            "metadata": {
                "abstract": "© 2018 The Author(s)..Background: Given a set of t n-length DNA sequences, q satisfying 0 < q ≤ 1, and l and d satisfying 0 ≤ d < l < n, the quorum planted motif search (qPMS) finds l-length strings that occur in at least qt input sequences with up to d mismatches and is mainly used to locate transcription factor binding sites in DNA sequences. Existing qPMS algorithms have been able to efficiently process small standard datasets (e.g., t = 20 and n = 600), but they are too time consuming to process large DNA datasets, such as ChIP-seq datasets that contain thousands of sequences or more. Results: We analyze the effects of t and q on the time performance of qPMS algorithms and find that a large t or a small q causes a longer computation time. Based on this information, we improve the time performance of existing qPMS algorithms by selecting a sample sequence set D' with a small t and a large q from the large input dataset D and then executing qPMS algorithms on D'. A sample sequence selection algorithm named SamSelect is proposed. The experimental results on both simulated and real data show (1) that SamSelect can select D' efficiently and (2) that the qPMS algorithms executed on D' can find implanted or real motifs in a significantly shorter time than when executed on D. Conclusions: We improve the ability of existing qPMS algorithms to process large DNA datasets from the perspective of selecting high-quality sample sequence sets so that the qPMS algorithms can find motifs in a short time in the selected sample sequence set D', rather than take an unfeasibly long time to search the original sequence set D. Our motif discovery method is an approximate algorithm.",
                "authors": [
                    {
                        "name": "Yu Q."
                    },
                    {
                        "name": "Wei D."
                    },
                    {
                        "name": "Huo H."
                    }
                ],
                "citationCount": 5,
                "date": "2018-06-18T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SamSelect: A sample sequence selection algorithm for quorum planted motif search on large DNA datasets"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Transcription factor binding sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}