{
    "additionDate": "2018-08-19T08:32:06Z",
    "biotoolsCURIE": "biotools:sbmlsqueezer",
    "biotoolsID": "sbmlsqueezer",
    "credit": [
        {
            "email": "andraeger@eng.ucsd.edu",
            "name": "Andreas Dräger",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Generates kinetic equations for biochemical networks according to context of each reaction.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.cogsys.cs.uni-tuebingen.de/software/SBMLsqueezer/doc/SBMLsqueezer2.1UsersGuide.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enzyme kinetics calculation",
                    "uri": "http://edamontology.org/operation_0334"
                }
            ]
        }
    ],
    "homepage": "http://www.cogsys.cs.uni-tuebingen.de/software/SBMLsqueezer/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2024-11-25T14:27:24.636488Z",
    "name": "SBMLsqueezer",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s12918-015-0212-9",
            "metadata": {
                "abstract": "Background: The size and complexity of published biochemical network reconstructions are steadily increasing, expanding the potential scale of derived computational models. However, the construction of large biochemical network models is a laborious and error-prone task. Automated methods have simplified the network reconstruction process, but building kinetic models for these systems is still a manually intensive task. Appropriate kinetic equations, based upon reaction rate laws, must be constructed and parameterized for each reaction. The complex test-and-evaluation cycles that can be involved during kinetic model construction would thus benefit from automated methods for rate law assignment. Results: We present a high-throughput algorithm to automatically suggest and create suitable rate laws based upon reaction type according to several criteria. The criteria for choices made by the algorithm can be influenced in order to assign the desired type of rate law to each reaction. This algorithm is implemented in the software package SBMLsqueezer 2. In addition, this program contains an integrated connection to the kinetics database SABIO-RK to obtain experimentally-derived rate laws when desired. Conclusions: The described approach fills a heretofore absent niche in workflows for large-scale biochemical kinetic model construction. In several applications the algorithm has already been demonstrated to be useful and scalable. SBMLsqueezer is platform independent and can be used as a stand-alone package, as an integrated plugin, or through a web interface, enabling flexible solutions and use-case scenarios.",
                "authors": [
                    {
                        "name": "Drager A."
                    },
                    {
                        "name": "Eichner J."
                    },
                    {
                        "name": "Keller R."
                    },
                    {
                        "name": "Palsson B.O."
                    },
                    {
                        "name": "Rall M."
                    },
                    {
                        "name": "Zell A."
                    },
                    {
                        "name": "Zielinski D.C."
                    }
                ],
                "citationCount": 22,
                "date": "2015-10-09T00:00:00Z",
                "journal": "BMC Systems Biology",
                "title": "SBMLsqueezer 2: Context-sensitive creation of kinetic equations in biochemical networks"
            },
            "pmcid": "PMC4600286",
            "pmid": "26452770"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biochemistry",
            "uri": "http://edamontology.org/topic_3292"
        },
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        }
    ],
    "validated": 1
}
