{
    "accessibility": "Open access",
    "additionDate": "2024-06-18T21:14:23.281132Z",
    "biotoolsCURIE": "biotools:spermd",
    "biotoolsID": "spermd",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "appo@xmu.edu.cn",
            "name": "Zhiliang Ji",
            "typeEntity": "Person"
        },
        {
            "email": "guyiqun@nrifp.org.cn",
            "name": "Yiqun Gu",
            "typeEntity": "Person"
        },
        {
            "email": "lijianyuan2021@126.com",
            "name": "Jianyuan Li",
            "typeEntity": "Person"
        }
    ],
    "description": "The expression atlas of sperm maturation.\n\nThe Sperm Maturation Database (SperMD) is a freely available database containing multiple omics data determined in human or mouse sperm maturation. We collect and integrate data from multiple studies and present them through a unified framework. This database aims to apply into clinical chemistry and biomarker discovery about male infertility.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                }
            ]
        }
    ],
    "homepage": "http://bio-add.org/SperMD",
    "lastUpdate": "2024-06-18T21:14:23.284431Z",
    "name": "SperMD",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/s12859-024-05631-x",
            "metadata": {
                "abstract": "The impairment of sperm maturation is one of the major pathogenic factors in male subfertility, a serious medical and social problem affecting millions of global couples. Regrettably, the existing research on sperm maturation is slow, limited, and fragmented, largely attributable to the lack of a global molecular view. To fill the data gap, we newly established a database, namely the Sperm Maturation Database (SperMD, http://bio-add.org/SperMD). SperMD integrates heterogeneous multi-omics data (170 transcriptomes, 91 proteomes, and five human metabolomes) to illustrate the transcriptional, translational, and metabolic manifestations during the entire lifespan of sperm maturation. These data involve almost all crucial scenarios related to sperm maturation, including the tissue components of the epididymal microenvironment, cell constituents of tissues, different pathological states, and so on. To the best of our knowledge, SperMD could be one of the limited repositories that provide focused and comprehensive information on sperm maturation. Easy-to-use web services are also implemented to enhance the experience of data retrieval and molecular comparison between humans and mice. Furthermore, the manuscript illustrates an example application demonstrated to systematically characterize novel gene functions in sperm maturation. Nevertheless, SperMD undertakes the endeavor to integrate the islanding omics data, offering a panoramic molecular view of how the spermatozoa gain full reproductive abilities. It will serve as a valuable resource for the systematic exploration of sperm maturation and for prioritizing the biomarkers and targets for precise diagnosis and therapy of male subfertility.",
                "authors": [
                    {
                        "name": "Gu Y."
                    },
                    {
                        "name": "Ji Z."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Li Q."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Shi H."
                    },
                    {
                        "name": "Wang H."
                    },
                    {
                        "name": "Wu L."
                    },
                    {
                        "name": "Yang C."
                    }
                ],
                "citationCount": 1,
                "date": "2024-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SperMD: the expression atlas of sperm maturation"
            },
            "pmcid": "PMC10792849",
            "pmid": "38233783"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
