{
    "additionDate": "2019-11-14T18:13:36Z",
    "biotoolsCURIE": "biotools:Imager-4D",
    "biotoolsID": "Imager-4D",
    "confidence_flag": "tool",
    "description": "New Software for Viewing Dynamic PET Scans and Extracting Radiomic Parameters from PET Data | Extensive research is currently being conducted into dynamic positron emission tomography (PET) acquisitions (including dynamic whole-body imaging) as well as extraction of radiomic features from imaging modalities. We describe a new PET viewing software known as Imager-4D that provides a facile means of viewing and analyzing dynamic PET data and obtaining associated quantitative metrics including radiomic parameters. The Imager-4D was programmed in the Java language utilizing the FX extensions. It is executable on any system for which a Java w FX compliant virtual machine is available. The software incorporates the ability to view and analyze dynamic data acquired with different types of dynamic protocols. For image display, the program maintains a built-in library of 62 different lookup tables with monochromatic and full-color distributions",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://jeffreyleal.wixsite.com/jleal",
    "language": [
        "Java"
    ],
    "lastUpdate": "2020-12-14T09:07:14Z",
    "name": "Imager-4D",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/S10278-019-00255-7",
            "metadata": {
                "abstract": "© 2019, Society for Imaging Informatics in Medicine.Extensive research is currently being conducted into dynamic positron emission tomography (PET) acquisitions (including dynamic whole-body imaging) as well as extraction of radiomic features from imaging modalities. We describe a new PET viewing software known as Imager-4D that provides a facile means of viewing and analyzing dynamic PET data and obtaining associated quantitative metrics including radiomic parameters. The Imager-4D was programmed in the Java language utilizing the FX extensions. It is executable on any system for which a Java w/FX compliant virtual machine is available. The software incorporates the ability to view and analyze dynamic data acquired with different types of dynamic protocols. For image display, the program maintains a built-in library of 62 different lookup tables with monochromatic and full-color distributions. The Imager-4D provides multiple display layouts and can display fused images. Multiple methods of volume-of-interest (VOI) selection are available. Dynamic analysis features, such as image summation and full Patlak analysis, are also available. The user interface includes window width and level, blending, and zoom functionality. VOI sizes are adjustable and data from VOIs can either be displayed numerically or graphically within the software or exported. An example case of a 50-year-old woman with metastatic colorectal cancer and thyroiditis is included and demonstrates the steps for a user to obtain standard PET parameters, dynamic data, and radiomic features using selected VOIs. The Imager-4D represents a novel PET viewer that allows the user to view dynamic PET data, to derive dynamic and radiomic parameters from that data, and to combine dynamic data with radiomics (“dynomics”). The Imager-4D is available as a free download. This software has the potential to speed the adoption of advanced analysis of dynamic PET data into routine clinical use.",
                "authors": [
                    {
                        "name": "Karakatsanis N.A."
                    },
                    {
                        "name": "Kitchen G."
                    },
                    {
                        "name": "Leal J.P."
                    },
                    {
                        "name": "Lodge M.A."
                    },
                    {
                        "name": "Pomper M.G."
                    },
                    {
                        "name": "Rahmim A."
                    },
                    {
                        "name": "Rowe S.P."
                    },
                    {
                        "name": "Solnes L.B."
                    },
                    {
                        "name": "Yin Y."
                    }
                ],
                "citationCount": 3,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Journal of Digital Imaging",
                "title": "Imager-4D: New Software for Viewing Dynamic PET Scans and Extracting Radiomic Parameters from PET Data"
            },
            "pmid": "31388864"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ],
    "validated": 1
}
