{
    "additionDate": "2019-11-14T18:08:05Z",
    "biotoolsCURIE": "biotools:FQStat",
    "biotoolsID": "FQStat",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hotu2@unl.edu",
            "name": "Hasan H. Otu",
            "orcidid": "https://orcid.org/0000-0002-9253-8152",
            "typeEntity": "Person"
        }
    ],
    "description": "A parallel architecture for very high-speed assessment of sequencing quality metrics | BACKGROUND:High throughput DNA RNA sequencing has revolutionized biological and clinical research. Sequencing is widely used, and generates very large amounts of data, mainly due to reduced cost and advanced technologies. Quickly assessing the quality of giga-to-tera base levels of sequencing data has become a routine but important task. Identification and elimination of low-quality sequence data is crucial for reliability of downstream analysis results. There is a need for a high-speed tool that uses optimized parallel programming for batch processing and simply gauges the quality of sequencing data from multiple datasets independent of any other processing steps. RESULTS:FQStat is a stand-alone, platform-independent software tool that assesses the quality of FASTQ files using parallel programming",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://otulab.unl.edu:8080/static/data/FQStat%20documentation.pdf"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly validation",
                    "uri": "http://edamontology.org/operation_3180"
                },
                {
                    "term": "Sequencing quality control",
                    "uri": "http://edamontology.org/operation_3218"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "http://otulab.unl.edu/FQStat",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-29T11:32:09Z",
    "name": "FQStat",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3015-Y",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: High throughput DNA/RNA sequencing has revolutionized biological and clinical research. Sequencing is widely used, and generates very large amounts of data, mainly due to reduced cost and advanced technologies. Quickly assessing the quality of giga-to-tera base levels of sequencing data has become a routine but important task. Identification and elimination of low-quality sequence data is crucial for reliability of downstream analysis results. There is a need for a high-speed tool that uses optimized parallel programming for batch processing and simply gauges the quality of sequencing data from multiple datasets independent of any other processing steps. Results: FQStat is a stand-alone, platform-independent software tool that assesses the quality of FASTQ files using parallel programming. Based on the machine architecture and input data, FQStat automatically determines the number of cores and the amount of memory to be allocated per file for optimum performance. Our results indicate that in a core-limited case, core assignment overhead exceeds the benefit of additional cores. In a core-unlimited case, there is a saturation point reached in performance by increasingly assigning additional cores per file. We also show that memory allocation per file has a lower priority in performance when compared to the allocation of cores. FQStat's output is summarized in HTML web page, tab-delimited text file, and high-resolution image formats. FQStat calculates and plots read count, read length, quality score, and high-quality base statistics. FQStat identifies and marks low-quality sequencing data to suggest removal from downstream analysis. We applied FQStat on real sequencing data to optimize performance and to demonstrate its capabilities. We also compared FQStat's performance to similar quality control (QC) tools that utilize parallel programming and attained improvements in run time. Conclusions: FQStat is a user-friendly tool with a graphical interface that employs a parallel programming architecture and automatically optimizes its performance to generate quality control statistics for sequencing data. Unlike existing tools, these statistics are calculated for multiple datasets and separately at the \"lane,\" \"sample,\" and \"experiment\" level to identify subsets of the samples with low quality, thereby preventing the loss of complete samples when reliable data can still be obtained.",
                "authors": [
                    {
                        "name": "Albahrani M."
                    },
                    {
                        "name": "Chanumolu S.K."
                    },
                    {
                        "name": "Otu H.H."
                    }
                ],
                "citationCount": 1,
                "date": "2019-08-15T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "FQStat: A parallel architecture for very high-speed assessment of sequencing quality metrics"
            },
            "pmcid": "PMC6694608",
            "pmid": "31416440"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
