{
    "accessibility": "Open access",
    "additionDate": "2019-11-14T18:08:28Z",
    "biotoolsCURIE": "biotools:rawMSA",
    "biotoolsID": "rawMSA",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "bjorn.wallner@liu.se",
            "name": "Björn Wallner",
            "orcidid": "https://orcid.org/0000-0002-3772-8279",
            "typeEntity": "Person"
        }
    ],
    "description": "End-to-end Deep Learning using raw Multiple Sequence Alignments | In the last decades, huge efforts have been made in the bioinformatics community to develop machine learning-based methods for the prediction of structural features of proteins in the hope of answering fundamental questions about the way proteins function and their involvement in several illnesses. The recent advent of Deep Learning has renewed the interest in neural networks, with dozens of methods being developed taking advantage of these new architectures. However, most methods are still heavily based pre-processing of the input data, as well as extraction and integration of multiple hand-picked, and manually designed features. Multiple Sequence Alignments (MSA) are the most common source of information in de novo prediction methods. Deep Networks that automatically refine the MSA and extract useful features from it would be immensely powerful",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Ab initio structure prediction",
                    "uri": "http://edamontology.org/operation_0476"
                },
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                }
            ]
        }
    ],
    "homepage": "https://bitbucket.org/clami66/rawmsa",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2024-11-24T15:46:02.351414Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://bitbucket.org/clami66/rawmsa/src/master/"
        }
    ],
    "name": "rawMSA",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0220182",
            "metadata": {
                "abstract": "In the last decades, huge efforts have been made in the bioinformatics community to develop machine learning-based methods for the prediction of structural features of proteins in the hope of answering fundamental questions about the way proteins function and their involvement in several illnesses. The recent advent of Deep Learning has renewed the interest in neural networks, with dozens of methods being developed taking advantage of these new architectures. However, most methods are still heavily based pre-processing of the input data, as well as extraction and integration of multiple hand-picked, and manually designed features. Multiple Sequence Alignments (MSA) are the most common source of information in de novo prediction methods. Deep Networks that automatically refine the MSA and extract useful features from it would be immensely powerful. In this work, we propose a new paradigm for the prediction of protein structural features called rawMSA. The core idea behind rawMSA is borrowed from the field of natural language processing to map amino acid sequences into an adaptively learned continuous space. This allows the whole MSA to be input into a Deep Network, thus rendering pre-calculated features such as sequence profiles and other features calculated from MSA obsolete. We showcased the rawMSA methodology on three different prediction problems: secondary structure, relative solvent accessibility and inter-residue contact maps. We have rigorously trained and bench-marked rawMSA on a large set of proteins and have determined that it outperforms classical methods based on position-specific scoring matrices (PSSM) when predicting secondary structure and solvent accessibility, while performing on par with methods using more pre-calculated features in the inter-residue contact map prediction category in CASP12 and CASP13. Clearly demonstrating that rawMSA represents a promising development that can pave the way for improved methods using rawMSA instead of sequence profiles to represent evolutionary information in the coming years. Availability: datasets, dataset generation code, evaluation code and models are available at: https://bitbucket.org/clami66/rawmsa.",
                "authors": [
                    {
                        "name": "Mirabello C."
                    },
                    {
                        "name": "Wallner B."
                    }
                ],
                "citationCount": 59,
                "date": "2019-08-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "RAWMSA: End-to-end Deep Learning using raw Multiple Sequence Alignments"
            },
            "pmcid": "PMC6695225",
            "pmid": "31415569"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        }
    ],
    "validated": 1
}
