
{
    "credit": [
        {
            "email": "ylu@mcw.edu",
            "name": "Yan Lu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://code.google.com/archive/p/drgap/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            },
            {
                "term": "Oncology",
                "uri": "http://edamontology.org/topic_2640"
            },
            {
                "term": "Immunoproteins, genes and antigens",
                "uri": "http://edamontology.org/topic_2830"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Cancers are caused by the accumulation of genomic alterations. Driver mutations are required for the cancer phenotype, whereas passenger mutations are irrelevant to tumor development and accumulate through DNA replication. A major challenge facing the field of cancer genome sequencing is to identify cancer-associated genes with mutations that drive the cancer phenotype. Here, we describe a powerful and flexible statistical framework for identifying driver genes and driver signaling pathways in cancer genome-sequencing studies. Biological knowledge of the mutational process in tumors is fully integrated into our statistical models and includes such variables as the length of protein-coding regions, transcript isoforms, variation in mutation types, differences in background mutation rates, the redundancy of genetic code, and multiple mutations in one gene. This framework provides several significant features that are not addressed or naively obtained by previous methods. In particular, on the observation of low prevalence of somatic mutations in individual tumors, we propose a heuristic strategy to estimate the mixture proportion of chi-square distribution of likelihood ratio test (LRT) statistics. This provides significantly increased statistical power compared to regular LRT. Through a combination of simulation and analysis of TCGA cancer sequencing study data, we demonstrate high accuracy and sensitivity in our methods. Our statistical methods and several auxiliary bioinformatics tools have been incorporated into a computational tool, DrGaP. The newly developed tool is immediately applicable to cancer genome-sequencing studies and will lead to a more complete identification of altered driver genes and driver signaling pathways in cancer. © 2013 The American Society of Human Genetics.",
            "authors": [
                "Hua X.",
                "Xu H.",
                "Yang Y.",
                "Zhu J.",
                "Liu P.",
                "Lu Y."
            ],
            "cit_count": 28,
            "doi": "10.1016/j.ajhg.2013.07.003",
            "journal": "American Journal of Human Genetics",
            "title": "DrGaP: A powerful tool for identifying driver genes and pathways in cancer sequencing studies",
            "year": "2013-09-05"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:drgap",
        "biotoolsID": "drgap",
        "description": "A Powerful Tool for Identifying Driver Genes and Pathways in Cancer Sequencing Studies.",
        "homepage": "https://code.google.com/archive/p/drgap/",
        "name": "DrGaP"
    }
}