{
    "additionDate": "2021-01-18T08:00:00Z",
    "biotoolsCURIE": "biotools:robustclone",
    "biotoolsID": "robustclone",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "lwan@amss.ac.cn",
            "typeEntity": "Person"
        }
    ],
    "description": "A robust PCA method of tumor clone and evolution inference from single-cell sequencing data. We many thank to the article for their available source code.\n\nThe input data is SNV data or CNV data. For SNV data, it can be either binary or ternary data. If it is binary data, 0 represents non-mutation site, 1 represents mutation site, 3 represents missing; if ternary data, 0 represents non-mutation site, 1 represents mutation heterozygous site, 2 represents mutation homozygous site and 3 represents missing，for example, ‘example.csv’ in the above list.\n\nRun the matlab script file, named \"carryout_RPCA.m\" to recover the genotype matrix.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Phylogenetic reconstruction",
                    "uri": "http://edamontology.org/operation_3478"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ucasdp/RobustClone",
    "language": [
        "Fortran",
        "MATLAB",
        "R"
    ],
    "lastUpdate": "2021-02-08T12:38:54Z",
    "license": "MIT",
    "name": "RobustClone",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA172",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: Single-cell sequencing (SCS) data provide unprecedented insights into intratumoral heterogeneity. With SCS, we can better characterize clonal genotypes and reconstruct phylogenetic relationships of tumor cells/clones. However, SCS data are often error-prone, making their computational analysis challenging. Results: To infer the clonal evolution in tumor from the error-prone SCS data, we developed an efficient computational framework, termed RobustClone. It recovers the true genotypes of subclones based on the extended robust principal component analysis, a low-rank matrix decomposition method, and reconstructs the subclonal evolutionary tree. RobustClone is a model-free method, which can be applied to both single-cell single nucleotide variation (scSNV) and single-cell copy-number variation (scCNV) data. It is efficient and scalable to large-scale datasets. We conducted a set of systematic evaluations on simulated datasets and demonstrated that RobustClone outperforms state-of-the-art methods in large-scale data both in accuracy and efficiency. We further validated RobustClone on two scSNV and two scCNV datasets and demonstrated that RobustClone could recover genotype matrix and infer the subclonal evolution tree accurately under various scenarios. In particular, RobustClone revealed the spatial progression patterns of subclonal evolution on the large-scale 10X Genomics scCNV breast cancer dataset. Contact: lwan@amss.ac.cn or maliang@ioz.ac.cn",
                "authors": [
                    {
                        "name": "Chen Z."
                    },
                    {
                        "name": "Gong F."
                    },
                    {
                        "name": "Ma L."
                    },
                    {
                        "name": "Wan L."
                    }
                ],
                "citationCount": 2,
                "date": "2020-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "RobustClone: A robust PCA method for tumor clone and evolution inference from single-cell sequencing data"
            },
            "pmid": "32159762"
        }
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        }
    ]
}
