{
    "additionDate": "2015-08-03T09:35:51Z",
    "biotoolsCURIE": "biotools:prank_api",
    "biotoolsID": "prank_api",
    "credit": [
        {
            "name": "BioCatalogue",
            "typeEntity": "Project",
            "typeRole": [
                "Documentor"
            ],
            "url": "https://www.biocatalogue.org"
        },
        {
            "email": "ari.loytynoja@helsinki.fi",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.ebi.ac.uk/support/"
        }
    ],
    "description": "A probabilistic multiple alignment program for DNA, codon and amino-acid sequences. It’s based on a novel algorithm that treats insertions correctly and avoids over-estimation of the number of deletion events. In addition, PRANK borrows ideas from maximum likelihood methods used in phylogenetics and correctly takes into account the evolutionary distances between sequences.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.ebi.ac.uk/Tools/webservices/services/msa/prank_rest"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence comparison",
                    "uri": "http://edamontology.org/operation_2451"
                },
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                }
            ]
        }
    ],
    "homepage": "http://www.ebi.ac.uk/Tools/webservices/services/msa/prank_rest",
    "lastUpdate": "2018-12-10T12:58:53Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "https://www.biocatalogue.org/services/2746"
        }
    ],
    "name": "PRANK API",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "BioCatalogue",
    "publication": [
        {
            "doi": "10.1073/pnas.0409137102",
            "metadata": {
                "abstract": "Dynamic programming algorithms guarantee to find the optimal alignment between two sequences. For more than a few sequences, exact algorithms become computationally impractical, and progressive algorithms iterating pain/vise alignments are widely used. These heuristic methods have a serious drawback because pain/vise algorithms do not differentiate insertions from deletions and end up penalizing single insertion events multiple times. Such an unrealistically high penalty for insertions typically results in overmatching of sequences and an underestimation of the number of insertion events. We describe a modification of the traditional alignment algorithm that can distinguish insertion from deletion and avoid repeated penalization of insertions and illustrate this method with a pair hidden Markov model that uses an evolutionary scoring function. In comparison with a traditional progressive alignment method, our algorithm infers a greater number of insertion events and creates gaps that are phylogenetically consistent but spatially less concentrated. Our results suggest that some insertion/deletion \"hot spots\" may actually be artifacts of traditional alignment algorithms. © 2005 by The National Academy of Sciences of the USA.",
                "authors": [
                    {
                        "name": "Loytynoja A."
                    },
                    {
                        "name": "Goldman N."
                    }
                ],
                "citationCount": 503,
                "date": "2005-07-26T00:00:00Z",
                "journal": "Proceedings of the National Academy of Sciences of the United States of America",
                "title": "An algorithm for progressive multiple alignment of sequences with insertions"
            },
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1007/978-1-62703-646-7_10",
            "metadata": {
                "abstract": "Evolutionary analyses require sequence alignments that correctly represent evolutionary homology. Evolutionary and structural homology are not the same and sequence alignments generated with methods designed for structural matching can be seriously misleading in comparative and phylogenetic analyses. The phylogeny-aware alignment algorithm implemented in the program prank has been shown to produce good alignments for evolutionary inferences. Unlike other alignment programs, prank makes use of phylogenetic information to distinguish alignment gaps caused by insertions or deletions and, thereafter, handles the two types of events differently. As a by-product of the correct handling of insertions and deletions, prank can provide the inferred ancestral sequences as a part of the output and mark the alignment gaps differently depending on their origin in insertion or deletion events. As the algorithm infers the evolutionary history of the sequences, prank can be sensitive to errors in the guide phylogeny and violations on the underlying assumptions about the origin and patterns of gaps. These issues are discussed in detail and practical advice for the use of prank in evolutionary analysis is provided. The prank software and other methods discussed here can be found from the program home page at http://code.google.com/p/prank-msa/. © 2014 Springer Science+Business Media, LLC.",
                "authors": [
                    {
                        "name": "Loytynoja A."
                    }
                ],
                "citationCount": 66,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Methods in Molecular Biology",
                "title": "Phylogeny-aware alignment with PRANK"
            }
        }
    ],
    "toolType": [
        "Web API"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}