{
    "additionDate": "2021-01-18T07:27:37Z",
    "biotoolsCURIE": "biotools:trlnc",
    "biotoolsID": "trlnc",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "lcqbio@163.com",
            "name": "Chunquan Li",
            "typeEntity": "Person"
        },
        {
            "email": "wangqiuyu900490@163.com",
            "name": "Qiuyu Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "TRInc is a comprehensive database for human transcriptional regulatory information of lncRNAs.\n\nLong noncoding RNAs (lncRNAs) have been proven to play important roles in transcriptional processes and biological functions. With the increasing study of human diseases and biological processes, information in human H3K27ac ChIP-seq, ATAC-seq and DNase-seq datasets is accumulating rapidly, resulting in an urgent need to collect and process data to identify transcriptional regulatory regions of lncRNAs. We therefore developed a comprehensive database for human regulatory information of lncRNAs (TRlnc, http: bio.licpathway.net TRlnc), which aimed to collect available resources of transcriptional regulatory regions of lncRNAs and to annotate and illustrate their potential roles in the regulation of lncRNAs in a cell type-specific manner",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                },
                {
                    "term": "Promoter prediction",
                    "uri": "http://edamontology.org/operation_0440"
                },
                {
                    "term": "trans-regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0443"
                }
            ]
        }
    ],
    "homepage": "http://bio.licpathway.net/TRlnc",
    "lastUpdate": "2021-03-05T16:59:02Z",
    "name": "TRlnc",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAA011",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved.Long noncoding RNAs (lncRNAs) have been proven to play important roles in transcriptional processes and biological functions. With the increasing study of human diseases and biological processes, information in human H3K27ac ChIP-seq, ATAC-seq and DNase-seq datasets is accumulating rapidly, resulting in an urgent need to collect and process data to identify transcriptional regulatory regions of lncRNAs. We therefore developed a comprehensive database for human regulatory information of lncRNAs (TRlnc, http://bio.licpathway.net/TRlnc), which aimed to collect available resources of transcriptional regulatory regions of lncRNAs and to annotate and illustrate their potential roles in the regulation of lncRNAs in a cell type-specific manner. The current version of TRlnc contains 8 683 028 typical enhancers/super-enhancers and 32 348 244 chromatin accessibility regions associated with 91 906 human lncRNAs. These regions are identified from over 900 human H3K27ac ChIP-seq, ATAC-seq and DNase-seq samples. Furthermore, TRlnc provides the detailed genetic and epigenetic annotation information within transcriptional regulatory regions (promoter, enhancer/super-enhancer and chromatin accessibility regions) of lncRNAs, including common SNPs, risk SNPs, eQTLs, linkage disequilibrium SNPs, transcription factors, methylation sites, histone modifications and 3D chromatin interactions. It is anticipated that the use of TRlnc will help users to gain in-depth and useful insights into the transcriptional regulatory mechanisms of lncRNAs.",
                "authors": [
                    {
                        "name": "Bai X."
                    },
                    {
                        "name": "Jiang Y."
                    },
                    {
                        "name": "Li C."
                    },
                    {
                        "name": "Li E."
                    },
                    {
                        "name": "Li M."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Qian F."
                    },
                    {
                        "name": "Tang Z."
                    },
                    {
                        "name": "Wang Q."
                    },
                    {
                        "name": "Xie J."
                    },
                    {
                        "name": "Yang Y."
                    },
                    {
                        "name": "Zhang J."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Zhao J."
                    },
                    {
                        "name": "Zhou J."
                    },
                    {
                        "name": "Zhou L."
                    }
                ],
                "citationCount": 5,
                "date": "2021-03-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "TRlnc: A comprehensive database for human transcriptional regulatory information of lncRNAs"
            },
            "pmid": "32047897"
        }
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Chromosome conformation capture",
            "uri": "http://edamontology.org/topic_3940"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
