{
    "additionDate": "2021-01-18T08:10:00Z",
    "biotoolsCURIE": "biotools:ikaptive",
    "biotoolsID": "ikaptive",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "johanna.kenyon@qut.edu.au",
            "name": "Johanna J. Kenyon",
            "orcidid": "https://orcid.org/0000-0002-1487-6105",
            "typeEntity": "Person"
        }
    ],
    "description": "Identification of <i>Acinetobacter baumannii</i> loci for capsular polysaccharide (KL) and lipooligosaccharide outer core (OCL) synthesis in genome assemblies using curated reference databases compatible with <i>Kaptive</i>.\n\nKaptive reports information about surface polysaccharide loci for Klebsiella and Acinetobacter baumannii genome assemblies. You can also run a graphical version of Kaptive via this web interface (source code).\n\nGiven a novel genome and a database of known loci (K, O or OC), Kaptive will help a user to decide whether their sample has a known or novel locus. It carries out the following for each input assembly:.\n\nKaptive is a tool for bacterial surface polysaccharide locus typing and variant evaluation.\n\nBLAST for all known locus nucleotide sequences (using blastn) to identify the best match ('best' defined as having the highest coverage).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Multilocus sequence typing",
                    "uri": "http://edamontology.org/operation_3840"
                },
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                }
            ]
        }
    ],
    "homepage": "https://github.com/katholt/Kaptive",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-03T07:51:43Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://kaptive.holtlab.net/"
        }
    ],
    "name": "iKaptive",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1099/MGEN.0.000339",
            "metadata": {
                "abstract": "© 2020 The Authors.Multiply antibiotic-resistant Acinetobacter baumannii infections are a global public health concern and accurate tracking of the spread of specific lineages is needed. Variation in the composition and structure of capsular polysaccharide (CPS), a criti-cal determinant of virulence and phage susceptibility, makes it an attractive epidemiological marker. The outer core (OC) of lipooligosaccharide also exhibits variation. To take better advantage of the untapped information available in whole genome sequences, we have created a curated reference database of 92 publicly available gene clusters at the locus encoding proteins responsible for biosynthesis and export of CPS (K locus), and a second database for 12 gene clusters at the locus for outer core biosynthesis (OC locus). Each entry has been assigned a unique KL or OCL number, and is fully annotated using a simple, transparent and standardized nomenclature. These databases are compatible with Kaptive, a tool for in silico typing of bacterial surface polysaccharide loci, and their utility was validated using (a) >630 assembled A. baumannii draft genomes for which the KL and OCL regions had been previously typed manually, and (b) 3386 A. baumannii genome assemblies downloaded from NCBI. Among the previously typed genomes, Kaptive was able to confidently assign KL and OCL types with 100% accuracy. Among the genomes retrieved from NCBI, Kaptive detected known KL and OCL in 87 and 90% of genomes, respectively, indicating that the majority of common KL and OCL types are captured within the databases; 13 of the 92 KL in the database were not detected in any publicly available whole genome assembly. The failure to assign a KL or OCL type may indicate incomplete or poor-quality genomes. However, further novel variants may remain to be documented. Combining outputs with multilocus sequence typing (Institut Pasteur scheme) revealed multiple KL and OCL types in collections of a single sequence type (ST) representing each of the two predominant globally distributed clones, ST1 of GC1 and ST2 of GC2, and in collections of other clones comprising >20 isolates each (ST10, ST25, and ST140), indicating extensive within-clone replacement of these loci. The databases are available at https://​github.​com/​katholt/​Kaptive and will be updated as further locus types become available.",
                "authors": [
                    {
                        "name": "Wyres K.L."
                    },
                    {
                        "name": "Cahill S.M."
                    },
                    {
                        "name": "Holt K.E."
                    },
                    {
                        "name": "Hall R.M."
                    },
                    {
                        "name": "Kenyon J.J."
                    }
                ],
                "citationCount": 28,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Microbial Genomics",
                "title": "Identification of acinetobacter baumannii loci for capsular polysaccharide (KL) and lipooligosaccharide outer core (OCL) synthesis in genome assemblies using curated reference databases compatible with kaptive"
            },
            "pmcid": "PMC7200062",
            "pmid": "32118530"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        }
    ]
}