{
    "additionDate": "2021-01-18T08:10:39Z",
    "biotoolsCURIE": "biotools:fame-msa",
    "biotoolsID": "fame-msa",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "eparvinnia@yahoo.com",
            "name": "Parvinnia Elham",
            "typeEntity": "Person"
        }
    ],
    "description": "FAME is fast and memory efficient multiple sequences alignment tool through compatible chain of roots",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                },
                {
                    "term": "Genome alignment",
                    "uri": "http://edamontology.org/operation_3182"
                },
                {
                    "term": "Pairwise sequence alignment",
                    "uri": "http://edamontology.org/operation_0491"
                }
            ]
        }
    ],
    "homepage": "http://github.com/naznoosh/msa",
    "language": [
        "C++",
        "C"
    ],
    "lastUpdate": "2021-03-10T19:43:49Z",
    "name": "FAME",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA175",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: Multiple sequence alignment (MSA) is important and challenging problem of computational biology. Most of the existing methods can only provide a short length multiple alignments in an acceptable time. Nevertheless, when the researchers confront the genome size in the multiple alignments, the process has required a huge processing space/time. Accordingly, using the method that can align genome size rapidly and precisely has a great effect, especially on the analysis of the very long alignments. Herein, we have proposed an efficient method, called FAME, which vertically divides sequences from the places that they have common areas; then they are arranged in consecutive order. Then these common areas are shifted and placed under each other, and the subsequences between them are aligned using any existing MSA tool. Results: The results demonstrate that the combination of FAME and the MSA methods and deploying minimizer are capable to be executed on personal computer and finely align long length sequences with much higher sum-of-pair (SP) score compared to the standalone MSA tools. As we select genomic datasets with longer length, the SP score of the combinatorial methods is gradually improved. The calculated computational complexity of methods supports the results in a way that combining FAME and the MSA tools leads to at least four times faster execution on the datasets.",
                "authors": [
                    {
                        "name": "Naznooshsadat E."
                    },
                    {
                        "name": "Elham P."
                    },
                    {
                        "name": "Ali S.-Z."
                    }
                ],
                "citationCount": 1,
                "date": "2020-03-31T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "FAME: Fast and memory efficient multiple sequences alignment tool through compatible chain of roots"
            },
            "pmid": "32170927"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ]
}