
{
    "credit": [
    ],
    "publication": [
        {
            "abstract": "© 2019 American Academy of Forensic SciencesThe following article from the Journal of Forensic Science, “Hair Analysis for Drug-Facilitated Crime: The Critical Role of Hair Growth Rate” by Koren G, Bellaish E, Maman K, published online on 3rd September 2019 (1) on Wiley Online Library has been withdrawn at the authors’ request, and in agreement between the authors, the Journal’s Editorial Office, and John Wiley & Sons, Inc. The withdrawal has been agreed to by all parties due to material included in the article being involved in current litigation. Reference. 1. Koren G, Bellaish E, Maman K. Hair analysis for drug-facilitated crime: the critical role of hair growth rate. J Forensic Sci 2019;54(5):1574–5. https://doi.org/10.1111/1556-4029.14013.",
            "cit_count": 0,
            "doi": "10.1111/1556-4029.14248",
            "journal": "Journal of Forensic Sciences",
            "pmid": "31860131",
            "title": "Withdrawal: Hair Analysis for Drug-Facilitated Crime: The Critical Role of Hair Growth Rate (Journal of Forensic Sciences, (2019), 64, 5, (1574-1575), 10.1111/1556-4029.14013)",
            "year": "2020-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:withdrawal",
        "biotoolsID": "withdrawal",
        "description": "the critical role of hair growth rate. J Forensic Sci 2019;54(5):1574-5 (https://doi.org/10.1111/1556-4029.14013).\n\nThe following article from the Journal of Forensic Science, \"Hair Analysis for Drug-Facilitated Crime: The Critical Role of Hair Growth Rate\" by Koren G, Bellaish E, Maman K, published online on 3rd September 2019 (1) on Wiley Online Library has been withdrawn at the authors' request, and in agreement between the authors, the Journal's Editorial Office, and John Wiley & Sons, Inc. The withdrawal has been agreed to by all parties due to material included in the article being involved in current litigation. Reference 1. Koren G, Bellaish E, Maman K. Hair analysis for drug-facilitated crime: the critical role of hair growth rate. J Forensic Sci 2019;54(5):1574-5. https: doi.org 10.1111 1556-4029.14013.\n\n||| HOMEPAGE MISSING!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'drug-facilitated crime', 'drug-facilitated', 'Bellaish', '2019;54(5):1574-5'",
        "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31860131",
        "name": "withdrawal"
    }
}