{"credit":[{"email":"hipathdb-help@kobic.kr","name":"hiPathDB Support","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://hipathdb.kobic.re.kr/tutorial.php"}],"function":[{"operation":[{"term":"Pathway or network prediction","uri":"http://edamontology.org/operation_3439"},{"term":"Pathway or network visualisation","uri":"http://edamontology.org/operation_3083"},{"term":"Pathway or network analysis","uri":"http://edamontology.org/operation_2497"},{"term":"Network simulation","uri":"http://edamontology.org/operation_3562"},{"term":"Formatting","uri":"http://edamontology.org/operation_0335"}]}],"labels":{"language":["Java"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Database portal"],"topic":[{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"},{"term":"Data submission, annotation and curation","uri":"http://edamontology.org/topic_0219"},{"term":"Model organisms","uri":"http://edamontology.org/topic_0621"}]},"publication":[{"abstract":"One of the biggest challenges in the study of biological regulatory networks is the systematic organization and integration of complex interactions taking place within various biological pathways. Currently, the information of the biological pathways is dispersed in multiple databases in various formats. hiPathDB is an integrated pathway database that combines the curated human pathway data of NCI-Nature PID, Reactome, BioCarta and KEGG. In total, it includes 1661 pathways consisting of 8976 distinct physical entities. hiPathDB provides two different types of integration. The pathway-level integration, conceptually a simple collection of individual pathways, was achieved by devising an elaborate model that takes distinct features of four databases into account and subsequently reformatting all pathways in accordance with our model. The entity-level integration creates a single unified pathway that encompasses all pathways by merging common components. Even though the detailed molecular-level information such as complex formation or post-translational modifications tends to be lost, such integration makes it possible to investigate signaling network over the entire pathways and allows identification of pathway cross-talks. Another strong merit of hiPathDB is the built-in pathway visualization module that supports explorative studies of complex networks in an interactive fashion. The layout algorithm is optimized for virtually automatic visualization of the pathways. hiPathDB is available at http://hiPathDB.kobic.re.kr. © The Author(s) 2011.","authors":["Yu N.","Seo J.","Rho K.","Jang Y.","Park J.","Kim W.K.","Lee S."],"cit_count":25,"journal":"Nucleic Acids Research","pmid":"22123737","title":"hiPathDB: A human-integrated pathway database with facile visualization","year":"2012-01-01"}],"summary":{"biotoolsCURIE":"biotools:hipathdb","biotoolsID":"hipathdb","description":"human integrated Pathway DataBase with facile visualiztion: an integrated pathway databasethat combines the curated human pathway data of NCI-Nature PID, Reactome, BioCarta, and KEGG.","homepage":"http://hipathdb.kobic.re.kr/","name":"hiPathDB"}}