{
    "additionDate": "2021-01-18T08:13:12Z",
    "biotoolsCURIE": "biotools:plsd",
    "biotoolsID": "plsd",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "moller.pal@gmail.com",
            "name": "Pål Møller",
            "orcidid": "https://orcid.org/0000-0001-8211-8237",
            "typeEntity": "Person"
        }
    ],
    "description": "The Prospective Lynch Syndrome Database reports enable evidence-based personal precision health care.\n\nThe aims of the Prospective Lynch Syndrome Database (PLSD) are to provide empirical prospectively observed data on the incidences of cancer in different organs, survival following cancer and the effects of interventions in carriers of pathogenic variants of the mismatch repair genes (path_MMR) categorized by age, gene and gender. Although PLSD is assumption-free, as with any study the ascertainment procedures used to identify the study cohort will introduce selection biases which have to be declared and considered in detail in order to provide robust and valid results.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Incident curve plotting",
                    "uri": "http://edamontology.org/operation_3503"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://www.PLSD.eu",
    "lastUpdate": "2021-01-24T08:09:49Z",
    "name": "PLSD",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S13053-020-0138-0",
            "metadata": {
                "abstract": "© 2020 The Author(s).The aims of the Prospective Lynch Syndrome Database (PLSD) are to provide empirical prospectively observed data on the incidences of cancer in different organs, survival following cancer and the effects of interventions in carriers of pathogenic variants of the mismatch repair genes (path_MMR) categorized by age, gene and gender. Although PLSD is assumption-free, as with any study the ascertainment procedures used to identify the study cohort will introduce selection biases which have to be declared and considered in detail in order to provide robust and valid results. This paper provides a commentary on the methods used and considers how results from the PLSD reports should be interpreted. A number of the results from PLSD were novel and some in conflict with previous assumptions. Notably, colonoscopic surveillance did not prevent colo-rectal cancer, survival after colo-rectal, endometrial and ovarian cancer was good, no survival gain was observed with more frequent colonoscopy, new causes of cancer-related death were observed in survivors of first cancers due to later cancers in other organs, variants in the different MMR genes caused distinct multi-cancer syndromes characterized by different penetrance and phenotypes. The www.PLSD.eu website together with the InSiGHT database website (https://www.insight-group.org/variants/databases/) now facilitate evidence-based personalized precision health care for individual carriers at increased risk of cancer. The arguments are summarized in a final discussion on how to conceptualize current knowledge for the different practical purposes of treating cancers, genetic counselling and prevention, and for understanding /research on carcinogenetic mechanisms.",
                "authors": [
                    {
                        "name": "Moller P."
                    }
                ],
                "citationCount": 12,
                "date": "2020-03-14T00:00:00Z",
                "journal": "Hereditary Cancer in Clinical Practice",
                "title": "The Prospective Lynch Syndrome Database reports enable evidence-based personal precision health care"
            },
            "pmcid": "PMC7073013",
            "pmid": "32190163"
        }
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        }
    ],
    "validated": 1
}
