{
    "additionDate": "2016-06-16T07:22:11Z",
    "biotoolsCURIE": "biotools:gendbe",
    "biotoolsID": "gendbe",
    "collectionID": [
        "de.NBI",
        "de.NBI-BiGi"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "name": "bigi",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "gendb@computational.bio",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "oliver.rupp@computational.bio.uni-giessen.de",
            "name": "Oliver Rupp",
            "orcidid": "http://orcid.org/0000-0003-2755-6458",
            "typeEntity": "Person",
            "typeRole": [
                "Contributor"
            ]
        }
    ],
    "description": "This tool was developed based on the GenDB genome annotation system that was originally designed for prokaryotic genomes only. The system has been adapted to facilitate the creation and functional annotation of sequence features that are specific for eukaryotic genomes, e.g. intron and exon gene structures.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://gendbe.computational.bio.uni-giessen.de/cgi-bin/login.cgi"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "DNA sequence (raw)",
                        "uri": "http://edamontology.org/data_3497"
                    },
                    "format": [
                        {
                            "term": "GFF3-seq",
                            "uri": "http://edamontology.org/format_1939"
                        },
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "note": "Automatic and manual functional annotation for eukaryotic genomes",
            "operation": [
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Nucleic acid sequence record",
                        "uri": "http://edamontology.org/data_2887"
                    },
                    "format": [
                        {
                            "term": "EMBL format",
                            "uri": "http://edamontology.org/format_1927"
                        },
                        {
                            "term": "GenBank format",
                            "uri": "http://edamontology.org/format_1936"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "https://gendbe.computational.bio.uni-giessen.de",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2019-01-10T04:51:17Z",
    "license": "GPL-2.0",
    "maturity": "Mature",
    "name": "GenDBE",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bigi",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0085568",
            "metadata": {
                "abstract": "Chinese hamster ovary (CHO) cell lines represent the most commonly used mammalian expression system for the production of therapeutic proteins. In this context, detailed knowledge of the CHO cell transcriptome might help to improve biotechnological processes conducted by specific cell lines. Nevertheless, very few assembled cDNA sequences of CHO cells were publicly released until recently, which puts a severe limitation on biotechnological research. Two extended annotation systems and web-based tools, one for browsing eukaryotic genomes (GenDBE) and one for viewing eukaryotic transcriptomes (SAMS), were established as the first step towards a publicly usable CHO cell genome/transcriptome analysis platform. This is complemented by the development of a new strategy to assemble the ca. 100 million reads, sequenced from a broad range of diverse transcripts, to a high quality CHO cell transcript set. The cDNA libraries were constructed from different CHO cell lines grown under various culture conditions and sequenced using Roche/454 and Illumina sequencing technologies in addition to sequencing reads from a previous study. Two pipelines to extend and improve the CHO cell line transcripts were established. First, de novo assemblies were carried out with the Trinity and Oases assemblers, using varying k-mer sizes. The resulting contigs were screened for potential CDS using ESTScan. Redundant contigs were filtered out using cd-hit-est. The remaining CDS contigs were re-assembled with CAP3. Second, a reference-based assembly with the TopHat/Cufflinks pipeline was performed, using the recently published draft genome sequence of CHO-K1 as reference. Additionally, the de novo contigs were mapped to the reference genome using GMAP and merged with the Cufflinks assembly using the cuffmerge software. With this approach 28,874 transcripts located on 16,492 gene loci could be assembled. Combining the results of both approaches, 65,561 transcripts were identified for CHO cell lines, which could be clustered by sequence identity into 17,598 gene clusters. © 2014 Rupp et al.",
                "authors": [
                    {
                        "name": "Rupp O."
                    },
                    {
                        "name": "Becker J."
                    },
                    {
                        "name": "Brinkrolf K."
                    },
                    {
                        "name": "Timmermann C."
                    },
                    {
                        "name": "Borth N."
                    },
                    {
                        "name": "Puhler A."
                    },
                    {
                        "name": "Noll T."
                    },
                    {
                        "name": "Goesmann A."
                    }
                ],
                "citationCount": 42,
                "date": "2014-01-10T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Construction of a public CHO cell line transcript database using versatile bioinformatics analysis pipelines"
            },
            "pmcid": "PMC3888431",
            "pmid": "24427317",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Functional genomics",
            "uri": "http://edamontology.org/topic_0085"
        }
    ],
    "validated": 1,
    "version": [
        "2.4"
    ]
}