{
    "additionDate": "2021-01-18T10:01:45Z",
    "biotoolsCURIE": "biotools:med-tma",
    "biotoolsID": "med-tma",
    "confidence_flag": "tool",
    "description": "A clinical decision support tool for differential diagnosis of TMA with enhanced accuracy using an ensemble method.\n\nFailed to generate visualization...\n\nMED-TMA: Machine learning-based Ensemble model for Diagnosis of TMA.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://hematology.snu.ac.kr/medtma/",
    "lastUpdate": "2021-02-20T17:46:01Z",
    "name": "MED-TMA",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/J.THROMRES.2020.06.045",
            "metadata": {
                "abstract": "© 2020Considering difficulties in on-site ADAMTS13 testing and the performance instability of PLASMIC score according to ethnicity, we developed a prediction tool, MED-TMA (machine learning (ML) method for differential diagnosis (DDx) of thrombotic microangiopathy (TMA)) to support clinical decision. Data from 319 patients visiting 31 hospitals in Korea clinically diagnosed with primary TMA was randomly separated by 2:1 into two groups – the development dataset (D-set, n = 212), the validation dataset (V-set, n = 107). Feature elimination was conducted to select optimal clinical predictors. We developed the model with the selected features using ML methods, verifying using V-set. After the feature elimination using 19 clinical variables, five variables were selected with high importance value. Among nine ML methods, four ML methods were chosen considering the Area Under the Curves (AUC) and the correlation between the methods using D-set. We developed MED-TMA based on an optimized ensemble model with the selected four ML methods resulting in AUC values of 0.945 and 0.924 in D-set and V-set, respectively. In addition to the binary outcome, MED-TMA was capable of providing a probability for DDx of TMA. The ensemble approach driven MED-TMA showed comparable accurate and intuitive decision support for DDx of TMA to that of the existing models based on a single ML method. We provide a web-based nomogram for the appropriate use of effective but costly therapeutics to treat TMA patients (http://hematology.snu.ac.kr/medtma/).",
                "authors": [
                    {
                        "name": "Kim D."
                    },
                    {
                        "name": "Kim I."
                    },
                    {
                        "name": "Koh Y."
                    },
                    {
                        "name": "Lee S."
                    },
                    {
                        "name": "Oh D."
                    },
                    {
                        "name": "Sun C.-H."
                    },
                    {
                        "name": "Yoon J."
                    },
                    {
                        "name": "Yoon S.-S."
                    },
                    {
                        "name": "Yun H."
                    }
                ],
                "date": "2020-09-01T00:00:00Z",
                "journal": "Thrombosis Research",
                "title": "MED-TMA: A clinical decision support tool for differential diagnosis of TMA with enhanced accuracy using an ensemble method"
            },
            "pmid": "32622194"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
