{"credit":[{"email":"ohue@c.titech.ac.jp","name":"Masahito Ohue","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"akiyama@c.titech.ac.jp","name":"Yutaka Akiyama","typeEntity":"Person","typeRoles":["Primary contact"]}],"function":[{"operation":[{"term":"Protein-protein interaction prediction","uri":"http://edamontology.org/operation_2464"}]}],"labels":{"accessibility":["Open access"],"cost":"Free of charge","operatingSystem":["Linux","Windows","Mac"],"toolType":["Database portal"],"topic":[{"term":"Proteins","uri":"http://edamontology.org/topic_0078"}]},"publication":[{"abstract":"© 2018 The Author(s).Background: Protein-protein interactions (PPIs) play several roles in living cells, and computational PPI prediction is a major focus of many researchers. The three-dimensional (3D) structure and binding surface are important for the design of PPI inhibitors. Therefore, rigid body protein-protein docking calculations for two protein structures are expected to allow elucidation of PPIs different from known complexes in terms of 3D structures because known PPI information is not explicitly required. We have developed rapid PPI prediction software based on protein-protein docking, called MEGADOCK. In order to fully utilize the benefits of computational PPI predictions, it is necessary to construct a comprehensive database to gather prediction results and their predicted 3D complex structures and to make them easily accessible. Although several databases exist that provide predicted PPIs, the previous databases do not contain a sufficient number of entries for the purpose of discovering novel PPIs. Results: In this study, we constructed an integrated database of MEGADOCK PPI predictions, named MEGADOCK-Web. MEGADOCK-Web provides more than 10 times the number of PPI predictions than previous databases and enables users to conduct PPI predictions that cannot be found in conventional PPI prediction databases. In MEGADOCK-Web, there are 7528 protein chains and 28,331,628 predicted PPIs from all possible combinations of those proteins. Each protein structure is annotated with PDB ID, chain ID, UniProt AC, related KEGG pathway IDs, and known PPI pairs. Additionally, MEGADOCK-Web provides four powerful functions: 1) searching precalculated PPI predictions, 2) providing annotations for each predicted protein pair with an experimentally known PPI, 3) visualizing candidates that may interact with the query protein on biochemical pathways, and 4) visualizing predicted complex structures through a 3D molecular viewer. Conclusion: MEGADOCK-Web provides a huge amount of comprehensive PPI predictions based on docking calculations with biochemical pathways and enables users to easily and quickly assess PPI feasibilities by archiving PPI predictions. MEGADOCK-Web also promotes the discovery of new PPIs and protein functions and is freely available for use at http://www.bi.cs.titech.ac.jp/megadock-web/.","authors":["Hayashi T.","Matsuzaki Y.","Yanagisawa K.","Ohue M.","Akiyama Y."],"cit_count":0,"doi":"10.1186/s12859-018-2073-x","journal":"BMC Bioinformatics","title":"MEGADOCK-Web: An integrated database of high-throughput structure-based protein-protein interaction predictions","type":"Primary","year":"2018-05-08"}],"summary":{"biotoolsCURIE":"biotools:megadock-web","biotoolsID":"megadock-web","description":"It is an integrated database of high-throughput structure-based PPI predictions.","homepage":"http://www.bi.cs.titech.ac.jp/megadock-web/","name":"MEGADOCK-Web"}}