{
    "additionDate": "2017-03-27T12:32:37Z",
    "biotoolsCURIE": "biotools:ngsmethdb",
    "biotoolsID": "ngsmethdb",
    "credit": [
        {
            "email": "mlhack@gmail.com",
            "name": "Michael Hackenberg",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Database that contains methylation data derived from next-generation sequencing (NGS). Two cytosine methylation contexts (CpG and CAG/CTG) are considered. Through a browser interface, the user can search for methylation states in a set of tissues, retrieve methylation values for a set of tissues in a given chromosomal region, or display the methylation of promoters among different tissues. The database is currently populated with human, mouse and Arabidopsis data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://en.wikipedia.org/wiki/NGSmethDB"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "CpG island and isochore detection",
                    "uri": "http://edamontology.org/operation_0430"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Methylation analysis",
                    "uri": "http://edamontology.org/operation_3204"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo2.ugr.es/NGSmethDB/gbrowse/",
    "homepage_status": 1,
    "language": [
        "SQL"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "name": "NGSmethDB",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Next-generation sequencing (NGS) together with bisulphite conversion allows the generation of whole genome methylation maps at single-cytosine resolution. This allows studying the absence of methylation in a particular genome region over a range of tissues, the differential tissue methylation or the changes occurring along pathological conditions. However, no database exists fully addressing such requirements. We propose here NGSmethDB (http://bioinfo2.ugr.es/ NGSmethDB/gbrowse/) for the storage and retrieval of methylation data derived from NGS. Two cytosine methylation contexts (CpG and CAG/CTG) are considered. Through a browser interface coupled to a MySQL backend and several data mining tools, the user can search for methylation states in a set of tissues, retrieve methylation values for a set of tissues in a given chromosomal region, or display the methylation of promoters among different tissues. NGSmethDB is currently populated with human, mouse and Arabidopsis data, but other methylomes will be incorporated through an automatic pipeline as soon as new data become available. Dump downloads for three coverage levels (1, 5 or 10 reads) are available. NGSmethDB will be useful for experimental researchers, as well as for bioinformaticians, who might use the data as input for further research. © The Author(s) 2010.",
                "authors": [
                    {
                        "name": "Barturen G."
                    },
                    {
                        "name": "Hackenberg M."
                    },
                    {
                        "name": "Oliver J.L."
                    }
                ],
                "citationCount": 45,
                "date": "2011-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "NGSmethDB: A database for next-generation sequencing single-cytosine- resolution DNAmethylation data"
            },
            "pmid": "20965971"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Methylated DNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3674"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
