{
    "additionDate": "2021-01-18T10:03:59Z",
    "biotoolsCURIE": "biotools:saslm",
    "biotoolsID": "saslm",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ksbae@amc.seoul.kr",
            "name": "Kyun-Seop Bae",
            "orcidid": "https://orcid.org/0000-0001-7399-5879",
            "typeEntity": "Person"
        }
    ],
    "description": "Validation of \"sasLM,\" an R package for linear models with type III sum of squares.\n\nThis is a core implementation of 'SAS' procedures for linear models - GLM, REG, and ANOVA. Some packages provide type II and type III SS. However, the results of nested and complex designs are often different from those of 'SAS.' Different results does not necessarily mean incorrectness. However, many wants the same results to SAS. This package aims to achieve that.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "http://CRAN.R-project.org/package=sasLM",
    "language": [
        "R",
        "SAS"
    ],
    "lastUpdate": "2021-02-11T16:26:29Z",
    "license": "GPL-3.0",
    "name": "sasLM",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.12793/TCP.2020.28.E9",
            "metadata": {
                "abstract": "© 2020 Translational and Clinical Pharmacology.The general linear model (GLM) describes the dependent variable as a linear combination of independent variables and an error term. The GLM procedure of SAS® and the “car” package in R calculate the type I, II, or III ANOVA (analysis of variance) tables. In this study, we validated the newly-developed R package, “sasLM,” which is compatible with the GLM procedure of SAS®. The “sasLM” package was validated by comparing the output with SAS®, which is the current gold standard for statistical programming. Data from ten books and articles were used for validation. The results of the “sasLM” and “car” packages were compared with those in SAS® using 194 models. All of the results in “sasLM” were identical to those of SAS®, whereas more than 20 models in “car” showed different results from those of SAS®. As the results of the “sasLM” package were similar to those in SAS® PROC GLM, the “sasLM” package could be a viable alternative method for calculating the type II and III sum of squares. The newly-developed “sasLM” package is free and open-source, therefore it can be used to develop other useful packages as well. We hope that the “sasLM” package will enable researchers to conveniently analyze linear models.",
                "authors": [
                    {
                        "name": "Bae K.-S."
                    },
                    {
                        "name": "Choi D."
                    },
                    {
                        "name": "Kim H."
                    },
                    {
                        "name": "Sunwoo J."
                    }
                ],
                "citationCount": 1,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Translational and Clinical Pharmacology",
                "title": "Validation of “Saslm,” an R package for linear models with type III sum of squares"
            },
            "pmcid": "PMC7327187",
            "pmid": "32656159"
        }
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Laboratory techniques",
            "uri": "http://edamontology.org/topic_3361"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
