{
    "accessibility": [],
    "additionDate": "2016-04-08T14:09:04Z",
    "biotoolsCURIE": "biotools:predtm",
    "biotoolsID": "predtm",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": null,
            "gridid": null,
            "name": "ELIXIR-SI-hackathon",
            "note": null,
            "orcidid": null,
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ],
            "url": null
        },
        {
            "email": "marjana.novic@ki.si",
            "gridid": null,
            "name": "Marjana Novič",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        }
    ],
    "description": "Two independent algorithms, which predict the transmembrane regions of integral membrane proteins. The underlying model is a SVM classifier trained on sequence data of transmembrane proteins with known structures. Given a protein sequence as input, the algorithms predict the probable transmembrane regions based on amino acid adjacency frequency and position specific preference of amino acids in the transmembrane regions.",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "http://transpred.ki.si/"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [
                {
                    "data": {
                        "term": "Protein sequence",
                        "uri": "http://edamontology.org/data_2976"
                    },
                    "format": [
                        {
                            "term": "FASTA-like (text)",
                            "uri": "http://edamontology.org/format_2200"
                        }
                    ]
                }
            ],
            "note": "Prediction of protein transmembrane domains The allowed input format is plain text or FASTA format. \nA correct protein sequence should contain only the one letter abbreviations of the 20 natural amino acids. Missing residues can be represented by X. No other characters should be present in the input sequence.\nEach protein sequence should follow a sequence identifier marked by > in a separate line.",
            "operation": [
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Sequence report",
                        "uri": "http://edamontology.org/data_2955"
                    },
                    "format": [
                        {
                            "term": "plain text format (unformatted)",
                            "uri": "http://edamontology.org/format_1964"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://transpred.ki.si",
    "homepage_status": 0,
    "language": [],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "license": null,
    "link": [],
    "maturity": null,
    "name": "PredTM",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "brane",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0145564",
            "metadata": {
                "abstract": "© 2015 Roy Choudhury, Novič. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Predicting the transmembrane regions is an important aspect of understanding the structures and architecture of different β-barrel membrane proteins. Despite significant efforts, currently available β-transmembrane region predictors are still limited in terms of prediction accuracy, especially in precision. Here, we describe PredβTM, a transmembrane region prediction algorithm for β-barrel proteins. Using amino acid pair frequency information in known β-transmembrane protein sequences, we have trained a support vector machine classifier to predict β-transmembrane segments. Position-specific amino acid preference data is incorporated in the final prediction. The predictor does not incorporate evolutionary profile information explicitly, but is based on sequence patterns generated implicitly by encoding the protein segments using amino acid adjacency matrix. With a benchmark set of 35 β-transmembrane proteins, PredβTM shows a sensitivity and precision of 83.71% and 72.98%, respectively. The segment overlap score is 82.19%. In comparison with other state-of-art methods, PredβTM provides a higher precision and segment overlap without compromising with sensitivity. Further, we applied PredβTM to analyze the β-barrel membrane proteins without defined transmembrane regions and the uncharacterized protein sequences in eight bacterial genomes and predict possible β-transmembrane proteins. PredβTM can be freely accessed on the web at http://transpred.ki.si/.",
                "authors": [
                    {
                        "name": "Choudhury A.R."
                    },
                    {
                        "name": "Novic M."
                    }
                ],
                "citationCount": 2,
                "date": "2015-12-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "PredβTM: A novel β-transmembrane region prediction algorithm"
            },
            "note": null,
            "pmcid": null,
            "pmid": null,
            "type": "Primary",
            "version": null
        },
        {
            "doi": "10.1371/journal.pone.0038967",
            "metadata": {
                "abstract": "Using a combination of genomic and post-genomic approaches is rapidly altering the number of identified human influx carriers. A transmembrane protein bilitranslocase (TCDB 2.A.65) has long attracted attention because of its function as an organic anion carrier. It has also been identified as a potential membrane transporter for cellular uptake of several drugs and due to its implication in drug uptake, it is extremely important to advance the knowledge about its structure. However, at present, only the primary structure of bilitranslocase is known. In our work, transmembrane subunits of bilitranslocase were predicted by a previously developed chemometrics model and the stability of these polypeptide chains were studied by molecular dynamics (MD) simulation. Furthermore, sodium dodecyl sulfate (SDS) micelles were used as a model of cell membrane and herein we present a high-resolution 3D structure of an 18 amino acid residues long peptide corresponding to the third transmembrane part of bilitranslocase obtained by use of multidimensional NMR spectroscopy. It has been experimentally confirmed that one of the transmembrane segments of bilitranslocase has alpha helical structure with hydrophilic amino acid residues oriented towards one side, thus capable of forming a channel in the membrane. © 2012 Perdih et al.",
                "authors": [
                    {
                        "name": "Perdih A."
                    },
                    {
                        "name": "Choudhury A."
                    },
                    {
                        "name": "Zuperl S."
                    },
                    {
                        "name": "Sikorska E."
                    },
                    {
                        "name": "Zhukov I."
                    },
                    {
                        "name": "Solmajer T."
                    },
                    {
                        "name": "Novic M."
                    }
                ],
                "citationCount": 10,
                "date": "2012-06-20T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Structural analysis of a peptide fragment of transmembrane transporter protein bilitranslocase"
            },
            "note": null,
            "pmcid": null,
            "pmid": null,
            "type": "Other",
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}