{
    "additionDate": "2021-01-18T10:36:30Z",
    "biotoolsCURIE": "biotools:profumo",
    "biotoolsID": "profumo",
    "confidence_flag": "tool",
    "description": "Modelling subject variability in the spatial and temporal characteristics of functional modes.\n\nRecent work has highlighted the scale and ubiquity of subject variability in observations from functional MRI data (fMRI). Furthermore, it is highly likely that errors in the estimation of either the spatial presentation of, or the coupling between, functional regions can confound cross-subject analyses, making accurate and unbiased representations of functional data essential for interpreting any downstream analyses. Here, we extend the framework of probabilistic functional modes (PFMs) (Harrison et al., 2015) to capture cross-subject variability not only in the mode spatial maps, but also in the functional coupling between modes and in mode amplitudes",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "http://git.fmrib.ox.ac.uk/samh/profumo",
    "lastUpdate": "2021-01-27T17:47:54Z",
    "name": "PROFUMO",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1016/J.NEUROIMAGE.2020.117226",
            "metadata": {
                "abstract": "© 2020Recent work has highlighted the scale and ubiquity of subject variability in observations from functional MRI data (fMRI). Furthermore, it is highly likely that errors in the estimation of either the spatial presentation of, or the coupling between, functional regions can confound cross-subject analyses, making accurate and unbiased representations of functional data essential for interpreting any downstream analyses. Here, we extend the framework of probabilistic functional modes (PFMs) (Harrison et al., 2015) to capture cross-subject variability not only in the mode spatial maps, but also in the functional coupling between modes and in mode amplitudes. A new implementation of the inference now also allows for the analysis of modern, large-scale data sets, and the combined inference and analysis package, PROFUMO, is available from git.fmrib.ox.ac.uk/samh/profumo. A new implementation of the inference now also allows for the analysis of modern, large-scale data sets. Using simulated data, resting-state data from 1000 subjects collected as part of the Human Connectome Project (Van Essen et al., 2013), and an analysis of 14 subjects in a variety of continuous task-states (Kieliba et al., 2019), we demonstrate how PFMs are able to capture, within a single model, a rich description of how the spatio-temporal structure of resting-state fMRI activity varies across subjects. We also compare the new PFM model to the well established independent component analysis with dual regression (ICA-DR) pipeline. This reveals that, under PFM assumptions, much more of the (behaviorally relevant) cross-subject variability in fMRI activity should be attributed to the variability in spatial maps, and that, after accounting for this, functional coupling between modes primarily reflects current cognitive state. This has fundamental implications for the interpretation of cross-sectional studies of functional connectivity that do not capture cross-subject variability to the same extent as PFMs.",
                "authors": [
                    {
                        "name": "Bijsterbosch J.D."
                    },
                    {
                        "name": "Duff E.P."
                    },
                    {
                        "name": "Farahibozorg S.-R."
                    },
                    {
                        "name": "Fitzgibbon S.P."
                    },
                    {
                        "name": "Harrison S.J."
                    },
                    {
                        "name": "Segerdahl A.R."
                    },
                    {
                        "name": "Smith S.M."
                    },
                    {
                        "name": "Woolrich M.W."
                    }
                ],
                "citationCount": 3,
                "date": "2020-11-15T00:00:00Z",
                "journal": "NeuroImage",
                "title": "Modelling subject variability in the spatial and temporal characteristics of functional modes"
            },
            "pmid": "32771617"
        }
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
