{
    "additionDate": "2017-08-03T19:02:59Z",
    "biotoolsCURIE": "biotools:tsser",
    "biotoolsID": "tsser",
    "credit": [
        {
            "email": "hadi.jorjani@unibas.ch",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.isb-sib.ch/"
        }
    ],
    "description": "Computational pipeline designed to analyze dRNA-seq data to determine transcription start sites genome-wide.",
    "documentation": [
        {
            "type": "User manual",
            "url": "http://www.clipz.unibas.ch/downloads/TSSer/TSSer_manual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Promoter prediction",
                    "uri": "http://edamontology.org/operation_0440"
                }
            ]
        }
    ],
    "homepage": "http://www.clipz.unibas.ch/downloads/TSSer/index.php",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:44Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/tsser-v-1-identify-transcription-start-sites-in-bacterial-genomes.html"
        }
    ],
    "name": "TSSer",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: Accurate identification of transcription start sites (TSSs) is an essential step in the analysis of transcription regulatory networks. In higher eukaryotes, the capped analysis of gene expression technology enabled comprehensive annotation of TSSs in genomes such as those of mice and humans. In bacteria, an equivalent approach, termed differential RNA sequencing (dRNA-seq), has recently been proposed, but the application of this approach to a large number of genomes is hindered by the paucity of computational analysis methods. With few exceptions, when the method has been used, annotation of TSSs has been largely done manually.Results: In this work, we present a computational method called 'TSSer' that enables the automatic inference of TSSs from dRNA-seq data. The method rests on a probabilistic framework for identifying both genomic positions that are preferentially enriched in the dRNA-seq data as well as preferentially captured relative to neighboring genomic regions. Evaluating our approach for TSS calling on several publicly available datasets, we find that TSSer achieves high consistency with the curated lists of annotated TSSs, but identifies many additional TSSs. Therefore, TSSer can accelerate genome-wide identification of TSSs in bacterial genomes and can aid in further characterization of bacterial transcription regulatory networks. © 2013 The Author 2013. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Jorjani H."
                    },
                    {
                        "name": "Zavolan M."
                    }
                ],
                "citationCount": 14,
                "date": "2014-04-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "TSSer: An automated method to identify transcription start sites in prokaryotic genomes from differential RNA sequencing data"
            },
            "pmid": "24371151"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}