{
    "accessibility": "Open access",
    "additionDate": "2024-06-19T07:49:12.143771Z",
    "biotoolsCURIE": "biotools:permutedds",
    "biotoolsID": "permutedds",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "junjie2021@njmu.edu.cn",
            "name": "Junjie Wang",
            "typeEntity": "Person"
        },
        {
            "email": "liuyun@njmu.edu.cn",
            "name": "Yun Liu",
            "typeEntity": "Person"
        }
    ],
    "description": "Permutable feature fusion network for drug-drug synergy prediction.\nPermuteDDS takes multiple representations of drugs and cell lines as input and employs a permutable fusion mechanism to combine drug and cell line features.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Small molecule design",
                    "uri": "http://edamontology.org/operation_4009"
                }
            ]
        }
    ],
    "homepage": "https://github.com/littlewei-lazy/PermuteDDS",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-06-19T07:49:12.145965Z",
    "license": "MIT",
    "name": "PermuteDDS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/s13321-024-00839-8",
            "metadata": {
                "abstract": "Motivation: Drug combination therapies have shown promise in clinical cancer treatments. However, it is hard to experimentally identify all drug combinations for synergistic interaction even with high-throughput screening due to the vast space of potential combinations. Although a number of computational methods for drug synergy prediction have proven successful in narrowing down this space, fusing drug pairs and cell line features effectively still lacks study, hindering current algorithms from understanding the complex interaction between drugs and cell lines. Results: In this paper, we proposed a Permutable feature fusion network for Drug-Drug Synergy prediction, named PermuteDDS. PermuteDDS takes multiple representations of drugs and cell lines as input and employs a permutable fusion mechanism to combine drug and cell line features. In experiments, PermuteDDS exhibits state-of-the-art performance on two benchmark data sets. Additionally, the results on independent test set grouped by different tissues reveal that PermuteDDS has good generalization performance. We believed that PermuteDDS is an effective and valuable tool for identifying synergistic drug combinations. It is publicly available at https://github.com/littlewei-lazy/PermuteDDS. Scientific contribution: First, this paper proposes a permutable feature fusion network for predicting drug synergy termed PermuteDDS, which extract diverse information from multiple drug representations and cell line representations. Second, the permutable fusion mechanism combine the drug and cell line features by integrating information of different channels, enabling the utilization of complex relationships between drugs and cell lines. Third, comparative and ablation experiments provide evidence of the efficacy of PermuteDDS in predicting drug-drug synergy.",
                "authors": [
                    {
                        "name": "Che K."
                    },
                    {
                        "name": "Hu J."
                    },
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Shui Y."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Xu J."
                    },
                    {
                        "name": "Xu M."
                    },
                    {
                        "name": "Zhao X."
                    }
                ],
                "date": "2024-12-01T00:00:00Z",
                "journal": "Journal of Cheminformatics",
                "title": "PermuteDDS: a permutable feature fusion network for drug-drug synergy prediction"
            },
            "pmcid": "PMC11017561",
            "pmid": "38622663"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ]
}
