{
    "additionDate": "2019-11-14T18:31:06Z",
    "biotoolsCURIE": "biotools:CSF-PR",
    "biotoolsID": "CSF-PR",
    "confidence_flag": "tool",
    "description": "Essential Features and Use Cases of the Cerebrospinal Fluid Proteome Resource (CSF-PR) | Every year, a large number of published studies present biomarkers for various neurological disorders. Many of these studies are based on mass spectrometry proteomics data and describe comparison of the abundance of proteins in cerebrospinal fluid between two or more disease groups. As the number of such studies is growing, it is no longer straightforward to obtain an overview of which specific proteins are increased or decreased between the numerous relevant diseases and their many subcategories, or to see the larger picture or trends between related diseases",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "homepage": "https://proteomics.uib.no/csf-pr/",
    "lastUpdate": "2020-12-17T09:58:17Z",
    "name": "CSF-PR",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/978-1-4939-9706-0_25",
            "metadata": {
                "abstract": "© Springer Science+Business Media, LLC, part of Springer Nature 2019.Every year, a large number of published studies present biomarkers for various neurological disorders. Many of these studies are based on mass spectrometry proteomics data and describe comparison of the abundance of proteins in cerebrospinal fluid between two or more disease groups. As the number of such studies is growing, it is no longer straightforward to obtain an overview of which specific proteins are increased or decreased between the numerous relevant diseases and their many subcategories, or to see the larger picture or trends between related diseases. To alleviate this situation, we therefore mined the literature for mass spectrometry–based proteomics studies including quantitative protein data from cerebrospinal fluid of patients with multiple sclerosis, Alzheimer’s disease, and Parkinson’s disease and organized the extracted data in the Cerebrospinal Fluid Proteome Resource (CSF-PR). CSF-PR is freely available online at http://probe.uib.no/csf-pr, is highly interactive, and allows for easy navigation, visualization, and export of the published scientific data. This chapter will guide the user through some of the most important features of the tool and show examples of the suggested use cases.",
                "authors": [
                    {
                        "name": "Barsnes H."
                    },
                    {
                        "name": "Berven F.S."
                    },
                    {
                        "name": "Farag Y.M."
                    },
                    {
                        "name": "Guldbrandsen A."
                    },
                    {
                        "name": "Lereim R.R."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Methods in Molecular Biology",
                "title": "Essential features and use cases of the cerebrospinal fluid proteome resource (CSF-PR)"
            },
            "pmid": "31432427"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ],
    "validated": 1
}
