
{
    "credit": [
        {
            "name": "bils.se",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://prime.sbc.su.se/cgi-bin/arve@csc.kth.se"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://prime.sbc.su.se/primetv/"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Phylogenetic tree",
                        "uri": "http://edamontology.org/data_0872"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Phylogenetic tree analysis",
                    "uri": "http://edamontology.org/operation_0324"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Phylogenetic tree",
                        "uri": "http://edamontology.org/data_0872"
                    }
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Data visualisation",
                "uri": "http://edamontology.org/topic_0092"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Background: Evolutionary processes, such as gene family evolution or parasite-host co-speciation, can often be viewed as a tree evolving inside another tree. Relating two given trees under such a constraint is known as reconciling them. Adequate software tools for generating illustrations of tree reconciliations are instrumental for presenting and communicating results and ideas regarding these phenomena. Available visualization tools have been limited to illustrations of the most parsimonious reconciliation. However, there exists a plethora of biologically relevant non-parsimonious reconciliations. Illustrations of these general reconciliations may not be achieved without manual editing. Results: We have developed a new reconciliation viewer, primetv. It is a simple and compact visualization program that is the first automatic tool for illustrating general tree reconciliations. It reads reconciled trees in an extended Newick format and outputs them as tree-within-tree illustrations in a range of graphic formats. Output attributes, such as colors and layout, can easily be adjusted by the user. To enhance the construction of input to primetv, two helper programs, readReconciliation and reconcile, accompany primetv. Detailed examples of all programs' usage are provided in the text. For the casual user a web-service provides a simple user interface to all programs. Conclusion: With primetv, the first visualization tool for general reconciliations, illustrations of trees-within-trees are easy to produce. Because it clarifies and accentuates an underlying structure in a reconciled tree, e.g., the impact of a species tree on a gene-family phylogeny, it will enhance scientific presentations as well as pedagogic illustrations in an educational setting. primetv is available at http://prime.sbc.su.se/primetv, both as a standalone command-line tool and as a web service. The software is distributed under the GNU General Public License. © 2007 Sennblad et al; licensee BioMed Central Ltd.",
            "authors": [
                "Sennblad B.",
                "Schreil E.",
                "Berglund Sonnhammer A.-C.",
                "Lagergren J.",
                "Arvestad L."
            ],
            "cit_count": 13,
            "doi": "10.1186/1471-2105-8-148",
            "journal": "BMC Bioinformatics",
            "title": "Primetv: A viewer for reconciled trees",
            "type": "Primary",
            "year": "2007-05-07"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:primetv",
        "biotoolsID": "primetv",
        "description": "Visualize tree reconciliations.",
        "homepage": "http://prime.sbc.su.se/primetv/",
        "name": "PrIMETV",
        "version": [
            "1"
        ]
    }
}