
{
    "credit": [
        {
            "email": "Anil.Thanki@earlham.ac.uk",
            "name": "Anil S Thanki",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/TGAC/earlham-galaxytools/tree/master/workflows/GeneSeqToFamily"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence clustering",
                    "uri": "http://edamontology.org/operation_0291"
                },
                {
                    "term": "Phylogenetic tree generation",
                    "uri": "http://edamontology.org/operation_0323"
                },
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "JavaScript",
            "SQL",
            "Perl",
            "Python"
        ],
        "license": "MIT",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            },
            {
                "term": "Gene and protein families",
                "uri": "http://edamontology.org/topic_0623"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author(s) 2018. Background: Gene duplication is a major factor contributing to evolutionary novelty, and the contraction or expansion of gene families has often been associated with morphological, physiological, and environmental adaptations. The study of homologous genes helps us to understand the evolution of gene families. It plays a vital role in finding ancestral gene duplication events as well as identifying genes that have diverged from a common ancestor under positive selection. There are various tools available, such as MSOAR, OrthoMCL, and HomoloGene, to identify gene families and visualize syntenic information between species, providing an overview of syntenic regions evolution at the family level. Unfortunately, none of them provide information about structural changes within genes, such as the conservation of ancestral exon boundaries among multiple genomes. The Ensembl GeneTrees computational pipeline generates gene trees based on coding sequences, provides details about exon conservation, and is used in the Ensembl Compara project to discover gene families. Findings: A certain amount of expertise is required to configure and run the Ensembl Compara GeneTrees pipeline via command line. Therefore, we converted this pipeline into a Galaxy workflow, called GeneSeqToFamily, and provided additional functionality. This workflow uses existing tools from the Galaxy ToolShed, as well as providing additional wrappers and tools that are required to run the workflow. Conclusions: GeneSeqToFamily represents the Ensembl GeneTrees pipeline as a set of interconnected Galaxy tools, so they can be run interactively within the Galaxy's user-friendly workflow environment while still providing the flexibility to tailor the analysis by changing configurations and tools if necessary. Additional tools allow users to subsequently visualize the gene families produced by the workflow, using the Aequatus.js interactive tool, which has been developed as part of the Aequatus software project.",
            "authors": [
                "Thanki A.S.",
                "Soranzo N.",
                "Haerty W.",
                "Davey R.P."
            ],
            "cit_count": 0,
            "doi": "10.1093/gigascience/giy005",
            "journal": "GigaScience",
            "title": "GeneSeqToFamily: A Galaxy workflow to find gene families based on the Ensembl Compara GeneTrees pipeline",
            "year": "2018-03-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:geneseqtofamily",
        "biotoolsID": "geneseqtofamily",
        "description": "The Ensembl GeneTrees pipeline as a Galaxy workflow.",
        "homepage": "https://github.com/TGAC/earlham-galaxytools/tree/master/workflows/GeneSeqToFamily",
        "name": "GeneSeqToFamily",
        "version": [
            "0.1.0"
        ]
    }
}