{
    "additionDate": "2023-01-28T14:04:18.419955Z",
    "biotoolsCURIE": "biotools:gifdti",
    "biotoolsID": "gifdti",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Jianxin Wang",
            "orcidid": "https://orcid.org/0000-0003-1516-0480"
        }
    ],
    "description": "Prediction of drug-target interactions based on global molecular and intermolecular interaction representation learning.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/zhaoqichang/GIFDTI",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-01-28T14:04:18.422455Z",
    "license": "Not licensed",
    "name": "GIFDTI",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1109/TCBB.2022.3225423",
            "metadata": {
                "abstract": "IEEEDrug discovery and drug repurposing often rely on the successful prediction of drug-target interactions (DTIs). Recent advances have shown great promise in applying deep learning to drug-target interaction prediction. One challenge in building deep learning-based models is to adequately represent drugs and proteins that encompass the fundamental local chemical environments and long-distance information among amino acids of proteins (or atoms of drugs). Another challenge is to efficiently model the intermolecular interactions between drugs and proteins, which plays vital roles in the DTIs. To this end, we propose a novel model, GIFDTI, which consists of three key components: the sequence feature extractor (CNNFormer), the global molecular feature extractor (GF), and the intermolecular interaction modeling module (IIF). Specifically, CNNFormer incorporates CNN and Transformer to capture the local patterns and encode the long-distance relationship among tokens (atoms or amino acids) in a sequence. Then, GF and IIF extract the global molecular features and the intermolecular interaction features, respectively. We evaluate GIFDTI on six realistic evaluation strategies and the results show it improves DTI prediction performance compared to state-of-the-art methods. Moreover, case studies confirm that our model can be a useful tool to accurately yield low-cost DTIs. The codes of GIFDTI are available at <uri>https://github.com/zhaoqichang/GIFDTI</uri>.",
                "authors": [
                    {
                        "name": "Duan G."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Zhao H."
                    },
                    {
                        "name": "Zhao Q."
                    },
                    {
                        "name": "Zheng K."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
                "title": "GIFDTI: Prediction of drug-target interactions based on global molecular and intermolecular interaction representation learning"
            },
            "pmid": "36445997"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
