{
    "name": "QUALIFIER", 
    "description": "Provides quality control and quality assessment tools for gated flow cytometry data.", 
    "homepage": "http://bioconductor.org/packages/release/bioc/html/QUALIFIER.html", 
    "biotoolsID": "qualifier", 
    "biotoolsCURIE": "biotools:qualifier", 
    "version": [
        "1.18.0"
    ], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2428", 
                    "term": "Validation"
                }
            ], 
            "input": [
                {
                    "data": {
                        "uri": "http://edamontology.org/data_3108", 
                        "term": "Experimental measurement"
                    }, 
                    "format": [
                        {
                            "uri": "http://edamontology.org/format_3033", 
                            "term": "Matrix format"
                        }
                    ]
                }
            ], 
            "output": [
                {
                    "data": {
                        "uri": "http://edamontology.org/data_2884", 
                        "term": "Plot"
                    }, 
                    "format": [
                        {
                            "uri": "http://edamontology.org/format_3547", 
                            "term": "Image format"
                        }
                    ]
                }
            ], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool", 
        "Library"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3572", 
            "term": "Data quality management"
        }, 
        {
            "uri": "http://edamontology.org/topic_2229", 
            "term": "Cell biology"
        }, 
        {
            "uri": "http://edamontology.org/topic_0092", 
            "term": "Data visualisation"
        }, 
        {
            "uri": "http://edamontology.org/topic_2640", 
            "term": "Oncology"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "R"
    ], 
    "license": "Artistic-2.0", 
    "collectionID": [
        "BioConductor"
    ], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [
        {
            "url": "http://bioconductor/packages/release/bioc/src/contrib/QUALIFIER_1.18.0.tar.gz", 
            "type": "Source code", 
            "note": null, 
            "version": null
        }
    ], 
    "documentation": [
        {
            "url": "http://bioconductor.org/packages/release/bioc/html/QUALIFIER.html", 
            "type": "Manual", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1186/1471-2105-13-252", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "QUAliFiER: An automated pipeline for quality assessment of gated flow cytometry data", 
                "abstract": "Background: Effective quality assessment is an important part of any high-throughput flow cytometry data analysis pipeline, especially when considering the complex designs of the typical flow experiments applied in clinical trials. Technical issues like instrument variation, problematic antibody staining, or reagent lot changes can lead to biases in the extracted cell subpopulation statistics. These biases can manifest themselves in non-obvious ways that can be difficult to detect without leveraging information about the study design or other experimental metadata. Consequently, a systematic and integrated approach to quality assessment of flow cytometry data is necessary to effectively identify technical errors that impact multiple samples over time. Gated cell populations and their statistics must be monitored within the context of the experimental run, assay, and the overall study.Results: We have developed two new packages, flowWorkspace and QUAliFiER to construct a pipeline for quality assessment of gated flow cytometry data. flowWorkspace makes manually gated data accessible to BioConductor's computational flow tools by importing pre-processed and gated data from the widely used manual gating tool, FlowJo (Tree Star Inc, Ashland OR). The QUAliFiER package takes advantage of the manual gates to perform an extensive series of statistical quality assessment checks on the gated cell sub-populations while taking into account the structure of the data and the study design to monitor the consistency of population statistics across staining panels, subject, aliquots, channels, or other experimental variables. QUAliFiER implements SVG-based interactive visualization methods, allowing investigators to examine quality assessment results across different views of the data, and it has a flexible interface allowing users to tailor quality checks and outlier detection routines to suit their data analysis needs.Conclusion: We present a pipeline constructed from two new R packages for importing manually gated flow cytometry data and performing flexible and robust quality assessment checks. The pipeline addresses the increasing demand for tools capable of performing quality checks on large flow data sets generated in typical clinical trials. The QUAliFiER tool objectively, efficiently, and reproducibly identifies outlier samples in an automated manner by monitoring cell population statistics from gated or ungated flow data conditioned on experiment-level metadata. © 2012 Finak et al.; licensee BioMed Central Ltd.", 
                "date": "2012-09-28T00:00:00Z", 
                "citationCount": 10, 
                "authors": [
                    {
                        "name": "Finak G."
                    }, 
                    {
                        "name": "Jiang W."
                    }, 
                    {
                        "name": "Pardo J."
                    }, 
                    {
                        "name": "Asare A."
                    }, 
                    {
                        "name": "Gottardo R."
                    }
                ], 
                "journal": "BMC Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": "Mike Jiang", 
            "email": "wjiang2@fhcrc.org", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "bioconductor_import", 
    "additionDate": "2017-01-17T14:59:38Z", 
    "lastUpdate": "2018-12-10T12:58:54Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}