{
    "additionDate": "2017-01-13T13:16:32Z",
    "biotoolsCURIE": "biotools:snip-seq",
    "biotoolsID": "snip-seq",
    "credit": [
        {
            "email": "vbansal@scripps.edu",
            "name": "Vikas Bansal",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Tool for discovering SNPs in population sequencing data",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://bansal-lab.github.io/software/old/snipseq.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                }
            ]
        }
    ],
    "homepage": "https://bansal-lab.github.io/software/old/snipseq.html",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "name": "SNIP-Seq",
    "owner": "seqwiki_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Next-generation sequencing technologies have made it possible to sequence targeted regions of the human genome in hundreds of individuals. Deep sequencing represents a powerful approach for the discovery of the complete spectrum of DNA sequence variants in functionally important genomic intervals. Current methods for single nucleotide polymorphism (SNP) detection are designed to detect SNPs from single individual sequence data sets. Here, we describe a novel method SNIP-Seq (single nucleotide polymorphism identification from population sequence data) that leverages sequence data from a population of individuals to detect SNPs and assign genotypes to individuals. To evaluate our method, we utilized sequence data from a 200-kilobase (kb) region on chromosome 9p21 of the human genome. This region was sequenced in 48 individuals (five sequenced in duplicate) using the Illumina GA platform. Using this data set, we demonstrate that our method is highly accurate for detecting variants and can filter out false SNPs that are attributable to sequencing errors. The concordance of sequencing-based genotype assignments between duplicate samples was 98.8%. The 200-kb region was independently sequenced to a high depth of coverage using two sequence pools containing the 48 individuals. Many of the novel SNPs identified by SNIP-Seq from the individual sequencing were validated by the pooled sequencing data and were subsequently confirmed by Sanger sequencing. We estimate that SNIP-Seq achieves a low false-positive rate of ∼2%, improving upon the higher false-positive rate for existing methods that do not utilize population sequence data. Collectively, these results suggest that analysis of population sequencing data is a powerful approach for the accurate detection of SNPs and the assignment of genotypes to individual samples. © 2010 by Cold Spring Harbor Laboratory Press.",
                "authors": [
                    {
                        "name": "Bansal V."
                    },
                    {
                        "name": "Frazer K.A."
                    },
                    {
                        "name": "Harismendy O."
                    },
                    {
                        "name": "Murray S.S."
                    },
                    {
                        "name": "Schork N.J."
                    },
                    {
                        "name": "Tewhey R."
                    },
                    {
                        "name": "Topol E.J."
                    }
                ],
                "citationCount": 78,
                "date": "2010-04-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "Accurate detection and genotyping of SNPs utilizing population sequencing data"
            },
            "pmid": "20150320"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
