{
    "additionDate": "2021-06-14T12:31:20Z",
    "biotoolsCURIE": "biotools:binnacle",
    "biotoolsID": "binnacle",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hsmurali@cs.umd.edu",
            "name": "Harihara Muralidharan",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "email": "mpop@umd.edu",
            "name": "Mihai Pop",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "nidhi@cs.umd.edu",
            "name": "Nidhi Shah",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        }
    ],
    "description": "Binnacle estimates coverage for graph scaffolds and integrates with existing metagenome binning tools. Binnacle accurately computes coverage of graph scaffolds and seamlessly integrates with leading binning methods such as MetaBAT2, MaxBin 2.0, and CONCOCT. Using graph scaffolds, as opposed to contigs (most common approach) for binning improves the contiguity and quality of metagenomic bins and can captures a broader set of the accessory elements of the reconstructed genomes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Backbone modelling",
                    "uri": "http://edamontology.org/operation_0479"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Mapping assembly",
                    "uri": "http://edamontology.org/operation_0523"
                },
                {
                    "term": "Read binning",
                    "uri": "http://edamontology.org/operation_3798"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "homepage": "https://github.com/marbl/binnacle",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-08-13T10:34:48Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/marbl/binnacle/issues"
        }
    ],
    "name": "Binnacle",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3389/FMICB.2021.638561",
            "metadata": {
                "abstract": "© Copyright © 2021 Muralidharan, Shah, Meisel and Pop.High-throughput sequencing has revolutionized the field of microbiology, however, reconstructing complete genomes of organisms from whole metagenomic shotgun sequencing data remains a challenge. Recovered genomes are often highly fragmented, due to uneven abundances of organisms, repeats within and across genomes, sequencing errors, and strain-level variation. To address the fragmented nature of metagenomic assemblies, scientists rely on a process called binning, which clusters together contigs inferred to originate from the same organism. Existing binning algorithms use oligonucleotide frequencies and contig abundance (coverage) within and across samples to group together contigs from the same organism. However, these algorithms often miss short contigs and contigs from regions with unusual coverage or DNA composition characteristics, such as mobile elements. Here, we propose that information from assembly graphs can assist current strategies for metagenomic binning. We use MetaCarvel, a metagenomic scaffolding tool, to construct assembly graphs where contigs are nodes and edges are inferred based on paired-end reads. We developed a tool, Binnacle, that extracts information from the assembly graphs and clusters scaffolds into comprehensive bins. Binnacle also provides wrapper scripts to integrate with existing binning methods. The Binnacle pipeline can be found on GitHub (https://github.com/marbl/binnacle). We show that binning graph-based scaffolds, rather than contigs, improves the contiguity and quality of the resulting bins, and captures a broader set of the genes of the organisms being reconstructed.",
                "authors": [
                    {
                        "name": "Meisel J.S."
                    },
                    {
                        "name": "Muralidharan H.S."
                    },
                    {
                        "name": "Pop M."
                    },
                    {
                        "name": "Shah N."
                    }
                ],
                "date": "2021-02-24T00:00:00Z",
                "journal": "Frontiers in Microbiology",
                "title": "Binnacle: Using Scaffolds to Improve the Contiguity and Quality of Metagenomic Bins"
            },
            "pmcid": "PMC7945042",
            "pmid": "33717033",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Metagenomic sequencing",
            "uri": "http://edamontology.org/topic_3837"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ]
}
