{
    "additionDate": "2019-11-14T18:09:49Z",
    "biotoolsCURIE": "biotools:ncRNA-eQTL",
    "biotoolsID": "ncRNA-eQTL",
    "confidence_flag": "tool",
    "description": "A database to systematically evaluate the effects of SNPs on non-coding RNA expression across cancer types | Numerous studies indicate that ncRNAs have critical functions across biological processes, and single nucleotide polymorphisms (SNPs) could contribute to diseases or traits through influencing ncRNA expression",
    "documentation": [
        {
            "type": [
                "Terms of use"
            ],
            "url": "http://creativecommons.org/licenses/by-nc/4.0/"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression QTL analysis",
                    "uri": "http://edamontology.org/operation_3232"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                }
            ]
        }
    ],
    "homepage": "http://ibi.hzau.edu.cn/ncRNA-eQTL",
    "lastUpdate": "2024-11-24T20:50:59.407798Z",
    "name": "ncRNA-eQTL",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/nar/gkz711",
            "metadata": {
                "abstract": "Numerous studies indicate that non-coding RNAs (ncRNAs) have critical functions across biological processes, and single-nucleotide polymorphisms (SNPs) could contribute to diseases or traits through influencing ncRNA expression. However, the associations between SNPs and ncRNA expression are largely unknown. Therefore, genome-wide expression quantitative trait loci (eQTL) analysis to assess the effects of SNPs on ncRNA expression, especially in multiple cancer types, will help to understand how risk alleles contribute toward tumorigenesis and cancer development. Using genotype data and expression profiles of ncRNAs of >8700 samples from The Cancer Genome Atlas (TCGA), we developed a computational pipeline to systematically identify ncRNA-related eQTLs (ncRNA-eQTLs) across 33 cancer types. We identified a total of 6 133 278 and 721 122 eQTL-ncRNA pairs in cis-eQTL and trans-eQTL analyses, respectively. Further survival analyses identified 8312 eQTLs associated with patient survival times. Furthermore, we linked ncRNA-eQTLs to genome-wide association study (GWAS) data and found 262 332 ncRNA-eQTLs overlapping with known disease- A nd trait-associated loci. Finally, a user-friendly database, ncRNA-eQTL (http://ibi.hzau.edu.cn/ncRNA-eQTL), was developed for free searching, browsing and downloading of all ncRNA-eQTLs. We anticipate that such an integrative and comprehensive resource will improve our understanding of the mechanistic basis of human complex phenotypic variation, especially for ncRNA- A nd cancer-related studies.",
                "authors": [
                    {
                        "name": "Amin M.T."
                    },
                    {
                        "name": "Gong J."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Niu X."
                    },
                    {
                        "name": "Xue Y."
                    },
                    {
                        "name": "Yang J."
                    },
                    {
                        "name": "Yang W."
                    },
                    {
                        "name": "Yang Y."
                    },
                    {
                        "name": "Zhang H.-Y."
                    },
                    {
                        "name": "Zhang W."
                    }
                ],
                "citationCount": 45,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "NcRNA-eQTL: A database to systematically evaluate the effects of SNPs on non-coding RNA expression across cancer types"
            },
            "pmcid": "PMC6943077",
            "pmid": "31410488"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
