{
    "additionDate": "2019-11-14T18:47:30Z",
    "biotoolsCURIE": "biotools:methane_emissions_high-emitting_paddies",
    "biotoolsID": "methane_emissions_high-emitting_paddies",
    "confidence_flag": "very low",
    "credit": [
        {
            "email": "oda.masato@affrc.go.jp",
            "name": "Masato Oda",
            "orcidid": "https://orcid.org/0000-0001-7241-5238",
            "typeEntity": "Person"
        }
    ],
    "description": "> VERY_LOW CONFIDENCE! | > HOMEPAGE MISSING! | > CORRECT NAME OF TOOL COULD ALSO BE 'suppressing methane emissions high-emitting paddies', 'emissions high-emitting paddies', 'high-emitting paddies', 'methane emissions high-emitting' | Rice plants reduce methane emissions in high-emitting paddies | Background: Rice is understood to enhance methane emissions from paddy fields in IPCC guidelines. However, rice actually has two opposite functions related to methane: i) emission enhancement, such as by providing emission pathways (aerenchyma) and methanogenetic substrates; and ii) emission suppression by providing oxygen pathways, which suppress methanogenesis or enhance methane oxidation. The overall role of rice is thus determined by the balance between its enhancing and suppressing functions",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31372208",
    "lastUpdate": "2019-11-14T18:47:30Z",
    "name": "methane emissions high-emitting paddies",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.12688/F1000RESEARCH.15859.3",
            "metadata": {
                "abstract": "© 2019 Oda M and Chiem NH.Background: Rice is understood to enhance methane emissions from paddy fields in IPCC guidelines. However, rice actually has two opposite functions related to methane: i) emission enhancement, such as by providing emission pathways (aerenchyma) and methanogenetic substrates; and ii) emission suppression by providing oxygen pathways, which suppress methanogenesis or enhance methane oxidation. The overall role of rice is thus determined by the balance between its enhancing and suppressing functions. Although previous studies have suggested that rice enhances total methane emissions, we aimed to demonstrate in high-emitting paddy fields that the overall methane emission is decreased by rice plants. Methods: We compared methane emissions with and without rice plants in triple cropping rice paddy fields in the Mekong Delta, Vietnam. The gas samples are collected using chamber method and ware analyzed by gas chromatography. Results: We found that rice, in fact, suppressed overall methane emissions in high-emitting paddies. The emission reductions increased with the growth of rice to the maximum tillering stage, then decreased after the heading stage, and finally recovered. Discussion: Our result indicates that the overall methane emission is larger than that of rice planted area. In addition, although many studies in standard-emitting paddies have found that the contribution of soil organic matter to methanogenesis is small, prior studies in high-emitting paddies suggest that methanogenesis depended mainly on soil organic matter accumulated from past crops. The higher the methane emission level, the lower the contribution of the rice-derived substrate; conversely, the higher the contribution of the rice providing oxygen. Finally, rice plants reduce methane emissions in high-emitting paddies. Conclusion: The present study demonstrates that during the growing season, rice is suppressing methane emissions in high-emitting paddies. This means the significance of using the rice variety which has high suppressing performance in high-emitting paddies.",
                "authors": [
                    {
                        "name": "Oda M."
                    },
                    {
                        "name": "Chiem N.H."
                    }
                ],
                "citationCount": 1,
                "date": "2019-01-01T00:00:00Z",
                "journal": "F1000Research",
                "title": "Rice plants reduce methane emissions in high-emitting paddies [version 3; peer review: 2 approved, 1 approved with reservations]"
            },
            "pmcid": "PMC6659764",
            "pmid": "31372208"
        }
    ],
    "topic": [
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}