{
    "additionDate": "2017-12-18T00:04:40Z",
    "biotoolsCURIE": "biotools:clcl",
    "biotoolsID": "clcl",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://genome.ucf.edu/"
        }
    ],
    "description": "CLCL is a software for discovering non-coding RNA elements in fly’s 3’UTRs by structural clustering",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "http://genome.ucf.edu/fly3UTRcluster/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/clcl-1-0-clique-clustering.html"
        }
    ],
    "name": "CLCL",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1109/ICCABS.2012.6182650",
            "metadata": {
                "abstract": "The non-coding RNA (ncRNA) elements in the 3′ untranslated regions (3′-UTRs) are known to participate in the genes' post-transcriptional regulation, such as their stability, translation efficiency, and subcellular localization. Inferring co-expression patterns of the genes by clustering their 3′-UTR ncRNA elements will provide invaluable knowledge for further studies of their functionalities and interactions under specific physiological processes. In this work, we propose an improved RNA structural clustering pipeline that takes into account the length-dependent distribution of the structural similarity measure. Benchmark of the proposed pipeline on Rfam data clearly demonstrates over 10% performance gain, compared to a traditional hierarchical clustering pipeline. By applying the proposed clustering pipeline to Drosophila melanogaster's 3′-UTRs, we have successfully identified 184 ncRNA clusters, of which 91.3% appear to be true RNA structural elements, based on RNAz's prediction. Among the clusters we have rediscovered the well-known histone ncRNA family as well as a number of other families whose potential functionalities may be inferred from existing studies. One of such families contains genes that are preferentially expressed in male Drosophila. In situ hybridization further reveals their characteristic 'cup' or 'comet' localization patterns in Drosophila testis. The complete clustering results are available at http://genome.ucf.edu/fly3UTRcluster. © 2012 IEEE.",
                "authors": [
                    {
                        "name": "Andrews J."
                    },
                    {
                        "name": "Zhang S."
                    },
                    {
                        "name": "Zhong C."
                    }
                ],
                "citationCount": 3,
                "date": "2012-05-08T00:00:00Z",
                "journal": "2012 IEEE 2nd International Conference on Computational Advances in Bio and Medical Sciences, ICCABS 2012",
                "title": "Discovering non-coding RNA elements in drosophila 3′ untranslated regions"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Coding RNA",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}
