{
    "additionDate": "2024-02-20T14:10:34.381759Z",
    "biotoolsCURIE": "biotools:labgym",
    "biotoolsID": "labgym",
    "description": "Quantifying user-defined behaviors",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://labgym.readthedocs.io/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/umyelab/LabGym",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-02-20T14:10:34.384222Z",
    "name": "LabGym",
    "owner": "nadgoue",
    "publication": [
        {
            "doi": "10.1016/j.crmeth.2023.100415",
            "metadata": {
                "abstract": "Quantifying animal behavior is important for biological research. Identifying behaviors is the prerequisite of quantifying them. Current computational tools for behavioral quantification typically use high-level properties such as body poses to identify the behaviors, which constrains the information available for a holistic assessment. Here we report LabGym, an open-source computational tool for quantifying animal behaviors without this constraint. In LabGym, we introduce “pattern image” to represent the animal's motion pattern, in addition to “animation” that shows all spatiotemporal details of a behavior. These two pieces of information are assessed holistically by customizable deep neural networks for accurate behavior identifications. The quantitative measurements of each behavior are then calculated. LabGym is applicable for experiments involving multiple animals, requires little programming knowledge to use, and provides visualizations of behavioral datasets. We demonstrate its efficacy in capturing subtle behavioral changes in diverse animal species.",
                "authors": [
                    {
                        "name": "Ferrario C.R."
                    },
                    {
                        "name": "Ghimire A."
                    },
                    {
                        "name": "Hu Y."
                    },
                    {
                        "name": "Ionides R.B."
                    },
                    {
                        "name": "Iwasaki K."
                    },
                    {
                        "name": "Maitland A.D."
                    },
                    {
                        "name": "Watson B."
                    },
                    {
                        "name": "White H."
                    },
                    {
                        "name": "Xi Y."
                    },
                    {
                        "name": "Ye B."
                    },
                    {
                        "name": "Zhou J."
                    }
                ],
                "citationCount": 4,
                "date": "2023-03-27T00:00:00Z",
                "journal": "Cell Reports Methods",
                "title": "LabGym: Quantification of user-defined animal behaviors using learning-based holistic assessment"
            }
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        }
    ]
}
