{
    "additionDate": "2021-03-19T08:48:25Z",
    "biotoolsCURIE": "biotools:cepz",
    "biotoolsID": "cepz",
    "confidence_flag": "tool",
    "description": "CEPZ is a predictor for identifing DNase I hypersensitive sites.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/YanZheng-16/CEPZ_DHS/",
    "language": [
        "MATLAB",
        "Python"
    ],
    "lastUpdate": "2021-04-22T14:28:06Z",
    "name": "CEPZ",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1109/TCBB.2021.3053661",
            "metadata": {
                "abstract": "IEEEDNase I hypersensitive sites (DHSs) have proven to be tightly associated with cis-regulatory elements, commonly indicating specific function on the chromatin structure. Thus, identifying DHSs plays a fundamental role in decoding gene regulatory behavior. While traditional experimental methods turn to be time-consuming and expensive for genome-wide exploration, computational techniques promise to be a practical approach to discovering and analyzing regulatory factors. In this study, we applied an efficient model that could take care of both performance and speed. Our predictor, CEPZ, greatly improved a Matthews correlation coefficient and accuracy of 0.7740 and 0.9113 respectively, far more competitive than any predictor ever. This result suggests that it may become a useful tool for DHSs research in the human and other complex genomes. Our research was anchored on the properties of dinucleotides and we identified several dinucleotides with significant differences in the distribution of DHS and non-DHS samples, which are likely to have a special meaning in the chromatin structure. The datasets, feature sets and the relevant algorithm are available at https://github.com/YanZheng-16/CEPZ_DHS/.",
                "authors": [
                    {
                        "name": "Ding Y."
                    },
                    {
                        "name": "Guo F."
                    },
                    {
                        "name": "Wang H."
                    },
                    {
                        "name": "Zheng Y."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
                "title": "CEPZ: A Novel Predictor for Identification of DNase I Hypersensitive Sites"
            },
            "pmid": "33481716"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
