{
    "accessibility": "Open access",
    "additionDate": "2021-12-05T23:03:04.642210Z",
    "biotoolsCURIE": "biotools:ldacov",
    "biotoolsID": "ldacov",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "drvalle@ufl.edu",
            "name": "Denis Valle",
            "orcidid": "https://orcid.org/0000-0002-9830-8876",
            "typeEntity": "Person"
        },
        {
            "name": "Divino Vicente Silverio",
            "orcidid": "https://orcid.org/0000-0003-1642-9496"
        },
        {
            "name": "Leandro Maracahipes",
            "orcidid": "https://orcid.org/0000-0002-6148-3291"
        },
        {
            "name": "Paulo Brando",
            "orcidid": "https://orcid.org/0000-0001-8952-7025"
        }
    ],
    "description": "ldacov is an R package to estimate an LDA model with covariates using MCMC algorithms.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Ecological modelling",
                    "uri": "http://edamontology.org/operation_3946"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/gilsonshimizu/ldacov",
    "language": [
        "C++",
        "R"
    ],
    "lastUpdate": "2021-12-05T23:05:55.462125Z",
    "license": "Not licensed",
    "name": "LDAcov",
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1002/ECE3.7626",
            "metadata": {
                "abstract": "© 2021 The Authors. Ecology and Evolution published by John Wiley & Sons Ltd.Understanding and predicting the effect of global change phenomena on biodiversity is challenging given that biodiversity data are highly multivariate, containing information from tens to hundreds of species in any given location and time. The Latent Dirichlet Allocation (LDA) model has been recently proposed to decompose biodiversity data into latent communities. While LDA is a very useful exploratory tool and overcomes several limitations of earlier methods, it has limited inferential and predictive skill given that covariates cannot be included in the model. We introduce a modified LDA model (called LDAcov) which allows the incorporation of covariates, enabling inference on the drivers of change of latent communities, spatial interpolation of results, and prediction based on future environmental change scenarios. We show with simulated data that our approach to fitting LDAcov is able to estimate well the number of groups and all model parameters. We illustrate LDAcov using data from two experimental studies on the long-term effects of fire on southeastern Amazonian forests in Brazil. Our results reveal that repeated fires can have a strong impact on plant assemblages, particularly if fuel is allowed to build up between consecutive fires. The effect of fire is exacerbated as distance to the edge of the forest decreases, with small-sized species and species with thin bark being impacted the most. These results highlight the compounding impacts of multiple fire events and fragmentation, a scenario commonly found across the southern edge of Amazon. We believe that LDAcov will be of wide interest to scientists studying the effect of global change phenomena on biodiversity using high-dimensional datasets. Thus, we developed the R package LDAcov to enable the straightforward use of this model.",
                "authors": [
                    {
                        "name": "Brando P."
                    },
                    {
                        "name": "Izbicki R."
                    },
                    {
                        "name": "Jameel Y."
                    },
                    {
                        "name": "Maracahipes L."
                    },
                    {
                        "name": "Paolucci L.N."
                    },
                    {
                        "name": "Shimizu G."
                    },
                    {
                        "name": "Silverio D.V."
                    },
                    {
                        "name": "Valle D."
                    }
                ],
                "date": "2021-06-01T00:00:00Z",
                "journal": "Ecology and Evolution",
                "title": "The Latent Dirichlet Allocation model with covariates (LDAcov): A case study on the effect of fire on species composition in Amazonian forests"
            },
            "pmcid": "PMC8216892",
            "pmid": "34188865"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biodiversity",
            "uri": "http://edamontology.org/topic_3050"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
