{
    "additionDate": "2019-11-14T19:37:23Z",
    "biotoolsCURIE": "biotools:TideHunter",
    "biotoolsID": "TideHunter",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "bo.liu@hit.edu.cn",
            "name": "Bo Liu",
            "typeEntity": "Person"
        },
        {
            "email": "ydwang@hit.edu.cn",
            "name": "Yadong Wang",
            "typeEntity": "Person"
        },
        {
            "email": "XINGYI@email.chop.edu",
            "name": "Yi Xing",
            "typeEntity": "Person"
        }
    ],
    "description": "efficient and sensitive tandem repeat detection from noisy long-reads using seed-and-chain | TideHunter is an efficient and sensitive tandem repeat detection and consensus calling tool which is designed for tandemly repeated long-read sequence (INC-seq, R2C2, NanoAmpli-Seq)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Read binning",
                    "uri": "http://edamontology.org/operation_3798"
                },
                {
                    "term": "Sequencing error detection",
                    "uri": "http://edamontology.org/operation_3195"
                }
            ]
        }
    ],
    "homepage": "https://github.com/yangao07/TideHunter",
    "language": [
        "C++",
        "C"
    ],
    "lastUpdate": "2019-11-14T19:37:23Z",
    "license": "GPL-3.0",
    "name": "TideHunter",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ376",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Motivation: Pacific Biosciences (PacBio) and Oxford Nanopore Technologies (ONT) sequencing technologies can produce long-reads up to tens of kilobases, but with high error rates. In order to reduce sequencing error, Rolling Circle Amplification (RCA) has been used to improve library preparation by amplifying circularized template molecules. Linear products of the RCA contain multiple tandem copies of the template molecule. By integrating additional in silico processing steps, these tandem sequences can be collapsed into a consensus sequence with a higher accuracy than the original raw reads. Existing pipelines using alignment-based methods to discover the tandem repeat patterns from the long-reads are either inefficient or lack sensitivity. Results: We present a novel tandem repeat detection and consensus calling tool, TideHunter, to efficiently discover tandem repeat patterns and generate high-quality consensus sequences from amplified tandemly repeated long-read sequencing data. TideHunter works with noisy long-reads (PacBio and ONT) at error rates of up to 20% and does not have any limitation of the maximal repeat pattern size. We benchmarked TideHunter using simulated and real datasets with varying error rates and repeat pattern sizes. TideHunter is tens of times faster than state-of-the-art methods and has a higher sensitivity and accuracy.",
                "authors": [
                    {
                        "name": "Gao Y."
                    },
                    {
                        "name": "Liu B."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Xing Y."
                    }
                ],
                "citationCount": 1,
                "date": "2019-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "TideHunter: Efficient and sensitive tandem repeat detection from noisy long-reads using seed-and-chain"
            },
            "pmcid": "PMC6612900",
            "pmid": "31510677"
        }
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}