{
    "name": "ProbePlus", 
    "description": "ProbePlus is an analytical tool for analyzing Affymetrix GeneChip® Gene Expression Array data at probe level. It is able to extract CEL file; integrate Perfect Match (PM) and Mis-match (MM) for a probe pair; generate gene expression index (GEI) from the integrated probe intensities of multiple probe pairs in a probe set; and analyze data directly from probe level data without necessity of generating a GEI for a probe set.", 
    "homepage": "http://qge.fhcrc.org/probeplus/", 
    "biotoolsID": "probeplus", 
    "biotoolsCURIE": "biotools:probeplus", 
    "version": [
        "1.0"
    ], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2495", 
                    "term": "Microarray data analysis"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Desktop application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0203", 
            "term": "Gene expression"
        }
    ], 
    "operatingSystem": [
        "Windows"
    ], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/probeplus-1-0-analytic-tool-analyzing-affymetrix-genechip-gene-expression-array-data.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://qge.fhcrc.org/probeplus/doc/", 
            "type": "General", 
            "note": null
        }, 
        {
            "url": "http://qge.fhcrc.org/probeplus/readmewin.txt", 
            "type": "Manual", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1186/1471-2164-6-16", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "A class of models for analyzing GeneChip® gene expression analysis array data", 
                "abstract": "Background: Various analytical methods exist that first quantify gene expression and then analyze differentially expressed genes from Affymetrix GeneChipr gene expression analysis array data. These methods differ in the choice of probe measure (quantification of probe hybridization), summarizing multiple probe intensities into a gene expression value, and analysis of differential gene expression. Research papers that describe these methods focus on performance, and how their approaches differ from others. To better understand the common features and differences between various methods, and to evaluate their impact on the results of gene expression analysis, we describe a class of models, referred to as generalized probe models (GPMs), which encompass various currently available methods. Results: Using an empirical dataset, we compared different formulations of GPMs, and GPMs with three other commonly used methods, i.e. MAS 5.0, dChip, and RMA. The comparison shows that, on a genome-wide scale , different methods yield similar results if the same probe measures are chosen. Conclusion: In this paper we present a general framework, i.e. GPMs, which encompasses various methods. GPMs permit the use of a wide range of probe measures and facilitate appropriate comparison between commonly used methods. We demonstrate that the dissimilar results stem primarily from different choice of probe measures, rather than other factors. © 2005 Fan et al; licensee BioMed Central Ltd.", 
                "date": "2005-02-14T00:00:00Z", 
                "citationCount": 7, 
                "authors": [
                    {
                        "name": "Fan W."
                    }, 
                    {
                        "name": "Pritchard J.I."
                    }, 
                    {
                        "name": "Olson J.M."
                    }, 
                    {
                        "name": "Khalid N."
                    }, 
                    {
                        "name": "Zhao L.P."
                    }
                ], 
                "journal": "BMC Genomics"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": null, 
            "url": "http://qge.fhcrc.org/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-12-18T00:11:14Z", 
    "lastUpdate": "2018-12-10T12:58:58Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}