{
    "additionDate": "2018-07-31T15:12:08Z",
    "biotoolsCURIE": "biotools:gemoma",
    "biotoolsID": "gemoma",
    "credit": [
        {
            "email": "jens.keilwagen@julius-kuehn.de",
            "name": "Jens Keilwagen",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Gene Model Mapper is a homology-based gene prediction program. GeMoMa uses the annotation of protein-coding genes in a reference genome to infer the annotation of protein-coding genes in a target genome. Thereby, it utilizes amino acid sequence and intron position conservation. In addition, it allows to incorporate RNA-seq evidence for splice site prediction.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.jstacs.de/index.php/File:GeMoMa-manual.pdf"
        }
    ],
    "download": [
        {
            "type": "Software package",
            "url": "http://www.jstacs.de/download.php?which=GeMoMa"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                }
            ]
        }
    ],
    "homepage": "http://www.jstacs.de/index.php/GeMoMa",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://galaxy.informatik.uni-halle.de/"
        }
    ],
    "name": "GeMoMa",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "shadi.m",
    "publication": [
        {
            "doi": "10.1186/s12859-018-2203-5",
            "metadata": {
                "abstract": "© 2018 The Author(s).Background: Genome annotation is of key importance in many research questions. The identification of protein-coding genes is often based on transcriptome sequencing data, ab-initio or homology-based prediction. Recently, it was demonstrated that intron position conservation improves homology-based gene prediction, and that experimental data improves ab-initio gene prediction. Results: Here, we present an extension of the gene prediction program GeMoMa that utilizes amino acid sequence conservation, intron position conservation and optionally RNA-seq data for homology-based gene prediction. We show on published benchmark data for plants, animals and fungi that GeMoMa performs better than the gene prediction programs BRAKER1, MAKER2, and CodingQuarry, and purely RNA-seq-based pipelines for transcript identification. In addition, we demonstrate that using multiple reference organisms may help to further improve the performance of GeMoMa. Finally, we apply GeMoMa to four nematode species and to the recently published barley reference genome indicating that current annotations of protein-coding genes may be refined using GeMoMa predictions. Conclusions: GeMoMa might be of great utility for annotating newly sequenced genomes but also for finding homologs of a specific gene or gene family. GeMoMa has been published under GNU GPL3 and is freely available at http://www.jstacs.de/index.php/GeMoMa.",
                "authors": [
                    {
                        "name": "Keilwagen J."
                    },
                    {
                        "name": "Hartung F."
                    },
                    {
                        "name": "Paulini M."
                    },
                    {
                        "name": "Twardziok S.O."
                    },
                    {
                        "name": "Grau J."
                    }
                ],
                "citationCount": 27,
                "date": "2018-05-30T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Combining RNA-seq data and homology-based gene prediction for plants, animals and fungi"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Homology modeling",
            "uri": "http://edamontology.org/topic_2275"
        }
    ],
    "validated": 1
}