{
    "additionDate": "2021-01-18T08:42:16Z",
    "biotoolsCURIE": "biotools:imarmot",
    "biotoolsID": "imarmot",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "liuenqi@xjtu.edu.cn",
            "name": "Enqi Liu",
            "typeEntity": "Person"
        }
    ],
    "description": "An integrative platform for comparative and functional genomics of marmots.\n\niMarmot: an integrative Marmot database.\n\nMarmots are large Holarctic rodents in the genus Marmota with 14 living species. Most marmot species occupy a harsh environment characterized by a long, cold season without food. Their physiology is highly adapted to cope with this condition by hibernating in burrows. Global warming since the last ice age has reduced the geographic distribution of some of the marmots. The plagues in some marmots are known to co-occur with human epidemics in the same area, which give rise to a unique surveillance and a major public health concern. MarmotDB database aims to collect the currently available marmots’ genomic data and to characterize the molecular mechanism of hibernating and plague infection by comparisons of the expression profiles from different hibernators and plague hosts or transmitters.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://www.marmotdb.org/",
    "lastUpdate": "2021-02-03T08:07:51Z",
    "name": "iMarmot",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12864-020-6697-7",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Marmots are large Holarctic rodents with unique biological features, making them potential animal models in various research fields. Due to the rapid accumulation of the genetic data in marmots, a highly integrative database is urgent needed. Description: iMarmot is freely available on the web at http://www.marmotdb.org/and currently contains the biological information of 14 marmots, genomic sequence of 6 marmots, syntenic relationship and orthologs among 3 marmots, and expression profiles of several hibernators and plague hosts. To assist with the genomic and transcriptomic analysis, we also integrated a set of analysis and visualization tools, such as KEGG or GO enrichment analysis, PCA, Blast, Muscle, GeneWise, Lastz, and JBrowse. Particularly, one DEGs (differentially expressed genes) module has been implemented in this database to visualize the gene expression changes in hibernators and plague hosts. Conclusion: This database will provide comprehensive information and analysis platform for researchers interested in understanding the biological features of marmots.",
                "authors": [
                    {
                        "name": "Liu B."
                    },
                    {
                        "name": "Bai L."
                    },
                    {
                        "name": "Yu Q."
                    },
                    {
                        "name": "Hu F."
                    },
                    {
                        "name": "Wu J."
                    },
                    {
                        "name": "Zhao S."
                    },
                    {
                        "name": "Wang R."
                    },
                    {
                        "name": "Wang W."
                    },
                    {
                        "name": "Tao Y."
                    },
                    {
                        "name": "Fan J."
                    },
                    {
                        "name": "Liu E."
                    }
                ],
                "date": "2020-03-30T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "IMarmot: An integrative platform for comparative and functional genomics of marmots"
            },
            "pmcid": "PMC7104516",
            "pmid": "32228437"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ]
}