{
    "accessibility": "Open access",
    "additionDate": "2016-02-16T15:02:15Z",
    "biotoolsCURIE": "biotools:meltdb",
    "biotoolsID": "meltdb",
    "collectionID": [
        "de.NBI",
        "de.NBI-BiGi"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "email": "meltdb-service@cebitec.uni-bielefeld.de",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "Bielefeld University",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "name": "CeBiTec",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "name": "bigi",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.cebitec.uni-bielefeld.de/brf/"
        }
    ],
    "description": "Open source framework providing analysis methods for raw GC- and LC-MS metabolome datasets and offers methods to combine the respective results. Flexible tool pipelines allow both the import of pre-processed data as well as the integration of existing open source analysis packages such as XCMS, MassSpecWavelet or metaB. For the identification of metabolites based on mass spectra either the GMD database or user defined libraries in NIST are queried.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://wiki.cebitec.uni-bielefeld.de/brf-software/index.php/MeltDBWiki"
        }
    ],
    "editPermission": {
        "authors": [
            "pr839",
            "zhugepengju"
        ],
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Mass spectrometry data",
                        "uri": "http://edamontology.org/data_2536"
                    },
                    "format": [
                        {
                            "term": "Mass spectrometry data format",
                            "uri": "http://edamontology.org/format_3245"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Chromatogram visualisation",
                    "uri": "http://edamontology.org/operation_3203"
                },
                {
                    "term": "Peak detection",
                    "uri": "http://edamontology.org/operation_3215"
                },
                {
                    "term": "Spectral analysis",
                    "uri": "http://edamontology.org/operation_3214"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "http://meltdb.cebitec.uni-bielefeld.de",
    "language": [
        "Java",
        "Perl"
    ],
    "lastUpdate": "2024-11-25T13:48:21.896389Z",
    "license": "GPL-2.0",
    "maturity": "Mature",
    "name": "MeltDB",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "bigi",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btn452",
            "metadata": {
                "abstract": "Motivation: The recent advances in metabolomics have created the potential to measure the levels of hundreds of metabolites which are the end products of cellular regulatory processes. The automation of the sample acquisition and subsequent analysis in high-throughput instruments that are capable of measuring metabolites is posing a challenge on the necessary systematic storage and computational processing of the experimental datasets. Whereas a multitude of specialized software systems for individual instruments and preprocessing methods exists, there is clearly a need for a free and platform-independent system that allows the standardized and integrated storage and analysis of data obtained from metabolomics experiments. Currently there exists no such system that on the one hand supports preprocessing of raw datasets but also allows to visualize and integrate the results of higher level statistical analyses within a functional genomics context. Results: To facilitate the systematic storage, analysis and integration of metabolomics experiments, we have implemented MeltDB, a web-based software platform for the analysis and annotation of datasets from metabolomics experiments. MeltDB supports open file formats (netCDF, mzXML, mzDATA) and facilitates the integration and evaluation of existing preprocessing methods. The system provides researchers with means to consistently describe and store their experimental datasets. Comprehensive analysis and visualization features of metabolomics datasets are offered to the community through a web-based user interface. The system covers the process from raw data to the visualization of results in a knowledge-based background and is integrated into the context of existing software platforms of genomics and transcriptomics at Bielefeld University. We demonstrate the potential of MeltDB by means of a sample experiment where we dissect the influence of three different carbon sources on the gram-negative bacterium Xanthomonas campestris pv. campestris on the level of measured metabolites. Experimental data are stored, analyzed and annotated within MeltDB and accessible via the public MeltDB web server. © The Author 2008. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Albaum S.P."
                    },
                    {
                        "name": "Dondrup M."
                    },
                    {
                        "name": "Goesmann A."
                    },
                    {
                        "name": "Neuweger H."
                    },
                    {
                        "name": "Niehaus K."
                    },
                    {
                        "name": "Persicke M."
                    },
                    {
                        "name": "Stoye J."
                    },
                    {
                        "name": "Watt T."
                    }
                ],
                "citationCount": 89,
                "date": "2008-12-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "MeltDB: A software platform for the analysis and integration of metabolomics experiment data"
            },
            "pmid": "18765459",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        }
    ],
    "validated": 1,
    "version": [
        "2.0"
    ]
}
