{
    "additionDate": "2019-11-14T18:36:52Z",
    "biotoolsCURIE": "biotools:Litkey_Corpus",
    "biotoolsID": "Litkey_Corpus",
    "confidence_flag": "low",
    "description": "> LOW CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'ANNIS', 'corpus' | A richly annotated longitudinal corpus of German texts written by primary school children | Welcome to the Litkey Corpus, a longitudinal corpus of picture story descriptions produced by German primary school children from grades 2 to 4. Litkey is short for “Literacy as the key to social participation: Psycholinguistic perspectives on orthography instruction and literacy acquisition” and refers to the research project in which the corpus was created. Here you can find a general description of the aims of the project and the four project strands that are involved. In the strand Corpus Analysis, we investigate the relationship between spelling errors of beginning writers and the orthographic properties of words based on the Litkey Corpus. You can find out more about the strand Corpus Analysis here",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.linguistics.rub.de/litkeycorpus/",
    "lastUpdate": "2019-11-14T18:36:52Z",
    "name": "Litkey Corpus",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3758/S13428-019-01261-X",
            "metadata": {
                "abstract": "© 2019, The Psychonomic Society, Inc.Compared to early language development, later changes to the language system during orthography and literacy acquisition have not yet been researched in detail. We present a longitudinal corpus of texts on short picture stories written by German primary school children between grades 2 and 4 and grades 3 and 4. It includes 1,922 texts with 212,505 tokens (6,364 types) from 251 children. For each text, rich metadata is available, including age, grade and linguistic background (at least 60% of the children were multilingual). To our knowledge, our corpus is the largest longitudinal corpus of written texts by children at primary school age. Each word is included in its original spelling as well as in a normalized form (target hypothesis), specifying the intended word form, which we corrected for orthographic but not grammatical errors. Original and target word forms are aligned character-wise and the target word forms are enriched with phonological, syllabic, and morphological information. Additionally, for each target word form, we established key lexical variables, e.g., word frequency or summed bigram frequency, as specified in childLex. Where applicable, we also specify key features of German orthography (e.g., consonant doubling, vowel-lengthening <h>). Taken together, this information allows for a detailed assessment of the properties of words that tend to increase the likelihood of spelling errors. The corpus is available in different formats—as tab-delimited annotated token and type based lists, in an XML format, and via the corpus search tool ANNIS.",
                "authors": [
                    {
                        "name": "Laarmann-Quante R."
                    },
                    {
                        "name": "Ortmann K."
                    },
                    {
                        "name": "Ehlert A."
                    },
                    {
                        "name": "Masloch S."
                    },
                    {
                        "name": "Scholz D."
                    },
                    {
                        "name": "Belke E."
                    },
                    {
                        "name": "Dipper S."
                    }
                ],
                "date": "2019-08-15T00:00:00Z",
                "journal": "Behavior Research Methods",
                "title": "The Litkey Corpus: A richly annotated longitudinal corpus of German texts written by primary school children"
            },
            "pmid": "31376074"
        }
    ],
    "topic": [
        {
            "term": "Geriatric medicine",
            "uri": "http://edamontology.org/topic_3399"
        },
        {
            "term": "Paediatrics",
            "uri": "http://edamontology.org/topic_3418"
        }
    ]
}