{
    "additionDate": "2017-01-13T13:15:23Z",
    "biotoolsCURIE": "biotools:methpipe",
    "biotoolsID": "methpipe",
    "credit": [
        {
            "email": "methpipe@googlegroups.com",
            "name": "MethPipe Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The MethPipe software package is a computational pipeline for analyzing bisulfite sequencing data (BS-seq, WGBS and RRBS). MethPipe provides tools for mapping bisulfite sequencing read and estimating methylation levels at individual cytosine sites. Additionally, MethPipe includes tools for identifying higher-level methylation features, such as hypo-methylated regions (HMR), partially methylated domains (PMD), hyper-methylated regions (HyperMR), and allele-specific methylated regions (AMR).",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://smithlabresearch.org/downloads/methpipe-manual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Bisulfite mapping",
                    "uri": "http://edamontology.org/operation_3186"
                }
            ]
        }
    ],
    "homepage": "http://smithlabresearch.org/software/methpipe/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "Methpipe",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "metadata": {
                "abstract": "DNA methylation is implicated in a surprising diversity of regulatory, evolutionary processes and diseases in eukaryotes. The introduction of whole-genome bisulfite sequencing has enabled the study of DNA methylation at a single-base resolution, revealing many new aspects of DNA methylation and highlighting the usefulness of methylome data in understanding a variety of genomic phenomena. As the number of publicly available whole-genome bisulfite sequencing studies reaches into the hundreds, reliable and convenient tools for comparing and analyzing methylomes become increasingly important. We present MethPipe, a pipeline for both low and high-level methylome analysis, and MethBase, an accompanying database of annotated methylomes from the public domain. Together these resources enable researchers to extract interesting features from methylomes and compare them with those identified in public methylomes in our database. © 2013 Song et al.",
                "authors": [
                    {
                        "name": "Song Q."
                    },
                    {
                        "name": "Decato B."
                    },
                    {
                        "name": "Hong E.E."
                    },
                    {
                        "name": "Zhou M."
                    },
                    {
                        "name": "Fang F."
                    },
                    {
                        "name": "Qu J."
                    },
                    {
                        "name": "Garvin T."
                    },
                    {
                        "name": "Kessler M."
                    },
                    {
                        "name": "Zhou J."
                    },
                    {
                        "name": "Smith A.D."
                    }
                ],
                "citationCount": 96,
                "date": "2013-12-06T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "A reference methylome database and analysis pipeline to facilitate integrative and comparative epigenomics"
            },
            "pmid": "24324667"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}