{
    "accessibility": "Open access",
    "additionDate": "2022-07-29T21:57:00.400678Z",
    "biotoolsCURIE": "biotools:frdsm",
    "biotoolsID": "frdsm",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Chun-Hou Zheng"
        },
        {
            "name": "Huadong Wang"
        },
        {
            "name": "Jianhui Sun"
        },
        {
            "name": "Junfeng Xia"
        },
        {
            "name": "Mengya Liu"
        },
        {
            "name": "Na Cheng"
        }
    ],
    "description": "An ensemble predictor with effective feature representation for deleterious synonymous mutation in human genome.",
    "download": [
        {
            "type": "Downloads page",
            "url": "http://frdsm.xialab.info/download"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Mutation ID",
                        "uri": "http://edamontology.org/data_2209"
                    },
                    "format": [
                        {
                            "term": "VCF",
                            "uri": "http://edamontology.org/format_3016"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Sequence feature detection",
                    "uri": "http://edamontology.org/operation_0253"
                },
                {
                    "term": "Splice site prediction",
                    "uri": "http://edamontology.org/operation_0433"
                }
            ]
        }
    ],
    "homepage": "http://frdsm.xialab.info",
    "lastUpdate": "2022-07-29T21:57:00.403490Z",
    "name": "frDSM",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1109/TCBB.2022.3167468",
            "metadata": {
                "abstract": "IEEEWith the discovery of causality between synonymous mutations and diseases, it has become increasingly important to identify deleterious synonymous mutations for better understanding of their functional mechanisms. Although several machine learning methods have been proposed to solve the task,an effective feature representation method that can make use of the inner difference and relevance between deleterious and benign synonymous mutations is still challenging considering the vast number of synonymous mutations in human genome. In this work, we developed a robust and accurate predictor called frDSM for deleterious synonymous mutation prediction using logistic regression. More specifically, we introduced an effective feature representation learning method which exploits multiple feature descriptors from different perspectives including functional scores obtained from previously computational methods, evolutionary conservation, splicing and sequence feature descriptors, and these features descriptors were input into the 76 XGBoost classifiers to obtain the predictive probabilities values. These probabilities were concatenated to generate the 76-dimension new feature vector, and feature selection method was used to remove redundant and irrelevant features. Experimental results show that frDSM enables robust and accurate prediction than the competing prediction methods with 31 optimal features, which demonstrated the effectiveness of the feature representation learning method. frDSM is freely available at http://frdsm.xialab.info.",
                "authors": [
                    {
                        "name": "Cheng N."
                    },
                    {
                        "name": "Liu M."
                    },
                    {
                        "name": "Sun J."
                    },
                    {
                        "name": "Wang H."
                    },
                    {
                        "name": "Xia J."
                    },
                    {
                        "name": "Zheng C."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
                "title": "frDSM: an ensemble predictor with effective feature representation for deleterious synonymous mutation in human genome"
            },
            "pmid": "35420988"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}
