{
    "additionDate": "2020-01-14T19:41:48Z",
    "biotoolsCURIE": "biotools:PheGWAS",
    "biotoolsID": "PheGWAS",
    "confidence_flag": "tool",
    "description": "PheGWAS is a three-dimensional approach to dynamically visualize GWAS across multiple phenotypes. It does interactive 3D visualization on many variants many phenotypes",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/georgeg0/PheGWAS",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-09T13:15:43Z",
    "name": "PheGWAS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ944",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2019. Published by Oxford University Press.Motivation: PheGWAS was developed to enhance exploration of phenome-wide pleiotropy at the genome-wide level through the efficient generation of a dynamic visualization combining Manhattan plots from GWAS with PheWAS to create a 3D 'landscape'. Pleiotropy in sub-surface GWAS significance strata can be explored in a sectional view plotted within user defined levels. Further complexity reduction is achieved by confining to a single chromosomal section. Comprehensive genomic and phenomic coordinates can be displayed. Results: PheGWAS is demonstrated using summary data from Global Lipids Genetics Consortium GWAS across multiple lipid traits. For single and multiple traits PheGWAS highlighted all 88 and 69 loci, respectively. Further, the genes and SNPs reported in Global Lipids Genetics Consortium were identified using additional functions implemented within PheGWAS. Not only is PheGWAS capable of identifying independent signals but also provides insights to local genetic correlation (verified using HESS) and in identifying the potential regions that share causal variants across phenotypes (verified using colocalization tests).",
                "authors": [
                    {
                        "name": "Appleby P."
                    },
                    {
                        "name": "Doney A.S.F."
                    },
                    {
                        "name": "Gan S."
                    },
                    {
                        "name": "George G."
                    },
                    {
                        "name": "Huang Y."
                    },
                    {
                        "name": "Mohan V."
                    },
                    {
                        "name": "Nar A.S."
                    },
                    {
                        "name": "Palmer C.N.A."
                    },
                    {
                        "name": "Venkatesan R."
                    }
                ],
                "date": "2020-04-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "PheGWAS: A new dimension to visualize GWAS across multiple phenotypes"
            },
            "pmid": "31860083"
        }
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Lipids",
            "uri": "http://edamontology.org/topic_0153"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Phenomics",
            "uri": "http://edamontology.org/topic_3298"
        }
    ],
    "validated": 1
}
