{
    "additionDate": "2017-08-03T18:38:12Z",
    "biotoolsCURIE": "biotools:cclasso",
    "biotoolsID": "cclasso",
    "credit": [
        {
            "email": "dengmh@math.pku.edu.cn",
            "name": "Minghua Deng",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/huayingfang"
        }
    ],
    "description": "Novel method based on least squares with ℓ1 penalty to infer the correlation network for latent variables of compositional data from metagenomic data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/huayingfang/CCLasso"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Correlation",
                    "uri": "http://edamontology.org/operation_3465"
                }
            ]
        }
    ],
    "homepage": "http://www.math.pku.edu.cn/teachers/dengmh/CCLasso/",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:55Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/cclasso-correlation-inference-for-compositional-data-through-lasso.html"
        }
    ],
    "name": "CCLasso",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© The Author 2015.Motivation: Direct analysis of microbial communities in the environment and human body has become more convenient and reliable owing to the advancements of high-throughput sequencing techniques for 16S rRNA gene profiling. Inferring the correlation relationship among members of microbial communities is of fundamental importance for genomic survey study. Traditional Pearson correlation analysis treating the observed data as absolute abundances of the microbes may lead to spurious results because the data only represent relative abundances. Special care and appropriate methods are required prior to correlation analysis for these compositional data. Results: In this article, we first discuss the correlation definition of latent variables for compositional data. We then propose a novel method called CCLasso based on least squares with -1 penalty to infer the correlation network for latent variables of compositional data from metagenomic data. An effective alternating direction algorithm from augmented Lagrangian method is used to solve the optimization problem. The simulation results show that CCLasso outperforms existing methods, e.g. SparCC, in edge recovery for compositional data. It also compares well with SparCC in estimating correlation network of microbe species from the Human Microbiome Project.",
                "authors": [
                    {
                        "name": "Deng M."
                    },
                    {
                        "name": "Fang H."
                    },
                    {
                        "name": "Huang C."
                    },
                    {
                        "name": "Zhao H."
                    }
                ],
                "citationCount": 66,
                "date": "2015-10-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "CCLasso: Correlation inference for compositional data through Lasso"
            },
            "pmid": "26048598"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
