{
    "additionDate": "2022-10-04T08:07:28.107118Z",
    "biotoolsCURIE": "biotools:deepbindbc",
    "biotoolsID": "deepbindbc",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Haiping Zhang"
        },
        {
            "name": "Yanjie Wei"
        }
    ],
    "description": "DeepBindBC is a deep learning based binary classifier for identifying native-like protein-ligand complexes.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                }
            ]
        }
    ],
    "homepage": "http://cbblab.siat.ac.cn/DeepBindBC/index.php",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:30:56.593958Z",
    "license": "Other",
    "name": "DeepBindBC",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/j.ymeth.2022.07.009",
            "metadata": {
                "abstract": "Identifying native-like protein–ligand complexes (PLCs) from an abundance of docking decoys is critical for large-scale virtual drug screening in early-stage drug discovery lead searching efforts. Providing reliable prediction is still a challenge for most current affinity predicting models because of a lack of non-binding data during model training, lost critical physical–chemical features, and difficulties in learning abstract information with limited neural layers. In this work, we proposed a deep learning model, DeepBindBC, for classifying putative ligands as binding or non-binding. Our model incorporates information on non-binding interactions, making it more suitable for real applications. ResNet model architecture and more detailed atom type representation guarantee implicit features can be learned more accurately. Here, we show that DeepBindBC outperforms Autodock Vina, Pafnucy, and DLSCORE for three DUD.E testing sets. Moreover, DeepBindBC identified a novel human pancreatic α-amylase binder validated by a fluorescence spectral experiment (Ka = 1.0 × 105 M). Furthermore, DeepBindBC can be used as a core component of a hybrid virtual screening pipeline that incorporating many other complementary methods, such as DFCNN, Autodock Vina docking, and pocket molecular dynamics simulation. Additionally, an online web server based on the model is available at http://cbblab.siat.ac.cn/DeepBindBC/index.php for the user's convenience. Our model and the web server provide alternative tools in the early steps of drug discovery by providing accurate identification of native-like PLCs.",
                "authors": [
                    {
                        "name": "Liao L."
                    },
                    {
                        "name": "Pan Y."
                    },
                    {
                        "name": "Saravanan K.M."
                    },
                    {
                        "name": "Wei Y."
                    },
                    {
                        "name": "Wu H."
                    },
                    {
                        "name": "Wu X."
                    },
                    {
                        "name": "Zhang H."
                    },
                    {
                        "name": "Zhang H."
                    },
                    {
                        "name": "Zhang H."
                    },
                    {
                        "name": "Zhang T."
                    }
                ],
                "citationCount": 12,
                "date": "2022-09-01T00:00:00Z",
                "journal": "Methods",
                "title": "DeepBindBC: A practical deep learning method for identifying native-like protein-ligand complexes in virtual screening"
            },
            "pmid": "35878751"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        }
    ],
    "validated": 1
}
