{
    "additionDate": "2015-01-22T11:40:40Z",
    "biotoolsCURIE": "biotools:nannochloropsis",
    "biotoolsID": "nannochloropsis",
    "credit": [
        {
            "name": "ELIXIR-ITA-PADOVA",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "andrea.telatin@cribi.unipd.it",
            "name": "Andrea Telatin",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "This database provide several way to access to the genomic data, as a blast search page, a genome browser and a direct link to download the data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.nannochloropsis.org/index.php"
        }
    ],
    "editPermission": {
        "authors": [
            "telatin"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://www.nannochloropsis.org/",
    "lastUpdate": "2020-05-01T11:51:00Z",
    "name": "Nannocholopsis gaditana Database",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "telatin",
    "publication": [
        {
            "doi": "10.1093/mp/sst120",
            "metadata": {
                "abstract": "Nannochloropsis is rapidly emerging as a model organism for the study of biofuel production in microalgae. Here, we report a high-quality genomic assembly of Nannochloropsis gaditana, consisting of large contigs, up to 500 kbp long, and scaffolds that in most cases span the entire length of the chromosomes. We identified 10646 complete genes and characterized possible alternative transcripts. The annotation of the predicted genes and the analysis of cellular processes revealed traits relevant for the genetic improvement of this organism such as genes involved in DNA recombination, RNA silencing, and cell wall synthesis. We also analyzed the modification of the transcriptional profile in nitrogen deficiency - a condition known to stimulate lipid accumulation. While the content of lipids increased, we did not detect major changes in expression of the genes involved in their biosynthesis. At the same time, we observed a very significant down-regulation of mitochondrial gene expression, suggesting that part of the Acetyl-CoA and NAD(P)H, normally oxidized through the mitochondrial respiration, would be made available for fatty acids synthesis, increasing the flux through the lipid biosynthetic pathway. Finally, we released an information resource of the genomic data of N. gaditana, available online at www.nannochloropsis.org. © 2013 © The Author 2013. Published by the Molecular Plant Shanghai Editorial Office in association with Oxford University Press on behalf of CSPB and IPPE, SIBS, CAS.",
                "authors": [
                    {
                        "name": "Corteggiani Carpinelli E."
                    },
                    {
                        "name": "Telatin A."
                    },
                    {
                        "name": "Vitulo N."
                    },
                    {
                        "name": "Forcato C."
                    },
                    {
                        "name": "D'Angelo M."
                    },
                    {
                        "name": "Schiavon R."
                    },
                    {
                        "name": "Vezzi A."
                    },
                    {
                        "name": "Giacometti G.M."
                    },
                    {
                        "name": "Morosinotto T."
                    },
                    {
                        "name": "Valle G."
                    }
                ],
                "citationCount": 120,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Molecular Plant",
                "title": "Chromosome scale genome assembly and transcriptome profiling of nannochloropsis gaditana in nitrogen depletion"
            },
            "pmid": "23966634",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1
}