{
    "additionDate": "2017-12-18T00:09:43Z",
    "biotoolsCURIE": "biotools:normal",
    "biotoolsID": "normal",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.cs.ucr.edu/~polishka/"
        }
    ],
    "description": "NOrMAL (NucleOsome Mapping ALgorithm) is a command line tool for accurate placing of the nucleosomes. It was designed to resolve overlapping nucleosomes and extract extra information (“fuzziness”, probability, etc.) of nucleosome placement.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://alumni.cs.ucr.edu/~polishka/#use"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "homepage": "http://www.cs.ucr.edu/~polishka/",
    "language": [
        "R",
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/normal-accurate-nucleosome-positioning-using-a-modified-gaussian-mixture-model.html"
        }
    ],
    "name": "NOrMAL",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/bts206",
            "metadata": {
                "abstract": "Motivation: Nucleosomes are the basic elements of chromatin structure. They control the packaging of DNA and play a critical role in gene regulation by allowing physical access to transcription factors. The advent of second-generation sequencing has enabled landmark genome-wide studies of nucleosome positions for several model organisms. Current methods to determine nucleosome positioning first compute an occupancy coverage profile by mapping nucleosome-enriched sequenced reads to a reference genome; then, nucleosomes are placed according to the peaks of the coverage profile. These methods are quite accurate on placing isolated nucleosomes, but they do not properly handle more complex configurations. Also, they can only provide the positions of nucleosomes and their occupancy level, whereas it is very beneficial to supply molecular biologists additional information about nucleosomes like the probability of placement, the size of DNA fragments enriched for nucleosomes and/or whether nucleosomes are well positioned or 'fuzzy' in the sequenced cell sample. Results: We address these issues by providing a novel method based on a parametric probabilistic model. An expectation maximization algorithm is used to infer the parameters of the mixture of distributions. We compare the performance of our method on two real datasets against Template Filtering, which is considered the current state-of-the-art. On synthetic data, we show that our method can resolve more accurately complex configurations of nucleosomes, and it is more robust to user-defined parameters. On real data, we show that our method detects a significantly higher number of nucleosomes. © The Author(s) 2012. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Polishko A."
                    },
                    {
                        "name": "Ponts N."
                    },
                    {
                        "name": "Le Roch K.G."
                    },
                    {
                        "name": "Lonardi S."
                    }
                ],
                "citationCount": 26,
                "date": "2012-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "NOrMAL: Accurate nucleosome positioning using a modified Gaussian mixture model"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Nucleosome positioning",
            "uri": "http://edamontology.org/topic_3176"
        }
    ],
    "validated": 1
}