{
    "accessibility": "Open access",
    "additionDate": "2022-06-25T13:36:10.918598Z",
    "biotoolsCURIE": "biotools:elf-dpc",
    "biotoolsID": "elf-dpc",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "mhmpub@ustb.edu.cn",
            "name": "Huimin Ma",
            "typeEntity": "Person"
        }
    ],
    "description": "An Ensemble Learning Framework for Detecting Protein Complexes From PPI Networks.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                }
            ]
        }
    ],
    "homepage": "https://github.com/RongquanWang/ELF-DPC",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-06-25T13:36:10.921209Z",
    "license": "Not licensed",
    "name": "ELF-DPC",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3389/FGENE.2022.839949",
            "metadata": {
                "abstract": "Copyright © 2022 Wang, Ma and Wang.Detecting protein complexes is one of the keys to understanding cellular organization and processes principles. With high-throughput experiments and computing science development, it has become possible to detect protein complexes by computational methods. However, most computational methods are based on either unsupervised learning or supervised learning. Unsupervised learning-based methods do not need training datasets, but they can only detect one or several topological protein complexes. Supervised learning-based methods can detect protein complexes with different topological structures. However, they are usually based on a type of training model, and the generalization of a single model is poor. Therefore, we propose an Ensemble Learning Framework for Detecting Protein Complexes (ELF-DPC) within protein-protein interaction (PPI) networks to address these challenges. The ELF-DPC first constructs the weighted PPI network by combining topological and biological information. Second, it mines protein complex cores using the protein complex core mining strategy we designed. Third, it obtains an ensemble learning model by integrating structural modularity and a trained voting regressor model. Finally, it extends the protein complex cores and forms protein complexes by a graph heuristic search strategy. The experimental results demonstrate that ELF-DPC performs better than the twelve state-of-the-art approaches. Moreover, functional enrichment analysis illustrated that ELF-DPC could detect biologically meaningful protein complexes. The code/dataset is available for free download from https://github.com/RongquanWang/ELF-DPC.",
                "authors": [
                    {
                        "name": "Ma H."
                    },
                    {
                        "name": "Wang C."
                    },
                    {
                        "name": "Wang R."
                    }
                ],
                "date": "2022-02-24T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "An Ensemble Learning Framework for Detecting Protein Complexes From PPI Networks"
            },
            "pmcid": "PMC8908451",
            "pmid": "35281831"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein interaction experiment",
            "uri": "http://edamontology.org/topic_3957"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ]
}
