
{
    "credit": [
        {
            "email": "jinzhang@engr.uconn.edu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.engr.uconn.edu/~jiz08001/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://www.engr.uconn.edu/~jiz08001/software/SVseq2/README.TXT"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            },
            {
                "term": "DNA mutation",
                "uri": "http://edamontology.org/topic_2533"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/svseq-2-2-detecting-exact-breakpoints-of-deletions-with-low-coverage-sequence-data.html"
        }
    ],
    "publication": [
        {
            "abstract": "Recent advances in sequencing technologies make it possible to comprehensively study structural variations (SVs) using sequence data of large-scale populations. Currently, more efforts have been taken to develop methods that call SVs with exact breakpoints. Among these approaches, split-read mapping methods can be applied on low-coverage sequence data. With increasing amount of data generated, more efficient split-read mapping methods are still needed. Also, since sequence errors can not be avoided for the current sequencing technologies, more accurate split-read mapping methods are still needed to better handle sequence errors. In this paper, we present a split-read mapping method implemented in the program SVseq2 which improves our previous work SVseq1. Similar to SVseq1, SVseq2 calls deletions (and insertions) with exact breakpoints. SVseq2 achieves more accurate calling through split-read mapping within focal regions. SVseq2 also has a much desired feature: there is no need to specify the maximum deletion size, while some existing split-read mapping methods need more memory and longer running time when larger maximum deletion size is chosen. SVseq2 is also much faster because it only needs to examine a small number of ways of splitting the reads. Moreover, SVseq2 supports insertion calling from low-coverage sequence data, while SVseq1 only supports deletion finding. The program SVseq2 can be downloaded at http://www.engr.uconn.edu/~jiz08001/. SVseq2 enables accurate and efficient SV calling through split-read mapping within focal regions using paired-end reads. For many simulated data and real sequence data, SVseq2 outperforms some other existing approaches in accuracy and efficiency, especially when sequence coverage is low.",
            "authors": [
                "Zhang J.",
                "Wang J.",
                "Wu Y."
            ],
            "cit_count": 39,
            "journal": "BMC bioinformatics",
            "pmid": "22537045",
            "title": "An improved approach for accurate and efficient calling of structural variations with low-coverage sequence data.",
            "year": "2012-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:svseq",
        "biotoolsID": "svseq",
        "description": "An improved approach for accurate and efficient calling of structural variations with low-coverage sequence data.  It calls both deletions and insertions.",
        "homepage": "http://www.engr.uconn.edu/~jiz08001/svseq2.html",
        "name": "SVseq"
    }
}