
{
    "credit": [
        {
            "email": "mschatz@cs.jhu.edu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://schatzlab.cshl.edu/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://sourceforge.net/projects/splitmem/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            },
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            },
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/splitmem-graphical-pan-genome-analysis-with-suffix-skips.html"
        }
    ],
    "publication": [
        {
            "abstract": "© The Author 2014. Published by Oxford University Press. All rights reserved.Motivation: Genomics is expanding from a single reference per species paradigm into a more comprehensive pan-genome approach that analyzes multiple individuals together. A compressed de Bruijn graph is a sophisticated data structure for representing the genomes of entire populations. It robustly encodes shared segments, simple single-nucleotide polymorphisms and complex structural variations far beyond what can be represented in a collection of linear sequences alone. Results: We explore deep topological relationships between suffix trees and compressed de Bruijn graphs and introduce an algorithm, splitMEM, that directly constructs the compressed de Bruijn graph in time and space linear to the total number of genomes for a given maximum genome size. We introduce suffix skips to traverse several suffix links simultaneously and use them to efficiently decompose maximal exact matches into graph nodes. We demonstrate the utility of splitMEM by analyzing the nine-strain pan-genome of Bacillus anthracis and up to 62 strains of Escherichia coli, revealing their core-genome properties.",
            "authors": [
                "Marcus S.",
                "Lee H.",
                "Schatz M.C."
            ],
            "cit_count": 29,
            "journal": "Bioinformatics",
            "pmid": "25398610",
            "title": "SplitMEM: A graphical algorithm for pan-genome analysis with suffix skips",
            "year": "2014-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:splitmem",
        "biotoolsID": "splitmem",
        "description": "An algorithm that directly constructs the compressed de Bruijn graph in time and space linear to the total number of genomes for a given maximum genome size.",
        "homepage": "http://sourceforge.net/projects/splitmem/",
        "name": "SplitMEM"
    }
}