
{
    "credit": [
        {
            "name": "Petr Čech",
            "typeEntity": "Person",
            "typeRoles": [
                "Developer"
            ]
        },
        {
            "name": "David Hoksza",
            "typeEntity": "Person",
            "typeRoles": [
                "Developer"
            ]
        },
        {
            "name": "Daniel Svozil",
            "typeEntity": "Person",
            "typeRoles": [
                "Developer"
            ]
        },
        {
            "name": "Daniel Svozil",
            "typeRoles": [
                "Contributor"
            ]
        },
        {
            "name": "Charles University in Prague, Czech Republic",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "name": "University of Chemistry and Technology Prague, Czech Republic",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "name": "ELIXIR-CZ",
            "typeEntity": "Consortium",
            "typeRoles": [
            ]
        },
        {
            "name": "Czech Science Foundation",
            "typeEntity": "Funding agency",
            "typeRoles": [
                "Contributor"
            ]
        },
        {
            "name": "ELIXIR-CZ",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "svozild@vscht.cz",
            "name": "Daniel Svozil",
            "typeRoles": [
                "Support"
            ]
        },
        {
            "email": "david.hoksza@mff.cuni.cz",
            "name": "David Hoksza",
            "typeRoles": [
                "Support"
            ]
        },
        {
            "email": "svozild@vscht.cz",
            "name": "Daniel Svozil",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "david.hoksza@mff.cuni.cz",
            "name": "David Hoksza",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "Citation instructions",
            "url": "http://setter.projekty.ms.mff.cuni.cz/help/index/"
        },
        {
            "type": "General",
            "url": "http://setter.projekty.ms.mff.cuni.cz/help/index/"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "PDB ID",
                        "uri": "http://edamontology.org/data_1127"
                    },
                    "format": [
                        {
                            "term": "PDB",
                            "uri": "http://edamontology.org/format_1476"
                        }
                    ]
                }
            ],
            "note": "Secondary-based RNA tertiary structure superposition either PDBID or user-prepared PDB",
            "operation": [
                {
                    "term": "Nucleic acid structure analysis",
                    "uri": "http://edamontology.org/operation_2481"
                },
                {
                    "term": "RNA secondary structure alignment",
                    "uri": "http://edamontology.org/operation_0502"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Secondary structure alignment (RNA)",
                        "uri": "http://edamontology.org/data_0881"
                    }
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Czech Republic",
            "ELIXIR-CZ"
        ],
        "cost": "Free of charge",
        "elixirNode": [
            "Czech Republic"
        ],
        "elixirPlatform": [
            "Tools"
        ],
        "language": [
            "C++",
            "Python"
        ],
        "maturity": "Mature",
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "RNA",
                "uri": "http://edamontology.org/topic_0099"
            },
            {
                "term": "Nucleic acid structure analysis",
                "uri": "http://edamontology.org/topic_0097"
            }
        ]
    },
    "publication": [
        {
            "abstract": "The recent discoveries of regulatory non-coding RNAs changed our view of RNA as a simple information transfer molecule. Understanding the architecture and function of active RNA molecules requires methods for comparing and analyzing their 3D structures. While structural alignment of short RNAs is achievable in a reasonable amount of time, large structures represent much bigger challenge. Here, we present the SETTER web server for the RNA structure pairwise comparison utilizing the SETTER (SEcondary sTructure-based TERtiary Structure Similarity Algorithm) algorithm. The SETTER method divides an RNA structure into the set of non-overlapping structural elements called generalized secondary structure units (GSSUs). The SETTER algorithm scales as O(n 2) with the size of a GSSUs and as O(n) with the number of GSSUs in the structure. This scaling gives SETTER its high speed as the average size of the GSSU remains constant irrespective of the size of the structure. However, the favorable speed of the algorithm does not compromise its accuracy. The SETTER web server together with the stand-alone implementation of the SETTER algorithm are freely accessible at http://siret.cz/setter. © 2012 The Author(s).",
            "authors": [
                "Cech P.",
                "Svozil D.",
                "Hoksza D."
            ],
            "cit_count": 12,
            "doi": "10.1093/nar/gks560",
            "journal": "Nucleic Acids Research",
            "title": "SETTER: Web server for RNA structure comparison",
            "type": "Primary",
            "year": "2012-07-01"
        },
        {
            "abstract": "© 2015 Čech et al.Background: Understanding the architecture and function of RNA molecules requires methods for comparing and analyzing their tertiary and quaternary structures. While structural superposition of short RNAs is achievable in a reasonable time, large structures represent much bigger challenge. Therefore, we have developed a fast and accurate algorithm for RNA pairwise structure superposition called SETTER and implemented it in the SETTER web server. However, though biological relationships can be inferred by a pairwise structure alignment, key features preserved by evolution can be identified only from a multiple structure alignment. Thus, we extended the SETTER algorithm to the alignment of multiple RNA structures and developed the MultiSETTER algorithm. Results: In this paper, we present the updated version of the SETTER web server that implements a user friendly interface to the MultiSETTER algorithm. The server accepts RNA structures either as the list of PDB IDs or as user-defined PDB files. After the superposition is computed, structures are visualized in 3D and several reports and statistics are generated. Conclusion: To the best of our knowledge, the MultiSETTER web server is the first publicly available tool for a multiple RNA structure alignment. The MultiSETTER server offers the visual inspection of an alignment in 3D space which may reveal structural and functional relationships not captured by other multiple alignment methods based either on a sequence or on secondary structure motifs.",
            "authors": [
                "Cech P.",
                "Hoksza D.",
                "Svozil D."
            ],
            "cit_count": 5,
            "doi": "10.1186/s12859-015-0696-8",
            "journal": "BMC Bioinformatics",
            "title": "MultiSETTER: Web server for multiple RNA structure comparison",
            "type": "Other",
            "year": "2015-08-12"
        },
        {
            "abstract": "© 2014 IEEE. Recent advances in RNA research and the steady growth of available RNA structures call for bioinformatics methods for handling and analyzing RNA structural data. Recently, we introduced SETTER - a fast and accurate method for RNA pairwise structure alignment. In this paper, we describe MultiSETTER, SETTER extension for multiple RNA structure alignment. MultiSETTER combines SETTER's decomposition of RNA structures into non-overlapping structural subunits with the multiple sequence alignment algorithm ClustalW adapted for the structure alignment. The accuracy of MultiSETTER was assessed by the automatic classification of RNA structures and its comparison to SCOR annotations. In addition, MultiSETTER classification was also compared to multiple sequence alignment-based and secondary structure alignment-based classifications provided by LocARNA and RNADistance tools, respectively. MultiSETTER precompiled Windows libraries, as well as the C++ source code, are freely available from http://siret.cz/multisetter.",
            "authors": [
                "Hoksza D.",
                "Svozil D."
            ],
            "cit_count": 3,
            "doi": "10.1109/TCBB.2014.2351810",
            "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
            "title": "Multiple 3D RNA structure superposition using neighbor joining",
            "type": "Other",
            "year": "2015-05-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:setter",
        "biotoolsID": "setter",
        "description": "A web application for RNA structure comparison.",
        "homepage": "http://setter.projekty.ms.mff.cuni.cz/",
        "name": "SETTER",
        "version": [
            "1.0"
        ]
    }
}