{
    "additionDate": "2021-03-19T08:50:34Z",
    "biotoolsCURIE": "biotools:ninimhmda",
    "biotoolsID": "ninimhmda",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "yuanjingma2020@u.northwestern.edu",
            "name": "Yuanjing Ma",
            "typeEntity": "Person"
        },
        {
            "email": "hongmei@northwestern.edu",
            "name": "Hongmei Jiang",
            "typeEntity": "Person"
        }
    ],
    "description": "NinimHMDA: Neural Integration of Neighborhood Information on a Multiplex Heterogeneous Network for Multiple Human Microbe-Disease Association Types Prediction.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/yuanjing-ma/NinimHMDA",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-04-11T11:50:05Z",
    "name": "NinimHMDA",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA1080",
            "metadata": {
                "abstract": "© The Author(s) 2021. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.comMotivation: Many computational methods have been recently proposed to identify differentially abundant microbes related to a single disease; however, few studies have focused on large-scale microbe-disease association prediction using existing experimentally verified associations. This area has critical meanings. For example, it can help to rank and select potential candidate microbes for different diseases at-scale for downstream lab validation experiments and it utilizes existing evidence instead of the microbiome abundance data which usually costs money and time to generate. Results: We construct a multiplex heterogeneous network (MHEN) using human microbe-disease association database, Disbiome and other prior biological databases, and define the large-scale human microbe-disease association prediction as link prediction problems on MHEN. We develop an end-to-end graph convolutional neural network-based mining model NinimHMDA which can not only integrate different prior biological knowledge but also predict different types of microbe-disease associations (e.g. a microbe may be reduced or elevated under the impact of a disease) using one-time model training. To the best of our knowledge, this is the first method that targets on predicting different association types between microbes and diseases. Results from large-scale cross validation and case studies show that our model is highly competitive compared to other commonly used approaches.",
                "authors": [
                    {
                        "name": "Ma Y."
                    },
                    {
                        "name": "Jiang H."
                    }
                ],
                "date": "2020-12-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "NinimHMDA: Neural integration of neighborhood information on a multiplex heterogeneous network for multiple types of human Microbe-Disease association"
            },
            "pmid": "33416850"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        }
    ]
}