{"credit":[{"email":"quast.support@bioinf.spbau.ru","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"url":"http://quast.bioinf.spbau.ru/manual.html"}],"function":[{"operation":[{"term":"Data retrieval","uri":"http://edamontology.org/operation_2422"},{"term":"Sequence visualisation","uri":"http://edamontology.org/operation_0564"}]}],"labels":{"collectionID":["Animal and Crop Genomics"],"language":["JavaScript","C++","Perl","Python","C"],"license":"GPL-2.0","operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool","Web application"],"topic":[{"term":"Data visualisation","uri":"http://edamontology.org/topic_0092"}]},"publication":[{"abstract":"© The Author 2016. Published by Oxford University Press. All rights reserved. Summary: Data visualization plays an increasingly important role in NGS data analysis. With advances in both sequencing and computational technologies, it has become a new bottleneck in genomics studies. Indeed, evaluation of de novo genome assemblies is one of the areas that can benefit from the visualization. However, even though multiple quality assessment methods are now available, existing visualization tools are hardly suitable for this purpose. Here, we present Icarus - a novel genome visualizer for accurate assessment and analysis of genomic draft assemblies, which is based on the tool QUAST. Icarus can be used in studies where a related reference genome is available, as well as for non-model organisms. The tool is available online and as a standalone application.","authors":["Mikheenko A.","Valin G.","Prjibelski A.","Saveliev V.","Gurevich A."],"cit_count":5,"doi":"10.1093/bioinformatics/btw379","journal":"Bioinformatics","title":"Icarus: Visualizer for de novo assembly evaluation","type":"Primary","year":"2016-11-01"}],"summary":{"biotoolsCURIE":"biotools:icarus","biotoolsID":"icarus","description":"Novel genome visualizer for accurate assessment and analysis of genomic draft assemblies, which is based on QUAST genome quality assessment tool. Icarus consists of two major contig viewers: Contig alignment viewer and Contig size viewer.","homepage":"http://quast.sourceforge.net/icarus.html","name":"Icarus"}}