{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://krishna.gs.washington.edu/"}],"documentation":[{"type":"GENERAL","url":"https://github.com/shendurelab/LACHESIS"}],"function":[{"operation":[{"term":"Sequence assembly","uri":"http://edamontology.org/operation_0310"}]},{"operation":[{"term":"Genome assembly","uri":"http://edamontology.org/operation_0525"}]}],"labels":{"language":["R","C++"],"operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"Assembly","uri":"http://edamontology.org/topic_0196"},{"term":"Probability","uri":"http://edamontology.org/topic_2269"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/lachesis-genome-assembly-with-contact-probability-maps.html"}],"publication":[{"abstract":"Genomes assembled de novo from short reads are highly fragmented relative to the finished chromosomes of Homo sapiens and key model organisms generated by the Human Genome Project. To address this problem, we need scalable, cost-effective methods to obtain assemblies with chromosome-scale contiguity. Here we show that genome-wide chromatin interaction data sets, such as those generated by Hi-C, are a rich source of long-range information for assigning, ordering and orienting genomic sequences to chromosomes, including across centromeres. To exploit this finding, we developed an algorithm that uses Hi-C data for ultra-long-range scaffolding of de novo genome assemblies. We demonstrate the approach by combining shotgun fragment and short jump mate-pair sequences with Hi-C data to generate chromosome-scale de novo assemblies of the human, mouse and Drosophila genomes, achieving - for the human genome - 98% accuracy in assigning scaffolds to chromosome groups and 99% accuracy in ordering and orienting scaffolds within chromosome groups. Hi-C data can also be used to validate chromosomal translocations in cancer genomes. © 2013 Nature America, Inc. All rights reserved.","authors":["Burton J.N.","Adey A.","Patwardhan R.P.","Qiu R.","Kitzman J.O.","Shendure J."],"cit_count":154,"doi":"10.1038/nbt.2727","journal":"Nature Biotechnology","title":"Chromosome-scale scaffolding of de novo genome assemblies based on chromatin interactions","type":"Primary","year":"2013-12-01"}],"summary":{"biotoolsCURIE":"biotools:lachesis","biotoolsID":"lachesis","description":"LACHESIS is method that exploits contact probability map data (e.g. from Hi-C) for chromosome-scale de novo genome assembly.","homepage":"http://shendurelab.github.io/LACHESIS/","name":"LACHESIS"}}