{
    "additionDate": "2020-01-14T19:32:57Z",
    "biotoolsCURIE": "biotools:Arteria",
    "biotoolsID": "Arteria",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "johan.dahlberg@medsci.uu.se",
            "name": "Johan Dahlberg",
            "orcidid": "https://orcid.org/0000-0001-6962-1460",
            "typeEntity": "Person"
        }
    ],
    "description": "An automation system for a sequencing core facility.\n\nStackStorm packs to automate sequencing center operations.\n\nEvent-driven sequencing center automation.\n\nIt forms the core of the Arteria automation system, which you can read about on our website or preprint. This pack integrates with a series of bioinformatic micro-services, which can be found at https://github.com/arteria-project.\n\nThis pack provides re-usable units for automating tasks at a sequencing core facility using the StackStorm event-driven automation platform.\n\nHandling sequencing data from massive parallel sequencing can be a daunting task! And while the process of handling sequencing data will share many of its characteristics across centers, the current norm is one center one solution. This creates a situation where reuse is difficult to achieve and the wheel is invented over and over again. This is a situation that we hope can be remedied in the form of the Arteria project",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "homepage": "https://arteria-project.github.io/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-02T15:01:12Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/arteria-project/arteria-packs"
        }
    ],
    "name": "Arteria",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/GIGASCIENCE/GIZ135",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Background: In recent years, nucleotide sequencing has become increasingly instrumental in both research and clinical settings. This has led to an explosive growth in sequencing data produced worldwide. As the amount of data increases, so does the need for automated solutions for data processing and analysis. The concept of workflows has gained favour in the bioinformatics community, but there is little in the scientific literature describing end-to-end automation systems. Arteria is an automation system that aims at providing a solution to the data-related operational challenges that face sequencing core facilities. Findings: Arteria is built on existing open source technologies, with a modular design allowing for a community-driven effort to create plug-and-play micro-services. In this article we describe the system, elaborate on the underlying conceptual framework, and present an example implementation. Arteria can be reduced to 3 conceptual levels: orchestration (using an event-based model of automation), process (the steps involved in processing sequencing data, modelled as workflows), and execution (using a series of RESTful micro-services). This creates a system that is both flexible and scalable. Arteria-based systems have been successfully deployed at 3 sequencing core facilities. The Arteria Project code, written largely in Python, is available as open source software, and more information can be found at https://arteria-project.github.io/. Conclusions: We describe the Arteria system and the underlying conceptual framework, demonstrating how this model can be used to automate data handling and analysis in the context of a sequencing core facility.",
                "authors": [
                    {
                        "name": "Dahlberg J."
                    },
                    {
                        "name": "Hermansson J."
                    },
                    {
                        "name": "Sturlaugsson S."
                    },
                    {
                        "name": "Lysenkova M."
                    },
                    {
                        "name": "Smeds P."
                    },
                    {
                        "name": "Ladenvall C."
                    },
                    {
                        "name": "Guimera R.V."
                    },
                    {
                        "name": "Reisinger F."
                    },
                    {
                        "name": "Hofmann O."
                    },
                    {
                        "name": "Larsson P."
                    }
                ],
                "date": "2019-12-01T00:00:00Z",
                "journal": "GigaScience",
                "title": "Arteria: An automation system for a sequencing core facility"
            },
            "pmcid": "PMC6905352",
            "pmid": "31825479"
        }
    ],
    "topic": [
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        }
    ],
    "validated": 1
}