{
    "additionDate": "2017-01-17T14:59:56Z",
    "biotoolsCURIE": "biotools:diffbind",
    "biotoolsID": "diffbind",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "rory.stark@cruk.cam.ac.uk",
            "name": "Rory Stark",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Compute differentially bound sites from multiple ChIP-seq experiments using affinity (quantitative) data. Also enables occupancy (overlap) analysis and plotting functions.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/DiffBind.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/DiffBind_2.2.6.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential binding analysis",
                    "uri": "http://edamontology.org/operation_3677"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/DiffBind.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-06-30T16:44:44Z",
    "license": "Artistic-2.0",
    "name": "DiffBind",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_012918"
        }
    ],
    "owner": "rorystark",
    "publication": [
        {
            "doi": "10.1186/bcr3664",
            "metadata": {
                "abstract": "Introduction: Endocrine therapies targeting cell proliferation and survival mediated by estrogen receptor α (ERα) are among the most effective systemic treatments for ERα-positive breast cancer. However, most tumors initially responsive to these therapies acquire resistance through mechanisms that involve ERα transcriptional regulatory plasticity. Herein we identify VAV3 as a critical component in this process.Methods: A cell-based chemical compound screen was carried out to identify therapeutic strategies against resistance to endocrine therapy. Binding to ERα was evaluated by molecular docking analyses, an agonist fluoligand assay and short hairpin (sh)RNA-mediated protein depletion. Microarray analyses were performed to identify altered gene expression. Western blot analysis of signaling and proliferation markers, and shRNA-mediated protein depletion in viability and clonogenic assays, were performed to delineate the role of VAV3. Genetic variation in VAV3 was assessed for association with the response to tamoxifen. Immunohistochemical analyses of VAV3 were carried out to determine its association with therapeutic response and different tumor markers. An analysis of gene expression association with drug sensitivity was carried out to identify a potential therapeutic approach based on differential VAV3 expression.Results: The compound YC-1 was found to comparatively reduce the viability of cell models of acquired resistance. This effect was probably not due to activation of its canonical target (soluble guanylyl cyclase), but instead was likely a result of binding to ERα. VAV3 was selectively reduced upon exposure to YC-1 or ERα depletion, and, accordingly, VAV3 depletion comparatively reduced the viability of cell models of acquired resistance. In the clinical scenario, germline variation in VAV3 was associated with the response to tamoxifen in Japanese breast cancer patients (rs10494071 combined P value = 8.4 × 10-4). The allele association combined with gene expression analyses indicated that low VAV3 expression predicts better clinical outcome. Conversely, high nuclear VAV3 expression in tumor cells was associated with poorer endocrine therapy response. Based on VAV3 expression levels and the response to erlotinib in cancer cell lines, targeting EGFR signaling may be a promising therapeutic strategy.Conclusions: This study proposes VAV3 as a biomarker and a rationale for its use as a signaling target to prevent and/or overcome resistance to endocrine therapy in breast cancer. © 2014 Aguilar et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Aguilar H."
                    },
                    {
                        "name": "Balart J."
                    },
                    {
                        "name": "Barril X."
                    },
                    {
                        "name": "Beijersbergen R.L."
                    },
                    {
                        "name": "Bonifaci N."
                    },
                    {
                        "name": "Bostner J."
                    },
                    {
                        "name": "Brunet J."
                    },
                    {
                        "name": "Burnstein K.L."
                    },
                    {
                        "name": "Bustelo X.R."
                    },
                    {
                        "name": "Caizzi L."
                    },
                    {
                        "name": "Carlson K.E."
                    },
                    {
                        "name": "Clarke R."
                    },
                    {
                        "name": "Climent F."
                    },
                    {
                        "name": "Di Croce L."
                    },
                    {
                        "name": "Esteller M."
                    },
                    {
                        "name": "Extremera A.I."
                    },
                    {
                        "name": "Figueras A."
                    },
                    {
                        "name": "Fornander T."
                    },
                    {
                        "name": "Garcia N."
                    },
                    {
                        "name": "Garcia-Mata R."
                    },
                    {
                        "name": "Gil M."
                    },
                    {
                        "name": "Gomez-Baldo L."
                    },
                    {
                        "name": "Halonen P."
                    },
                    {
                        "name": "Islam A."
                    },
                    {
                        "name": "Jansen M.P.H.M."
                    },
                    {
                        "name": "Karlsson E."
                    },
                    {
                        "name": "Katzenellenbogen J.A."
                    },
                    {
                        "name": "Kiyotani K."
                    },
                    {
                        "name": "Martrat G."
                    },
                    {
                        "name": "Mushiroda T."
                    },
                    {
                        "name": "Nakamura Y."
                    },
                    {
                        "name": "Nevedomskaya E."
                    },
                    {
                        "name": "Perez Tenorio G."
                    },
                    {
                        "name": "Pujana M.A."
                    },
                    {
                        "name": "Rodriguez-Pena A.B."
                    },
                    {
                        "name": "Rodriguez-Vida A."
                    },
                    {
                        "name": "Serra-Musach J."
                    },
                    {
                        "name": "Sgroi D.C."
                    },
                    {
                        "name": "Soler M.T."
                    },
                    {
                        "name": "Stal O."
                    },
                    {
                        "name": "Urruticoechea A."
                    },
                    {
                        "name": "Villanueva A."
                    },
                    {
                        "name": "Vizoso M."
                    },
                    {
                        "name": "Zembutsu H."
                    },
                    {
                        "name": "Zwart W."
                    }
                ],
                "citationCount": 19,
                "date": "2014-05-28T00:00:00Z",
                "journal": "Breast Cancer Research",
                "title": "VAV3 mediates resistance to breast cancer endocrine therapy"
            },
            "pmcid": "PMC4076632",
            "pmid": "24886537",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        }
    ],
    "validated": 1,
    "version": [
        "2.2.6"
    ]
}
