{"credit":[{"email":"bystrc@rpi.edu","name":"Chris Bystroff","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.bioinfo.rpi.edu/bystrc/"}],"documentation":[{"type":"GENERAL","url":"http://www.bioinfo.rpi.edu/bystrc/Isites2/"}],"function":[{"operation":[{"term":"Protein sequence analysis","uri":"http://edamontology.org/operation_2479"},{"term":"Protein structure prediction","uri":"http://edamontology.org/operation_0474"}]}],"labels":{"language":["Perl","Fortran","C"],"operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"Protein folds and structural domains","uri":"http://edamontology.org/topic_0736"},{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"},{"term":"Protein structural motifs and surfaces","uri":"http://edamontology.org/topic_0166"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/i-sites-2-predict-local-structure-protein.html"}],"publication":[{"abstract":"We describe a new method for local protein structure prediction based on a library of short sequence pattern that correlate strongly with protein three-dimensional structural elements. The library was generated using an automated method for finding correlations between protein sequence and local structure, and contains most previously described local sequence-structure correlations as well as new relationships, including a diverging type-Il β-turn, a frayed helix, and a proline-terminated helix. The query sequence is scanned for segments 7 to 19 residues in length that strongly match one of the 82 patterns in the library. Matching segments are assigned the three-dimensional structure characteristic of the corresponding sequence pattern, and backbone torsion angles for the entire query sequence are then predicted by piecing together mutually compatible segment predictions. In predictions of local structure in a test set of 55 proteins, about 50% of all residues, and 76% of residues covered by high-confidence predictions, were found in eight-residue segments within 1.4 Å of their true structures. The predictions are complementary to traditional secondary structure predictions because they are considerably more specific in turn regions, and may contribute to ab initio tertiary structure prediction and fold recognition.","authors":["Bystroff C.","Baker D."],"cit_count":278,"journal":"Journal of Molecular Biology","pmid":"9698570","title":"Prediction of local structure in proteins using a library of sequence-structure motifs","year":"1998-08-21"}],"summary":{"biotoolsCURIE":"biotools:i-sites","biotoolsID":"i-sites","description":"Method for predicting initiation sites of folding protein sequences.","homepage":"http://www.bioinfo.rpi.edu/bystrc/Isites2/","name":"I-sites"}}