{
    "accessibility": "Open access",
    "additionDate": "2022-10-03T13:51:53.394722Z",
    "biotoolsCURIE": "biotools:gslrda",
    "biotoolsID": "gslrda",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Jie He"
        },
        {
            "name": "Lei Deng"
        },
        {
            "name": "Yurong Qian"
        },
        {
            "name": "Zerui Kang"
        },
        {
            "name": "Jingjing Zheng",
            "orcidid": "https://orcid.org/0000-0002-8549-4235"
        }
    ],
    "description": "Graph Neural Network with Self-Supervised Learning for Noncoding RNA-Drug Resistance Association Prediction.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/JJZ-code/GSLRDA",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-10-03T13:51:53.397736Z",
    "license": "Not licensed",
    "name": "GSLRDA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.2C00367",
            "metadata": {
                "abstract": "© 2022 American Chemical Society.Noncoding RNA(ncRNA) is closely related to drug resistance. Identifying the association between ncRNA and drug resistance is of great significance for drug development. Methods based on biological experiments are often time-consuming and small-scale. Therefore, developing computational methods to distinguish the association between ncRNA and drug resistance is urgent. We develop a computational framework called GSLRDA to predict the association between ncRNA and drug resistance in this work. First, the known ncRNA-drug resistance associations are modeled as a bipartite graph of ncRNA and drug. Then, GSLRDA uses the light graph convolutional network (lightGCN) to learn the vector representation of ncRNA and drug from the ncRNA-drug bipartite graph. In addition, GSLRDA uses different data augmentation methods to generate different views for ncRNA and drug nodes and performs self-supervised learning, further improving the quality of learned ncRNA and drug vector representations through contrastive learning between nodes. Finally, GSLRDA uses the inner product to predict the association between ncRNA and drug resistance. To the best of our knowledge, GSLRDA is the first to apply self-supervised learning in association prediction tasks in the field of bioinformatics. The experimental results show that GSLRDA takes an AUC value of 0.9101, higher than the other eight state-of-the-art models. In addition, case studies including two drugs further illustrate the effectiveness of GSLRDA in predicting the association between ncRNA and drug resistance. The code and data sets of GSLRDA are available at https://github.com/JJZ-code/GSLRDA.",
                "authors": [
                    {
                        "name": "Deng L."
                    },
                    {
                        "name": "He J."
                    },
                    {
                        "name": "Kang Z."
                    },
                    {
                        "name": "Qian Y."
                    },
                    {
                        "name": "Zheng J."
                    }
                ],
                "date": "2022-08-08T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "Graph Neural Network with Self-Supervised Learning for Noncoding RNA-Drug Resistance Association Prediction"
            },
            "pmid": "35838124"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Drug development",
            "uri": "http://edamontology.org/topic_3373"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}
