{
    "accessibility": "Open access",
    "additionDate": "2023-11-29T17:55:38.193612Z",
    "biotoolsCURIE": "biotools:fecrt",
    "biotoolsID": "fecrt",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "md@sund.ku.dk",
            "name": "Matthew J Denwood",
            "typeEntity": "Person"
        }
    ],
    "description": "A statistical framework for calculating prospective sample sizes and classifying efficacy results for faecal egg count reduction tests in ruminants, horses and swine.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://www.fecrt.com",
    "language": [
        "R"
    ],
    "lastUpdate": "2023-11-29T17:55:38.196629Z",
    "name": "FECRT",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.VETPAR.2022.109867",
            "metadata": {
                "abstract": "The faecal egg count reduction test (FECRT) is the primary diagnostic tool used for detecting anthelmintic resistance at the farm level. It is therefore extremely important that the experimental design of a FECRT and the susceptibility classification of the result use standardised and statistically rigorous methods. Several different approaches for improving the analysis of FECRT data have been proposed, but little work has been published on how to address the issue of prospective sample size calculations. Here, we provide a complete and detailed overview of the quantitative issues relevant to a FECRT starting from basic statistical principles. We then present a new approach for determining sample size requirements for the FECRT that is built on a solid statistical framework, and provide a rigorous anthelminthic drug efficacy classification system for use with FECRT in livestock. Our approach uses two separate statistical tests, a one-sided inferiority test for resistance and a one-sided non-inferiority test for susceptibility, and determines a classification of resistant, susceptible or inconclusive based on the combined result. Since this approach is based on two independent one-sided tests, we recommend that a 90 % CI be used in place of the historically used 95 % CI. This maintains the desired Type I error rate of 5 %, and simultaneously reduces the required sample size. We demonstrate the use of this framework to provide sample size calculations that are rooted in the well-understood concept of statistical power. Tailoring to specific host/parasite systems is possible using typical values for expected pre-treatment and post-treatment variability in egg counts as well as within-animal correlation in egg counts. We provide estimates for these parameters for ruminants, horses and swine based on a re-examination of datasets that were available to us from a combination of published data and other sources. An illustrative example is provided to demonstrate the use of the framework, and parameter estimates are presented to estimate the required sample size for a hypothetical FECRT using ivermectin in cattle. The sample size calculation method and classification framework presented here underpin the sample size recommendations provided in the upcoming FECRT WAAVP guidelines for detection of anthelmintic resistance in ruminants, horses, and swine, and have also been made freely available as open-source software via our website (https://www.fecrt.com).",
                "authors": [
                    {
                        "name": "Denwood M.J."
                    },
                    {
                        "name": "Kaplan R.M."
                    },
                    {
                        "name": "Levecke B."
                    },
                    {
                        "name": "McKendrick I.J."
                    },
                    {
                        "name": "Nielsen M.K."
                    },
                    {
                        "name": "Thamsborg S.M."
                    }
                ],
                "citationCount": 6,
                "date": "2023-02-01T00:00:00Z",
                "journal": "Veterinary Parasitology",
                "title": "A statistical framework for calculating prospective sample sizes and classifying efficacy results for faecal egg count reduction tests in ruminants, horses and swine"
            },
            "pmid": "36621042"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Experimental design and studies",
            "uri": "http://edamontology.org/topic_3678"
        },
        {
            "term": "Parasitology",
            "uri": "http://edamontology.org/topic_3302"
        },
        {
            "term": "Veterinary medicine",
            "uri": "http://edamontology.org/topic_3397"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}
