{
    "additionDate": "2017-12-18T00:14:59Z",
    "biotoolsCURIE": "biotools:inr-physchem",
    "biotoolsID": "inr-physchem",
    "credit": [
        {
            "email": "xiaoxuan0326@yahoo.com.cn",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.jci-bioinfo.cn/"
        }
    ],
    "description": "Wwo-level predictor. It can be used to identify an uncharacterized protein as nuclear receptor (NR) or non-NR according to its sequences information alone.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.jci-bioinfo.cn/iNR-PhysChem/ReadMe.htm"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "homepage": "http://www.jci-bioinfo.cn/iNR-PhysChem",
    "lastUpdate": "2018-12-10T12:58:58Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/inr-physchem-identifying-nuclear-receptors-and-their-subfamilies.html"
        }
    ],
    "name": "iNR-PhysChem",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0023505",
            "metadata": {
                "abstract": "Nuclear receptors (NRs) are one of the most abundant classes of transcriptional regulators in animals. They regulate diverse functions, such as homeostasis, reproduction, development and metabolism. Therefore, NRs are a very important target for drug development. Nuclear receptors form a superfamily of phylogenetically related proteins and have been subdivided into different subfamilies due to their domain diversity. In this study, a two-level predictor, called NR-2L, was developed that can be used to identify a query protein as a nuclear receptor or not based on its sequence information alone; if it is, the prediction will be automatically continued to further identify it among the following seven subfamilies: (1) thyroid hormone like (NR1), (2) HNF4-like (NR2), (3) estrogen like, (4) nerve growth factor IB-like (NR4), (5) fushi tarazu-F1 like (NR5), (6) germ cell nuclear factor like (NR6), and NR-2L knirps like (NR0). The identification was made by the Fuzzy K nearest neighbor (FK-NN) classifier based on the pseudo amino acid composition formed by incorporating various physicochemical and statistical features derived from the protein sequences, such as amino acid composition, dipeptide composition, complexity factor, and low-frequency Fourier spectrum components. As a demonstration, it was shown through some benchmark datasets derived from the NucleaRDB and UniProt with low redundancy that the overall success rates achieved by the jackknife test were about 93% and 89% in the first and second level, respectively. The high success rates indicate that the novel two-level predictor can be a useful vehicle for identifying NRs and their subfamilies. As a user-friendly web server, NR-2L is freel accessible at either http://icpr.jci.edu.cn/bioinfo/NR2L or http://www.jci-bioinfo.cn/NR2L. Each job submitted to NR-2L can contain up to 500 query protein sequences and be finished in less than 2 minutes. The less the number of query proteins is, the shorter the time will usually be. All the program codes for NR-2L are available for non-commercial purpose upon request. © 2011 Wang et al.",
                "authors": [
                    {
                        "name": "Chou K.-C."
                    },
                    {
                        "name": "Wang P."
                    },
                    {
                        "name": "Xiao X."
                    }
                ],
                "citationCount": 103,
                "date": "2011-08-19T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "NR-2l: A two-level predictor for identifying nuclear receptor subfamilies based on sequence-derived features"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Protein properties",
            "uri": "http://edamontology.org/topic_0123"
        },
        {
            "term": "Protein sites, features and motifs",
            "uri": "http://edamontology.org/topic_3510"
        },
        {
            "term": "Sequences",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}
