{
    "additionDate": "2021-01-18T12:19:56Z",
    "biotoolsCURIE": "biotools:sneakysnake",
    "biotoolsID": "sneakysnake",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "alserm@ethz.ch",
            "name": "Mohammed Alser",
            "typeEntity": "Person"
        },
        {
            "email": "calkan@cs.bilkent.edu.tr",
            "name": "Can Alkan",
            "typeEntity": "Person"
        },
        {
            "email": "omutlu@ethz.ch",
            "name": "Onur Mutlu",
            "typeEntity": "Person"
        }
    ],
    "description": "A Fast and Accurate Universal Genome Pre-Alignment Filter for CPUs, GPUs, and FPGAs.\n\nThe first and the only pre-alignment filtering algorithm that works efficiently and fast on modern CPU, FPGA, and GPU architectures. SneakySnake greatly (by more than two orders of magnitude) expedites sequence alignment calculation for both short (Illumina) and long (ONT and PacBio) reads.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "homepage": "https://github.com/CMU-SAFARI/SneakySnake",
    "language": [
        "VHDL"
    ],
    "lastUpdate": "2021-02-20T08:39:39Z",
    "license": "GPL-3.0",
    "name": "SneakySnake",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA1015",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: We introduce SneakySnake, a highly parallel and highly accurate pre-alignment filter that remarkably reduces the need for computationally costly sequence alignment. The key idea of SneakySnake is to reduce the approximate string matching (ASM) problem to the single net routing (SNR) problem in VLSI chip layout. In the SNR problem, we are interested in finding the optimal path that connects two terminals with the least routing cost on a special grid layout that contains obstacles. The SneakySnake algorithm quickly solves the SNR problem and uses the found optimal path to decide whether or not performing sequence alignment is necessary. Reducing the ASM problem into SNR also makes SneakySnake efficient to implement on CPUs, GPUs and FPGAs. Results: SneakySnake significantly improves the accuracy of pre-alignment filtering by up to four orders of magnitude compared to the state-of-the-art pre-alignment filters, Shouji, GateKeeper and SHD. For short sequences, SneakySnake accelerates Edlib (state-of-the-art implementation of Myers's bit-vector algorithm) and Parasail (state-of-the-art sequence aligner with a configurable scoring function), by up to 37.7× and 43.9× (>12× on average), respectively, with its CPU implementation, and by up to 413× and 689× (>400× on average), respectively, with FPGA and GPU acceleration. For long sequences, the CPU implementation of SneakySnake accelerates Parasail and KSW2 (sequence aligner of minimap2) by up to 979× (276.9× on average) and 91.7× (31.7× on average), respectively. As SneakySnake does not replace sequence alignment, users can still obtain all capabilities (e.g. configurable scoring functions) of the aligner of their choice, unlike existing acceleration efforts that sacrifice some aligner capabilities. Availabilityand implementation: https://github.com/CMU-SAFARI/SneakySnake.",
                "authors": [
                    {
                        "name": "Alkan C."
                    },
                    {
                        "name": "Alser M."
                    },
                    {
                        "name": "Gomez-Luna J."
                    },
                    {
                        "name": "Mutlu O."
                    },
                    {
                        "name": "Shahroodi T."
                    }
                ],
                "citationCount": 2,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "SneakySnake: A fast and accurate universal genome pre-alignment filter for CPUs, GPUs and FPGAs"
            },
            "pmid": "33315064"
        }
    ],
    "topic": [
        {
            "term": "ChIP-on-chip",
            "uri": "http://edamontology.org/topic_3179"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
