{
    "additionDate": "2021-01-18T11:17:02Z",
    "biotoolsCURIE": "biotools:seq-symrf",
    "biotoolsID": "seq-symrf",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ceszxy@mail.sysu.edu.cn",
            "name": "Xiaoyong Zou",
            "typeEntity": "Person"
        },
        {
            "email": "zhanchao8052@gdpu.edu.cn",
            "name": "Zhanchao Li",
            "typeEntity": "Person"
        }
    ],
    "description": "a random forest model predicts potential miRNA-disease associations based on information of sequences and clinical symptoms.\n\ndisease name.txt--339 diseases name including in our dataset.\n\nmiRNA name.txt--917 miRNAs name including in our dataset.\n\nMDA.mat-- a binary matrix that represents the known miRNA-disease association from HMDD3.0.\n\n(2)Run the Seq-SymRF.m to construct the RF model and test the performance.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                },
                {
                    "term": "Recombination detection",
                    "uri": "http://edamontology.org/operation_0451"
                }
            ]
        }
    ],
    "homepage": "https://github.com/LeeKamlong/Seq-SymRF",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-02-16T14:41:40Z",
    "name": "Seq-SymRF",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1038/S41598-020-75005-9",
            "metadata": {
                "abstract": "© 2020, The Author(s).Increasing evidence indicates that miRNAs play a vital role in biological processes and are closely related to various human diseases. Research on miRNA-disease associations is helpful not only for disease prevention, diagnosis and treatment, but also for new drug identification and lead compound discovery. A novel sequence- and symptom-based random forest algorithm model (Seq-SymRF) was developed to identify potential associations between miRNA and disease. Features derived from sequence information and clinical symptoms were utilized to characterize miRNA and disease, respectively. Moreover, the clustering method by calculating the Euclidean distance was adopted to construct reliable negative samples. Based on the fivefold cross-validation, Seq-SymRF achieved the accuracy of 98.00%, specificity of 99.43%, sensitivity of 96.58%, precision of 99.40% and Matthews correlation coefficient of 0.9604, respectively. The areas under the receiver operating characteristic curve and precision recall curve were 0.9967 and 0.9975, respectively. Additionally, case studies were implemented with leukemia, breast neoplasms and hsa-mir-21. Most of the top-25 predicted disease-related miRNAs (19/25 for leukemia; 20/25 for breast neoplasms) and 15 of top-25 predicted miRNA-related diseases were verified by literature and dbDEMC database. It is anticipated that Seq-SymRF could be regarded as a powerful high-throughput virtual screening tool for drug research and development. All source codes can be downloaded from https://github.com/LeeKamlong/Seq-SymRF.",
                "authors": [
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Chen X."
                    },
                    {
                        "name": "Huang Q."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Xie Y."
                    },
                    {
                        "name": "Dai Z."
                    },
                    {
                        "name": "Zou X."
                    },
                    {
                        "name": "Li Z."
                    }
                ],
                "citationCount": 1,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "Seq-SymRF: a random forest model predicts potential miRNA-disease associations based on information of sequences and clinical symptoms"
            },
            "pmcid": "PMC7578641",
            "pmid": "33087810"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        }
    ]
}