{
    "accessibility": "Open access",
    "additionDate": "2019-05-26T08:10:12Z",
    "biotoolsCURIE": "biotools:EMBL2checklists",
    "biotoolsID": "EMBL2checklists",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "mi.gruenstaeudl@gmail.com",
            "name": "Michael Gruenstaeudl",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Python package to facilitate the user-friendly submission of plant and fungal DNA barcoding sequences to ENA. Converts EMBL- or GenBank-formatted flat files to submission-ready checklists for submission to ENA via the interactive Webin submission system.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Community profiling",
                    "uri": "http://edamontology.org/operation_3200"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                }
            ]
        }
    ],
    "homepage": "https://github.com/michaelgruenstaeudl/EMBL2checklists",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:22Z",
    "license": "BSD-3-Clause",
    "maturity": "Mature",
    "name": "EMBL2checklists",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0210347",
            "metadata": {
                "abstract": "© 2019 Gruenstaeudl, Hartmaring. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Background The submission of DNA sequences to public sequence databases is an essential, but insufficiently automated step in the process of generating and disseminating novel DNA sequence data. Despite the centrality of database submissions to biological research, the range of available software tools that facilitate the preparation of sequence data for database submissions is low, especially for sequences generated via plant and fungal DNA barcoding. Current submission procedures can be complex and prohibitively time expensive for any but a small number of input sequences. A user-friendly software tool is needed that streamlines the file preparation for database submissions of DNA sequences that are commonly generated in plant and fungal DNA barcoding. Methods A Python package was developed that converts DNA sequences from the common EMBL and GenBank flat file formats to submission-ready, tab-delimited spreadsheets (so-called ‘checklists’) for a subsequent upload to the annotated sequence section of the European Nucleotide Archive (ENA). The software tool, titled ‘EMBL2checklists’, automatically converts DNA sequences, their annotation features, and associated metadata into the idiosyncratic format of marker-specific ENA checklists and, thus, generates files that can be uploaded via the interactive Webin submission system of ENA. Results EMBL2checklists provides a simple, platform-independent tool that automates the conversion of common DNA barcoding sequences into easily editable spreadsheets that require no further processing but their upload to ENA via the interactive Webin submission system. The software is equipped with an intuitive graphical as well as an efficient command-line interface for its operation. The utility of the software is illustrated by its application in four recent investigations, including plant phylogenetic and fungal metagenomic studies. Discussion EMBL2checklists bridges the gap between common software suites for DNA sequence assembly and annotation and the interactive data submission process of ENA. It represents an easy-to-use solution for plant and fungal biologists without bioinformatics expertise to generate submission-ready checklists from common DNA sequence data. It allows the post-processing of checklists as well as work-sharing during the submission process and solves a critical bottleneck in the effort to increase participation in public data sharing.",
                "authors": [
                    {
                        "name": "Gruenstaeudl M."
                    },
                    {
                        "name": "Hartmaring Y."
                    }
                ],
                "citationCount": 5,
                "date": "2019-01-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "EMBL2Checklists: A Python package to facilitate the user-friendly submission of plant and fungal DNA barcoding sequences to ENA"
            },
            "pmcid": "PMC6328100",
            "pmid": "30629718",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ],
    "validated": 1
}
