{
    "additionDate": "2018-07-01T13:38:54Z",
    "biotoolsCURIE": "biotools:omicsnet",
    "biotoolsID": "omicsnet",
    "credit": [
        {
            "email": "guangyan.zhou@mail.mcgill.ca",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "jeff.xia@mcgill.ca",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Network visual analytics system for creating and exploring relationships among genes, proteins, miRNAs, metabolites or transcription factors in three-dimensional (3D) space.",
    "documentation": [
        {
            "type": [
                "Training material"
            ],
            "url": "http://www.omicsnet.ca/OmicsNet/faces/docs/Tutorial.xhtml"
        },
        {
            "type": [
                "General"
            ],
            "url": "http://www.omicsnet.ca/OmicsNet/faces/docs/Overview.xhtmlv"
        },
        {
            "type": [
                "General"
            ],
            "url": "http://www.omicsnet.ca/OmicsNet/faces/docs/FaqView.xhtml"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                }
            ]
        }
    ],
    "homepage": "http://www.omicsnet.ca/OmicsNet/",
    "language": [
        "JavaScript",
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "OmicsNet",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.1093/nar/gky510",
            "metadata": {
                "abstract": "© The Author(s) 2018. Published by Oxford University Press on behalf of Nucleic Acids Research.Biological networks play increasingly important roles in omics data integration and systems biology. Over the past decade, many excellent tools have been developed to support creation, analysis and visualization of biological networks. However, important limitations remain: most tools are standalone programs, the majority of them focus on protein-protein interaction (PPI) or metabolic networks, and visualizations often suffer from €hairball' effects when networks become large. To help address these limitations, we developed OmicsNet - a novel web-based tool that allows users to easily create different types of molecular interaction networks and visually explore them in a three-dimensional (3D) space. Users can upload one or multiple lists of molecules of interest (genes/proteins, microRNAs, transcription factors or metabolites) to create and merge different types of biological networks. The 3D network visualization system was implemented using the powerful Web Graphics Library (WebGL) technology that works natively in most major browsers. OmicsNet supports force-directed layout, multi-layered perspective layout, as well as spherical layout to help visualize and navigate complex networks. A rich set of functions have been implemented to allow users to perform coloring, shading, topology analysis, and enrichment analysis. OmicsNet is freely available at http://www.omicsnet.ca.",
                "authors": [
                    {
                        "name": "Zhou G."
                    },
                    {
                        "name": "Xia J."
                    }
                ],
                "citationCount": 50,
                "date": "2018-07-02T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "OmicsNet: A web-based tool for creation and visual analysis of biological networks in 3D space"
            },
            "pmid": "29878180"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}