{
    "accessibility": "Open access",
    "additionDate": "2024-01-02T16:50:55.385559Z",
    "biotoolsCURIE": "biotools:amebas",
    "biotoolsID": "amebas",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "danieldamineli@gmail.com",
            "name": "Daniel S C Damineli",
            "typeEntity": "Person"
        },
        {
            "name": "Maria Teresa Portes",
            "typeEntity": "Person"
        },
        {
            "name": "Rafael Badain",
            "typeEntity": "Person"
        }
    ],
    "description": "Automatic Midline Extraction and Background Subtraction of Ratiometric Fluorescence Time-Lapses of Polarized Single Cells.\nAMEBaS is a new computer program that has been developed to automate the study of cells with polarity and is based in pollen tube growth and ion dynamics data. This program uses a three-step process to analyze fluorescent markers in cells with polarity.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Cell migration analysis",
                    "uri": "http://edamontology.org/operation_3446"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/badain/amebas.git",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-01-02T16:50:55.388410Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://colab.research.google.com/github/badain/amebas/blob/main/AMEBAS_Colab.ipynb"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/badain/amebas"
        }
    ],
    "name": "AMEBaS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3791/64857",
            "metadata": {
                "abstract": "Cell polarity is a macroscopic phenomenon established by a collection of spatially concentrated molecules and structures that culminate in the emergence of specialized domains at the subcellular level. It is associated with developing asymmetric morphological structures that underlie key biological functions such as cell division, growth, and migration. In addition, the disruption of cell polarity has been linked to tissue-related disorders such as cancer and gastric dysplasia. Current methods to evaluate the spatiotemporal dynamics of fluorescent reporters in individual polarized cells often involve manual steps to trace a midline along the cells' major axis, which is time consuming and prone to strong biases. Furthermore, although ratiometric analysis can correct the uneven distribution of reporter molecules using two fluorescence channels, background subtraction techniques are frequently arbitrary and lack statistical support. This manuscript introduces a novel computational pipeline to automate and quantify the spatiotemporal behavior of single cells using a model of cell polarity: pollen tube/ root hair growth and cytosolic ion dynamics. A three-step algorithm was developed to process ratiometric images and extract a quantitative representation of intracellular dynamics and growth. The first step segments the cell from the background, producing a binary mask through a thresholding technique in the pixel intensity space. The second step traces a path through the midline of the cell through a skeletonization operation. Finally, the third step provides the processed data as a ratiometric timelapse and yields a ratiometric kymograph (i.e., a 1D spatial profile through time). Data from ratiometric images acquired with genetically encoded fluorescent reporters from growing pollen tubes were used to benchmark the method. This pipeline allows for faster, less biased, and more accurate representation of the spatiotemporal dynamics along the midline of polarized cells, thus advancing the quantitative toolkit available to investigate cell polarity. The AMEBaS Python source code is available at: https:// github.com/badain/amebas.git.",
                "authors": [
                    {
                        "name": "Badain R."
                    },
                    {
                        "name": "Buratti S."
                    },
                    {
                        "name": "Cesar R.M."
                    },
                    {
                        "name": "Damineli D.S.C."
                    },
                    {
                        "name": "Feijo J."
                    },
                    {
                        "name": "Portes M.T."
                    },
                    {
                        "name": "Tortora G."
                    },
                    {
                        "name": "de Oliveira H.N."
                    }
                ],
                "date": "2023-06-01T00:00:00Z",
                "journal": "Journal of Visualized Experiments",
                "title": "AMEBaS: Automatic Midline Extraction and Background Subtraction of Ratiometric Fluorescence Time-Lapses of Polarized Single Cells"
            },
            "pmid": "37427934"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Developmental biology",
            "uri": "http://edamontology.org/topic_3064"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}
