{
    "accessibility": "Open access",
    "additionDate": "2023-08-17T09:24:28.850621Z",
    "biotoolsCURIE": "biotools:ssm_mat",
    "biotoolsID": "ssm_mat",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "mf.keast@gmail.com",
            "name": "Meghan Keast",
            "orcidid": "https://orcid.org/0000-0003-4152-396X",
            "typeEntity": "Person"
        }
    ],
    "description": "This project provides a freely accessible three-dimensional statistical shape model (SSM) of the tibia, the MATLAB scripts for generating a SSM and the segmented surface models of the cortical and trabecular bone.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Principal component analysis",
                    "uri": "http://edamontology.org/operation_3960"
                },
                {
                    "term": "Statistical modelling",
                    "uri": "http://edamontology.org/operation_3664"
                }
            ]
        }
    ],
    "homepage": "https://simtk.org/projects/ssm_tibia",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2024-11-24T14:43:48.672758Z",
    "license": "CC-BY-4.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://figshare.com/articles/dataset/Statistical_Shape_Model_of_the_Tibia_/20454462/3"
        }
    ],
    "name": "SSM",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.7717/peerj.14708",
            "metadata": {
                "abstract": "Background: Variation in tibia geometry is a risk factor for tibial stress fractures. Geometric variability in bones is often quantified using statistical shape modelling. Statistical shape models (SSM) offer a method to assess three-dimensional variation of structures and identify the source of variation. Although SSM have been used widely to assess long bones, there is limited open-source datasets of this kind. Overall, the creation of SSM can be an expensive process, that requires advanced skills. A publicly available tibia shape model would be beneficial as it enables researchers to improve skills. Further, it could benefit health, sport and medicine with the potential to assess geometries suitable for medical equipment, and aid in clinical diagnosis. This study aimed to: (i) quantify tibial geometry using a SSM; and (ii) provide the SSM and associated code as an open-source dataset. Methods: Lower limb computed tomography (CT) scans from the right tibia-fibula of 30 cadavers (male n = 20, female n = 10) were obtained from the New Mexico Decedent Image Database. Tibias were segmented and reconstructed into both cortical and trabecular sections. Fibulas were segmented as a singular surface. The segmented bones were used to develop three SSM of the: (i) tibia; (ii) tibia-fibula; and (iii) cortical-trabecular. Principal component analysis was applied to obtain the three SSM, with the principal components that explained 95% of geometric variation retained. Results: Overall size was the main source of variation in all three models accounting for 90.31%, 84.24% and 85.06%. Other sources of geometric variation in the tibia surface models included overall and midshaft thickness; prominence and size of the condyle plateau, tibial tuberosity, and anterior crest; and axial torsion of the tibial shaft. Further variations in the tibia-fibula model included midshaft thickness of the fibula; fibula head position relative to the tibia; tibia and fibula anterior-posterior curvature; fibula posterior curvature; tibia plateau rotation; and interosseous width. The main sources of variation in the cortical-trabecular model other than general size included variation in the medulla cavity diameter; cortical thickness; anterior-posterior shaft curvature; and the volume of trabecular bone in the proximal and distal ends of the bone. Conclusion: Variations that could increase the risk of tibial stress injury were observed, these included general tibial thickness, midshaft thickness, tibial length and medulla cavity diameter (indicative of cortical thickness). Further research is needed to better understand the effect of these tibial-fibula shape characteristics on tibial stress and injury risk. This SSM, the associated code, and three use examples for the SSM have been provided in an open-source dataset. The developed tibial surface models and statistical shape model will be made available for use at: https://simtk. org/projects/ssm_tibia.",
                "authors": [
                    {
                        "name": "Bonacci J."
                    },
                    {
                        "name": "Fox A."
                    },
                    {
                        "name": "Keast M."
                    }
                ],
                "citationCount": 4,
                "date": "2023-02-16T00:00:00Z",
                "journal": "PeerJ",
                "title": "Geometric variation of the human tibia-fibula: a public dataset of tibia-fibula surface meshes and statistical shape model"
            },
            "pmcid": "PMC9939022",
            "pmid": "36811007",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ]
}
