{
    "additionDate": "2021-01-18T07:37:22Z",
    "biotoolsCURIE": "biotools:dlagm",
    "biotoolsID": "dlagm",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "haydar.demirhan@rmit.edu.au",
            "name": "Haydar Demirhan",
            "orcidid": "https://orcid.org/0000-0002-8565-4710",
            "typeEntity": "Person"
        }
    ],
    "description": "dLagM is a R package for distributed lag models and autoregressive distributed lag (ARDL) bounds testing to explore the short and long-run relationships between dependent and independent time series. Distributed lag models constitute a large class of time series regression models including the ARDL models used for cointegration analysis.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/package=dLagM",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-01T11:02:53Z",
    "license": "GPL-3.0",
    "name": "dLagM",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0228812",
            "metadata": {
                "abstract": "© 2020 Haydar Demirhan. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.In this article, we introduce the R package dLagM for the implementation of distributed lag models and autoregressive distributed lag (ARDL) bounds testing to explore the short and long-run relationships between dependent and independent time series. Distributed lag models constitute a large class of time series regression models including the ARDL models used for cointegration analysis. The dLagM package provides a user-friendly and flexible environment for the implementation of the finite linear, polynomial, Koyck, and ARDL models and ARDL bounds cointegration test. Particularly, in this article, a new search algorithm to specify the orders of ARDL bounds testing is proposed and implemented by the dLagM package. Main features and input/output structures of the dLagM package and use of the proposed algorithm are illustrated over the datasets included in the package. Features of dLagM package are benchmarked with some mainstream software used to implement distributed lag models and ARDLs.",
                "authors": [
                    {
                        "name": "Demirhan H."
                    }
                ],
                "citationCount": 3,
                "date": "2020-02-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "DLAGM: An R package for distributed lag models and ARDL bounds testing"
            },
            "pmcid": "PMC7034805",
            "pmid": "32084162"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}