{
    "accessibility": "Open access",
    "additionDate": "2019-05-07T06:32:22Z",
    "biotoolsCURIE": "biotools:GeneYenta",
    "biotoolsID": "GeneYenta",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "geneyenta_admin@geneyenta.cmmt.ubc.ca",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "zach.maurer@gmail.com",
            "name": "Zach Maurer",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "email": "dave@cmmt.ubc.ca",
            "name": "David Arenillas",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        }
    ],
    "description": "Tool for clinicians to make connections to share genetic data by being matched using phenotype data. It aims to create a portal for clinicians to enter phenotypic case data for individuals who have had exome sequencing without a genetic diagnosis.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/wassermanlab/GeneYenta"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Exome assembly",
                    "uri": "http://edamontology.org/operation_3229"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://geneyenta.com/accounts/home/",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2020-06-16T10:55:22Z",
    "maturity": "Mature",
    "name": "GeneYenta",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1002/humu.22772",
            "metadata": {
                "abstract": "© 2015 WILEY PERIODICALS, INC. Advances in next-generation sequencing (NGS) technologies have helped reveal causal variants for genetic diseases. In order to establish causality, it is often necessary to compare genomes of unrelated individuals with similar disease phenotypes to identify common disrupted genes. When working with cases of rare genetic disorders, finding similar individuals can be extremely difficult. We introduce a web tool, GeneYenta, which facilitates the matchmaking process, allowing clinicians to coordinate detailed comparisons for phenotypically similar cases. Importantly, the system is focused on phenotype annotation, with explicit limitations on highly confidential data that create barriers to participation. The procedure for matching of patient phenotypes, inspired by online dating services, uses an ontology-based semantic case matching algorithm with attribute weighting. We evaluate the capacity of the system using a curated reference data set and 19 clinician entered cases comparing four matching algorithms. We find that the inclusion of clinician weights can augment phenotype matching. We introduce a web tool, GeneYenta, which facilitates rare disease diagnostics by allowing clinicians to compare patient phenotypes online in order to exchange genomic data offline. The procedure for matching patient phenotypes, inspired by online dating services, uses an ontology-based semantic case matching algorithm with attribute weighting. We evaluate our system against three other matching algorithms using a curated reference data set and 19 clinician entered cases, and find that the inclusion of clinician weights can augment phenotype matching.",
                "authors": [
                    {
                        "name": "Gottlieb M.M."
                    },
                    {
                        "name": "Arenillas D.J."
                    },
                    {
                        "name": "Maithripala S."
                    },
                    {
                        "name": "Maurer Z.D."
                    },
                    {
                        "name": "Tarailo-Graovac M."
                    },
                    {
                        "name": "Armstrong L."
                    },
                    {
                        "name": "Patel M."
                    },
                    {
                        "name": "van Karnebeek C."
                    },
                    {
                        "name": "Wasserman W.W."
                    }
                ],
                "citationCount": 11,
                "date": "2015-04-01T00:00:00Z",
                "journal": "Human Mutation",
                "title": "GeneYenta: A phenotype-based rare disease case matching tool based on online dating algorithms for the acceleration of exome interpretation"
            },
            "pmid": "25703386"
        }
    ],
    "toolType": [
        "Web API",
        "Web application"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        }
    ]
}