{
    "additionDate": "2017-02-14T09:34:52Z",
    "biotoolsCURIE": "biotools:e-lea3d",
    "biotoolsID": "e-lea3d",
    "credit": [
        {
            "email": "douguet@ipmc.cnrs.fr",
            "name": "Dominique Douguet",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "e-LEA3D web server performs computer aided drug design from molecular fragments. Several design tools are included.",
    "documentation": [
        {
            "type": [
                "Terms of use"
            ],
            "url": "http://chemoinfo.ipmc.cnrs.fr/Terms_of_Use.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Design",
                    "uri": "http://edamontology.org/operation_2430"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.ipmc.cnrs.fr/lea.html",
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "e-LEA3D",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "e-LEA3D web server integrates three complementary tools to perform computer-aided drug design based on molecular fragments. In drug discovery projects, there is a considerable interest in identifying novel and diverse molecular scaffolds to enhance chances of success. The de novo drug design tool is used to invent new ligands to optimize a user-specified scoring function. The composite scoring function includes both structureand ligand-based evaluations. The de novo approach is an alternative to a blind virtual screening of large compound collections. A heuristic based on a genetic algorithm rapidly finds which fragments or combination of fragments fit a QSAR model or the binding site of a protein. While the approach is ideally suited for scaffold-hopping, this module also allows a scan for possible substituents to a user-specified scaffold. The second tool offers a traditional virtual screening and filtering of an uploaded library of compounds. The third module addresses the combinatorial library design that is based on a user-drawn scaffold and reactants coming, for example, from a chemical supplier. The e-LEA3D server is available at: http://bioinfo.ipmc.cnrs.fr/lea.html. © The Author(s) 2010. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Douguet D."
                    }
                ],
                "citationCount": 40,
                "date": "2010-05-05T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "e-LEA3D: A computational-aided drug design web server"
            },
            "pmid": "20444867"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        }
    ],
    "validated": 1
}