
{
    "credit": [
        {
            "email": "raoalka@imtech.res.in",
            "name": "Dr. Alka Rao",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Literature search",
                    "uri": "http://edamontology.org/operation_0305"
                },
                {
                    "term": "Protein model validation",
                    "uri": "http://edamontology.org/operation_0321"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java",
            "C#"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Literature and language",
                "uri": "http://edamontology.org/topic_3068"
            },
            {
                "term": "Model organisms",
                "uri": "http://edamontology.org/topic_0621"
            },
            {
                "term": "Model organisms",
                "uri": "http://edamontology.org/topic_0621"
            },
            {
                "term": "Small molecules",
                "uri": "http://edamontology.org/topic_0154"
            },
            {
                "term": "Experimental design and studies",
                "uri": "http://edamontology.org/topic_3678"
            }
        ]
    },
    "publication": [
        {
            "abstract": "ProGlycProt (http://www.proglycprot.org/) is an open access, manually curated, comprehensive repository of bacterial and archaeal glycoproteins with at least one experimentally validated glycosite (glycosylated residue). To facilitate maximum information at one point, the database is arranged under two sections: (i) ProCGP-the main data section consisting of 95 entries with experimentally characterized glycosites and (ii) ProUGP-a supplementary data section containing 245 entries with experimentally identified glycosylation but uncharacterized glycosites. Every entry in the database is fully cross-referenced and enriched with available published information about source organism, coding gene, protein, glycosites, glycosylation type, attached glycan, associated oligosaccharyl/glycosyl transferases (OSTs/GTs), supporting references, and applicable additional information. Interestingly, ProGlycProt contains as many as 174 entries for which information is unavailable or the characterized glycosites are unannotated in Swiss-Prot release 2011-07. The website supports a dedicated structure gallery of homology models and crystal structures of characterized glycoproteins in addition to two new tools developed in view of emerging information about prokaryotic sequons (conserved sequences of amino acids around glycosites) that are never or rarely seen in eukaryotic glycoproteins. ProGlycProt provides an extensive compilation of experimentally identified glycosites (334) and glycoproteins (340) of prokaryotes that could serve as an information resource for research and technology applications in glycobiology. © The Author(s) 2011. Published by Oxford University Press.",
            "authors": [
                "Bhat A.H.",
                "Mondal H.",
                "Chauhan J.S.",
                "Raghava G.P.S.",
                "Methi A.",
                "Rao A."
            ],
            "cit_count": 16,
            "journal": "Nucleic Acids Research",
            "pmid": "22039152",
            "title": "ProGlycProt: A repository of experimentally characterized prokaryotic glycoproteins",
            "year": "2012-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:proglycprot",
        "biotoolsID": "proglycprot",
        "description": "A manually curated, comprehensive repository of experimentally characterized bacterial and archaeal glycoproteins, generated from an exhaustive literature search.",
        "homepage": "http://www.proglycprot.org/",
        "name": "ProGlycProt"
    }
}