{
    "name": "RFCoil", 
    "description": "A predictor that could distinguish parallel dimeric and trimeric coiled coils. It uses the most efficient and non-redundant amino acid indices combined with the state-of-the-art machine learning method Random Forest to make the prediction.", 
    "homepage": "http://protein.cau.edu.cn/RFCoil/", 
    "biotoolsID": "rfcoil", 
    "biotoolsCURIE": "biotools:rfcoil", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0474", 
                    "term": "Protein structure prediction"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0082", 
            "term": "Structure prediction"
        }, 
        {
            "uri": "http://edamontology.org/topic_0166", 
            "term": "Protein structural motifs and surfaces"
        }, 
        {
            "uri": "http://edamontology.org/topic_0736", 
            "term": "Protein folds and structural domains"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "R", 
        "Perl"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/rfcoil-predictor-of-parallel-dimeric-and-trimeric-coiled-coils.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://protein.cau.edu.cn/RFCoil/index.php?page=help", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "25435395", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Computational characterization of parallel dimeric and trimeric coiled-coils using effective amino acid indices", 
                "abstract": "© The Royal Society of Chemistry 2015. The coiled-coil, which consists of two or more α-helices winding around each other, is a ubiquitous and the most frequently observed protein-protein interaction motif in nature. The coiled-coil is known for its straightforward heptad repeat pattern and can be readily recognized based on protein primary sequences, exhibiting a variety of oligomer states and topologies. Due to the stable interaction formed between their α-helices, coiled-coils have been under close scrutiny to design novel protein structures for potential applications in the fields of material science, synthetic biology and medicine. However, their broader application requires an in-depth and systematic analysis of the sequence-to-structure relationship of coiled-coil folding and oligomeric formation. In this article, we propose a new oligomerization state predictor, termed as RFCoil, which exploits the most useful and non-redundant amino acid indices combined with the machine learning algorithm - random forest (RF) - to predict the oligomeric states of coiled-coil regions. Benchmarking experiments show that RFCoil achieves an AUC (area under the ROC curve) of 0.849 on the 10-fold cross-validation test using the training dataset and 0.855 on the independent test using the validation dataset, respectively. Performance comparison results indicate that RFCoil outperforms the four existing predictors LOGICOIL, PrOCoil, SCORER 2.0 and Multicoil2. Furthermore, we extract a number of predominant rules from the trained RF model that underlie the oligomeric formation. We also present two case studies to illustrate the applicability of the extracted rules to the prediction of coiled-coil oligomerization state. The RFCoil web server, source codes and datasets are freely available for academic users at http://protein.cau.edu.cn/RFCoil/.", 
                "date": "2015-02-01T00:00:00Z", 
                "citationCount": 8, 
                "authors": [
                    {
                        "name": "Li C."
                    }, 
                    {
                        "name": "Wang X.-F."
                    }, 
                    {
                        "name": "Chen Z."
                    }, 
                    {
                        "name": "Zhang Z."
                    }, 
                    {
                        "name": "Song J."
                    }
                ], 
                "journal": "Molecular BioSystems"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": "shi_ping_yang@163.com", 
            "url": "http://protein.cau.edu.cn/zzdlab/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T18:57:47Z", 
    "lastUpdate": "2018-12-10T12:58:50Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 1, 
    "elixir_badge": 0
}