{
    "additionDate": "2017-12-18T00:05:03Z",
    "biotoolsCURIE": "biotools:cancerpred",
    "biotoolsID": "cancerpred",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.imtech.res.in/raghava/cancer_pred/team.html"
        }
    ],
    "description": "CancerPred is a web-server specially trained for predicting the Cancerlectins. Lectins are important biomolecules and play important functions in many processes e.g cell to cell recognition, host-pathogen interactions etc. In the same way Cancerlectins are those lectins which are known to play roles in cancer metastasis and tumor progress, oncogenesis etc. CancerPred is mainly designed for distinguishing Cancerlectins from Non-cancer lectins.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://crdd.osdd.net/raghava/cancer_pred/help.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "homepage": "http://www.imtech.res.in/raghava/cancer_pred/",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/cancerpred-prediction-of-cancer-lectins.html"
        }
    ],
    "name": "CancerPred",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1756-0500-4-237",
            "metadata": {
                "abstract": "Background: Predicting the function of a protein is one of the major challenges in the post-genomic era where a large number of protein sequences of unknown function are accumulating rapidly. Lectins are the proteins that specifically recognize and bind to carbohydrate moieties present on either proteins or lipids. Cancerlectins are those lectins that play various important roles in tumor cell differentiation and metastasis. Although the two types of proteins are linked, still there is no computational method available that can distinguish cancerlectins from the large pool of non-cancerlectins. Hence, it is imperative to develop a method that can distinguish between cancer and non-cancerlectins. Results: All the models developed in this study are based on a non-redundant dataset containing 178 cancerlectins and 226 non-cancerlectins in which no two sequences have more than 50% sequence similarity. We have applied the similarity search based technique, i.e. BLAST, and achieved a maximum accuracy of 43.25%. The amino acids compositional analysis have shown that certain residues (e.g. Leucine, Proline) were preferred in cancerlectins whereas some other (e.g. Asparatic acid, Asparagine) were preferred in non-cancerlectins. It has been found that the PROSITE domain \"Crystalline beta gamma\" was abundant in cancerlectins whereas domains like \"SUEL-type lectin domain\" were found mainly in non-cancerlectins. An SVM-based model has been developed to differentiate between the cancer and non-cancerlectins which achieved a maximum Matthew's correlation coefficient (MCC) value of 0.32 with an accuracy of 64.84%, using amino acid compositions. We have developed a model based on dipeptide compositions which achieved an MCC value of 0.30 with an accuracy of 64.84%. Thereafter, we have developed models based on split compositions (2 and 4 parts) and achieved an MCC value of 0.31, 0.32 with accuracies of 65.10% and 66.09%, respectively. An SVM model based on Position Specific Scoring Matrix (PSSM), generated by PSI-BLAST, was developed and achieved an MCC value of 0.36 with an accuracy of 68.34%. Finally, we have integrated the PROSITE domain information with PSSM and developed an SVM model that has achieved an MCC value of 0.38 with 69.09% accuracy. Conclusion: BLAST has been found inefficient to distinguish between cancer and non-cancerlectins. We analyzed the protein sequences of cancer and non-cancerlectins and identified interesting patterns. We have been able to identify PROSITE domains that are preferred in cancer and non-cancerlectins and thus provided interesting insights into the two types of proteins. The method developed in this study will be useful for researchers studying cancerlectins, lectins and cancer biology. The web-server based on the above study, is available at http://www.imtech.res.in/ raghava/cancer-pred/. © 2011 Raghava et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Chauhan J.S."
                    },
                    {
                        "name": "Kumar R."
                    },
                    {
                        "name": "Panwar B."
                    },
                    {
                        "name": "Raghava G.P."
                    }
                ],
                "citationCount": 20,
                "date": "2011-07-26T00:00:00Z",
                "journal": "BMC Research Notes",
                "title": "Analysis and prediction of cancerlectins using evolutionary and domain information"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Cancer",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Interactions",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}
