{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2021-01-18T07:59:47Z",
    "biotoolsCURIE": "biotools:disnet",
    "biotoolsID": "disnet",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "alejandro.rg@upm.es",
            "name": "Alejandro Rodríguez-González",
            "typeEntity": "Person"
        }
    ],
    "description": "DISNET is a framework for extracting phenotypic disease information from public sources.",
    "documentation": [
        {
            "type": [
                "API documentation"
            ],
            "url": "http://disnet.ctb.upm.es/apis/disnet"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Information extraction",
                    "uri": "http://edamontology.org/operation_3907"
                }
            ]
        }
    ],
    "homepage": "http://disnet.ctb.upm.es/",
    "lastUpdate": "2021-03-01T09:35:36Z",
    "name": "DISNET",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.7717/PEERJ.8580",
            "metadata": {
                "abstract": "© 2020 PeerJ Inc.. All rights reserved.Background. Within the global endeavour of improving population health, one major challenge is the identification and integration of medical knowledge spread through several information sources. The creation of a comprehensive dataset of diseases and their clinical manifestations based on information from public sources is an interesting approach that allows one not only to complement and merge medical knowledge but also to increase it and thereby to interconnect existing data and analyse and relate diseases to each other. In this paper, we present DISNET (http://disnet.ctb.upm.es/), a web-based system designed to periodically extract the knowledge from signs and symptoms retrieved from medical databases, and to enable the creation of customisable disease networks. Methods. We here present the main features of the DISNET system. We describe how information on diseases and their phenotypic manifestations is extracted from Wikipedia and PubMed websites; specifically, texts from these sources are processed through a combination of text mining and natural language processing techniques. Results. We further present the validation of our system on Wikipedia and PubMed texts, obtaining the relevant accuracy. The final output includes the creation of a comprehensive symptoms-disease dataset, shared (free access) through the system's API. We finally describe, with some simple use cases, how a user can interact with it and extract information that could be used for subsequent analyses. Discussion. DISNET allows retrieving knowledge about the signs, symptoms and diagnostic tests associated with a disease. It is not limited to a specific category (all the categories that the selected sources of information offer us) and clinical diagnosis terms. It further allows to track the evolution of those terms through time, being thus an opportunity to analyse and observe the progress of human knowledge on diseases. We further discussed the validation of the system, suggesting that it is good enough to be used to extract diseases and diagnostically-relevant terms. At the same time, the evaluation also revealed that improvements could be introduced to enhance the system's reliability.",
                "authors": [
                    {
                        "name": "Del Valle E.P.G."
                    },
                    {
                        "name": "Lagunes-Garcia G."
                    },
                    {
                        "name": "Menasalvas-Ruiz E."
                    },
                    {
                        "name": "Prieto-Santamaria L."
                    },
                    {
                        "name": "Rodriguez-Gonzalez A."
                    },
                    {
                        "name": "Zanin M."
                    }
                ],
                "citationCount": 7,
                "date": "2020-02-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "DISNET: A framework for extracting phenotypic disease information from public sources"
            },
            "pmcid": "PMC7032061",
            "pmid": "32110491"
        }
    ],
    "toolType": [
        "Web API",
        "Web application"
    ],
    "topic": [
        {
            "term": "Cardiology",
            "uri": "http://edamontology.org/topic_3335"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
