{
    "additionDate": "2021-11-29T11:00:17.378816Z",
    "biotoolsCURIE": "biotools:roseq",
    "biotoolsID": "roseq",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "debarka@iiitd.ac.in",
            "name": "Debarka Sengupta",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "ROSeq is a rank based approach to modeling gene expression with filtered and normalized read count matrix. ROSeq takes filtered and normalized read matrix and cell-annotation/condition as input and determines the differentially expressed genes between the contrasting groups of single cells. One of the input parameters is the number of cores to be used.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://www.bioconductor.org/packages/release/bioc/html/ROSeq.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-11-29T11:02:40.502693Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/krishan57gupta/ROSeq/issues"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/krishan57gupta/ROSeq"
        }
    ],
    "name": "ROSeq",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1101/GR.267070.120",
            "metadata": {
                "abstract": "© 2021 Gupta et al.Systematic delineation of complex biological systems is an ever-challenging and resource-intensive process. Single-cell transcriptomics allows us to study cell-to-cell variability in complex tissues at an unprecedented resolution. Accurate modeling of gene expression plays a critical role in the statistical determination of tissue-specific gene expression patterns. In the past few years, considerable efforts have been made to identify appropriate parametric models for single-cell expression data. The zero-inflated version of Poisson/negative binomial and log-normal distributions have emerged as the most popular alternatives owing to their ability to accommodate high dropout rates, as commonly observed in single-cell data. Although the majority of the parametric approaches directly model expression estimates, we explore the potential of modeling expression ranks, as robust surrogates for transcript abundance. Here we examined the performance of the discrete generalized beta distribution (DGBD) on real data and devised a Wald-type test for comparing gene expression across two phenotypically divergent groups of single cells. We performed a comprehensive assessment of the proposed method to understand its advantages compared with some of the existing best-practice approaches. We concluded that besides striking a reasonable balance between Type I and Type II errors, ROSeq, the proposed differential expression test, is exceptionally robust to expression noise and scales rapidly with increasing sample size. For wider dissemination and adoption of the method, we created an R package called ROSeq and made it available on the Bioconductor platform.",
                "authors": [
                    {
                        "name": "Ahuja G."
                    },
                    {
                        "name": "Bandyopadhyay S."
                    },
                    {
                        "name": "Biswas A."
                    },
                    {
                        "name": "Ghosh A."
                    },
                    {
                        "name": "Greene C."
                    },
                    {
                        "name": "Gupta K."
                    },
                    {
                        "name": "Hukari K."
                    },
                    {
                        "name": "Lalit M."
                    },
                    {
                        "name": "Maulik U."
                    },
                    {
                        "name": "Ramalingam N."
                    },
                    {
                        "name": "Sanada C.D."
                    },
                    {
                        "name": "Sengupta D."
                    }
                ],
                "date": "2021-04-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "Modeling expression ranks for noise-tolerant differential expression analysis of scRNA-seq data"
            },
            "pmcid": "PMC8015842",
            "pmid": "33674351",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
