{
    "additionDate": "2021-03-19T08:31:50Z",
    "biotoolsCURIE": "biotools:hapsolo",
    "biotoolsID": "hapsolo",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "bgaut@uci.edu",
            "name": "Brandon S. Gaut",
            "orcidid": "https://orcid.org/0000-0002-1334-5556",
            "typeEntity": "Person"
        }
    ],
    "description": "An optimization approach for removing secondary haplotigs during diploid genome assembly and scaffolding.\n\nHapSolo is compatible with Python 2.7 and requires the PANDAS package be installed. There is support for Python 3, but Python 2.7 runs faster.",
    "download": [
        {
            "type": "Software package",
            "url": "https://github.com/esolares/HapSolo/releases/tag/v0.1"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                },
                {
                    "term": "Mapping assembly",
                    "uri": "http://edamontology.org/operation_0523"
                }
            ]
        }
    ],
    "homepage": "https://github.com/esolares/HapSolo",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2021-03-30T09:29:19Z",
    "license": "GPL-2.0",
    "name": "HapSolo",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03939-Y",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Despite marked recent improvements in long-read sequencing technology, the assembly of diploid genomes remains a difficult task. A major obstacle is distinguishing between alternative contigs that represent highly heterozygous regions. If primary and secondary contigs are not properly identified, the primary assembly will overrepresent both the size and complexity of the genome, which complicates downstream analysis such as scaffolding. Results: Here we illustrate a new method, which we call HapSolo, that identifies secondary contigs and defines a primary assembly based on multiple pairwise contig alignment metrics. HapSolo evaluates candidate primary assemblies using BUSCO scores and then distinguishes among candidate assemblies using a cost function. The cost function can be defined by the user but by default considers the number of missing, duplicated and single BUSCO genes within the assembly. HapSolo performs hill climbing to minimize cost over thousands of candidate assemblies. We illustrate the performance of HapSolo on genome data from three species: the Chardonnay grape (Vitis vinifera), with a genome of 490 Mb, a mosquito (Anopheles funestus; 200 Mb) and the Thorny Skate (Amblyraja radiata; 2650 Mb). Conclusions: HapSolo rapidly identified candidate assemblies that yield improvements in assembly metrics, including decreased genome size and improved N50 scores. Contig N50 scores improved by 35%, 9% and 9% for Chardonnay, mosquito and the thorny skate, respectively, relative to unreduced primary assemblies. The benefits of HapSolo were amplified by down-stream analyses, which we illustrated by scaffolding with Hi-C data. We found, for example, that prior to the application of HapSolo, only 52% of the Chardonnay genome was captured in the largest 19 scaffolds, corresponding to the number of chromosomes. After the application of HapSolo, this value increased to ~ 84%. The improvements for the mosquito’s largest three scaffolds, representing the number of chromosomes, were from 61 to 86%, and the improvement was even more pronounced for thorny skate. We compared the scaffolding results to assemblies that were based on PurgeDups for identifying secondary contigs, with generally superior results for HapSolo.",
                "authors": [
                    {
                        "name": "Solares E.A."
                    },
                    {
                        "name": "Tao Y."
                    },
                    {
                        "name": "Long A.D."
                    },
                    {
                        "name": "Gaut B.S."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "HapSolo: an optimization approach for removing secondary haplotigs during diploid genome assembly and scaffolding"
            },
            "pmcid": "PMC7788845",
            "pmid": "33407090"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ]
}