{
    "additionDate": "2016-11-28T10:07:17Z",
    "biotoolsCURIE": "biotools:siena",
    "biotoolsID": "siena",
    "collectionID": [
        "de.NBI",
        "COVID-19"
    ],
    "credit": [
        {
            "name": "University of Hamburg - Center for Bioinformatics",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "rarey-office@zbh.uni-hamburg.de",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Search for homologous protein binding sites structures in the Protein Data Bank. The tool allows an automated assembly and preprocessing of protein structure ensembles supporting protein flexibility and point mutation analyses as well as structure-based virtual screening.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://proteinsplus.zbh.uni-hamburg.de/help/index"
        }
    ],
    "editPermission": {
        "authors": [
            "Bietz"
        ],
        "type": "group"
    },
    "elixirCommunity": [
        "3D-BioInfo"
    ],
    "elixirNode": [
        "Germany"
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein structure",
                        "uri": "http://edamontology.org/data_1460"
                    },
                    "format": [
                        {
                            "term": "PDB",
                            "uri": "http://edamontology.org/format_1476"
                        }
                    ]
                }
            ],
            "note": "statistics",
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Structure database search",
                    "uri": "http://edamontology.org/operation_0339"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Structure alignment",
                    "uri": "http://edamontology.org/operation_0295"
                },
                {
                    "term": "Protein flexibility and motion analysis",
                    "uri": "http://edamontology.org/operation_0244"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Protein structure",
                        "uri": "http://edamontology.org/data_1460"
                    },
                    "format": [
                        {
                            "term": "PDB",
                            "uri": "http://edamontology.org/format_1476"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Sequence alignment (protein)",
                        "uri": "http://edamontology.org/data_1384"
                    }
                },
                {
                    "data": {
                        "term": "Root-mean-square deviation",
                        "uri": "http://edamontology.org/data_1497"
                    }
                }
            ]
        }
    ],
    "homepage": "http://proteinsplus.zbh.uni-hamburg.de/#siena",
    "lastUpdate": "2020-06-08T15:31:16Z",
    "name": "SIENA",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "stierand",
    "publication": [
        {
            "doi": "10.1021/acs.jcim.5b00588",
            "metadata": {
                "abstract": "© 2016 American Chemical Society.Structural flexibility of proteins has an important influence on molecular recognition and enzymatic function. In modeling, structure ensembles are therefore often applied as a valuable source of alternative protein conformations. However, their usage is often complicated by structural artifacts and inconsistent data annotation. Here, we present SIENA, a new computational approach for the automated assembly and preprocessing of protein binding site ensembles. Starting with an arbitrarily defined binding site in a single protein structure, SIENA searches for alternative conformations of the same or sequentially closely related binding sites. The method is based on an indexed database for identifying perfect k-mer matches and a recently published algorithm for the alignment of protein binding site conformations. Furthermore, SIENA provides a new algorithm for the interaction-based selection of binding site conformations which aims at covering all known ligand-binding geometries. Various experiments highlight that SIENA is able to generate comprehensive and well selected binding site ensembles improving the compatibility to both known and unconsidered ligand molecules. Starting with the whole PDB as data source, the computation time of the whole ensemble generation takes only a few seconds. SIENA is available via a Web service at www.zbh.uni-hamburg.de/siena.",
                "authors": [
                    {
                        "name": "Bietz S."
                    },
                    {
                        "name": "Rarey M."
                    }
                ],
                "citationCount": 18,
                "date": "2016-01-25T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "SIENA: Efficient Compilation of Selective Protein Binding Site Ensembles"
            },
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1021/acs.jcim.5b00210",
            "metadata": {
                "abstract": "© 2015 American Chemical Society.The usage of conformational ensembles constitutes a widespread technique for the consideration of protein flexibility in computational biology. When experimental structures are applied for this purpose, alignment techniques are usually required in dealing with structural deviations and annotation inconsistencies. Moreover, many application scenarios focus on protein ligand binding sites. Here, we introduce our new alignment algorithm ASCONA that has been specially geared to the problem of aligning multiple conformations of sequentially similar binding sites. Intense efforts have been directed to an accurate detection of highly flexible backbone deviations, multiple binding site matches within a single structure, and a reliable, but at the same time highly efficient, search algorithm. In contrast, most available alignment methods rather target other issues, e.g., the global alignment of distantly related proteins that share structurally conserved regions. For conformational ensembles, this might not only result in an overhead of computation time but could also affect the achieved accuracy, especially for more complicated cases as highly flexible proteins. ASCONA was evaluated on a test set containing 1107 structures of 65 diverse proteins. In all cases, ASCONA was able to correctly align the binding site at an average alignment computation time of 4 ms per target. Furthermore, no false positive matches were observed when searching the same query sites in the structures of other proteins. ASCONA proved to cope with highly deviating backbone structures and to tolerate structural gaps and moderate mutation rates. ASCONA is available free of charge for academic use at http://www.zbh.uni-hamburg.de/ascona. (Figure Presented).",
                "authors": [
                    {
                        "name": "Bietz S."
                    },
                    {
                        "name": "Rarey M."
                    }
                ],
                "citationCount": 9,
                "date": "2015-08-24T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "ASCONA: Rapid Detection and Alignment of Protein Binding Site Conformations"
            },
            "type": [
                "Method"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        }
    ],
    "validated": 1
}