{
    "additionDate": "2021-01-18T11:53:40Z",
    "biotoolsCURIE": "biotools:sdmtune",
    "biotoolsID": "sdmtune",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "sergio.vignali@iee.unibe.ch",
            "name": "Sergio Vignali",
            "orcidid": "https://orcid.org/0000-0002-3390-5442",
            "typeEntity": "Person"
        }
    ],
    "description": "An R package to tune and evaluate species distribution models.\n\nSpecies Distribution Model Selection.\n\nSDMtune provides a user-friendly framework that enables the training and the evaluation of species distribution models (SDMs). The package implements functions for data driven variable selection and model tuning and includes numerous utilities to display the results. All the functions used to select variables or to tune model hyperparameters have an interactive real-time chart displayed in the RStudio viewer pane during their execution. Visit the package website and learn how to use SDMtune starting from the first article Prepare data for the analysis.\n\nUser-friendly framework that enables the training and the evaluation of species distribution models (SDMs).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                },
                {
                    "term": "Ecological modelling",
                    "uri": "http://edamontology.org/operation_3946"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://consbiol-unibern.github.io/SDMtune/",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-13T17:06:29Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://CRAN.R-project.org/package=SDMtune"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/ConsBiol-unibern/SDMtune"
        }
    ],
    "name": "SDMtune",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1002/ECE3.6786",
            "metadata": {
                "abstract": "© 2020 The Authors. Ecology and Evolution published by John Wiley & Sons LtdBalancing model complexity is a key challenge of modern computational ecology, particularly so since the spread of machine learning algorithms. Species distribution models are often implemented using a wide variety of machine learning algorithms that can be fine-tuned to achieve the best model prediction while avoiding overfitting. We have released SDMtune, a new R package that aims to facilitate training, tuning, and evaluation of species distribution models in a unified framework. The main innovations of this package are its functions to perform data-driven variable selection, and a novel genetic algorithm to tune model hyperparameters. Real-time and interactive charts are displayed during the execution of several functions to help users understand the effect of removing a variable or varying model hyperparameters on model performance. SDMtune supports three different metrics to evaluate model performance: the area under the receiver operating characteristic curve, the true skill statistic, and Akaike's information criterion corrected for small sample sizes. It implements four statistical methods: artificial neural networks, boosted regression trees, maximum entropy modeling, and random forest. Moreover, it includes functions to display the outputs and create a final report. SDMtune therefore represents a new, unified and user-friendly framework for the still-growing field of species distribution modeling.",
                "authors": [
                    {
                        "name": "Vignali S."
                    },
                    {
                        "name": "Barras A.G."
                    },
                    {
                        "name": "Arlettaz R."
                    },
                    {
                        "name": "Braunisch V."
                    }
                ],
                "citationCount": 6,
                "date": "2020-10-01T00:00:00Z",
                "journal": "Ecology and Evolution",
                "title": "SDMtune: An R package to tune and evaluate species distribution models"
            },
            "pmcid": "PMC7593178",
            "pmid": "33144979"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}