
{
    "credit": [
        {
            "email": "zhongwang@lbl.gov",
            "name": "Zhong Wang",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://jgi.doe.gov/our-science/scientists-jgi/genome-analysis/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://sites.google.com/a/lbl.gov/biopig/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Data architecture, analysis and design",
                "uri": "http://edamontology.org/topic_3365"
            },
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/biopig-hadoop-based-analytic-toolkit-for-large-scale-sequence-data.html"
        }
    ],
    "publication": [
        {
            "abstract": "Motivation: The recent revolution in sequencing technologies has led to an exponential growth of sequence data. As a result, most of the current bioinformatics tools become obsolete as they fail to scale with data. To tackle this 'data deluge', here we introduce the BioPig sequence analysis toolkit as one of the solutions that scale to data and computation. Results: We built BioPig on the Apache's Hadoop MapReduce system and the Pig data flow language. Compared with traditional serial and MPI-based algorithms, BioPig has three major advantages: first, BioPig's programmability greatly reduces development time for parallel bioinformatics applications; second, testing BioPig with up to 500Gb sequences demonstrates that it scales automatically with size of data; and finally, BioPig can be ported without modification onmany Hadoop infrastructures, as tested with Magellan system at National Energy Research Scientific Computing Center and the Amazon Elastic Compute Cloud. In summary, BioPig represents a novel program framework with the potential to greatly accelerate data-intensive bioinformatics analysis. © The Author 2013. Published by Oxford University Press. All rights reserved.",
            "authors": [
                "Nordberg H.",
                "Bhatia K.",
                "Wang K.",
                "Wang Z."
            ],
            "cit_count": 63,
            "journal": "Bioinformatics",
            "pmid": "24021384",
            "title": "BioPig: A Hadoop-based analytic toolkit for large-scale sequence data",
            "year": "2013-12-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:biopig",
        "biotoolsID": "biopig",
        "description": "Framework for genomic data analysis using Apache Pig and Hadoop.",
        "homepage": "https://sites.google.com/a/lbl.gov/biopig/",
        "name": "BioPig"
    }
}