{
    "additionDate": "2021-01-18T10:33:40Z",
    "biotoolsCURIE": "biotools:pdr",
    "biotoolsID": "pdr",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "x86@u.nus.edu",
            "name": "Luyu Xie",
            "typeEntity": "Person"
        },
        {
            "email": "wongls@comp.nus.edu.sg",
            "name": "Limsoon Wong",
            "typeEntity": "Person"
        }
    ],
    "description": "PDR (Pairwise Distance Reconstuction) is a genome assembly evaluation metric. It derives from a common concern in genetic studies, and takes completeness, contiguity, and correctness into consideration. PDRi is a implementation of it by integral.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Sequence assembly validation",
                    "uri": "http://edamontology.org/operation_3180"
                },
                {
                    "term": "Mapping assembly",
                    "uri": "http://edamontology.org/operation_0523"
                }
            ]
        }
    ],
    "homepage": "https://github.com/XLuyu/PDR",
    "lastUpdate": "2021-01-23T07:26:08Z",
    "name": "PDR",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA704",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.MOTIVATION: Existing genome assembly evaluation metrics provide only limited insight on specific aspects of genome assembly quality, and sometimes even disagree with each other. For better integrative comparison between assemblies, we propose, here, a new genome assembly evaluation metric, Pairwise Distance Reconstruction (PDR). It derives from a common concern in genetic studies, and takes completeness, contiguity, and correctness into consideration. We also propose an approximation implementation to accelerate PDR computation. RESULTS: Our results on publicly available datasets affirm PDR's ability to integratively assess the quality of a genome assembly. In fact, this is guaranteed by its definition. The results also indicated the error introduced by approximation is extremely small and thus negligible. AVAILABILITYAND IMPLEMENTATION: https://github.com/XLuyu/PDR. SUPPLEMENTARY INFORMATION: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Xie L."
                    },
                    {
                        "name": "Wong L."
                    }
                ],
                "citationCount": 1,
                "date": "2021-04-20T00:00:00Z",
                "journal": "Bioinformatics (Oxford, England)",
                "title": "PDR: a new genome assembly evaluation metric based on genetics concerns"
            },
            "pmid": "32761066"
        }
    ],
    "topic": [
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1
}