{
    "additionDate": "2018-05-20T15:06:23Z",
    "biotoolsCURIE": "biotools:mindel",
    "biotoolsID": "mindel",
    "credit": [
        {
            "email": "Lyd0527@jaas.ac.cn",
            "name": "Dr. Yuanda Lv",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Next-generation variant caller specifically designed for InDel marker discovery. By taking in raw sequence reads and assembling them into contigs de novo, identifies InDel polymorphisms using a sliding window alignment from assembled contigs, rendering a unique advantage when a reference genome is unavailable.",
    "documentation": [
        {
            "note": "Installation Manual",
            "type": [
                "User manual"
            ],
            "url": "https://github.com/lyd0527/mInDel/blob/master/doc/Installation.md"
        },
        {
            "note": "Quick Start",
            "type": [
                "General"
            ],
            "url": "https://github.com/lyd0527/mInDel/blob/master/doc/Quick_start.md"
        },
        {
            "note": "Step by Step Tutorial",
            "type": [
                "Training material"
            ],
            "url": "https://github.com/lyd0527/mInDel/blob/master/doc/Step_by_step_tutorial.md"
        },
        {
            "note": "Additional",
            "type": [
                "Other"
            ],
            "url": "https://github.com/lyd0527/mInDel/blob/master/doc/Additional.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Nucleic acid sequence (raw)",
                        "uri": "http://edamontology.org/data_2975"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Indel detection",
                    "uri": "http://edamontology.org/operation_0452"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://github.com/lyd0527/mInDel",
    "language": [
        "Shell",
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "mInDel",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1186/s12864-016-2614-5",
            "metadata": {
                "abstract": "© 2016 Lv et al.Background: Rich in genetic information and cost-effective to genotype, the Insertion-Deletion (InDel) molecular marker system is an important tool for studies in genetics, genomics and for marker-assisted breeding. Advent of next-generation sequencing (NGS) revolutionized the speed and throughput of sequence data generation, and enabled genome-wide identification of insertion and deletion variation. However, current NGS-based InDel mining tools, such as Samtools, GATK and Atlas2, all rely on a reference genome for variant calling which hinders their application on unsequenced organisms and the output of short InDels compromised their use on gel-based genotyping platforms. To address these issues, an enhanced platform is needed to identify longer InDels and develop markers in absence of a reference genome. Results: Here we present mInDel (multiple InDel), a next-generation variant calling tool specifically designed for InDel marker discovery. By taking in raw sequence reads and assembling them into contigs de novo, this software identifies InDel polymorphisms using a sliding window alignment from assembled contigs, rendering a unique advantage when a reference genome is unavailable. By providing an option of combining multiple discovered InDels as output, mInDel is amiable to gel-based genotyping platforms where markers with large polymorphisms are preferred. We demonstrated the usability and performance of this software through a case study using a set of maize NGS data, and experimentally validated the accuracy of markers generated from mInDel. Conclusions: mInDel is a novel and practical tool that enables rapid genome-wide InDel marker discovery. The features of being independent from a reference genome and the flexibility with downstream genotyping platforms will allow a broad range of applications across genetics research and plant breeding. The mInDel pipeline is freely available at www.github.com/lyd0527/mInDel.",
                "authors": [
                    {
                        "name": "Lv Y."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Zhao H."
                    }
                ],
                "citationCount": 17,
                "date": "2016-04-14T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "mInDel: A high-throughput and efficient pipeline for genome-wide InDel marker development"
            },
            "pmcid": "PMC4832496",
            "pmid": "27079510"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ],
    "validated": 1
}