{
    "accessibility": "Open access",
    "additionDate": "2023-01-09T01:02:05.663512Z",
    "biotoolsCURIE": "biotools:em-hiv",
    "biotoolsID": "em-hiv",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "hupengwei@hotmail.com",
            "name": "Pengwei Hu",
            "typeEntity": "Person"
        },
        {
            "email": "zhouxi@ms.xjb.ac.cn",
            "name": "Xi Zhou",
            "typeEntity": "Person"
        },
        {
            "name": "Lun Hu"
        },
        {
            "name": "Zhenfeng Li"
        }
    ],
    "description": "Effectively predicting HIV-1 protease cleavage sites by using an ensemble learning approach.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Protein cleavage site prediction",
                    "uri": "http://edamontology.org/operation_0422"
                }
            ]
        }
    ],
    "homepage": "https://github.com/AllenV5/EM-HIV",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-01-09T01:02:05.666060Z",
    "license": "Not licensed",
    "name": "EM-HIV",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S12859-022-04999-Y",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: The site information of substrates that can be cleaved by human immunodeficiency virus 1 proteases (HIV-1 PRs) is of great significance for designing effective inhibitors against HIV-1 viruses. A variety of machine learning-based algorithms have been developed to predict HIV-1 PR cleavage sites by extracting relevant features from substrate sequences. However, only relying on the sequence information is not sufficient to ensure a promising performance due to the uncertainty in the way of separating the datasets used for training and testing. Moreover, the existence of noisy data, i.e., false positive and false negative cleavage sites, could negatively influence the accuracy performance. Results: In this work, an ensemble learning algorithm for predicting HIV-1 PR cleavage sites, namely EM-HIV, is proposed by training a set of weak learners, i.e., biased support vector machine classifiers, with the asymmetric bagging strategy. By doing so, the impact of data imbalance and noisy data can thus be alleviated. Besides, in order to make full use of substrate sequences, the features used by EM-HIV are collected from three different coding schemes, including amino acid identities, chemical properties and variable-length coevolutionary patterns, for the purpose of constructing more relevant feature vectors of octamers. Experiment results on three independent benchmark datasets demonstrate that EM-HIV outperforms state-of-the-art prediction algorithm in terms of several evaluation metrics. Hence, EM-HIV can be regarded as a useful tool to accurately predict HIV-1 PR cleavage sites.",
                "authors": [
                    {
                        "name": "Hu L."
                    },
                    {
                        "name": "Hu P."
                    },
                    {
                        "name": "Li Z."
                    },
                    {
                        "name": "Tang Z."
                    },
                    {
                        "name": "Zhao C."
                    },
                    {
                        "name": "Zhou X."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Effectively predicting HIV-1 protease cleavage sites by using an ensemble learning approach"
            },
            "pmcid": "PMC9608884",
            "pmid": "36303135"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Laboratory techniques",
            "uri": "http://edamontology.org/topic_3361"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
