{
    "accessibility": "Open access",
    "additionDate": "2019-06-23T15:23:11Z",
    "biotoolsCURIE": "biotools:pSBVB",
    "biotoolsID": "pSBVB",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "miguel.perez@uab.es",
            "name": "M Pérez-Enciso",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "laura.zingaretti@cragenomica.es",
            "name": "Laura Zingaretti",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "polyploid Sequence Based Virtual Breeding (pSBVB) - versatile simulation tool to evaluate genomic selection in polyploid species.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://lauzingaretti.github.io/pSBVB/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                },
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://github.com/lauzingaretti/pSBVB",
    "language": [
        "R",
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:23Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/lauzingaretti/pSBVB/issues"
        }
    ],
    "maturity": "Mature",
    "name": "pSBVB",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1534/g3.118.200942",
            "metadata": {
                "abstract": "© 2019 Chen et al.Genomic Selection (GS) is the procedure whereby molecular information is used to predict complex phenotypes and it is standard in many animal and plant breeding schemes. However, only a small number of studies have been reported in horticultural crops, and in polyploid species in particular. In this paper, we have developed a versatile forward simulation tool, called polyploid Sequence Based Virtual Breeding (pSBVB), to evaluate GS strategies in polyploids; pSBVB is an efficient gene dropping software that can simulate any number of complex phenotypes, allowing a very flexible modeling of phenotypes suited to polyploids. As input, it takes genotype data from the founder population, which can vary from single nucleotide polymorphisms (SNP) chips up to sequence, a list of causal variants for every trait and their heritabilities, and the pedigree. Recombination rates between homeologous chromosomes can be specified, so that both allo-and autopolyploid species can be considered. The program outputs phenotype and genotype data for all individuals in the pedigree. Optionally, it can produce several genomic relationship matrices that consider exact or approximate genotype values. pSBVB can therefore be used to evaluate GS strategies in polyploid species (say varying SNP density, genetic architecture or population size, among other factors), or to optimize experimental designs for association studies. We illustrate pSBVB with SNP data from tetraploid potato and partial sequence data from octoploid strawberry, and we show that GS is a promising breeding strategy for polyploid species but that the actual advantage critically depends on the underlying genetic architecture. Source code, examples and a complete manual are freely available in GitHub https://github.com/lauzingaretti/pSBVB.",
                "authors": [
                    {
                        "name": "Zingaretti M.L."
                    },
                    {
                        "name": "Monfort A."
                    },
                    {
                        "name": "Perez-Enciso M."
                    }
                ],
                "citationCount": 5,
                "date": "2019-02-01T00:00:00Z",
                "journal": "G3: Genes, Genomes, Genetics",
                "title": "PSBVB: A versatile simulation tool to evaluate genomic selection in polyploid species"
            },
            "pmcid": "PMC6385978",
            "pmid": "30573468",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        }
    ],
    "validated": 1
}