{
    "additionDate": "2018-05-19T15:38:30Z",
    "biotoolsCURIE": "biotools:hive",
    "biotoolsID": "hive",
    "credit": [
        {
            "name": "Contact form",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://hive.biochemistry.gwu.edu/contactus"
        }
    ],
    "description": "High-performance integrated virtual environment: a robust infrastructure for next-generation sequence data analysis.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://hive.biochemistry.gwu.edu/dna.cgi?cmd=main"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "homepage": "https://hive.biochemistry.gwu.edu/home",
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "HIVE",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAW022",
            "metadata": {
                "abstract": "© The Author(s) 2016.The High-performance Integrated Virtual Environment (HIVE) is a distributed storage and compute environment designed primarily to handle next-generation sequencing (NGS) data. This multicomponent cloud infrastructure provides secure web access for authorized users to deposit, retrieve, annotate and compute on NGS data, and to analyse the outcomes using web interface visual environments appropriately built in collaboration with research and regulatory scientists and other end users. Unlike many massively parallel computing environments, HIVE uses a cloud control server which virtualizes services, not processes. It is both very robust and flexible due to the abstraction layer introduced between computational requests and operating system processes. The novel paradigm of moving computations to the data, instead of moving data to computational nodes, has proven to be significantly less taxing for both hardware and network infrastructure. The honeycomb data model developed for HIVE integrates metadata into an object-oriented model. Its distinction from other object-oriented databases is in the additional implementation of a unified application program interface to search, view and manipulate data of all types. This model simplifies the introduction of new data types, thereby minimizing the need for database restructuring and streamlining the development of new integrated information systems. The honeycomb model employs a highly secure hierarchical access control and permission system, allowing determination of data access privileges in a finely granular manner without flooding the security subsystem with a multiplicity of rules. HIVE infrastructure will allow engineers and scientists to perform NGS analysis in a manner that is both efficient and secure. HIVE is actively supported in public and private domains, and project collaborations are welcomed.",
                "authors": [
                    {
                        "name": "Chumakov K."
                    },
                    {
                        "name": "Dingerdissen H."
                    },
                    {
                        "name": "Faison W."
                    },
                    {
                        "name": "Goldweber S."
                    },
                    {
                        "name": "Golikov A."
                    },
                    {
                        "name": "Gulzar N."
                    },
                    {
                        "name": "Karagiannis K."
                    },
                    {
                        "name": "Lam P.V.N."
                    },
                    {
                        "name": "Maudru T."
                    },
                    {
                        "name": "Mazumder R."
                    },
                    {
                        "name": "Muravitskaja O."
                    },
                    {
                        "name": "Osipova E."
                    },
                    {
                        "name": "Pan Y."
                    },
                    {
                        "name": "Pschenichnov A."
                    },
                    {
                        "name": "Rostovtsev A."
                    },
                    {
                        "name": "Santana-Quintero L."
                    },
                    {
                        "name": "Simonyan V."
                    },
                    {
                        "name": "Smith K."
                    },
                    {
                        "name": "Thompson E.E."
                    },
                    {
                        "name": "Tkachenko V."
                    },
                    {
                        "name": "Torcivia-Rodriguez J."
                    },
                    {
                        "name": "Voskanian A."
                    },
                    {
                        "name": "Wan Q."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Wilson C."
                    },
                    {
                        "name": "Wu T.-J."
                    }
                ],
                "citationCount": 34,
                "date": "2016-01-01T00:00:00Z",
                "journal": "Database",
                "title": "High-performance Integrated Virtual Environment (HIVE): A robust infrastructure for next-generation sequence data analysis"
            },
            "pmcid": "PMC4795927",
            "pmid": "26989153"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Data governance",
            "uri": "http://edamontology.org/topic_3571"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
