{
    "additionDate": "2021-10-27T20:04:55.478125Z",
    "biotoolsCURIE": "biotools:cod",
    "biotoolsID": "cod",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Deng-Ping Fan"
        }
    ],
    "description": "Concealed Object Detection",
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://mmcheng.net/cod",
    "lastUpdate": "2021-10-27T20:07:04.923065Z",
    "license": "CC-BY-NC-SA-4.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/DengPingFan/SINet/"
        }
    ],
    "name": "COD",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1109/TPAMI.2021.3085766",
            "metadata": {
                "abstract": "IEEEWe present the first systematic study on concealed object detection (COD), which aims to identify objects that are ?perfectly? embedded in their background. The high intrinsic similarities between the concealed objects and their background make COD far more challenging than traditional object detection/segmentation. To better understand this task, we collect a large-scale dataset, called COD10K, which consists of 10,000 images covering concealed objects in diverse real-world scenarios from 78 object categories. Further, we provide rich annotations including object categories, object boundaries, challenging attributes, object-level labels, and instance-level annotations. Our COD10K enables comprehensive concealed object understanding and can even be used to help progress several other vision tasks, such as detection, segmentation, classification etc. We also design a simple but strong baseline for COD, termed the Search Identification Network (SINet). Without any bells and whistles, SINet outperform 12 cutting-edge baselines on all datasets tested, making them robust, general architectures that could serve as catalysts for future research in COD. Finally, we provide some interesting findings, and highlight several potential applications and future directions. To spark research in this new field, our code, dataset, and online demo are available at our project page: http://mmcheng.net/cod",
                "authors": [
                    {
                        "name": "Cheng M."
                    },
                    {
                        "name": "Fan D."
                    },
                    {
                        "name": "Ji G."
                    },
                    {
                        "name": "Shao L."
                    }
                ],
                "citationCount": 1,
                "date": "2021-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Pattern Analysis and Machine Intelligence",
                "title": "Concealed Object Detection"
            },
            "pmid": "34061739"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ],
    "validated": 1
}
