{
    "accessibility": "Open access",
    "additionDate": "2022-12-31T15:26:33.500444Z",
    "biotoolsCURIE": "biotools:gift_imagej",
    "biotoolsID": "gift_imagej",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "Jennifer.huling@uni-rostock.de",
            "name": "Jennifer Huling",
            "orcidid": "https://orcid.org/0000-0001-5588-8922",
            "typeEntity": "Person"
        },
        {
            "name": "Niels Grabow"
        },
        {
            "name": "Andreas Götz",
            "orcidid": "https://orcid.org/0000-0003-0463-8741"
        },
        {
            "name": "Sabine Illner",
            "orcidid": "https://orcid.org/0000-0002-2033-2964"
        }
    ],
    "description": "General Image Fiber Tool (GIFT) is an ImageJ macro tool which allows the users to measure the average diameter of electrospun fibers in scanning electron microscopy (SEM) images.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "https://github.com/IBMTRostock/GIFT",
    "lastUpdate": "2022-12-31T15:27:15.676018Z",
    "license": "MIT",
    "name": "GIFT",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0275528",
            "metadata": {
                "abstract": "© 2022 Huling et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.This paper details the development and testing of the GIFT macro, which is a freely available program for ImageJ for the automated measurement of fiber diameters in SEM images of electrospun materials. The GIFT macro applies a validated method which distinguishes fiber diameters based on distance frequencies within an image. In this work, we introduce an applied version of the GIFT method which has been designed to be user-friendly while still allowing complete control over the various parameters involved in the image processing steps. The macro quickly processes large data sets and creates results that are reproducible and accurate. The program outputs both raw data and fiber diameter averages, so that the user can quickly assess the results and has the opportunity for further analysis if desired. The GIFT macro was compared directly to other software designed for fiber diameter measurements and was found to have comparable or lower average error, especially when measuring very small fibers, and reduced processing times per image. The macro, detailed instructions for use, and sample images are freely available online (https://github.com/IBMTRostock/GIFT). We believe that the GIFT macro is a valuable new tool for researchers looking to quickly, easily and reliably assess fiber diameters in electrospun materials.",
                "authors": [
                    {
                        "name": "Gotz A."
                    },
                    {
                        "name": "Grabow N."
                    },
                    {
                        "name": "Huling J."
                    },
                    {
                        "name": "Illner S."
                    }
                ],
                "date": "2022-10-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "GIFT: An ImageJ macro for automated fiber diameter quantification"
            },
            "pmcid": "PMC9529089",
            "pmid": "36191031"
        }
    ],
    "relation": [
        {
            "biotoolsID": "imagej",
            "type": "uses"
        }
    ],
    "toolType": [
        "Plug-in"
    ],
    "topic": [
        {
            "term": "Electron microscopy",
            "uri": "http://edamontology.org/topic_0611"
        }
    ],
    "validated": 1
}
