{"credit":[],"function":[{"operation":[{"term":"Deposition","uri":"http://edamontology.org/operation_3431"},{"term":"Data retrieval","uri":"http://edamontology.org/operation_2422"},{"term":"Variant calling","uri":"http://edamontology.org/operation_3227"}]}],"labels":{"topic":[{"term":"Natural language processing","uri":"http://edamontology.org/topic_0218"},{"term":"Machine learning","uri":"http://edamontology.org/topic_3474"},{"term":"Mapping","uri":"http://edamontology.org/topic_0102"}]},"publication":[{"abstract":"© 2019, American College of Medical Genetics and Genomics.Purpose: Both monogenic pathogenic variant cataloging and clinical patient diagnosis start with variant-level evidence retrieval followed by expert evidence integration in search of diagnostic variants and genes. Here, we try to accelerate pathogenic variant evidence retrieval by an automatic approach. Methods: Automatic VAriant evidence DAtabase (AVADA) is a novel machine learning tool that uses natural language processing to automatically identify pathogenic genetic variant evidence in full-text primary literature about monogenic disease and convert it to genomic coordinates. Results: AVADA automatically retrieved almost 60% of likely disease-causing variants deposited in the Human Gene Mutation Database (HGMD), a 4.4-fold improvement over the current best open source automated variant extractor. AVADA contains over 60,000 likely disease-causing variants that are in HGMD but not in ClinVar. AVADA also highlights the challenges of automated variant mapping and pathogenicity curation. However, when combined with manual validation, on 245 diagnosed patients, AVADA provides valuable evidence for an additional 18 diagnostic variants, on top of ClinVar’s 21, versus only 2 using the best current automated approach. Conclusion: AVADA advances automated retrieval of pathogenic monogenic variant evidence from full-text literature. Far from perfect, but much faster than PubMed/Google Scholar search, careful curation of AVADA-retrieved evidence can aid both database curation and patient diagnosis.","authors":["Birgmeier J.","Deisseroth C.A.","Hayward L.E.","Galhardo L.M.T.","Tierno A.P.","Jagadeesh K.A.","Stenson P.D.","Cooper D.N.","Bernstein J.A.","Haeussler M.","Bejerano G."],"cit_count":0,"doi":"10.1038/S41436-019-0643-6","journal":"Genetics in Medicine","pmid":"31467448","title":"AVADA: toward automated pathogenic variant evidence retrieval directly from the full-text literature","year":"2019-01-01"}],"summary":{"biotoolsCURIE":"biotools:AVADA","biotoolsID":"AVADA","description":"> HOMEPAGE MISSING! | toward automated pathogenic variant evidence retrieval directly from the full-text literature | PURPOSE:Both monogenic pathogenic variant cataloging and clinical patient diagnosis start with variant-level evidence retrieval followed by expert evidence integration in search of diagnostic variants and genes. Here, we try to accelerate pathogenic variant evidence retrieval by an automatic approach. METHODS:Automatic VAriant evidence DAtabase (AVADA) is a novel machine learning tool that uses natural language processing to automatically identify pathogenic genetic variant evidence in full-text primary literature about monogenic disease and convert it to genomic coordinates. RESULTS:AVADA automatically retrieved almost 60% of likely disease-causing variants deposited in the Human Gene Mutation Database (HGMD), a 4.4-fold improvement over the current best open source automated variant extractor","homepage":"https://www.ncbi.nlm.nih.gov/pubmed/?term=31467448","name":"AVADA"}}