{
    "additionDate": "2019-11-14T18:21:31Z",
    "biotoolsCURIE": "biotools:AVADA",
    "biotoolsID": "AVADA",
    "confidence_flag": "tool",
    "description": "Toward automated pathogenic variant evidence retrieval directly from the full-text literature | PURPOSE:Both monogenic pathogenic variant cataloging and clinical patient diagnosis start with variant-level evidence retrieval followed by expert evidence integration in search of diagnostic variants and genes. Here, we try to accelerate pathogenic variant evidence retrieval by an automatic approach. METHODS:Automatic VAriant evidence DAtabase (AVADA) is a novel machine learning tool that uses natural language processing to automatically identify pathogenic genetic variant evidence in full-text primary literature about monogenic disease and convert it to genomic coordinates. RESULTS:AVADA automatically retrieved almost 60% of likely disease-causing variants deposited in the Human Gene Mutation Database (HGMD), a 4.4-fold improvement over the current best open source automated variant extractor",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "http://bejerano.stanford.edu/AVADA/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-02T17:07:31Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://bitbucket.org/bejerano/avada/src/master/"
        }
    ],
    "name": "AVADA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1038/S41436-019-0643-6",
            "metadata": {
                "abstract": "© 2019, American College of Medical Genetics and Genomics.Purpose: Both monogenic pathogenic variant cataloging and clinical patientdiagnosis start with variant-level evidence retrieval followed by expertevidence integration in search of diagnostic variants and genes. Here, we try toaccelerate pathogenic variant evidence retrieval by an automaticapproach. Methods: Automatic VAriant evidence DAtabase (AVADA) is a novel machine learning tool that usesnatural language processing to automatically identify pathogenic genetic variantevidence in full-text primary literature about monogenic disease and convert itto genomic coordinates. Results: AVADA automatically retrieved almost 60% of likely disease-causingvariants deposited in the Human Gene Mutation Database (HGMD), a 4.4-foldimprovement over the current best open source automated variant extractor. AVADAcontains over 60,000 likely disease-causing variants that are in HGMD but not inClinVar. AVADA also highlights the challenges of automated variant mapping andpathogenicity curation. However, when combined with manual validation, on 245diagnosed patients, AVADA provides valuable evidence for an additional 18diagnostic variants, on top of ClinVar’s 21, versus only 2 using the bestcurrent automated approach. Conclusion: AVADA advances automated retrieval of pathogenic monogenic variantevidence from full-text literature. Far from perfect, but much faster thanPubMed/Google Scholar search, careful curation of AVADA-retrieved evidence canaid both database curation and patient diagnosis.",
                "authors": [
                    {
                        "name": "Bejerano G."
                    },
                    {
                        "name": "Bernstein J.A."
                    },
                    {
                        "name": "Birgmeier J."
                    },
                    {
                        "name": "Cooper D.N."
                    },
                    {
                        "name": "Deisseroth C.A."
                    },
                    {
                        "name": "Galhardo L.M.T."
                    },
                    {
                        "name": "Haeussler M."
                    },
                    {
                        "name": "Hayward L.E."
                    },
                    {
                        "name": "Jagadeesh K.A."
                    },
                    {
                        "name": "Stenson P.D."
                    },
                    {
                        "name": "Tierno A.P."
                    }
                ],
                "citationCount": 5,
                "date": "2020-02-01T00:00:00Z",
                "journal": "Genetics in Medicine",
                "title": "AVADA: toward automated pathogenic variant evidence retrieval directly from the full-text literature"
            },
            "pmcid": "PMC7301356",
            "pmid": "31467448"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        }
    ],
    "validated": 1
}
