{
    "additionDate": "2018-04-22T11:20:33Z",
    "biotoolsCURIE": "biotools:vispig",
    "biotoolsID": "vispig",
    "credit": [
        {
            "email": "mscales@icr.ac.uk",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A web application to produce multi-track, multi-scale, multi-region plots of genetic data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/gitMarcH/visPIG"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression data visualisation",
                    "uri": "http://edamontology.org/operation_0571"
                }
            ]
        }
    ],
    "homepage": "http://vispig.icr.ac.uk/",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "license": "GPL-3.0",
    "name": "visPIG",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0107497",
            "metadata": {
                "abstract": "© 2014 Scales et al. This is an open-access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.We present VISual Plotting Interface for Genetics (visPIG; http://vispig.icr.ac.UK), a web application to produce multi-track, multi-scale, multi-region plots of genetic data. visPIG has been designed to allow users not well versed with mathematical software packages and/or programming languages such as R [1], MatlabH, Python, etc., to integrate data from multiple sources for interpretation and to easily create publication-ready figures. While web tools such as the UCSC Genome Browser [2] or the WashU Epigenome Browser [3] allow custom data uploads, such tools are primarily designed for data exploration. This is also true for the desktop-run Integrative Genomics Viewer (IGV) [4,5]. Other locally run data visualisation software such as Circos [6] require significant computer skills of the user. The visPIG web application is a menu-based interface that allows users to upload custom data tracks and set track-specific parameters. Figures can be downloaded as PDF or PNG files. For sensitive data, the underlying R [1] code can also be downloaded and run locally. visPIG is multi-track: it can display many different data types (e.g association, functional annotation, intensity, interaction, heat map data,...). It also allows annotation of genes and other custom features in the plotted region(s). Data tracks can be plotted individually or on a single figure. visPIG is multi-region: it supports plotting multiple regions, be they kilo- or megabases apart or even on different chromosomes. Finally, visPIG is multi-scale: a sub-region of particular interest can be 'zoomed' in. We describe the various features of visPIG and illustrate its utility with examples. visPIG is freely available through http://vispig.icr.ac.UK under a GNU General Public License (GPLv3).",
                "authors": [
                    {
                        "name": "Henrion M.Y.R."
                    },
                    {
                        "name": "Houlston R.S."
                    },
                    {
                        "name": "Jager R."
                    },
                    {
                        "name": "Migliorini G."
                    },
                    {
                        "name": "Scales M."
                    }
                ],
                "citationCount": 35,
                "date": "2014-09-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "VisPIG - A web tool for producing multi-region, multi-track, multi-scale plots of genetic data"
            },
            "pmcid": "PMC4160258",
            "pmid": "25208325"
        }
    ],
    "toolType": [
        "Library",
        "Web application"
    ],
    "topic": [
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1
}
