{
    "additionDate": "2024-02-21T13:53:23.950068Z",
    "biotoolsCURIE": "biotools:viclod",
    "biotoolsID": "viclod",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "juliana.silva_bernardes@sorbonne-universite.fr",
            "name": "Juliana Silva Bernardes",
            "orcidid": "https://orcid.org/0000-0003-1341-4256",
            "typeEntity": "Person"
        },
        {
            "email": "frederic.davi@aphp.fr",
            "name": "Frédéric Davi",
            "typeEntity": "Person"
        }
    ],
    "description": "Interactive web tool for visualizing B cell repertoires and analyzing intraclonal diversities.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://www.lcqb.upmc.fr/viclod/Format",
    "language": [
        "Bash",
        "PHP",
        "Python"
    ],
    "lastUpdate": "2024-02-21T13:53:23.953549Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://www.lcqb.upmc.fr/viclod/"
        }
    ],
    "name": "ViCloD",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/NARGAB/LQAD064",
            "metadata": {
                "abstract": "High throughput sequencing of adaptive immune receptor repertoire (AIRR-seq) has provided numerous human immunoglobulin (IG) sequences allowing specific B cell receptor (BCR) studies such as the antigen-driven evolution of antibodies (soluble forms of the membrane-bound IG part of the BCR). AIRR-seq data allows researchers to examine intraclonal differences caused primarily by somatic hypermutations in IG genes and affinity maturation. Exploring this essential adaptive immunity process could help elucidate the generation of antibodies with high affinity or broadly neutralizing activities. Retracing their evolutionary history could also clarify how vaccines or pathogen exposition drive the humoral immune response, and unravel the clonal architecture of B cell tumors. Computational methods are necessary for large-scale analysis of AIRR-seq properties. However, there is no efficient and interactive tool for analyzing intraclonal diversity, permitting users to explore adaptive immune receptor repertoires in biological and clinical applications. Here we present ViCloD, a web server for large-scale visual analysis of repertoire clonality and intraclonal diversity. ViCloD uses preprocessed data in the format defined by the Adaptive Immune Receptor Repertoire (AIRR) Community. Then, it performs clonal grouping and evolutionary analyses, producing a collection of useful plots for clonal lineage inspection. The web server presents diverse functionalities, including repertoire navigation, clonal abundance analysis, and intraclonal evolutionary tree reconstruction. Users can download the analyzed data in different table formats and save the generated plots as images. ViCloD is a simple, versatile, and user-friendly tool that can help researchers and clinicians to analyze B cell intraclonal diversity. Moreover, its pipeline is optimized to process hundreds of thousands of sequences within a few minutes, allowing an efficient investigation of large and complex repertoires.",
                "authors": [
                    {
                        "name": "Abdollahi N."
                    },
                    {
                        "name": "Armand M."
                    },
                    {
                        "name": "Bernardes J.S."
                    },
                    {
                        "name": "Davi F."
                    },
                    {
                        "name": "De Septenville A.L."
                    },
                    {
                        "name": "Jeusset L."
                    },
                    {
                        "name": "Verny T."
                    }
                ],
                "citationCount": 1,
                "date": "2023-06-01T00:00:00Z",
                "journal": "NAR Genomics and Bioinformatics",
                "title": "ViCloD, an interactive web tool for visualizing B cell repertoires and analyzing intraclonal diversities: Application to human B-cell tumors"
            },
            "pmcid": "PMC10304752",
            "pmid": "37388820"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
