{
    "accessibility": "Open access",
    "additionDate": "2023-01-08T01:33:16.023808Z",
    "biotoolsCURIE": "biotools:ev-dna",
    "biotoolsID": "ev-dna",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "julia.burnier@mcgill.ca",
            "name": "Julia V. Burnier",
            "typeEntity": "Person"
        },
        {
            "name": "Mingyang Li"
        },
        {
            "name": "Thupten Tsering"
        },
        {
            "name": "Yunxi Chen"
        }
    ],
    "description": "Database for EV-associated DNA in human liquid biopsy samples.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                }
            ]
        }
    ],
    "homepage": "http://www.evdnadatabase.com",
    "lastUpdate": "2023-01-08T01:33:28.189992Z",
    "name": "EV-DNA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1002/JEV2.12270",
            "metadata": {
                "abstract": "© 2022 The Authors. Journal of Extracellular Vesicles published by Wiley Periodicals, LLC on behalf of the International Society for Extracellular Vesicles.Extracellular vesicles (EVs) play a key role in cellular communication both in physiological conditions and in pathologies such as cancer. Emerging evidence has shown that EVs are active carriers of molecular cargo (e.g. protein and nucleic acids) and a powerful source of biomarkers and targets. While recent studies on EV-associated DNA (EV-DNA) in human biofluids have generated a large amount of data, there is currently no database that catalogues information on EV-DNA. To fill this gap, we have manually curated a database of EV-DNA data derived from human biofluids (liquid biopsy) and in-vitro studies, called the Extracellular Vesicle-Associated DNA Database (EV-ADD). This database contains validated experimental details and data extracted from peer-reviewed published literature. It can be easily queried to search for EV isolation methods and characterization, EV-DNA isolation techniques, quality validation, DNA fragment size, volume of starting material, gene names and disease context. Currently, our database contains samples representing 23 diseases, with 13 different types of EV isolation techniques applied on eight different human biofluids (e.g. blood, saliva). In addition, EV-ADD encompasses EV-DNA data both representing the whole genome and specifically including oncogenes, such as KRAS, EGFR, BRAF, MYC, and mitochondrial DNA (mtDNA). An EV-ADD data metric system was also integrated to assign a compliancy score to the MISEV guidelines based on experimental parameters reported in each study. While currently available databases document the presence of proteins, lipids, RNA and metabolites in EVs (e.g. Vesiclepedia, ExoCarta, ExoBCD, EVpedia, and EV-TRACK), to the best of our knowledge, EV-ADD is the first of its kind to compile all available EV-DNA datasets derived from human biofluid samples. We believe that this database provides an important reference resource on EV-DNA-based liquid biopsy research, serving as a learning tool and to showcase the latest developments in the EV-DNA field. EV-ADD will be updated yearly as newly published EV-DNA data becomes available and it is freely available at www.evdnadatabase.com.",
                "authors": [
                    {
                        "name": "Abdouh M."
                    },
                    {
                        "name": "Burnier J.V."
                    },
                    {
                        "name": "Bustamante P."
                    },
                    {
                        "name": "Chen Y."
                    },
                    {
                        "name": "Laskaris A."
                    },
                    {
                        "name": "Li M."
                    },
                    {
                        "name": "Nadeau A."
                    },
                    {
                        "name": "Tsering T."
                    }
                ],
                "date": "2022-10-01T00:00:00Z",
                "journal": "Journal of Extracellular Vesicles",
                "title": "EV-ADD, a database for EV-associated DNA in human liquid biopsy samples"
            },
            "pmcid": "PMC9587709",
            "pmid": "36271888"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Lipids",
            "uri": "http://edamontology.org/topic_0153"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
