{
    "additionDate": "2021-01-18T12:37:02Z",
    "biotoolsCURIE": "biotools:dleamse",
    "biotoolsID": "dleamse",
    "confidence_flag": "tool",
    "description": "A Deep LEArning-based Mass Spectra Embedder for spectral similarity scoring. DLEAMSE (based on Siamese Network) is trained and tested with a larger dataset from PRIDE Cluster. The repository stores the encoder and embedder scripts of DLEAMSE to encode and embed spectra.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Spectrum calculation",
                    "uri": "http://edamontology.org/operation_3860"
                },
                {
                    "term": "Spectral library search",
                    "uri": "http://edamontology.org/operation_3801"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bigbio/DLEAMSE/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-01T11:10:58Z",
    "license": "Apache-2.0",
    "name": "DLEAMSE",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.JPROT.2020.104070",
            "metadata": {
                "abstract": "© 2020Spectral similarity calculation is widely used in protein identification tools and mass spectra clustering algorithms while comparing theoretical or experimental spectra. The performance of the spectral similarity calculation plays an important role in these tools and algorithms especially in the analysis of large-scale datasets. Recently, deep learning methods have been proposed to improve the performance of clustering algorithms and protein identification by training the algorithms with existing data and the use of multiple spectra and identified peptide features. While the efficiency of these algorithms is still under study in comparison with traditional approaches, their application in proteomics data analysis is becoming more common. Here, we propose the use of deep learning to improve spectral similarity comparison. We assessed the performance of deep learning for spectral similarity, with GLEAMS and a newly trained embedder model (DLEAMSE), which uses high-quality spectra from PRIDE Cluster. Also, we developed a new bioinformatics tool (mslookup - https://github.com/bigbio/DLEAMSE/) that allows users to quickly search for spectra in previously identified mass spectra publish in public repositories and spectral libraries. Finally, we released a human database to enable bioinformaticians and biologists to search for identified spectra in their machines. Significance statement: Spectral similarity calculation plays an important role in proteomics data analysis. With deep learning's ability to learn the implicit and effective features from large-scale training datasets, deep learning-based MS/MS spectra embedding models has emerged as a solution to improve mass spectral clustering similarity calculation algorithms. We compare multiple similarity scoring and deep learning methods in terms of accuracy (compute the similarity for a pair of the mass spectrum) and computing-time performance. The benchmark results showed no major differences in accuracy between DLEAMSE and normalized dot product for spectrum similarity calculations. The DLEAMSE GPU implementation is faster than NDP in preprocessing on the GPU server and the similarity calculation of DLEAMSE (Euclidean distance on 32-D vectors) takes about 1/3 of dot product calculations. The deep learning model (DLEAMSE) encoding and embedding steps needed to run once for each spectrum and the embedded 32-D points can be persisted in the repository for future comparison, which is faster for future comparisons and large-scale data. Based on these, we proposed a new tool mslookup that enables the researcher to find spectra previously identified in public data. The tool can be also used to generate in-house databases of previously identified spectra to share with other laboratories and consortiums.",
                "authors": [
                    {
                        "name": "Qin C."
                    },
                    {
                        "name": "Luo X."
                    },
                    {
                        "name": "Deng C."
                    },
                    {
                        "name": "Shu K."
                    },
                    {
                        "name": "Zhu W."
                    },
                    {
                        "name": "Griss J."
                    },
                    {
                        "name": "Hermjakob H."
                    },
                    {
                        "name": "Bai M."
                    },
                    {
                        "name": "Perez-Riverol Y."
                    }
                ],
                "citationCount": 1,
                "date": "2021-02-10T00:00:00Z",
                "journal": "Journal of Proteomics",
                "title": "Deep learning embedder method and tool for mass spectra similarity search"
            },
            "pmid": "33307250"
        }
    ],
    "topic": [
        {
            "term": "Proteogenomics",
            "uri": "http://edamontology.org/topic_3922"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}