{
    "additionDate": "2017-08-03T19:06:02Z",
    "biotoolsCURIE": "biotools:i3drefine",
    "biotoolsID": "i3drefine",
    "credit": [
        {
            "name": "Jianlin Cheng",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://bengal.missouri.edu/~chengji/"
        }
    ],
    "description": "Completely automated and computationally efficient protein 3D structure refinement method which based on an iterative and highly convergent energy minimization algorithm with a powerful all-atom composite physics and knowledge-based force fields and hydrogen bonding (HB) network optimization technique.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://protein.rnet.missouri.edu/i3drefine/"
        },
        {
            "type": [
                "User manual"
            ],
            "url": "http://protein.rnet.missouri.edu/i3drefine/documentation.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular model refinement",
                    "uri": "http://edamontology.org/operation_0322"
                }
            ]
        }
    ],
    "homepage": "http://sysbio.rnet.missouri.edu/multicom_toolbox/tools.html",
    "lastUpdate": "2018-12-10T12:58:43Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/i3drefine-protein-3d-structure-refinement.html"
        }
    ],
    "name": "i3Drefine",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© The Author(s) 2016. Published by Oxford University Press on behalf of Nucleic Acids Research.3Drefine is an interactive web server for consistent and computationally efficient protein structure refinement with the capability to perform web-based statistical and visual analysis. The 3Drefine refinement protocol utilizes iterative optimization of hydrogen bonding network combined with atomic-level energy minimization on the optimized model using a composite physics and knowledge-based force fields for efficient protein structure refinement. The method has been extensively evaluated on blind CASP experiments as well as on large-scale and diverse benchmark datasets and exhibits consistent improvement over the initial structure in both global and local structural quality measures. The 3Drefine web server allows for convenient protein structure refinement through a text or file input submission, email notification, provided example submission and is freely available without any registration requirement. The server also provides comprehensive analysis of submissions through various energy and statistical feedback and interactive visualization of multiple refined models through the JSmol applet that is equipped with numerous protein model analysis tools. The web server has been extensively tested and used by many users. As a result, the 3Drefine web server conveniently provides a useful tool easily accessible to the community. The 3Drefine web server has been made publicly available at the URL: http://sysbio.rnet.missouri.edu/3Drefine/.",
                "authors": [
                    {
                        "name": "Bhattacharya D."
                    },
                    {
                        "name": "Nowotny J."
                    },
                    {
                        "name": "Cao R."
                    },
                    {
                        "name": "Cheng J."
                    }
                ],
                "citationCount": 132,
                "date": "2016-07-08T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "3Drefine: an interactive web server for efficient protein structure refinement"
            },
            "pmid": "27131371"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ],
    "validated": 1
}