{
    "accessibility": "Open access",
    "additionDate": "2022-06-28T09:10:27.514564Z",
    "biotoolsCURIE": "biotools:jpa",
    "biotoolsID": "jpa",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "thuan@chem.ubc.ca",
            "name": "Tao Huan",
            "orcidid": "https://orcid.org/0000-0001-6295-2435",
            "typeEntity": "Person"
        }
    ],
    "description": "JPA (short for Joint Metabolomics Data Processing and Annotation), an R package that offers comprehensive and streamlined metabolic feature extraction and annotation.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Peak detection",
                    "uri": "http://edamontology.org/operation_3215"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/HuanLab/JPA",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-06-28T09:10:27.517122Z",
    "license": "MIT",
    "name": "JPA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3390/METABO12030212",
            "metadata": {
                "abstract": "© 2022 by the authors. Licensee MDPI, Basel, Switzerland.Extracting metabolic features from liquid chromatography-mass spectrometry (LC-MS) data has been a long-standing bioinformatic challenge in untargeted metabolomics. Conventional feature extraction algorithms fail to recognize features with low signal intensities, poor chromatographic peak shapes, or those that do not fit the parameter settings. This problem also poses a challenge for MS-based exposome studies, as low-abundant metabolic or exposomic features cannot be automatically recognized from raw data. To address this data processing challenge, we developed an R package, JPA (short for Joint Metabolomic Data Processing and Annotation), to comprehensively extract metabolic features from raw LC-MS data. JPA performs feature extraction by combining a conventional peak picking algorithm and strategies for (1) recognizing features with bad peak shapes but that have tandem mass spectra (MS2) and (2) picking up features from a user-defined targeted list. The performance of JPA in global metabolomics was demonstrated using serial diluted urine samples, in which JPA was able to rescue an average of 25% of metabolic features that were missed by the conventional peak picking algorithm due to dilution. More importantly, the chromatographic peak shapes, analytical accuracy, and precision of the rescued metabolic features were all evaluated. Furthermore, owing to its sensitive feature extraction, JPA was able to achieve a limit of detection (LOD) that was up to thousands of folds lower when automatically processing metabolomics data of a serial diluted metabolite standard mixture analyzed in HILIC(−) and RP(+) modes. Finally, the performance of JPA in exposome research was validated using a mixture of 250 drugs and 255 pesticides at environmentally relevant levels. JPA detected an average of 2.3-fold more exposure compounds than conventional peak picking only.",
                "authors": [
                    {
                        "name": "Chen Y."
                    },
                    {
                        "name": "Fang M."
                    },
                    {
                        "name": "Gao Y."
                    },
                    {
                        "name": "Guo J."
                    },
                    {
                        "name": "Hu Y."
                    },
                    {
                        "name": "Huan T."
                    },
                    {
                        "name": "Liu M."
                    },
                    {
                        "name": "Low B."
                    },
                    {
                        "name": "Shen S."
                    },
                    {
                        "name": "Wang C."
                    },
                    {
                        "name": "Xing S."
                    },
                    {
                        "name": "Yu H."
                    }
                ],
                "date": "2022-03-01T00:00:00Z",
                "journal": "Metabolites",
                "title": "JPA: Joint Metabolic Feature Extraction Increases the Depth of Chemical Coverage for LC-MS-Based Metabolomics and Exposomics"
            },
            "pmcid": "PMC8952385",
            "pmid": "35323655"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
