{
    "additionDate": "2018-05-01T17:00:00Z",
    "biotoolsCURIE": "biotools:vdjviz",
    "biotoolsID": "vdjviz",
    "credit": [
        {
            "email": "mikhail.shugay@gmail.com",
            "name": "Mikhail Shugay",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Versatile browser for immunogenomics data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/antigenomics/vdjviz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "https://github.com/antigenomics/vdjviz",
    "language": [
        "Java",
        "JavaScript"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "VDJviz",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/S12864-016-2799-7",
            "metadata": {
                "abstract": "© 2016 The Author(s).Background: The repertoire of T- and B-cell receptor sequences encodes the antigen specificity of adaptive immunity system, determines its present state and guides its ability to mount effective response against encountered antigens in future. High throughput sequencing of immune repertoires (Rep-Seq) is a promising technique that allows to profile millions of antigen receptors of an individual in a single experiment. While a substantial number of tools for mapping and assembling Rep-Seq data were published recently, the field still lacks an intuitive and flexible tool that can be used by researchers with little or no computational background for in-depth analysis of immune repertoire profiles. Results: Here we report VDJviz, a web tool that can be used to browse, analyze and perform quality control of Rep-Seq results generated by various pre-processing software. On a set of real data examples we show that VDJviz can be used to explore key repertoire characteristics such as spectratype, repertoire clonality, V-(D)-J recombination patterns and to identify shared clonotypes. We also demonstrate the utility of VDJviz in detection of critical Rep-Seq biases such as artificial repertoire diversity and cross-sample contamination. Conclusions: VDJviz is a versatile and lightweight tool that can be easily employed by biologists, immunologists and immunogeneticists for routine analysis and quality control of Rep-Seq data. The software is freely available for non-commercial purposes, and can be downloaded from: https://github.com/antigenomics/vdjviz.",
                "authors": [
                    {
                        "name": "Bagaev D.V."
                    },
                    {
                        "name": "Britanova O.V."
                    },
                    {
                        "name": "Chudakov D.M."
                    },
                    {
                        "name": "Izraelson M."
                    },
                    {
                        "name": "Putintseva E.V."
                    },
                    {
                        "name": "Shugay M."
                    },
                    {
                        "name": "Zvyagin I.V."
                    }
                ],
                "citationCount": 14,
                "date": "2016-06-13T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "VDJviz: A versatile browser for immunogenomics data"
            },
            "pmcid": "PMC4907000",
            "pmid": "27297497"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Immunology",
            "uri": "http://edamontology.org/topic_0804"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
