
{
    "credit": [
        {
            "email": "vinaykmittal@gatech.edu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.mcdonaldlab.biology.gatech.edu/index.htm"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://www.mcdonaldlab.biology.gatech.edu/ltr_struc.htm"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence motif recognition",
                    "uri": "http://edamontology.org/operation_0239"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            },
            {
                "term": "Nucleic acid sites, features and motifs",
                "uri": "http://edamontology.org/topic_3511"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Data mining",
                "uri": "http://edamontology.org/topic_3473"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/ltr_struc-ltr-retrotransposon-structure-program.html"
        }
    ],
    "publication": [
        {
            "abstract": "Motivation: Long terminal repeat (LTR) retrotransposons constitute a substantial fraction of most eukaryotic genomes and are believed to have a significant impact on genome structure and function. Conventional methods used to search for LTR retrotransposons in genome databases are labor intensive. We present an efficient, reliable and automated method to identify and analyze members of this important class of transposable elements. Results: We have developed a new data-mining program, LTRRUC (LTR retrotransposon structure program) which identifies and automatically analyzes LTR retrotransposons in genome databases by searching for structural features characteristic of such elements. LTRRUC has significant advantages over conventional search methods in the case of LTR retrotransposon families having low sequence homology to known queries or families with atypical structure (e.g. non-autonomous elements lacking canonical retroviral ORFs) and is thus a discovery tool that complements established methods. LTRRUC finds LTR retrotransposons using an algorithm that encompasses a number of tasks that would otherwise have to be initiated individually by the user. For each LTR retrotransposon found, LTRRUC automatically generates an analysis of a variety of structural features of biological interest.",
            "authors": [
                "McCarthy E.M.",
                "McDonald J.F."
            ],
            "cit_count": 206,
            "journal": "Bioinformatics",
            "pmid": "12584121",
            "title": "LTR STRUC: A novel search and identification program for LTR retrotransposons",
            "year": "2003-02-12"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:ltr_struc",
        "biotoolsID": "ltr_struc",
        "description": "New data-mining program that scans nucleotide sequence files for LTR retrotransposons and analyzes any resulting hits. Input files can be in fasta or NCBI flat file format.",
        "homepage": "http://www.mcdonaldlab.biology.gatech.edu/ltr_struc.htm",
        "name": "LTR_STRUC"
    }
}