{
    "additionDate": "2017-03-27T12:32:42Z",
    "biotoolsCURIE": "biotools:yeastract",
    "biotoolsID": "yeastract",
    "credit": [
        {
            "name": "Contact Form",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.yeastract.com/contactus.php"
        }
    ],
    "description": "The YEAst Search for Transcriptional Regulators And Consensus Tracking is a curated repository of regulatory associations between transcription factors (TF) and target genes in Saccharomyces cerevisiae. It includes DISCOVERER and allows the identification of documented or potential transcription regulators of a given gene and of documented or potential regulons for each transcription factor.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.yeastract.com/tutorial.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "elixirNode": [
        "Portugal"
    ],
    "elixirPlatform": [
        "Tools"
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Transcription factor binding site prediction",
                    "uri": "http://edamontology.org/operation_0445"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://www.yeastract.com",
    "language": [
        "Java"
    ],
    "lastUpdate": "2021-04-25T09:06:08.558836Z",
    "name": "YEASTRACT",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_006076"
        }
    ],
    "owner": "ptgm",
    "publication": [
        {
            "metadata": {
                "abstract": "The YEAst Search for Transcriptional Regulators And Consensus Tracking (YEASTRACT) information system (http://www.yeastract.com) was developed to support the analysis of transcription regulatory associations in Saccharomyces cerevisiae. Last updated in June 2010, this database contains over 48 200 regulatory associations between transcription factors (TFs) and target genes, including 298 specific DNA-binding sites for 110 characterized TFs. All regulatory associations stored in the database were revisited and detailed information on the experimental evidences that sustain those associations was added and classified as direct or indirect evidences. The inclusion of this new data, gathered in response to the requests of YEASTRACT users, allows the user to restrict its queries to subsets of the data based on the existence or not of experimental evidences for the direct action of the TFs in the promoter region of their target genes. Another new feature of this release is the availability of all data through a machine readable web-service interface. Users are no longer restricted to the set of available queries made available through the existing web interface, and can use the web service interface to query, retrieve and exploit the YEASTRACT data using their own implementation of additional functionalities. The YEASTRACT information system is further complemented with several computational tools that facilitate the use of the curated data when answering a number of important biological questions. Since its first release in 2006, YEASTRACT has been extensively used by hundreds of researchers from all over the world. We expect that by making the new data and services available, the system will continue to be instrumental for yeast biologists and systems biology researchers. © The Author(s) 2010.",
                "authors": [
                    {
                        "name": "Abdulrehman D."
                    },
                    {
                        "name": "Monteiro P.T."
                    },
                    {
                        "name": "Teixeira M.C."
                    },
                    {
                        "name": "Mira N.P."
                    },
                    {
                        "name": "Lourenco A.B."
                    },
                    {
                        "name": "Dos Santos S.C."
                    },
                    {
                        "name": "Cabrito T.R."
                    },
                    {
                        "name": "Francisco A.P."
                    },
                    {
                        "name": "Madeira S.C."
                    },
                    {
                        "name": "Aires R.S."
                    },
                    {
                        "name": "Oliveira A.L."
                    },
                    {
                        "name": "Sa-Correia I."
                    },
                    {
                        "name": "Freitas A.T."
                    }
                ],
                "citationCount": 141,
                "date": "2011-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "YEASTRACT: Providing a programmatic access to curated transcriptional regulatory associations in Saccharomyces cerevisiae through a web services interface"
            },
            "pmid": "20972212"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        }
    ],
    "validated": 1
}