{"credit":[{"email":"yangzhanglab@umich.edu","name":"Yang Zhang Lab","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://zhanglab.ccmb.med.umich.edu/EvoDesign/help.html"}],"function":[{"operation":[{"term":"Protein fold recognition","uri":"http://edamontology.org/operation_0303"},{"term":"Ab initio structure prediction","uri":"http://edamontology.org/operation_0476"},{"term":"Protein geometry calculation","uri":"http://edamontology.org/operation_0249"},{"term":"Scaffolding","uri":"http://edamontology.org/operation_3216"}]}],"labels":{"language":["C++","Fortran","C"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Protein folding, stability and design","uri":"http://edamontology.org/topic_0130"},{"term":"Structure prediction","uri":"http://edamontology.org/topic_0082"},{"term":"Gene and protein families","uri":"http://edamontology.org/topic_0623"},{"term":"Protein folds and structural domains","uri":"http://edamontology.org/topic_0736"},{"term":"Proteins","uri":"http://edamontology.org/topic_0078"}]},"publication":[{"abstract":"Protein design aims to identify new protein sequences of desirable structure and biological function. Most current de novo protein design methods rely on physics-based force fields to search for low free-energy states following Anfinsen's thermodynamic hypothesis. A major obstacle of such approaches is the inaccuracy of the force field design, which cannot accurately describe the atomic interactions or distinguish correct folds. We developed a new web server, EvoDesign, to design optimal protein sequences of given scaffolds along with multiple sequence and structure-based features to assess the foldability and goodness of the designs. EvoDesign uses an evolution-profile-based Monte Carlo search with the profiles constructed from homologous structure families in the Protein Data Bank. A set of local structure features, including secondary structure, torsion angle and solvation, are predicted by single-sequence neural-network training and used to smooth the sequence motif and accommodate the physicochemical packing. The EvoDesign algorithm has been extensively tested in large-scale protein design experiments, which demonstrate enhanced foldability and structural stability of designed sequences compared with the physics-based designing methods. The EvoDesign server is freely available at http://zhanglab.ccmb.med.umich.edu/EvoDesign.","authors":["Mitra P.","Shultis D.","Zhang Y."],"cit_count":17,"journal":"Nucleic acids research","pmid":"23671331","title":"EvoDesign: De novo protein design based on structural and evolutionary profiles.","year":"2013-01-01"}],"summary":{"biotoolsCURIE":"biotools:evodesign","biotoolsID":"evodesign","description":"EvoDesign web server is an evolutionary profile based approach to de novo protein design. Starting from a scaffold of target protein structure, EvoDesign first identifies protein families which have similar fold from the PDB library by TM-align.","homepage":"http://zhanglab.ccmb.med.umich.edu/EvoDesign","name":"EvoDesign"}}