{
    "additionDate": "2020-01-14T09:34:01Z",
    "biotoolsCURIE": "biotools:vapor",
    "biotoolsID": "vapor",
    "confidence_flag": "tool",
    "description": "VAPOR is a tool for classification of Influenza samples from raw short read sequence data for downstream bioinformatics analysis. VAPOR is provided with a fasta file of full-length sequences (> 20,000) for a given segment, a set of reads, and attempts to retrieve a reference that is closest to the sample strain.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "homepage": "https://github.com/connor-lab/vapor",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-16T17:43:36Z",
    "license": "GPL-3.0",
    "name": "VAPOR",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ814",
            "metadata": {
                "abstract": "© The Author(s) 2019.Motivation: Influenza viruses represent a global public health burden due to annual epidemics and pandemic potential. Due to a rapidly evolving RNA genome, inter-species transmission, intra-host variation, and noise in short-read data, reads can be lost during mapping, and de novo assembly can be time consuming and result in misassembly. We assessed read loss during mapping and designed a graph-based classifier, VAPOR, for selecting mapping references, assembly validation and detection of strains of non-human origin. Results: Standard human reference viruses were insufficient for mapping diverse influenza samples in simulation. VAPOR retrieved references for 257 real whole-genome sequencing samples with a mean of > 99:8% identity to assemblies, and increased the proportion of mapped reads by up to 13.3% compared to standard references. VAPOR has the potential to improve the robustness of bioinformatics pipelines for surveillance and could be adapted to other RNA viruses.",
                "authors": [
                    {
                        "name": "Southgate J.A."
                    },
                    {
                        "name": "Bull M.J."
                    },
                    {
                        "name": "Brown C.M."
                    },
                    {
                        "name": "Watkins J."
                    },
                    {
                        "name": "Corden S."
                    },
                    {
                        "name": "Southgate B."
                    },
                    {
                        "name": "Moore C."
                    },
                    {
                        "name": "Connor T.R."
                    }
                ],
                "citationCount": 1,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Influenza classification from short reads with VAPOR facilitates robust mapping pipelines and zoonotic strain detection for routine surveillance applications"
            },
            "pmid": "31693070"
        }
    ],
    "topic": [
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ],
    "validated": 1
}