{
    "accessibility": "Open access",
    "additionDate": "2022-05-08T14:24:43.524310Z",
    "biotoolsCURIE": "biotools:flirt",
    "biotoolsID": "flirt",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Federica Spinola"
        },
        {
            "name": "Martin Maritsch"
        },
        {
            "name": "Simon Föll"
        },
        {
            "name": "Varun Mishra"
        }
    ],
    "description": "FLIRT is a Feature generation tooLkIt for weaRable daTa such as that from your smartwatch or smart ring. With FLIRT you can easily transform wearable data into meaningful features which can then be used for example in machine learning or AI models.",
    "documentation": [
        {
            "type": [
                "General",
                "User manual"
            ],
            "url": "https://flirt.readthedocs.io/en/latest/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/im-ethz/flirt",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-05-08T14:24:43.526841Z",
    "license": "MIT",
    "name": "FLIRT",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.CMPB.2021.106461",
            "metadata": {
                "abstract": "© 2021 The Author(s)Background and Objective: Researchers use wearable sensing data and machine learning (ML) models to predict various health and behavioral outcomes. However, sensor data from commercial wearables are prone to noise, missing, or artifacts. Even with the recent interest in deploying commercial wearables for long-term studies, there does not exist a standardized way to process the raw sensor data and researchers often use highly specific functions to preprocess, clean, normalize, and compute features. This leads to a lack of uniformity and reproducibility across different studies, making it difficult to compare results. To overcome these issues, we present FLIRT: A Feature Generation Toolkit for Wearable Data; it is an open-source Python package that focuses on processing physiological data specifically from commercial wearables with all its challenges from data cleaning to feature extraction. Methods: FLIRT leverages a variety of state-of-the-art algorithms (e.g., particle filters, ML-based artifact detection) to ensure a robust preprocessing of physiological data from wearables. In a subsequent step, FLIRT utilizes a sliding-window approach and calculates a feature vector of more than 100 dimensions – a basis for a wide variety of ML algorithms. Results: We evaluated FLIRT on the publicly available WESAD dataset, which focuses on stress detection with an Empatica E4 wearable. Preprocessing the data with FLIRT ensures that unintended noise and artifacts are appropriately filtered. In the classification task, FLIRT outperforms the preprocessing baseline of the original WESAD paper. Conclusion: FLIRT provides functionalities beyond existing packages that can address unmet needs in physiological data processing and feature generation: (a) integrated handling of common wearable file formats (e.g., Empatica E4 archives), (b) robust preprocessing, and (c) standardized feature generation that ensures reproducibility of results. Nevertheless, while FLIRT comes with a default configuration to accommodate most situations, it offers a highly configurable interface for all of its implemented algorithms to account for specific needs.",
                "authors": [
                    {
                        "name": "Barata F."
                    },
                    {
                        "name": "Fleisch E."
                    },
                    {
                        "name": "Foll S."
                    },
                    {
                        "name": "Kowatsch T."
                    },
                    {
                        "name": "Maritsch M."
                    },
                    {
                        "name": "Mishra V."
                    },
                    {
                        "name": "Spinola F."
                    },
                    {
                        "name": "Wortmann F."
                    }
                ],
                "date": "2021-11-01T00:00:00Z",
                "journal": "Computer Methods and Programs in Biomedicine",
                "title": "FLIRT: A feature generation toolkit for wearable data"
            },
            "pmid": "34736174"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Data quality management",
            "uri": "http://edamontology.org/topic_3572"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        }
    ],
    "validated": 1
}
