{
    "accessibility": "Open access",
    "additionDate": "2024-03-06T11:20:24.194604Z",
    "biotoolsCURIE": "biotools:metaspectrast",
    "biotoolsID": "metaspectrast",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "kehlam@ust.hk",
            "name": "Henry Lam",
            "typeEntity": "Person"
        },
        {
            "email": "patrick.kh.lee@cityu.edu.hk",
            "name": "Patrick K. H. Lee",
            "typeEntity": "Person"
        }
    ],
    "description": "Unsupervised and database-independent analysis workflow for metaproteomic MS/MS data using spectrum clustering. It clusters all experimentally observed MS/MS spectra based on their spectral similarity and create a representative consensus spectrum for each cluster by using the spectrum clustering algorithm implemented in the spectral library search engine, SpectraST.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peptide database search",
                    "uri": "http://edamontology.org/operation_3646"
                },
                {
                    "term": "Rarefaction",
                    "uri": "http://edamontology.org/operation_3797"
                },
                {
                    "term": "Spectral counting",
                    "uri": "http://edamontology.org/operation_3637"
                },
                {
                    "term": "Spectral library search",
                    "uri": "http://edamontology.org/operation_3801"
                },
                {
                    "term": "de Novo sequencing",
                    "uri": "http://edamontology.org/operation_3644"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bravokid47/metaSpectraST",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2024-11-24T14:12:36.787021Z",
    "license": "MIT",
    "name": "metaSpectraST",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/s40168-023-01602-1",
            "metadata": {
                "abstract": "Background: The high diversity and complexity of the microbial community make it a formidable challenge to identify and quantify the large number of proteins expressed in the community. Conventional metaproteomics approaches largely rely on accurate identification of the MS/MS spectra to their corresponding short peptides in the digested samples, followed by protein inference and subsequent taxonomic and functional analysis of the detected proteins. These approaches are dependent on the availability of protein sequence databases derived either from sample-specific metagenomic data or from public repositories. Due to the incompleteness and imperfections of these protein sequence databases, and the preponderance of homologous proteins expressed by different bacterial species in the community, this computational process of peptide identification and protein inference is challenging and error-prone, which hinders the comparison of metaproteomes across multiple samples. Results: We developed metaSpectraST, an unsupervised and database-independent metaproteomics workflow, which quantitatively profiles and compares metaproteomics samples by clustering experimentally observed MS/MS spectra based on their spectral similarity. We applied metaSpectraST to fecal samples collected from littermates of two different mother mice right after weaning. Quantitative proteome profiles of the microbial communities of different mice were obtained without any peptide-spectrum identification and used to evaluate the overall similarity between samples and highlight any differentiating markers. Compared to the conventional database-dependent metaproteomics analysis, metaSpectraST is more successful in classifying the samples and detecting the subtle microbiome changes of mouse gut microbiomes post-weaning. metaSpectraST could also be used as a tool to select the suitable biological replicates from samples with wide inter-individual variation. Conclusions: metaSpectraST enables rapid profiling of metaproteomic samples quantitatively, without the need for constructing the protein sequence database or identification of the MS/MS spectra. It maximally preserves information contained in the experimental MS/MS spectra by clustering all of them first and thus is able to better profile the complex microbial communities and highlight their functional changes, as compared with conventional approaches. tag the videobyte in this section as ESM4 [MediaObject not available: see fulltext.].",
                "authors": [
                    {
                        "name": "Elias J.E."
                    },
                    {
                        "name": "Hao C."
                    },
                    {
                        "name": "Lam H."
                    },
                    {
                        "name": "Lee P.K.H."
                    }
                ],
                "citationCount": 1,
                "date": "2023-12-01T00:00:00Z",
                "journal": "Microbiome",
                "title": "metaSpectraST: an unsupervised and database-independent analysis workflow for metaproteomic MS/MS data using spectrum clustering"
            },
            "pmcid": "PMC10405559",
            "pmid": "37550758"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Workflow"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
