{
    "additionDate": "2021-01-18T10:20:23Z",
    "biotoolsCURIE": "biotools:hubviz",
    "biotoolsID": "hubviz",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Ick Hoon Jin",
            "typeEntity": "Person"
        },
        {
            "email": "chung.911@osu.edu",
            "name": "Dongjun Chung",
            "typeEntity": "Person"
        }
    ],
    "description": "A Novel Tool for Hub-centric Visualization.\n\nhubViz (a novel tool for hub-centric Visualization) is a novel tool for hub-centric visualization which is based on a latent space joint model (LSJM) for visualization. ‘hubviz’ package provides computationally efficient and user friendly interface to fit the hubViz models. The following help pages provide a good start point for the genetic analysis using the ‘hubviz’ package, including the overview of ‘hubviz’ package and the example command lines:.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "homepage": "https://dongjunchung.github.io/hubviz/",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-01T08:46:48Z",
    "name": "hubViz",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/J.CHEMOLAB.2020.104071",
            "metadata": {
                "abstract": "© 2020 Elsevier B.V.Visualization algorithms have been widely used for intuitive interrogation of genomic data and popularly used tools include MDS, t-SNE, and UMAP. However, these algorithms are not tuned for the visualization of binary data and none of them consider the hubness of observations for the visualization. In order to address these limitations, here we propose hubViz, a novel tool for hub-centric visualization of binary data. We evaluated the performance of hubViz with its application to the gene expression data measured in multiple brain regions of rats exposed to cocaine, the single-cell RNA-seq data of peripheral blood mononuclear cells treated with interferon beta, and the literature mining data to investigate relationships among diseases. We further evaluated the performance of hubViz using simulation studies. We showed that hubViz provides effective visual inspection by locating the hub in the center and the contrasting elements in the opposite sides around the center. We believe that hubViz and its software can be powerful tools that can improve visualizations of various genomic data. The hubViz is implemented as an R package hubviz, which is publicly available at https://dongjunchung.github.io/hubviz/.",
                "authors": [
                    {
                        "name": "Nam J.H."
                    },
                    {
                        "name": "Yun J."
                    },
                    {
                        "name": "Jin I.H."
                    },
                    {
                        "name": "Chung D."
                    }
                ],
                "date": "2020-08-15T00:00:00Z",
                "journal": "Chemometrics and Intelligent Laboratory Systems",
                "title": "hubViz: A novel tool for hub-centric visualization"
            },
            "pmcid": "PMC7402588",
            "pmid": "32753773"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ]
}