{
    "additionDate": "2017-12-18T00:06:31Z",
    "biotoolsCURIE": "biotools:fasturec",
    "biotoolsID": "fasturec",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.mimuw.edu.pl/~gorecki/"
        }
    ],
    "description": "Fasturec is a software for the inference of an optimal species tree under duplication and duplicaion-loss cost from a set of unrooted gene trees.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bioputer.mimuw.edu.pl/gorecki/fasturec/README"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://bioputer.mimuw.edu.pl/gorecki/fasturec/",
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/fasturec-20120209-local-search-algorithms-gene-tree-parsimony-problems.html"
        }
    ],
    "name": "Fasturec",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1007/978-3-642-30191-9_11",
            "metadata": {
                "abstract": "Gene tree parsimony (GTP) problems infer species supertrees from a collection of rooted gene trees that are confounded by evolutionary events like gene duplication, gene duplication and loss, and deep coalescence. These problems are NP-complete, and consequently, they often are addressed by effective local search heuristics that perform a stepwise search of the tree space, where each step is guided by an exact solution to an instance of a local search problem. Still, GTP problems require rooted input gene trees; however, in practice, most phylogenetic methods infer unrooted gene trees and it may be difficult to root correctly. In this work, we (i) define the first local NNI search problems to solve heuristically the GTP equivalents for unrooted input gene trees, called unrooted GTP problems, and (ii) describe linear time algorithms for these local search problems. We implemented the first NNI based local search heuristics for unrooted GTP problems, which enable analyses for thousands of genes. Further, analysis of a large plant data set using the unrooted NNI search provides support for an intriguing new hypothesis regarding the evolutionary relationships among major groups of flowering plants. © 2012 Springer-Verlag.",
                "authors": [
                    {
                        "name": "Burleigh J.G."
                    },
                    {
                        "name": "Eulenstein O."
                    },
                    {
                        "name": "Gorecki P."
                    }
                ],
                "citationCount": 10,
                "date": "2012-05-22T00:00:00Z",
                "journal": "Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics)",
                "title": "GTP supertrees from unrooted gene trees: Linear time algorithms for NNI based local searches"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        }
    ],
    "validated": 1,
    "version": [
        "20150126"
    ]
}
