
{
    "credit": [
        {
            "email": "lskatz@gatech.edu",
            "name": "Lee S. Katz",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://mgip.biology.gatech.edu/contact.php"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://mgip.biology.gatech.edu/ODfaq/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application",
            "Suite"
        ],
        "topic": [
            {
                "term": "Informatics",
                "uri": "http://edamontology.org/topic_0605"
            },
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            },
            {
                "term": "Public health and epidemiology",
                "uri": "http://edamontology.org/topic_3305"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/mgip-meningococcus-genome-informatics-platform.html"
        }
    ],
    "publication": [
        {
            "abstract": "The Meningococcus Genome Informatics Platform (MGIP) is a suite of computational tools for the analysis of multilocus sequence typing (MLST) data, at http://mgip.biology.gatech.edu. MLST is used to generate allelic profiles to characterize strains of Neisseria meningitidis, a major cause of bacterial meningitis worldwide. Neisseria meningitidis strains are characterized with MLST as specific sequence types (ST) and clonal complexes (CC) based on the DNA sequences at defined loci. These data are vital to molecular epidemiology studies of N. meningitidis, including outbreak investigations and population biology. MGIP analyzes DNA sequence trace files, returns individual allele calls and characterizes the STs and CCs. MGIP represents a substantial advance over existing software in several respects: (i) ease of use - MGIP is user friendly, intuitive and thoroughly documented; (ii) flexibility - because MGIP is a website, it is compatible with any computer with an internet connection, can be used from any geographic location, and there is no installation; (iii) speed - MGIP takes just over one minute to process a set of 96 trace files; and (iv) expandability - MGIP has the potential to expand to more loci than those used in MLST and even to other bacterial species.",
            "authors": [
                "Katz L.S.",
                "Bolen C.R.",
                "Harcourt B.H.",
                "Schmink S.",
                "Wang X.",
                "Kislyuk A.",
                "Taylor R.T.",
                "Mayer L.W.",
                "Jordan I.K."
            ],
            "cit_count": 8,
            "journal": "Nucleic Acids Research",
            "pmid": "19468047",
            "title": "Meningococcus genome informatics platform: A system for analyzing multilocus sequence typing data",
            "year": "2009-08-04"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:mgip",
        "biotoolsID": "mgip",
        "description": "Suite of computational tools for the analysis of multilocus sequence typing data. Input DNA sequence files are analyzed to provide allele calls, and to characterize the specific sequence type and clonal complex of the Neisseria meningitidis strain.",
        "homepage": "http://mgip.biology.gatech.edu",
        "name": "MGIP"
    }
}