{
    "additionDate": "2019-11-14T20:11:39Z",
    "biotoolsCURIE": "biotools:qt",
    "biotoolsID": "qt",
    "confidence_flag": "tool",
    "description": "Quality Threshold Clustering of Molecular Dynamics | Clustering Molecular Dynamics trajectories is a common analysis that allows grouping together similar conformations. Several algorithms have been designed and optimized to perform this routine task and among them, Quality Threshold (QT) stands as a very attractive option. QT guarantees that in retrieved clusters, no pair of frames will have a similarity value greater than a specified threshold and hence a set of strongly correlated frames is obtained for each cluster. For more information about QT, please refer to Heyer et. al. work (Heyer, L. J.; Kruglyak, S.; Yooseph, S. Exploring Expression Data: Identification and Analysis of Coexpressed Genes. 1999, No. 213, 1106–1115. Genome Research) | Python Implementation of Quality Threshold Clustering for Molecular Dynamics | A python implementation of Heyer, 1999's Quality Threshold clustering algorithm specialized for molecular dynamics trajectories",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                }
            ]
        }
    ],
    "homepage": "https://github.com/rglez/QT",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-11T15:00:44Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/rglez/QT"
        }
    ],
    "name": "Quality Threshold Clustering Molecular Dynamics",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.9B00558",
            "metadata": {
                "abstract": "Copyright © 2019 American Chemical Society.Clustering Molecular Dynamics trajectories is a common analysis that allows grouping together similar conformations. Several algorithms have been designed and optimized to perform this routine task, and among them, Quality Threshold stands as a very attractive option. This algorithm guarantees that in retrieved clusters no pair of frames will have a similarity value greater than a specified threshold, and hence, a set of strongly correlated frames are obtained for each cluster. In this work, it is shown that various commonly used software implementations are flawed by confusing Quality Threshold with another simplistic well-known clustering algorithm published by Daura et al. (Daura, X.; van Gunsteren, W. F.; Jaun, B.; Mark, A. E.; Gademann, K.; Seebach, D. Peptide Folding: When Simulation Meets Experiment. Angew. Chemie Int. Ed. 1999, 38 (1/2), 236-240). Daura's algorithm does not impose any quality threshold for the frames contained in retrieved clusters, bringing unrelated structural configurations altogether. The advantages of using Quality Threshold whenever possible to explore Molecular Dynamic trajectories is exemplified. An in-house implementation of the original Quality Threshold algorithm has been developed in order to illustrate our comments, and its code is freely available for further use by the scientific community.",
                "authors": [
                    {
                        "name": "Gonzalez-Aleman R."
                    },
                    {
                        "name": "Hernandez-Castillo D."
                    },
                    {
                        "name": "Caballero J."
                    },
                    {
                        "name": "Montero-Cabrera L.A."
                    }
                ],
                "citationCount": 11,
                "date": "2020-02-24T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "Quality Threshold Clustering of Molecular Dynamics: A Word of Caution"
            },
            "pmid": "31532987"
        }
    ],
    "topic": [
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Biophysics",
            "uri": "http://edamontology.org/topic_3306"
        }
    ],
    "validated": 1
}