{
    "additionDate": "2021-12-06T13:21:42.277531Z",
    "biotoolsCURIE": "biotools:steroidxtract",
    "biotoolsID": "steroidxtract",
    "confidence_flag": "tool",
    "cost": "Free of charge (with restrictions)",
    "description": "SteroidXtract is a deep-learning based bioinformatics tool for steroid MS2 extraction from untargeted metabolomics data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Natural product identification",
                    "uri": "http://edamontology.org/operation_3803"
                },
                {
                    "term": "Spectrum calculation",
                    "uri": "http://edamontology.org/operation_3860"
                },
                {
                    "term": "Spectral counting",
                    "uri": "http://edamontology.org/operation_3637"
                },
                {
                    "term": "iTRAQ",
                    "uri": "http://edamontology.org/operation_3639"
                }
            ]
        }
    ],
    "homepage": "https://github.com/HuanLab/SteroidXtract",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2021-12-06T13:21:42.280008Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/HuanLab/SteroidXtract/issues"
        }
    ],
    "name": "SteroidXtract",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1021/ACS.ANALCHEM.0C04834",
            "metadata": {
                "abstract": "© Despite the vast amount of metabolic information that can be captured in untargeted metabolomics, many biological applications are looking for a biology-driven metabolomics platform that targets a set of metabolites that are relevant to the given biological question. Steroids are a class of important molecules that play critical roles in many physiological systems and diseases. Besides known steroids, there are a large number of unknown steroids that have not been reported in the literature. The ability to rapidly detect and quantify both known and unknown steroid molecules in a biological sample can greatly accelerate a broad range of steroid-focused life science research. This work describes the development and application of SteroidXtract, a convolutional neural network (CNN)-based bioinformatics tool that can recognize steroid molecules in mass spectrometry (MS)-based untargeted metabolomics using their unique tandem MS (MS2) spectral patterns. SteroidXtract was trained using a comprehensive set of standard MS2 spectra from MassBank of North America (MoNA) and an in-house steroid library. Data augmentation strategies, including intensity thresholding and Gaussian noise addition, were created and applied to minimize data overfitting caused by the limited number of standard steroid MS2 spectra. The CNN model embedded in SteroidXtract was further compared with random forest and XGBoost using nested cross-validations to demonstrate its performance. Finally, SteroidXtract was applied in several metabolomics studies to demonstrate its sensitivity, specificity, and robustness. Compared to conventional statistics-driven metabolomics data interpretation, our work offers a novel automated biology-driven approach to interpreting untargeted metabolomics data, prioritizing biologically important molecules with high throughput and sensitivity.",
                "authors": [
                    {
                        "name": "Xing S."
                    },
                    {
                        "name": "Jiao Y."
                    },
                    {
                        "name": "Salehzadeh M."
                    },
                    {
                        "name": "Soma K.K."
                    },
                    {
                        "name": "Huan T."
                    }
                ],
                "citationCount": 1,
                "date": "2021-04-13T00:00:00Z",
                "journal": "Analytical Chemistry",
                "title": "SteroidXtract: Deep Learning-Based Pattern Recognition Enables Comprehensive and Rapid Extraction of Steroid-Like Metabolic Features for Automated Biology-Driven Metabolomics"
            },
            "pmid": "33784068"
        }
    ],
    "toolType": [
        "Workbench",
        "Suite"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ]
}