{
    "additionDate": "2019-11-14T18:38:18Z",
    "biotoolsCURIE": "biotools:extrarg",
    "biotoolsID": "extrarg",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "pvikes@vt.edu",
            "name": "Peter Vikesland",
            "orcidid": "https://orcid.org/0000-0003-2654-5132",
            "typeEntity": "Person"
        }
    ],
    "description": "Identification of discriminatory antibiotic resistance genes among environmental resistomes using extremely randomized tree algorithm | Extract discriminatory ARGs from metagenomics samples",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                }
            ]
        }
    ],
    "homepage": "https://github.com/gaarangoa/ExtrARG",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-02T14:51:33Z",
    "license": "BSD-2-Clause",
    "name": "ExtrARG",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S40168-019-0735-1",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: The interconnectivities of built and natural environments can serve as conduits for the proliferation and dissemination of antibiotic resistance genes (ARGs). Several studies have compared the broad spectrum of ARGs (i.e., \"resistomes\") in various environmental compartments, but there is a need to identify unique ARG occurrence patterns (i.e., \"discriminatory ARGs\"), characteristic of each environment. Such an approach will help to identify factors influencing ARG proliferation, facilitate development of relative comparisons of the ARGs distinguishing various environments, and help pave the way towards ranking environments based on their likelihood of contributing to the spread of clinically relevant antibiotic resistance. Here we formulate and demonstrate an approach using an extremely randomized tree (ERT) algorithm combined with a Bayesian optimization technique to capture ARG variability in environmental samples and identify the discriminatory ARGs. The potential of ERT for identifying discriminatory ARGs was first evaluated using in silico metagenomic datasets (simulated metagenomic Illumina sequencing data) with known variability. The application of ERT was then demonstrated through analyses using publicly available and in-house metagenomic datasets associated with (1) different aquatic habitats (e.g., river, wastewater influent, hospital effluent, and dairy farm effluent) to compare resistomes between distinct environments and (2) different river samples (i.e., Amazon, Kalamas, and Cam Rivers) to compare resistome characteristics of similar environments. Results: The approach was found to readily identify discriminatory ARGs in the in silico datasets. Also, it was not found to be biased towards ARGs with high relative abundance, which is a common limitation of feature projection methods, and instead only captured those ARGs that elicited significant profiles. Analyses of publicly available metagenomic datasets further demonstrated that the ERT approach can effectively differentiate real-world environmental samples and identify discriminatory ARGs based on pre-defined categorizing schemes. Conclusions: Here a new methodology was formulated to characterize and compare variances in ARG profiles between metagenomic data sets derived from similar/dissimilar environments. Specifically, identification of discriminatory ARGs among samples representing various environments can be identified based on factors of interest. The methodology could prove to be a particularly useful tool for ARG surveillance and the assessment of the effectiveness of strategies for mitigating the spread of antibiotic resistance. The python package is hosted in the Git repository: https://github.com/gaarangoa/ExtrARG",
                "authors": [
                    {
                        "name": "Gupta S."
                    },
                    {
                        "name": "Arango-Argoty G."
                    },
                    {
                        "name": "Zhang L."
                    },
                    {
                        "name": "Pruden A."
                    },
                    {
                        "name": "Vikesland P."
                    }
                ],
                "citationCount": 13,
                "date": "2019-08-29T00:00:00Z",
                "journal": "Microbiome",
                "title": "Identification of discriminatory antibiotic resistance genes among environmental resistomes using extremely randomized tree algorithm"
            },
            "pmcid": "PMC6716844",
            "pmid": "31466530"
        }
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        }
    ],
    "validated": 1
}