
{
    "credit": [
        {
            "name": "Contact Form",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://kbase.us/contact-us/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://kbase.us/kbase-documentation/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Annotation",
                    "uri": "http://edamontology.org/operation_0226"
                }
            ]
        }
    ],
    "labels": {
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows"
        ],
        "toolType": [
            "Workflow"
        ],
        "topic": [
            {
                "term": "Comparative genomics",
                "uri": "http://edamontology.org/topic_0797"
            }
        ]
    },
    "publication": [
        {
            "abstract": "KBase is a customizable development tool for building knowledge-based systems that are compatible with DBase III tables. Currently, most tools for developing knowledge-based systems do not integrate well with databases. DBase III is the most common database system used in the personal computer environment. KBase is built such that all DBase III commands and functions are supported. Furthermore, customizing and extending KBase is as easy as programming in DBase. This flexibility arises because KBase is built using the \"C\" programming language and Clipper, a DBase compiler. Using Clipper also allows KBase to use many functions in the Clipper library. In this paper, we describe how KBase's design is conceived. At the end, we also give a brief tour of the program with an implemented example to illustrate its application. © 1989.",
            "authors": [
                "Soh C.-K.",
                "Soh A.-K.",
                "Lai K.-Y."
            ],
            "cit_count": 11,
            "doi": "10.1016/0141-1195(89)90043-0",
            "journal": "Advances in Engineering Software (1978)",
            "title": "KBase: A customizable tool for building DBase-compatible knowledge-based systems",
            "type": "Primary",
            "year": "1989-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:kbase",
        "biotoolsID": "kbase",
        "description": "The first large-scale bioinformatics system that enables users to upload their own data, analyze it (along with collaborator and public data), build increasingly realistic models, and share and publish their workflows and conclusions. KBase aims to provide a knowledgebase: an integrated environment where knowledge and insights are created and multiplied.",
        "homepage": "http://kbase.us/",
        "name": "KBASE"
    }
}