{
    "additionDate": "2021-01-18T10:04:48Z",
    "biotoolsCURIE": "biotools:power-contours",
    "biotoolsID": "power-contours",
    "confidence_flag": "tool",
    "description": "Optimising sample size and precision in experimental psychology and human neuroscience.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://shiny.york.ac.uk/powercontours/",
    "lastUpdate": "2021-01-24T15:32:15Z",
    "name": "power contours",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1037/MET0000337",
            "metadata": {
                "abstract": "© 2020 2020 The Author(s).When designing experimental studies with human participants, experimenters must decide how many trials each participant will complete, as well as how many participants to test. Most discussion of statistical power (the ability of a study design to detect an effect) has focused on sample size, and assumed sufficient trials. Here we explore the influence of both factors on statistical power, represented as a 2-dimensional plot on which iso-power contours can be visualized. We demonstrate the conditions under which the number of trials is particularly important, that is, when the within-participant variance is large relative to the between-participants variance. We then derive power contour plots using existing data sets for 8 experimental paradigms and methodologies (including reaction times, sensory thresholds, fMRI, MEG, and EEG), and provide example code to calculate estimates of the within- and betweenparticipants variance for each method. In all cases, the within-participant variance was larger than the between-participants variance, meaning that the number of trials has a meaningful influence on statistical power in commonly used paradigms. An online tool is provided (https://shiny.york.ac.uk/powercontours/) for generating power contours, from which the optimal combination of trials and participants can be calculated when designing future studies.",
                "authors": [
                    {
                        "name": "Baker D.H."
                    },
                    {
                        "name": "Vilidaite G."
                    },
                    {
                        "name": "Lygo F.A."
                    },
                    {
                        "name": "Smith A.K."
                    },
                    {
                        "name": "Flack T.R."
                    },
                    {
                        "name": "Gouws A.D."
                    },
                    {
                        "name": "Andrews T.J."
                    }
                ],
                "citationCount": 5,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Psychological Methods",
                "title": "Power Contours: Optimising Sample Size and Precision in Experimental Psychology and Human Neuroscience"
            },
            "pmid": "32673043"
        }
    ],
    "topic": [
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ]
}