{
    "accessibility": "Open access",
    "additionDate": "2022-09-29T22:52:07.900069Z",
    "biotoolsCURIE": "biotools:plantphonedb",
    "biotoolsID": "plantphonedb",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "zhenghl@xmu.edu.cn",
            "name": "Hai-Lei Zheng",
            "orcidid": "https://orcid.org/0000-0001-8588-1529"
        },
        {
            "name": "Chaoqun Xu"
        },
        {
            "name": "Dongna Ma"
        },
        {
            "name": "Qiansu Ding"
        },
        {
            "name": "Ying Zhou"
        }
    ],
    "description": "A manually curated pan-plant database of ligand-receptor pairs infers cell-cell communication.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Gene symbol",
                        "uri": "http://edamontology.org/data_1026"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "https://jasonxu.shinyapps.io/PlantPhoneDB/",
    "lastUpdate": "2022-09-29T22:52:07.902559Z",
    "name": "PlantPhoneDB",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1111/PBI.13893",
            "metadata": {
                "abstract": "© 2022 The Authors. Plant Biotechnology Journal published by Society for Experimental Biology and The Association of Applied Biologists and John Wiley & Sons Ltd.Ligand-receptor pairs play important roles in cell–cell communication for multicellular organisms in response to environmental cues. Recently, the emergence of single-cell RNA-sequencing (scRNA-seq) provides unprecedented opportunities to investigate cellular communication based on ligand-receptor expression. However, so far, no reliable ligand-receptor interaction database is available for plant species. In this study, we developed PlantPhoneDB (https://jasonxu.shinyapps.io/PlantPhoneDB/), a pan-plant database comprising a large number of high-confidence ligand-receptor pairs manually curated from seven resources. Also, we developed a PlantPhoneDB R package, which not only provided optional four scoring approaches that calculate interaction scores of ligand-receptor pairs between cell types but also provided visualization functions to present analysis results. At the PlantPhoneDB web interface, the processed datasets and results can be searched, browsed, and downloaded. To uncover novel cell–cell communication events in plants, we applied the PlantPhoneDB R package on GSE121619 dataset to infer significant cell–cell interactions of heat-shocked root cells in Arabidopsis thaliana. As a result, the PlantPhoneDB predicted the actively communicating AT1G28290-AT2G14890 ligand-receptor pair in atrichoblast–cortex cell pair in Arabidopsis thaliana. Importantly, the downstream target genes of this ligand-receptor pair were significantly enriched in the ribosome pathway, which facilitated plants adapting to environmental changes. In conclusion, PlantPhoneDB provided researchers with integrated resources to infer cell–cell communication from scRNA-seq datasets.",
                "authors": [
                    {
                        "name": "Ding Q."
                    },
                    {
                        "name": "Ma D."
                    },
                    {
                        "name": "Xu C."
                    },
                    {
                        "name": "Zheng H.-L."
                    },
                    {
                        "name": "Zhou Y."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Plant Biotechnology Journal",
                "title": "PlantPhoneDB: A manually curated pan-plant database of ligand-receptor pairs infers cell–cell communication"
            },
            "pmid": "35842742"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
