
{
    "credit": [
        {
            "email": "clarepacini@gmail.com",
            "name": "C. Pacini",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://bioconductor.org/packages/release/bioc/html/covEB.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/covEB_1.0.0.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "language": [
            "R"
        ],
        "license": "GPL-3.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "Applied mathematics",
                "uri": "http://edamontology.org/topic_3569"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2017 The Author(s). Background: Correlation matrices are important in inferring relationships and networks between regulatory or signalling elements in biological systems. With currently available technology sample sizes for experiments are typically small, meaning that these correlations can be difficult to estimate. At a genome-wide scale estimation of correlation matrices can also be computationally demanding. Results: We develop an empirical Bayes approach to improve covariance estimates for gene expression, where we assume the covariance matrix takes a block diagonal form. Our method shows lower false discovery rates than existing methods on simulated data. Applied to a real data set from Bacillus subtilis we demonstrate it's ability to detecting known regulatory units and interactions between them. Conclusions: We demonstrate that, compared to existing methods, our method is able to find significant covariances and also to control false discovery rates, even when the sample size is small (n=10). The method can be used to find potential regulatory networks, and it may also be used as a pre-processing step for methods that calculate, for example, partial correlations, so enabling the inference of the causal and hierarchical structure of the networks.",
            "authors": [
                "Pacini C.",
                "Ajioka J.W.",
                "Micklem G."
            ],
            "cit_count": 0,
            "doi": "10.1186/s12859-017-1623-y",
            "journal": "BMC Bioinformatics",
            "title": "Empirical Bayes method for reducing false discovery rates of correlation matrices with block diagonal structure",
            "type": "Other",
            "year": "2017-04-12"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:coveb",
        "biotoolsID": "coveb",
        "description": "Using bayesian methods to estimate correlation matrices assuming that they can be written and estimated as block diagonal matrices. These block diagonal matrices are determined using shrinkage parameters that values below this parameter to zero.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/covEB.html",
        "name": "covEB",
        "version": [
            "1.0.0"
        ]
    }
}