
{
    "credit": [
        {
            "email": "x.didelot@imperial.ac.uk",
            "name": "Xavier Didelot",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://github.com/caitiecollins/treeWAS/wiki"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree generation",
                    "uri": "http://edamontology.org/operation_0323"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "GWAS study",
                "uri": "http://edamontology.org/topic_3517"
            },
            {
                "term": "Phylogenetics",
                "uri": "http://edamontology.org/topic_3293"
            },
            {
                "term": "Machine learning",
                "uri": "http://edamontology.org/topic_3474"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2018 Collins, Didelot. Genome-Wide Association Studies (GWAS) in microbial organisms have the potential to vastly improve the way we understand, manage, and treat infectious diseases. Yet, microbial GWAS methods established thus far remain insufficiently able to capitalise on the growing wealth of bacterial and viral genetic sequence data. Facing clonal population structure and homologous recombination, existing GWAS methods struggle to achieve both the precision necessary to reject spurious findings and the power required to detect associations in microbes. In this paper, we introduce a novel phylogenetic approach that has been tailor-made for microbial GWAS, which is applicable to organisms ranging from purely clonal to frequently recombining, and to both binary and continuous phenotypes. Our approach is robust to the confounding effects of both population structure and recombination, while maintaining high statistical power to detect associations. Thorough testing via application to simulated data provides strong support for the power and specificity of our approach and demonstrates the advantages offered over alternative cluster-based and dimension-reduction methods. Two applications to Neisseria meningitidis illustrate the versatility and potential of our method, confirming previously-identified penicillin resistance loci and resulting in the identification of both well-characterised and novel drivers of invasive disease. Our method is implemented as an open-source R package called treeWAS which is freely available at https://github.com/caitiecollins/treeWAS.",
            "authors": [
                "Collins C.",
                "Didelot X."
            ],
            "cit_count": 7,
            "doi": "10.1371/journal.pcbi.1005958",
            "journal": "PLoS Computational Biology",
            "title": "A phylogenetic method to perform genome-wide association studies in microbes that accounts for population structure and recombination",
            "type": "Primary",
            "year": "2018-02-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:treewas",
        "biotoolsID": "treewas",
        "description": "A Phylogenetic Tree-Based Tool for Genome-Wide Association Studies in Microbes",
        "homepage": "https://github.com/caitiecollins/treeWAS",
        "name": "treeWAS"
    }
}