{
    "additionDate": "2021-01-18T09:20:31Z",
    "biotoolsCURIE": "biotools:chemfate",
    "biotoolsID": "chemfate",
    "confidence_flag": "tool",
    "description": "ChemFate predicts daily chemical environmental concentrations for four classes of chemicals in nine environmental compartments (e.g., air, freshwater, coastal seawater, natural soil, urban soil, agricultural soil with and without applied biosolids). ChemFate comprises four different models:.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Ecological modelling",
                    "uri": "http://edamontology.org/operation_3946"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/klaris-ak/ChemFate",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-11T14:56:10Z",
    "name": "ChemFate",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.CHEMOSPHERE.2020.126897",
            "metadata": {
                "abstract": "Copyright © 2020 Elsevier Ltd. All rights reserved.With the ever-increasing development on novel chemicals and materials, with radically different properties and environmental behavior, it is challenging to compare their environmental behavior under similar conditions. For example, pesticides may be non-ionizable organics, ionizable organics, metal ion-based, or nanomaterials. These very different chemicals behave very differently. To date, no single modeling platform can handle all adequately, in a dynamic framework that accounts for actual variability in meteorology, rates of release to the environment, and the actual characteristics of the region of interest. Here we present ChemFate, a framework to address this challenge, by incorporating four different fate and transport models, each to address these four classes of chemicals (non-ionizable organics, ionizable organics, metal ion-based, or nanomaterials). We build upon established models, but have incorporated a number of additional processes. After demonstrating that the individual models comparable favorably with observed data and the previous models, under similar conditions, we conducted a case study with four radically different fungicides, used in the Central Valley, California. We found that although the concentrations of the non-ionizable and ionizable organic fungicide spike after application and temporarily may exceed toxicity thresholds for Daphnia Magna, they do not accumulate over time, while the metal ion and metallic nanoparticle result in increasing accumulation of Cu2+, eventually exceeding the toxicity threshold during runoff events. This case study demonstrates the value of a framework that allows the comparison of different classes of chemicals under the same conditions.",
                "authors": [
                    {
                        "name": "Tao M."
                    },
                    {
                        "name": "Keller A.A."
                    }
                ],
                "citationCount": 1,
                "date": "2020-09-01T00:00:00Z",
                "journal": "Chemosphere",
                "title": "ChemFate: A fate and transport modeling framework for evaluating radically different chemicals under comparable conditions"
            },
            "pmid": "32402873"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Toxicology",
            "uri": "http://edamontology.org/topic_2840"
        },
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        },
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        }
    ]
}