{
    "accessibility": "Open access",
    "additionDate": "2022-04-26T13:14:27.340032Z",
    "biotoolsCURIE": "biotools:lmt_usv_toolbox",
    "biotoolsID": "lmt_usv_toolbox",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "eye@igbmc.fr",
            "name": "Elodie Ey",
            "typeEntity": "Person"
        },
        {
            "email": "fabrice.de-chaumont@pasteur.fr",
            "name": "Fabrice de Chaumont",
            "typeEntity": "Person"
        },
        {
            "name": "Nathalie Lemière"
        },
        {
            "name": "Sabrina Coqueran"
        },
        {
            "name": "Thomas Bourgeron"
        }
    ],
    "description": "Novel Methodological Approach to Place Mouse Ultrasonic Vocalizations in Their Behavioral Contexts.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://usv.pasteur.cloud",
    "lastUpdate": "2022-04-26T13:14:35.449520Z",
    "name": "LMT USV Toolbox",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/FNBEH.2021.735920",
            "metadata": {
                "abstract": "© Copyright © 2021 de Chaumont, Lemière, Coqueran, Bourgeron and Ey.Ultrasonic vocalizations (USVs) are used as a phenotypic marker in mouse models of neuropsychiatric disorders. Nevertheless, current methodologies still require time-consuming manual input or sound recordings clean of any background noise. We developed a method to overcome these two restraints to boost knowledge on mouse USVs. The methods are freely available and the USV analysis runs online at https://usv.pasteur.cloud. As little is currently known about usage and structure of ultrasonic vocalizations during social interactions over the long-term and in unconstrained context, we investigated mouse spontaneous communication by coupling the analysis of USVs with automatic labeling of behaviors. We continuously recorded during 3 days undisturbed interactions of same-sex pairs of C57BL/6J sexually naive males and females at 5 weeks and 3 and 7 months of age. In same-sex interactions, we observed robust differences between males and females in the amount of USVs produced, in the acoustic structure and in the contexts of emission. The context-specific acoustic variations emerged with increasing age. The emission of USVs also reflected a high level of excitement during social interactions. We finally highlighted the importance of studying long-term spontaneous communication by investigating female mice lacking Shank3, a synaptic protein associated with autism. While the previous short-time constrained investigations could not detect USV emission abnormalities, our analysis revealed robust differences in the usage and structure of the USVs emitted by mutant mice compared to wild-type female pairs.",
                "authors": [
                    {
                        "name": "Bourgeron T."
                    },
                    {
                        "name": "Coqueran S."
                    },
                    {
                        "name": "Ey E."
                    },
                    {
                        "name": "Lemiere N."
                    },
                    {
                        "name": "de Chaumont F."
                    }
                ],
                "citationCount": 1,
                "date": "2021-10-13T00:00:00Z",
                "journal": "Frontiers in Behavioral Neuroscience",
                "title": "LMT USV Toolbox, a Novel Methodological Approach to Place Mouse Ultrasonic Vocalizations in Their Behavioral Contexts—A Study in Female and Male C57BL/6J Mice and in Shank3 Mutant Females"
            },
            "pmcid": "PMC8548730",
            "pmid": "34720899"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ],
    "validated": 1
}
