{
    "additionDate": "2022-10-10T07:04:02.060616Z",
    "biotoolsCURIE": "biotools:peplife",
    "biotoolsID": "peplife",
    "credit": [
        {
            "name": "Dr Gajendra P.S. Raghava",
            "url": "https://webs.iiitd.edu.in/raghava/peplife/index.php"
        }
    ],
    "description": "PEPlife is a manually curated database of experimentally validated therapeutic peptides and their half-lives.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/peplife/index.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "https://webs.iiitd.edu.in/raghava/peplife/index.php",
    "lastUpdate": "2022-10-10T07:04:07.738263Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/peplife/index.php"
        }
    ],
    "name": "peplife",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "raghavagps",
    "publication": [
        {
            "doi": "10.1038/srep36617",
            "metadata": {
                "abstract": "© The Author(s) 2016.Short half-life is one of the key challenges in the field of therapeutic peptides. Various studies have reported enhancement in the stability of peptides using methods like chemical modifications, D-amino acid substitution, cyclization, replacement of labile aminos acids, etc. In order to study this scattered data, there is a pressing need for a repository dedicated to the half-life of peptides. To fill this lacuna, we have developed PEPlife (http://crdd.osdd.net/raghava/peplife), a manually curated resource of experimentally determined half-life of peptides. PEPlife contains 2229 entries covering 1193 unique peptides. Each entry provides detailed information of the peptide, like its name, sequence, half-life, modifications, the experimental assay for determining half-life, biological nature and activity of the peptide. We also maintain SMILES and structures of peptides. We have incorporated web-based modules to offer user-friendly data searching and browsing in the database. PEPlife integrates numerous tools to perform various types of analysis such as BLAST, Smith-Waterman algorithm, GGSEARCH, Jalview and MUSTANG. PEPlife would augment the understanding of different factors that affect the half-life of peptides like modifications, sequence, length, route of delivery of the peptide, etc. We anticipate that PEPlife will be useful for the researchers working in the area of peptide-based therapeutics.",
                "authors": [
                    {
                        "name": "Agrawal P."
                    },
                    {
                        "name": "Anand P."
                    },
                    {
                        "name": "Kaur H."
                    },
                    {
                        "name": "Kumar R."
                    },
                    {
                        "name": "Mathur D."
                    },
                    {
                        "name": "Mehta A."
                    },
                    {
                        "name": "Prakash S."
                    },
                    {
                        "name": "Raghava G.P.S."
                    },
                    {
                        "name": "Singh S."
                    }
                ],
                "citationCount": 72,
                "date": "2016-11-07T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "PEPlife: A Repository of the Half-life of Peptides"
            },
            "pmcid": "PMC5098197",
            "pmid": "27819351"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ]
}
