{
    "additionDate": "2017-08-03T18:58:46Z",
    "biotoolsCURIE": "biotools:rnall",
    "biotoolsID": "rnall",
    "credit": [
        {
            "email": "wan@cvm.msstate.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://sysbio.cvm.msstate.edu/"
        }
    ],
    "description": "This tool predicts local RNA secondary structures for multiple sequences in the Fasta format or scans local secondary structure of a single genomic sequence in the Fasta format. It scans the RNA sequence with a sliding window and extracts all LSS with sizes no longer than a window size using dynamic programming.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://sysbio.cvm.msstate.edu/software/Rnall/manual/v2.0/manual"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0278"
                }
            ]
        }
    ],
    "homepage": "http://sysbio.cvm.msstate.edu/Rnall/",
    "homepage_status": 1,
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-11T19:18:19Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/rnall-2-0-rna-local-secondary-structure-prediction.html"
        }
    ],
    "name": "Rnall",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: The information of RNA local secondary structures (LSSs) can help retrieve biologically important motifs and study functions of RNA molecules. Most of the current RNA secondary structure prediction tools are not suitable for RNA LSS prediction on the genome scale due to high computational complexity. Methods: We developed a new computer package Rnall based on a dynamic programming technique, which scans an RNA sequence with a sliding window and extracts all RNA LSSs with sizes no larger than the window size using the nearest neighbor thermodynamic parameters. The worst case running time of Rnall is O(W3L), where W is the window size and L is the query sequence length. In practice we observed a running time of O(W2L). We further introduced the concept of energy landscape for illustrating RNA LSS, which may facilitate RNA motif mining on the genomic scale. Results: Rnall shows better prediction acc uracy than two other prediction tools Lfold and Quickfold. Rnall is also applied to scan for RNA LSSs in three genomes, and the prediction maps well with known RNA motifs. Conclusions: Rnall is designed for RNA LSS prediction and toget her with the energy landscape, it has unique features that could be used for RNA structural motif mining. Rnall is freely available for download at http://digbio.missouri.edu/~wanx/Rnall. or http://www.sysbio.muohio.edu/ Rnall. © 2006 Imperial College Press.",
                "authors": [
                    {
                        "name": "Lin G."
                    },
                    {
                        "name": "Wan X.-F."
                    },
                    {
                        "name": "Xu D."
                    }
                ],
                "citationCount": 13,
                "date": "2006-10-01T00:00:00Z",
                "journal": "Journal of Bioinformatics and Computational Biology",
                "title": "Rnall: An efficient algorithm for predicting RNA local secondary structural landscape in genomes"
            },
            "pmid": "17099939"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}
