{
    "additionDate": "2016-05-17T10:18:50Z",
    "biotoolsCURIE": "biotools:hypergeny",
    "biotoolsID": "hypergeny",
    "collectionID": [
        "BIG N2N",
        "VIB",
        "Plant Systems Biology",
        "UGent"
    ],
    "credit": [
        {
            "name": "ugent.be",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "yves.vandepeer@psb.vib-ugent.be",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "HYPERbolic phyloGENY viewer allows hyperbolic visualisation of very large tree structures.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bioinformatics.psb.ugent.be/software/details/HyperGeny"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence set",
                        "uri": "http://edamontology.org/data_0850"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Phylogenetic tree analysis",
                    "uri": "http://edamontology.org/operation_0324"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Phylogenetic tree",
                        "uri": "http://edamontology.org/data_0872"
                    }
                }
            ]
        }
    ],
    "homepage": "http://bioinformatics.psb.ugent.be/software/details/HyperGeny",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "name": "HyperGeny",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Katrijn.Vannerum@ugent.be",
    "publication": [
        {
            "doi": "10.1186/1756-0381-3-1",
            "metadata": {
                "abstract": "The quantities of data obtained by the new high-throughput technologies, such as microarrays or ChIP-Chip arrays, and the large-scale OMICS-approaches, such as genomics, proteomics and transcriptomics, are becoming vast. Sequencing technologies become cheaper and easier to use and, thus, large-scale evolutionary studies towards the origins of life for all species and their evolution becomes more and more challenging. Databases holding information about how data are related and how they are hierarchically organized expand rapidly. Clustering analysis is becoming more and more difficult to be applied on very large amounts of data since the results of these algorithms cannot be efficiently visualized. Most of the available visualization tools that are able to represent such hierarchies, project data in 2D and are lacking often the necessary user friendliness and interactivity. For example, the current phylogenetic tree visualization tools are not able to display easy to understand large scale trees with more than a few thousand nodes. In this study, we review tools that are currently available for the visualization of biological trees and analysis, mainly developed during the last decade. We describe the uniform and standard computer readable formats to represent tree hierarchies and we comment on the functionality and the limitations of these tools. We also discuss on how these tools can be developed further and should become integrated with various data sources. Here we focus on freely available software that offers to the users various tree-representation methodologies for biological data analysis. © 2010 Pavlopoulos et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Pavlopoulos G.A."
                    },
                    {
                        "name": "Soldatos T.G."
                    },
                    {
                        "name": "Barbosa-Silva A."
                    },
                    {
                        "name": "Schneider R."
                    }
                ],
                "citationCount": 40,
                "date": "2010-03-11T00:00:00Z",
                "journal": "BioData Mining",
                "title": "A reference guide for tree analysis and visualization"
            },
            "type": [
                "Review"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}