{
    "accessibility": "Open access",
    "additionDate": "2024-05-14T13:26:20.580228Z",
    "biotoolsCURIE": "biotools:dapredict",
    "biotoolsID": "dapredict",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "chenxiujie@emshrbmu.edu.cn",
            "name": "Xiujie Chen",
            "orcidid": "https://orcid.org/0000-0003-2423-8569",
            "typeEntity": "Person"
        },
        {
            "email": "zhangdenan@ems.hrbmu.edu.cn",
            "name": "Denan Zhang",
            "typeEntity": "Person"
        }
    ],
    "description": "Database for drug action phenotype prediction.\nHere, you can search for predicted relationships of 1748 approved drugs to 454 ADRs or 178 ATCs, while also can predict the action phenotypes of approximately 110,000,000 compounds online (including about 168,000 natural products). In addition, you can explore potential mechanisms of ADRs or ATCs from phenotype-corresponding domains, or explore phenotype-corresponding substructures for structural optimization of drugs to eliminate serious adverse reactions.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                },
                {
                    "term": "Spectrum calculation",
                    "uri": "http://edamontology.org/operation_3860"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://bio-bigdata.hrbmu.edu.cn/DAPredict",
    "lastUpdate": "2024-05-14T13:26:20.583368Z",
    "name": "DAPredict",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/database/baad095",
            "metadata": {
                "abstract": "The phenotypes of drug action, including therapeutic actions and adverse drug reactions (ADRs), are important indicators for evaluating the druggability of new drugs and repositioning the approved drugs. Here, we provide a user-friendly database, DAPredict (http://bio-bigdata.hrbmu.edu.cn/DAPredict), in which our novel original drug action phenotypes prediction algorithm (Yang,J., Zhang,D., Liu,L. et al. (2021) Computational drug repositioning based on the relationships between substructure-indication. Brief. Bioinformatics, 22, bbaa348) was embedded. Our algorithm integrates characteristics of chemical genomics and pharmacogenomics, breaking through the limitations that traditional drug development process based on phenotype cannot analyze the mechanism of drug action. Predicting phenotypes of drug action based on the local active structures of drugs and proteins can achieve more innovative drug discovery across drug categories and simultaneously evaluate drug efficacy and safety, rather than traditional one-by-one evaluation. DAPredict contains 305 981 predicted relationships between 1748 approved drugs and 454 ADRs, 83 117 predicted relationships between 1478 approved drugs and 178 Anatomical Therapeutic Chemicals (ATC). More importantly, DAPredict provides an online prediction tool, which researchers can use to predict the action phenotypic spectrum of more than 110 000 000 compounds (including about 168 000 natural products) and corresponding proteins to analyze their potential effect mechanisms. DAPredict can also help researchers obtain the phenotype-corresponding active structures for structural optimization of new drug candidates, making it easier to evaluate the druggability of new drug candidates and develop more innovative drugs across drug categories. Database URL: http://bio-bigdata.hrbmu.edu.cn/DAPredict/.",
                "authors": [
                    {
                        "name": "Cai Y."
                    },
                    {
                        "name": "Chen X."
                    },
                    {
                        "name": "Huo D."
                    },
                    {
                        "name": "Meng Q."
                    },
                    {
                        "name": "Xie H."
                    },
                    {
                        "name": "Xu F."
                    },
                    {
                        "name": "Yu M."
                    },
                    {
                        "name": "Zhang D."
                    },
                    {
                        "name": "Zhou K."
                    }
                ],
                "date": "2024-01-01T00:00:00Z",
                "journal": "Database",
                "title": "DAPredict: a database for drug action phenotype prediction"
            },
            "pmcid": "PMC10799211",
            "pmid": "38242684"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Pharmacogenomics",
            "uri": "http://edamontology.org/topic_0208"
        },
        {
            "term": "Safety sciences",
            "uri": "http://edamontology.org/topic_3377"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
