{
    "additionDate": "2022-08-11T07:47:08.553035Z",
    "biotoolsCURIE": "biotools:amypred-frl",
    "biotoolsID": "amypred-frl",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "watshara.sho@mahidol.ac.th",
            "name": "Watshara Shoombuatong",
            "typeEntity": "Person"
        },
        {
            "name": "Phasit Charoenkwan"
        }
    ],
    "description": "AMYPred-FRL is a novel approach for accurate prediction of amyloid proteins by using feature representation learning.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                },
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                }
            ]
        }
    ],
    "homepage": "http://pmlabstack.pythonanywhere.com/AMYPred-FRL",
    "lastUpdate": "2024-11-24T15:50:22.697514Z",
    "license": "Not licensed",
    "name": "AMYPred-FRL",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1038/s41598-022-11897-z",
            "metadata": {
                "abstract": "Amyloid proteins have the ability to form insoluble fibril aggregates that have important pathogenic effects in many tissues. Such amyloidoses are prominently associated with common diseases such as type 2 diabetes, Alzheimer's disease, and Parkinson's disease. There are many types of amyloid proteins, and some proteins that form amyloid aggregates when in a misfolded state. It is difficult to identify such amyloid proteins and their pathogenic properties, but a new and effective approach is by developing effective bioinformatics tools. While several machine learning (ML)-based models for in silico identification of amyloid proteins have been proposed, their predictive performance is limited. In this study, we present AMYPred-FRL, a novel meta-predictor that uses a feature representation learning approach to achieve more accurate amyloid protein identification. AMYPred-FRL combined six well-known ML algorithms (extremely randomized tree, extreme gradient boosting, k-nearest neighbor, logistic regression, random forest, and support vector machine) with ten different sequence-based feature descriptors to generate 60 probabilistic features (PFs), as opposed to state-of-the-art methods developed by a single feature-based approach. A logistic regression recursive feature elimination (LR-RFE) method was used to find the optimal m number of 60 PFs in order to improve the predictive performance. Finally, using the meta-predictor approach, the 20 selected PFs were fed into a logistic regression method to create the final hybrid model (AMYPred-FRL). Both cross-validation and independent tests showed that AMYPred-FRL achieved superior predictive performance than its constituent baseline models. In an extensive independent test, AMYPred-FRL outperformed the existing methods by 5.5% and 16.1%, respectively, with accuracy and MCC of 0.873 and 0.710. To expedite high-throughput prediction, a user-friendly web server of AMYPred-FRL is freely available at http://pmlabstack.pythonanywhere.com/AMYPred-FRL. It is anticipated that AMYPred-FRL will be a useful tool in helping researchers to identify new amyloid proteins.",
                "authors": [
                    {
                        "name": "Ahmed S."
                    },
                    {
                        "name": "Charoenkwan P."
                    },
                    {
                        "name": "Lio' P."
                    },
                    {
                        "name": "Moni M.A."
                    },
                    {
                        "name": "Nantasenamat C."
                    },
                    {
                        "name": "Quinn J.M.W."
                    },
                    {
                        "name": "Shoombuatong W."
                    }
                ],
                "citationCount": 37,
                "date": "2022-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "AMYPred-FRL is a novel approach for accurate prediction of amyloid proteins by using feature representation learning"
            },
            "pmcid": "PMC9095707",
            "pmid": "35546347"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ],
    "validated": 1
}
