{
    "additionDate": "2019-11-14T18:11:38Z",
    "biotoolsCURIE": "biotools:PanoView",
    "biotoolsID": "PanoView",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jiang.qian@jhmi.edu",
            "name": "Jiang Qian",
            "orcidid": "https://orcid.org/0000-0002-0476-3596",
            "typeEntity": "Person"
        }
    ],
    "description": "An iterative clustering method for single-cell RNA sequencing data | Single-cell Panoramic View Clustering (PanoView) | PanoView is an iterative PCA-based method that integrates with a novel density-based clustering, ordering local maximum by convex hull (OLMC) algorithm, to identify cell subpopulations for single-cell RNA-sequencing. For details of the method, please see our paper at PLOS Computational Biology (https://journals.plos.org/ploscompbiol/article?id=10.1371/journal.pcbi.1007040)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://github.com/mhu10/scPanoView",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-05T09:06:51Z",
    "license": "MIT",
    "name": "PanoView",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1007040",
            "metadata": {
                "abstract": "© 2019 Hu et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Single-cell RNA-sequencing (scRNA-seq) provides new opportunities to gain a mechanistic understanding of many biological processes. Current approaches for single cell clustering are often sensitive to the input parameters and have difficulty dealing with cell types with different densities. Here, we present Panoramic View (PanoView), an iterative method integrated with a novel density-based clustering, Ordering Local Maximum by Convex hull (OLMC), that uses a heuristic approach to estimate the required parameters based on the input data structures. In each iteration, PanoView will identify the most confident cell clusters and repeat the clustering with the remaining cells in a new PCA space. Without adjusting any parameter in PanoView, we demonstrated that PanoView was able to detect major and rare cell types simultaneously and outperformed other existing methods in both simulated datasets and published single-cell RNA-sequencing datasets. Finally, we conducted scRNA-Seq analysis of embryonic mouse hypothalamus, and PanoView was able to reveal known cell types and several rare cell subpopulations.",
                "authors": [
                    {
                        "name": "Hu M.-W."
                    },
                    {
                        "name": "Kim D.W."
                    },
                    {
                        "name": "Liu S."
                    },
                    {
                        "name": "Zack D.J."
                    },
                    {
                        "name": "Blackshaw S."
                    },
                    {
                        "name": "Qian J."
                    }
                ],
                "citationCount": 2,
                "date": "2019-01-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "PanoView: An iterative clustering method for single-cell RNA sequencing data"
            },
            "pmcid": "PMC6742414",
            "pmid": "31469823"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}