{
    "additionDate": "2018-03-30T14:54:58Z",
    "biotoolsCURIE": "biotools:riboframe",
    "biotoolsID": "riboframe",
    "credit": [
        {
            "email": "matteo.ramazzotti@unifi.it",
            "name": "Matteo Ramazzotti",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "ELIXIR-ITA-FIRENZE"
        }
    ],
    "description": "It is a novel method for microbial profiling based on the identification and classification of 16S rRNA sequences in non targeted metagenomics datasets. Reads overlapping the 16S rRNA genes are identified using Hidden Markov Models and a taxonomic assignment is obtained by naive Bayesian classification. All reads identified as ribosomal are coherently positioned in the 16S rRNA gene, allowing the use of the topology of the gene to instruct the abundance analysis.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence trace",
                        "uri": "http://edamontology.org/data_0924"
                    },
                    "format": [
                        {
                            "term": "FASTA-like (text)",
                            "uri": "http://edamontology.org/format_2200"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Taxonomy",
                        "uri": "http://edamontology.org/data_3028"
                    },
                    "format": [
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://bioserver2.sbsc.unifi.it/bioinfo/riboframe.html",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2024-11-25T14:42:12.338531Z",
    "maturity": "Emerging",
    "name": "RiboFrame",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "MatteoRamazzotti",
    "publication": [
        {
            "doi": "10.3389/fgene.2015.00329",
            "metadata": {
                "abstract": "Non-targeted metagenomics offers the unprecedented possibility of simultaneously investigate the microbial profile and the genetic capabilities of a sample by a direct analysis of its entire DNA content. The assessment of the microbial taxonomic composition is frequently obtained by mapping reads to genomic databases that, although growing, are still limited and biased. Here we present riboFrame, a novel procedure for microbial profiling based on the identification and classification of 16S rDNA sequences in non-targeted metagenomics datasets. Reads overlapping the 16S rDNA genes are identified using Hidden Markov Models and a taxonomic assignment is obtained by naïve Bayesian classification. All reads identified as ribosomal are coherently positioned in the 16S rDNA gene, allowing the use of the topology of the gene (i.e., the secondary structure and the location of variable regions) to guide the abundance analysis. We tested and verified the effectiveness of our method on simulated ribosomal data, on simulated metagenomes and on a real dataset. riboFrame exploits the taxonomic potentialities of the 16S rDNA gene in the context of non-targeted metagenomics, giving an accurate perspective on the microbial profile in metagenomic samples.",
                "authors": [
                    {
                        "name": "Berna L."
                    },
                    {
                        "name": "Cavalieri D."
                    },
                    {
                        "name": "Donati C."
                    },
                    {
                        "name": "Ramazzotti M."
                    }
                ],
                "citationCount": 13,
                "date": "2015-01-01T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "riboFrame: An improved method for microbial taxonomy profiling from non-targeted metagenomics"
            },
            "pmcid": "PMC4646959",
            "pmid": "26635865"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        }
    ],
    "validated": 1,
    "version": [
        "1.1"
    ]
}
