{
    "additionDate": "2021-01-18T11:59:23Z",
    "biotoolsCURIE": "biotools:belg",
    "biotoolsID": "belg",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "gaopc@bnu.edu.cn",
            "name": "Peichao Gao",
            "orcidid": "https://orcid.org/0000-0003-1714-779X",
            "typeEntity": "Person"
        }
    ],
    "description": "bleg is a R-package that contains functions to calculate relative and absolute Boltzmann entropy using the hierarchy-based and the aggregation-based methods. Boltzmann entropy (also called configurational entropy) has been recently adopted to analyze entropy of landscape gradients . The goal of belg is to provide an efficient C++ implementation of this method in R.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid thermodynamic property calculation",
                    "uri": "http://edamontology.org/operation_0455"
                },
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "homepage": "https://r-spatialecology.github.io/belg/",
    "language": [
        "R",
        "C++"
    ],
    "lastUpdate": "2021-01-31T16:02:12Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/r-spatialecology/belg"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/r-spatialecology/belg/"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/r-spatialecology/belg/issues"
        }
    ],
    "name": "belg",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3390/E22090937",
            "metadata": {
                "abstract": "© 2020 by the authors. Licensee MDPI, Basel, Switzerland.Entropy is a fundamental concept in thermodynamics that is important in many fields, including image processing, neurobiology, urban planning, and sustainability. As of recently, the application of Boltzmann entropy for landscape patterns was mostly limited to the conceptual discussion. However, in the last several years, a number of methods for calculating Boltzmann entropy for landscape mosaics and gradients were proposed. We developed an R package belg as an open source tool for calculating Boltzmann entropy of landscape gradients. The package contains functions to calculate relative and absolute Boltzmann entropy using the hierarchy-based and the aggregation-based methods. It also supports input raster with missing (NA) values, allowing for calculations on real data. In this study, we explain ideas behind implemented methods, describe the core functionality of the software, and present three examples of its use. The examples show the basic functions in this package, how to adjust Boltzmann entropy values for data with missing values, and how to use the belg package in larger workflows. We expect that the belg package will be a useful tool in the discussion of using entropy for a description of landscape patterns and facilitate a thermodynamic understanding of landscape dynamics.",
                "authors": [
                    {
                        "name": "Nowosad J."
                    },
                    {
                        "name": "Gao P."
                    }
                ],
                "date": "2020-09-01T00:00:00Z",
                "journal": "Entropy",
                "title": "Belg: A tool for calculating boltzmann entropy of landscape gradients"
            },
            "pmcid": "PMC7597200",
            "pmid": "33286706"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ]
}