
{
    "credit": [
        {
            "email": "info@cbio.mskcc.org",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://cbio.mskcc.org/contact-cbio/index.html"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://sanderlab.org/tools/MEMo_Readme.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Oncology",
                "uri": "http://edamontology.org/topic_2640"
            },
            {
                "term": "Systems biology",
                "uri": "http://edamontology.org/topic_2259"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/memo-1-0-identify-mutually-exclusive-driver-networks-cancer.html"
        }
    ],
    "publication": [
        {
            "abstract": "Although individual tumors show surprisingly diverse genomic alterations, these events tend to occur in a limited number of pathways, and alterations that affect the same pathway tend to not co-occur in the same patient. While pathway analysis has been a powerful tool in cancer genomics, our knowledge of oncogenic pathway modules is incomplete. To systematically identify such modules, we have developed a novel method, Mutual Exclusivity Modules in Cancer (MEMo). The method searches and identifies modules characterized by three properties: (1) member genes are recurrently altered across a set of tumor samples; (2) member genes are known to or are likely to participate in the same biological process; and (3) alteration events within the modules are mutually exclusive. MEMo integrates multiple data types and maps genomic alterations to biological pathways. MEMo's mutual exclusivity uses a statistical model that preserves the number of alterations per gene and per sample. © 2013 by John Wiley & Sons, Inc.",
            "authors": [
                "Ciriello G.",
                "Cerami E.",
                "Aksoy B.A.",
                "Sander C.",
                "Schultz N."
            ],
            "cit_count": 11,
            "journal": "Current Protocols in Bioinformatics",
            "pmid": "23504936",
            "title": "Using MEMo to discover mutual exclusivity modules in cancer",
            "year": "2013-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:memo_cancer",
        "biotoolsID": "memo_cancer",
        "description": "Method for identifying mutually exclusive driver networks in cancer. The method identifies networks defined by three properties: first, member genes are recurrently altered via somatic mutation or copy number changes; second, member genes are likely to participate in the same biological pathway or process, as determined from prior pathway and network knowledge; and third, genomic events within the network exhibit a statistically significant level of mutual exclusivity.",
        "homepage": "http://cbio.mskcc.org/tools/memo/",
        "name": "MEMo"
    }
}