{
    "accessibility": "Open access",
    "additionDate": "2021-11-20T07:08:22.825567Z",
    "biotoolsCURIE": "biotools:ccip",
    "biotoolsID": "ccip",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "lgao@mail.xidian.edu.cn",
            "name": "Lin Gao",
            "orcidid": "https://orcid.org/0000-0001-6396-0787"
        }
    ],
    "description": "CCIP is a machine learning method for predicting CTCF-mediated chromatin loops with transitivity.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/GaoLabXDU/CCIP",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2024-11-24T20:16:19.341696Z",
    "name": "CCIP",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btab534",
            "metadata": {
                "abstract": "Motivation: CTCF-mediated chromatin loops underlie the formation of topological associating domains and serve as the structural basis for transcriptional regulation. However, the formation mechanism of these loops remains unclear, and the genome-wide mapping of these loops is costly and difficult. Motivated by the recent studies on the formation mechanism of CTCF-mediated loops, we studied the possibility of making use of transitivity-related information of interacting CTCF anchors to predict CTCF loops computationally. In this context, transitivity arises when two CTCF anchors interact with the same third anchor by the loop extrusion mechanism and bring themselves close to each other spatially to form an indirect loop. Results: To determine whether transitivity is informative for predicting CTCF loops and to obtain an accurate and low-cost predicting method, we proposed a two-stage random-forest-based machine learning method, CTCF-mediated Chromatin Interaction Prediction (CCIP), to predict CTCF-mediated chromatin loops. Our two-stage learning approach makes it possible for us to train a prediction model by taking advantage of transitivity-related information as well as functional genome data and genomic data. Experimental studies showed that our method predicts CTCFmediated loops more accurately than other methods and that transitivity, when used as a properly defined attribute, is informative for predicting CTCF loops. Furthermore, we found that transitivity explains the formation of tandem CTCF loops and facilitates enhancer-promoter interactions. Our work contributes to the understanding of the formation mechanism and function of CTCF-mediated chromatin loops.",
                "authors": [
                    {
                        "name": "Gao L."
                    },
                    {
                        "name": "Gao Y."
                    },
                    {
                        "name": "Wang W."
                    },
                    {
                        "name": "Ye Y."
                    }
                ],
                "citationCount": 4,
                "date": "2021-12-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "CCIP: Predicting CTCF-mediated chromatin loops with transitivity"
            },
            "pmcid": "PMC8665748",
            "pmid": "34289010"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}
