
{
    "credit": [
        {
            "email": "oliver.koch@agkoch.de",
            "name": "Oliver Koch",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "oliver.koch@tu-dortmund.de",
            "name": "Oliver Koch",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://www.ccb.tu-dortmund.de/ag-koch/pygold/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "Molecular modelling",
                "uri": "http://edamontology.org/topic_2275"
            },
            {
                "term": "Protein structure analysis",
                "uri": "http://edamontology.org/topic_2814"
            },
            {
                "term": "Molecular biology",
                "uri": "http://edamontology.org/topic_3047"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author (2017). Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com Motivation: Molecular docking is one of the successful approaches in structure based discovery and development of bioactive molecules in chemical biology and medicinal chemistry. Due to the huge amount of computational time that is still required, docking is often the last step in a virtual screening approach. Such screenings are set as workflows spanned over many steps, each aiming at different filtering task. These workflows can be automatized in large parts using python based toolkits except for docking using the docking software GOLD. However, within an automated virtual screening workflow it is not feasible to use the GUI in between every step to change the GOLD configuration file. Thus, a python module called PyGOLD was developed, to parse, edit and write the GOLD configuration file and to automate docking based virtual screening workflows. Availability and Implementation: The latest version of PyGOLD, its documentation and example scripts are available at: http://www.ccb.tu-dortmund.de/koch or http://www.agkoch.de. PyGOLD is implemented in Python and can be imported as a standard python module without any further dependencies. Contact: oliver.koch@agkoch.de, oliver.koch@tu-dortmund.de. Supplementary information: Supplementary data are available at Bioinformatics online.",
            "authors": [
                "Patel H.",
                "Brinkjost T.",
                "Koch O."
            ],
            "cit_count": 1,
            "doi": "10.1093/bioinformatics/btx197",
            "journal": "Bioinformatics (Oxford, England)",
            "title": "PyGOLD: a python based API for docking based virtual screening workflow generation",
            "year": "2017-08-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:pygold",
        "biotoolsID": "pygold",
        "description": "API for docking based virtual screening workflow generation.",
        "homepage": "http://www.ccb.tu-dortmund.de/ag-koch/pygold/",
        "name": "PyGOLD"
    }
}