{
    "accessibility": "Open access",
    "additionDate": "2022-05-17T20:47:50.763127Z",
    "biotoolsCURIE": "biotools:pseudeep",
    "biotoolsID": "pseudeep",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "chensize@gdpu.edu.cn",
            "name": "Size Chen",
            "typeEntity": "Person"
        },
        {
            "name": "Jinyang Liu"
        },
        {
            "name": "Jujuan Zhuang"
        }
    ],
    "description": "RNA Pseudouridine Site Identification with Deep Learning Algorithm.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/dan111262/PseUdeep",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-05-17T20:47:50.766300Z",
    "license": "Not licensed",
    "name": "PseUdeep",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/FGENE.2021.773882",
            "metadata": {
                "abstract": "Copyright © 2021 Zhuang, Liu, Lin, Qiu, Liu and Chen.Background: Pseudouridine (Ψ) is a common ribonucleotide modification that plays a significant role in many biological processes. The identification of Ψ modification sites is of great significance for disease mechanism and biological processes research in which machine learning algorithms are desirable as the lab exploratory techniques are expensive and time-consuming. Results: In this work, we propose a deep learning framework, called PseUdeep, to identify Ψ sites of three species: H. sapiens, S. cerevisiae, and M. musculus. In this method, three encoding methods are used to extract the features of RNA sequences, that is, one-hot encoding, K-tuple nucleotide frequency pattern, and position-specific nucleotide composition. The three feature matrices are convoluted twice and fed into the capsule neural network and bidirectional gated recurrent unit network with a self-attention mechanism for classification. Conclusion: Compared with other state-of-the-art methods, our model gets the highest accuracy of the prediction on the independent testing data set S-200; the accuracy improves 12.38%, and on the independent testing data set H-200, the accuracy improves 0.68%. Moreover, the dimensions of the features we derive from the RNA sequences are only 109,109, and 119 in H. sapiens, M. musculus, and S. cerevisiae, which is much smaller than those used in the traditional algorithms. On evaluation via tenfold cross-validation and two independent testing data sets, PseUdeep outperforms the best traditional machine learning model available. PseUdeep source code and data sets are available at https://github.com/dan111262/PseUdeep.",
                "authors": [
                    {
                        "name": "Chen S."
                    },
                    {
                        "name": "Lin M."
                    },
                    {
                        "name": "Liu D."
                    },
                    {
                        "name": "Liu J."
                    },
                    {
                        "name": "Qiu W."
                    },
                    {
                        "name": "Zhuang J."
                    }
                ],
                "date": "2021-11-18T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "PseUdeep: RNA Pseudouridine Site Identification with Deep Learning Algorithm"
            },
            "pmcid": "PMC8637112",
            "pmid": "34868261"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
