{
    "additionDate": "2019-11-14T19:28:17Z",
    "biotoolsCURIE": "biotools:FunDMDeep-m6A",
    "biotoolsID": "FunDMDeep-m6A",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhangsw@nwpu.edu.cn",
            "name": "Shao-Wu Zhang",
            "typeEntity": "Person"
        },
        {
            "email": "yufei.huang@utsa.edu",
            "name": "Yufei Huang",
            "typeEntity": "Person"
        }
    ],
    "description": "identification and prioritization of functional differential m6A methylation genes | A R package used to identify single base resolution m6A and differential m6A methylation site from MeRIP-seq data version 1.0",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Gene methylation analysis",
                    "uri": "http://edamontology.org/operation_3207"
                }
            ]
        }
    ],
    "homepage": "https://github.com/NWPU-903PR/DMDeepm6A1.0",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-04T10:43:03Z",
    "name": "FunDMDeep-m6A",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ316",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Motivation: As the most abundant mammalian mRNA methylation, N6-methyladenosine (m6A) exists in >25% of human mRNAs and is involved in regulating many different aspects of mRNA metabolism, stem cell differentiation and diseases like cancer. However, our current knowledge about dynamic changes of m6A levels and how the change of m6A levels for a specific gene can play a role in certain biological processes like stem cell differentiation and diseases like cancer is largely elusive. Results: To address this, we propose in this paper FunDMDeep-m6A a novel pipeline for identifying context-specific (e.g. disease versus normal, differentiated cells versus stem cells or gene knockdown cells versus wild-type cells) m6A-mediated functional genes. FunDMDeep-m6A includes, at the first step, DMDeep-m6A a novel method based on a deep learning model and a statistical test for identifying differential m6A methylation (DmM) sites from MeRIP-Seq data at a single-base resolution. FunDMDeep-m6A then identifies and prioritizes functional DmM genes (FDmMGenes) by combing the DmM genes (DmMGenes) with differential expression analysis using a network-based method. This proposed network method includes a novel m6A-signaling bridge (MSB) score to quantify the functional significance of DmMGenes by assessing functional interaction of DmMGenes with their signaling pathways using a heat diffusion process in protein-protein interaction (PPI) networks. The test results on 4 context-specific MeRIP-Seq datasets showed that FunDMDeep-m6A can identify more context-specific and functionally significant FDmMGenes than m6A-Driver. The functional enrichment analysis of these genes revealed that m6A targets key genes of many important context-related biological processes including embryonic development, stem cell differentiation, transcription, translation, cell death, cell proliferation and cancer-related pathways. These results demonstrate the power of FunDMDeep-m6A for elucidating m6A regulatory functions and its roles in biological processes and diseases.",
                "authors": [
                    {
                        "name": "Zhang S.-Y."
                    },
                    {
                        "name": "Zhang S.-W."
                    },
                    {
                        "name": "Fan X.-N."
                    },
                    {
                        "name": "Zhang T."
                    },
                    {
                        "name": "Meng J."
                    },
                    {
                        "name": "Huang Y."
                    }
                ],
                "citationCount": 6,
                "date": "2019-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "FunDMDeep-m6A: Identification and prioritization of functional differential m6A methylation genes"
            },
            "pmcid": "PMC6612877",
            "pmid": "31510685"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        }
    ],
    "validated": 1
}