{
    "additionDate": "2017-01-13T13:16:45Z",
    "biotoolsCURIE": "biotools:subread",
    "biotoolsID": "subread",
    "credit": [
        {
            "email": "shi@wehi.edu.au",
            "name": "Dr Wei Shi",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Subread is a general-purpose read aligner which can be used to map both genomic DNA-seq reads and RNA-seq reads. It uses a new mapping paradigm called \"seed-and-vote\" to achieve fast, accurate and scalable read mapping. It automatically determines if a read should be globally or locally aligned, therefore particularly powerful in mapping RNA-seq reads. It supports indel detection and can map reads with both fixed and variable lengths.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bioinf.wehi.edu.au/subread-package/SubreadUsersGuide.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "homepage": "http://subread.sourceforge.net/",
    "language": [
        "C"
    ],
    "lastUpdate": "2021-05-19T12:50:31Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "Subread",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_009803"
        }
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "doi": "10.1038/nmeth.4106",
            "metadata": {
                "abstract": "© 2017 Nature America, inc., part of springer Nature. All rights reserved.Alignment is the first step in most RNA-seq analysis pipelines, and the accuracy of downstream analyses depends heavily on it. Unlike most steps in the pipeline, alignment is particularly amenable to benchmarking with simulated data. We performed a comprehensive benchmarking of 14 common splice-aware aligners for base, read, and exon junction-level accuracy and compared default with optimized parameters. We found that performance varied by genome complexity, and accuracy and popularity were poorly correlated. The most widely cited tool underperforms for most metrics, particularly when using default settings.",
                "authors": [
                    {
                        "name": "Baruzzo G."
                    },
                    {
                        "name": "DI Camillo B."
                    },
                    {
                        "name": "Fitzgerald G.A."
                    },
                    {
                        "name": "Grant G.R."
                    },
                    {
                        "name": "Hayer K.E."
                    },
                    {
                        "name": "Kim E.J."
                    }
                ],
                "citationCount": 106,
                "date": "2017-02-01T00:00:00Z",
                "journal": "Nature Methods",
                "title": "Simulation-based comprehensive benchmarking of RNA-seq aligners"
            },
            "pmcid": "PMC5792058",
            "pmid": "27941783",
            "type": [
                "Benchmarking study"
            ]
        },
        {
            "doi": "10.1093/nar/gkt214",
            "metadata": {
                "abstract": "Read alignment is an ongoing challenge for the analysis of data from sequencing technologies. This article proposes an elegantly simple multi-seed strategy, called seed-and-vote, for mapping reads to a reference genome. The new strategy chooses the mapped genomic location for the read directly from the seeds. It uses a relatively large number of short seeds (called subreads) extracted from each read and allows all the seeds to vote on the optimal location. When the read length is <160 bp, overlapping subreads are used. More conventional alignment algorithms are then used to fill in detailed mismatch and indel information between the subreads that make up the winning voting block. The strategy is fast because the overall genomic location has already been chosen before the detailed alignment is done. It is sensitive because no individual subread is required to map exactly, nor are individual subreads constrained to map close by other subreads. It is accurate because the final location must be supported by several different subreads. The strategy extends easily to find exon junctions, by locating reads that contain sets of subreads mapping to different exons of the same gene. It scales up efficiently for longer reads. © 2013 The Author(s) 2013.",
                "authors": [
                    {
                        "name": "Liao Y."
                    },
                    {
                        "name": "Shi W."
                    },
                    {
                        "name": "Smyth G.K."
                    }
                ],
                "citationCount": 1067,
                "date": "2013-05-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "The Subread aligner: Fast, accurate and scalable read mapping by seed-and-vote"
            },
            "pmcid": "PMC3664803",
            "pmid": "23558742",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Suite"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ],
    "validated": 1
}
