{"collectionID": [], "accessibility": [], "topic": [{"term": "Data quality management", "uri": "http://edamontology.org/topic_3572"}, {"term": "Nucleic acid structure analysis", "uri": "http://edamontology.org/topic_0097"}, {"term": "Structure prediction", "uri": "http://edamontology.org/topic_0082"}], "owner": "d.gabrielaitis", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": "10.1093/bioinformatics/btw840", "note": null, "version": null, "pmid": null, "type": null, "pmcid": null, "metadata": {"title": "Protein multiple sequence alignment benchmarking through secondary structure prediction", "abstract": "© The Author 2017. Published by Oxford University Press. Motivation: Multiple sequence alignment (MSA) is commonly used to analyze sets of homologous protein or DNA sequences. This has lead to the development of many methods and packages for MSA over the past 30 years. Being able to compare different methods has been problematic and has relied on gold standard benchmark datasets of 'true' alignments or on MSA simulations. A number of protein benchmark datasets have been produced which rely on a combination of manual alignment and/or automated superposition of protein structures. These are either restricted to very small MSAs with few sequences or require manual alignment which can be subjective. In both cases, it remains very difficult to properly test MSAs of more than a few dozen sequences. PREFAB and HomFam both rely on using a small subset of sequences of known structure and do not fairly test the quality of a full MSA. Results: In this paper we describe QuanTest, a fully automated and highly scalable test system for protein MSAs which is based on using secondary structure prediction accuracy (SSPA) to measure alignment quality. This is based on the assumption that better MSAs will give more accurate secondary structure predictions when we include sequences of known structure. SSPA measures the quality of an entire alignment however, not just the accuracy on a handful of selected sequences. It can be scaled to alignments of any size but here we demonstrate its use on alignments of either 200 or 1000 sequences. This allows the testing of slow accurate programs as well as faster, less accurate ones. We show that the scores from QuanTest are highly correlated with existing benchmark scores. We also validate the method by comparing a wide range of MSA alignment options and by including different levels of mis-alignment into MSA, and examining the effects on the scores.", "citationCount": 7, "authors": [{"name": "Le Q."}, {"name": "Sievers F."}, {"name": "Higgins D.G."}], "date": "2017-05-01T00:00:00Z", "journal": "Bioinformatics"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": "Quan Le", "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "quan.le@ucd.ie"}], "biotoolsCURIE": "biotools:quantest", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "http://www.bioinf.ucd.ie/download/QuanTest.tgz", "function": [{"note": null, "input": [], "operation": [{"term": "Sequence alignment validation", "uri": "http://edamontology.org/operation_0447"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:59Z", "otherID": [], "description": "Protein multiple sequence alignment benchmarking through secondary structure prediction.", "toolType": ["Command-line tool"], "editPermission": {"type": "private", "authors": []}, "language": [], "link": [], "biotoolsID": "quantest", "additionDate": "2018-06-04T19:11:19Z", "name": "QuanTest", "license": null, "documentation": [], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux"]}