{
    "additionDate": "2020-01-14T19:31:50Z",
    "biotoolsCURIE": "biotools:RAACBook",
    "biotoolsID": "RAACBook",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "yanglei_hmu@163.com",
            "name": "Lei Yang",
            "typeEntity": "Person"
        },
        {
            "email": "yczuo@imu.edu.cn",
            "name": "Yongchun Zuo",
            "orcidid": "https://orcid.org/0000-0002-6065-7835",
            "typeEntity": "Person"
        }
    ],
    "description": "a web server of reduced amino acid alphabet for sequence-dependent inference by using Chou's five-step rule.\n\nRecently, the success of AlphaFold on creating 3D protein models demonstrates sequence-dependent inference plays a crucial role in computational proteomics.\n\nA web server of reduced amino acid alphabet for sequence-dependent inference",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                },
                {
                    "term": "Protein signal peptide detection",
                    "uri": "http://edamontology.org/operation_0418"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                }
            ]
        }
    ],
    "homepage": "http://bioinfor.imu.edu.cn/raacbook",
    "lastUpdate": "2020-01-14T19:31:50Z",
    "name": "RAACBook",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAZ131",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press.By reducing amino acid alphabet, the protein complexity can be significantly simplified, which could improve computational efficiency, decrease information redundancy and reduce chance of overfitting. Although some reduced alphabets have been proposed, different classification rules could produce distinctive results for protein sequence analysis. Thus, it is urgent to construct a systematical frame for reduced alphabets. In this work, we constructed a comprehensive web server called RAACBook for protein sequence analysis and machine learning application by integrating reduction alphabets. The web server contains three parts: (i) 74 types of reduced amino acid alphabet were manually extracted to generate 673 reduced amino acid clusters (RAACs) for dealing with unique protein problems. It is easy for users to select desired RAACs from a multilayer browser tool. (ii) An online tool was developed to analyze primary sequence of protein. The tool could produce K-tuple reduced amino acid composition by defining three correlation parameters (K-tuple, g-gap, λ-correlation). The results are visualized as sequence alignment, mergence of RAA composition, feature distribution and logo of reduced sequence. (iii) The machine learning server is provided to train the model of protein classification based on K-tuple RAAC. The optimal model could be selected according to the evaluation indexes (ROC, AUC, MCC, etc.). In conclusion, RAACBook presents a powerful and user-friendly service in protein sequence analysis and computational proteomics. RAACBook can be freely available at http://bioinfor.imu.edu.cn/raacbook. Database URL: http://bioinfor.imu.edu.cn/raacbook.",
                "authors": [
                    {
                        "name": "Zheng L."
                    },
                    {
                        "name": "Huang S."
                    },
                    {
                        "name": "Mu N."
                    },
                    {
                        "name": "Zhang H."
                    },
                    {
                        "name": "Zhang J."
                    },
                    {
                        "name": "Chang Y."
                    },
                    {
                        "name": "Yang L."
                    },
                    {
                        "name": "Zuo Y."
                    }
                ],
                "citationCount": 10,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Database : the journal of biological databases and curation",
                "title": "RAACBook: a web server of reduced amino acid alphabet for sequence-dependent inference by using Chou's five-step rule"
            },
            "pmcid": "PMC6893003",
            "pmid": "31802128"
        }
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        }
    ]
}