
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "labels": {
        "topic": [
            {
                "term": "MRI",
                "uri": "http://edamontology.org/topic_3444"
            },
            {
                "term": "Laboratory animal science",
                "uri": "http://edamontology.org/topic_3386"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019 The AuthorsPurpose: Magnetic resonance fingerprinting (MRF) is a state-of-the-art quantitative MRI technique with a computationally demanding reconstruction process, the accuracy of which depends on the accuracy of the signal model employed. Having a fast, validated, open-source MRF reconstruction would improve the dependability and accuracy of clinical applications of MRF. Methods: We parallelized both dictionary generation and signal matching on the GPU by splitting the simulation and matching of dictionary atoms across threads. Signal generation was modeled using both Bloch equation simulation and the extended phase graph (EPG) formalism. Unit tests were implemented to ensure correctness. The new package, snapMRF, was tested with a calibration phantom and an in vivo brain. Results: Compared with other online open-source packages, dictionary generation was accelerated by 10–1000× and signal matching by 10–100×. On a calibration phantom, T1 and T2 values were measured with relative errors that were nearly identical to those from existing packages when using the same sequence and dictionary configuration, but errors were much lower when using variable sequences that snapMRF supports but that competitors do not. Conclusion: Our open-source package snapMRF was significantly faster and retrieved accurate parameters, possibly enabling real-time parameter map generation for small dictionaries. Further refinements to the acquisition scheme and dictionary setup could improve quantitative accuracy.",
            "authors": [
                "Wang D.",
                "Ostenson J.",
                "Smith D.S."
            ],
            "cit_count": 0,
            "doi": "10.1016/J.MRI.2019.11.015",
            "journal": "Magnetic Resonance Imaging",
            "pmid": "31740194",
            "title": "snapMRF: GPU-accelerated magnetic resonance fingerprinting dictionary generation and matching using extended phase graphs",
            "year": "2019-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:snapMRF",
        "biotoolsID": "snapMRF",
        "description": "GPU-accelerated magnetic resonance fingerprinting dictionary generation and matching using extended phase graphs.\n\nPURPOSE:Magnetic resonance fingerprinting (MRF) is a state-of-the-art quantitative MRI technique with a computationally demanding reconstruction process, the accuracy of which depends on the accuracy of the signal model employed. Having a fast, validated, open-source MRF reconstruction would improve the dependability and accuracy of clinical applications of MRF. METHODS:We parallelized both dictionary generation and signal matching on the GPU by splitting the simulation and matching of dictionary atoms across threads. Signal generation was modeled using both Bloch equation simulation and the extended phase graph (EPG) formalism. Unit tests were implemented to ensure correctness. The new package, snapMRF, was tested with a calibration phantom and an in vivo brain.\n\n||| HOMEPAGE MISSING!",
        "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31740194",
        "name": "snapMRF"
    }
}