{
    "additionDate": "2020-01-14T19:37:00Z",
    "biotoolsCURIE": "biotools:PyRates",
    "biotoolsID": "PyRates",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "rgast@cbs.mpg.de",
            "name": "Richard Gast",
            "orcidid": "https://orcid.org/0000-0002-4445-0340",
            "typeEntity": "Person"
        }
    ],
    "description": "Python framework for rate-based neural simulations.\n\nPyRates is a framework for neural modeling and simulations, developed by Richard Gast and Daniel Rose at the Max Planck Institute of Human Cognitive and Brain Sciences, Leipzig, Germany.\n\nMax Planck Institute for Human Cognitive and Brain Sciences.\n\nWelcome to the PyRates documentation! — PyRates 0.7.1 documentation.\n\nWelcome to the PyRates documentation!¶.\n\nPyRates is a Python 3 tool for building rate-based neural models and performing numerical simulations of their dynamic behavior.\n\nEfficient software solutions for building and analyzing neural models are of tremendous value to the field of computational neuroscience.\n\nOpen-source Python toolbox for rate-based neural modeling.\n\nPyRates requires an installation of Python >=3.6.1",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://pyrates.readthedocs.io"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/pyrates-neuroscience/PyRates/tree/master/documentation"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                },
                {
                    "term": "Network simulation",
                    "uri": "http://edamontology.org/operation_3562"
                },
                {
                    "term": "Information extraction",
                    "uri": "http://edamontology.org/operation_3907"
                }
            ]
        }
    ],
    "homepage": "https://www.cbs.mpg.de/departments/neurophysics/software/pyrates",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-01-14T19:37:00Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/pyrates-neuroscience/PyRates"
        }
    ],
    "name": "PyRates",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0225900",
            "metadata": {
                "abstract": "© 2019 Gast et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.In neuroscience, computational modeling has become an important source of insight into brain states and dynamics. A basic requirement for computational modeling studies is the availability of efficient software for setting up models and performing numerical simulations. While many such tools exist for different families of neural models, there is a lack of tools allowing for both a generic model definition and efficiently parallelized simulations. In this work, we present PyRates, a Python framework that provides the means to build a large variety of rate-based neural models. PyRates provides intuitive access to and modification of all mathematical operators in a graph, thus allowing for a highly generic model definition. For computational efficiency and parallelization, the model is translated into a compute graph. Using the example of two different neural models belonging to the family of rate-based population models, we explain the mathematical formalism, software structure and user interfaces of PyRates. We show via numerical simulations that the behavior of the PyRates model implementations is consistent with the literature. Finally, we demonstrate the computational capacities and scalability of PyRates via a number of benchmark simulations of neural networks differing in size and connectivity.",
                "authors": [
                    {
                        "name": "Gast R."
                    },
                    {
                        "name": "Rose D."
                    },
                    {
                        "name": "Salomon C."
                    },
                    {
                        "name": "Moller H.E."
                    },
                    {
                        "name": "Weiskopf N."
                    },
                    {
                        "name": "Knosche T.R."
                    }
                ],
                "citationCount": 1,
                "date": "2019-12-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "PyRates—A Python framework for rate-based neural simulations"
            },
            "pmcid": "PMC6913930",
            "pmid": "31841550"
        }
    ],
    "topic": [
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        }
    ]
}