{
    "accessibility": "Open access",
    "additionDate": "2022-11-09T17:15:42.902831Z",
    "biotoolsCURIE": "biotools:mastro",
    "biotoolsID": "mastro",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "fabio.vandin@unipd.it",
            "name": "Fabio Vandin",
            "typeEntity": "Person"
        }
    ],
    "description": "MAximal tumor treeS TRajectOries (MASTRO), to discover significantly conserved evolutionary trajectories in cancer.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic reconstruction",
                    "uri": "http://edamontology.org/operation_3478"
                },
                {
                    "term": "Phylogenetic tree topology analysis",
                    "uri": "http://edamontology.org/operation_0551"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "https://github.com/VandinLab/MASTRO",
    "language": [
        "C",
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:21:42.469416Z",
    "license": "MIT",
    "name": "MASTRO",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btac467",
            "metadata": {
                "abstract": "Motivation: Tumors are the result of a somatic evolutionary process leading to substantial intra-tumor heterogeneity. Single-cell and multi-region sequencing enable the detailed characterization of the clonal architecture of tumors and have highlighted its extensive diversity across tumors. While several computational methods have been developed to characterize the clonal composition and the evolutionary history of tumors, the identification of significantly conserved evolutionary trajectories across tumors is still a major challenge. Results: We present a new algorithm, MAximal tumor treeS TRajectOries (MASTRO), to discover significantly conserved evolutionary trajectories in cancer. MASTRO discovers all conserved trajectories in a collection of phylogenetic trees describing the evolution of a cohort of tumors, allowing the discovery of conserved complex relations between alterations. MASTRO assesses the significance of the trajectories using a conditional statistical test that captures the coherence in the order in which alterations are observed in different tumors. We apply MASTRO to data from nonsmall-cell lung cancer bulk sequencing and to acute myeloid leukemia data from single-cell panel sequencing, and find significant evolutionary trajectories recapitulating and extending the results reported in the original studies.",
                "authors": [
                    {
                        "name": "Pellegrina L."
                    },
                    {
                        "name": "Vandin F."
                    }
                ],
                "citationCount": 4,
                "date": "2022-09-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Discovering significant evolutionary trajectories in cancer phylogenies"
            },
            "pmid": "36124798"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
