{
    "additionDate": "2018-05-19T17:50:39Z",
    "biotoolsCURIE": "biotools:casper_merging",
    "biotoolsID": "casper_merging",
    "description": "Context-aware scheme for paired-end reads from high-throughput amplicon sequencing.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://best.snu.ac.kr/casper/"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://best.snu.ac.kr/casper/program/casper_v0.8.2.tar.gz",
            "version": "0.8.2"
        },
        {
            "type": "Software package",
            "url": "http://best.snu.ac.kr/casper/program/casper_B_v0.8.2.tar.gz",
            "version": "0.8.2"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "homepage": "http://best.snu.ac.kr/casper",
    "lastUpdate": "2019-07-23T12:20:18Z",
    "name": "CASPER",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1186/1471-2105-15-S9-S10",
            "metadata": {
                "abstract": "© 2014 Kwon et al.; licensee BioMed Central Ltd.Merging the forward and reverse reads from paired-end sequencing is a critical task that can significantly improve the performance of downstream tasks, such as genome assembly and mapping, by providing them with virtually elongated reads. However, due to the inherent limitations of most paired-end sequencers, the chance of observing erroneous bases grows rapidly as the end of a read is approached, which becomes a critical hurdle for accurately merging paired-end reads. Although there exist several sophisticated approaches to this problem, their performance in terms of quality of merging often remains unsatisfactory. To address this issue, here we present a c ontext-a ware scheme for p aired-e nd r eads (CASPER): a computational method to rapidly and robustly merge overlapping paired-end reads. Being particularly well suited to amplicon sequencing applications, CASPER is thoroughly tested with both simulated and real high-throughput amplicon sequencing data. According to our experimental results, CASPER significantly outperforms existing state-of-the art paired-end merging tools in terms of accuracy and robustness. CASPER also exploits the parallelism in the task of paired-end merging and effectively speeds up by multithreading. CASPER is freely available for academic use at http://best.snu.ac.kr/casper.",
                "authors": [
                    {
                        "name": "Kwon S."
                    },
                    {
                        "name": "Lee B."
                    },
                    {
                        "name": "Yoon S."
                    }
                ],
                "citationCount": 15,
                "date": "2014-09-10T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "CASPER: Context-aware scheme for paired-end reads from high-throughput amplicon sequencing"
            },
            "pmcid": "PMC4168710",
            "pmid": "25252785",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ]
}