
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "labels": {
        "topic": [
            {
                "term": "Pathology",
                "uri": "http://edamontology.org/topic_0634"
            },
            {
                "term": "GWAS study",
                "uri": "http://edamontology.org/topic_3517"
            },
            {
                "term": "DNA polymorphism",
                "uri": "http://edamontology.org/topic_2885"
            },
            {
                "term": "Genotype and phenotype",
                "uri": "http://edamontology.org/topic_0625"
            },
            {
                "term": "Public health and epidemiology",
                "uri": "http://edamontology.org/topic_3305"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019 The Authors. Movement Disorders published by Wiley Periodicals, Inc. on behalf of International Parkinson and Movement Disorder Society.Background: Mendelian randomization is a method for exploring observational associations to find evidence of causality. Objective: To apply Mendelian randomization between risk factors/phenotypic traits (exposures) and PD in a large, unbiased manner, and to create a public resource for research. Methods: We used two-sample Mendelian randomization in which the summary statistics relating to single-nucleotide polymorphisms from 5,839 genome-wide association studies of exposures were used to assess causal relationships with PD. We selected the highest-quality exposure genome-wide association studies for this report (n = 401). For the disease outcome, summary statistics from the largest published PD genome-wide association studies were used. For each exposure, the causal effect on PD was assessed using the inverse variance weighted method, followed by a range of sensitivity analyses. We used a false discovery rate of 5% from the inverse variance weighted analysis to prioritize exposures of interest. Results: We observed evidence for causal associations between 12 exposures and risk of PD. Of these, nine were effects related to increasing adiposity and decreasing risk of PD. The remaining top three exposures that affected PD risk were tea drinking, time spent watching television, and forced vital capacity, but these may have been biased and were less convincing. Other exposures at nominal statistical significance included inverse effects of smoking and alcohol. Conclusions: We present a new platform which offers Mendelian randomization analyses for a total of 5,839 genome-wide association studies versus the largest PD genome-wide association studies available (https://pdgenetics.shinyapps.io/MRportal/). Alongside, we report further evidence to support a causal role for adiposity on lowering the risk of PD. © 2019 The Authors. Movement Disorders published by Wiley Periodicals, Inc. on behalf of International Parkinson and Movement Disorder Society.",
            "authors": [
                "Noyce A.J.",
                "Bandres-Ciga S.",
                "Kim J.",
                "Heilbron K.",
                "Kia D.",
                "Hemani G.",
                "Xue A.",
                "Lawlor D.A.",
                "Smith G.D.",
                "Duran R.",
                "Gan-Or Z.",
                "Blauwendraat C.",
                "Gibbs J.R.",
                "Hinds D.A.",
                "Yang J.",
                "Visscher P.",
                "Cuzick J.",
                "Morris H.",
                "Hardy J.",
                "Wood N.W.",
                "Nalls M.A.",
                "Singleton A.B."
            ],
            "cit_count": 0,
            "doi": "10.1002/MDS.27873",
            "journal": "Movement Disorders",
            "pmid": "31659794",
            "title": "The Parkinson's Disease Mendelian Randomization Research Portal",
            "year": "2019-12-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:Portal",
        "biotoolsID": "Portal",
        "description": "The Parkinson's Disease Mendelian Randomization Research Portal.\n\niPDGC PD MR Research Portal",
        "homepage": "https://pdgenetics.shinyapps.io/MRportal/",
        "name": "Portal"
    }
}