{
    "accessibility": "Open access",
    "additionDate": "2022-10-03T21:21:36.896076Z",
    "biotoolsCURIE": "biotools:getsequenceinfo",
    "biotoolsID": "getsequenceinfo",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "david.couvin@googlemail.com",
            "name": "David Couvin",
            "orcidid": "https://orcid.org/0000-0002-7897-9023",
            "typeEntity": "Person"
        },
        {
            "name": "Alexis Dereeper"
        },
        {
            "name": "Séverine Ferdinand"
        },
        {
            "name": "Yann Reynaud"
        }
    ],
    "description": "getSequenceInfo tool allows to extract sequence data and specific information from GenBank (Galaxy Version 1.0.1)",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "http://sasc3i.univ-ag.fr:8080",
    "lastUpdate": "2022-10-03T21:21:36.900122Z",
    "name": "getSequenceInfo",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S12859-022-04809-5",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: Biological sequences are increasing rapidly and exponentially worldwide. Nucleotide sequence databases play an important role in providing meaningful genomic information on a variety of biological organisms. Results: The getSequenceInfo software tool allows to access sequence information from various public repositories (GenBank, RefSeq, and the European Nucleotide Archive), and is compatible with different operating systems (Linux, MacOS, and Microsoft Windows) in a programmatic way (command line) or as a graphical user interface. getSequenceInfo or gSeqI v1.0 should help users to get some information on queried sequences that could be useful for specific studies (e.g. the country of origin/isolation or the release date of queried sequences). Queries can be made to retrieve sequence data based on a given kingdom and species, or from a given date. This program allows the separation between chromosomes and plasmids (or other genetic elements/components) by arranging each component in a given folder. Some basic statistics are also performed by the program (such as the calculation of GC content for queried assemblies). An empirically designed nucleotide ratio is calculated using nucleotide information in order to tentatively provide a “NucleScore” for studied genome assemblies. Besides the main gSeqI tool, other additional tools have been developed to perform various tasks related to sequence analysis. Conclusion: The aim of this study is to democratize the use of public repositories in programmatic ways, and to facilitate sequence data analysis in a pedagogical perspective. Output results are available in FASTA, FASTQ, Excel/TSV or HTML formats. The program is freely available at: https://github.com/karubiotools/getSequenceInfo. getSequenceInfo and supplementary tools are partly available through the recently released Galaxy KaruBioNet platform (http://calamar.univ-ag.fr/c3i/galaxy_karubionet.html).",
                "authors": [
                    {
                        "name": "Breurec S."
                    },
                    {
                        "name": "Cazenave D."
                    },
                    {
                        "name": "Couvin D."
                    },
                    {
                        "name": "Dereeper A."
                    },
                    {
                        "name": "Ferdinand S."
                    },
                    {
                        "name": "Garnier M."
                    },
                    {
                        "name": "Guyomard-Rabenirina S."
                    },
                    {
                        "name": "Marcelino I."
                    },
                    {
                        "name": "Moco V."
                    },
                    {
                        "name": "Pot M."
                    },
                    {
                        "name": "Reynaud Y."
                    },
                    {
                        "name": "Talarmin A."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "getSequenceInfo: a suite of tools allowing to get genome sequence information from public repositories"
            },
            "pmcid": "PMC9264741",
            "pmid": "35804320"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ],
    "validated": 1
}
