{
    "accessibility": "Open access",
    "additionDate": "2019-05-19T07:30:22Z",
    "biotoolsCURIE": "biotools:SLIM",
    "biotoolsID": "SLIM",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "yoann.dufresne0@gmail.com",
            "name": "Yoann Dufresne",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Web application for the reproducible processing of environmental DNA metabarcoding data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/yoann-dufresne/SLIM"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Community profiling",
                    "uri": "http://edamontology.org/operation_3200"
                },
                {
                    "term": "Base-calling",
                    "uri": "http://edamontology.org/operation_3185"
                },
                {
                    "term": "Chimera detection",
                    "uri": "http://edamontology.org/operation_0450"
                }
            ]
        }
    ],
    "homepage": "https://trtcrd.github.io/SLIM/",
    "lastUpdate": "2020-06-16T10:55:22Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "SLIM",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12859-019-2663-2",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: High-throughput amplicon sequencing of environmental DNA (eDNA metabarcoding) has become a routine tool for biodiversity survey and ecological studies. By including sample-specific tags in the primers prior PCR amplification, it is possible to multiplex hundreds of samples in a single sequencing run. The analysis of millions of sequences spread into hundreds to thousands of samples prompts for efficient, automated yet flexible analysis pipelines. Various algorithms and software have been developed to perform one or multiple processing steps, such as paired-end reads assembly, chimera filtering, Operational Taxonomic Unit (OTU) clustering and taxonomic assignment. Some of these software are now well established and widely used by scientists as part of their workflow. Wrappers that are capable to process metabarcoding data from raw sequencing data to annotated OTU-to-sample matrix were also developed to facilitate the analysis for non-specialist users. Yet, most of them require basic bioinformatic or command-line knowledge, which can limit the accessibility to such integrative toolkits. Furthermore, for flexibility reasons, these tools have adopted a step-by-step approach, which can prevent an easy automation of the workflow, and hence hamper the analysis reproducibility. Results: We introduce SLIM, an open-source web application that simplifies the creation and execution of metabarcoding data processing pipelines through an intuitive Graphic User Interface (GUI). The GUI interact with well-established software and their associated parameters, so that the processing steps are performed seamlessly from the raw sequencing data to an annotated OTU-to-sample matrix. Thanks to a module-centered organization, SLIM can be used for a wide range of metabarcoding cases, and can also be extended by developers for custom needs or for the integration of new software. The pipeline configuration (i.e. the modules chaining and all their parameters) is stored in a file that can be used for reproducing the same analysis. Conclusion: This web application has been designed to be user-friendly for non-specialists yet flexible with advanced settings and extensibility for advanced users and bioinformaticians. The source code along with full documentation is available on the GitHub repository (https://github.com/yoann-dufresne/SLIM) and a demonstration server is accessible through the application website (https://trtcrd.github.io/SLIM/).",
                "authors": [
                    {
                        "name": "Dufresne Y."
                    },
                    {
                        "name": "Lejzerowicz F."
                    },
                    {
                        "name": "Perret-Gentil L.A."
                    },
                    {
                        "name": "Pawlowski J."
                    },
                    {
                        "name": "Cordier T."
                    }
                ],
                "citationCount": 29,
                "date": "2019-02-19T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SLIM: A flexible web application for the reproducible processing of environmental DNA metabarcoding data"
            },
            "pmcid": "PMC6381720",
            "pmid": "30782112",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}