{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:08:21Z",
    "biotoolsCURIE": "biotools:DeTerm",
    "biotoolsID": "DeTerm",
    "cost": "Free of charge",
    "description": "Software for automatic detection of neuronal dendritic branch terminals via an artificial neural network.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://bitbucket.org/skibbe/DeTerm/wiki/Home"
        }
    ],
    "download": [
        {
            "type": "Downloads page",
            "url": "https://bitbucket.org/skibbe/determ/downloads/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Neurite measurement",
                    "uri": "http://edamontology.org/operation_3450"
                }
            ]
        }
    ],
    "homepage": "https://bitbucket.org/skibbe/DeTerm/wiki/Home",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:25Z",
    "license": "Unlicense",
    "maturity": "Mature",
    "name": "DeTerm",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1111/GTC.12700",
            "metadata": {
                "abstract": "© 2019 Molecular Biology Society of Japan and John Wiley & Sons Australia, LtdDendrites of neurons receive and process synaptic or sensory inputs. The Drosophila class IV dendritic arborization (da) neuron is an established model system to explore molecular mechanisms of dendrite morphogenesis. The total number of dendritic branch terminals is one of the frequently employed parameters to characterize dendritic arborization complexity of class IV neurons. This parameter gives a useful phenotypic readout of arborization during neurogenesis, and it is typically determined by laborious manual analyses of numerous images. Ideally, an automated analysis would greatly reduce the workload; however, it is challenging to automatically discriminate dendritic branch terminals from signals of surrounding tissues in whole-mount live larvae. Here, we describe our newly developed software, called DeTerm, which automatically recognizes and quantifies dendrite branch terminals via an artificial neural network. Once we input an image file of a neuronal dendritic arbor and its region of interest information, DeTerm is capable of labeling terminals of larval class IV neurons with high precision, and it also provides positional data of individual terminals. We further show that DeTerm is applicable to other types of neurons, including mouse cerebellar Purkinje cells. DeTerm is freely available on the web and was successfully tested on Mac, Windows and Linux.",
                "authors": [
                    {
                        "name": "Kanaoka Y."
                    },
                    {
                        "name": "Skibbe H."
                    },
                    {
                        "name": "Hayashi Y."
                    },
                    {
                        "name": "Uemura T."
                    },
                    {
                        "name": "Hattori Y."
                    }
                ],
                "citationCount": 2,
                "date": "2019-07-01T00:00:00Z",
                "journal": "Genes to Cells",
                "title": "DeTerm: Software for automatic detection of neuronal dendritic branch terminals via an artificial neural network"
            },
            "pmid": "31095815",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}