{
    "name": "MIXMUL", 
    "description": "MIXMUL (Mixture of Weighted Multinomial) procedure is a convenient haplotype inference tool for mixed data to estimate haplotype frequencies accurately and output the most likely reconstructed haplotype pairs of each subject in the estimation.", 
    "homepage": "http://www.csjfann.ibms.sinica.edu.tw/eag/programlist/MIXMUL/MIXMUL.html", 
    "biotoolsID": "mixmul", 
    "biotoolsCURIE": "biotools:mixmul", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0487", 
                    "term": "Haplotype inference"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3053", 
            "term": "Genetics"
        }
    ], 
    "operatingSystem": [
        "Linux"
    ], 
    "language": [
        "R"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/mixmul-estimating-haplotype-frequencies-reconstructing-haplotypes-mixed-genotype-data.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://www.csjfann.ibms.sinica.edu.tw/EAG/program/programlist.htm", 
            "type": "Terms of use", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1186/1423-0127-16-52", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "A novel tool for individual haplotype inference using mixed data", 
                "abstract": "Background. In many studies, researchers may recruit samples consisting of independent trios and unrelated individuals. However, most of the currently available haplotype inference methods do not cope well with these kinds of mixed data sets. Methods. We propose a general and simple methodology using a mixture of weighted multinomial (MIXMUL) approach that combines separate haplotype information from unrelated individuals and independent trios for haplotype inference to the individual level. Results. The new MIXMUL procedure improves over existing methods in that it can accurately estimate haplotype frequencies from mixed data sets and output probable haplotype pairs in optimized reconstruction outcomes for all subjects that have contributed to estimation. Simulation results showed that this new MIXMUL procedure competes well with the EM-based method, i.e. FAMHAP, under a few assumed scenarios. Conclusion. The results showed that MIXMUL can provide accurate estimates similar to those haplotype frequencies obtained from FAMHAP and output the probable haplotype pairs in the most optimal reconstruction outcome for all subjects that have contributed to estimation. If available data consist of combinations of unrelated individuals and independent trios, the MIXMUL procedure can be used to estimate the haplotype frequencies accurately and output the most likely reconstructed haplotype pairs of each subject in the estimation. © 2009 Lin and Fann; licensee BioMed Central Ltd.", 
                "date": "2009-08-12T00:00:00Z", 
                "citationCount": 0, 
                "authors": [
                    {
                        "name": "Lin C.-P."
                    }, 
                    {
                        "name": "Fann C.S.J."
                    }
                ], 
                "journal": "Journal of Biomedical Science"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": null, 
            "url": "http://www.csjfann.ibms.sinica.edu.tw/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-12-18T00:08:50Z", 
    "lastUpdate": "2018-12-10T12:58:57Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}