{"credit":[{"email":"bioinformatik@wzw.tum.de","name":"FGDB Support","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://bioinformatik.wzw.tum.de/index.php?id=63"}],"function":[{"operation":[{"term":"Genome assembly","uri":"http://edamontology.org/operation_0525"},{"term":"Gene prediction","uri":"http://edamontology.org/operation_2454"},{"term":"Gene expression analysis","uri":"http://edamontology.org/operation_2495"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Database portal"],"topic":[{"term":"Pathology","uri":"http://edamontology.org/topic_0634"},{"term":"Plant biology","uri":"http://edamontology.org/topic_0780"},{"term":"Sequence assembly","uri":"http://edamontology.org/topic_0196"},{"term":"Probes and primers","uri":"http://edamontology.org/topic_0632"},{"term":"Gene expression","uri":"http://edamontology.org/topic_0203"}]},"publication":[{"abstract":"The MIPS Fusarium graminearum Genome Database (FGDB) was established as a comprehensive genome database on one of the most devastating fungal plant pathogens of wheat, barley and maize. The current version of FGDB v3.1 provides information on the full manually revised gene set based on the Broad Institute assembly FG3 genome sequence. The results of gene prediction tools were integrated with the help of comparative data on related species to result in a set of 13.718 annotated protein coding genes. This rigorous approach involved adding or modifying gene models and represents a coding sequence gold standard for the genus Fusarium. The gene loci improvements results in 2461 genes which either are new or have different structures compared to the Broad Institute assembly 3 gene set. Moreover the database serves as a convenient entry point to explore expression data results and to obtain information on the Affymetrix GeneChip probe sets. The resource is accessible on http://mips.gsf.de/genre/ proj/FGDB/. © The Author(s) 2010.","authors":["Wong P.","Walter M.","Lee W.","Mannhaupt G.","Munsterkotter M.","Mewes H.-W.","Adam G.","Guldener U."],"cit_count":67,"journal":"Nucleic Acids Research","pmid":"21051345","title":"FGDB: Revisiting the genome annotation of the plant pathogen Fusarium graminearum","year":"2011-01-01"}],"summary":{"biotoolsCURIE":"biotools:fgdb","biotoolsID":"fgdb","description":"The MIPS Fusarium graminearum Genome Database (FGDB) is a comprehensive genome database for Fusarium graminearum. The current version of FGDB v3.1 provides information on the full manually revised gene set based on the Broad Institute assembly FG3 genome sequence. The database serves as a convenient entry point to explore expression data results and to obtain information on the Affymetrix GeneChip probe sets.","homepage":"http://mips.gsf.de/genre/proj/FGDB/","name":"FGDB"}}