{
    "additionDate": "2017-01-17T15:01:55Z",
    "biotoolsCURIE": "biotools:bayseq",
    "biotoolsID": "bayseq",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "tjh48@cam.ac.uk",
            "name": "Thomas J. Hardcastle",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "This package identifies differential expression in high-throughput 'count' data, such as that derived from next-generation sequencing machines, calculating estimated posterior likelihoods of differential expression (or more complex hypotheses) via empirical Bayesian methods.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/baySeq.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/baySeq_2.8.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/baySeq.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:54Z",
    "license": "GPL-3.0",
    "name": "baySeq",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-11-422",
            "metadata": {
                "abstract": "Background: High throughput sequencing has become an important technology for studying expression levels in many types of genomic, and particularly transcriptomic, data. One key way of analysing such data is to look for elements of the data which display particular patterns of differential expression in order to take these forward for further analysis and validation.Results: We propose a framework for defining patterns of differential expression and develop a novel algorithm, baySeq, which uses an empirical Bayes approach to detect these patterns of differential expression within a set of sequencing samples. The method assumes a negative binomial distribution for the data and derives an empirically determined prior distribution from the entire dataset. We examine the performance of the method on real and simulated data.Conclusions: Our method performs at least as well, and often better, than existing methods for analyses of pairwise differential expression in both real and simulated data. When we compare methods for the analysis of data from experimental designs involving multiple sample groups, our method again shows substantial gains in performance. We believe that this approach thus represents an important step forward for the analysis of count data from sequencing experiments. © 2010 Hardcastle and Kelly; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Hardcastle T.J."
                    },
                    {
                        "name": "Kelly K.A."
                    }
                ],
                "citationCount": 395,
                "date": "2010-08-10T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "BaySeq: Empirical Bayesian methods for identifying differential expression in sequence count data"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1,
    "version": [
        "2.8.0"
    ]
}