{"credit":[{"email":"clote@bc.edu","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://bioinformatics.bc.edu/clotelab/"}],"documentation":[{"type":"GENERAL","url":"http://bioinformatics.bc.edu/clotelab/RNAexpNumNbors/index.spy?tab=main"}],"function":[{"operation":[{"term":"Nucleic acid feature detection","uri":"http://edamontology.org/operation_0415"}]}],"labels":{"language":["Python"],"operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"RNA","uri":"http://edamontology.org/topic_0099"},{"term":"Nucleic acid structure analysis","uri":"http://edamontology.org/topic_0097"},{"term":"Structure prediction","uri":"http://edamontology.org/topic_0082"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/rnaexpnumnbors-expected-number-of-structural-neighbors.html"}],"publication":[{"abstract":"© 2014 Wiley Periodicals, Inc.Consider the network of all secondary structures of a given RNA sequence, where nodes are connected when the corresponding structures have base pair distance one. The expected degree of the network is the average number of neighbors, where average may be computed with respect to the either the uniform or Boltzmann probability. Here, we describe the first algorithm, RNAexpNumNbors, that can compute the expected number of neighbors, or expected network degree, of an input sequence. For RNA sequences from the Rfam database, the expected degree is significantly less than the constrained minimum free energy structure, defined to have minimum free energy (MFE) over all structures consistent with the Rfam consensus structure. The expected degree of structural RNAs, such as purine riboswitches, paradoxically appears to be smaller than that of random RNA, yet the difference between the degree of the MFE structure and the expected degree is larger than that of random RNA. Expected degree does not seem to correlate with standard structural diversity measures of RNA, such as positional entropy and ensemble defect. The program RNAexpNumNbors is written in C, runs in cubic time and quadratic space, and is publicly available at http://bioinformatics.bc.edu/clotelab/RNAexpNumNbors.","authors":["Clote P."],"cit_count":3,"journal":"Journal of Computational Chemistry","pmid":"25382310","title":"Expected degree for RNA secondary structure networks","year":"2015-01-15"}],"summary":{"biotoolsCURIE":"biotools:rnaexpnumnbors","biotoolsID":"rnaexpnumnbors","description":"This tool can compute the expected number of neighbors, or expected network degree, of an input RNA sequence.","homepage":"http://bioinformatics.bc.edu/clotelab/RNAexpNumNbors/index.spy","name":"RNAexpNumNbors"}}