{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2022-07-17T11:34:08.130202Z",
    "biotoolsCURIE": "biotools:breakalign",
    "biotoolsID": "breakalign",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "rbelshaw@kean.edu",
            "name": "Robert Belshaw",
            "orcidid": "https://orcid.org/0000-0001-6234-3947",
            "typeEntity": "Person"
        },
        {
            "email": "emanuele.marchi@ndm.ox.ac.uk",
            "name": "Emanuele Marchi",
            "typeEntity": "Person"
        }
    ],
    "description": "A Perl program to align chimaeric (split) genomic NGS reads and allow visual confirmation of novel retroviral integrations.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "https://github.com/marchiem/breakalign",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2022-07-17T11:34:08.132943Z",
    "license": "GPL-1.0",
    "name": "BreakAlign",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/S12859-022-04621-1",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: Retroviruses replicate by integrating a DNA copy into a host chromosome. Detecting novel retroviral integrations (ones not in the reference genome sequence of the host) from genomic NGS data is bioinformatically challenging and frequently produces many false positives. One common method of confirmation is visual inspection of an alignment of the chimaeric (split) reads that span a putative novel retroviral integration site. We perceived the need for a program that would facilitate this by producing a multiple alignment containing both the viral and host regions that flank an integration. Results: BreakAlign is a Perl program that uses blastn to produce such a multiple alignment. In addition to the NGS dataset and a reference viral sequence, the program requires either (a) the ~ 500nt host genome sequence that spans the putative integration or (b) coordinates of this putative integration in an installed copy of the reference human genome (multiple integrations can be processed automatically). BreakAlign is freely available from https://github.com/marchiem/breakalign and is accompanied by example files allowing a test run. Conclusion: BreakAlign will confirm and facilitate characterisation of both (a) germline integrations of endogenous retroviruses and (b) somatic integrations of exogenous retroviruses such as HIV and HTLV. Although developed for use with genomic short-read NGS (second generation) data and retroviruses, it should also be useful for long-read (third generation) data and any mobile element with at least one conserved flanking region.",
                "authors": [
                    {
                        "name": "Belshaw R."
                    },
                    {
                        "name": "Frater J."
                    },
                    {
                        "name": "Jones M."
                    },
                    {
                        "name": "Klenerman P."
                    },
                    {
                        "name": "Magiorkinis G."
                    },
                    {
                        "name": "Marchi E."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "BreakAlign: a Perl program to align chimaeric (split) genomic NGS reads and allow visual confirmation of novel retroviral integrations"
            },
            "pmcid": "PMC9013057",
            "pmid": "35428171"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
