{
    "accessibility": "Open access",
    "additionDate": "2024-01-02T02:18:08.928719Z",
    "biotoolsCURIE": "biotools:gasoline_germ",
    "biotoolsID": "gasoline_germ",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "albertomagi@gmail.com",
            "name": "Alberto Magi",
            "typeEntity": "Person"
        },
        {
            "email": "piergiuseppe.pelicci@ieo.it",
            "name": "Pier Giuseppe Pelicci",
            "typeEntity": "Person"
        }
    ],
    "description": "Detecting germline and somatic structural variants from long-reads data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/projects/gasoline/",
    "language": [
        "Fortran",
        "Perl",
        "R"
    ],
    "lastUpdate": "2024-01-02T02:18:08.931391Z",
    "name": "GASOLINE",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1038/s41598-023-48285-0",
            "metadata": {
                "abstract": "Long-read sequencing allows analyses of single nucleic-acid molecules and produces sequences in the order of tens to hundreds kilobases. Its application to whole-genome analyses allows identification of complex genomic structural-variants (SVs) with unprecedented resolution. SV identification, however, requires complex computational methods, based on either read-depth or intra- and inter-alignment signatures approaches, which are limited by size or type of SVs. Moreover, most currently available tools only detect germline variants, thus requiring separate computation of sample pairs for comparative analyses. To overcome these limits, we developed a novel tool (Germline And SOmatic structuraL varIants detectioN and gEnotyping; GASOLINE) that groups SV signatures using a sophisticated clustering procedure based on a modified reciprocal overlap criterion, and is designed to identify germline SVs, from single samples, and somatic SVs from paired test and control samples. GASOLINE is a collection of Perl, R and Fortran codes, it analyzes aligned data in BAM format and produces VCF files with statistically significant somatic SVs. Germline or somatic analysis of 30 × sequencing coverage experiments requires 4–5 h with 20 threads. GASOLINE outperformed currently available methods in the detection of both germline and somatic SVs in synthetic and real long-reads datasets. Notably, when applied on a pair of metastatic melanoma and matched-normal sample, GASOLINE identified five genuine somatic SVs that were missed using five different sequencing technologies and state-of-the art SV calling approaches. Thus, GASOLINE identifies germline and somatic SVs with unprecedented accuracy and resolution, outperforming currently available state-of-the-art WGS long-reads computational methods.",
                "authors": [
                    {
                        "name": "Baragli M."
                    },
                    {
                        "name": "Bolognini D."
                    },
                    {
                        "name": "Caprioli C."
                    },
                    {
                        "name": "Colombo E."
                    },
                    {
                        "name": "Frige G."
                    },
                    {
                        "name": "Magi A."
                    },
                    {
                        "name": "Mattei G."
                    },
                    {
                        "name": "Mazzarella L."
                    },
                    {
                        "name": "Mingrino A."
                    },
                    {
                        "name": "Pelicci P.G."
                    },
                    {
                        "name": "Ronchini C."
                    },
                    {
                        "name": "Semeraro R."
                    }
                ],
                "date": "2023-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "GASOLINE: detecting germline and somatic structural variants from long-reads data"
            },
            "pmcid": "PMC10682169",
            "pmid": "38012350",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Structural variation",
            "uri": "http://edamontology.org/topic_3175"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ]
}
