{
    "additionDate": "2019-10-11T08:11:58Z",
    "biotoolsCURIE": "biotools:NGLess",
    "biotoolsID": "NGLess",
    "cost": "Free of charge",
    "description": "NGLess is a domain-specific language for NGS (next-generation sequencing data) processing with a focus on metagenomics",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://ngless.embl.de"
        }
    ],
    "download": [
        {
            "type": "Binaries",
            "url": "https://github.com/ngless-toolkit/ngless/releases"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://ngless.embl.de",
    "lastUpdate": "2019-10-11T08:11:58Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Discussion forum"
            ],
            "url": "https://groups.google.com/forum/#!forum/ngless"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/ngless-toolkit/ngless"
        }
    ],
    "maturity": "Mature",
    "name": "NGLess",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "luispedro",
    "publication": [
        {
            "doi": "10.1186/s40168-019-0684-8",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Shotgun metagenomes contain a sample of all the genomic material in an environment, allowing for the characterization of a microbial community. In order to understand these communities, bioinformatics methods are crucial. A common first step in processing metagenomes is to compute abundance estimates of different taxonomic or functional groups from the raw sequencing data. Given the breadth of the field, computational solutions need to be flexible and extensible, enabling the combination of different tools into a larger pipeline. Results: We present NGLess and NG-meta-profiler. NGLess is a domain specific language for describing next-generation sequence processing pipelines. It was developed with the goal of enabling user-friendly computational reproducibility. It provides built-in support for many common operations on sequencing data and is extensible with external tools with configuration files. Using this framework, we developed NG-meta-profiler, a fast profiler for metagenomes which performs sequence preprocessing, mapping to bundled databases, filtering of the mapping results, and profiling (taxonomic and functional). It is significantly faster than either MOCAT2 or htseq-count and (as it builds on NGLess) its results are perfectly reproducible. Conclusions: NG-meta-profiler is a high-performance solution for metagenomics processing built on NGLess. It can be used as-is to execute standard analyses or serve as the starting point for customization in a perfectly reproducible fashion. NGLess and NG-meta-profiler are open source software (under the liberal MIT license) and can be downloaded from https://ngless.embl.de or installed through bioconda.",
                "authors": [
                    {
                        "name": "Alves R."
                    },
                    {
                        "name": "Bork P."
                    },
                    {
                        "name": "Coelho L.P."
                    },
                    {
                        "name": "Freitas A.T."
                    },
                    {
                        "name": "Huerta-Cepas J."
                    },
                    {
                        "name": "Monteiro P."
                    }
                ],
                "citationCount": 6,
                "date": "2019-06-03T00:00:00Z",
                "journal": "Microbiome",
                "title": "NG-meta-profiler: Fast processing of metagenomes using NGLess, a domain-specific language"
            },
            "pmcid": "PMC6547473",
            "pmid": "31159881",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        }
    ],
    "validated": 1,
    "version": [
        "1.0.1"
    ]
}
