{
    "additionDate": "2021-01-18T10:50:11Z",
    "biotoolsCURIE": "biotools:meta-i6ma",
    "biotoolsID": "meta-i6ma",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "bala@ajou.ac.kr",
            "name": "Balachandran Manavalan",
            "typeEntity": "Person"
        },
        {
            "email": "kurata@bio.kyutech.ac.jp",
            "name": "Hiroyuki Kurata",
            "typeEntity": "Person"
        }
    ],
    "description": "An interspecies predictor for identifying DNA N6-methyladenine sites of plant genomes by exploiting informative features in an integrative machine-learning framework.\n\nDNA N6-Methyladenine Site predictor.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://kurata14.bio.kyutech.ac.jp/Meta-i6mA/help.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Nucleic acid feature detection",
                    "uri": "http://edamontology.org/operation_0415"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "http://kurata14.bio.kyutech.ac.jp/Meta-i6mA/",
    "lastUpdate": "2021-02-20T18:09:05Z",
    "name": "Meta-i6mA",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAA202",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.DNA N6-methyladenine (6mA) represents important epigenetic modifications, which are responsible for various cellular processes. The accurate identification of 6mA sites is one of the challenging tasks in genome analysis, which leads to an understanding of their biological functions. To date, several species-specific machine learning (ML)-based models have been proposed, but majority of them did not test their model to other species. Hence, their practical application to other plant species is quite limited. In this study, we explored 10 different feature encoding schemes, with the goal of capturing key characteristics around 6mA sites. We selected five feature encoding schemes based on physicochemical and position-specific information that possesses high discriminative capability. The resultant feature sets were inputted to six commonly used ML methods (random forest, support vector machine, extremely randomized tree, logistic regression, naïve Bayes and AdaBoost). The Rosaceae genome was employed to train the above classifiers, which generated 30 baseline models. To integrate their individual strength, Meta-i6mA was proposed that combined the baseline models using the meta-predictor approach. In extensive independent test, Meta-i6mA showed high Matthews correlation coefficient values of 0.918, 0.827 and 0.635 on Rosaceae, rice and Arabidopsis thaliana, respectively and outperformed the existing predictors. We anticipate that the Meta-i6mA can be applied across different plant species. Furthermore, we developed an online user-friendly web server, which is available at http://kurata14.bio.kyutech.ac.jp/Meta-i6mA/.",
                "authors": [
                    {
                        "name": "Hasan M.M."
                    },
                    {
                        "name": "Basith S."
                    },
                    {
                        "name": "Khatun M.S."
                    },
                    {
                        "name": "Lee G."
                    },
                    {
                        "name": "Manavalan B."
                    },
                    {
                        "name": "Kurata H."
                    }
                ],
                "citationCount": 12,
                "date": "2021-05-20T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "Meta-i6mA: an interspecies predictor for identifying DNA N6-methyladenine sites of plant genomes by exploiting informative features in an integrative machine-learning framework"
            },
            "pmid": "32910169"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        }
    ]
}