{
    "additionDate": "2021-01-18T10:02:29Z",
    "biotoolsCURIE": "biotools:scebe",
    "biotoolsID": "scebe",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "sxu@genmab.com",
            "name": "Yaning Yang",
            "typeEntity": "Person"
        },
        {
            "email": "ynyang@ustc.edu.cn",
            "name": "Xu Steven Xu",
            "typeEntity": "Person"
        }
    ],
    "description": "an efficient and scalable algorithm for genome-wide association studies on longitudinal outcomes with mixed-effects modeling.\n\nSCEBE is a R package that conducts high-dimension Genome-Wide Association Study (GWAS) for dynamic traits. The main function in SCEBE package is scebe_sim. Four approaches are included in SCEBE: (1) lme in R package 'lme4' (standard approach), (2) nebe, representing naive empirical Bayes estimation (Londono et al. 2013 and Meirelles et al. 2013), (3) gallop, representing Genome-wide Analysis of Largescale Longitudinal Outcomes using Penalization (GALLOP) (Sikorska et al. 2015), and scebe, representing the proposed two-step simultaneous correction method.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Statistical inference",
                    "uri": "http://edamontology.org/operation_3658"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Myuan2019/SCEBE",
    "lastUpdate": "2021-02-11T17:38:56Z",
    "name": "SCEBE",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAA130",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.Genome-wide association studies (GWAS) using longitudinal phenotypes collected over time is appealing due to the improvement of power. However, computation burden has been a challenge because of the complex algorithms for modeling the longitudinal data. Approximation methods based on empirical Bayesian estimates (EBEs) from mixed-effects modeling have been developed to expedite the analysis. However, our analysis demonstrated that bias in both association test and estimation for the existing EBE-based methods remains an issue. We propose an incredibly fast and unbiased method (simultaneous correction for EBE, SCEBE) that can correct the bias in the naive EBE approach and provide unbiased P-values and estimates of effect size. Through application to Alzheimer's Disease Neuroimaging Initiative data with 6 414 695 single nucleotide polymorphisms, we demonstrated that SCEBE can efficiently perform large-scale GWAS with longitudinal outcomes, providing nearly 10 000 times improvement of computational efficiency and shortening the computation time from months to minutes. The SCEBE package and the example datasets are available at https://github.com/Myuan2019/SCEBE.",
                "authors": [
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Pinheiro J."
                    },
                    {
                        "name": "Xu J."
                    },
                    {
                        "name": "Xu X.S."
                    },
                    {
                        "name": "Yang Y."
                    },
                    {
                        "name": "Yuan M."
                    },
                    {
                        "name": "Zhou Y."
                    }
                ],
                "date": "2021-05-20T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "SCEBE: an efficient and scalable algorithm for genome-wide association studies on longitudinal outcomes with mixed-effects modeling"
            },
            "pmid": "32634825"
        }
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
