{
    "additionDate": "2020-01-14T19:31:02Z",
    "biotoolsCURIE": "biotools:UniprotR",
    "biotoolsID": "UniprotR",
    "confidence_flag": "tool",
    "description": "Retrieving and visualizing protein sequence and functional information from Universal Protein Resource (UniProt knowledgebase).\n\nRetrieving Information of Proteins from Uniprot.\n\nConnect to Uniprot <https://www.uniprot.org/> to retrieve information about proteins using their accession number such information could be name or taxonomy information.\n\nUniprotR: Retrieving and visualizing protein sequence and functional information from Universal Protein Resource (UniProtknowledgebase).\n\nM. Soudy, A. Anwar, E.A. Ahmed, et al., UniprotR: Retrieving and visualizing protein sequence and functional information from Universal Protein Resource (UniProt knowledgebase), Journal of Proteomics (2019), https://doi.org/10.1016/j.jprot.2019.103613",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/UniprotR/index.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-02T09:53:17Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/Proteomicslab57357/UniprotR"
        }
    ],
    "name": "UniprotR",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.JPROT.2019.103613",
            "metadata": {
                "abstract": "© 2019UniprotR is a software package designed to easily retrieve, cluster and visualize protein data from UniProt knowledgebase (UniProtKB) using R language. The package is implemented mainly to process, parse and illustrate proteomics data in a handy and time-saving approach allowing researchers to summarize all required protein information available at UniProtKB in a readable data frame, Excel CSV file, and/or graphical output. UniprotR generates a set of graphics including gene ontology, chromosomal location, protein scoring and status, protein networking, sequence phylogenetic tree, and physicochemical properties. In addition, the package supports clustering of proteins based on primary gene name or chromosomal location, facilitating additional downstream analysis. Significance: In this work, we implemented a robust package for retrieving and visualizing information from multiple sources such UniProtKB, SWISS-MODEL, and STRING. UniprotR Contains functions that enable retrieving and cluster data in a handy way and visualize data in publishable graphs to facilitate researcher's work and fulfill their needs. UniprotR will aid in saving time for downstream data analysis instead of manual time consuming data analysis. Availability and implementation: UniprotR released as free open source code under the license of GPLv3, and available in CRAN (The Comprehensive R Archive Network) and GitHub. (https://cran.r-project.org/web/packages/UniprotR/index.html). (https://github.com/Proteomicslab57357/UniprotR).",
                "authors": [
                    {
                        "name": "Ahmed E.A."
                    },
                    {
                        "name": "Anwar A.M."
                    },
                    {
                        "name": "Ezzeldin S."
                    },
                    {
                        "name": "Magdeldin S."
                    },
                    {
                        "name": "Mahgoub S."
                    },
                    {
                        "name": "Osama A."
                    },
                    {
                        "name": "Soudy M."
                    }
                ],
                "citationCount": 8,
                "date": "2020-02-20T00:00:00Z",
                "journal": "Journal of Proteomics",
                "title": "UniprotR: Retrieving and visualizing protein sequence and functional information from Universal Protein Resource (UniProt knowledgebase)"
            },
            "pmid": "31843688"
        }
    ],
    "topic": [
        {
            "term": "Data management",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        }
    ],
    "validated": 1
}
