{
    "additionDate": "2015-08-04T11:57:57Z",
    "biotoolsCURIE": "biotools:biclue",
    "biotoolsID": "biclue",
    "credit": [
        {
            "name": "bmb.sdu.dk",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "jbaumbac@imada.sdu.dk",
            "name": "Jan Baumbach",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Bi-clustering software for solving the weighted/unweighted bi-cluster editing problem. It provides exact as well as heuristic algorithms.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://biclue.compbio.sdu.dk/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Gene expression data",
                        "uri": "http://edamontology.org/data_2603"
                    }
                },
                {
                    "data": {
                        "term": "Sequence",
                        "uri": "http://edamontology.org/data_2044"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Gene expression clustering",
                    "uri": "http://edamontology.org/operation_0313"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                }
            ]
        }
    ],
    "homepage": "http://biclue.compbio.sdu.dk",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "name": "BiCluE",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "veits@bmb.sdu.dk",
    "publication": [
        {
            "doi": "10.1093/nar/gku201",
            "metadata": {
                "abstract": "The explosion of the biological data has dramatically reformed today's biological research. The need to integrate and analyze high-dimensional biological data on a large scale is driving the development of novel bioinformatics approaches. Biclustering, also known as 'simultaneous clustering' or 'co-clustering', has been successfully utilized to discover local patterns in gene expression data and similar biomedical data types. Here, we contribute a new heuristic: 'Bi-Force'. It is based on the weighted bicluster editing model, to perform biclustering on arbitrary sets of biological entities, given any kind of pairwise similarities. We first evaluated the power of Bi-Force to solve dedicated bicluster editing problems by comparing Bi-Force with two existing algorithms in the BiCluE software package. We then followed a biclustering evaluation protocol in a recent review paper from Eren et́ al. (2013) (A comparative analysis of biclustering algorithms for gene expressiondata. Brief. Bioinform., 14:279-292.) and compared Bi-Force against eight existing tools: FABIA, QUBIC, Cheng and Church, Plaid, BiMax, Spectral, xMOTIFs and ISA. To this end, a suite of synthetic datasets as well as nine large gene expression datasets from Gene Expression Omnibus were analyzed. All resulting biclusters were subsequently investigated by Gene Ontology enrichment analysis to evaluate their biological relevance. The distinct theoretical foundation of Bi-Force (bicluster editing) is more powerful than strict biclustering. We thus outperformed existing tools with Bi-Force at least when following the evaluation protocols from Eren et́ al. Bi-Force is implemented in Java and integrated into the open source software package of BiCluE. © 2014 The Author(s) 2014.",
                "authors": [
                    {
                        "name": "Sun P."
                    },
                    {
                        "name": "Speicher N.K."
                    },
                    {
                        "name": "Rottger R."
                    },
                    {
                        "name": "Guo J."
                    },
                    {
                        "name": "Baumbach J."
                    }
                ],
                "citationCount": 9,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Bi-Force: Large-scale bicluster editing and its application to gene expression data biclustering"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}