{
    "additionDate": "2021-10-25T06:10:40.849860Z",
    "biotoolsCURIE": "biotools:nanodisco",
    "biotoolsID": "nanodisco",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "gang.fang@mssm.edu",
            "name": "Gang Fang",
            "orcidid": "https://orcid.org/0000-0002-2462-9124",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "nanodisco is a toolbox for de novo discovery of all the three types (6mA, 5mC and 4mC) of DNA methylation from individual bacteria and microbiomes using nanopore sequencing. For microbiomes, nanodisco also supports the use of DNA methylation patterns as natural epigenetic barcodes to facilitate high resolution metagenomic binning. Specifically, nanodisco can be used to De novo discover DNA methylation motifs, identify specific type (6mA, 5mC or 4mC, namely typing) of a methylation motif, and identify which specific position within the motif is methylated (namely fine mapping), performing metagenomic binning based on microbial DNA methylation pattern by constructing and clustering a methylation profile matrix, and to integrate the two functionalities above together for de novo methylation motif discovery from microbiomes, and metagenomic analysis.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Methylation analysis",
                    "uri": "http://edamontology.org/operation_3204"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Sequence motif discovery",
                    "uri": "http://edamontology.org/operation_0238"
                },
                {
                    "term": "de Novo sequencing",
                    "uri": "http://edamontology.org/operation_3644"
                }
            ]
        }
    ],
    "homepage": "https://github.com/fanglab/nanodisco",
    "language": [
        "R",
        "Shell"
    ],
    "lastUpdate": "2021-10-25T06:11:49.786333Z",
    "license": "CC-BY-NC-SA-4.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/fanglab/nanodisco/issues"
        }
    ],
    "name": "nanodisco",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1038/S41592-021-01109-3",
            "metadata": {
                "abstract": "© 2021, The Author(s), under exclusive licence to Springer Nature America, Inc.Bacterial DNA methylation occurs at diverse sequence contexts and plays important functional roles in cellular defense and gene regulation. Existing methods for detecting DNA modification from nanopore sequencing data do not effectively support de novo study of unknown bacterial methylomes. In this work, we observed that a nanopore sequencing signal displays complex heterogeneity across methylation events of the same type. To enable nanopore sequencing for broadly applicable methylation discovery, we generated a training dataset from an assortment of bacterial species and developed a method, named nanodisco (https://github.com/fanglab/nanodisco), that couples the identification and fine mapping of the three forms of methylation into a multi-label classification framework. We applied it to individual bacteria and the mouse gut microbiome for reliable methylation discovery. In addition, we demonstrated the use of DNA methylation for binning metagenomic contigs, associating mobile genetic elements with their host genomes and identifying misassembled metagenomic contigs.",
                "authors": [
                    {
                        "name": "Fang G."
                    },
                    {
                        "name": "Mead E.A."
                    },
                    {
                        "name": "Tourancheau A."
                    },
                    {
                        "name": "Zhang X.-S."
                    }
                ],
                "citationCount": 4,
                "date": "2021-05-01T00:00:00Z",
                "journal": "Nature Methods",
                "title": "Discovering multiple types of DNA methylation from bacteria and microbiome using nanopore sequencing"
            },
            "pmcid": "PMC8107137",
            "pmid": "33820988",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Methylated DNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3674"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        }
    ]
}
