{
    "additionDate": "2017-12-18T00:13:29Z",
    "biotoolsCURIE": "biotools:taxfold",
    "biotoolsID": "taxfold",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.ntu.edu.sg/home/chenxin/index.htm"
        }
    ],
    "description": "A new taxonomy-based protein fold recognition method. It extensively exploits the sequence evolution information from PSI-BLAST profiles and the secondary structure information from PSIPRED profiles. A comprehensive set of 137 features is constructed, which allows for the depiction of both global and local characteristics of PSI-BLAST and PSIPRED profiles.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www1.spms.ntu.edu.sg/~chenxin/TAXFOLD/about.html"
        },
        {
            "type": [
                "User manual"
            ],
            "url": "http://www1.spms.ntu.edu.sg/~chenxin/TAXFOLD/Download/README.txt"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                }
            ]
        }
    ],
    "homepage": "http://www1.spms.ntu.edu.sg/~chenxin/TAXFOLD/",
    "lastUpdate": "2018-12-10T12:58:53Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/taxfold-improve-toxonomy-based-protein-fold-recognition.html"
        }
    ],
    "name": "TAXFOLD",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1002/prot.23025",
            "metadata": {
                "abstract": "Fold recognition from amino acid sequences plays an important role in identifying protein structures and functions. The taxonomy-based method, which classifies a query protein into one of the known folds, has been shown very promising for protein fold recognition. However, extracting a set of highly discriminative features from amino acid sequences remains a challenging problem. To address this problem, we developed a new taxonomy-based protein fold recognition method called TAXFOLD. It extensively exploits the sequence evolution information from PSI-BLAST profiles and the secondary structure information from PSIPRED profiles. A comprehensive set of 137 features is constructed, which allows for the depiction of both global and local characteristics of PSI-BLAST and PSIPRED profiles. We tested TAXFOLD on four datasets and compared it with several major existing taxonomic methods for fold recognition. Its recognition accuracies range from 79.6 to 90% for 27, 95, and 194 folds, achieving an average 6.9% improvement over the best available taxonomic method. Further test on the Lindahl benchmark dataset shows that TAXFOLD is comparable with the best conventional template-based threading method at the SCOP fold level. These experimental results demonstrate that the proposed set of features is highly beneficial to protein fold recognition. © 2011 Wiley-Liss, Inc.",
                "authors": [
                    {
                        "name": "Yang J.-Y."
                    },
                    {
                        "name": "Chen X."
                    }
                ],
                "citationCount": 50,
                "date": "2011-07-01T00:00:00Z",
                "journal": "Proteins: Structure, Function and Bioinformatics",
                "title": "Improving taxonomy-based protein fold recognition by using global and local features"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ],
    "validated": 1
}