{
    "accessibility": "Open access",
    "additionDate": "2021-12-11T19:33:50.301063Z",
    "biotoolsCURIE": "biotools:bims",
    "biotoolsID": "bims",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "sook_jung@wsu.edu",
            "name": "Sook Jung",
            "orcidid": "https://orcid.org/0000-0003-3968-2769",
            "typeEntity": "Person"
        }
    ],
    "description": "The Breeding Information Management System (BIMS). BIMS is a free, open-source, secure and online breeding management system which allows breeders to store, manage, archive and analyze their private breeding program data.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://www.breedwithbims.org",
    "lastUpdate": "2021-12-11T19:33:50.303740Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://gitlab.com/mainlabwsu/bims"
        }
    ],
    "name": "BIMS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAAB054",
            "metadata": {
                "abstract": "© 2021 The Author(s) 2021. Published by Oxford University Press.In this era of big data, breeding programs are producing ever larger amounts of data. This necessitates access to efficient management systems to keep track of cross, performance, pedigree, geographical and image-based data, as well as genotyping data. In this article, we report the progress on the Breeding Information Management System (BIMS), a free, secure and online breeding management system that allows breeders to store, manage, archive and analyze their private breeding data. BIMS is the first publicly available database system that enables individual breeders to integrate their private phenotypic and genotypic data with public data and, at the same time, have complete control of their own breeding data along with access to tools such as data import/export, data analysis and data archiving. The integration of breeding data with publicly available genomic and genetic data enhances genetic understanding of important traits and maximizes the marker-assisted breeding utility for breeders and allied scientists. BIMS incorporates the use of the Android App Field Book, open-source phenotype data collection software for phones and tablets that allows breeders to replace hard copy field books, thus alleviating the possibility of transcription errors while providing faster access to the collected data. BIMS comes with training materials and support for individual or small group training and is currently implemented in the Genome Database for Rosaceae, CottonGEN, the Citrus Genome Database, the Pulse Crop Database, and the Genome Database for Vaccinium.",
                "authors": [
                    {
                        "name": "Campbell B.T."
                    },
                    {
                        "name": "Edge-Garza D."
                    },
                    {
                        "name": "Gasic K."
                    },
                    {
                        "name": "Hough H."
                    },
                    {
                        "name": "Humann J."
                    },
                    {
                        "name": "Jung S."
                    },
                    {
                        "name": "Lee T."
                    },
                    {
                        "name": "Main D."
                    },
                    {
                        "name": "Ru S."
                    },
                    {
                        "name": "Yu J."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Database",
                "title": "The Breeding Information Management System (BIMS): An online resource for crop breeding"
            },
            "pmcid": "PMC8378516",
            "pmid": "34415997"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Biological databases",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ],
    "validated": 1
}
