{
    "additionDate": "2021-01-18T11:04:22Z",
    "biotoolsCURIE": "biotools:mfassignr",
    "biotoolsID": "mfassignr",
    "confidence_flag": "tool",
    "description": "Molecular formula assignment software for ultrahigh resolution mass spectrometry analysis of environmental complex mixtures.\n\nUltrahigh resolution mass spectrometry is widely used for nontargeted analysis of complex environmental and biological mixtures, such as dissolved organic matter, due to its unparalleled ability to provide accurate mass measurements.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/skschum/MFAssignR",
    "lastUpdate": "2021-02-22T08:41:30Z",
    "name": "MFAssignR",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/J.ENVRES.2020.110114",
            "metadata": {
                "abstract": "© 2020 Elsevier Inc.Ultrahigh resolution mass spectrometry is widely used for nontargeted analysis of complex environmental and biological mixtures, such as dissolved organic matter, due to its unparalleled ability to provide accurate mass measurements. Accurate and efficient characterization of these mixtures is critical to being better able to evaluate their effect on human health and climate. This characterization requires accurate mass signals free from isobaric interferences, instrument noise, and mass measurement biases, allowing for molecular formula identification. To address this need, an open source post-processing pipeline for ultrahigh resolution mass spectra of environmental complex mixtures software was developed. MFAssignR contains functions that perform noise estimation, 13C and 34S polyisotopic mass filtering, mass measurement recalibration, and molecular formula assignment as part of a consistent data processing environment. Novel applications of mass defect analysis were used in the functions for noise estimation and isotope pair identification. Using formula extensions, exact mass measurements are converted to unambiguous molecular formulas via data dependent pathways, reducing a priori decisions. Optional molecular formula ambiguity and multiple non-oxygen heteroatoms are provided for custom user applications, including isotopically labeled reactive species, halogen-containing species, or tandem ultrahigh resolution mass spectrometry. This represents uncommon flexibility for an open-source software package. To evaluate the performance of MFAssignR, it was used to characterize a sample of biomass burning influenced organic aerosol and the results were compared to those from other available methods of molecular formula assignment and noise estimation. The differences between the methods are described here. Overall, the inclusion of a full pipeline of data preparation functions and the data-dependent ambiguity reductions in MFAssignR render excellent results and make MFAssignR well-suited for the consistent and efficient analysis of environmental complex mixtures. MFAssignR is publicly available via GitHub.",
                "authors": [
                    {
                        "name": "Schum S.K."
                    },
                    {
                        "name": "Brown L.E."
                    },
                    {
                        "name": "Mazzoleni L.R."
                    }
                ],
                "citationCount": 7,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Environmental Research",
                "title": "MFAssignR: Molecular formula assignment software for ultrahigh resolution mass spectrometry analysis of environmental complex mixtures"
            },
            "pmid": "32866496"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}