{
    "additionDate": "2021-01-18T10:33:03Z",
    "biotoolsCURIE": "biotools:stackppi",
    "biotoolsID": "stackppi",
    "confidence_flag": "tool",
    "description": "Improving protein-protein interactions prediction accuracy using XGBoost feature selection and stacked ensemble classifier.\n\nProtein-protein interactions (PPIs) are involved with most cellular activities at the proteomic level, making the study of PPIs necessary to comprehending any biological process. Machine learning approaches have been explored, leading to more accurate and generalized PPIs predictions. In this paper, we propose a predictive framework called StackPPI. First, we use pseudo amino acid composition, Moreau-Broto, Moran and Geary autocorrelation descriptor, amino acid composition position-specific scoring matrix, Bi-gram position-specific scoring matrix and composition, transition and distribution to encode biologically relevant features. Secondly, we employ XGBoost to reduce feature noise and perform dimensionality reduction through gradient boosting and average gain",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Protein-protein binding site prediction",
                    "uri": "http://edamontology.org/operation_2464"
                }
            ]
        }
    ],
    "homepage": "https://github.com/QUST-AIBBDRC/StackPPI/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-21T16:15:34Z",
    "name": "StackPPI",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1016/J.COMPBIOMED.2020.103899",
            "metadata": {
                "abstract": "© 2020 Elsevier LtdProtein-protein interactions (PPIs) are involved with most cellular activities at the proteomic level, making the study of PPIs necessary to comprehending any biological process. Machine learning approaches have been explored, leading to more accurate and generalized PPIs predictions. In this paper, we propose a predictive framework called StackPPI. First, we use pseudo amino acid composition, Moreau-Broto, Moran and Geary autocorrelation descriptor, amino acid composition position-specific scoring matrix, Bi-gram position-specific scoring matrix and composition, transition and distribution to encode biologically relevant features. Secondly, we employ XGBoost to reduce feature noise and perform dimensionality reduction through gradient boosting and average gain. Finally, the optimized features that result are analyzed by StackPPI, a PPIs predictor we have developed from a stacked ensemble classifier consisting of random forest, extremely randomized trees and logistic regression algorithms. Five-fold cross-validation shows StackPPI can successfully predict PPIs with an ACC of 89.27%, MCC of 0.7859, AUC of 0.9561 on Helicobacter pylori, and with an ACC of 94.64%, MCC of 0.8934, AUC of 0.9810 on Saccharomyces cerevisiae. We find StackPPI improves protein interaction prediction accuracy on independent test sets compared to the state-of-the-art models. Finally, we highlight StackPPI's ability to infer biologically significant PPI networks. StackPPI's accurate prediction of functional pathways make it the logical choice for studying the underlying mechanism of PPIs, especially as it applies to drug design. The datasets and source code used to create StackPPI are available here: https://github.com/QUST-AIBBDRC/StackPPI/.",
                "authors": [
                    {
                        "name": "Chen C."
                    },
                    {
                        "name": "Zhang Q."
                    },
                    {
                        "name": "Yu B."
                    },
                    {
                        "name": "Yu Z."
                    },
                    {
                        "name": "Lawrence P.J."
                    },
                    {
                        "name": "Ma Q."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "citationCount": 19,
                "date": "2020-08-01T00:00:00Z",
                "journal": "Computers in Biology and Medicine",
                "title": "Improving protein-protein interactions prediction accuracy using XGBoost feature selection and stacked ensemble classifier"
            },
            "pmid": "32768046"
        }
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein interaction experiment",
            "uri": "http://edamontology.org/topic_3957"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}