{"credit":[{"email":"xuchen2004@gmail.com","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://sulab.uncc.edu/"}],"documentation":[{"type":"GENERAL","url":"http://bioinfo.uncc.edu/SNNCliq/"}],"function":[{"operation":[{"term":"Gene expression clustering","uri":"http://edamontology.org/operation_0313"}]}],"labels":{"language":["MATLAB","Python"],"operatingSystem":["Linux","Windows"],"toolType":["Library"],"topic":[{"term":"Transcriptomics","uri":"http://edamontology.org/topic_3308"},{"term":"Gene expression","uri":"http://edamontology.org/topic_0203"},{"term":"Statistics and probability","uri":"http://edamontology.org/topic_2269"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/snn-cliq-1-0-clustering-method-for-high-dimensional-dataset.html"}],"publication":[{"abstract":"© The Author 2015. Published by Oxford University Press.Motivation: The recent advance of single-cell technologies has brought new insights into complex biological phenomena. In particular, genome-wide single-cell measurements such as transcriptome sequencing enable the characterization of cellular composition as well as functional variation in homogenic cell populations. An important step in the single-cell transcriptome analysis is to group cells that belong to the same cell types based on gene expression patterns. The corresponding computational problem is to cluster a noisy high dimensional dataset with substantially fewer objects (cells) than the number of variables (genes). Results: In this article, we describe a novel algorithm named shared nearest neighbor (SNN)-Cliq that clusters single-cell transcriptomes. SNN-Cliq utilizes the concept of shared nearest neighbor that shows advantages in handling high-dimensional data. When evaluated on a variety of synthetic and real experimental datasets, SNN-Cliq outperformed the state-of-the-art methods tested. More importantly, the clustering results of SNN-Cliq reflect the cell types or origins with high accuracy.","authors":["Xu C.","Su Z."],"cit_count":86,"journal":"Bioinformatics","pmid":"25805722","title":"Identification of cell types from single-cell transcriptomes using a novel clustering method","year":"2015-06-15"}],"summary":{"biotoolsCURIE":"biotools:snn-cliq","biotoolsID":"snn-cliq","description":"A clustering method designed for high dimensional gene expression data, e.g. single-cell transcriptome data. This method can effectively cluster individual cells based on their transcriptomes, producing clustering outputs highly in accordance with the cell type origins. It utilizes the concept of shared nearest neighbor (SNN) to define similarities between data points (cells) and achieve clustering by a graph theory-based algorithm.","homepage":"http://bioinfo.uncc.edu/SNNCliq/","name":"SNN-Cliq"}}