{
    "additionDate": "2017-03-27T12:32:40Z",
    "biotoolsCURIE": "biotools:redfly",
    "biotoolsID": "redfly",
    "credit": [
        {
            "name": "Contact Form",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://redfly.ccr.buffalo.edu/contact.php"
        }
    ],
    "description": "The REDfly database of Drosophila transcriptional cis-regulatory elements provides experimentally validated cis-regulatory modules and transcription factor binding sites. The user interface is designed for access by both causal and power users and is intended as a tool for facilitating computational as well as experimental studies of transcriptional regulation.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://redfly.ccr.buffalo.edu/help.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Transcription factor binding site prediction",
                    "uri": "http://edamontology.org/operation_0445"
                },
                {
                    "term": "Transcriptional regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0438"
                }
            ]
        }
    ],
    "homepage": "http://redfly.ccr.buffalo.edu",
    "lastUpdate": "2024-11-24T20:26:11.532858Z",
    "name": "REDfly",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_006790"
        }
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": "10.1093/nar/gkm876",
            "metadata": {
                "abstract": "The identification and study of the cis-regulatory elements that control gene expression are important areas of biological research, but few resources exist to facilitate large-scale bioinformatics studies of cis -regulation in metazoan species. Drosophila melanogaster, with its well-annotated genome, exceptional resources for comparative genomics and long history of experimental studies of transcriptional regulation, represents the ideal system for regulatory bioinformatics. We have merged two existing Drosophila resources, the REDfly database of cis- regulatory modules and the FlyReg database of transcription factor binding sites (TFBSs), into a single integrated database containing extensive annotation of empirically validated cis-regulatory modules and their constituent binding sites. With the enhanced functionality made possible through this integration of TFBS data into REDfly, together with additional improvements to the REDfly infrastructure, we have constructed a one-stop portal for Drosophila cis -regulatory data that will serve as a powerful resource for both computational and experimental studies of transcriptional regulation. REDfly is freely accessible at http://redfly.ccr.buffalo.edu. © 2007 The Author(s).",
                "authors": [
                    {
                        "name": "Bergman C.M."
                    },
                    {
                        "name": "Gallo S.M."
                    },
                    {
                        "name": "Halfon M.S."
                    }
                ],
                "citationCount": 84,
                "date": "2008-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "REDfly 2.0: An integrated database of cis -regulatory modules and transcription factor binding sites in Drosophila"
            },
            "pmcid": "PMC2238825",
            "pmid": "18039705"
        },
        {
            "doi": "10.1093/nar/gkq999",
            "metadata": {
                "abstract": "The REDfly database of Drosophila transcriptional cis-regulatory elements provides the broadest and most comprehensive available resource for experimentally validated cis-regulatory modules and transcription factor binding sites among the metazoa. The third major release of the database extends the utility of REDfly as a powerful tool for both computational and experimental studies of transcription regulation. REDfly v3.0 includes the introduction of new data classes to expand the types of regulatory elements annotated in the database along with a roughly 40% increase in the number of records. A completely redesigned interface improves access for casual and power users alike; among other features it now automatically provides graphical views of the genome, displays images of reporter gene expression and implements improved capabilities for database searching and results filtering. REDfly is freely accessible at http://redfly .ccr.buffalo.edu. © The Author(s) 2010.",
                "authors": [
                    {
                        "name": "Bergman C.M."
                    },
                    {
                        "name": "Des Soye B."
                    },
                    {
                        "name": "Gallo S.M."
                    },
                    {
                        "name": "Gerrard D.T."
                    },
                    {
                        "name": "Halfon M.S."
                    },
                    {
                        "name": "Miner D."
                    },
                    {
                        "name": "Simich M."
                    }
                ],
                "citationCount": 129,
                "date": "2011-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "REDfly v3.0: Toward a comprehensive database of transcriptional regulatory elements in Drosophila"
            },
            "pmcid": "PMC3013816",
            "pmid": "20965965"
        },
        {
            "doi": "10.1093/bioinformatics/bti794",
            "metadata": {
                "abstract": "Summary: Bioinformatics studies of transcriptional regulation in the metazoa are significantly hindered by the absence of readily available data on large numbers of transcriptional cis-regulatory modules (CRMs). Even the richly annotated Drosophila melanogaster genome lacks extensive CRM information. We therefore present here a database of Drosophila CRMs curated from the literature complete with both DNA sequence and a searchable description of the gene expression pattern regulated by each CRM. This resource should greatly facilitate the development of computational approaches to CRM discovery as well as bioinformatics analyses of regulatory sequence properties and evolution. © The Author 2005. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Gallo S.M."
                    },
                    {
                        "name": "Halfon M.S."
                    },
                    {
                        "name": "Hu Z."
                    },
                    {
                        "name": "Li L."
                    }
                ],
                "citationCount": 69,
                "date": "2006-02-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "REDfly: A Regulatory Element Database for Drosophila"
            },
            "pmid": "16303794"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Experimental design and studies",
            "uri": "http://edamontology.org/topic_3678"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ],
    "validated": 1
}
