{"credit":[{"email":"p.baranov@ucc.ie","name":"Pasha V Baranov","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://recode.ucc.ie/help"}],"function":[{"operation":[{"term":"Database search","uri":"http://edamontology.org/operation_2421"},{"term":"Frameshift detection","uri":"http://edamontology.org/operation_0265"},{"term":"Query and retrieval","uri":"http://edamontology.org/operation_0224"},{"term":"SECIS element prediction","uri":"http://edamontology.org/operation_0437"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Database portal"],"topic":[{"term":"Gene transcripts","uri":"http://edamontology.org/topic_3512"},{"term":"Transcription factors and regulatory sites","uri":"http://edamontology.org/topic_0749"},{"term":"Gene expression","uri":"http://edamontology.org/topic_0203"},{"term":"Protein expression","uri":"http://edamontology.org/topic_0108"}]},"publication":[{"abstract":"'Recoding' is a term used to describe non-standard read-out of the genetic code, and encompasses such phenomena as programmed ribosomal frameshifting, stop codon readthrough, selenocysteine insertion and translational bypassing. Although only a small proportion of genes utilize recoding in protein synthesis, accurate annotation of 'recoded' genes lags far behind annotation of 'standard' genes. In order to address this issue, provide a service to researchers in the field, and offer training data for developers of gene-annotation software, we have gathered together known cases of recoding within the Recode database. Recode-2 is an improved and updated version of the database. It provides access to detailed information on genes known to utilize translational recoding and allows complex search queries, browsing of recoding data and enhanced visualization of annotated sequence elements. At present, the Recode-2 database stores information on approximately 1500 genes that are known to utilize recoding in their expression-a factor of approximately three increase over the previous version of the database. Recode-2 is available at http://recode.ucc.ie. © The Author(s) 2009. Published by Oxford University Press.","authors":["Bekaert M.","Firth A.E.","Zhang Y.","Gladyshev V.N.","Atkins J.F.","Baranov P.V."],"cit_count":32,"journal":"Nucleic Acids Research","pmid":"19783826","title":"Recode-2: New design, new search tools, and many more genes","year":"2009-09-25"}],"summary":{"biotoolsCURIE":"biotools:recode","biotoolsID":"recode","description":"Recode2 is a database of genes that utilize non-standard translation for gene expression purposes. Recoding events described in the database include programmed ribosomal frameshifting, translational bypassing (aka hopping) and mRNA specific codon redefinition. Recode-2 provides access to detailed information on genes known to utilize translational recoding and allows complex search queries, browsing of recoding data and enhanced visualization of annotated sequence elements.","homepage":"http://recode.ucc.ie","name":"Recode"}}