{
    "additionDate": "2020-01-09T17:44:57Z",
    "biotoolsCURIE": "biotools:SubMito-XGBoost",
    "biotoolsID": "SubMito-XGBoost",
    "confidence_flag": "tool",
    "description": "predicting protein submitochondrial localization by fusing multiple feature information and eXtreme gradient boosting.\n\nMOTIVATION:Mitochondria are an essential organelle in most eukaryotes. They not only play an important role in energy metabolism but also take part in many critical cytopathological processes. Abnormal mitochondria can trigger a series of human diseases, such as Parkinson's disease, multifactor disorder, and Type-II diabetes. Protein submitochondrial localization enables the understanding of protein function in studying disease pathogenesis and drug design. RESULTS:We proposed a new method, SubMito-XGBoost, for protein submitochondrial localization prediction",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                },
                {
                    "term": "Sequence feature detection",
                    "uri": "http://edamontology.org/operation_0253"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                }
            ]
        }
    ],
    "homepage": "https://github.com/QUST-AIBBDRC/SubMito-XGBoost/",
    "language": [
        "R",
        "MATLAB",
        "Python"
    ],
    "lastUpdate": "2020-12-27T12:06:32Z",
    "name": "SubMito-XGBoost",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ734",
            "metadata": {
                "abstract": "© 2020 Oxford University Press. All rights reserved.Motivation: Mitochondria are an essential organelle in most eukaryotes. They not only play an important role in energy metabolism but also take part in many critical cytopathological processes. Abnormal mitochondria can trigger a series of human diseases, such as Parkinson's disease, multifactor disorder and Type-II diabetes. Protein submitochondrial localization enables the understanding of protein function in studying disease pathogenesis and drug design. Results: We proposed a new method, SubMito-XGBoost, for protein submitochondrial localization prediction. Three steps are included: (i) the g-gap dipeptide composition (g-gap DC), pseudo-amino acid composition (PseAAC), auto-correlation function (ACF) and Bi-gram position-specific scoring matrix (Bi-gram PSSM) are employed to extract protein sequence features, (ii) Synthetic Minority Oversampling Technique (SMOTE) is used to balance samples, and the ReliefF algorithm is applied for feature selection and (iii) the obtained feature vectors are fed into XGBoost to predict protein submitochondrial locations. SubMito-XGBoost has obtained satisfactory prediction results by the leave-one-out-cross-validation (LOOCV) compared with existing methods. The prediction accuracies of the SubMito-XGBoost method on the two training datasets M317 and M983 were 97.7% and 98.9%, which are 2.8-12.5% and 3.8-9.9% higher than other methods, respectively. The prediction accuracy of the independent test set M495 was 94.8%, which is significantly better than the existing studies. The proposed method also achieves satisfactory predictive performance on plant and non-plant protein submitochondrial datasets. SubMito-XGBoost also plays an important role in new drug design for the treatment of related diseases.",
                "authors": [
                    {
                        "name": "Yu B."
                    },
                    {
                        "name": "Qiu W."
                    },
                    {
                        "name": "Chen C."
                    },
                    {
                        "name": "Ma A."
                    },
                    {
                        "name": "Jiang J."
                    },
                    {
                        "name": "Zhou H."
                    },
                    {
                        "name": "Ma Q."
                    }
                ],
                "citationCount": 38,
                "date": "2020-02-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "SubMito-XGBoost: Predicting protein submitochondrial localization by fusing multiple feature information and eXtreme gradient boosting"
            },
            "pmid": "31603468"
        }
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        }
    ],
    "validated": 1
}