{
    "additionDate": "2020-01-14T19:39:59Z",
    "biotoolsCURIE": "biotools:MethylToSNP",
    "biotoolsID": "MethylToSNP",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "elnitski@mail.nih.gov",
            "name": "Laura Elnitski",
            "orcidid": "https://orcid.org/0000-0003-1065-019X",
            "typeEntity": "Person"
        }
    ],
    "description": "Identifying SNPs in Illumina DNA methylation array data.\n\nDetect SNP patterns in Methylation Array data.\n\nThis is the developer version of Bioconductor package MethylToSNP. Install in R as:",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                },
                {
                    "term": "SNP annotation",
                    "uri": "http://edamontology.org/operation_3661"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                },
                {
                    "term": "Bisulfite mapping",
                    "uri": "http://edamontology.org/operation_3186"
                }
            ]
        }
    ],
    "homepage": "https://github.com/elnitskilab/MethylToSNP",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-28T09:43:48Z",
    "name": "MethylToSNP",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S13072-019-0321-6",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Current array-based methods for the measurement of DNA methylation rely on the process of sodium bisulfite conversion to differentiate between methylated and unmethylated cytosine bases in DNA. In the absence of genotype data this process can lead to ambiguity in data interpretation when a sample has polymorphisms at a methylation probe site. A common way to minimize this problem is to exclude such potentially problematic sites, with some methods removing as much as 60% of array probes from consideration before data analysis. Results: Here, we present an algorithm implemented in an R Bioconductor package, MethylToSNP, which detects a characteristic data pattern to infer sites likely to be confounded by polymorphisms. Additionally, the tool provides a stringent reliability score to allow thresholding on SNP predictions. We calibrated parameters and thresholds used by the algorithm on simulated and real methylation data sets. We illustrate findings using methylation data from YRI (Yoruba in Ibadan, Nigeria), CEPH (European descent) and KhoeSan (southern African) populations. Our polymorphism predictions made using MethylToSNP have been validated through SNP databases and bisulfite and genomic sequencing. Conclusions: The benefits of this method are threefold. First, it prevents extensive data loss by considering only SNPs specific to the individuals in the study. Second, it offers the possibility to identify new polymorphisms in samples for which there is little known about the genetic landscape. Third, it identifies variants as they exist in functional regions of a genome, such as in CTCF (transcriptional repressor) sites and enhancers, that may be common alleles or personal mutations with potential to deleteriously affect genomic regulatory activities. We demonstrate that MethylToSNP is applicable to the Illumina 450K and Illumina 850K EPIC array data and is also backwards compatible to the 27K methylation arrays. Going forward, this kind of nuanced approach can increase the amount of information derived from precious data sets by considering samples of the project individually to enable more informed decisions about data cleaning.",
                "authors": [
                    {
                        "name": "Labarre B.A."
                    },
                    {
                        "name": "Goncearenco A."
                    },
                    {
                        "name": "Petrykowska H.M."
                    },
                    {
                        "name": "Jaratlerdsiri W."
                    },
                    {
                        "name": "Bornman M.S.R."
                    },
                    {
                        "name": "Hayes V.M."
                    },
                    {
                        "name": "Elnitski L."
                    }
                ],
                "citationCount": 1,
                "date": "2019-12-20T00:00:00Z",
                "journal": "Epigenetics and Chromatin",
                "title": "MethylToSNP: Identifying SNPs in Illumina DNA methylation array data"
            },
            "pmcid": "PMC6923858",
            "pmid": "31861999"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Methylated DNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3674"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        }
    ],
    "validated": 1
}