
{
    "credit": [
        {
            "name": "SIB Swiss Institute of Bioinformatics",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "michael.baudis@imls.uzh.ch",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "http://www.arraymap.org/Wiki/ProgenetixGuide"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "labels": {
        "elixirNode": [
            "Switzerland"
        ],
        "elixirPlatform": [
            "Data"
        ],
        "language": [
            "JavaScript"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Systems biology",
                "uri": "http://edamontology.org/topic_2259"
            },
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://expasy.org"
        }
    ],
    "publication": [
        {
            "abstract": "© The Author(s) 2014.Somatic copy number aberrations (CNA) represent a mutation type encountered in the majority of cancer genomes. Here, we present the 2014 edition of arrayMap (http://www.arraymap.org), a publicly accessible collection of pre-processed oncogenomic array data sets and CNA profiles, representing a vast range of human malignancies. Since the initial release, we have enhanced this resource both in content and especially with regard to data mining support. The 2014 release of arrayMap contains more than 64 000 genomic array data sets, representing about 250 tumor diagnoses. Data sets included in arrayMap have been assembled from public repositories as well as additional resources, and integrated by applying custom processing pipelines. Online tools have been upgraded for a more flexible array data visualization, including options for processing user provided, nonpublic data sets. Data integration has been improved by mapping to multiple editions of the human reference genome, with the majority of the data now being available for the UCSC hg18 as well as GRCh37 versions. The large amount of tumor CNA data in arrayMap can be freely downloaded by users to promote data mining projects, and to explore special events such as chromothripsis-like genome patterns.",
            "authors": [
                "Cai H.",
                "Gupta S.",
                "Rath P.",
                "Ai N.",
                "Baudis M."
            ],
            "cit_count": 8,
            "doi": "10.1093/nar/gku1123",
            "journal": "Nucleic Acids Research",
            "title": "ArrayMap 2014: An updated cancer genome resource",
            "type": "Primary",
            "year": "2015-01-28"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:arraymap",
        "biotoolsID": "arraymap",
        "description": "A curated reference database and bioinformatics resource targeting copy number profiling data in human cancer. The arrayMap database provides an entry point for meta-analysis and systems level data integration of high-resolution oncogenomic CNA data.",
        "homepage": "http://www.arraymap.org",
        "name": "arrayMap"
    }
}