{
    "accessibility": "Open access",
    "additionDate": "2022-06-14T06:39:21.111530Z",
    "biotoolsCURIE": "biotools:gps-uber",
    "biotoolsID": "gps-uber",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "xueyu@hust.edu.cn",
            "name": "Yu Xue",
            "typeEntity": "Person"
        }
    ],
    "description": "Hybrid-learning framework for prediction of general and E3-specific lysine ubiquitination sites.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "PTM localisation",
                    "uri": "http://edamontology.org/operation_3755"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "http://gpsuber.biocuckoo.cn/",
    "lastUpdate": "2022-06-14T06:39:21.114491Z",
    "name": "GPS-Uber",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAB574",
            "metadata": {
                "abstract": "© The Author(s) 2022.As an important post-translational modification, lysine ubiquitination participates in numerous biological processes and is involved in human diseases, whereas the site specificity of ubiquitination is mainly decided by ubiquitin-protein ligases (E3s). Although numerous ubiquitination predictors have been developed, computational prediction of E3-specific ubiquitination sites is still a great challenge. Here, we carefully reviewed the existing tools for the prediction of general ubiquitination sites. Also, we developed a tool named GPS-Uber for the prediction of general and E3-specific ubiquitination sites. From the literature, we manually collected 1311 experimentally identified site-specific E3-substrate relations, which were classified into different clusters based on corresponding E3s at different levels. To predict general ubiquitination sites, we integrated 10 types of sequence and structure features, as well as three types of algorithms including penalized logistic regression, deep neural network and convolutional neural network. Compared with other existing tools, the general model in GPS-Uber exhibited a highly competitive accuracy, with an area under curve values of 0.7649. Then, transfer learning was adopted for each E3 cluster to construct E3-specific models, and in total 112 individual E3-specific predictors were implemented. Using GPS-Uber, we conducted a systematic prediction of human cancer-associated ubiquitination events, which could be helpful for further experimental consideration. GPS-Uber will be regularly updated, and its online service is free for academic research at http://gpsuber.biocuckoo.cn/.",
                "authors": [
                    {
                        "name": "Chen M."
                    },
                    {
                        "name": "Gou Y."
                    },
                    {
                        "name": "Han C."
                    },
                    {
                        "name": "Lin S."
                    },
                    {
                        "name": "Ning W."
                    },
                    {
                        "name": "Peng D."
                    },
                    {
                        "name": "Tan X."
                    },
                    {
                        "name": "Tang D."
                    },
                    {
                        "name": "Wang C."
                    },
                    {
                        "name": "Xue Y."
                    },
                    {
                        "name": "Zhang W."
                    }
                ],
                "date": "2022-03-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "GPS-Uber: A hybrid-learning framework for prediction of general and E3-specific lysine ubiquitination sites"
            },
            "pmid": "35037020"
        }
    ],
    "toolType": [
        "Web application",
        "Workbench"
    ],
    "topic": [
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        }
    ],
    "validated": 1
}
