{
    "additionDate": "2020-01-09T17:53:48Z",
    "biotoolsCURIE": "biotools:NutriGenomeDB",
    "biotoolsID": "NutriGenomeDB",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "roberto.martin@imdea.org",
            "name": "Roberto Martín-Hernández",
            "typeEntity": "Person"
        }
    ],
    "description": "a nutrigenomics exploratory and analytical platform.\n\nNutrigenomics data mining platform.\n\nNutrigenomics is defined as the science studying the role of nutrients and bioactive food compounds on gene expression. Whereas the idea of modulating human health by food intake is a millenial concept, the increasing number of research efforts on this field is pointing out that nutrition may exert its impact on health outcomes by directly affecting the expression of genes involved in critical metabolic pathways. Nowadays its widely accepted that cellular processes spanning from gene expression to protein synthesis can be regulated by dietary compounds. However there is a limited understanding of the underlying molecular mechanisms which are involved. NutriGenomeDB makes use of publicly available gene expression data obtained from nutrigenomics experiments in order to bring a the first platform for nutrigenomics data exploration",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression data visualisation",
                    "uri": "http://edamontology.org/operation_0571"
                },
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Expression profile comparison",
                    "uri": "http://edamontology.org/operation_0315"
                }
            ]
        }
    ],
    "homepage": "http://nutrigenomedb.org",
    "lastUpdate": "2021-01-04T09:21:20Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/rmartin84/NutriGenomeDB"
        }
    ],
    "name": "NutriGenomeDB",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAZ097",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Habitual consumption of certain foods has shown beneficial and protective effects against multiple chronic diseases. However, it is not clear by which molecular mechanisms they may exert their beneficial effects. Multiple-omic experiments available in public databases have generated gene expression data following the treatment of human cells with different food nutrients and bioactive compounds. Exploration of such data in an integrative manner offers excellent possibilities for gaining insights into the molecular effects of food compounds and bioactive molecules at the cellular level. Here we present NutriGenomeDB, a web-based application that hosts manually curated gene sets defined from gene expression signatures, after differential expression analysis of nutrigenomics experiments performed on human cells available in the Gene Expression Omnibus (GEO) repository. Through its web interface, users can explore gene expression data with interactive visualizations. In addition, external gene signatures can be connected with nutrigenomics gene sets using a gene pattern-matching algorithm. We further demonstrate how the application can capture the primary molecular mechanisms of a drug used to treat hypertension and thus connect its mode of action with hosted food compounds.",
                "authors": [
                    {
                        "name": "Martin-Hernandez R."
                    },
                    {
                        "name": "Reglero G."
                    },
                    {
                        "name": "Ordovas J.M."
                    },
                    {
                        "name": "Davalos A."
                    }
                ],
                "citationCount": 4,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Database",
                "title": "NutriGenomeDB: A nutrigenomics exploratory and analytical platform"
            },
            "pmcid": "PMC6821151",
            "pmid": "31665759"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Nutritional science",
            "uri": "http://edamontology.org/topic_3390"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}