{
    "additionDate": "2021-01-25T09:50:57Z",
    "biotoolsCURIE": "biotools:intside",
    "biotoolsID": "intside",
    "description": "Drug side effects are one of the main health threats worldwide, and an important obstacle in drug development. Understanding how adverse reactions occur requires knowledge on drug mechanisms at the molecular level. Despite recent advances, the need for tools and methods that facilitate side effect anticipation still remains. IntSide is a web server to elucidate the molecular processes involved in drug side effects through the integration of chemistry and biology. IntSide currently catalogues 1,175 side effects caused by 996 drugs, associated with drug features divided into eight categories, belonging to either biology or chemistry. On the biological side, IntSide reports drug targets and off-targets, pathways, molecular functions and biological processes. From a chemical viewpoint, it includes molecular fingerprints, scaffolds and chemical entities.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Drug report",
                        "uri": "http://edamontology.org/data_1696"
                    }
                },
                {
                    "data": {
                        "term": "Fingerprint",
                        "uri": "http://edamontology.org/data_1365"
                    }
                },
                {
                    "data": {
                        "term": "Pathway or network",
                        "uri": "http://edamontology.org/data_2600"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "homepage": "https://intside.irbbarcelona.org",
    "lastUpdate": "2024-11-24T15:19:15.451718Z",
    "name": "IntSIde",
    "owner": "ptck72",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btu688",
            "metadata": {
                "abstract": "Drug side effects are one of the main health threats worldwide, and an important obstacle in drug development. Understanding how adverse reactions occur requires knowledge on drug mechanisms at the molecular level. Despite recent advances, the need for tools and methods that facilitate side effect anticipation still remains. Here, we present IntSide, a web server that integrates chemical and biological information to elucidate the molecular mechanisms underlying drug side effects. IntSide currently catalogs 1175 side effects caused by 996 drugs, associated with drug features divided into eight categories, belonging to either biology or chemistry. On the biological side, IntSide reports drug targets and off-targets, pathways, molecular functions and biological processes. From a chemical viewpoint, it includes molecular fingerprints, scaffolds and chemical entities. Finally, we also integrate additional biological data, such as protein interactions and disease-related genes, to facilitate mechanistic interpretations.",
                "authors": [
                    {
                        "name": "Aloy P."
                    },
                    {
                        "name": "Duran-Frigola M."
                    },
                    {
                        "name": "Juan-Blanco T."
                    }
                ],
                "citationCount": 22,
                "date": "2015-02-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "IntSide: A web server for the chemical and biological examination of drug side effects"
            },
            "pmid": "25380960",
            "type": [
                "Method"
            ]
        }
    ],
    "topic": [
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
