{
    "accessibility": "Open access",
    "additionDate": "2023-08-30T14:26:10.621881Z",
    "biotoolsCURIE": "biotools:kargva",
    "biotoolsID": "kargva",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "m.prosperi@ufl.edu",
            "name": "Mattia Prosperi",
            "typeEntity": "Person"
        },
        {
            "name": "Christina Boucher",
            "typeEntity": "Person"
        },
        {
            "name": "Noelle Noyes",
            "typeEntity": "Person"
        },
        {
            "name": "Simone Marini",
            "typeEntity": "Person"
        }
    ],
    "description": "K-mer Antibiotic Resistance Gene Variant Analyzer.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Antimicrobial resistance prediction",
                    "uri": "http://edamontology.org/operation_3482"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "k-mer counting",
                    "uri": "http://edamontology.org/operation_3472"
                }
            ]
        }
    ],
    "homepage": "https://github.com/DataIntellSystLab/KARGVA",
    "language": [
        "Java"
    ],
    "lastUpdate": "2023-08-30T14:26:10.624682Z",
    "license": "MIT",
    "name": "KARGVA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FMICB.2023.1060891",
            "metadata": {
                "abstract": "Characterization of antibiotic resistance genes (ARGs) from high-throughput sequencing data of metagenomics and cultured bacterial samples is a challenging task, with the need to account for both computational (e.g., string algorithms) and biological (e.g., gene transfers, rearrangements) aspects. Curated ARG databases exist together with assorted ARG classification approaches (e.g., database alignment, machine learning). Besides ARGs that naturally occur in bacterial strains or are acquired through mobile elements, there are chromosomal genes that can render a bacterium resistant to antibiotics through point mutations, i.e., ARG variants (ARGVs). While ARG repositories also collect ARGVs, there are only a few tools that are able to identify ARGVs from metagenomics and high throughput sequencing data, with a number of limitations (e.g., pre-assembly, a posteriori verification of mutations, or specification of species). In this work we present the k-mer, i.e., strings of fixed length k, ARGV analyzer – KARGVA – an open-source, multi-platform tool that provides: (i) an ad hoc, large ARGV database derived from multiple sources; (ii) input capability for various types of high-throughput sequencing data; (iii) a three-way, hash-based, k-mer search setup to process data efficiently, linking k-mers to ARGVs, k-mers to point mutations, and ARGVs to k-mers, respectively; (iv) a statistical filter on sequence classification to reduce type I and II errors. On semi-synthetic data, KARGVA provides very high accuracy even in presence of high sequencing errors or mutations (99.2 and 86.6% accuracy within 1 and 5% base change rates, respectively), and genome rearrangements (98.2% accuracy), with robust performance on ad hoc false positive sets. On data from the worldwide MetaSUB consortium, comprising 3,700+ metagenomics experiments, KARGVA identifies more ARGVs than Resistance Gene Identifier (4.8x) and PointFinder (6.8x), yet all predictions are below the expected false positive estimates. The prevalence of ARGVs is correlated to ARGs but ecological characteristics do not explain well ARGV variance. KARGVA is publicly available at https://github.com/DataIntellSystLab/KARGVA under MIT license.",
                "authors": [
                    {
                        "name": "Boucher C."
                    },
                    {
                        "name": "Marini S."
                    },
                    {
                        "name": "Noyes N."
                    },
                    {
                        "name": "Prosperi M."
                    }
                ],
                "date": "2023-01-01T00:00:00Z",
                "journal": "Frontiers in Microbiology",
                "title": "The K-mer antibiotic resistance gene variant analyzer (KARGVA)"
            },
            "pmcid": "PMC10027697",
            "pmid": "36960290"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
