{"credit":[],"function":[{"operation":[{"term":"Phasing","uri":"http://edamontology.org/operation_3454"},{"term":"Expression analysis","uri":"http://edamontology.org/operation_2495"},{"term":"Pathway or network visualisation","uri":"http://edamontology.org/operation_3083"}]}],"labels":{"topic":[{"term":"Microarray experiment","uri":"http://edamontology.org/topic_3518"},{"term":"Proteomics","uri":"http://edamontology.org/topic_0121"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"},{"term":"Protein expression","uri":"http://edamontology.org/topic_0108"},{"term":"Preclinical and clinical studies","uri":"http://edamontology.org/topic_3379"}]},"publication":[{"abstract":"© Springer Nature Singapore Pte Ltd 2019.An integrated reverse phase protein array (RPPA) platform shall allow the precise monitoring of expression level and changes of proteins and their functional states in a highly parallel manner even when samples exhibit a complex matrix like in tumor tissues and are available only in very limited amounts. Ideally the full workflow from sample preparation to data visualization shall be covered. This book chapter describes the key elements of the integrated Zeptosens RPPA platform. It addresses critical platform and process design requirements, considerations, and elements as well as critical process steps and quality aspects. Sophisticated instrumentation, high sensitivity readout, and dedicated chip and assay handling equipment act in concert with streamlined protocols, optimal reagents, and dedicated lab equipment in the hands of trained users to achieve an outstanding overall performance of the realized system. Based on results from comprehensive signaling protein and pathway profiling studies targeted for preclinical drug efficacy testing and development, it gives an overview of application performance by means of coefficients of variation (CVs) that can be achieved for assay signals from technical and biological sample replicates with this state-of-the-art integrated RPPA platform and process. The Zeptosens RPPA platform has proven to provide valuable biological information with a high level of confidence and has shown its validity in generating sound mechanistic as well as prognostic and predictive information when analyzing cell and tissue materials on the functional protein level.","authors":["Kresbach G.M.","Pawlak M."],"cit_count":0,"doi":"10.1007/978-981-32-9755-5_3","journal":"Advances in Experimental Medicine and Biology","pmid":"31820382","title":"High Precision RPPA: Concept, Features, and Application Performance of the Integrated Zeptosens Platform","year":"2019-01-01"}],"summary":{"biotoolsCURIE":"biotools:High_Precision_RPPA","biotoolsID":"High_Precision_RPPA","description":"Concept, Features, and Application Performance of the Integrated Zeptosens Platform.\n\nRPPA Reverse Phase Protein Array Services.\n\nOur Reverse Phase Protein Array (RPPA) core facility offers multiplex cell signaling pathway mapping studies on a fee-for-service basis.\n\nHigh-Throughput Protein Profiling.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'RPPA'","homepage":"https://www.nmi-tt.de/pharmaservices/rppa/","name":"High Precision RPPA"}}