{
    "additionDate": "2019-11-14T18:12:01Z",
    "biotoolsCURIE": "biotools:IA-Lab",
    "biotoolsID": "IA-Lab",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "adam.corrigan@astrazeneca.com",
            "name": "Adam M. Corrigan",
            "orcidid": "https://orcid.org/0000-0001-5142-6579",
            "typeEntity": "Person"
        }
    ],
    "description": "A MATLAB framework for efficient microscopy image analysis development, applied to quantifying intracellular transport of internalized peptide-drug conjugate | IA-Lab: a MATLAB-based framework for high throughput custom image analysis | This is the central repo for the IALab software, including parsers of various microscopy experiments, into multidimensional and multichannel images, and core code for segmentation, measurement, export of results and display of images and results . Some example workflows are stored in the Examples directory",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "homepage": "https://github.com/amcorrigan/ia-lab",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2019-11-14T18:12:01Z",
    "license": "LGPL-3.0",
    "name": "IA-Lab",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0220627",
            "metadata": {
                "abstract": "© 2019 Corrigan et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.This work presents a MATLAB-based software package for high-throughput microscopy image analysis development, making such development more accessible for a large user community. The toolbox provides a GUI and a number of analysis workflows, and can serve as a general framework designed to allow for easy extension. For a new application, only a minor part of the object-oriented code needs to be replaced by new components, making development efficient. This makes it possible to quickly develop solutions for analysis not available in existing tools. We show its use in making a tool for quantifying intracellular transport of internalized peptide-drug conjugates. The code is freely available as open source on GitHub (https://github.com/amcorrigan/ia-lab)",
                "authors": [
                    {
                        "name": "Corrigan A.M."
                    },
                    {
                        "name": "Karlsson J."
                    },
                    {
                        "name": "Wildenhain J."
                    },
                    {
                        "name": "Knerr L."
                    },
                    {
                        "name": "Olwegard-Halvarsson M."
                    },
                    {
                        "name": "Karlsson M."
                    },
                    {
                        "name": "Lunse S."
                    },
                    {
                        "name": "Wang Y."
                    }
                ],
                "date": "2019-08-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "IA-LAb: A MATLAB framework for efficient microscopy image analysis development, applied to quantifying intracellular transport of internalized peptide-drug conjugate"
            },
            "pmcid": "PMC6675096",
            "pmid": "31369634"
        }
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Biotherapeutics",
            "uri": "http://edamontology.org/topic_3374"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}