{
    "accessibility": [
        "Open access"
    ],
    "additionDate": "2019-05-15T07:13:08Z",
    "biotoolsCURIE": "biotools:LBEEP",
    "biotoolsID": "LBEEP",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "brsaran@gmail.com",
            "name": "Saravanan Vijayakumar",
            "orcidid": "https://orcid.org/0000-0001-5145-0384",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        }
    ],
    "description": "LBEEP (Linear B-Cell Exact Epitope Predictor) is a perl based open source tool for the prediction of Linear B-cell epitopes. Please refer the article tilted \"Harnessing Computational Biology for Exact Linear B-Cell Epitope Prediction: A Novel Amino Acid Composition-based Feature Descriptor\" for more deatils.",
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/brsaran/LBEEP"
        }
    ],
    "download": [
        {
            "type": "Binaries",
            "url": "https://github.com/brsaran/LBEEP/archive/master.zip"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "cmd": "./LBEEP -i test_input_peptides -m pep -M B -o Test_peptide",
            "input": [
                {
                    "data": {
                        "term": "Protein sequence",
                        "uri": "http://edamontology.org/data_2976"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "note": "Can be run for both protein and peptides",
            "operation": [
                {
                    "term": "Peptide immunogenicity prediction",
                    "uri": "http://edamontology.org/operation_0252"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Sequence",
                        "uri": "http://edamontology.org/data_2044"
                    },
                    "format": [
                        {
                            "term": "FASTA-HTML",
                            "uri": "http://edamontology.org/format_2310"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "https://github.com/brsaran/LBEEP",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2019-05-15T07:13:08Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "LBEEP",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "brsaran",
    "publication": [
        {
            "doi": "10.1089/omi.2015.0095",
            "metadata": {
                "abstract": "© Mary Ann Liebert, Inc. 2015.Proteins embody epitopes that serve as their antigenic determinants. Epitopes occupy a central place in integrative biology, not to mention as targets for novel vaccine, pharmaceutical, and systems diagnostics development. The presence of T-cell and B-cell epitopes has been extensively studied due to their potential in synthetic vaccine design. However, reliable prediction of linear B-cell epitope remains a formidable challenge. Earlier studies have reported discrepancy in amino acid composition between the epitopes and non-epitopes. Hence, this study proposed and developed a novel amino acid composition-based feature descriptor, Dipeptide Deviation from Expected Mean (DDE), to distinguish the linear B-cell epitopes from non-epitopes effectively. In this study, for the first time, only exact linear B-cell epitopes and non-epitopes have been utilized for developing the prediction method, unlike the use of epitope-containing regions in earlier reports. To evaluate the performance of the DDE feature vector, models have been developed with two widely used machine-learning techniques Support Vector Machine and AdaBoost-Random Forest. Five-fold cross-validation performance of the proposed method with error-free dataset and dataset from other studies achieved an overall accuracy between nearly 61% and 73%, with balance between sensitivity and specificity metrics. Performance of the DDE feature vector was better (with accuracy difference of about 2% to 12%), in comparison to other amino acid-derived features on different datasets. This study reflects the efficiency of the DDE feature vector in enhancing the linear B-cell epitope prediction performance, compared to other feature representations. The proposed method is made as a stand-alone tool available freely for researchers, particularly for those interested in vaccine design and novel molecular target development for systems therapeutics and diagnostics: https://github.com/brsaran/LBEEP",
                "authors": [
                    {
                        "name": "Saravanan V."
                    },
                    {
                        "name": "Gautham N."
                    }
                ],
                "citationCount": 6,
                "date": "2015-01-01T00:00:00Z",
                "journal": "OMICS A Journal of Integrative Biology",
                "title": "Harnessing computational biology for exact linear B-cell epitope prediction: A novel amino acid composition-based feature descriptor"
            },
            "pmid": "26406767",
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        }
    ]
}