{
    "additionDate": "2021-01-20T10:55:02Z",
    "biotoolsCURIE": "biotools:rvs-r",
    "biotoolsID": "rvs-r",
    "collectionID": [
        "Rare Disease"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "alexandre.bureau@fmed.ulaval.ca",
            "name": "Alexandre Bureau",
            "typeEntity": "Person"
        }
    ],
    "description": "Inferring disease risk genes from sequencing data in multiplex pedigrees through sharing of rare variants.\n\nComputes estimates of the probability of related individuals sharing a rare variant.\n\nRare Variant Sharing (RVS) implements tests of association and linkage between rare genetic variant genotypes and a dichotomous phenotype, e.g. a disease status, in family samples. The tests are based on probabilities of rare variant sharing by relatives under the null hypothesis of absence of linkage and association between the rare variants and the phenotype and apply to single variants or multiple variants in a region (e.g. gene-based test).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Collapsing methods",
                    "uri": "http://edamontology.org/operation_3791"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/RVS.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-05-19T06:50:14Z",
    "license": "GPL-2.0",
    "name": "RVs-r",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1002/GEPI.22155",
            "metadata": {
                "abstract": "© 2018 Wiley Periodicals, Inc.We previously demonstrated how sharing of rare variants (RVs) in distant affected relatives can be used to identify variants causing a complex and heterogeneous disease. This approach tested whether single RVs were shared by all sequenced affected family members. However, as with other study designs, joint analysis of several RVs (e.g., within genes) is sometimes required to obtain sufficient statistical power. Further, phenocopies can lead to false negatives for some causal RVs if complete sharing among affected is required. Here, we extend our methodology (Rare Variant Sharing, RVS) to address these issues. Specifically, we introduce gene-based analyses, a partial sharing test based on RV sharing probabilities for subsets of affected relatives and a haplotype-based RV definition. RVS also has the desirable feature of not requiring external estimates of variant frequency or control samples, provides functionality to assess and address violations of key assumptions, and is available as open source software for genome-wide analysis. Simulations including phenocopies, based on the families of an oral cleft study, revealed the partial and complete sharing versions of RVS achieved similar statistical power compared with alternative methods (RareIBD and the Gene-Based Segregation Test), and had superior power compared with the pedigree Variant Annotation, Analysis, and Search Tool (pVAAST) linkage statistic. In studies of multiplex cleft families, analysis of rare single nucleotide variants in the exome of 151 affected relatives from 54 families revealed no significant excess sharing in any one gene, but highlighted different patterns of sharing revealed by the complete and partial sharing tests.",
                "authors": [
                    {
                        "name": "Albacha-Hejazi H."
                    },
                    {
                        "name": "Bailey-Wilson J.E."
                    },
                    {
                        "name": "Beaty T.H."
                    },
                    {
                        "name": "Begum F."
                    },
                    {
                        "name": "Bureau A."
                    },
                    {
                        "name": "Hetmanski J.B."
                    },
                    {
                        "name": "Marazita M.L."
                    },
                    {
                        "name": "Murray J.C."
                    },
                    {
                        "name": "Parker M.M."
                    },
                    {
                        "name": "Ruczinski I."
                    },
                    {
                        "name": "Scott A.F."
                    },
                    {
                        "name": "Taub M.A."
                    }
                ],
                "citationCount": 2,
                "date": "2019-02-01T00:00:00Z",
                "journal": "Genetic Epidemiology",
                "title": "Inferring disease risk genes from sequencing data in multiplex pedigrees through sharing of rare variants"
            },
            "pmcid": "PMC6330140",
            "pmid": "30246882"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        }
    ]
}
