{
    "additionDate": "2018-04-29T11:27:42Z",
    "biotoolsCURIE": "biotools:gen3va",
    "biotoolsID": "gen3va",
    "credit": [
        {
            "email": "avi.maayan@mssm.edu",
            "name": "Avi Ma’ayan",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "gregory.gundersen@mssm.edu",
            "name": "Gregory Gundersen",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Aggregation and analysis of gene expression signatures from related studies.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://amp.pharm.mssm.edu/gen3va/documentation"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression comparison",
                    "uri": "http://edamontology.org/operation_0315"
                },
                {
                    "term": "Sequence database search",
                    "uri": "http://edamontology.org/operation_0338"
                }
            ]
        }
    ],
    "homepage": "http://amp.pharm.mssm.edu/gen3va/",
    "language": [
        "Java",
        "SQL",
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "license": "GPL-3.0",
    "name": "GEN3VA",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/S12859-016-1321-1",
            "metadata": {
                "abstract": "© 2016 The Author(s).Background: Genome-wide gene expression profiling of mammalian cells is becoming a staple of many published biomedical and biological research studies. Such data is deposited into data repositories such as the Gene Expression Omnibus (GEO) for potential reuse. However, these repositories currently do not provide simple interfaces to systematically analyze collections of related studies. Results: Here we present GENE Expression and Enrichment Vector Analyzer (GEN3VA), a web-based system that enables the integrative analysis of aggregated collections of tagged gene expression signatures identified and extracted from GEO. Each tagged collection of signatures is presented in a report that consists of heatmaps of the differentially expressed genes; principal component analysis of all signatures; enrichment analysis with several gene set libraries across all signatures, which we term enrichment vector analysis; and global mapping of small molecules that are predicted to reverse or mimic each signature in the aggregate. We demonstrate how GEN3VA can be used to identify common molecular mechanisms of aging by analyzing tagged signatures from 244 studies that compared young vs. old tissues in mammalian systems. In a second case study, we collected 86 signatures from treatment of human cells with dexamethasone, a glucocorticoid receptor (GR) agonist. Our analysis confirms consensus GR target genes and predicts potential drug mimickers. Conclusions: GEN3VA can be used to identify, aggregate, and analyze themed collections of gene expression signatures from diverse but related studies. Such integrative analyses can be used to address concerns about data reproducibility, confirm results across labs, and discover new collective knowledge by data reuse. GEN3VA is an open-source web-based system that is freely available at: http://amp.pharm.mssm.edu/gen3va.",
                "authors": [
                    {
                        "name": "Gundersen G.W."
                    },
                    {
                        "name": "Jagodnik K.M."
                    },
                    {
                        "name": "Woodland H."
                    },
                    {
                        "name": "Fernandez N.F."
                    },
                    {
                        "name": "Sani K."
                    },
                    {
                        "name": "Dohlman A.B."
                    },
                    {
                        "name": "Ung P.M.-U."
                    },
                    {
                        "name": "Monteiro C.D."
                    },
                    {
                        "name": "Schlessinger A."
                    },
                    {
                        "name": "Ma'ayan A."
                    }
                ],
                "citationCount": 10,
                "date": "2016-11-15T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "GEN3VA: Aggregation and analysis of gene expression signatures from related studies"
            },
            "pmcid": "PMC5111283",
            "pmid": "27846806"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ],
    "validated": 1
}