{
    "additionDate": "2017-02-10T11:34:36Z",
    "biotoolsCURIE": "biotools:arrayxpath",
    "biotoolsID": "arrayxpath",
    "credit": [
        {
            "email": "juhan@snu.ac.kr",
            "name": "Ju Han Kim",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Web-based service for matching microarray gene-expression profiles with known biological pathways. Input is a clustered gene-expression profile in a tab-delimited text format. Output includes pathway diagrams.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.snubi.org/software/ArrayXPath/#use"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                },
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                }
            ]
        }
    ],
    "homepage": "http://www.snubi.org/software/ArrayXPath/",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2018-12-10T12:58:55Z",
    "name": "ArrayXPath",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Summary: ArrayXPath (http://www.snubi.org/software/ArrayXPath/) is a web-based service for mapping and visualizing microarray gene-expression data with integrated biological pathway resources using Scalable Vector Graphics (SVG). Deciphering the crosstalk among pathways and integrating biomedical ontologies and knowledge bases may help biological interpretation of microarray data. ArrayXPath is empowered by integrating gene-pathway, disease-pathway, drug-pathway and pathway-pathway correlations with integrated Gene Ontology, Medical Subject Headings and OMIM Morbid Map-based annotations. We applied Fisher's exact test and relative risk to evaluate the statistical significance of the correlations. ArrayXPath produces Javascript-enabled SVGs for web-enabled interactive visualization of gene-expression profiles integrated with gene-pathway-disease interactions enriched by biomedical ontologies. © 2005 Oxford University Press.",
                "authors": [
                    {
                        "name": "Chung H.-J."
                    },
                    {
                        "name": "Park C.H."
                    },
                    {
                        "name": "Han M.R."
                    },
                    {
                        "name": "Lee S."
                    },
                    {
                        "name": "Ohn J.H."
                    },
                    {
                        "name": "Kim J."
                    },
                    {
                        "name": "Kim J."
                    },
                    {
                        "name": "Kim J.H."
                    }
                ],
                "citationCount": 44,
                "date": "2005-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "ArrayXPath II: Mapping and visualizing microarray gene-expression data with biomedical ontologies and integrated biological pathway resources using Scalable Vector Graphics"
            },
            "pmid": "15980549"
        },
        {
            "metadata": {
                "abstract": "Biological pathways can provide key information on the organization of biological systems. ArrayXPath (http://www.snubi.org/software/ArrayXPath/) is a web-based service for mapping and visualizing microarray gene-expression data for integrated biological pathway resources using Scalable Vector Graphics (SVG). By integrating major bio-databases and searching pathway resources, ArrayXPath automatically maps different types of identifiers from microarray probes and pathway elements. When one inputs gene-expression clusters, ArrayXPath produces a list of the best matching pathways for each cluster. We applied Fisher's exact test and the false discovery rate (FDR) to evaluate the statistical significance of the association between a cluster and a pathway while correcting the multiple-comparison problem. ArrayXPath produces Javascript-enabled SVGs for web-enabled interactive visualization of pathways integrated with gene-expression profiles. © Oxford University Press 2004; all rights reserved.",
                "authors": [
                    {
                        "name": "Chung H.-J."
                    },
                    {
                        "name": "Kim M."
                    },
                    {
                        "name": "Park C.H."
                    },
                    {
                        "name": "Kim J."
                    },
                    {
                        "name": "Kim J.H."
                    }
                ],
                "citationCount": 57,
                "date": "2004-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "ArrayXPath: Mapping and visualizing microarray gene-expression data with integrated biological pathway resources using Scalable Vector Graphics"
            },
            "pmid": "15215430"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ],
    "validated": 1
}