{
    "name": "MC3", 
    "description": "Steady-state Model and Constraint Consistency Checker for biochemical networks.", 
    "homepage": "https://github.com/sohahassoun/mc3", 
    "biotoolsID": "mc3", 
    "biotoolsCURIE": "biotools:mc3", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3660", 
                    "term": "Metabolic network modelling"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_2259", 
            "term": "Systems biology"
        }, 
        {
            "uri": "http://edamontology.org/topic_3292", 
            "term": "Biochemistry"
        }, 
        {
            "uri": "http://edamontology.org/topic_0602", 
            "term": "Molecular interactions, pathways and networks"
        }
    ], 
    "operatingSystem": [
        "Linux"
    ], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "https://github.com/sohahassoun/mc3", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1186/1752-0509-7-129", 
            "pmid": null, 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "MC3: A steady-state model and constraint consistency checker for biochemical networks", 
                "abstract": "Background: Stoichiometric models provide a structural framework for analyzing steady-state cellular behavior. Models are developed either through augmentations of existing models or more recently through automatic reconstruction tools. There is currently no standardized practice or method for validating the properties of a model before placing it in the public domain. Considerable effort is often required to understand a model's inconsistencies before its reuse within new research efforts.Results: We present a review of common issues in stoichiometric models typically uncovered during pathway analysis and constraint-based optimization, and we detail succinct and efficient ways to find them. We present MC3, Model and Constraint Consistency Checker, a computational tool that can be used for two purposes: (a) identifying potential connectivity and topological issues for a given stoichiometric matrix, S, and (b) flagging issues that arise during constraint-based optimization. The MC3 tool includes three distinct checking components. The first examines the results of computing the basis for the null space for Sv = 0; the second uses connectivity analysis; and the third utilizes Flux Variability Analysis. MC3 takes as input a stoichiometric matrix and flux constraints, and generates a report summarizing issues.Conclusions: We report the results of applying MC3 to published models for several systems including Escherichia coli, an adipocyte cell, a Chinese Hamster Ovary cell, and Leishmania major. Several issues with no prior documentation are identified. MC3 provides a standalone MATLAB-based comprehensive tool for model validation, a task currently performed either ad hoc or implemented in part within other computational tools. © 2013 Yousofshahi et al.; licensee BioMed Central Ltd.", 
                "date": "2013-11-21T00:00:00Z", 
                "citationCount": 6, 
                "authors": [
                    {
                        "name": "Yousofshahi M."
                    }, 
                    {
                        "name": "Ullah E."
                    }, 
                    {
                        "name": "Stern R."
                    }, 
                    {
                        "name": "Hassoun S."
                    }
                ], 
                "journal": "BMC Systems Biology"
            }
        }
    ], 
    "credit": [
        {
            "name": "Soha Hassoun", 
            "email": "soha.hassoun@tufts.edu", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "d.gabrielaitis", 
    "additionDate": "2018-08-19T09:13:22Z", 
    "lastUpdate": "2018-12-10T12:59:01Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}