
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "SILAC",
                    "uri": "http://edamontology.org/operation_3638"
                },
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Weighted correlation network analysis",
                    "uri": "http://edamontology.org/operation_3766"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "topic": [
            {
                "term": "Proteomics",
                "uri": "http://edamontology.org/topic_0121"
            },
            {
                "term": "Cell biology",
                "uri": "http://edamontology.org/topic_2229"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Proteomics experiment",
                "uri": "http://edamontology.org/topic_3520"
            },
            {
                "term": "Machine learning",
                "uri": "http://edamontology.org/topic_3474"
            }
        ]
    },
    "link": [
        {
            "type": "REPOSITORY",
            "url": "https://github.com/Rappsilber-Laboratory/ProteomeHD"
        }
    ],
    "publication": [
        {
            "abstract": "© 2019, The Author(s), under exclusive licence to Springer Nature America, Inc.Assigning functions to the vast array of proteins present in eukaryotic cells remains challenging. To identify relationships between proteins, and thereby enable functional annotation of proteins, we determined changes in abundance of 10,323 human proteins in response to 294 biological perturbations using isotope-labeling mass spectrometry. We applied the machine learning algorithm treeClust to reveal functional associations between co-regulated human proteins from ProteomeHD, a compilation of our own data and datasets from the Proteomics Identifications database. This produced a co-regulation map of the human proteome. Co-regulation was able to capture relationships between proteins that do not physically interact or colocalize. For example, co-regulation of the peroxisomal membrane protein PEX11β with mitochondrial respiration factors led us to discover an organelle interface between peroxisomes and mitochondria in mammalian cells. We also predicted the functions of microproteins that are difficult to study with traditional methods. The co-regulation map can be explored at www.proteomeHD.net.",
            "authors": [
                "Kustatscher G.",
                "Grabowski P.",
                "Schrader T.A.",
                "Passmore J.B.",
                "Schrader M.",
                "Rappsilber J."
            ],
            "cit_count": 0,
            "doi": "10.1038/S41587-019-0298-5",
            "journal": "Nature Biotechnology",
            "pmid": "31690884",
            "title": "Co-regulation map of the human proteome enables identification of protein functions",
            "year": "2019-11-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:ProteomeHD",
        "biotoolsID": "ProteomeHD",
        "description": "Co-regulation map of the human proteome enables identification of protein functions.\n\nR scripts and data related to the manuscript \"Co-regulation map of the human proteome enables identification of protein functions\" by Kustatscher et al (https://www.nature.com/articles/s41587-019-0298-5).\n\nCoregulation_scores R: This script creates the co-regulation scores for protein pairs in ProteomeHD.\n\nTo reproduce the results of our paper download the files, set the R working directory to the download folder and execute the appropriate scripts.\n\nWe offer two separate tools for two different scenarios:.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'treeClust'",
        "homepage": "http://www.proteomeHD.net",
        "name": "ProteomeHD"
    }
}