{
    "name": "BCIgEPred", 
    "description": "BCIgePred (Linear B cell IgE Epitope Predictor) is a perl based open source tool for the prediction of Linear B-cell IgE epitopes.", 
    "homepage": "https://github.com/brsaran/BCIgePred", 
    "biotoolsID": "BCIgEPred", 
    "biotoolsCURIE": "biotools:BCIgEPred", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2423", 
                    "term": "Prediction and recognition"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": "./LIgE -i test_input_protein -m pro -M 'RF' -t 0.5 -BT 0.7 -o Test_protein"
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0091", 
            "term": "Bioinformatics"
        }
    ], 
    "operatingSystem": [
        "Linux"
    ], 
    "language": [
        "Perl"
    ], 
    "license": "GPL-3.0", 
    "collectionID": [], 
    "maturity": "Mature", 
    "cost": "Free of charge", 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [
        {
            "url": "https://github.com/brsaran/BCIgePred/archive/master.zip", 
            "type": "Source code", 
            "note": null, 
            "version": null
        }
    ], 
    "documentation": [], 
    "publication": [
        {
            "doi": "10.7868/S0026898418020180", 
            "pmid": "29695703", 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "BCIgEPRED-a Dual-Layer Approach for Predicting Linear IgE Epitopes", 
                "abstract": "Allergy is a common health problem worldwide, especially food allergy. Since B cell epitopes that are recognized by the IgE antibodies act as antigenic determinants for allergy, they play a vital role in diagnostics. Hence, knowledge of an IgE binding epitope in a protein is of particular interest for identifying aller-genic proteins. Though IgE epitopes maybe conformational or linear, identification of the later is useful especially in food allergens that undergo processing or digestion. Very few computational tools are available for the prediction of linear IgE epitopes. Here we report a prediction system that predicts the exact linear IgE epitope. Since our earlier study on linear B cell epitope prediction demonstrated the effectiveness of using an exact epitope dataset (in contrast to epitope containing region datasets), the dataset in this study uses only experimentally verified exact IgE, IgG, IgM and IgA epitopes. Models for Support Vector Machine (SVM) and Random Forest (RF) were constructed adopting Dipeptide Deviation from the Expected mean (DDE) feature vector. Extensive validation procedures including five-fold cross validation and two different independent dataset tests have been performed to validate the proposed method, which achieved a balanced accuracy ranging from 74 to 78% with area under receiver operator curve greater than 0.8. Performance of the proposed method was observed to be better (accuracy difference of 16-28%) in comparison to the existing available method. The proposed method is developed as a standalone tool that could be used for predicting IgE epitopes as well as to be incorporated into any allergen prediction toolhttps://github.com/brsaran/BCIgePred.", 
                "date": "2018-03-01T00:00:00Z", 
                "citationCount": 1, 
                "authors": [
                    {
                        "name": "Saravanan V."
                    }, 
                    {
                        "name": "Gautham N."
                    }
                ], 
                "journal": "Molekuliarnaia biologiia"
            }
        }
    ], 
    "credit": [
        {
            "name": "Saravanan", 
            "email": "brsaran@gmail.com", 
            "url": null, 
            "orcidid": "https://orcid.org/0000-0001-5145-0384", 
            "typeEntity": "Person", 
            "typeRole": [
                "Developer"
            ], 
            "note": null
        }
    ], 
    "owner": "brsaran", 
    "additionDate": "2019-05-15T10:12:25Z", 
    "lastUpdate": "2019-05-15T10:12:25Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 0, 
    "homepage_status": 0, 
    "elixir_badge": 0
}