{
    "additionDate": "2020-01-14T19:33:22Z",
    "biotoolsCURIE": "biotools:CCLA",
    "biotoolsID": "CCLA",
    "confidence_flag": "tool",
    "description": "an accurate method and web server for cancer cell line authentication using gene expression profiles.\n\nAbstract Cancer cell lines (CCLs) as important model systems play critical roles in cancer researches. The misidentification and contamination of CCLs are serious problems, leading to unreliable results and waste of resources. Current methods for CCL authentication are mainly based on the CCL-specific genetic polymorphisms, whereas no method is available for CCL authentication using gene expression profiles. Here, we developed a novel method and homonymic web server (CCLA, Cancer Cell Line Authentication, http: bioinfo.life.hust.edu.cn web CCLA ) to authenticate 1,291 human CCLs of 28 tissues using gene expression profiles. CCLA curated CCL-specific gene signatures and employed machine learning methods to measure overall similarities and distances between the query sample and each reference CCL",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.life.hust.edu.cn/web/CCLA/",
    "lastUpdate": "2020-12-10T14:31:15Z",
    "name": "Cancer Cell Line Authentication (CCLA)",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/858456"
        },
        {
            "doi": "10.1093/bib/bbaa093",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.Cancer cell lines (CCLs) as important model systems play critical roles in cancer research. The misidentification and contamination of CCLs are serious problems, leading to unreliable results and waste of resources. Current methods for CCL authentication are mainly based on the CCL-specific genetic polymorphism, whereas no method is available for CCL authentication using gene expression profiles. Here, we developed a novel method and homonymic web server (CCLA, Cancer Cell Line Authentication, http://bioinfo.life.hust.edu.cn/web/CCLA/) to authenticate 1291 human CCLs of 28 tissues using gene expression profiles. CCLA showed an excellent speed advantage and high accuracy for CCL authentication, a top 1 accuracy of 96.58 or 92.15% (top 3 accuracy of 100 or 95.11%) for microarray or RNA-Seq validation data (719 samples, 461 CCLs), respectively. To the best of our knowledge, CCLA is the first approach to authenticate CCLs using gene expression data. Users can freely and conveniently authenticate CCLs using gene expression profiles or NCBI GEO accession on CCLA website.",
                "authors": [
                    {
                        "name": "Guo A.-Y."
                    },
                    {
                        "name": "Liu C.-J."
                    },
                    {
                        "name": "Luo M."
                    },
                    {
                        "name": "Zhang Q."
                    }
                ],
                "date": "2021-05-20T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "CCLA: an accurate method and web server for cancer cell line authentication using gene expression profiles"
            },
            "pmid": "32510568"
        }
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
