{"credit":[{"email":"tom.michoel@roslin.ed.ac.uk","name":"Dr Tom Michoel","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.roslin.ed.ac.uk/tom-michoel"}],"documentation":[{"type":"GENERAL","url":"https://github.com/eb00/lemon-tree/wiki"},{"url":"https://github.com/eb00/lemon-tree/wiki/Tutorial"}],"function":[{"operation":[{"term":"Pathway or network analysis","uri":"http://edamontology.org/operation_2497"}]}],"labels":{"language":["Java"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Suite"],"topic":[{"term":"Systems biology","uri":"http://edamontology.org/topic_2259"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"},{"term":"Gene expression","uri":"http://edamontology.org/topic_0203"},{"term":"RNA","uri":"http://edamontology.org/topic_0099"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/lemone-2-5-1-learn-module-networks-gene-expression-data.html"}],"publication":[{"abstract":"© 2015 Bonnet et al.Module network inference is an established statistical method to reconstruct co-expression modules and their upstream regulatory programs from integrated multi-omics datasets measuring the activity levels of various cellular components across different individuals, experimental conditions or time points of a dynamic process. We have developed Lemon-Tree, an open-source, platform-independent, modular, extensible software package implementing state-of-the-art ensemble methods for module network inference. We benchmarked Lemon-Tree using large-scale tumor datasets and showed that Lemon-Tree algorithms compare favorably with state-of-the-art module network inference software. We also analyzed a large dataset of somatic copy-number alterations and gene expression levels measured in glioblastoma samples from The Cancer Genome Atlas and found that Lemon-Tree correctly identifies known glioblastoma oncogenes and tumor suppressors as master regulators in the inferred module network. Novel candidate driver genes predicted by Lemon-Tree were validated using tumor pathway and survival analyses. Lemon-Tree is available from http://lemon-tree.googlecode.com under the GNU General Public License version 2.0.","authors":["Bonnet E.","Calzone L.","Michoel T."],"cit_count":20,"journal":"PLoS Computational Biology","pmid":"25679508","title":"Integrative Multi-omics Module Network Inference with Lemon-Tree","year":"2015-01-01"}],"summary":{"biotoolsCURIE":"biotools:lemon-tree","biotoolsID":"lemon-tree","description":"Algorithm to infer a module network from biological data. It can integrate heterogeneous data types such as expression data, copy number, microRNA, epigenetic profiles.","homepage":"https://github.com/eb00/lemon-tree","name":"lemon-tree"}}