{
    "additionDate": "2019-11-14T18:44:51Z",
    "biotoolsCURIE": "biotools:vimeo",
    "biotoolsID": "vimeo",
    "confidence_flag": "very low",
    "credit": [
        {
            "email": "daniel.gilbert@fau.de",
            "name": "Daniel F. Gilbert",
            "typeEntity": "Person"
        }
    ],
    "description": "> VERY_LOW CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'bioprinting', 'Ultra-Low-Cost 3D Bioprinting', 'bioprinter' | Modification and Application of an Off-the-Shelf Desktop 3D-Printer for Biofabrication | This is \"low-cost bioprinter\" by Daniel Gilbert on Vimeo, the home for high quality videos and the people who love them | This is \"syringe carrier\" by Daniel Gilbert on Vimeo, the home for high quality videos and the people who love them | This is \"Line Video\" by Daniel Gilbert on Vimeo, the home for high quality videos and the people who love them | This is \"FAU Video\" by Daniel Gilbert on Vimeo, the home for high quality videos and the people who love them | Vimeo and its partners use cookies to personalize your experience, serve relevant ads, and understand how people are using our services. To learn more or change your preferences, visit our Cookie Policy",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "homepage": "https://vimeo.com/274482794",
    "lastUpdate": "2019-11-14T18:44:51Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://vimeo.com/274482812"
        },
        {
            "type": [
                "Other"
            ],
            "url": "https://vimeo.com/275028609"
        },
        {
            "type": [
                "Other"
            ],
            "url": "https://vimeo.com/275028500"
        }
    ],
    "name": "vimeo",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FBIOE.2019.00184",
            "metadata": {
                "abstract": "© 2019 Kahl, Gertig, Hoyer, Friedrich and Gilbert.3D bioprinting has become a versatile and powerful method in tissue engineering and regenerative medicine and is increasingly adapted by other disciplines due to its tremendous potential beyond its typical applications. However, commercially available 3D bioprinting systems are typically expensive circumventing the broad implementation, including laboratories in low-resource settings. To address the limitations of conventional and commercially available technology, we developed a 3D bioprinter by modification of an off-the-shelf 3D desktop printer, that can be installed within a single day, is of handy size to fit into a standard laminar flow hood, customizable, ultra-low cost and thus, affordable to a broad range of research labs, or educational institutions. We evaluate accuracy and reproducibility of printing results using alginate and alginate/gelatin-hydrogels and demonstrate its potential for biomedical use by printing of various two-and three-dimensional cell-free and mammalian cell-laden objects using recombinant HEKYFP cells, stably expressing yellow fluorescent protein (YFP) as a model system and high-content imaging. We further provide a parts list and 3D design files in STL and STEP format for reconstructing the device. A time-lapse video of the custom-built device during operation is available at https://vimeo.com/274482794.",
                "authors": [
                    {
                        "name": "Kahl M."
                    },
                    {
                        "name": "Gertig M."
                    },
                    {
                        "name": "Hoyer P."
                    },
                    {
                        "name": "Friedrich O."
                    },
                    {
                        "name": "Gilbert D.F."
                    }
                ],
                "citationCount": 5,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Frontiers in Bioengineering and Biotechnology",
                "title": "Ultra-low-cost 3D bioprinting: Modification and application of an off-the-shelf desktop 3D-printer for biofabrication"
            },
            "pmcid": "PMC6684753",
            "pmid": "31417899"
        }
    ],
    "topic": [
        {
            "term": "Regenerative medicine",
            "uri": "http://edamontology.org/topic_3395"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        }
    ]
}