{
    "additionDate": "2021-01-18T11:44:24Z",
    "biotoolsCURIE": "biotools:grndb",
    "biotoolsID": "grndb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "tanfeitrue@126.com",
            "name": "Fei Tan",
            "typeEntity": "Person"
        },
        {
            "email": "gchen@bio.ecnu.edu.cn",
            "name": "Geng Chen",
            "typeEntity": "Person"
        }
    ],
    "description": "Decoding the gene regulatory networks in diverse human and mouse conditions.\n\nGene Regulatory Network database.\n\nGene regulatory networks are crucial for understanding the mechanism of gene expression regulation and expression heterogeneity. GRNdb is a freely accessible and user-friendly database for conveniently exploring and visualizing the predicted regulatory networks formed by transcription factors (TFs) and downstream target genes (termed regulons) based on large-scale RNA-seq data as well as the known TF-target relationships for various human and mouse conditions.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene regulatory network prediction",
                    "uri": "http://edamontology.org/operation_2437"
                },
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                },
                {
                    "term": "Expression profile comparison",
                    "uri": "http://edamontology.org/operation_0315"
                }
            ]
        }
    ],
    "homepage": "http://www.grndb.com/",
    "lastUpdate": "2021-01-25T11:00:43Z",
    "name": "GRNdb",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA995",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.Gene regulatory networks (GRNs) formed by transcription factors (TFs) and their downstream target genes play essential roles in gene expression regulation. Moreover, GRNs can be dynamic changing across different conditions, which are crucial for understanding the underlying mechanisms of disease pathogenesis. However, no existing database provides comprehensive GRN information for various human and mouse normal tissues and diseases at the single-cell level. Based on the known TF-target relationships and the large-scale single-cell RNA-seq data collected from public databases as well as the bulk data of The Cancer Genome Atlas and the Genotype-Tissue Expression project, we systematically predicted the GRNs of 184 different physiological and pathological conditions of human and mouse involving >633 000 cells and >27 700 bulk samples. We further developed GRNdb, a freely accessible and user-friendly database (http://www.grndb.com/) for searching, comparing, browsing, visualizing, and downloading the predicted information of 77 746 GRNs, 19 687 841 TF-target pairs, and related binding motifs at single-cell/bulk resolution. GRNdb also allows users to explore the gene expression profile, correlations, and the associations between expression levels and the patient survival of diverse cancers. Overall, GRNdb provides a valuable and timely resource to the scientific community to elucidate the functions and mechanisms of gene expression regulation in various conditions.",
                "authors": [
                    {
                        "name": "Fang L."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Ma L."
                    },
                    {
                        "name": "Xu Q."
                    },
                    {
                        "name": "Tan F."
                    },
                    {
                        "name": "Chen G."
                    }
                ],
                "citationCount": 3,
                "date": "2021-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "GRNdb: Decoding the gene regulatory networks in diverse human and mouse conditions"
            },
            "pmid": "33151298"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}