{
    "additionDate": "2015-01-22T11:40:39Z",
    "biotoolsCURIE": "biotools:sel.ts.area",
    "biotoolsID": "sel.ts.area",
    "credit": [
        {
            "email": "barbara.dicamillo@unipd.it",
            "name": "Barbara Di Camillo",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.dei.unipd.it/~dicamill/"
        },
        {
            "name": "ELIXIR-ITA-PADOVA",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        }
    ],
    "description": "An R script to select differentially expressed genes from time series expression data in data poor conditions, i.e. when few replicates are available.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://sysbiobig.dei.unipd.it/?q=wf_SelTsArea"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "note": "The function takes as input the data matrix (time series experiments) and the available replicates of the experiment and selects differentially expressed genesbased on the area of the region bounded by the time series expression profiles to be compared. SEL.TS.AREA considers the gene differentially expressed if the area exceeds a threshold based on a model of the experimental error.",
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                }
            ]
        }
    ],
    "homepage": "http://sysbiobig.dei.unipd.it/?q=wf_SelTsArea",
    "lastUpdate": "2018-12-24T21:43:51Z",
    "name": "SEL.TS.AREA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-ITA-PADOVA",
    "publication": [
        {
            "doi": "10.1186/1471-2105-8-S1-S10",
            "metadata": {
                "abstract": "Background: Microarray time series studies are essential to understand the dynamics of molecular events. In order to limit the analysis to those genes that change expression over time, a first necessary step is to select differentially expressed transcripts. A variety of methods have been proposed to this purpose; however, these methods are seldom applicable in practice since they require a large number of replicates, often available only for a limited number of samples. In this data-poor context, we evaluate the performance of three selection methods, using synthetic data, over a range of experimental conditions. Application to real data is also discussed. Results: Three methods are considered, to assess differentially expressed genes in data-poor conditions. Method 1 uses a threshold on individual samples based on a model of the experimental error. Method 2 calculates the area of the region bounded by the time series expression profiles, and considers the gene differentially expressed if the area exceeds a threshold based on a model of the experimental error. These two methods are compared to Method 3, recently proposed in the literature, which exploits splines fit to compare time series profiles. Application of the three methods to synthetic data indicates that Method 2 outperforms the other two both in Precision and Recall when short time series are analyzed, while Method 3 outperforms the other two for long time series. Conclusion: These results help to address the choice of the algorithm to be used in data-poor time series expression study, depending on the length of the time series. © 2007 Di Camillo et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Cobelli C."
                    },
                    {
                        "name": "Di Camillo B."
                    },
                    {
                        "name": "Greenlund L.J."
                    },
                    {
                        "name": "Nair S.K."
                    },
                    {
                        "name": "Toffolo G."
                    }
                ],
                "citationCount": 25,
                "date": "2007-03-08T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Significance analysis of microarray transcript levels in time series experiments"
            },
            "pmcid": "PMC1885839",
            "pmid": "17430554",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1,
    "version": [
        "1.2"
    ]
}
