{
    "additionDate": "2020-01-09T18:25:34Z",
    "biotoolsCURIE": "biotools:gsad",
    "biotoolsID": "gsad",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "daniel.vitales@ibb.csic.es",
            "name": "Daniel Vitales",
            "typeEntity": "Person"
        },
        {
            "email": "soniagarcia@ibb.csic.es",
            "name": "Sònia Garcia",
            "orcidid": "https://orcid.org/0000-0002-3143-0527",
            "typeEntity": "Person"
        }
    ],
    "description": "Progress in the study of genome size evolution in Asteraceae.\nGenome Size in Asteraceae database.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic footprinting",
                    "uri": "http://edamontology.org/operation_0327"
                },
                {
                    "term": "Phylogenetic species tree construction",
                    "uri": "http://edamontology.org/operation_0544"
                },
                {
                    "term": "Phylogenetic tree reconstruction",
                    "uri": "http://edamontology.org/operation_3478"
                }
            ]
        }
    ],
    "homepage": "http://www.asteraceaegenomesize.com",
    "lastUpdate": "2020-12-09T13:24:03Z",
    "name": "GSAD",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAZ098",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.The Genome Size in Asteraceae Database (GSAD, http://www.asteraceaegenomesize.com) has been recently updated, with data from papers published or in press until July 2018. This constitutes the third release of GSAD, currently containing 4350 data entries for 1496 species, which represent a growth of 22.52% in the number of species with available genome size data compared with the previous release, and a growth of 57.72% in terms of entries. Approximately 6% of Asteraceae species are covered in terms of known genome sizes. The number of source papers included in this release (198) means a 48.87% increase with respect to release 2.0. The significant data increase was exploited to study the genome size evolution in the family from a phylogenetic perspective. Our results suggest that the role of chromosome number in genome size diversity within Asteraceae is basically associated to polyploidy, while dysploidy would only cause minor variation in the DNA amount along the family. Among diploid taxa, we found that the evolution of genome size shows a strong phylogenetic signal. However, this trait does not seem to evolve evenly across the phylogeny, but there could be significant scale and clade-dependent patterns. Our analyses indicate that the phylogenetic signal is stronger at low taxonomic levels, with certain tribes standing out as hotspots of autocorrelation between genome size and phylogeny. Finally, we also observe meaningful associations among nuclear DNA content on Asteraceae species and other phenotypical and ecological traits (i.e. plant habit and invasion ability). Overall, this study emphasizes the need to continue generating and analysing genome size data in order to puzzle out the evolution of this parameter and its many biological correlates.",
                "authors": [
                    {
                        "name": "Vitales D."
                    },
                    {
                        "name": "Fernandez P."
                    },
                    {
                        "name": "Garnatje T."
                    },
                    {
                        "name": "Garcia S."
                    }
                ],
                "citationCount": 2,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Database",
                "title": "Progress in the study of genome size evolution in Asteraceae: Analysis of the last update"
            },
            "pmcid": "PMC6790504",
            "pmid": "31608375"
        }
    ],
    "topic": [
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        }
    ],
    "validated": 1
}