{"credit":[{"email":"marioabdelmessih@gmail.com","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://circe.med.uniroma1.it/looping/contact.php"},{"email":"albalepore@gmail.com","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://circe.med.uniroma1.it/looping/contact.php"}],"documentation":[{"type":"GENERAL","url":"http://circe.med.uniroma1.it/looping/about.php"},{"url":"http://circe.med.uniroma1.it/looping/help.php"}],"function":[{"operation":[{"term":"Protein structure analysis","uri":"http://edamontology.org/operation_2406"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Protein structure analysis","uri":"http://edamontology.org/topic_2814"},{"term":"Protein folds and structural domains","uri":"http://edamontology.org/topic_0736"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/looping-predicting-the-structure-of-protein-loops.html"}],"publication":[{"abstract":"© The Author 2015. Published by Oxford University Press. All rights reserved. Motivation: Predicting the structure of protein loops is very challenging, mainly because they are not necessarily subject to strong evolutionary pressure. This implies that, unlike the rest of the protein, standard homology modeling techniques are not very effective in modeling their structure. However, loops are often involved in protein function, hence inferring their structure is important for predicting protein structure as well as function. Results: We describe a method, LoopIng, based on the Random Forest automated learning technique, which, given a target loop, selects a structural template for it from a database of loop candidates. Compared to the most recently available methods, LoopIng is able to achieve similar accuracy for short loops (4-10 residues) and significant enhancements for long loops (11-20 residues). The quality of the predictions is robust to errors that unavoidably affect the stem regions when these are modeled. The method returns a confidence score for the predicted template loops and has the advantage of being very fast (on average: 1 min/loop).","authors":["Messih M.A.","Lepore R.","Tramontano A."],"cit_count":10,"journal":"Bioinformatics","pmid":"26249814","title":"LoopIng: A template-based tool for predicting the structure of protein loops","year":"2015-06-18"}],"summary":{"biotoolsCURIE":"biotools:looping","biotoolsID":"looping","description":"Method based on the Random Forest automatic learning technique, designed to select structural templates for protein loops among a dataset of candidates.","homepage":"http://circe.med.uniroma1.it/looping/","name":"LoopIng"}}