{
    "additionDate": "2020-01-14T09:37:53Z",
    "biotoolsCURIE": "biotools:scATAC-seq",
    "biotoolsID": "scATAC-seq",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "lpinello@mgh.harvard.edu",
            "name": "Luca Pinello",
            "orcidid": "https://orcid.org/0000-0003-1109-3823",
            "typeEntity": "Person"
        }
    ],
    "description": "Assessment of computational methods for the analysis of single-cell ATAC-seq data.\n\nATAC-seq Data Standards and Prototype Processing Pipeline – ENCODE.\n\nATAC-seq Data Standards and Prototype Processing Pipeline.\n\nThe Assay for Transposase-Accessible Chromatin followed by sequencing (ATAC-seq) experiment provides genome-wide profiles of chromatin accessibility. Briefly, the ATAC-seq method works as follows: loaded transposase inserts sequencing primers into open chromatin sites across the genome, and reads are then sequenced. The ends of the reads mark open chromatin sites.\n\nIn its current form, the ATAC-seq pipeline is a prototype and will likely undergo substantial change within the next year",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://www.encodeproject.org/atac-seq/",
    "lastUpdate": "2020-12-17T09:12:37Z",
    "name": "scATAC-seq",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S13059-019-1854-5",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Recent innovations in single-cell Assay for Transposase Accessible Chromatin using sequencing (scATAC-seq) enable profiling of the epigenetic landscape of thousands of individual cells. scATAC-seq data analysis presents unique methodological challenges. scATAC-seq experiments sample DNA, which, due to low copy numbers (diploid in humans), lead to inherent data sparsity (1-10% of peaks detected per cell) compared to transcriptomic (scRNA-seq) data (10-45% of expressed genes detected per cell). Such challenges in data generation emphasize the need for informative features to assess cell heterogeneity at the chromatin level. Results: We present a benchmarking framework that is applied to 10 computational methods for scATAC-seq on 13 synthetic and real datasets from different assays, profiling cell types from diverse tissues and organisms. Methods for processing and featurizing scATAC-seq data were compared by their ability to discriminate cell types when combined with common unsupervised clustering approaches. We rank evaluated methods and discuss computational challenges associated with scATAC-seq analysis including inherently sparse data, determination of features, peak calling, the effects of sequencing coverage and noise, and clustering performance. Running times and memory requirements are also discussed. Conclusions: This reference summary of scATAC-seq methods offers recommendations for best practices with consideration for both the non-expert user and the methods developer. Despite variation across methods and datasets, SnapATAC, Cusanovich2018, and cisTopic outperform other methods in separating cell populations of different coverages and noise levels in both synthetic and real datasets. Notably, SnapATAC is the only method able to analyze a large dataset (> 80,000 cells).",
                "authors": [
                    {
                        "name": "Andrade-Navarro M.A."
                    },
                    {
                        "name": "Andreani T."
                    },
                    {
                        "name": "Buenrostro J.D."
                    },
                    {
                        "name": "Chen H."
                    },
                    {
                        "name": "Clement K."
                    },
                    {
                        "name": "Garcia S.P."
                    },
                    {
                        "name": "Lareau C."
                    },
                    {
                        "name": "Pinello L."
                    },
                    {
                        "name": "Vinyard M.E."
                    }
                ],
                "citationCount": 42,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Genome Biology",
                "title": "Assessment of computational methods for the analysis of single-cell ATAC-seq data"
            },
            "pmcid": "PMC6859644",
            "pmid": "31739806"
        }
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
