{
    "additionDate": "2021-01-18T09:00:22Z",
    "biotoolsCURIE": "biotools:rscudo",
    "biotoolsID": "rscudo",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mario.lauria@unitn.it",
            "name": "Matteo Ciciani",
            "typeEntity": "Person"
        }
    ],
    "description": "an R package for classification of molecular profiles using rank-based signatures.\n\nSignature-based Clustering for Diagnostic Purposes.\n\nSCUDO (Signature-based Clustering for Diagnostic Purposes) is a rank-based method for the analysis of gene expression profiles for diagnostic and classification purposes.\n\nBiomedicalInformatics, Classification, Clustering, DifferentialExpression, FeatureExtraction, GeneExpression, GraphAndNetwork, Network, Proteomics, Software, SystemsBiology, Transcriptomics.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression profile clustering",
                    "uri": "http://edamontology.org/operation_0313"
                },
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "https://bioconductor.org/packages/rScudo",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-08T13:34:57Z",
    "license": "GPL-3.0",
    "name": "rScudo",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA296",
            "metadata": {
                "abstract": "© 2020 The Author(s). Published by Oxford University Press. All rights reserved.The classification of biological samples by means of their respective molecular profiles is a topic of great interest for its potential diagnostic, prognostic and investigational applications. rScudo is an R package for the classification of molecular profiles based on a radically new approach consisting in the analysis of the similarity of rank-based sample-specific signatures. The validity of rScudo unconventional approach has been validated through direct comparison with current methods in the international SBV IMPROVER Diagnostic Signature Challenge. Due to its novelty, there is ample room for conceptual improvements and for exploring additional applications. The rScudo package has been specifically designed to facilitate experimenting with the rank-based signature approach, to test its application to different types of molecular profiles and to simplify direct comparison with existing methods.",
                "authors": [
                    {
                        "name": "Cantore T."
                    },
                    {
                        "name": "Ciciani M."
                    },
                    {
                        "name": "Lauria M."
                    }
                ],
                "date": "2020-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "RScudo: An R package for classification of molecular profiles using rank-based signatures"
            },
            "pmid": "32399554"
        }
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ]
}
