{
    "additionDate": "2017-08-03T18:51:16Z",
    "biotoolsCURIE": "biotools:methk",
    "biotoolsID": "methk",
    "credit": [
        {
            "email": "francis@saturn.yzu.edu.tw",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://csb.cse.yzu.edu.tw/"
        }
    ],
    "description": "Web server for identifying methylated lysines on histones and non-histone proteins.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://csb.cse.yzu.edu.tw/MethK/introduction.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein post-translation modification site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                }
            ]
        }
    ],
    "homepage": "http://csb.cse.yzu.edu.tw/MethK/",
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/methk-identification-and-characterization-of-lysine-methylated-sites.html"
        }
    ],
    "name": "MethK",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Protein methylation is a kind of post-translational modification (PTM), and typically takes place on lysine and arginine amino acid residues. Protein methylation is involved in many important biological processes, and most recent studies focused on lysine methylation of histones due to its critical roles in regulating transcriptional repression and activation. Histones possess highly conserved sequences and are homologous in most species. However, there is much less sequence conservation among non-histone proteins. Therefore, mechanisms for identifying lysine-methylated sites may greatly differ between histones and non-histone proteins. Nevertheless, this point of view was not considered in previous studies. Here we constructed two support vector machine (SVM) models by using lysine-methylated data from histones and non-histone proteins for predictions of lysine-methylated sites. Numerous features, such as the amino acid composition (AAC) and accessible surface area (ASA), were used in the SVM models, and the predictive performance was evaluated using five-fold cross-validations. For histones, the predictive sensitivity was 85.62% and specificity was 80.32%. For non-histone proteins, the predictive sensitivity was 69.1% and specificity was 88.72%. Results showed that our model significantly improved the predictive accuracy of histones compared to previous approaches. In addition, features of the flanking region of lysine-methylated sites on histones and non-histone proteins were also characterized and are discussed. A gene ontology functional analysis of lysine-methylated proteins and correlations of lysine-methylated sites with other PTMs in histones were also analyzed in detail. Finally, a web server, MethyK, was constructed to identify lysine-methylated sites. © 2014 Elsevier Ltd.",
                "authors": [
                    {
                        "name": "Lee T.-Y."
                    },
                    {
                        "name": "Chang C.-W."
                    },
                    {
                        "name": "Lu C.-T."
                    },
                    {
                        "name": "Cheng T.-H."
                    },
                    {
                        "name": "Chang T.-H."
                    }
                ],
                "citationCount": 19,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Computational Biology and Chemistry",
                "title": "Identification and characterization of lysine-methylated sites on histones and non-histone proteins"
            },
            "pmid": "24560580"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        }
    ],
    "validated": 1
}