{
    "additionDate": "2015-01-22T11:40:38Z",
    "biotoolsCURIE": "biotools:funpat",
    "biotoolsID": "funpat",
    "credit": [
        {
            "name": "ELIXIR-ITA-PADOVA",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "tiziana.sanavia@dei.unipd.it",
            "name": "Tiziana Sanavia",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://sites.google.com/site/tizianasanavia/"
        }
    ],
    "description": "R package designed to provide: a useful tool to analyze time series genomic data; a computational pipeline which integrates gene selection, clustering and functional annotations into a single framework to identify the main temporal patterns associated to functional groups of differentially expressed genes; an easy way to exploit different types of annotations from currently available databases; a user-friendly organization and visualization of the outcome.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://sysbiobig.dei.unipd.it/?q=Software#FunPat"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "note": "FunPat is an R package for time series RNA sequencing data that integrates gene selection, clustering and functional annotation into a single framework. FunPat exploits functional annotations by performing for each functional term, e.g. a Gene Ontology term, an integrated selection-clustering analysis to select differentially expressed genes that share, besides annotation, a common dynamic expression profile.",
            "operation": [
                {
                    "term": "RNA-seq time series data analysis",
                    "uri": "http://edamontology.org/operation_3565"
                }
            ]
        }
    ],
    "homepage": "http://sysbiobig.dei.unipd.it/?q=Software#FunPat",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "name": "FunPat",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-ITA-PADOVA",
    "publication": [
        {
            "doi": "10.1186/1471-2164-16-S6-S2",
            "metadata": {
                "abstract": "© 2015 Sanavia et al.Background: Dynamic expression data, nowadays obtained using high-throughput RNA sequencing, are essential to monitor transient gene expression changes and to study the dynamics of their transcriptional activity in the cell or response to stimuli. Several methods for data selection, clustering and functional analysis are available; however, these steps are usually performed independently, without exploiting and integrating the information derived from each step of the analysis. Methods: Here we present FunPat, an R package for time series RNA sequencing data that integrates gene selection, clustering and functional annotation into a single framework. FunPat exploits functional annotations by performing for each functional term, e.g. a Gene Ontology term, an integrated selection-clustering analysis to select differentially expressed genes that share, besides annotation, a common dynamic expression profile. Results: FunPat performance was assessed on both simulated and real data. With respect to a stand-alone selection step, the integration of the clustering step is able to improve the recall without altering the false discovery rate. FunPat also shows high precision and recall in detecting the correct temporal expression patterns; in particular, the recall is significantly higher than hierarchical, k-means and a model-based clustering approach specifically designed for RNA sequencing data. Moreover, when biological replicates are missing, FunPat is able to provide reproducible lists of significant genes. The application to real time series expression data shows the ability of FunPat to select differentially expressed genes with high reproducibility, indirectly confirming high precision and recall in gene selection. Moreover, the expression patterns obtained as output allow an easy interpretation of the results. Conclusions: A novel analysis pipeline was developed to search the main temporal patterns in classes of genes similarly annotated, improving the sensitivity of gene selection by integrating the statistical evidence of differential expression with the information on temporal profiles and the functional annotations. Significant genes are associated to both the most informative functional terms, avoiding redundancy of information, and the most representative temporal patterns, thus improving the readability of the results. FunPat package is provided in R/Bioconductor at link: http://sysbiobig.dei.unipd.it/?q=node/79.",
                "authors": [
                    {
                        "name": "Sanavia T."
                    },
                    {
                        "name": "Finotello F."
                    },
                    {
                        "name": "Di Camillo B."
                    }
                ],
                "citationCount": 16,
                "date": "2015-06-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "FunPat: Function-based pattern analysis on RNA-seq time series data"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}