{
    "accessibility": "Open access",
    "additionDate": "2022-06-20T10:27:43.748500Z",
    "biotoolsCURIE": "biotools:mcx_cloud",
    "biotoolsID": "mcx_cloud",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "q.fang@neu.edu",
            "name": "Qianqian Fang",
            "orcidid": "https://orcid.org/0000-0003-0805-935X",
            "typeEntity": "Person"
        },
        {
            "name": "Shijie Yan"
        }
    ],
    "description": "Modern, scalable, high-performance and in-browser Monte Carlo simulation platform with cloud computing.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://mcx.space/cloud",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2022-06-20T10:27:43.751015Z",
    "license": "Not licensed",
    "name": "MCX Cloud",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1117/1.JBO.27.8.083008",
            "metadata": {
                "abstract": "SIGNIFICANCE: Despite the ample progress made toward faster and more accurate Monte Carlo (MC) simulation tools over the past decade, the limited usability and accessibility of these advanced modeling tools remain key barriers to widespread use among the broad user community. AIM: An open-source, high-performance, web-based MC simulator that builds upon modern cloud computing architectures is highly desirable to deliver state-of-the-art MC simulations and hardware acceleration to general users without the need for special hardware installation and optimization. APPROACH: We have developed a configuration-free, in-browser 3D MC simulation platform-Monte Carlo eXtreme (MCX) Cloud-built upon an array of robust and modern technologies, including a Docker Swarm-based cloud-computing backend and a web-based graphical user interface (GUI) that supports in-browser 3D visualization, asynchronous data communication, and automatic data validation via JavaScript Object Notation (JSON) schemas. RESULTS: The front-end of the MCX Cloud platform offers an intuitive simulation design, fast 3D data rendering, and convenient simulation sharing. The Docker Swarm container orchestration backend is highly scalable and can support high-demand GPU MC simulations using MCX over a dynamically expandable virtual cluster. CONCLUSION: MCX Cloud makes fast, scalable, and feature-rich MC simulations readily available to all biophotonics researchers without overhead. It is fully open-source and can be freely accessed at http://mcx.space/cloud.",
                "authors": [
                    {
                        "name": "Fang Q."
                    },
                    {
                        "name": "Yan S."
                    }
                ],
                "citationCount": 1,
                "date": "2022-01-01T00:00:00Z",
                "journal": "Journal of biomedical optics",
                "title": "MCX Cloud-a modern, scalable, high-performance and in-browser Monte Carlo simulation platform with cloud computing"
            },
            "pmcid": "PMC8728956",
            "pmid": "34989198"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Computer science",
            "uri": "http://edamontology.org/topic_3316"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        }
    ]
}
