{
    "additionDate": "2021-01-18T08:12:18Z",
    "biotoolsCURIE": "biotools:qifp",
    "biotoolsID": "qifp",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "snapel@stanford.edu",
            "name": "Sandy Napel",
            "typeEntity": "Person"
        }
    ],
    "description": "a web-based tool for utilizing, sharing, and building image-processing pipelines.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                }
            ]
        }
    ],
    "homepage": "https://qifp.stanford.edu/qifp/",
    "lastUpdate": "2021-01-31T12:16:49Z",
    "name": "QIFP",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1117/1.JMI.7.4.042803",
            "metadata": {
                "abstract": "© 2020 The Authors. Published by SPIE.Quantitative image features that can be computed from medical images are proving to be valuable biomarkers of underlying cancer biology that can be used for assessing treatment response and predicting clinical outcomes. However, validation and eventual clinical implementation of these tools is challenging due to the absence of shared software algorithms, architectures, and the tools required for computing, comparing, evaluating, and disseminating predictive models. Similarly, researchers need to have programming expertise in order to complete these tasks. The quantitative image feature pipeline (QIFP) is an open-source, web-based, graphical user interface (GUI) of configurable quantitative image-processing pipelines for both planar (two-dimensional) and volumetric (three-dimensional) medical images. This allows researchers and clinicians a GUI-driven approach to process and analyze images, without having to write any software code. The QIFP allows users to upload a repository of linked imaging, segmentation, and clinical data or access publicly available datasets (e.g., The Cancer Imaging Archive) through direct links. Researchers have access to a library of file conversion, segmentation, quantitative image feature extraction, and machine learning algorithms. An interface is also provided to allow users to upload their own algorithms in Docker containers. The QIFP gives researchers the tools and infrastructure for the assessment and development of new imaging biomarkers and the ability to use them for single and multicenter clinical and virtual clinical trials.",
                "authors": [
                    {
                        "name": "Mattonen S.A."
                    },
                    {
                        "name": "Gude D."
                    },
                    {
                        "name": "Echegaray S."
                    },
                    {
                        "name": "Bakr S."
                    },
                    {
                        "name": "Rubin D.L."
                    },
                    {
                        "name": "Napel S."
                    }
                ],
                "citationCount": 2,
                "date": "2020-07-01T00:00:00Z",
                "journal": "Journal of Medical Imaging",
                "title": "Quantitative imaging feature pipeline: A web-based tool for utilizing, sharing, and building image-processing pipelines"
            },
            "pmcid": "PMC7070161",
            "pmid": "32206688"
        }
    ],
    "topic": [
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        }
    ]
}