{
    "accessibility": "Open access",
    "additionDate": "2022-06-15T09:19:15.120122Z",
    "biotoolsCURIE": "biotools:nowinbrain",
    "biotoolsID": "nowinbrain",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "info@nowinbrain.org",
            "name": "Wieslaw L. Nowinski",
            "orcidid": "https://orcid.org/0000-0003-2869-0608",
            "typeEntity": "Person"
        }
    ],
    "description": "A Large, Systematic, and Extendable Repository of 3D Reconstructed Images of a Living Human Brain Cum Head and Neck.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Image annotation",
                    "uri": "http://edamontology.org/operation_3553"
                }
            ]
        }
    ],
    "homepage": "http://www.nowinbrain.org",
    "lastUpdate": "2022-06-15T09:19:15.123453Z",
    "name": "NOWinBRAIN",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1007/S10278-021-00528-0",
            "metadata": {
                "abstract": "© 2021, The Author(s) under exclusive licence to Society for Imaging Informatics in Medicine.Despite the tremendous development of various brain-related resources, a large, systematic, comprehensive, extendable, and beautiful repository of 3D reconstructed images of a living human brain expanded to the head and neck is not yet available. I have created such a novel repository and populated it with images derived from a 3D atlas constructed from 3/7 Tesla MRI and high-resolution CT scans. This web-based repository contains 6 galleries hierarchically organized in 444 albums and sub-albums with 5,156 images. Its original features include a systematic design in terms of multiple standard views, modes of presentation, and spatially co-registered image sequences; multi-tissue class galleries constructed from 26 primary tissue classes and 199 sub-classes; and a unique image naming syntax enabling image searching based solely on the image name. Anatomic structures are displayed in 6 standard views (anterior, left, posterior, right, superior, inferior), all views having the same brain size, and optionally with additional arbitrary views. In each view, the images are shown as sequences in three standard modes of presentation, non-parcellated unlabeled, parcellated unlabeled, and parcellated labeled. There are two types of spatially co-registered image sequences (imitating image layers and enabling animation creation), the appearance image sequence (for standard views) and the context image sequence (with a growing number of tissue classes). Color-coded neuroanatomic content makes the brain beautiful and facilitates its learning and understanding. This unique repository is freely available and easily accessible online at www.nowinbrain.org for a wide spectrum of users in medicine and beyond. Its future extensions are in progress.",
                "authors": [
                    {
                        "name": "Nowinski W.L."
                    }
                ],
                "citationCount": 2,
                "date": "2022-04-01T00:00:00Z",
                "journal": "Journal of Digital Imaging",
                "title": "NOWinBRAIN: a Large, Systematic, and Extendable Repository of 3D Reconstructed Images of a Living Human Brain Cum Head and Neck"
            },
            "pmcid": "PMC8921370",
            "pmid": "35013825"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Anatomy",
            "uri": "http://edamontology.org/topic_3067"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ]
}
