{
    "additionDate": "2021-01-18T10:55:52Z",
    "biotoolsCURIE": "biotools:nura",
    "biotoolsID": "nura",
    "confidence_flag": "tool",
    "description": "A curated dataset of nuclear receptor modulators.\n\nNuclear receptors (NRs) are key regulators of human health and constitute a relevant target for medicinal chemistry applications as well as for toxicological risk assessment. Several open databases dedicated to small molecules that modulate NRs exist; however, depending on their final aim (i.e., adverse effect assessment or drug design), these databases contain a different amount and type of annotated molecules, along with a different distribution of experimental bioactivity values. Stemming from these considerations, in this work we aim to provide a unified dataset, NURA (NUclear Receptor Activity) dataset, collecting curated information on small molecules that modulate NRs, to be intended for both pharmacological and toxicological applications",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Information extraction",
                    "uri": "http://edamontology.org/operation_3907"
                }
            ]
        }
    ],
    "homepage": "https://doi.org/10.5281/zenodo.3991561",
    "lastUpdate": "2021-03-13T18:47:45Z",
    "name": "NURA",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/J.TAAP.2020.115244",
            "metadata": {
                "abstract": "© 2020 Elsevier Inc.Nuclear receptors (NRs) are key regulators of human health and constitute a relevant target for medicinal chemistry applications as well as for toxicological risk assessment. Several open databases dedicated to small molecules that modulate NRs exist; however, depending on their final aim (i.e., adverse effect assessment or drug design), these databases contain a different amount and type of annotated molecules, along with a different distribution of experimental bioactivity values. Stemming from these considerations, in this work we aim to provide a unified dataset, NURA (NUclear Receptor Activity) dataset, collecting curated information on small molecules that modulate NRs, to be intended for both pharmacological and toxicological applications. NURA contains bioactivity annotations for 15,247 molecules and 11 selected NRs, and it was obtained by integrating and curating data from toxicological and pharmacological databases (i.e., Tox21, ChEMBL, NR-DBIND and BindingDB). Our results show that NURA dataset is a useful tool to bridge the gap between toxicology- and medicinal-chemistry-related databases, as it is enriched in terms of number of molecules, structural diversity and covered atomic scaffolds compared to the single sources. To the best of our knowledge, NURA dataset is the most exhaustive collection of small molecules annotated for their modulation of the chosen nuclear receptors. NURA dataset is intended to support decision-making in pharmacology and toxicology, as well as to contribute to data-driven applications, such as machine learning. The dataset and the data curation pipeline can be downloaded free of charge on Zenodo at the following DOI: https://doi.org/10.5281/zenodo.3991561.",
                "authors": [
                    {
                        "name": "Valsecchi C."
                    },
                    {
                        "name": "Grisoni F."
                    },
                    {
                        "name": "Motta S."
                    },
                    {
                        "name": "Bonati L."
                    },
                    {
                        "name": "Ballabio D."
                    }
                ],
                "citationCount": 3,
                "date": "2020-11-15T00:00:00Z",
                "journal": "Toxicology and Applied Pharmacology",
                "title": "NURA: A curated dataset of nuclear receptor modulators"
            },
            "pmid": "32961130"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Toxicology",
            "uri": "http://edamontology.org/topic_2840"
        },
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        }
    ]
}