{
    "additionDate": "2017-08-03T18:44:37Z",
    "biotoolsCURIE": "biotools:gpminer",
    "biotoolsID": "gpminer",
    "credit": [
        {
            "email": "francis.bi93g@nctu.edu.tw",
            "name": "Tzong-Yi Lee",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://gpminer.mbc.nctu.edu.tw/contact.php"
        }
    ],
    "description": "Integrated system for identifying promoter regions and annotating regulatory features in user-input sequences.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://gpminer.mbc.nctu.edu.tw/about.htm"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Transcriptional regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0438"
                }
            ]
        }
    ],
    "homepage": "http://gpminer.mbc.nctu.edu.tw/",
    "language": [
        "PHP"
    ],
    "lastUpdate": "2018-12-10T12:58:54Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/gpminer-gene-promoter-miner.html"
        }
    ],
    "name": "GPMiner",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2012 Lee et al.; licensee BioMed Central Ltd.Background: Sequence features in promoter regions are involved in regulating gene transcription initiation.Although numerous computational methods have been developed for predicting transcriptional start sites (TSSs) or transcription factor (TF) binding sites (TFBSs), they lack annotations for do not consider some important regulatory features such as CpG islands, tandem repeats, the TATA box, CCAAT box, GC box, over-represented oligonucleotides, DNA stability, and GC content. Additionally, the combinatorial interaction of TFs regulates the gene group that is associated with same expression pattern. To investigate gene transcriptional regulation, an integrated system that annotates regulatory features in a promoter sequence and detects co-regulation of TFs in a group of genes is needed.Results: This work identifies TSSs and regulatory features in a promoter sequence, and recognizes co-occurrence of cis-regulatory elements in co-expressed genes using a novel system. Three well-known TSS prediction tools are incorporated with orthologous conserved features, such as CpG islands, nucleotide composition, over-represented hexamer nucleotides, and DNA stability, to construct the novel Gene Promoter Miner (GPMiner) using a support vector machine (SVM). According to five-fold cross-validation results, the predictive sensitivity and specificity are both roughly 80%. The proposed system allows users to input a group of gene names/symbols, enabling the cooccurrence of TFBSs to be determined. Additionally, an input sequence can also be analyzed for homogeneity of experimental mammalian promoter sequences, and conserved regulatory features between homologous promoters can be observed through cross-species analysis. After identifying promoter regions, regulatory features are visualized graphically to facilitate gene promoter observations.Conclusions: The GPMiner, which has a user-friendly input/output interface, has numerous benefits in analyzing human and mouse promoters. The proposed system is freely available at http://GPMiner.mbc.nctu.edu.tw/.",
                "authors": [
                    {
                        "name": "Lee T.-Y."
                    },
                    {
                        "name": "Chang W.-C."
                    },
                    {
                        "name": "Hsu J.B.-K."
                    },
                    {
                        "name": "Chang T.-H."
                    },
                    {
                        "name": "Shien D.-M."
                    }
                ],
                "citationCount": 35,
                "date": "2012-01-01T00:00:00Z",
                "journal": "Series on Advances in Bioinformatics and Computational Biology",
                "title": "GPMiner: An integrated system for mining combinatorial cis-regulatory elements in mammalian gene group"
            },
            "pmid": "22369687"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular genetics",
            "uri": "http://edamontology.org/topic_3321"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1
}