{
    "accessibility": "Open access",
    "additionDate": "2024-06-18T14:16:01.841673Z",
    "biotoolsCURIE": "biotools:supreme",
    "biotoolsID": "supreme",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "Serdar.Bozdag@unt.edu",
            "name": "Serdar Bozdag",
            "typeEntity": "Person"
        },
        {
            "name": "Ziynet Nesibe Kesimoglu",
            "typeEntity": "Person"
        }
    ],
    "description": "A cancer subtype prediction methodology integrating multiomics data using Graph Convolutional Neural Network.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bozdaglab/SUPREME",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2024-06-18T14:16:01.843976Z",
    "license": "CC-BY-SA-4.0",
    "name": "SUPREME",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/nargab/lqad063",
            "metadata": {
                "abstract": "To pave the road towards precision medicine in cancer, patients with similar biology ought to be grouped into same cancer subtypes. Utilizing high-dimensional multiomics datasets, integrative approaches have been developed to uncover cancer subtypes. Recently, Graph Neural Networks have been discovered to learn node embeddings utilizing node features and associations on graph-structured data. Some integrative prediction tools have been developed leveraging these advances on multiple networks with some limitations. Addressing these limitations, we developed SUPREME, a node classification framework, which integrates multiple data modalities on graph-structured data. On breast cancer subtyping, unlike existing tools, SUPREME generates patient embeddings from multiple similarity networks utilizing multiomics features and integrates them with raw features to capture complementary signals. On breast cancer subtype prediction tasks from three datasets, SUPREME outperformed other tools. SUPREME-inferred subtypes had significant survival differences, mostly having more significance than ground truth, and outperformed nine other approaches. These results suggest that with proper multiomics data utilization, SUPREME could demystify undiscovered characteristics in cancer subtypes that cause significant survival differences and could improve ground truth label, which depends mainly on one datatype. In addition, to show model-agnostic property of SUPREME, we applied it to two additional datasets and had a clear outperformance.",
                "authors": [
                    {
                        "name": "Bozdag S."
                    },
                    {
                        "name": "Kesimoglu Z.N."
                    }
                ],
                "citationCount": 5,
                "date": "2023-06-01T00:00:00Z",
                "journal": "NAR Genomics and Bioinformatics",
                "title": "SUPREME: Multiomics data integration using graph convolutional networks"
            },
            "pmcid": "PMC10481254",
            "pmid": "37680392"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        }
    ]
}
