{
    "additionDate": "2021-03-19T08:38:44Z",
    "biotoolsCURIE": "biotools:cci",
    "biotoolsID": "cci",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "chengtao@ihcams.ac.cn",
            "name": "Tao Cheng",
            "orcidid": "https://orcid.org/0000-0003-4395-1095",
            "typeEntity": "Person"
        },
        {
            "email": "jinwf@sustech.edu.cn",
            "name": "Wenfei Jin",
            "orcidid": "https://orcid.org/0000-0002-0028-3739",
            "typeEntity": "Person"
        },
        {
            "email": "hongn@mail.sustech.edu.cn",
            "name": "Ni Hong",
            "typeEntity": "Person"
        }
    ],
    "description": "CCI (Counterpart Composite Index) is a tool for projecting carcinoma cells into reference cells, to identify their healthy counterparts that could reveal the subtypes and lineage stage of carcinoma cells based on single cell RNA sequencing data (scRNA-seq).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://github.com/pengfeeei/cci",
    "language": [
        "C++"
    ],
    "lastUpdate": "2021-04-22T08:11:26Z",
    "license": "Apache-2.0",
    "name": "CCI",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1038/S41421-020-00223-4",
            "metadata": {
                "abstract": "© 2020, The Author(s).Single-cell RNA sequencing provides exciting opportunities to unbiasedly study hematopoiesis. However, our understanding of leukemogenesis was limited due to the high individual differences. Integrated analyses of hematopoiesis and leukemogenesis potentially provides new insights. Here we analyzed ~200,000 single-cell transcriptomes of bone marrow mononuclear cells (BMMCs) and its subsets from 23 clinical samples. We constructed a comprehensive cell atlas as hematopoietic reference. We developed counterpart composite index (CCI; available at GitHub: https://github.com/pengfeeei/cci) to search for the healthy counterpart of each leukemia cell subpopulation, by integrating multiple statistics to map leukemia cells onto reference hematopoietic cells. Interestingly, we found leukemia cell subpopulations from each patient had different healthy counterparts. Analysis showed the trajectories of leukemia cell subpopulations were similar to that of their healthy counterparts, indicating that developmental termination of leukemia initiating cells at different phases leads to different leukemia cell subpopulations thus explained the origin of leukemia heterogeneity. CCI further predicts leukemia subtypes, cellular heterogeneity, and cellular stemness of each leukemia patient. Analyses of leukemia patient at diagnosis, refractory, remission and relapse vividly presented dynamics of cell population during leukemia treatment. CCI analyses showed the healthy counterparts of relapsed leukemia cells were closer to the root of hematopoietic tree than that of other leukemia cells, although single-cell transcriptomic genetic variants and haplotype tracing analyses showed the relapsed leukemia cell were derived from an early minor leukemia cell population. In summary, this study developed a unified framework for understanding leukemogenesis with hematopoiesis reference, which provided novel biological and medical implication.",
                "authors": [
                    {
                        "name": "Cheng T."
                    },
                    {
                        "name": "Fu R."
                    },
                    {
                        "name": "Hong N."
                    },
                    {
                        "name": "Hou W."
                    },
                    {
                        "name": "Jin W."
                    },
                    {
                        "name": "Liu Q."
                    },
                    {
                        "name": "Meng G."
                    },
                    {
                        "name": "Pang Y."
                    },
                    {
                        "name": "Qin P."
                    },
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Zhu X."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "Cell Discovery",
                "title": "Integrated decoding hematopoiesis and leukemogenesis using single-cell sequencing and its medical implication"
            },
            "pmcid": "PMC7788081",
            "pmid": "33408321"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "version": [
        "1.0"
    ]
}
