{
    "additionDate": "2018-07-29T10:13:06Z",
    "biotoolsCURIE": "biotools:nmrstarlib",
    "biotoolsID": "nmrstarlib",
    "credit": [
        {
            "email": "andrey.smelter@louisville.edu",
            "name": "Andrey Smelter",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "ibrary for reading, writing, and accessing BMRB entries in NMR-STAR and JSONized NMR-STAR formats.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/MoseleyBioinformaticsLab/nmrstarlib"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://bioinformatics.cesb.uky.edu/Main/SoftwareDevelopment#nmrstarlib",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "license": "MIT",
    "name": "nmrstarlib",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s12859-017-1580-5",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: The Biological Magnetic Resonance Data Bank (BMRB) is a public repository of Nuclear Magnetic Resonance (NMR) spectroscopic data of biological macromolecules. It is an important resource for many researchers using NMR to study structural, biophysical, and biochemical properties of biological macromolecules. It is primarily maintained and accessed in a flat file ASCII format known as NMR-STAR. While the format is human readable, the size of most BMRB entries makes computer readability and explicit representation a practical requirement for almost any rigorous systematic analysis. Results: To aid in the use of this public resource, we have developed a package called nmrstarlib in the popular open-source programming language Python. The nmrstarlib's implementation is very efficient, both in design and execution. The library has facilities for reading and writing both NMR-STAR version 2.1 and 3.1 formatted files, parsing them into usable Python dictionary- and list-based data structures, making access and manipulation of the experimental data very natural within Python programs (i.e. \"saveframe\" and \"loop\" records represented as individual Python dictionary data structures). Another major advantage of this design is that data stored in original NMR-STAR can be easily converted into its equivalent JavaScript Object Notation (JSON) format, a lightweight data interchange format, facilitating data access and manipulation using Python and any other programming language that implements a JSON parser/generator (i.e., all popular programming languages). We have also developed tools to visualize assigned chemical shift values and to convert between NMR-STAR and JSONized NMR-STAR formatted files. Full API Reference Documentation, User Guide and Tutorial with code examples are also available. We have tested this new library on all current BMRB entries: 100% of all entries are parsed without any errors for both NMR-STAR version 2.1 and version 3.1 formatted files. We also compared our software to three currently available Python libraries for parsing NMR-STAR formatted files: PyStarLib, NMRPyStar, and PyNMRSTAR. Conclusions: The nmrstarlib package is a simple, fast, and efficient library for accessing data from the BMRB. The library provides an intuitive dictionary-based interface with which Python programs can read, edit, and write NMR-STAR formatted files and their equivalent JSONized NMR-STAR files. The nmrstarlib package can be used as a library for accessing and manipulating data stored in NMR-STAR files and as a command-line tool to convert from NMR-STAR file format into its equivalent JSON file format and vice versa, and to visualize chemical shift values. Furthermore, the nmrstarlib implementation provides a guide for effectively JSONizing other older scientific formats, improving the FAIRness of data in these formats.",
                "authors": [
                    {
                        "name": "Smelter A."
                    },
                    {
                        "name": "Astra M."
                    },
                    {
                        "name": "Moseley H.N.B."
                    }
                ],
                "citationCount": 4,
                "date": "2017-03-17T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "A fast and efficient python library for interfacing with the Biological Magnetic Resonance Data Bank"
            },
            "pmcid": "PMC5356280",
            "pmid": "28302053"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Data submission, annotation and curation",
            "uri": "http://edamontology.org/topic_0219"
        },
        {
            "term": "Structural biology",
            "uri": "http://edamontology.org/topic_1317"
        }
    ],
    "validated": 1
}