{"credit":[],"labels":{"topic":[{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"},{"term":"NMR","uri":"http://edamontology.org/topic_0593"},{"term":"Biomaterials","uri":"http://edamontology.org/topic_3368"}]},"publication":[{"abstract":"Copyright © 2019 American Chemical Society.This work presents a salt-responsive interpenetrating network (IPN) hydrogel with effective antimicrobial properties and surface regeneration. The hydrogels were engineered using the double network strategy to form loosely cross-linked zwitterionic poly(sulfobetaine vinylimidazole) (pSBVI) networks into the highly cross-linked cationic poly((trimethylamino)ethyl methacrylate chloride) (pTMAEMA) framework via photopolymerization. The pTMAEMA/pSBVI hydrogel has strong mechanical properties, with a fracture stress 120× higher than single network pTMAEMA hydrogel. In addition, there is inverse correlation between elastic modulus and elastic strain of pTMAEMA/pSBVI hydrogels as a function of ionic strength. The cationic pTMAEMA and zwitterionic pSBVI show opposite swelling behaviors in salt solutions due to the polyelectrolyte effect and antipolyelectrolyte effect. Therefore, the pTMAEMA/pSBVI hydrogel elicits a significant interfacial transition in solutions with different ionic strengths. The IPN hydrogels have switchable lubrication and optical transmittance between deionized water and 1.0 M NaCl solution. The protein adsorption tests further confirmed the switchable interface of salt-responsive IPN hydrogels. In addition, bacterial attachment test on pTMAEMA/pSBVI hydrogels with Staphylococcus epidermidis (S. epidermidis) and Escherichia coli (E. coli) show bacterial killing rates of the IPN hydrogel over 80% for S. epidermidis and 90% for E. coli after incubating the hydrogels in the bacterial solutions for 24 h. The bacterial release rate from the IPN hydrogel reached 96% after washing with 1.0 M NaCl solution. Furthermore, the excellent reusability of the pTMAEMA/pSBVI hydrogels was demonstrated by the high bacterial killing and bacterial release rates after five kill/release cycles. The work presents a new stimuli-responsive IPN hydrogel with structural modulation, tunable antimicrobial properties, and surface regeneration by ionic strength. Integrating two salt-responsive polymers with mutually independent actions into a single material provides a new direction for smart materials with potential medical and industrial applications.","authors":["Huang K.-T.","Ishihara K.","Huang C.-J."],"cit_count":0,"doi":"10.1021/ACS.BIOMAC.9B00796","journal":"Biomacromolecules","pmid":"31381318","title":"Polyelectrolyte and Antipolyelectrolyte Effects for Dual Salt-Responsive Interpenetrating Network Hydrogels","year":"2019-09-09"}],"summary":{"biotoolsCURIE":"biotools:pTMAEMA_pSBVI_hydrogels","biotoolsID":"pTMAEMA_pSBVI_hydrogels","description":"> VERY_LOW CONFIDENCE! | > HOMEPAGE MISSING! | > CORRECT NAME OF TOOL COULD ALSO BE 'pTMAEMA pSBVI', 'pTMAEMA pSBVI hydrogel', 'reusability pTMAEMA pSBVI hydrogels', 'pSBVI hydrogels' | Polyelectrolyte and Antipolyelectrolyte Effects for Dual Salt-Responsive Interpenetrating Network Hydrogels | This work presents a salt-responsive interpenetrating network (IPN) hydrogel with effective antimicrobial properties and surface regeneration. The hydrogels were engineered using the double network strategy to form loosely cross-linked zwitterionic poly(sulfobetaine vinylimidazole) (pSBVI) networks into the highly cross-linked cationic poly((trimethylamino)ethyl methacrylate chloride) (pTMAEMA) framework via photopolymerization. The pTMAEMA pSBVI hydrogel has strong mechanical properties, with a fracture stress 120× higher than single network pTMAEMA hydrogel","homepage":"https://www.ncbi.nlm.nih.gov/pubmed/?term=31381318","name":"pTMAEMA pSBVI hydrogels"}}