{
    "additionDate": "2018-08-09T13:02:10Z",
    "biotoolsCURIE": "biotools:edgar_genomics",
    "biotoolsID": "edgar_genomics",
    "collectionID": [
        "de.NBI",
        "de.NBI-BiGi"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jochen.blom@computational.bio.uni-giessen.de",
            "name": "Jochen Blom",
            "orcidid": "http://orcid.org/0000-0001-6455-3622",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "bigi",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "orcidid": "http://orcid.org/0000-0001-6455-3622",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://edgar.computational.bio"
        }
    ],
    "description": "The introduction of next generation sequencing approaches has caused a rapid increase in the number of completely sequenced genomes. As one result of this development, it is now feasible to analyze large groups of related genomes in a comparative approach. A main task in comparative genomics is the identification of orthologous genes in different genomes and the classification of genes as core genes or singletons. To support these studies EDGAR - \"Efficient Database framework for comparative Genome Analyses using BLAST score Ratios\" - was developed.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Nucleic acid sequence record",
                        "uri": "http://edamontology.org/data_2887"
                    },
                    "format": [
                        {
                            "term": "GenBank format",
                            "uri": "http://edamontology.org/format_1936"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Genome feature comparison",
                    "uri": "http://edamontology.org/operation_3194"
                }
            ]
        }
    ],
    "homepage": "http://edgar.computational.bio",
    "lastUpdate": "2019-01-13T01:06:27Z",
    "license": "GPL-2.0",
    "maturity": "Mature",
    "name": "EDGAR-2.0",
    "owner": "bigi",
    "publication": [
        {
            "doi": "10.1093/nar/gkw255",
            "metadata": {
                "abstract": "© The Author(s) 2016. Published by Oxford University Press on behalf of Nucleic Acids Research.The rapidly increasing availability of microbial genome sequences has led to a growing demand for bioinformatics software tools that support the functional analysis based on the comparison of closely related genomes. By utilizing comparative approaches on gene level it is possible to gain insights into the core genes which represent the set of shared features for a set of organisms under study. Vice versa singleton genes can be identified to elucidate the specific properties of an individual genome. Since initial publication, the EDGAR platform has become one of the most established software tools in the field of comparative genomics. Over the last years, the software has been continuously improved and a large number of new analysis features have been added. For the new version, EDGAR 2.0, the gene orthology estimation approach was newly designed and completely re-implemented. Among other new features, EDGAR 2.0 provides extended phylogenetic analysis features like AAI (Average Amino Acid Identity) and ANI (Average Nucleotide Identity) matrices, genome set size statistics and modernized visualizations like interactive synteny plots or Venn diagrams. Thereby, the software supports a quick and user-friendly survey of evolutionary relationships between microbial genomes and simplifies the process of obtaining new biological insights into their differential gene content. All features are offered to the scientific community via a web-based and therefore platform-independent user interface, which allows easy browsing of precomputed datasets. The web server is accessible at http://edgar.computational.bio.",
                "authors": [
                    {
                        "name": "Bertelli C."
                    },
                    {
                        "name": "Blom J."
                    },
                    {
                        "name": "Ernst C."
                    },
                    {
                        "name": "Goesmann A."
                    },
                    {
                        "name": "Juhre T."
                    },
                    {
                        "name": "Kreis J."
                    },
                    {
                        "name": "Spanig S."
                    }
                ],
                "citationCount": 213,
                "date": "2016-07-08T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "EDGAR 2.0: an enhanced software platform for comparative gene content analyses"
            },
            "pmcid": "PMC4987874",
            "pmid": "27098043",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Comparative genomics",
            "uri": "http://edamontology.org/topic_0797"
        }
    ],
    "validated": 1,
    "version": [
        "2.0"
    ]
}
