
{
    "credit": [
        {
            "email": "info@cbio.mskcc.org",
            "name": "MSKCC – Computational Biology Center",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://cbio.mskcc.org/research/ratsch-research-group/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/ratschlab/mmr/blob/master/README.md"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "DNA mapping",
                    "uri": "http://edamontology.org/operation_2520"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++"
        ],
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Mapping",
                "uri": "http://edamontology.org/topic_0102"
            },
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            },
            {
                "term": "Comparative genomics",
                "uri": "http://edamontology.org/topic_0797"
            },
            {
                "term": "Transcriptomics",
                "uri": "http://edamontology.org/topic_3308"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/mmr-tool-for-read-multi-mapper-resolution.html"
        }
    ],
    "publication": [
        {
            "abstract": "© The Author 2015. Published by Oxford University Press. Motivation: Mapping high-throughput sequencing data to a reference genome is an essential step for most analysis pipelines aiming at the computational analysis of genome and transcriptome sequencing data. Breaking ties between equally well mapping locations poses a severe problem not only during the alignment phase but also has significant impact on the results of downstream analyses. We present the multi-mapper resolution (MMR) tool that infers optimal mapping locations from the coverage density of other mapped reads. Results: Filtering alignments with MMR can significantly improve the performance of downstream analyses like transcript quantitation and differential testing. We illustrate that the accuracy (Spearman correlation) of transcript quantification increases by 15% when using reads of length 51. In addition, MMR decreases the alignment file sizes by more than 50%, and this leads to a reduced running time of the quantification tool. Our efficient implementation of the MMR algorithm is easily applicable as a post-processing step to existing alignment files in BAM format. Its complexity scales linearly with the number of alignments and requires no further inputs.",
            "authors": [
                "Kahles A.",
                "Behr J.",
                "Ratsch G."
            ],
            "cit_count": 10,
            "journal": "Bioinformatics",
            "pmid": "26519503",
            "title": "MMR: A tool for read multi-mapper resolution",
            "year": "2015-05-08"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:mmr",
        "biotoolsID": "mmr",
        "description": "Infers optimal mapping locations from the coverage densities of other mapped reads in vicinity.",
        "homepage": "http://raetschlab.org/suppl/MMR",
        "name": "MMR"
    }
}