{
    "additionDate": "2018-06-27T18:29:14Z",
    "biotoolsCURIE": "biotools:veselect",
    "biotoolsID": "veselect",
    "credit": [
        {
            "email": "dandekar@biozentrum.uni-wuerzburg.de",
            "name": "Thomas Dandekar",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "hristian.stigloher@uni-wuerzburg.de",
            "name": "Christian Stigloher",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "3D automated reconstruction tool for vesicle structures of electron tomograms.",
    "documentation": [
        {
            "type": "General",
            "url": "https://www.biozentrum.uni-wuerzburg.de/fileadmin/07030400/How_to_use_3D_ART_VeSElecT.pdf"
        },
        {
            "type": "User manual",
            "url": "https://www.biozentrum.uni-wuerzburg.de/fileadmin/07030400/KKaltdorf/How_to_use_the_classification_macro.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://www.biozentrum.uni-wuerzburg.de/bioinfo/computing/3DART-VeSElecT",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "3D ART VeSElecT",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1371/journal.pcbi.1005317",
            "metadata": {
                "abstract": "© 2017 Kaltdorf et al. Automatic image reconstruction is critical to cope with steadily increasing data from advanced microscopy. We describe here the Fiji macro 3D ART VeSElecT which we developed to study synaptic vesicles in electron tomograms. We apply this tool to quantify vesicle properties (i) in embryonic Danio rerio 4 and 8 days past fertilization (dpf) and (ii) to compare Caenorhabditis elegans N2 neuromuscular junctions (NMJ) wild-type and its septin mutant (unc-59(e261)). We demonstrate development-specific and mutant-specific changes in synaptic vesicle pools in both models. We confirm the functionality of our macro by applying our 3D ART VeSElecT on zebrafish NMJ showing smaller vesicles in 8 dpf embryos then 4 dpf, which was validated by manual reconstruction of the vesicle pool. Furthermore, we analyze the impact of C. elegans septin mutant unc-59(e261) on vesicle pool formation and vesicle size. Automated vesicle registration and characterization was implemented in Fiji as two macros (registration and measurement). This flexible arrangement allows in particular reducing false positives by an optional manual revision step. Preprocessing and contrast enhancement work on image-stacks of 1nm/pixel in x and y direction. Semi-automated cell selection was integrated. 3D ART VeSElecT removes interfering components, detects vesicles by 3D segmentation and calculates vesicle volume and diameter (spherical approximation, inner/outer diameter). Results are collected in color using the RoiManager plugin including the possibility of manual removal of non-matching confounder vesicles. Detailed evaluation considered performance (detected vesicles) and specificity (true vesicles) as well as precision and recall. We furthermore show gain in segmentation and morphological filtering compared to learning based methods and a large time gain compared to manual segmentation. 3D ART VeSElecT shows small error rates and its speed gain can be up to 68 times faster in comparison to manual annotation. Both automatic and semi-automatic modes are explained including a tutorial.",
                "authors": [
                    {
                        "name": "Kaltdorf K.V."
                    },
                    {
                        "name": "Schulze K."
                    },
                    {
                        "name": "Helmprobst F."
                    },
                    {
                        "name": "Kollmannsberger P."
                    },
                    {
                        "name": "Dandekar T."
                    },
                    {
                        "name": "Stigloher C."
                    }
                ],
                "citationCount": 2,
                "date": "2017-01-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "FIJI Macro 3D ART VeSElecT: 3D Automated Reconstruction Tool for Vesicle Structures of Electron Tomograms"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        }
    ],
    "validated": 1
}