{
    "additionDate": "2021-03-19T08:37:30Z",
    "biotoolsCURIE": "biotools:consent-correct",
    "biotoolsID": "consent-correct",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "pierre.morisse@inria.fr",
            "name": "Pierre Morisse",
            "typeEntity": "Person"
        }
    ],
    "description": "CONSENT (Scalable long read self-correction and assembly polishing with multiple sequence alignment) is a self-correction method for long reads. It works by, first, computing overlaps between the long reads, in order to define an alignment pile (i.e. a set of overlapping reads used for correction) for each read. Each read's alignment pile is then further divided into smaller windows, that are corrected idependently. First, a multiple alignment strategy is used in order to compute consensus. Then, this consensus is further polished with a local de Bruijn graph, in order to get rid of the remaining errors. Additionally to error correction, CONSENT can also perform assembly polishing.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "Local alignment",
                    "uri": "http://edamontology.org/operation_0495"
                },
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                }
            ]
        }
    ],
    "homepage": "https://github.com/morispi/CONSENT",
    "language": [
        "C++",
        "Shell"
    ],
    "lastUpdate": "2021-03-22T09:29:13Z",
    "license": "AGPL-3.0",
    "name": "CONSENT",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1038/S41598-020-80757-5",
            "metadata": {
                "abstract": "© 2021, The Author(s).Third-generation sequencing technologies allow to sequence long reads of tens of kbp, that are expected to solve various problems. However, they display high error rates, currently capped around 10%. Self-correction is thus regularly used in long reads analysis projects. We introduce CONSENT, a new self-correction method that relies both on multiple sequence alignment and local de Bruijn graphs. To ensure scalability, multiple sequence alignment computation benefits from a new and efficient segmentation strategy, allowing a massive speedup. CONSENT compares well to the state-of-the-art, and performs better on real Oxford Nanopore data. Specifically, CONSENT is the only method that efficiently scales to ultra-long reads, and allows to process a full human dataset, containing reads reaching up to 1.5 Mbp, in 10 days. Moreover, our experiments show that error correction with CONSENT improves the quality of Flye assemblies. Additionally, CONSENT implements a polishing feature, allowing to correct raw assemblies. Our experiments show that CONSENT is 2-38x times faster than other polishing tools, while providing comparable results. Furthermore, we show that, on a human dataset, assembling the raw data and polishing the assembly is less resource consuming than correcting and then assembling the reads, while providing better results. CONSENT is available at https://github.com/morispi/CONSENT.",
                "authors": [
                    {
                        "name": "Morisse P."
                    },
                    {
                        "name": "Marchet C."
                    },
                    {
                        "name": "Limasset A."
                    },
                    {
                        "name": "Lecroq T."
                    },
                    {
                        "name": "Lefebvre A."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "Scalable long read self-correction and assembly polishing with multiple sequence alignment"
            },
            "pmcid": "PMC7804095",
            "pmid": "33436980"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        },
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        }
    ]
}