{
    "additionDate": "2020-01-14T09:45:07Z",
    "biotoolsCURIE": "biotools:genex_ontology",
    "biotoolsID": "genex_ontology",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Tarcisio.Mendesdefarias@unil.ch",
            "name": "Tarcisio Mendes de Farias",
            "typeEntity": "Person"
        },
        {
            "email": "Marc.Robinson-Rechavi@unil.ch",
            "name": "Marc Robinson-Rechavi",
            "typeEntity": "Person"
        },
        {
            "email": "Christophe.Dessimoz@unil.ch",
            "name": "Christophe Dessimoz",
            "typeEntity": "Person"
        }
    ],
    "description": "Enabling semantic queries across federated bioinformatics databases.\n\nOntology Documentation generated by WIDOCO.\n\nGene expression (GenEx) semantic model.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "ID mapping",
                    "uri": "http://edamontology.org/operation_3282"
                }
            ]
        }
    ],
    "homepage": "https://biosoda.github.io/genex/",
    "lastUpdate": "2020-12-03T08:03:42.812692Z",
    "name": "GenEx_ontology",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAZ106",
            "metadata": {
                "abstract": "© The authors 2019. Published by Oxford University Press on behalf of the Institute of Mathematics and its Applications.MOTIVATION: Data integration promises to be one of the main catalysts in enabling new insights to be drawn from the wealth of biological data available publicly. However, the heterogeneity of the different data sources, both at the syntactic and the semantic level, still poses significant challenges for achieving interoperability among biological databases. RESULTS: We introduce an ontology-based federated approach for data integration. We applied this approach to three heterogeneous data stores that span different areas of biological knowledge: (i) Bgee, a gene expression relational database; (ii) Orthologous Matrix (OMA), a Hierarchical Data Format 5 orthology DS; and (iii) UniProtKB, a Resource Description Framework (RDF) store containing protein sequence and functional information. To enable federated queries across these sources, we first defined a new semantic model for gene expression called GenEx. We then show how the relational data in Bgee can be expressed as a virtual RDF graph, instantiating GenEx, through dedicated relational-to-RDF mappings. By applying these mappings, Bgee data are now accessible through a public SPARQL endpoint. Similarly, the materialized RDF data of OMA, expressed in terms of the Orthology ontology, is made available in a public SPARQL endpoint. We identified and formally described intersection points (i.e. virtual links) among the three data sources. These allow performing joint queries across the data stores. Finally, we lay the groundwork to enable nontechnical users to benefit from the integrated data, by providing a natural language template-based search interface.",
                "authors": [
                    {
                        "name": "Sima A.C."
                    },
                    {
                        "name": "Mendes de Farias T."
                    },
                    {
                        "name": "Zbinden E."
                    },
                    {
                        "name": "Anisimova M."
                    },
                    {
                        "name": "Gil M."
                    },
                    {
                        "name": "Stockinger H."
                    },
                    {
                        "name": "Stockinger K."
                    },
                    {
                        "name": "Robinson-Rechavi M."
                    },
                    {
                        "name": "Dessimoz C."
                    }
                ],
                "citationCount": 1,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Database : the journal of biological databases and curation",
                "title": "Enabling semantic queries across federated bioinformatics databases"
            },
            "pmcid": "PMC6836710",
            "pmid": "31697362"
        }
    ],
    "topic": [
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        }
    ]
}