{
    "additionDate": "2024-04-18T12:55:23.462103Z",
    "biotoolsCURIE": "biotools:lnclocformer",
    "biotoolsID": "lnclocformer",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "limin@mail.csu.edu.cn",
            "name": "Min Li",
            "orcidid": "https://orcid.org/0000-0002-0188-1394",
            "typeEntity": "Person"
        }
    ],
    "description": "Transformer-based deep learning model for multi-label lncRNA subcellular localization prediction by using localization-specific attention mechanism.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein signal peptide detection",
                    "uri": "http://edamontology.org/operation_0418"
                },
                {
                    "term": "Sequence motif discovery",
                    "uri": "http://edamontology.org/operation_0238"
                },
                {
                    "term": "Subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                }
            ]
        }
    ],
    "homepage": "http://csuligroup.com:9000/LncLocFormer",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:04:17.989781Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/CSUBioGroup/LncLocFormer"
        }
    ],
    "name": "LncLocFormer",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btad752",
            "metadata": {
                "abstract": "Motivation: There is mounting evidence that the subcellular localization of lncRNAs can provide valuable insights into their biological functions. In the real world of transcriptomes, lncRNAs are usually localized in multiple subcellular localizations. Furthermore, lncRNAs have specific localization patterns for different subcellular localizations. Although several computational methods have been developed to predict the subcellular localization of lncRNAs, few of them are designed for lncRNAs that have multiple subcellular localizations, and none of them take motif specificity into consideration. Results: In this study, we proposed a novel deep learning model, called LncLocFormer, which uses only lncRNA sequences to predict multi-label lncRNA subcellular localization. LncLocFormer utilizes eight Transformer blocks to model long-range dependencies within the lncRNA sequence and shares information across the lncRNA sequence. To exploit the relationship between different subcellular localizations and find distinct localization patterns for different subcellular localizations, LncLocFormer employs a localization-specific attention mechanism. The results demonstrate that LncLocFormer outperforms existing state-of-the-art predictors on the hold-out test set. Furthermore, we conducted a motif analysis and found LncLocFormer can capture known motifs. Ablation studies confirmed the contribution of the localization-specific attention mechanism in improving the prediction performance.",
                "authors": [
                    {
                        "name": "Duan J."
                    },
                    {
                        "name": "Li M."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Lu C."
                    },
                    {
                        "name": "Wu Y."
                    },
                    {
                        "name": "Yin R."
                    },
                    {
                        "name": "Zeng M."
                    }
                ],
                "citationCount": 10,
                "date": "2023-12-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "LncLocFormer: a Transformer-based deep learning model for multi-label lncRNA subcellular localization prediction by using localization-specific attention mechanism"
            },
            "pmcid": "PMC10749772",
            "pmid": "38109668"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
