{
    "additionDate": "2017-12-18T00:10:17Z",
    "biotoolsCURIE": "biotools:pfclust",
    "biotoolsID": "pfclust",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://chemistry.st-andrews.ac.uk/staff/jbom/group/"
        }
    ],
    "description": "PFClust is a partitioning-based clustering algorithm capable, unlike many widely-used clustering algorithms, of automatically proposing an optimal number of clusters for the data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://chemistry.st-andrews.ac.uk/staff/jbom/group/PFClust.zip"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "http://chemistry.st-andrews.ac.uk/staff/jbom/group/PFClust.html",
    "lastUpdate": "2024-11-25T14:17:38.998070Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/pfclust-novel-parameter-free-clustering-algorithm.html"
        }
    ],
    "name": "PFClust",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-14-213",
            "metadata": {
                "abstract": "Background: We present the algorithm PFClust (Parameter Free Clustering), which is able automatically to cluster data and identify a suitable number of clusters to group them into without requiring any parameters to be specified by the user. The algorithm partitions a dataset into a number of clusters that share some common attributes, such as their minimum expectation value and variance of intra-cluster similarity. A set of n objects can be clustered into any number of clusters from one to n, and there are many different hierarchical and partitional, agglomerative and divisive, clustering methodologies available that can be used to do this. Nonetheless, automatically determining the number of clusters present in a dataset constitutes a significant challenge for clustering algorithms. Identifying a putative optimum number of clusters to group the objects into involves computing and evaluating a range of clusterings with different numbers of clusters. However, there is no agreed or unique definition of optimum in this context. Thus, we test PFClust on datasets for which an external gold standard of 'correct' cluster definitions exists, noting that this division into clusters may be suboptimal according to other reasonable criteria. PFClust is heuristic in the sense that it cannot be described in terms of optimising any single simply-expressed metric over the space of possible clusterings.Results: We validate PFClust firstly with reference to a number of synthetic datasets consisting of 2D vectors, showing that its clustering performance is at least equal to that of six other leading methodologies - even though five of the other methods are told in advance how many clusters to use. We also demonstrate the ability of PFClust to classify the three dimensional structures of protein domains, using a set of folds taken from the structural bioinformatics database CATH.Conclusions: We show that PFClust is able to cluster the test datasets a little better, on average, than any of the other algorithms, and furthermore is able to do this without the need to specify any external parameters. Results on the synthetic datasets demonstrate that PFClust generates meaningful clusters, while our algorithm also shows excellent agreement with the correct assignments for a dataset extracted from the CATH part-manually curated classification of protein domain structures. © 2013 Mavridis et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Mavridis L."
                    },
                    {
                        "name": "Mitchell J.B.O."
                    },
                    {
                        "name": "Nath N."
                    }
                ],
                "citationCount": 14,
                "date": "2013-07-03T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "PFClust: A novel parameter free clustering algorithm"
            },
            "pmcid": "PMC3747858",
            "pmid": "23819480",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Computer science",
            "uri": "http://edamontology.org/topic_3316"
        }
    ],
    "validated": 1
}
