{
    "additionDate": "2018-05-22T18:05:56Z",
    "biotoolsCURIE": "biotools:lincsnp",
    "biotoolsID": "lincsnp",
    "credit": [
        {
            "email": "ningsw@ems.hrbmu.edu.cn",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Database of linking disease-associated SNPs to human large intergenic non-coding RNAs.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://210.46.80.146/lincsnp/help.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://210.46.80.146/lincsnp/",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "LincSNP",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/1471-2105-15-152",
            "metadata": {
                "abstract": "Background: Genome-wide association studies (GWAS) have successfully identified a large number of single nucleotide polymorphisms (SNPs) that are associated with a wide range of human diseases. However, many of these disease-associated SNPs are located in non-coding regions and have remained largely unexplained. Recent findings indicate that disease-associated SNPs in human large intergenic non-coding RNA (lincRNA) may lead to susceptibility to diseases through their effects on lincRNA expression. There is, therefore, a need to specifically record these SNPs and annotate them as potential candidates for disease.Description: We have built LincSNP, an integrated database, to identify and annotate disease-associated SNPs in human lincRNAs. The current release of LincSNP contains approximately 140,000 disease-associated SNPs (or linkage disequilibrium SNPs), which can be mapped to around 5,000 human lincRNAs, together with their comprehensive functional annotations. The database also contains annotated, experimentally supported SNP-lincRNA-disease associations and disease-associated lincRNAs. It provides flexible search options for data extraction and searches can be performed by disease/phenotype name, SNP ID, lincRNA name and chromosome region. In addition, we provide users with a link to download all the data from LincSNP and have developed a web interface for the submission of novel identified SNP-lincRNA-disease associations.Conclusions: The LincSNP database aims to integrate disease-associated SNPs and human lincRNAs, which will be an important resource for the investigation of the functions and mechanisms of lincRNAs in human disease. The database is available at http://bioinfo.hrbmu.edu.cn/LincSNP. © 2014 Ning et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Li R."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Ning S."
                    },
                    {
                        "name": "Wang P."
                    },
                    {
                        "name": "Wang T."
                    },
                    {
                        "name": "Ye J."
                    },
                    {
                        "name": "Zhao Z."
                    },
                    {
                        "name": "Zhi H."
                    }
                ],
                "citationCount": 41,
                "date": "2014-05-20T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "LincSNP: A database of linking disease-associated SNPs to human large intergenic non-coding RNAs"
            },
            "pmcid": "PMC4038069",
            "pmid": "24885522"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}
