{
    "accessibility": "Open access",
    "additionDate": "2022-06-15T13:04:10.982112Z",
    "biotoolsCURIE": "biotools:imrelnc",
    "biotoolsID": "imrelnc",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "shang@nwpu.edu.cn",
            "name": "Xuequn Shang",
            "typeEntity": "Person"
        }
    ],
    "description": "ImReLnc accurately identified the irlncRNA characteristics in multiple cancers based on the heuristic correlation coefficient",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Virulence prediction",
                    "uri": "http://edamontology.org/operation_3461"
                }
            ]
        }
    ],
    "homepage": "https://github.com/meihonggao/ImReLnc",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-06-15T13:04:10.984803Z",
    "license": "Not licensed",
    "name": "ImReLnc",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3389/FGENE.2021.792541",
            "metadata": {
                "abstract": "Copyright © 2022 Gao, Liu, Qi, Guo and Shang.Long non-coding RNAs (lncRNAs) play critical roles in cancer through gene expression and immune regulation. Identifying immune-related lncRNA (irlncRNA) characteristics would contribute to dissecting the mechanism of cancer pathogenesis. Some computational methods have been proposed to identify irlncRNA characteristics in human cancers, but most of them are aimed at identifying irlncRNA characteristics in specific cancer. Here, we proposed a new method, ImReLnc, to recognize irlncRNA characteristics for 33 human cancers and predict the pathogenicity levels of these irlncRNAs across cancer types. We first calculated the heuristic correlation coefficient between lncRNAs and mRNAs for immune-related enrichment analysis. Especially, we analyzed the relationship between lncRNAs and 17 immune-related pathways in 33 cancers to recognize the irlncRNA characteristics of each cancer. Then, we calculated the Pscore of the irlncRNA characteristics to evaluate their pathogenicity levels. The results showed that highly pathogenic irlncRNAs appeared in a higher proportion of known disease databases and had a significant prognostic effect on cancer. In addition, it was found that the expression of irlncRNAs in immune cells was higher than that of non-irlncRNAs, and the proportion of irlncRNAs related to the levels of immune infiltration was much higher than that of non-irlncRNAs. Overall, ImReLnc accurately identified the irlncRNA characteristics in multiple cancers based on the heuristic correlation coefficient. More importantly, ImReLnc effectively evaluated the pathogenicity levels of irlncRNAs across cancer types. ImReLnc is freely available at https://github.com/meihonggao/ImReLnc.",
                "authors": [
                    {
                        "name": "Gao M."
                    },
                    {
                        "name": "Guo X."
                    },
                    {
                        "name": "Liu S."
                    },
                    {
                        "name": "Qi Y."
                    },
                    {
                        "name": "Shang X."
                    }
                ],
                "date": "2022-01-10T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "ImReLnc: Identifying Immune-Related LncRNA Characteristics in Human Cancers Based on Heuristic Correlation Optimization"
            },
            "pmcid": "PMC8784420",
            "pmid": "35082835"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ],
    "validated": 1
}
