{
    "additionDate": "2020-09-03T19:10:48Z",
    "biotoolsCURIE": "biotools:tabloid_proteome",
    "biotoolsID": "tabloid_proteome",
    "collectionID": [
        "BIG N2N",
        "UGent",
        "VIB"
    ],
    "credit": [
        {
            "email": "lennart.martens@vib-ugent.be",
            "name": "Lennart Martens",
            "typeEntity": "Person"
        }
    ],
    "description": "an annotated database of protein associations.\n\nTabloid Proteome is a database of protein association network generated using publically available mass spectrometry based experiments in PRIDE.These associations represent a broad scala of biological associations between pairs of proteins that goes well beyond mere binary protein interactions. More info.\n\nSelect species: Homo sapiens (Human) Mus musculus (Mouse).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                }
            ]
        }
    ],
    "homepage": "http://iomics.ugent.be/tabloidproteome",
    "lastUpdate": "2020-09-03T19:10:48Z",
    "name": "Tabloid Proteome",
    "owner": "bits@vib.be",
    "publication": [
        {
            "doi": "10.1093/NAR/GKX930",
            "metadata": {
                "abstract": "© 2017 The Author(s).A complete knowledge of the proteome can only be attained by determining the associations between proteins, along with the nature of these associations (e.g. physical contact in protein-protein interactions, participation in complex formation or different roles in the same pathway). Despite extensive efforts in elucidating direct protein interactions, our knowledge on the complete spectrum of protein associations remains limited.We therefore developed a new approach that detects protein associations from identifications obtained after re-processing of largescale, public mass spectrometry-based proteomics data. Our approach infers protein association based on the co-occurrence of proteins across many different proteomics experiments, and provides information that is almost completely complementary to traditional direct protein interaction studies.We here present a web interface to query and explore the associations derived from this method, called the online Tabloid Proteome. The online Tabloid Proteome also integrates biological knowledge from several existing resources to annotate our derived protein associations. The online Tabloid Proteome is freely available through a user-friendly web interface, which provides intuitive navigation and data exploration options for the user at http://iomics.ugent.be/tabloidproteome.",
                "authors": [
                    {
                        "name": "Gupta S."
                    },
                    {
                        "name": "Martens L."
                    },
                    {
                        "name": "Tavernier J."
                    },
                    {
                        "name": "Turan D."
                    }
                ],
                "citationCount": 1,
                "date": "2018-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "The online Tabloid Proteome: An annotated database of protein associations"
            },
            "pmcid": "PMC5753264",
            "pmid": "29040688"
        }
    ],
    "topic": [
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ]
}
