{
    "name": "FEATnotator", 
    "description": "Tool for integrated annotation of sequence features and variation, facilitating interpretation in genomics experiments.", 
    "homepage": "https://sourceforge.net/projects/featnotator/", 
    "biotoolsID": "featnotator", 
    "biotoolsCURIE": "biotools:featnotator", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3661", 
                    "term": "SNP annotation"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0622", 
            "term": "Genomics"
        }, 
        {
            "uri": "http://edamontology.org/topic_3511", 
            "term": "Nucleic acid sites, features and motifs"
        }, 
        {
            "uri": "http://edamontology.org/topic_3175", 
            "term": "DNA structural variation"
        }, 
        {
            "uri": "http://edamontology.org/topic_0097", 
            "term": "Nucleic acid structure analysis"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Mac"
    ], 
    "language": [
        "R", 
        "Perl"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "https://sourceforge.net/projects/featnotator/files/?source=navbar", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1016/J.YMETH.2015.04.028", 
            "pmid": "25934264", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "FEATnotator: A tool for integrated annotation of sequence features and variation, facilitating interpretation in genomics experiments", 
                "abstract": "© 2015 Elsevier Inc. As approaches are sought for more efficient and democratized uses of non-model and expanded model genomics references, ease of integration of genomic feature datasets is especially desirable in multidisciplinary research communities. Valuable conclusions are often missed or slowed when researchers refer experimental results to a single reference sequence that lacks integrated pan-genomic and multi-experiment data in accessible formats. Association of genomic positional information, such as results from an expansive variety of next-generation sequencing experiments, with annotated reference features such as genes or predicted protein binding sites, provides the context essential for conclusions and ongoing research. When the experimental system includes polymorphic genomic inputs, rapid calculation of gene structural and protein translational effects of sequence variation from the reference can be invaluable. Here we present FEATnotator, a lightweight, fast and easy to use open source software program that integrates and reports overlap and proximity in genomic information from any user-defined datasets including those from next generation sequencing applications. We illustrate use of the tool by summarizing whole genome sequence variation of a widely used natural isolate of Arabidopsis thaliana in the context of gene models of the reference accession. Previous discovery of a protein coding deletion influencing root development is replicated rapidly. Appropriate even in investigations of a single gene or genic regions such as QTL, comprehensive reports provided by FEATnotator better prepare researchers for interpretation of their experimental results. The tool is available for download at http://featnotator.sourceforge.net.", 
                "date": "2015-01-01T00:00:00Z", 
                "citationCount": 3, 
                "authors": [
                    {
                        "name": "Podicheti R."
                    }, 
                    {
                        "name": "Mockaitis K."
                    }
                ], 
                "journal": "Methods"
            }
        }
    ], 
    "credit": [
        {
            "name": "Mockaitis K.", 
            "email": "kmockait@indiana.edu", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "d.gabrielaitis", 
    "additionDate": "2018-05-22T16:43:08Z", 
    "lastUpdate": "2018-12-10T12:58:58Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}