{
    "additionDate": "2015-01-29T15:47:50Z",
    "biotoolsCURIE": "biotools:FASTA_EBI",
    "biotoolsID": "FASTA_EBI",
    "collectionID": [
        "EBI Tools",
        "FASTA"
    ],
    "credit": [
        {
            "name": "Web Production",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "Bill Pearson",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "EMBL-EBI",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "name": "University of Virginia",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.ebi.ac.uk/support/"
        },
        {
            "email": "es-request@ebi.ac.uk",
            "name": "Web Production",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Sequence similarity searching against protein databases. FASTX and FASTY translate a DNA query. Optimal searches with SSEARCH (local), GGSEARCH (global) and GLSEARCH (global query, local database).",
    "documentation": [
        {
            "type": [
                "Terms of use"
            ],
            "url": "http://www.ebi.ac.uk/about/terms-of-use"
        },
        {
            "type": [
                "General"
            ],
            "url": "http://www.ebi.ac.uk/Tools/sss/FASTA/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence",
                        "uri": "http://edamontology.org/data_2044"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Sequence similarity search",
                    "uri": "http://edamontology.org/operation_0346"
                },
                {
                    "term": "Sequence comparison",
                    "uri": "http://edamontology.org/operation_2451"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Sequence search results",
                        "uri": "http://edamontology.org/data_0857"
                    }
                }
            ]
        }
    ],
    "homepage": "http://www.ebi.ac.uk/Tools/sss/fasta",
    "lastUpdate": "2019-03-13T14:10:24Z",
    "link": [
        {
            "type": [
                "Helpdesk"
            ],
            "url": "http://www.ebi.ac.uk/support/"
        }
    ],
    "name": "FASTA (EBI)",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "jison",
    "publication": [
        {
            "doi": "10.1016/0888-7543(91)90071-L",
            "metadata": {
                "abstract": "The sensitivity and selectivity of the FASTA and the Smith-Waterman protein sequence comparison algorithms were evaluated using the superfamily classification provided in the National Biomedical Research Foundation/Protein Identification Resource (PIR) protein sequence database. Sequences from each of the 34 superfamilies in the PIR database with 20 or more members were compared against the protein sequence database. The similarity scores of the related and unrelated sequences were determined using either the FASTA program or the Smith-Waterman local similarity algorithm. These two sets of similarity scores were used to evaluate the ability of the two comparison algorithms to identify distantly related protein sequences. The FASTA program using the ktup = 2 sensitivity setting performed as well as the Smith-Waterman algorithm for 19 of the 34 superfamilies. Increasing the sensitivity by setting ktup = 1 allowed FASTA to perform as well as Smith-Waterman on an additional 7 superfamilies. The rigorous Smith-Waterman method performed better than FASTA with ktup = 1 on 8 superfamilies, including the globins, immunoglobulin variable regions, calmodulins, and plastocyanins. Several strategies for improving the sensitivity of FASTA were examined. The greatest improvement in sensitivity was achieved by optimizing a band around the best initial region found for every library sequence. For every superfamily except the globins and immunoglobulin variable regions, this strategy was as sensitive as a full Smith-Waterman. For some sequences, additional sensitivity was achieved by including conserved but nonidentical residues in the lookup table used to identify the initial region. © 1991.",
                "authors": [
                    {
                        "name": "Pearson W.R."
                    }
                ],
                "citationCount": 418,
                "date": "1991-01-01T00:00:00Z",
                "journal": "Genomics",
                "title": "Searching protein sequence libraries: Comparison of the sensitivity and selectivity of the Smith-Waterman and FASTA algorithms"
            },
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/bioinformatics/btw305",
            "metadata": {
                "abstract": "© 2016 The Author 2016. Published by Oxford University Press.Motivation: Over the last decades, vast numbers of sequences were deposited in public databases. Bioinformatics tools allow homology and consequently functional inference for these sequences. New profile-based homology search tools have been introduced, allowing reliable detection of remote homologs, but have not been systematically benchmarked. To provide such a comparison, which can guide bioinformatics workflows, we extend and apply our previously developed benchmark approach to evaluate the 'next generation' of profile-based approaches, including CS-BLAST, HHSEARCH and PHMMER, in comparison with the non-profile based search tools NCBI-BLAST, USEARCH, UBLAST and FASTA. Method: We generated challenging benchmark datasets based on protein domain architectures within either the PFAM + Clan, SCOP/Superfamily or CATH/Gene3D domain definition schemes. From each dataset, homologous and non-homologous protein pairs were aligned using each tool, and standard performance metrics calculated. We further measured congruence of domain architecture assignments in the three domain databases. Results: CSBLAST and PHMMER had overall highest accuracy. FASTA, UBLAST and USEARCH showed large trade-offs of accuracy for speed optimization. Conclusion: Profile methods are superior at inferring remote homologs but the difference in accuracy between methods is relatively small. PHMMER and CSBLAST stand out with the highest accuracy, yet still at a reasonable computational cost. Additionally, we show that less than 0.1% of Swiss-Prot protein pairs considered homologous by one database are considered non-homologous by another, implying that these classifications represent equivalent underlying biological phenomena, differing mostly in coverage and granularity. Availability and Implementation: Benchmark datasets and all scripts are placed at (http://sonnhammer.org/download/Homology-benchmark).",
                "authors": [
                    {
                        "name": "Saripella G.V."
                    },
                    {
                        "name": "Sonnhammer E.L.L."
                    },
                    {
                        "name": "Forslund K."
                    }
                ],
                "citationCount": 6,
                "date": "2016-09-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Benchmarking the next generation of homology inference tools"
            },
            "pmcid": "PMC5013910",
            "pmid": "27256311",
            "type": [
                "Benchmarking study"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "version": [
        "1"
    ]
}