{
    "additionDate": "2019-11-14T18:12:55Z",
    "biotoolsCURIE": "biotools:HetEnc",
    "biotoolsID": "HetEnc",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Leihong.wu@fda.hhs.gov",
            "name": "Leihong Wu",
            "orcidid": "https://orcid.org/0000-0002-4093-3708",
            "typeEntity": "Person"
        }
    ],
    "description": "A deep learning predictive model for multi-type biological dataset | HetEncs: A Deep Learning Classifier for Integrated Gene Expression Analysis",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://github.com/seldas/HetEnc_Code",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-10T08:08:30Z",
    "name": "HetEnc",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12864-019-5997-2",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Researchers today are generating unprecedented amounts of biological data. One trend in current biological research is integrated analysis with multi-platform data. Effective integration of multi-platform data into the solution of a single or multi-task classification problem; however, is critical and challenging. In this study, we proposed HetEnc, a novel deep learning-based approach, for information domain separation. Results: HetEnc includes both an unsupervised feature representation module and a supervised neural network module to handle multi-platform gene expression datasets. It first constructs three different encoding networks to represent the original gene expression data using high-level abstracted features. A six-layer fully-connected feed-forward neural network is then trained using these abstracted features for each targeted endpoint. We applied HetEnc to the SEQC neuroblastoma dataset to demonstrate that it outperforms other machine learning approaches. Although we used multi-platform data in feature abstraction and model training, HetEnc does not need multi-platform data for prediction, enabling a broader application of the trained model by reducing the cost of gene expression profiling for new samples to a single platform. Thus, HetEnc provides a new solution to integrated gene expression analysis, accelerating modern biological research.",
                "authors": [
                    {
                        "name": "Wu L."
                    },
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Xu J."
                    }
                ],
                "citationCount": 3,
                "date": "2019-08-08T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "HetEnc: A deep learning predictive model for multi-type biological dataset"
            },
            "pmcid": "PMC6686264",
            "pmid": "31395005"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1
}