{
    "accessibility": "Open access",
    "additionDate": "2022-06-08T13:42:24.972797Z",
    "biotoolsCURIE": "biotools:tweezepy",
    "biotoolsID": "tweezepy",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ilmorgan@ucsb.edu",
            "name": "Ian L. Morgan",
            "orcidid": "https://orcid.org/0000-0001-6772-6883",
            "typeEntity": "Person"
        },
        {
            "email": "saleh@ucsb.edu",
            "name": "Omar A. Saleh",
            "typeEntity": "Person"
        }
    ],
    "description": "A Python package for calibrating forces in single-molecule video-tracking experiments.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Simulation analysis",
                    "uri": "http://edamontology.org/operation_0244"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ianlmorgan/tweezepy",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-06-08T13:42:24.975535Z",
    "license": "GPL-3.0",
    "name": "Tweezepy",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0262028",
            "metadata": {
                "abstract": "© 2021 Morgan, Saleh. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Single-molecule force spectroscopy (SMFS) instruments (e.g., magnetic and optical tweezers) often use video tracking to measure the three-dimensional position of micron-scale beads under an applied force. The force in these experiments is calibrated by comparing the bead trajectory to a thermal motion-based model with the drag coefficient, γ, and trap spring constant, κ, as parameters. Estimating accurate parameters is complicated by systematic biases from spectral distortions, the camera exposure time, parasitic noise, and least-squares fitting methods. However, while robust calibration methods exist that correct for these biases, they are not always used because they can be complex to implement computationally. To address this barrier, we present Tweezepy: a Python package for calibrating forces in SMFS video-tracking experiments. Tweezepy uses maximum likelihood estimation (MLE) to estimate parameters and their uncertainties from a single bead trajectory via the power spectral density (PSD) and Allan variance (AV). It is well-documented, fast, easy to use, and accounts for most common sources of biases in SMFS video-tracking experiments. Here, we provide a comprehensive overview of Tweezepy’s calibration scheme, including a review of the theory underlying thermal motion-based parameter estimates, a discussion of the PSD, AV, and MLE, and an explanation of their implementation.",
                "authors": [
                    {
                        "name": "Morgan I.L."
                    },
                    {
                        "name": "Saleh O.A."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Tweezepy: A Python package for calibrating forces in single-molecule video-tracking experiments"
            },
            "pmcid": "PMC8719779",
            "pmid": "34972160"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        }
    ]
}
