{
    "additionDate": "2021-12-06T14:46:56.129889Z",
    "biotoolsCURIE": "biotools:tamock",
    "biotoolsID": "tamock",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "thomas.rattei@univie.ac.at",
            "name": "Thomas Rattei",
            "orcidid": "https://orcid.org/0000-0002-0592-7791",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Tamock simulates habitat-specific benchmark data for metagenomic samples. Tamock facilitates the simulation of metagenomic reads according to a microbial community, derived from real metagenomic data. Thus, Tamock simulations enable an assessment of computational methods, workflows and parameters specific for a microbial habitat. Tamock automatically determines taxonomic profiles from shotgun metagenomic data, selects reference genomes accordingly and uses them to simulate metagenomic reads.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sample comparison",
                    "uri": "http://edamontology.org/operation_3731"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                }
            ]
        }
    ],
    "homepage": "https://github.com/gerners/tamock",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2021-12-06T14:46:56.132492Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/gerners/tamock/issues"
        }
    ],
    "name": "Tamock",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04154-Z",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Simulated metagenomic reads are widely used to benchmark software and workflows for metagenome interpretation. The results of metagenomic benchmarks depend on the assumptions about their underlying ecosystems. Conclusions from benchmark studies are therefore limited to the ecosystems they mimic. Ideally, simulations are therefore based on genomes, which resemble particular metagenomic communities realistically. Results: We developed Tamock to facilitate the realistic simulation of metagenomic reads according to a metagenomic community, based on real sequence data. Benchmarks samples can be created from all genomes and taxonomic domains present in NCBI RefSeq. Tamock automatically determines taxonomic profiles from shotgun sequence data, selects reference genomes accordingly and uses them to simulate metagenomic reads. We present an example use case for Tamock by assessing assembly and binning method performance for selected microbiomes. Conclusions: Tamock facilitates automated simulation of habitat-specific benchmark metagenomic data based on real sequence data and is implemented as a user-friendly command-line application, providing extensive additional information along with the simulated benchmark data. Resulting benchmarks enable an assessment of computational methods, workflows, and parameters specifically for a metagenomic habitat or ecosystem of a metagenomic study. Availability: Source code, documentation and install instructions are freely available at GitHub (https://github.com/gerners/tamock).",
                "authors": [
                    {
                        "name": "Gerner S.M."
                    },
                    {
                        "name": "Graf A.B."
                    },
                    {
                        "name": "Rattei T."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Tamock: simulation of habitat-specific benchmark data in metagenomics"
            },
            "pmcid": "PMC8088724",
            "pmid": "33932979",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Script"
    ],
    "topic": [
        {
            "term": "Metagenomic sequencing",
            "uri": "http://edamontology.org/topic_3837"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ]
}
