{
    "accessibility": "Open access",
    "additionDate": "2022-09-07T22:38:18.753962Z",
    "biotoolsCURIE": "biotools:ipvp-drlf",
    "biotoolsID": "ipvp-drlf",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "zouquan@nclab.net",
            "name": "Quan Zou",
            "typeEntity": "Person"
        },
        {
            "name": "Shihu Jiao"
        }
    ],
    "description": "Identification of plant vacuole proteins by exploiting deep representation learning features.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein sequence",
                        "uri": "http://edamontology.org/data_2976"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                },
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                },
                {
                    "term": "Subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                }
            ]
        }
    ],
    "homepage": "http://121.40.214.145:7002",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-09-07T22:38:18.756646Z",
    "license": "Not licensed",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/jiaoshihu/iPVP-DRLF"
        }
    ],
    "name": "iPVP-DRLF",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.CSBJ.2022.06.002",
            "metadata": {
                "abstract": "© 2022 The AuthorsPlant vacuoles are the most important organelles for plant growth, development, and defense, and they play an important role in many types of stress responses. An important function of vacuole proteins is the transport of various classes of amino acids, ions, sugars, and other molecules. Accurate identification of vacuole proteins is crucial for revealing their biological functions. Several automatic and rapid computational tools have been proposed for the subcellular localization of proteins. Regrettably, they are not specific for the identification of plant vacuole proteins. To the best of our knowledge, there is only one computational software specifically trained for plant vacuolar proteins. Although its accuracy is acceptable, the prediction performance and stability of this method in practical applications can still be improved. Hence, in this study, a new predictor named iPVP-DRLF was developed to identify plant vacuole proteins specifically and effectively. This prediction software is designed using the light gradient boosting machine (LGBM) algorithm and hybrid features composed of classic sequence features and deep representation learning features. iPVP-DRLF achieved fivefold cross-validation and independent test accuracy values of 88.25 % and 87.16 %, respectively, both outperforming previous state-of-the-art predictors. Moreover, the blind dataset test results also showed that the performance of iPVP-DRLF was significantly better than the existing tools. The results of comparative experiments confirmed that deep representation learning features have an advantage over other classic sequence features in the identification of plant vacuole proteins. We believe that iPVP-DRLF would serve as an effective computational technique for plant vacuole protein prediction and facilitate related future research. The online server is freely accessible at https://lab.malab.cn/~acy/iPVP-DRLF. In addition, the source code and datasets are also accessible at https://github.com/jiaoshihu/iPVP-DRLF.",
                "authors": [
                    {
                        "name": "Jiao S."
                    },
                    {
                        "name": "Zou Q."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Computational and Structural Biotechnology Journal",
                "title": "Identification of plant vacuole proteins by exploiting deep representation learning features"
            },
            "pmcid": "PMC9207291",
            "pmid": "35765653"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ]
}
