{
    "accessibility": "Open access",
    "additionDate": "2022-11-06T12:51:41.435527Z",
    "biotoolsCURIE": "biotools:group-walk",
    "biotoolsID": "group-walk",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jfre0619@uni.sydney.edu.au",
            "name": "Uri Keich",
            "typeEntity": "Person"
        },
        {
            "email": "uri.keich@sydney.edu.au",
            "name": "Jack Freestone",
            "typeEntity": "Person"
        }
    ],
    "description": "A procedure that uses target-decoy competition (or knockoffs) to reject multiple hypotheses in the presence of group structure. The procedure controls the false discovery rate (FDR) at a user-specified threshold.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                },
                {
                    "term": "Tag-based peptide identification",
                    "uri": "http://edamontology.org/operation_3643"
                },
                {
                    "term": "Target-Decoy",
                    "uri": "http://edamontology.org/operation_3649"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/groupwalk/index.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-11-06T12:51:41.438450Z",
    "license": "MIT",
    "name": "Group-walk",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAC471",
            "metadata": {
                "abstract": "© The Author(s) 2022. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.MOTIVATION: Target-decoy competition (TDC) is a commonly used method for false discovery rate (FDR) control in the analysis of tandem mass spectrometry data. This type of competition-based FDR control has recently gained significant popularity in other fields after Barber and Candès laid its theoretical foundation in a more general setting that included the feature selection problem. In both cases, the competition is based on a head-to-head comparison between an (observed) target score and a corresponding decoy (knockoff) score. However, the effectiveness of TDC depends on whether the data are homogeneous, which is often not the case: in many settings, the data consist of groups with different score profiles or different proportions of true nulls. In such cases, applying TDC while ignoring the group structure often yields imbalanced lists of discoveries, where some groups might include relatively many false discoveries and other groups include relatively very few. On the other hand, as we show, the alternative approach of applying TDC separately to each group does not rigorously control the FDR. RESULTS: We developed Group-walk, a procedure that controls the FDR in the target-decoy/knockoff setting while taking into account a given group structure. Group-walk is derived from the recently developed AdaPT-a general framework for controlling the FDR with side-information. We show using simulated and real datasets that when the data naturally divide into groups with different characteristics Group-walk can deliver consistent power gains that in some cases are substantial. These groupings include the precursor charge state (4% more discovered peptides at 1% FDR threshold), the peptide length (3.6% increase) and the mass difference due to modifications (26% increase). AVAILABILITY AND IMPLEMENTATION: Group-walk is available at https://cran.r-project.org/web/packages/groupwalk/index.html. SUPPLEMENTARY INFORMATION: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Freestone J."
                    },
                    {
                        "name": "Keich U."
                    },
                    {
                        "name": "Noble W.S."
                    },
                    {
                        "name": "Short T."
                    }
                ],
                "date": "2022-09-16T00:00:00Z",
                "journal": "Bioinformatics (Oxford, England)",
                "title": "Group-walk: a rigorous approach to group-wise false discovery rate analysis by target-decoy competition"
            },
            "pmid": "36124786"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
