{
    "accessibility": [],
    "additionDate": "2017-08-03T19:00:08Z",
    "biotoolsCURIE": "biotools:snpscan",
    "biotoolsID": "snpscan",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": "pevsner@kennedykrieger.org",
            "gridid": null,
            "name": null,
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://pevsnerlab.kennedykrieger.org/"
        }
    ],
    "description": "A web-accessible tool for the analysis of single nucleotide polymorphism (SNP) array data.",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "http://pevsnerlab.kennedykrieger.org/php/?q=node/101"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://pevsnerlab.kennedykrieger.org/php/?q=node/101",
    "homepage_status": 0,
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:49Z",
    "license": null,
    "link": [
        {
            "note": null,
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/snpscan-affymetrix-snp-10k-50k-100k-500k-visualization.html"
        }
    ],
    "maturity": null,
    "name": "SNPscan",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": null,
            "metadata": {
                "abstract": "Background: A variety of diseases are caused by chromosomal abnormalities such as aneuploidies (having an abnormal number of chromosomes), microdeletions, microduplications, and uniparental disomy. High density single nucleotide polymorphism (SNP) microarrays provide information on chromosomal copy number changes, as well as genotype (heterozygosity and homozygosity). SNP array studies generate multiple types of data for each SNP site, some with more than 100,000 SNPs represented on each array. The identification of different classes of anomalies within SNP data has been challenging. Results: We have develo ped SNPscan, a web-accessible tool to analyze and visualize high density SNP data. It enables researchers (1) to visually and quantitatively assess the quality of user-generated SNP data relative to a benchmark data set derived from a control population, (2) to display SNP intensity and allelic call data in order to detect chromosomal copy number anomalies (duplications and deletions), (3) to display uniparental isodisomy based on loss of heterozygosity (LOH) across genomic regions, (4) to compare paired samples (e.g. tumor and normal), and (5) to generate a file type for viewing SNP data in the University of California, Santa Cruz (UCSC) Human Genome Browser. SNPscan accepts data exported from Affymetrix Copy Number Analysis Tool as its input. We validated SNPscan using data generated from patients with known deletions, duplications, and uniparental disomy. We also inspected previously generated SNP data from 90 apparently normal individuals from the Centre d'Étude du Polymorphisme Humain (CEPH) collection, and identified three cases of uniparental isodisomy, four females having an apparently mosaic X chromosome, two mislabelled SNP data sets, and one microdeletion on chromosome 2 with mosaicism from an apparently normal female. These previously unrecognized abnormalities were all detected using SNPscan. The microdeletion was independently confirmed by fluorescence in situ hybridization, and a region of homozygosity in a UPD case was confirmed by sequencing of genomic DNA. Conclusion: SNPscan is useful to identify chromosomal abnormalities based on SNP intensity (such as chromosomal copy number changes) and heterozygosity data (including regions of LOH and some cases of UPD). The program and source code are available at the SNPscan website http:// pevsnerlab.kennedykrieger.org/snpscan.htm. © 2006 Ting et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Ting J.C."
                    },
                    {
                        "name": "Ye Y."
                    },
                    {
                        "name": "Thomas G.H."
                    },
                    {
                        "name": "Ruczinski I."
                    },
                    {
                        "name": "Pevsner J."
                    }
                ],
                "citationCount": 29,
                "date": "2006-01-18T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Analysis and visualization of chromosomal abnormalities in SNP data with SNPscan"
            },
            "note": null,
            "pmcid": null,
            "pmid": "16420694",
            "type": null,
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1,
    "version": []
}