{
    "additionDate": "2021-10-11T08:10:38.951370Z",
    "biotoolsCURIE": "biotools:mrcip",
    "biotoolsID": "mrcip",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "wingfung@hku.hk",
            "name": "Wing Kam Fung",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "zhhliu@hku.hk",
            "name": "Zhonghua Liu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "MRCIP is a robust Mendelian randomization method accounting for correlated and idiosyncratic pleiotropy. MRCIP is a Mendelian randomization approach for the inference of the causal effect of an exposure on an outcome of interest based on summary-level GWAS data, which accounts for the correlated pleiotropy and the idiosyncratic pleiotropy.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Scatter plot plotting",
                    "uri": "http://edamontology.org/operation_2940"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/siqixu/MRCIP",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-10-11T08:10:38.954007Z",
    "name": "MRCIP",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAB019",
            "metadata": {
                "abstract": "© The Author(s) 2021. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.Mendelian randomization (MR) is a powerful instrumental variable (IV) method for estimating the causal effect of an exposure on an outcome of interest even in the presence of unmeasured confounding by using genetic variants as IVs. However, the correlated and idiosyncratic pleiotropy phenomena in the human genome will lead to biased estimation of causal effects if they are not properly accounted for. In this article, we develop a novel MR approach named MRCIP to account for correlated and idiosyncratic pleiotropy simultaneously. We first propose a random-effect model to explicitly model the correlated pleiotropy and then propose a novel weighting scheme to handle the presence of idiosyncratic pleiotropy. The model parameters are estimated by maximizing a weighted likelihood function with our proposed PRW-EM algorithm. Moreover, we can also estimate the degree of the correlated pleiotropy and perform a likelihood ratio test for its presence. Extensive simulation studies show that the proposed MRCIP has improved performance over competing methods. We also illustrate the usefulness of MRCIP on two real datasets. The R package for MRCIP is publicly available at https://github.com/siqixu/MRCIP.",
                "authors": [
                    {
                        "name": "Xu S."
                    },
                    {
                        "name": "Fung W.K."
                    },
                    {
                        "name": "Liu Z."
                    }
                ],
                "date": "2021-09-02T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "MRCIP: a robust Mendelian randomization method accounting for correlated and idiosyncratic pleiotropy"
            },
            "pmid": "33704372",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        }
    ]
}