{
    "accessibility": [],
    "additionDate": "2017-12-18T00:07:22Z",
    "biotoolsCURIE": "biotools:hapal",
    "biotoolsID": "hapal",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": null,
            "gridid": null,
            "name": null,
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.stt.msu.edu/~cui/"
        }
    ],
    "description": "R code for mapping HAPlotype-haplotype interactions with Adaptive Lasso.",
    "documentation": [],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://www.stt.msu.edu/~cui/software.html",
    "homepage_status": 0,
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:54Z",
    "license": null,
    "link": [
        {
            "note": null,
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/hapal-mapping-haplotype-haplotype-interactions-with-adaptive-lasso.html"
        }
    ],
    "maturity": null,
    "name": "HAPAL",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "otherID": [],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2156-11-79",
            "metadata": {
                "abstract": "BACKGROUND: The genetic etiology of complex diseases in human has been commonly viewed as a complex process involving both genetic and environmental factors functioning in a complicated manner. Quite often the interactions among genetic variants play major roles in determining the susceptibility of an individual to a particular disease. Statistical methods for modeling interactions underlying complex diseases between single genetic variants (e.g. single nucleotide polymorphisms or SNPs) have been extensively studied. Recently, haplotype-based analysis has gained its popularity among genetic association studies. When multiple sequence or haplotype interactions are involved in determining an individual's susceptibility to a disease, it presents daunting challenges in statistical modeling and testing of the interaction effects, largely due to the complicated higher order epistatic complexity. RESULTS: In this article, we propose a new strategy in modeling haplotype-haplotype interactions under the penalized logistic regression framework with adaptive L1-penalty. We consider interactions of sequence variants between haplotype blocks. The adaptive L1-penalty allows simultaneous effect estimation and variable selection in a single model. We propose a new parameter estimation method which estimates and selects parameters by the modified Gauss-Seidel method nested within the EM algorithm. Simulation studies show that it has low false positive rate and reasonable power in detecting haplotype interactions. The method is applied to test haplotype interactions involved in mother and offspring genome in a small for gestational age (SGA) neonates data set, and significant interactions between different genomes are detected. CONCLUSIONS: As demonstrated by the simulation studies and real data analysis, the approach developed provides an efficient tool for the modeling and testing of haplotype interactions. The implementation of the method in R codes can be freely downloaded from http://www.stt.msu.edu/~cui/software.html.",
                "authors": [
                    {
                        "name": "Li M."
                    },
                    {
                        "name": "Romero R."
                    },
                    {
                        "name": "Fu W.J."
                    },
                    {
                        "name": "Cui Y."
                    }
                ],
                "citationCount": 14,
                "date": "2010-10-28T00:00:00Z",
                "journal": "BMC genetics",
                "title": "Mapping haplotype-haplotype interactions with adaptive LASSO."
            },
            "note": null,
            "pmcid": null,
            "pmid": null,
            "type": "Primary",
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1,
    "version": []
}