{
    "additionDate": "2020-01-14T09:18:16Z",
    "biotoolsCURIE": "biotools:MetaCon",
    "biotoolsID": "MetaCon",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "comin@dei.unipd.it",
            "name": "Matteo Comin",
            "typeEntity": "Person"
        }
    ],
    "description": "unsupervised clustering of metagenomic contigs with probabilistic k-mers statistics and coverage.\n\nMOTIVATION:Sequencing technologies allow the sequencing of microbial communities directly from the environment without prior culturing. Because assembly typically produces only genome fragments, also known as contigs, it is crucial to group them into putative species for further taxonomic profiling and down-streaming functional analysis. Taxonomic analysis of microbial communities requires contig clustering, a process referred to as binning, that is still one of the most challenging tasks when analyzing metagenomic data. The major problems are the lack of taxonomically related genomes in existing reference databases, the uneven abundance ratio of species, sequencing errors, and the limitations due to binning contig of different lengths.\n\n||| HOMEPAGE MISSING!",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                },
                {
                    "term": "Read binning",
                    "uri": "http://edamontology.org/operation_3798"
                },
                {
                    "term": "k-mer counting",
                    "uri": "http://edamontology.org/operation_3472"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31757198",
    "lastUpdate": "2020-01-14T09:18:16Z",
    "name": "MetaCon",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-2904-4",
            "metadata": {
                "abstract": "© 2019 The Author(s).Motivation: Sequencing technologies allow the sequencing of microbial communities directly from the environment without prior culturing. Because assembly typically produces only genome fragments, also known as contigs, it is crucial to group them into putative species for further taxonomic profiling and down-streaming functional analysis. Taxonomic analysis of microbial communities requires contig clustering, a process referred to as binning, that is still one of the most challenging tasks when analyzing metagenomic data. The major problems are the lack of taxonomically related genomes in existing reference databases, the uneven abundance ratio of species, sequencing errors, and the limitations due to binning contig of different lengths. Results: In this context we present MetaCon a novel tool for unsupervised metagenomic contig binning based on probabilistic k-mers statistics and coverage. MetaCon uses a signature based on k-mers statistics that accounts for the different probability of appearance of a k-mer in different species, also contigs of different length are clustered in two separate phases. The effectiveness of MetaCon is demonstrated in both simulated and real datasets in comparison with state-of-Art binning approaches such as CONCOCT, MaxBin and MetaBAT.",
                "authors": [
                    {
                        "name": "Qian J."
                    },
                    {
                        "name": "Comin M."
                    }
                ],
                "date": "2019-11-22T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "MetaCon: Unsupervised clustering of metagenomic contigs with probabilistic k-mers statistics and coverage"
            },
            "pmcid": "PMC6873667",
            "pmid": "31757198"
        }
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        }
    ]
}