{
    "accessibility": [
        "Open access"
    ],
    "additionDate": "2015-12-01T17:31:05Z",
    "biotoolsCURIE": "biotools:mzextract",
    "biotoolsID": "mzextract",
    "collectionID": [
        "NMC",
        "ELIXIR-NL"
    ],
    "confidence_flag": null,
    "cost": "Free of charge",
    "credit": [
        {
            "email": null,
            "gridid": null,
            "name": "ELIXIR-NL",
            "note": null,
            "orcidid": null,
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ],
            "url": null
        },
        {
            "email": null,
            "gridid": null,
            "name": null,
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://metabocloud.com/?Processing_software___Pre-Processing___mzExtract"
        },
        {
            "email": "cmbecker69@gmx.de",
            "gridid": null,
            "name": "Christoph M. Becker",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        }
    ],
    "description": "A new algorithm that enables untargeted metabolomics integration of samples that are measured with high resolution LC-MS.",
    "documentation": [],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Spectral analysis",
                    "uri": "http://edamontology.org/operation_3214"
                }
            ],
            "output": []
        }
    ],
    "homepage": "https://github.com/NetherlandsMetabolomicsCentre/mzextract-website",
    "homepage_status": 0,
    "language": [
        "PHP"
    ],
    "lastUpdate": "2019-07-29T14:59:22Z",
    "license": "GPL-3.0",
    "link": [],
    "maturity": "Mature",
    "name": "mzExtract",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "ELIXIR-NL",
    "publication": [
        {
            "doi": "10.1016/j.aca.2013.09.028",
            "metadata": {
                "abstract": "Because of its high sensitivity and specificity, hyphenated mass spectrometry has become the predominant method to detect and quantify metabolites present in bio-samples relevant for all sorts of life science studies being executed. In contrast to targeted methods that are dedicated to specific features, global profiling acquisition methods allow new unspecific metabolites to be analyzed. The challenge with these so-called untargeted methods is the proper and automated extraction and integration of features that could be of relevance. We propose a new algorithm that enables untargeted integration of samples that are measured with high resolution liquid chromatography-mass spectrometry (LC-MS). In contrast to other approaches limited user interaction is needed allowing also less experienced users to integrate their data. The large amount of single features that are found within a sample is combined to a smaller list of, compound-related, grouped feature-sets representative for that sample. These feature-sets allow for easier interpretation and identification and as important, easier matching over samples. We show that the automatic obtained integration results for a set of known target metabolites match those generated with vendor software but that at least 10 times more feature-sets are extracted as well. We demonstrate our approach using high resolution LC-MS data acquired for 128 samples on a lipidomics platform. The data was also processed in a targeted manner (with a combination of automatic and manual integration) using vendor software for a set of 174 targets. As our untargeted extraction procedure is run per sample and per mass trace the implementation of it is scalable. Because of the generic approach, we envision that this data extraction lipids method will be used in a targeted as well as untargeted analysis of many different kinds of TOF-MS data, even CE- and GC-MS data or MRM. The Matlab package is available for download on request and efforts are directed toward a user-friendly Windows executable. © 2013 Elsevier B.V.",
                "authors": [
                    {
                        "name": "van der Kloet F.M."
                    },
                    {
                        "name": "Hendriks M."
                    },
                    {
                        "name": "Hankemeier T."
                    },
                    {
                        "name": "Reijmers T."
                    }
                ],
                "citationCount": 8,
                "date": "2013-11-01T00:00:00Z",
                "journal": "Analytica Chimica Acta",
                "title": "A new approach to untargeted integration of high resolution liquid chromatography-mass spectrometry data"
            },
            "note": null,
            "pmcid": null,
            "pmid": null,
            "type": "Primary",
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        }
    ],
    "validated": 0,
    "version": [
        "1"
    ]
}