{
    "additionDate": "2019-11-14T20:07:04Z",
    "biotoolsCURIE": "biotools:tract_segmentation",
    "biotoolsID": "tract_segmentation",
    "confidence_flag": "low",
    "description": "> LOW CONFIDENCE! | Combined tract segmentation and orientation mapping for bundle-specific tractography | Automatic White Matter Bundle Segmentation | Tool for fast and accurate white matter bundle segmentation from Diffusion MRI. It can create bundle segmentations, segmentations of the endregions of bundles and Tract Orientation Maps (TOMs). Moreover, it can do tracking on the TOMs creating bundle-specific tractogram and do Tractometry analysis on those | The tool works very well for data similar to the Human Connectome Project. For other MRI datasets it works well for all bundles except for the Commissure Anterior (CA) and the Fornix (FX) which are incomplete sometimes | TractSeg - Fast and accurate white matter tract segmentation (free arxiv version) [NeuroImage 2018]",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                }
            ]
        }
    ],
    "homepage": "https://github.com/MIC-DKFZ/TractSeg",
    "language": [
        "Python"
    ],
    "lastUpdate": "2019-11-14T20:07:04Z",
    "license": "Apache-2.0",
    "name": "tract segmentation",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.MEDIA.2019.101559",
            "metadata": {
                "abstract": "© 2019 The Author(s)While the major white matter tracts are of great interest to numerous studies in neuroscience and medicine, their manual dissection in larger cohorts from diffusion MRI tractograms is time-consuming, requires expert knowledge and is hard to reproduce. In previous work we presented tract orientation mapping (TOM) as a novel concept for bundle-specific tractography. It is based on a learned mapping from the original fiber orientation distribution function (FOD) peaks to tract specific peaks, called tract orientation maps. Each tract orientation map represents the voxel-wise principal orientation of one tract. Here, we present an extension of this approach that combines TOM with accurate segmentations of the tract outline and its start and end region. We also introduce a custom probabilistic tracking algorithm that samples from a Gaussian distribution with fixed standard deviation centered on each peak thus enabling more complete trackings on the tract orientation maps than deterministic tracking. These extensions enable the automatic creation of bundle-specific tractograms with previously unseen accuracy. We show for 72 different bundles on high quality, low quality and phantom data that our approach runs faster and produces more accurate bundle-specific tractograms than 7 state of the art benchmark methods while avoiding cumbersome processing steps like whole brain tractography, non-linear registration, clustering or manual dissection. Moreover, we show on 17 datasets that our approach generalizes well to datasets acquired with different scanners and settings as well as with pathologies. The code of our method is openly available at https://github.com/MIC-DKFZ/TractSeg.",
                "authors": [
                    {
                        "name": "Wasserthal J."
                    },
                    {
                        "name": "Neher P.F."
                    },
                    {
                        "name": "Hirjak D."
                    },
                    {
                        "name": "Maier-Hein K.H."
                    }
                ],
                "date": "2019-12-01T00:00:00Z",
                "journal": "Medical Image Analysis",
                "title": "Combined tract segmentation and orientation mapping for bundle-specific tractography"
            },
            "pmid": "31542711"
        }
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        }
    ]
}