{
    "accessibility": "Open access",
    "additionDate": "2022-04-28T15:42:20.890064Z",
    "biotoolsCURIE": "biotools:emews",
    "biotoolsID": "emews",
    "collectionID": [
        "PerMedCoE"
    ],
    "cost": "Free of charge",
    "description": "The Extreme-scale Model Exploration with Swift (EMEWS) framework enables the direct integration of multi-language model exploration (ME) algorithms while scaling dynamic computational experiments to very large numbers (millions) of models on all major HPC platforms. EMEWS has been designed for any \"black box\" application code, such as agent-based and microsimulation models or training of machine learning models, that require multiple runs as part of heuristic model explorations. One of the main goals of EMEWS is to democratize the use of large-scale computing resources by making them accessible to more researchers in many more science domains. EMEWS is built on the Swift/T parallel scripting language.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://emews.github.io/resources.html"
        }
    ],
    "download": [
        {
            "type": "Downloads page",
            "url": "https://emews.github.io/"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://emews.github.io/",
    "lastUpdate": "2024-11-24T15:19:21.617654Z",
    "name": "EMEWS",
    "owner": "tntiniak",
    "publication": [
        {
            "doi": "10.1039/c9me00036d",
            "metadata": {
                "abstract": "We present an integrated framework for enabling dynamic exploration of design spaces for cancer immunotherapies with detailed dynamical simulation models on high-performance computing resources. Our framework combines PhysiCell, an open source agent-based simulation platform for cancer and other multicellular systems, and EMEWS, an open source platform for extreme-scale model exploration. We build an agent-based model of immunosurveillance against heterogeneous tumours, which includes spatial dynamics of stochastic tumour-immune contact interactions. We implement active learning and genetic algorithms using high-performance computing workflows to adaptively sample the model parameter space and iteratively discover optimal cancer regression regions within biological and clinical constraints.",
                "authors": [
                    {
                        "name": "An G."
                    },
                    {
                        "name": "Collier N."
                    },
                    {
                        "name": "Heiland R."
                    },
                    {
                        "name": "Macklin P."
                    },
                    {
                        "name": "Ozik J."
                    }
                ],
                "citationCount": 31,
                "date": "2019-08-01T00:00:00Z",
                "journal": "Molecular Systems Design and Engineering",
                "title": "Learning-accelerated discovery of immune-tumour interactions"
            },
            "pmcid": "PMC6690424",
            "pmid": "31497314"
        },
        {
            "doi": "10.1186/s12859-018-2508-4",
            "metadata": {
                "abstract": "Background: Current multi-petaflop supercomputers are powerful systems, but present challenges when faced with problems requiring large machine learning workflows. Complex algorithms running at system scale, often with different patterns that require disparate software packages and complex data flows cause difficulties in assembling and managing large experiments on these machines. Results: This paper presents a workflow system that makes progress on scaling machine learning ensembles, specifically in this first release, ensembles of deep neural networks that address problems in cancer research across the atomistic, molecular and population scales. The initial release of the application framework that we call CANDLE/Supervisor addresses the problem of hyper-parameter exploration of deep neural networks. Conclusions: Initial results demonstrating CANDLE on DOE systems at ORNL, ANL and NERSC (Titan, Theta and Cori, respectively) demonstrate both scaling and multi-platform execution.",
                "authors": [
                    {
                        "name": "Balaprakash P."
                    },
                    {
                        "name": "Bauer J."
                    },
                    {
                        "name": "Baughman M."
                    },
                    {
                        "name": "Brettin T."
                    },
                    {
                        "name": "Cardona C.G."
                    },
                    {
                        "name": "Collier N.T."
                    },
                    {
                        "name": "Essen B.V."
                    },
                    {
                        "name": "Jain R."
                    },
                    {
                        "name": "Mohd-Yusof J."
                    },
                    {
                        "name": "Ozik J."
                    },
                    {
                        "name": "Stevens R."
                    },
                    {
                        "name": "Wozniak J.M."
                    },
                    {
                        "name": "Xia F."
                    }
                ],
                "citationCount": 54,
                "date": "2018-12-21T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "CANDLE/Supervisor: A workflow framework for machine learning applied to cancer research"
            },
            "pmcid": "PMC6302440",
            "pmid": "30577736"
        },
        {
            "doi": "10.1186/s12859-018-2510-x",
            "metadata": {
                "abstract": "Background: Cancer is a complex, multiscale dynamical system, with interactions between tumor cells and non-cancerous host systems. Therapies act on this combined cancer-host system, sometimes with unexpected results. Systematic investigation of mechanistic computational models can augment traditional laboratory and clinical studies, helping identify the factors driving a treatment's success or failure. However, given the uncertainties regarding the underlying biology, these multiscale computational models can take many potential forms, in addition to encompassing high-dimensional parameter spaces. Therefore, the exploration of these models is computationally challenging. We propose that integrating two existing technologies-one to aid the construction of multiscale agent-based models, the other developed to enhance model exploration and optimization-can provide a computational means for high-throughput hypothesis testing, and eventually, optimization. Results: In this paper, we introduce a high throughput computing (HTC) framework that integrates a mechanistic 3-D multicellular simulator (PhysiCell) with an extreme-scale model exploration platform (EMEWS) to investigate high-dimensional parameter spaces. We show early results in applying PhysiCell-EMEWS to 3-D cancer immunotherapy and show insights on therapeutic failure. We describe a generalized PhysiCell-EMEWS workflow for high-throughput cancer hypothesis testing, where hundreds or thousands of mechanistic simulations are compared against data-driven error metrics to perform hypothesis optimization. Conclusions: While key notational and computational challenges remain, mechanistic agent-based models and high-throughput model exploration environments can be combined to systematically and rapidly explore key problems in cancer. These high-throughput computational experiments can improve our understanding of the underlying biology, drive future experiments, and ultimately inform clinical practice.",
                "authors": [
                    {
                        "name": "An G."
                    },
                    {
                        "name": "Cockrell C."
                    },
                    {
                        "name": "Collier N."
                    },
                    {
                        "name": "Friedman S.H."
                    },
                    {
                        "name": "Ghaffarizadeh A."
                    },
                    {
                        "name": "Heiland R."
                    },
                    {
                        "name": "Macal C."
                    },
                    {
                        "name": "Macklin P."
                    },
                    {
                        "name": "Ozik J."
                    },
                    {
                        "name": "Wozniak J.M."
                    }
                ],
                "citationCount": 49,
                "date": "2018-12-21T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "High-throughput cancer hypothesis testing with an integrated PhysiCell-EMEWS workflow"
            },
            "pmcid": "PMC6302449",
            "pmid": "30577742"
        },
        {
            "doi": "10.1186/s12859-018-2510-x",
            "metadata": {
                "abstract": "Background: Cancer is a complex, multiscale dynamical system, with interactions between tumor cells and non-cancerous host systems. Therapies act on this combined cancer-host system, sometimes with unexpected results. Systematic investigation of mechanistic computational models can augment traditional laboratory and clinical studies, helping identify the factors driving a treatment's success or failure. However, given the uncertainties regarding the underlying biology, these multiscale computational models can take many potential forms, in addition to encompassing high-dimensional parameter spaces. Therefore, the exploration of these models is computationally challenging. We propose that integrating two existing technologies-one to aid the construction of multiscale agent-based models, the other developed to enhance model exploration and optimization-can provide a computational means for high-throughput hypothesis testing, and eventually, optimization. Results: In this paper, we introduce a high throughput computing (HTC) framework that integrates a mechanistic 3-D multicellular simulator (PhysiCell) with an extreme-scale model exploration platform (EMEWS) to investigate high-dimensional parameter spaces. We show early results in applying PhysiCell-EMEWS to 3-D cancer immunotherapy and show insights on therapeutic failure. We describe a generalized PhysiCell-EMEWS workflow for high-throughput cancer hypothesis testing, where hundreds or thousands of mechanistic simulations are compared against data-driven error metrics to perform hypothesis optimization. Conclusions: While key notational and computational challenges remain, mechanistic agent-based models and high-throughput model exploration environments can be combined to systematically and rapidly explore key problems in cancer. These high-throughput computational experiments can improve our understanding of the underlying biology, drive future experiments, and ultimately inform clinical practice.",
                "authors": [
                    {
                        "name": "An G."
                    },
                    {
                        "name": "Cockrell C."
                    },
                    {
                        "name": "Collier N."
                    },
                    {
                        "name": "Friedman S.H."
                    },
                    {
                        "name": "Ghaffarizadeh A."
                    },
                    {
                        "name": "Heiland R."
                    },
                    {
                        "name": "Macal C."
                    },
                    {
                        "name": "Macklin P."
                    },
                    {
                        "name": "Ozik J."
                    },
                    {
                        "name": "Wozniak J.M."
                    }
                ],
                "citationCount": 49,
                "date": "2018-12-21T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "High-throughput cancer hypothesis testing with an integrated PhysiCell-EMEWS workflow"
            },
            "pmcid": "PMC6302449",
            "pmid": "30577742"
        },
        {
            "doi": "10.1214/19-aoas1279",
            "metadata": {
                "abstract": "Microsimulation models (MSMs) are used to inform policy by predicting population-level outcomes under different scenarios. MSMs simulate individual-level event histories that mark the disease process (such as the development of cancer) and the effect of policy actions (such as screening) on these events. MSMs often have many unknown parameters; calibration is the process of searching the parameter space to select parameters that result in accurate MSM prediction of a wide range of targets. We develop Incremental Mixture Approximate Bayesian Computation (IMABC) for MSM calibration which results in a simulated sample from the posterior distribution of model parameters given calibration targets. IMABC begins with a rejection-based ABC step, drawing a sample of points from the prior distribution of model parameters and accepting points that result in simulated targets that are near observed targets. Next, the sample is iteratively updated by drawing additional points from a mixture of multivariate normal distributions and accepting points that result in accurate predictions. Posterior estimates are obtained by weighting the final set of accepted points to account for the adaptive sampling scheme. We demonstrate IMABC by calibrating CRC-SPIN 2.0, an updated version of a MSM for colorectal cancer (CRC) that has been used to inform national CRC screening guidelines.",
                "authors": [
                    {
                        "name": "Collier N."
                    },
                    {
                        "name": "Deyoreo M."
                    },
                    {
                        "name": "Ozik J."
                    },
                    {
                        "name": "Rutter C.M."
                    }
                ],
                "citationCount": 30,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Annals of Applied Statistics",
                "title": "Microsimulation model calibration using incremental mixture approximate bayesian computation"
            },
            "pmcid": "PMC8534811",
            "pmid": "34691351"
        }
    ],
    "topic": [
        {
            "term": "Computer science",
            "uri": "http://edamontology.org/topic_3316"
        }
    ]
}
