{
    "accessibility": "Open access",
    "additionDate": "2021-10-18T11:13:40.126613Z",
    "biotoolsCURIE": "biotools:astherisc",
    "biotoolsID": "astherisc",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "klamt@mpi-magdeburg.mpg.de",
            "name": "Steffen Klamt",
            "orcidid": "https://orcid.org/0000-0003-2563-7561",
            "typeEntity": "Person"
        }
    ],
    "description": "ASTHERISC (Algorithmic Search of THERmodynamic advantages In stoichiometric Single-species Community models). Designing microbial communities to maximize the thermodynamic driving force for the production of chemicals.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                },
                {
                    "term": "Nucleic acid structure prediction",
                    "uri": "http://edamontology.org/operation_0475"
                },
                {
                    "term": "Nucleic acid thermodynamic property calculation",
                    "uri": "http://edamontology.org/operation_0455"
                }
            ]
        }
    ],
    "homepage": "https://github.com/klamt-lab/astheriscPackage",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-10-18T11:13:40.129278Z",
    "license": "Apache-2.0",
    "name": "ASTHERISC",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1009093",
            "metadata": {
                "abstract": "Copyright: © 2021 Bekiaris, Klamt. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Microbial communities have become a major research focus due to their importance for bio-geochemical cycles, biomedicine and biotechnological applications. While some biotechnological applications, such as anaerobic digestion, make use of naturally arising microbial communities, the rational design of microbial consortia for bio-based production processes has recently gained much interest. One class of synthetic microbial consortia is based on specifically designed strains of one species. A common design principle for these consortia is based on division of labor, where the entire production pathway is divided between the different strains to reduce the metabolic burden caused by product synthesis. We first show that classical division of labor does not automatically reduce the metabolic burden when metabolic flux per biomass is analyzed. We then present ASTHERISC (Algorithmic Search of THERmodynamic advantages in Single-species Communities), a new computational approach for designing multi-strain communities of a single-species with the aim to divide a production pathway between different strains such that the thermodynamic driving force for product synthesis is maximized. ASTHERISC exploits the fact that compartmentalization of segments of a product pathway in different strains can circumvent thermodynamic bottlenecks arising when operation of one reaction requires a metabolite with high and operation of another reaction the same metabolite with low concentration. We implemented the ASTHERISC algorithm in a dedicated program package and applied it on E. coli core and genome-scale models with different settings, for example, regarding number of strains or demanded product yield. These calculations showed that, for each scenario, many target metabolites (products) exist where a multi-strain community can provide a thermodynamic advantage compared to a single strain solution. In some cases, a production with sufficiently high yield is thermodynamically only feasible with a community. In summary, the developed ASTHERISC approach provides a promising new principle for designing microbial communities for the bio-based production of chemicals.",
                "authors": [
                    {
                        "name": "Bekiaris P.S."
                    },
                    {
                        "name": "Klamt S."
                    }
                ],
                "date": "2021-06-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Designing microbial communities to maximize the thermodynamic driving force for the production of chemicals"
            },
            "pmcid": "PMC8232427",
            "pmid": "34129600"
        }
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Biotechnology",
            "uri": "http://edamontology.org/topic_3297"
        }
    ]
}