{
    "additionDate": "2021-01-18T11:51:49Z",
    "biotoolsCURIE": "biotools:evlncrnas",
    "biotoolsID": "evlncrnas",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "yaoqi.zhou@griffith.edu.au",
            "name": "Yaoqi Zhou",
            "typeEntity": "Person"
        },
        {
            "email": "jhw25336@126.com",
            "name": "Jihua Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "EVlncRNAs is a comprehensive, manually curated, high-quality and freely accessible resource of integrated sequence, structure, functional, and phenotypic information of experimentally validated long noncoding RNAs from all species.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Network visualisation",
                    "uri": "http://edamontology.org/operation_3925"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                }
            ]
        }
    ],
    "homepage": "https://www.sdklab-biophysics-dzu.net/EVLncRNAs2/",
    "lastUpdate": "2021-03-08T10:03:23Z",
    "name": "EVLncRNAs",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA1076",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.Long non-coding RNAs (lncRNAs) play important functional roles in many diverse biological processes. However, not all expressed lncRNAs are functional. Thus, it is necessary to manually collect all experimentally validated functional lncRNAs (EVlncRNA) with their sequences, structures, and functions annotated in a central database. The first release of such a database (EVLncRNAs) was made using the literature prior to 1 May 2016. Since then (till 15 May 2020), 19 245 articles related to lncRNAs have been published. In EVLncRNAs 2.0, these articles were manually examined for a major expansion of the data collected. Specifically, the number of annotated EVlncRNAs, associated diseases, lncRNA-disease associations, and interaction records were increased by 260%, 320%, 484% and 537%, respectively. Moreover, the database has added several new categories: 8 lncRNA structures, 33 exosomal lncRNAs, 188 circular RNAs, and 1079 drug-resistant, chemoresistant, and stress-resistant lncRNAs. All records have checked against known retraction and fake articles. This release also comes with a highly interactive visual interaction network that facilitates users to track the underlying relations among lncRNAs, miRNAs, proteins, genes and other functional elements. Furthermore, it provides links to four new bioinformatics tools with improved data browsing and searching functionality. EVLncRNAs 2.0 is freely available at https://www.sdklab-biophysics-dzu.net/ EVLncRNAs2/.",
                "authors": [
                    {
                        "name": "Zhou B."
                    },
                    {
                        "name": "Ji B."
                    },
                    {
                        "name": "Liu K."
                    },
                    {
                        "name": "Hu G."
                    },
                    {
                        "name": "Wang F."
                    },
                    {
                        "name": "Chen Q."
                    },
                    {
                        "name": "Yu R."
                    },
                    {
                        "name": "Huang P."
                    },
                    {
                        "name": "Ren J."
                    },
                    {
                        "name": "Guo C."
                    },
                    {
                        "name": "Zhao H."
                    },
                    {
                        "name": "Zhang H."
                    },
                    {
                        "name": "Zhao D."
                    },
                    {
                        "name": "Li Z."
                    },
                    {
                        "name": "Zeng Q."
                    },
                    {
                        "name": "Yu J."
                    },
                    {
                        "name": "Bian Y."
                    },
                    {
                        "name": "Cao Z."
                    },
                    {
                        "name": "Xu S."
                    },
                    {
                        "name": "Yang Y."
                    },
                    {
                        "name": "Zhou Y."
                    },
                    {
                        "name": "Wang J."
                    }
                ],
                "citationCount": 3,
                "date": "2021-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "EVLncRNAs 2.0: An updated database of manually curated functional long non-coding RNAs validated by low-throughput experiments"
            },
            "pmid": "33221906",
            "type": [
                "Primary"
            ],
            "version": "2.0"
        },
        {
            "doi": "10.1093/nar/gkx677",
            "metadata": {
                "abstract": "© The Author(s) 2017. Published by Oxford University Press on behalf of Nucleic Acids Research.Long non-coding RNAs (lncRNAs) play important functional roles in various biological processes. Early databases were utilized to deposit all lncRNA candidates produced by high-throughput experimental and/or computational techniques to facilitate classification, assessment and validation. As more lncRNAs are validated by low-throughput experiments, several databases were established for experimentally validated lncRNAs. However, these databases are small in scale (with a few hundreds of lncRNAs only) and specific in their focuses (plants, diseases or interactions). Thus, it is highly desirable to have a comprehensive dataset for experimentally validated lncRNAs as a central repository for all of their structures, functions and phenotypes. Here, we established EVLncRNAs by curating lncRNAs validated by low-throughput experiments (up to 1 May 2016) and integrating specific databases (lncRNAdb, LncRANDisease, Lnc2Cancer and PLNIncRBase) with additional functional and disease-specific information not covered previously. The current version of EVLncRNAs contains 1543 lncRNAs from 77 species that is 2.9 times larger than the current largest database for experimentally validated lncRNAs. Seventy-four percent lncRNA entries are partially or completely new, comparing to all existing experimentally validated databases. The established database allows users to browse, search and download as well as to submit experimentally validated lncRNAs. The database is available at http://biophy.dzu.edu.cn/EVLncRNAs.",
                "authors": [
                    {
                        "name": "Zhou B."
                    },
                    {
                        "name": "Zhao H."
                    },
                    {
                        "name": "Yu J."
                    },
                    {
                        "name": "Guo C."
                    },
                    {
                        "name": "Dou X."
                    },
                    {
                        "name": "Song F."
                    },
                    {
                        "name": "Hu G."
                    },
                    {
                        "name": "Cao Z."
                    },
                    {
                        "name": "Qu Y."
                    },
                    {
                        "name": "Yang Y."
                    },
                    {
                        "name": "Zhou Y."
                    },
                    {
                        "name": "Wang J."
                    }
                ],
                "citationCount": 43,
                "date": "2018-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "EVLncRNAs: A manually curated database for long non-coding RNAs validated by low-throughput experiments"
            },
            "pmcid": "PMC5753334",
            "pmid": "28985416",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Bioinformatics portal"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Biophysics",
            "uri": "http://edamontology.org/topic_3306"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        }
    ],
    "version": [
        "2.0"
    ]
}