{
    "additionDate": "2016-02-12T08:12:57Z",
    "biotoolsCURIE": "biotools:spirpro",
    "biotoolsID": "spirpro",
    "collectionID": [
        "KMUTT tools",
        "Proteomics"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "name": "King Mongkut's University of Technology (Thonburi)",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "name": "National Center for Genetic Engineering and Biotechnology",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "name": "KMUTT",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "jittisak.sen@biotec.or.th",
            "name": "Jittisak Senachak",
            "typeRole": [
                "Support"
            ]
        },
        {
            "email": "jittisak.sen@biotec.or.th",
            "name": "Jittisak Senachak",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A Spirulina proteome database and web-based tools for the analysis of protein-protein interactions at the metabolic level in Spirulina (Arthrospira) platensis C1.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://spirpro.sbi.kmutt.ac.th/"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Pathway ID (KEGG)",
                        "uri": "http://edamontology.org/data_2343"
                    }
                },
                {
                    "data": {
                        "term": "Name",
                        "uri": "http://edamontology.org/data_2099"
                    }
                }
            ],
            "note": "Inter-pathway KEGG Pathway Protein-protein interactions between pathways",
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Pathway or network",
                        "uri": "http://edamontology.org/data_2600"
                    },
                    "format": [
                        {
                            "term": "XML",
                            "uri": "http://edamontology.org/format_2332"
                        },
                        {
                            "term": "HTML",
                            "uri": "http://edamontology.org/format_2331"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://spirpro.sbi.kmutt.ac.th",
    "lastUpdate": "2019-03-26T08:39:31Z",
    "name": "SpirPro",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "KMUTT",
    "publication": [
        {
            "doi": "10.1186/s12859-015-0676-z",
            "metadata": {
                "abstract": "© 2015 Senachak et al.Background: Spirulina (Arthrospira) platensis is the only cyanobacterium that in addition to being studied at the molecular level and subjected to gene manipulation, can also be mass cultivated in outdoor ponds for commercial use as a food supplement. Thus, encountering environmental changes, including temperature stresses, is common during the mass production of Spirulina. The use of cyanobacteria as an experimental platform, especially for photosynthetic gene manipulation in plants and bacteria, is becoming increasingly important. Understanding the mechanisms and protein-protein interaction networks that underlie low- and high-temperature responses is relevant to Spirulina mass production. To accomplish this goal, high-throughput techniques such as OMICs analyses are used. Thus, large datasets must be collected, managed and subjected to information extraction. Therefore, databases including (i) proteomic analysis and protein-protein interaction (PPI) data and (ii) domain/motif visualization tools are required for potential use in temperature response models for plant chloroplasts and photosynthetic bacteria. Descriptions: A web-based repository was developed including an embedded database, SpirPro, and tools for network visualization. Proteome data were analyzed integrated with protein-protein interactions and/or metabolic pathways from KEGG. The repository provides various information, ranging from raw data (2D-gel images) to associated results, such as data from interaction and/or pathway analyses. This integration allows in silico analyses of protein-protein interactions affected at the metabolic level and, particularly, analyses of interactions between and within the affected metabolic pathways under temperature stresses for comparative proteomic analysis. The developed tool, which is coded in HTML with CSS/JavaScript and depicted in Scalable Vector Graphics (SVG), is designed for interactive analysis and exploration of the constructed network. SpirPro is publicly available on the web at http://spirpro.sbi.kmutt.ac.th . Conclusions: SpirPro is an analysis platform containing an integrated proteome and PPI database that provides the most comprehensive data on this cyanobacterium at the systematic level. As an integrated database, SpirPro can be applied in various analyses, such as temperature stress response networking analysis in cyanobacterial models and interacting domain-domain analysis between proteins of interest.",
                "authors": [
                    {
                        "name": "Senachak J."
                    },
                    {
                        "name": "Cheevadhanarak S."
                    },
                    {
                        "name": "Hongsthong A."
                    }
                ],
                "citationCount": 10,
                "date": "2015-07-29T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SpirPro: A Spirulina proteome database and web-based tools for the analysis of protein-protein interactions at the metabolic level in Spirulina (Arthrospira) platensis C1"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application",
        "Database portal"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ],
    "validated": 1
}