{
    "additionDate": "2019-11-14T19:52:04Z",
    "biotoolsCURIE": "biotools:AsyRW",
    "biotoolsID": "AsyRW",
    "confidence_flag": "tool",
    "description": "Cross-Species Protein Function Prediction with Asynchronous-Random Walk | Description :This page includes the codes of AsyRW which are implemented and tested on Matlab2015b version by Ms. Zhao (YingWen Zhao, Email: ywzhao@email.swu.edu.cn) and free for academic usage. You can run it at your own risk. For other purposes, please contact the corresponding author Dr. Yu (Guoxian Yu, Email: gxyu@swu.edu.cn). If you have any problem on using these codes, just contact Dr. Yu or Ms. Zhao via Email",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein function prediction",
                    "uri": "http://edamontology.org/operation_1777"
                }
            ]
        }
    ],
    "homepage": "http://mlda.swu.edu.cn/codes.php?name=AsyRW",
    "lastUpdate": "2020-12-02T15:43:48Z",
    "name": "AsyRW",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1109/TCBB.2019.2943342",
            "metadata": {
                "abstract": "© 2004-2012 IEEE.Protein function prediction is a fundamental task in the post-genomic era. Available functional annotations of proteins are incomplete and the annotations of two homologous species are complementary to each other. However, how to effectively leverage mutually complementary annotations of different species to further boost the prediction performance is still not well studied. In this paper, we propose a cross-species protein function prediction approach by performing Asynchronous Random Walk on a heterogeneous network (AsyRW). AsyRW first constructs a heterogeneous network to integrate multiple functional association networks derived from different biological data, established homology-relationships between proteins from different species, known annotations of proteins and Gene Ontology (GO). To account for the intrinsic structures of intra- and inter-species of proteins and that of GO, AsyRW quantifies the individual walk lengths of each network node using the gravity-like theory, and then performs asynchronous-random walk with the individual length to predict associations between proteins and GO terms. Experiments on annotations archived in different years show that individual walk length and asynchronous-random walk can effectively leverage the complementary annotations of different species, AsyRW has a significantly improved performance to other related and competitive methods. The codes of AsyRW are available at: http://mlda.swu.edu.cn/codes.php?name=AsyRW.",
                "authors": [
                    {
                        "name": "Zhao Y."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Guo M."
                    },
                    {
                        "name": "Zhang X."
                    },
                    {
                        "name": "Yu G."
                    }
                ],
                "citationCount": 2,
                "date": "2021-07-01T00:00:00Z",
                "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
                "title": "Cross-Species Protein Function Prediction with Asynchronous-Random Walk"
            },
            "pmid": "31562099"
        }
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Function analysis",
            "uri": "http://edamontology.org/topic_1775"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ],
    "validated": 1
}