{
    "additionDate": "2020-01-14T19:56:45Z",
    "biotoolsCURIE": "biotools:iEnhancer-ECNN",
    "biotoolsID": "iEnhancer-ECNN",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "binh.p.nguyen@vuw.ac.nz",
            "name": "Binh P. Nguyen",
            "typeEntity": "Person"
        },
        {
            "email": "susantorahardja@ieee.org",
            "name": "Susanto Rahardja",
            "typeEntity": "Person"
        }
    ],
    "description": "Identifying enhancers and their strength using ensembles of convolutional neural networks.\n\nBACKGROUND:Enhancers are non-coding DNA fragments which are crucial in gene regulation (e.g. transcription and translation). Having high locational variation and free scattering in 98% of non-encoding genomes, enhancer identification is, therefore, more complicated than other genetic factors. To address this biological issue, several in silico studies have been done to identify and classify enhancer sequences among a myriad of DNA sequences using computational advances. Although recent studies have come up with improved performance, shortfalls in these learning models still remain. To overcome limitations of existing learning models, we introduce iEnhancer-ECNN, an efficient prediction framework using one-hot encoding and k-mers for data transformation and ensembles of convolutional neural networks for model construction, to identify enhancers and classify their strength.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/ngphubinh/enhancers",
    "lastUpdate": "2020-12-14T08:39:05Z",
    "name": "iEnhancer-ECNN",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12864-019-6336-3",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Enhancers are non-coding DNA fragments which are crucial in gene regulation (e.g. transcription and translation). Having high locational variation and free scattering in 98% of non-encoding genomes, enhancer identification is, therefore, more complicated than other genetic factors. To address this biological issue, several in silico studies have been done to identify and classify enhancer sequences among a myriad of DNA sequences using computational advances. Although recent studies have come up with improved performance, shortfalls in these learning models still remain. To overcome limitations of existing learning models, we introduce iEnhancer-ECNN, an efficient prediction framework using one-hot encoding and k-mers for data transformation and ensembles of convolutional neural networks for model construction, to identify enhancers and classify their strength. The benchmark dataset from Liu et al.'s study was used to develop and evaluate the ensemble models. A comparative analysis between iEnhancer-ECNN and existing state-of-the-art methods was done to fairly assess the model performance. Results: Our experimental results demonstrates that iEnhancer-ECNN has better performance compared to other state-of-the-art methods using the same dataset. The accuracy of the ensemble model for enhancer identification (layer 1) and enhancer classification (layer 2) are 0.769 and 0.678, respectively. Compared to other related studies, improvements in the Area Under the Receiver Operating Characteristic Curve (AUC), sensitivity, and Matthews's correlation coefficient (MCC) of our models are remarkable, especially for the model of layer 2 with about 11.0%, 46.5%, and 65.0%, respectively. Conclusions: iEnhancer-ECNN outperforms other previously proposed methods with significant improvement in most of the evaluation metrics. Strong growths in the MCC of both layers are highly meaningful in assuring the stability of our models.",
                "authors": [
                    {
                        "name": "Do T.T.T."
                    },
                    {
                        "name": "Le N.Q.K."
                    },
                    {
                        "name": "Nguyen B.P."
                    },
                    {
                        "name": "Nguyen Q.H."
                    },
                    {
                        "name": "Nguyen-Vo T.-H."
                    },
                    {
                        "name": "Rahardja S."
                    }
                ],
                "citationCount": 11,
                "date": "2019-12-24T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "IEnhancer-ECNN: Identifying enhancers and their strength using ensembles of convolutional neural networks"
            },
            "pmcid": "PMC6929481",
            "pmid": "31874637"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ],
    "validated": 1
}
