
{
    "credit": [
        {
            "email": "dcc-support@icgc.org",
            "name": "ICGC Support",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://docs.icgc.org/portal/about/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Generation",
                    "uri": "http://edamontology.org/operation_3429"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Oncology",
                "uri": "http://edamontology.org/topic_2640"
            },
            {
                "term": "Genetic variation",
                "uri": "http://edamontology.org/topic_0199"
            },
            {
                "term": "Functional, regulatory and non-coding RNA",
                "uri": "http://edamontology.org/topic_0659"
            },
            {
                "term": "Gene transcripts",
                "uri": "http://edamontology.org/topic_3512"
            }
        ]
    },
    "publication": [
        {
            "abstract": "The International Cancer Genome Consortium (ICGC) is a collaborative effort to characterize genomic abnormalities in 50 different cancer types. To make this data available, the ICGC has created the ICGC Data Portal. Powered by the BioMart software, the Data Portal allows each ICGC member institution to manage and maintain its own databases locally, while seamlessly presenting all the data in a single access point for users. The Data Portal currently contains data from 24 cancer projects, including ICGC, The Cancer Genome Atlas (TCGA), Johns Hopkins University, and the Tumor Sequencing Project. It consists of 3478 genomes and 13 cancer types and subtypes. Available open access data types include simple somatic mutations, copy number alterations, structural rearrangements, gene expression, microRNAs, DNA methylation and exon junctions. Additionally, simple germline variations are available as controlled access data. The Data Portal uses a web-based graphical user interface (GUI) to offer researchers multiple ways to quickly and easily search and analyze the available data. The web interface can assist in constructing complicated queries across multiple data sets. Several application programming interfaces are also available for programmatic access. Here we describe the organization, functionality, and capabilities of the ICGC Data Portal. © The Author(s) 2011.",
            "authors": [
                "Zhang J.",
                "Baran J.",
                "Cros A.",
                "Guberman J.M.",
                "Haider S.",
                "Hsu J.",
                "Liang Y.",
                "Rivkin E.",
                "Wang J.",
                "Whitty B.",
                "Wong-Erasmus M.",
                "Yao L.",
                "Kasprzyk A."
            ],
            "cit_count": 176,
            "journal": "Database",
            "pmid": "21930502",
            "title": "International cancer genome consortium data portal-a one-stop shop for cancer genomics data",
            "year": "2011-12-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:icgc_data_portal",
        "biotoolsID": "icgc_data_portal",
        "description": "The International Cancer Genome Consortium (ICGC) is a collaborative effort to characterize genomic abnormalities in 50 different cancer types. Currently has data from 24 cancer projects. Open access data (eg. Somatic mutations, copy number alterations, structural rearrangements, gene expression, miRNAs). Easy to search and analyze data, construct queries across multiple data sets.",
        "homepage": "http://dcc.icgc.org/",
        "name": "ICGC Data Portal"
    }
}