{
    "name": "SICER", 
    "description": "A clustering approach for identification of enriched domains from histone modification ChIP-seq data.", 
    "homepage": "http://home.gwu.edu/%7Ewpeng/Software.htm", 
    "biotoolsID": "sicer", 
    "biotoolsCURIE": "biotools:sicer", 
    "version": [], 
    "otherID": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3187", 
                    "term": "Sequence contamination filtering"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Script"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3169", 
            "term": "ChIP-seq"
        }, 
        {
            "uri": "http://edamontology.org/topic_3173", 
            "term": "Epigenomics"
        }
    ], 
    "operatingSystem": [
        "Linux"
    ], 
    "language": [
        "Python"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": "Mature", 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "https://home.gwu.edu/~wpeng/Software.htm", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "19505939", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "A clustering approach for identification of enriched domains from histone modification ChIP-Seq data", 
                "abstract": "Motivation: Chromatin states are the key to gene regulation and cell identity. Chromatin immunoprecipitation (ChIP) coupled with high-throughput sequencing (ChIP-Seq) is increasingly being used to map epigenetic states across genomes of diverse species. Chromatin modification profiles are frequently noisy and diffuse, spanning regions ranging from several nucleosomes to large domains of multiple genes. Much of the early work on the identification of ChIP-enriched regions for ChIP-Seq data has focused on identifying localized regions, such as transcription factor binding sites. Bioinformatic tools to identify diffuse domains of ChIP-enriched regions have been lacking. Results: Based on the biological observation that histone modifications tend to cluster to form domains, we present a method that identifies spatial clusters of signals unlikely to appear by chance. This method pools together enrichment information from neighboring nucleosomes to increase sensitivity and specificity. By using genomic-scale analysis, as well as the examination of loci with validated epigenetic states, we demonstrate that this method outperforms existing methods in the identification of ChIP-enriched signals for histone modification profiles. We demonstrate the application of this unbiased method in important issues in ChIP-Seq data analysis, such as data normalization for quantitative comparison of levels of epigenetic modifications across cell types and growth conditions. © The Author 2009. Published by Oxford University Press. All rights reserved.", 
                "date": "2009-08-01T00:00:00Z", 
                "citationCount": 489, 
                "authors": [
                    {
                        "name": "Zang C."
                    }, 
                    {
                        "name": "Schones D.E."
                    }, 
                    {
                        "name": "Zeng C."
                    }, 
                    {
                        "name": "Cui K."
                    }, 
                    {
                        "name": "Zhao K."
                    }, 
                    {
                        "name": "Peng W."
                    }
                ], 
                "journal": "Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": "Weiqun Peng", 
            "email": "wpeng@gwu.edu", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "seqwiki_import", 
    "additionDate": "2017-01-13T13:16:29Z", 
    "lastUpdate": "2018-12-10T12:58:56Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0
}