{
    "additionDate": "2017-08-03T18:55:49Z",
    "biotoolsCURIE": "biotools:phylosim",
    "biotoolsID": "phylosim",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.ebi.ac.uk/research/goldman/contact"
        }
    ],
    "description": "Extensible object-oriented framework for the Monte Carlo simulation of sequence evolution written in 100 percent R.",
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/bsipos/phylosim"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree analysis",
                    "uri": "http://edamontology.org/operation_0324"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "http://www.ebi.ac.uk/goldman-srv/phylosim/",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/phylosim-0-17-monte-carlo-simulation-sequence-evolution.html"
        }
    ],
    "name": "PhyloSim",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: The Monte Carlo simulation of sequence evolution is routinely used to assess the performance of phylogenetic inference methods and sequence alignment algorithms. Progress in the field of molecular evolution fuels the need for more realistic and hence more complex simulations, adapted to particular situations, yet current software makes unreasonable assumptions such as homogeneous substitution dynamics or a uniform distribution of indels across the simulated sequences. This calls for an extensible simulation framework written in a high-level functional language, offering new functionality and making it easy to incorporate further complexity.Results: PhyloSim is an extensible framework for the Monte Carlo simulation of sequence evolution, written in R, using the Gillespie algorithm to integrate the actions of many concurrent processes such as substitutions, insertions and deletions. Uniquely among sequence simulation tools, PhyloSim can simulate arbitrarily complex patterns of rate variation and multiple indel processes, and allows for the incorporation of selective constraints on indel events. User-defined complex patterns of mutation and selection can be easily integrated into simulations, allowing PhyloSim to be adapted to specific needs.Conclusions: Close integration with R and the wide range of features implemented offer unmatched flexibility, making it possible to simulate sequence evolution under a wide range of realistic settings. We believe that PhyloSim will be useful to future studies involving simulated alignments. © 2011 Sipos et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Sipos B."
                    },
                    {
                        "name": "Massingham T."
                    },
                    {
                        "name": "Jordan G.E."
                    },
                    {
                        "name": "Goldman N."
                    }
                ],
                "citationCount": 22,
                "date": "2011-04-19T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "PhyloSim - Monte Carlo simulation of sequence evolution in the R statistical computing environment"
            },
            "pmid": "21504561"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Simulation experiment",
            "uri": "http://edamontology.org/topic_3524"
        }
    ],
    "validated": 1
}