{
    "additionDate": "2019-11-14T19:30:40Z",
    "biotoolsCURIE": "biotools:DeepCleave",
    "biotoolsID": "DeepCleave",
    "confidence_flag": "tool",
    "description": "A deep learning predictor for caspase and matrix metalloprotease substrates and cleavage sites | Proteases are enzymes that cleave target substrate proteins by catalyzing the hydrolysis of peptide bonds between specific amino acids. While the functional proteolysis regulated by proteases plays a central role in the 'life and death' process of proteins, many of the corresponding substrates and their cleavage sites were not found yet. Availability of accurate predictors of the substrates and cleavage sites would facilitate understanding of proteases' functions and physiological roles. Deep learning is a promising approach for the development of accurate predictors of substrate cleavage events. RESULTS:We propose DeepCleave, the first deep learning-based predictor of protease-specific substrates and cleavage sites. DeepCleave uses protein substrate sequence data as input and employs convolutional neural networks with transfer learning to train accurate predictive models",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence cleavage",
                    "uri": "http://edamontology.org/operation_0366"
                },
                {
                    "term": "Protein cleavage site prediction",
                    "uri": "http://edamontology.org/operation_0422"
                }
            ]
        }
    ],
    "homepage": "http://deepcleave.erc.monash.edu/",
    "lastUpdate": "2020-12-17T15:44:24Z",
    "name": "DeepCleave",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ721",
            "metadata": {
                "abstract": "© 2020 Oxford University Press. All rights reserved.Motivation: Proteases are enzymes that cleave target substrate proteins by catalyzing the hydrolysis of peptide bonds between specific amino acids. While the functional proteolysis regulated by proteases plays a central role in the 'life and death' cellular processes, many of the corresponding substrates and their cleavage sites were not found yet. Availability of accurate predictors of the substrates and cleavage sites would facilitate understanding of proteases' functions and physiological roles. Deep learning is a promising approach for the development of accurate predictors of substrate cleavage events. Results: We propose DeepCleave, the first deep learning-based predictor of protease-specific substrates and cleavage sites. DeepCleave uses protein substrate sequence data as input and employs convolutional neural networks with transfer learning to train accurate predictive models. High predictive performance of our models stems from the use of high-quality cleavage site features extracted from the substrate sequences through the deep learning process, and the application of transfer learning, multiple kernels and attention layer in the design of the deep network. Empirical tests against several related state-of-the-art methods demonstrate that DeepCleave outperforms these methods in predicting caspase and matrix metalloprotease substrate-cleavage sites.",
                "authors": [
                    {
                        "name": "Li F."
                    },
                    {
                        "name": "Chen J."
                    },
                    {
                        "name": "Leier A."
                    },
                    {
                        "name": "Marquez-Lago T."
                    },
                    {
                        "name": "Liu Q."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Revote J."
                    },
                    {
                        "name": "Smith A.I."
                    },
                    {
                        "name": "Akutsu T."
                    },
                    {
                        "name": "Webb G.I."
                    },
                    {
                        "name": "Kurgan L."
                    },
                    {
                        "name": "Song J."
                    }
                ],
                "citationCount": 23,
                "date": "2020-02-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "DeepCleave: A deep learning predictor for caspase and matrix metalloprotease substrates and cleavage sites"
            },
            "pmid": "31566664"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        }
    ],
    "validated": 1
}