{
    "additionDate": "2017-08-03T18:57:32Z",
    "biotoolsCURIE": "biotools:rca",
    "biotoolsID": "rca",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://erilllab.umbc.edu/"
        }
    ],
    "description": "Relative codon adaptation is a novel index for measuring codon adaptation in genomic sequences. Similar to CAI, it can use a reference geneset to estimate gene expression, but it takes directly into account the background nucleotide distribution.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://erilllab.umbc.edu/research/software/201-2/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Codon usage analysis",
                    "uri": "http://edamontology.org/operation_0286"
                }
            ]
        }
    ],
    "homepage": "http://erilllab.umbc.edu/research/software/201-2/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/rca-relative-codon-adaptation-index.html"
        }
    ],
    "name": "RCA",
    "operatingSystem": [
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "The development of codon bias indices (CBIs) remains an active field of research due to their myriad applications in computational biology. Recently, the relative codon usage bias (RCBS) was introduced as a novel CBI able to estimate codon bias without using a reference set. The results of this new index when applied to Escherichia coli and Saccharomyces cerevisiae led the authors of the original publications to conclude that natural selection favours higher expression and enhanced codon usage optimization in short genes. Here, we show that this conclusion was flawed and based on the systematic oversight of an intrinsic bias for short sequences in the RCBS index and of biases in the small data sets used for validation in E. coli. Furthermore, we reveal that how the RCBS can be corrected to produce useful results and how its underlying principle, which we here term relative codon adaptation (RCA), can be made into a powerful reference-set-based index that directly takes into account the genomic base composition. Finally, we show that RCA outperforms the codon adaptation index (CAI) as a predictor of gene expression when operating on the CAI reference set and that this improvement is significantly larger when analysing genomes with high mutational bias. © 2010 The Author.",
                "authors": [
                    {
                        "name": "Fox J.M."
                    },
                    {
                        "name": "Erill I."
                    }
                ],
                "citationCount": 46,
                "date": "2010-06-01T00:00:00Z",
                "journal": "DNA Research",
                "title": "Relative codon adaptation: A generic codon bias index for prediction of gene expression"
            },
            "pmid": "20453079"
        }
    ],
    "toolType": [
        "Plug-in"
    ],
    "topic": [
        {
            "term": "Molecular genetics",
            "uri": "http://edamontology.org/topic_3321"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ],
    "validated": 1
}