{
    "additionDate": "2021-01-18T09:32:10Z",
    "biotoolsCURIE": "biotools:neuro-learn",
    "biotoolsID": "neuro-learn",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Kai Wu",
            "typeEntity": "Person"
        }
    ],
    "description": "A Solution for Collaborative Pattern Analysis of Neuroimaging Data.\n\nThe code in this repository is no longer under active development since we are focusing on NEURO-LEARN-DOCKER. Please check it out! :-).\n\nNEURO-LEARN is a solution for collaborative pattern analysis of neuroimaging data.\n\nThis documentation contains everything you need to know about NEURO-LEARN, including the core features of the Web platform and how this tool can be utilized to perform collaborative multi-variate pattern analysis on neuroimaging data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://www.github.com/Raniac/NEURO-LEARN/wiki"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://www.github.com/Raniac/NEURO-LEARN",
    "lastUpdate": "2021-03-08T13:46:58Z",
    "license": "Apache-2.0",
    "name": "NEURO-LEARN",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1007/S12021-020-09468-6",
            "metadata": {
                "abstract": "© 2020, Springer Science+Business Media, LLC, part of Springer Nature.The development of neuroimaging instrumentation has boosted neuroscience researches. Consequently, both the fineness and the cost of data acquisition have profoundly increased, leading to the main bottleneck of this field: limited sample size and high dimensionality of neuroimaging data. Therefore, the emphasis of ideas of data pooling and research collaboration has increased over the past decade. Collaborative analysis techniques emerge as the idea developed. In this paper, we present NEURO-LEARN, a solution for collaborative pattern analysis of neuroimaging data. Its collaboration scheme consists of four parts: projects, data, analysis, and reports. While data preparation workflows defined in projects reduce the high dimensionality of neuroimaging data by collaborative computation, pooling of derived data and sharing of pattern analysis workflows along with generated reports on the Web enlarge the sample size and ensure the reliability and reproducibility of pattern analysis. Incorporating this scheme, NEURO-LEARN provides an easy-to-use Web application that allows users from different sites to share projects and processed data, perform pattern analysis, and obtain result reports. We anticipate that this solution will help neuroscientists to enlarge sample size, conquer the curse of dimensionality and conduct reproducible studies on neuroimaging data with efficiency and validity.",
                "authors": [
                    {
                        "name": "Chen J."
                    },
                    {
                        "name": "Ke P."
                    },
                    {
                        "name": "Kong L."
                    },
                    {
                        "name": "Lei B."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Ning Y."
                    },
                    {
                        "name": "Wang K."
                    },
                    {
                        "name": "Wu F."
                    },
                    {
                        "name": "Wu K."
                    },
                    {
                        "name": "Xiang Z."
                    },
                    {
                        "name": "Xiong D."
                    },
                    {
                        "name": "Zhou J."
                    }
                ],
                "citationCount": 1,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Neuroinformatics",
                "title": "NEURO-LEARN: a Solution for Collaborative Pattern Analysis of Neuroimaging Data"
            },
            "pmid": "32524429"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
