{
    "accessibility": "Open access",
    "additionDate": "2019-07-31T18:40:46Z",
    "biotoolsCURIE": "biotools:ImtRDB",
    "biotoolsID": "ImtRDB",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "genkvg@gmail.com",
            "name": "Konstantin Gunbin",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "v.a.shamanskiy@gmail.com",
            "name": "Viktor Shamansky",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Database and software for mitochondrial imperfect interspersed repeats annotation.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bioinfodbs.kantiana.ru/ImtRDB/alg/README.txt"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Repeat sequence analysis",
                    "uri": "http://edamontology.org/operation_0237"
                }
            ]
        }
    ],
    "homepage": "http://bioinfodbs.kantiana.ru/ImtRDB/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:24Z",
    "license": "Unlicense",
    "maturity": "Mature",
    "name": "ImtRDB",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12864-019-5536-1",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Mitochondria is a powerhouse of all eukaryotic cells that have its own circular DNA (mtDNA) encoding various RNAs and proteins. Somatic perturbations of mtDNA are accumulating with age thus it is of great importance to uncover the main sources of mtDNA instability. Recent analyses demonstrated that somatic mtDNA deletions depend on imperfect repeats of various nature between distant mtDNA segments. However, till now there are no comprehensive databases annotating all types of imperfect repeats in numerous species with sequenced complete mitochondrial genome as well as there are no algorithms capable to call all types of imperfect repeats in circular mtDNA. Results: We implemented naïve algorithm of pattern recognition by analogy to standard dot-plot construction procedures allowing us to find both perfect and imperfect repeats of four main types: direct, inverted, mirror and complementary. Our algorithm is adapted to specific characteristics of mtDNA such as circularity and an excess of short repeats - it calls imperfect repeats starting from the length of 10 b.p. We constructed interactive web available database ImtRDB depositing perfect and imperfect repeats positions in mtDNAs of more than 3500 Vertebrate species. Additional tools, such as visualization of repeats within a genome, comparison of repeat densities among different genomes and a possibility to download all results make this database useful for many biologists. Our first analyses of the database demonstrated that mtDNA imperfect repeats (i) are usually short; (ii) associated with unfolded DNA structures; (iii) four types of repeats positively correlate with each other forming two equivalent pairs: direct and mirror versus inverted and complementary, with identical nucleotide content and similar distribution between species; (iv) abundance of repeats is negatively associated with GC content; (v) dinucleotides GC versus CG are overrepresented on light chain of mtDNA covered by repeats. Conclusions: ImtRDB is available at http://bioinfodbs.kantiana.ru/ImtRDB/. It is accompanied by the software calling all types of interspersed repeats with different level of degeneracy in circular DNA. This database and software can become a very useful tool in various areas of mitochondrial and chloroplast DNA research.",
                "authors": [
                    {
                        "name": "Gunbin K.V."
                    },
                    {
                        "name": "Popadin K.Y."
                    },
                    {
                        "name": "Shamanskiy V.N."
                    },
                    {
                        "name": "Timonina V.N."
                    }
                ],
                "citationCount": 3,
                "date": "2019-05-08T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "ImtRDB: A database and software for mitochondrial imperfect interspersed repeats annotation"
            },
            "pmcid": "PMC6614062",
            "pmid": "31284879",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Sequence composition, complexity and repeats",
            "uri": "http://edamontology.org/topic_0157"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
