{
    "additionDate": "2015-07-27T13:12:24Z",
    "biotoolsCURIE": "biotools:bayesmd",
    "biotoolsID": "bayesmd",
    "credit": [
        {
            "name": "binf.ku.dk",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "Man-Hung_Eric.Tang@med.lu.se",
            "name": "Man-Hung Eric Tang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "krogh@binf.ku.dk",
            "name": "Anders Krogh",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "olwi@imm.dtu.dk",
            "name": "Ole Winther",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://cogsys.imm.dtu.dk/staff/winther/"
        }
    ],
    "description": "Flexible, fully Bayesian model for motif discovery consisting of motif, background and alignment modules. It can be customized to different kind of biological applications, e.g. microarray, ChIP-chip, ditag, CAGE data analysis by integrating appropriately chosen features and functionalities.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bayesmd.binf.ku.dk/BayesMDdocumentation.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence motif discovery",
                    "uri": "http://edamontology.org/operation_0238"
                }
            ]
        }
    ],
    "homepage": "http://bayesmd.binf.ku.dk/",
    "lastUpdate": "2019-09-04T08:37:30Z",
    "name": "BayesMD",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1089/cmb.2007.0176",
            "metadata": {
                "abstract": "We present BayesMD, a Bayesian Motif Discovery model with several new features. Three different types of biological a priori knowledge are built into the framework in a modular fashion. A mixture of Dirichlets is used as prior over nucleotide probabilities in binding sites. It is trained on transcription factor (TF) databases in order to extract the typical properties of TF binding sites. In a similar fashion we train organism-specific priors for the background sequences. Lastly, we use a prior over the position of binding sites. This prior represents information complementary to the motif and background priors coming from conservation, local sequence complexity, nucleosome occupancy, etc. and assumptions about the number of occurrences. The Bayesian inference is carried out using a combination of exact marginalization (multinomial parameters) and sampling (over the position of sites). Robust sampling results are achieved using the advanced sampling method parallel tempering. In a post-analysis step candidate motifs with high marginal probability are found by searching among those motifs that contain sites that occur frequently. Thereby, maximum a posteriori inference for the motifs is avoided and the marginal probabilities can be used directly to assess the significance of the findings. The framework is benchmarked against other methods on a number of real and artificial data sets. The accompanying prediction server, documentation, software, models and data are available from http://bayesmd.binf.ku.dk/. © Mary Ann Liebert, Inc. 2008.",
                "authors": [
                    {
                        "name": "Tang M.-H.E."
                    },
                    {
                        "name": "Krogh A."
                    },
                    {
                        "name": "Winther O."
                    }
                ],
                "citationCount": 5,
                "date": "2008-12-01T00:00:00Z",
                "journal": "Journal of Computational Biology",
                "title": "BayesMD: Flexible biological modeling for motif discovery"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}