{
    "additionDate": "2015-01-29T15:44:18Z",
    "biotoolsCURIE": "biotools:picr",
    "biotoolsID": "picr",
    "collectionID": [
        "EBI Tools"
    ],
    "credit": [
        {
            "email": "rcote@ebi.ac.uk",
            "name": "Richard Cote",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "EMBL-EBI",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ],
            "url": "http://www.ebi.ac.uk/"
        },
        {
            "email": "pride-support@ebi.ac.uk",
            "name": "PRIDE support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.ebi.ac.uk/support/"
        }
    ],
    "description": "Protein Identifier Cross Reference service to map proteins by identifiers and sequence.",
    "documentation": [
        {
            "type": "Terms of use",
            "url": "http://www.ebi.ac.uk/about/terms-of-use"
        },
        {
            "type": "General",
            "url": "http://www.ebi.ac.uk/Tools/picr/init.do#documentation"
        },
        {
            "note": "Map accession numbers between databases. It will also retrieve the UPI(UniProt Archive (UniParc) identifier of the given accession number.",
            "type": "API documentation",
            "url": "http://www.ebi.ac.uk/Tools/picr/RESTDocumentation.do"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein accession",
                        "uri": "http://edamontology.org/data_2907"
                    }
                },
                {
                    "data": {
                        "term": "Protein sequence",
                        "uri": "http://edamontology.org/data_2976"
                    }
                }
            ],
            "operation": [
                {
                    "term": "ID mapping",
                    "uri": "http://edamontology.org/operation_3282"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Protein accession",
                        "uri": "http://edamontology.org/data_2907"
                    }
                }
            ]
        }
    ],
    "homepage": "http://www.ebi.ac.uk/Tools/picr/",
    "lastUpdate": "2018-12-10T12:58:55Z",
    "name": "PICR",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "EMBL-EBI",
    "publication": [
        {
            "doi": "10.1186/1471-2105-8-401",
            "metadata": {
                "abstract": "BACKGROUND: Each major protein database uses its own conventions when assigning protein identifiers. Resolving the various, potentially unstable, identifiers that refer to identical proteins is a major challenge. This is a common problem when attempting to unify datasets that have been annotated with proteins from multiple data sources or querying data providers with one flavour of protein identifiers when the source database uses another. Partial solutions for protein identifier mapping exist but they are limited to specific species or techniques and to a very small number of databases. As a result, we have not found a solution that is generic enough and broad enough in mapping scope to suit our needs. RESULTS: We have created the Protein Identifier Cross-Reference (PICR) service, a web application that provides interactive and programmatic (SOAP and REST) access to a mapping algorithm that uses the UniProt Archive (UniParc) as a data warehouse to offer protein cross-references based on 100% sequence identity to proteins from over 70 distinct source databases loaded into UniParc. Mappings can be limited by source database, taxonomic ID and activity status in the source database. Users can copy/paste or upload files containing protein identifiers or sequences in FASTA format to obtain mappings using the interactive interface. Search results can be viewed in simple or detailed HTML tables or downloaded as comma-separated values (CSV) or Microsoft Excel (XLS) files suitable for use in a local database or a spreadsheet. Alternatively, a SOAP interface is available to integrate PICR functionality in other applications, as is a lightweight REST interface. CONCLUSION: We offer a publicly available service that can interactively map protein identifiers and protein sequences to the majority of commonly used protein databases. Programmatic access is available through a standards-compliant SOAP interface or a lightweight REST interface. The PICR interface, documentation and code examples are available at http://www.ebi.ac.uk/Tools/picr.",
                "authors": [
                    {
                        "name": "Cote R.G."
                    },
                    {
                        "name": "Jones P."
                    },
                    {
                        "name": "Martens L."
                    },
                    {
                        "name": "Kerrien S."
                    },
                    {
                        "name": "Reisinger F."
                    },
                    {
                        "name": "Lin Q."
                    },
                    {
                        "name": "Leinonen R."
                    },
                    {
                        "name": "Apweiler R."
                    },
                    {
                        "name": "Hermjakob H."
                    }
                ],
                "citationCount": 90,
                "date": "2007-01-01T00:00:00Z",
                "journal": "BMC bioinformatics",
                "title": "The Protein Identifier Cross-Referencing (PICR) service: reconciling protein identifiers across multiple source databases."
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Data identity and mapping",
            "uri": "http://edamontology.org/topic_3345"
        },
        {
            "term": "Data management",
            "uri": "http://edamontology.org/topic_3071"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}