{
    "accessibility": "Open access",
    "additionDate": "2022-12-27T19:14:05.687307Z",
    "biotoolsCURIE": "biotools:choirbm",
    "biotoolsID": "choirbm",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "smackey@stanford.edu",
            "name": "Sean Mackey",
            "typeEntity": "Person"
        }
    ],
    "description": "An R package for exploratory data analysis and interactive visualization of pain patient body map data.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://www.github.com/emcramer/CHOIRBM",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-12-27T19:14:05.689950Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://cran.r-project.org/web/packages/CHOIRBM/"
        }
    ],
    "name": "CHOIRBM",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1010496",
            "metadata": {
                "abstract": "Copyright: © 2022 Cramer et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Body maps are commonly used to capture the location of a patient’s pain and thus reflect the extent of pain throughout the body. With increasing electronic capture body map information, there is an emerging need for clinic- and research-ready tools capable of visualizing this data on individual and mass scales. Here we propose CHOIRBM, an extensible and modular R package and companion web application built on the grammar of graphics system. CHOIRBM provides functions that simplify the process of analyzing and plotting patient body map data integrated from the CHOIR Body Map (CBM) at both individual patient and large-dataset levels. CHOIRBM is built on the popular R graphics package, ggplot2, which facilitates further development and addition of functionality by the open-source development community as future requirements arise. The CHOIRBM package is distributed under the terms of the MIT license and is available on CRAN. The development version of the package with the latest functions may be installed from GitHub. Example analysis using CHOIRBM demonstrates the functionality of the modular R package and highlights both the clinical and research utility of efficiently producing CBM visualizations.",
                "authors": [
                    {
                        "name": "Cramer E."
                    },
                    {
                        "name": "Kao M.-C."
                    },
                    {
                        "name": "Mackey S."
                    },
                    {
                        "name": "Scherrer K.H."
                    },
                    {
                        "name": "Ziadni M."
                    }
                ],
                "date": "2022-10-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "CHOIRBM: An R package for exploratory data analysis and interactive visualization of pain patient body map data"
            },
            "pmcid": "PMC9612541",
            "pmid": "36301800"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Pain medicine",
            "uri": "http://edamontology.org/topic_3401"
        }
    ]
}
