{
    "additionDate": "2018-05-19T15:30:46Z",
    "biotoolsCURIE": "biotools:simba",
    "biotoolsID": "simba",
    "credit": [
        {
            "email": "vasco@icb.ufmg.br",
            "name": "Vasco A. C. Azevedo",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Web interface for managing assembly projects of bacterial genomes. It was created to assist bioinformaticians to assemble bacterial genomes sequenced with NextGeneration Sequencing (NGS) platforms quickly, easily and effectively.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://ufmg-simba.sourceforge.net/documentation.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Nucleic acid sequence analysis",
                    "uri": "http://edamontology.org/operation_2478"
                }
            ]
        }
    ],
    "homepage": "http://ufmg-simba.sourceforge.net/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "SIMBA",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1186/S12859-016-1344-7",
            "metadata": {
                "abstract": "© 2016 The Author(s).Background: The evolution of Next-Generation Sequencing (NGS) has considerably reduced the cost per sequenced-base, allowing a significant rise of sequencing projects, mainly in prokaryotes. However, the range of available NGS platforms requires different strategies and software to correctly assemble genomes. Different strategies are necessary to properly complete an assembly project, in addition to the installation or modification of various software. This requires users to have significant expertise in these software and command line scripting experience on Unix platforms, besides possessing the basic expertise on methodologies and techniques for genome assembly. These difficulties often delay the complete genome assembly projects. Results: In order to overcome this, we developed SIMBA (SImple Manager for Bacterial Assemblies), a freely available web tool that integrates several component tools for assembling and finishing bacterial genomes. SIMBA provides a friendly and intuitive user interface so bioinformaticians, even with low computational expertise, can work under a centralized administrative control system of assemblies managed by the assembly center head. SIMBA guides the users to execute assembly process through simple and interactive pages. SIMBA workflow was divided in three modules: (i) projects: allows a general vision of genome sequencing projects, in addition to data quality analysis and data format conversions; (ii) assemblies: allows de novo assemblies with the software Mira, Minia, Newbler and SPAdes, also assembly quality validations using QUAST software; and (iii) curation: presents methods to finishing assemblies through tools for scaffolding contigs and close gaps. We also presented a case study that validated the efficacy of SIMBA to manage bacterial assemblies projects sequenced using Ion Torrent PGM. Conclusion: Besides to be a web tool for genome assembly, SIMBA is a complete genome assemblies project management system, which can be useful for managing of several projects in laboratories. SIMBA source code is available to download and install in local webservers at http://ufmg-simba.sourceforge.net.",
                "authors": [
                    {
                        "name": "Mariano D.C.B."
                    },
                    {
                        "name": "Pereira F.L."
                    },
                    {
                        "name": "Aguiar E.L."
                    },
                    {
                        "name": "Oliveira L.C."
                    },
                    {
                        "name": "Benevides L."
                    },
                    {
                        "name": "Guimaraes L.C."
                    },
                    {
                        "name": "Folador E.L."
                    },
                    {
                        "name": "Sousa T.J."
                    },
                    {
                        "name": "Ghosh P."
                    },
                    {
                        "name": "Barh D."
                    },
                    {
                        "name": "Figueiredo H.C.P."
                    },
                    {
                        "name": "Silva A."
                    },
                    {
                        "name": "Ramos R.T.J."
                    },
                    {
                        "name": "Azevedo V.A.C."
                    }
                ],
                "citationCount": 7,
                "date": "2016-12-15T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SIMBA: A web tool for managing bacterial genome assembly generated by Ion PGM sequencing technology"
            },
            "pmcid": "PMC5249034",
            "pmid": "28105921",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}