{
    "additionDate": "2018-07-30T12:28:24Z",
    "biotoolsCURIE": "biotools:tripal_elasticsearch",
    "biotoolsID": "tripal_elasticsearch",
    "credit": [
        {
            "email": "mstaton1@utk.edu",
            "name": "Margaret Staton",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The module allows you to easily manage the indexing and display of Elasticsearch on your Tripal website. It also easily enables Cross-Site Querying, allowing you to connect to other Tripal sites and provide additional search results to your users.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/tripal/tripal_elasticsearch/blob/master/docs/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Service composition",
                    "uri": "http://edamontology.org/operation_3762"
                }
            ]
        }
    ],
    "homepage": "https://github.com/tripal/tripal_elasticsearch",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "license": "GPL-3.0",
    "name": "Tripal Elasticsearch",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/database/bax052",
            "metadata": {
                "abstract": "© The Author(s) 2017. Published by Oxford University Press.Tripal is an open source software package for developing biological databases with a focus on genetic and genomic data. It consists of a set of core modules that deliver essential functions for loading and displaying data records and associated attributes including organisms, sequence features and genetic markers. Beyond the core modules, community members are encouraged to contribute extension modules to build on the Tripal core and to customize Tripal for individual community needs. To expand the utility of the Tripal software system, particularly for RNASeq data, we developed two new extension modules. Tripal Elasticsearch enables fast, scalable searching of the entire content of a Tripal site as well as the construction of customized advanced searches of specific data types. We demonstrate the use of this module for searching assembled transcripts by functional annotation. A second module, Tripal Analysis Expression, houses and displays records from gene expression assays such as RNA sequencing. This includes biological source materials (biomaterials), gene expression values and protocols used to generate the data. In the case of an RNASeq experiment, this would reflect the individual organisms and tissues used to produce sequencing libraries, the normalized gene expression values derived from the RNASeq data analysis and a description of the software or code used to generate the expression values. The module will load data from common flat file formats including standard NCBI Biosample XML. Data loading, display options and other configurations can be controlled by authorized users in the Drupal administrative backend. Both modules are open source, include usage documentation, and can be found in the Tripal organization’s GitHub repository.",
                "authors": [
                    {
                        "name": "Chen M."
                    },
                    {
                        "name": "Henry N."
                    },
                    {
                        "name": "Almsaeed A."
                    },
                    {
                        "name": "Zhou X."
                    },
                    {
                        "name": "Wegrzyn J."
                    },
                    {
                        "name": "Ficklin S."
                    },
                    {
                        "name": "Staton M."
                    }
                ],
                "citationCount": 8,
                "date": "2017-01-01T00:00:00Z",
                "journal": "Database",
                "title": "New extension software modules to enhance searching and display of transcriptome data in Tripal databases"
            },
            "pmcid": "PMC5532966",
            "pmid": "29220446"
        }
    ],
    "toolType": [
        "Plug-in"
    ],
    "topic": [
        {
            "term": "Data management",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        }
    ]
}