{
    "additionDate": "2019-11-14T18:10:35Z",
    "biotoolsCURIE": "biotools:NJMerge",
    "biotoolsID": "NJMerge",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "emolloy2@illinois.edu",
            "name": "Erin K. Molloy",
            "orcidid": "https://orcid.org/0000-0001-5553-3312",
            "typeEntity": "Person"
        }
    ],
    "description": "Statistically consistent divide-and-conquer pipelines for phylogeny estimation using NJMerge | A tool for divide-and-conquer tree estimation via a shared distance matrix | NJMerge is a tool for scaling phylogengy estimation methods to large datasets. NJMerge can be used in a divide-and-conquer framework as follows: 1) divide the species set into disjoint subsets, 2) construct trees on each subset, and 3) combine the subset trees using an associated distance matrix (on the full species set). NJMerge has been sucessfully tested in the context of species tree estimation (Molloy and Warnow, 2018)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic species tree construction",
                    "uri": "http://edamontology.org/operation_0544"
                },
                {
                    "term": "Phylogenetic tree generation (minimum distance methods)",
                    "uri": "http://edamontology.org/operation_0546"
                },
                {
                    "term": "Phylogenetic tree generation (quartet methods)",
                    "uri": "http://edamontology.org/operation_0548"
                }
            ]
        }
    ],
    "homepage": "http://github.com/ekmolloy/njmerge",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-04T08:28:42Z",
    "name": "NJMerge",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S13015-019-0151-X",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Divide-and-conquer methods, which divide the species set into overlapping subsets, construct a tree on each subset, and then combine the subset trees using a supertree method, provide a key algorithmic framework for boosting the scalability of phylogeny estimation methods to large datasets. Yet the use of supertree methods, which typically attempt to solve NP-hard optimization problems, limits the scalability of such approaches. Results: In this paper, we introduce a divide-and-conquer approach that does not require supertree estimation: we divide the species set into pairwise disjoint subsets, construct a tree on each subset using a base method, and then combine the subset trees using a distance matrix. For this merger step, we present a new method, called NJMerge, which is a polynomial-time extension of Neighbor Joining (NJ); thus, NJMerge can be viewed either as a method for improving traditional NJ or as a method for scaling the base method to larger datasets. We prove that NJMerge can be used to create divide-and-conquer pipelines that are statistically consistent under some models of evolution. We also report the results of an extensive simulation study evaluating NJMerge on multi-locus datasets with up to 1000 species. We found that NJMerge sometimes improved the accuracy of traditional NJ and substantially reduced the running time of three popular species tree methods (ASTRAL-III, SVDquartets, and \"concatenation\" using RAxML) without sacrificing accuracy. Finally, although NJMerge can fail to return a tree, in our experiments, NJMerge failed on only 11 out of 2560 test cases. Conclusions: Theoretical and empirical results suggest that NJMerge is a valuable technique for large-scale phylogeny estimation, especially when computational resources are limited. NJMerge is freely available on Github (http://github.com/ekmolloy/njmerge).",
                "authors": [
                    {
                        "name": "Molloy E.K."
                    },
                    {
                        "name": "Warnow T."
                    }
                ],
                "citationCount": 4,
                "date": "2019-07-19T00:00:00Z",
                "journal": "Algorithms for Molecular Biology",
                "title": "Statistically consistent divide-and-conquer pipelines for phylogeny estimation using NJMerge"
            },
            "pmcid": "PMC6642500",
            "pmid": "31360216"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Phylogenomics",
            "uri": "http://edamontology.org/topic_0194"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
