{
    "additionDate": "2021-12-06T08:04:19.170561Z",
    "biotoolsCURIE": "biotools:signal",
    "biotoolsID": "signal",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "fraseri@nih.gov",
            "name": "Iain D.C. Fraser",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "SIGNAL (Selection by Iterative pathway Group and Network Analysis Looping) is a web-based iterative analysis platform integrating pathway and network approaches optimizes hit selection from genome-scale assays.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Pathway analysis",
                    "uri": "http://edamontology.org/operation_3928"
                }
            ]
        }
    ],
    "homepage": "https://signal.niaid.nih.gov",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T20:15:06.185688Z",
    "name": "SIGNAL",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/j.cels.2021.03.001",
            "metadata": {
                "abstract": "Hit selection from high-throughput assays remains a critical bottleneck in realizing the potential of omic-scale studies in biology. Widely used methods such as setting of cutoffs, prioritizing pathway enrichments, or incorporating predicted network interactions offer divergent solutions yet are associated with critical analytical trade-offs. The specific limitations of these individual approaches and the lack of a systematic way by which to integrate their rankings have contributed to limited overlap in the reported results from comparable genome-wide studies and costly inefficiencies in secondary validation efforts. Using comparative analysis of parallel independent studies as a benchmark, we characterize the specific complementary contributions of each approach and demonstrate an optimal framework to integrate these methods. We describe selection by iterative pathway group and network analysis looping (SIGNAL), an integrated, iterative approach that uses both pathway and network methods to optimize gene prioritization. SIGNAL is accessible as a rapid user-friendly web-based application (https://signal.niaid.nih.gov). A record of this paper's transparent peer review is included in the Supplemental information.",
                "authors": [
                    {
                        "name": "Bryant C.E."
                    },
                    {
                        "name": "Fraser I.D.C."
                    },
                    {
                        "name": "Katz S."
                    },
                    {
                        "name": "Lounsbury N.W."
                    },
                    {
                        "name": "Song J."
                    },
                    {
                        "name": "Webb K.P."
                    }
                ],
                "citationCount": 6,
                "date": "2021-04-21T00:00:00Z",
                "journal": "Cell systems",
                "title": "SIGNAL: A web-based iterative analysis platform integrating pathway and network approaches optimizes hit selection from genome-scale assays"
            },
            "pmcid": "PMC7613048",
            "pmid": "33894945",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}
