{
    "accessibility": "Open access",
    "additionDate": "2023-10-23T13:56:00.275877Z",
    "biotoolsCURIE": "biotools:get_homologues",
    "biotoolsID": "get_homologues",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "bcontreras@eead.csic.es",
            "name": "Bruno Contreras Moreira",
            "orcidid": "https://orcid.org/0000-0002-5462-907X"
        },
        {
            "email": "vinuesa@ccg.unam.mx",
            "name": "Pablo Vinuesa",
            "orcidid": "https://orcid.org/0000-0001-6119-2956"
        }
    ],
    "description": "A versatile software package for pan-genome analysis, including GET_HOMOLOGUES and GET_HOMOLOGUES-EST",
    "documentation": [
        {
            "note": "Manual for GET_HOMOLOGUES-EST",
            "type": [
                "User manual"
            ],
            "url": "http://eead-csic-compbio.github.io/get_homologues/manual-est/"
        },
        {
            "note": "The pangenome of a species is the sum of the genomes of its individuals. As coding sequences often represent only a small fraction of each genome, analyzing the pangene set can be a cost-effective strategy for plants with large genomes or highly heterozygous species. Here we describe a step-by-step protocol to analyze plant pangene sets with the software GET_HOMOLOGUES-EST. After a short introduction, where the main concepts are illustrated, the remaining sections cover the installation and typical operations required to analyze and annotate pantranscriptomes and gene sets of plants. The recipes include instructions on how to call core and accessory genes, how to compute a presence-absence pangenome matrix and how to identify and analyze private genes, present only in some genotypes. Downstream phylogenetic analyses are also discussed.",
            "type": [
                "Training material"
            ],
            "url": "http://eead-csic-compbio.github.io/get_homologues/plant_pangenome/protocol.html"
        },
        {
            "note": "This tutorial illustrates how to analyze pan-genomes using GET_HOMOLOGUES and GET_HOMOLOGUES-EST. After a short introduction, where the main concepts are illustrated, the remaining sections cover the installation and typical operations required to analyze and annotate genomes and transcriptomes from a pan-genome perspective, in which individuals or species contribute genetic material to a pool.",
            "type": [
                "Training material"
            ],
            "url": "http://eead-csic-compbio.github.io/get_homologues/tutorial/pangenome_tutorial.html"
        },
        {
            "type": [
                "User manual"
            ],
            "url": "http://eead-csic-compbio.github.io/get_homologues/manual/"
        }
    ],
    "download": [
        {
            "note": "Conda package",
            "type": "Other",
            "url": "https://bioconda.github.io/recipes/get_homologues/README.html"
        },
        {
            "type": "Container file",
            "url": "https://hub.docker.com/r/csicunam/get_homologues"
        },
        {
            "type": "Downloads page",
            "url": "https://github.com/eead-csic-compbio/get_homologues/releases"
        },
        {
            "type": "Source code",
            "url": "https://github.com/eead-csic-compbio/get_homologues"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "elixirNode": [
        "Spain"
    ],
    "elixirPlatform": [
        "Tools"
    ],
    "homepage": "https://github.com/eead-csic-compbio/get_homologues",
    "lastUpdate": "2024-11-24T14:37:02.179078Z",
    "license": "Other",
    "link": [
        {
            "note": "Conda package",
            "type": [
                "Other"
            ],
            "url": "https://bioconda.github.io/recipes/get_homologues/README.html"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/eead-csic-compbio/get_homologues"
        }
    ],
    "maturity": "Mature",
    "name": "GET_HOMOLOGUES",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "brunocontreras",
    "publication": [
        {
            "doi": "10.1128/aem.02411-13",
            "metadata": {
                "abstract": "GET_HOMOLOGUES is an open-source software package that builds on popular orthology-calling approaches making highly customizable and detailed pangenome analyses of microorganisms accessible to nonbioinformaticians. It can cluster homologous gene families using the bidirectional best-hit, COGtriangles, or OrthoMCL clustering algorithms. Clustering stringency can be adjusted by scanning the domain composition of proteins using the HMMER3 package, by imposing desired pairwise alignment coverage cutoffs, or by selecting only syntenic genes. The resulting homologous gene families can be made even more robust by computing consensus clusters from those generated by any combination of the clustering algorithms and filtering criteria. Auxiliary scripts make the construction, interrogation, and graphical display of core genome and pangenome sets easy to perform. Exponential and binomial mixture models can be fitted to the data to estimate theoretical core genome and pangenome sizes, and high-quality graphics can be generated. Furthermore, pangenome trees can be easily computed and basic comparative genomics performed to identify lineage-specific genes or gene family expansions. The software is designed to take advantage of modern multiprocessor personal computers as well as computer clusters to parallelize time-consuming tasks. To demonstrate some of these capabilities, we survey a set of 50 Streptococcus genomes annotated in the Orthologous Matrix (OMA) browser as a benchmark case. The package can be downloaded at http://www.eead.csic.es/compbio/soft/gethoms.php and http://maya.ccg.unam.mx/soft/gethoms.php. © 2013, American Society for Microbiology.",
                "authors": [
                    {
                        "name": "Contreras-Moreira B."
                    },
                    {
                        "name": "Vinuesa P."
                    }
                ],
                "citationCount": 644,
                "date": "2013-12-01T00:00:00Z",
                "journal": "Applied and Environmental Microbiology",
                "title": "GET_HOMOLOGUES, a versatile software package for scalable and robust microbial pangenome analysis"
            },
            "pmcid": "PMC3837814",
            "pmid": "24096415",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.3389/fpls.2017.00184",
            "metadata": {
                "abstract": "The pan-genome of a species is defined as the union of all the genes and noncoding sequences found in all its individuals. However, constructing a pan-genome for plants with large genomes is daunting both in sequencing cost and the scale of the required computational analysis. A more affordable alternative is to focus on the genic repertoire by using transcriptomic data. Here, the software GET_HOMOLOGUES-EST was benchmarked with genomic and RNA-seq data of 19 Arabidopsis thaliana ecotypes and then applied to the analysis of transcripts from 16 Hordeum vulgare genotypes. The goal was to sample their pan-genomes and classify sequences as core, if detected in all accessions, or accessory, when absent in some of them. The resulting sequence clusters were used to simulate pan-genome growth, and to compile Average Nucleotide Identity matrices that summarize intra-species variation. Although transcripts were found to under-estimate pan-genome size by at least 10%, we concluded that clusters of expressed sequences can recapitulate phylogeny and reproduce two properties observed in A. thaliana gene models: accessory loci show lower expression and higher non-synonymous substitution rates than core genes. Finally, accessory sequences were observed to preferentially encode transposon components in both species, plus disease resistance genes in cultivated barleys, and a variety of protein domains from other families that appear frequently associated with presence/absence variation in the literature. These results demonstrate that pan-genome analyses are useful to explore germplasm diversity.",
                "authors": [
                    {
                        "name": "Cantalapiedra C.P."
                    },
                    {
                        "name": "Casas A.M."
                    },
                    {
                        "name": "Contreras-Moreira B."
                    },
                    {
                        "name": "Garcia-Pereira M.J."
                    },
                    {
                        "name": "Gordon S.P."
                    },
                    {
                        "name": "Igartua E."
                    },
                    {
                        "name": "Vinuesa P."
                    },
                    {
                        "name": "Vogel J.P."
                    }
                ],
                "citationCount": 58,
                "date": "2017-02-14T00:00:00Z",
                "journal": "Frontiers in Plant Science",
                "title": "Analysis of plant pan-genomes and transcriptomes with GET_HOMOLOGUES-EST, a clustering solution for sequences of the same species"
            },
            "pmcid": "PMC5306281",
            "pmid": "28261241",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1007/978-1-0716-2429-6_9",
            "metadata": {
                "abstract": "The pangenome of a species is the sum of the genomes of its individuals. As coding sequences often represent only a small fraction of each genome, analyzing the pangene set can be a cost-effective strategy for plants with large genomes or highly heterozygous species. Here, we describe a step-by-step protocol to analyze plant pangene sets with the software GET_HOMOLOGUES-EST. After a short introduction, where the main concepts are illustrated, the remaining sections cover the installation and typical operations required to analyze and annotate pantranscriptomes and gene sets of plants. The recipes include instructions on how to call core and accessory genes, how to compute a presence–absence pangenome matrix, and how to identify and analyze private genes, present only in some genotypes. Downstream phylogenetic analyses are also discussed.",
                "authors": [
                    {
                        "name": "Cantalapiedra C.P."
                    },
                    {
                        "name": "Contreras-Moreira B."
                    },
                    {
                        "name": "Sancho R."
                    },
                    {
                        "name": "Vinuesa P."
                    },
                    {
                        "name": "del Rio A.R."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Methods in Molecular Biology",
                "title": "Pangenome Analysis of Plant Transcripts and Coding Sequences"
            },
            "pmid": "35818004",
            "type": [
                "Usage"
            ]
        },
        {
            "doi": "10.1007/978-1-4939-1720-4_14",
            "metadata": {
                "abstract": "GET_HOMOLOGUES is an open-source software package written in Perl and R to define robust core- and pan-genomes by computing consensus clusters of orthologous gene families from whole-genome sequences using the bidirectional best-hit, COGtriangles, and OrthoMCL clustering algorithms. The granularity of the clusters can be fine-tuned by a user-configurable filtering strategy based on a combination of blastp pairwise alignment parameters, hmmscan-based scanning of Pfam domain composition of the proteins in each cluster, and a partial synteny criterion. We present detailed protocols to fit exponential and binomial mixture models to estimate core- and pan-genome sizes, compute pan-genome trees from the pan-genome matrix using a parsimony criterion, analyze and graphically represent the pan-genome structure, and identify lineage-specific gene families for the 12 complete pIncA/C plasmids currently available in NCBI’s RefSeq. The software package, license, and detailed user manual can be downloaded for free for academic use from two mirrors: http://www.eead.csic.es/compbio/soft/gethoms.php and http://maya.ccg.unam.mx/soft/gethoms.php .",
                "authors": [
                    {
                        "name": "Contreras-Moreira B."
                    },
                    {
                        "name": "Vinuesa P."
                    }
                ],
                "citationCount": 37,
                "date": "2015-01-01T00:00:00Z",
                "journal": "Methods in Molecular Biology",
                "title": "Robust identification of orthologues and paralogues for microbial pan-genomics using GET_HOMOLOGUES: A case study of pIncA/C plasmids"
            },
            "pmid": "25343868",
            "type": [
                "Usage"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ]
}
