{
    "accessibility": [
        "Open access"
    ],
    "additionDate": "2019-06-23T14:40:09Z",
    "biotoolsCURIE": "biotools:PepQuery",
    "biotoolsID": "PepQuery",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Gitter",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://gitter.im/PepQuery/Lobby"
        },
        {
            "name": "PepQuery Google Group",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://groups.google.com/forum/#!forum/pepquery"
        }
    ],
    "description": "Peptide-centric search engine for novel peptide identification and validation.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.pepquery.org/document.html"
        }
    ],
    "download": [
        {
            "type": "Downloads page",
            "url": "http://www.pepquery.org/download.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "PTM localisation",
                    "uri": "http://edamontology.org/operation_3755"
                },
                {
                    "term": "Blind peptide database search",
                    "uri": "http://edamontology.org/operation_3647"
                },
                {
                    "term": "Target-Decoy",
                    "uri": "http://edamontology.org/operation_3649"
                }
            ]
        }
    ],
    "homepage": "http://www.pepquery.org/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2019-06-23T14:40:09Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/bzhanglab/PepQuery/issues"
        }
    ],
    "maturity": "Mature",
    "name": "PepQuery",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1101/gr.235028.118",
            "metadata": {
                "abstract": "© 2019 Wen et al. Massively parallel or second-generation sequencing-based genomic studies continuously identify new genomic alterations that may lead to novel protein sequences, which are attractive candidates for disease biomarkers and therapeutic targets after proteomic validation. Integrative proteogenomic methods have been developed to use mass spectrometry (MS)-based proteomics data for such validation. These methods replace the reference sequence database in proteomic database searching with a customized protein database that incorporates sample- or disease-specific sequences derived from DNA or RNA sequencing, thus enabling the identification of novel protein sequences. Although useful, this spectrum-centric approach requires a full evaluation of all possible spectrum-peptide pairs, which is time-consuming, error-prone, and difficult to apply. Here, we present PepQuery, a peptide-centric approach that focuses on only novel DNA or protein sequences of interest. PepQuery allows quick and easy proteomic validation of genomic alterations without customized database construction. We demonstrated the sensitivity and specificity of the approach in validating completely novel proteins, novel splice junctions, and single amino acid variants using simulations and experimental data. Notably, enabling unrestricted modification searching in PepQuery reduced false positives by up to 95%. We implemented PepQuery as both web-based and stand-alone applications. The web version provides direct access to more than half a billion MS/MS spectra from the Clinical Proteomic Tumor Analysis Consortium (CPTAC) and other cancer proteomic studies. The stand-alone version supports batch analysis and user-provided MS/MS data. PepQuery will increase the usage of proteogenomics beyond the proteomics community and will broaden the application of proteogenomics in personalized medicine.",
                "authors": [
                    {
                        "name": "Wen B."
                    },
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Zhang B."
                    }
                ],
                "citationCount": 1,
                "date": "2019-03-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "PepQuery enables fast, accurate, and convenient proteomic validation of novel genomic alterations"
            },
            "pmid": "30610011",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}