{
    "accessibility": "Open access",
    "additionDate": "2019-05-26T06:44:12Z",
    "biotoolsCURIE": "biotools:SCOPA",
    "biotoolsID": "SCOPA",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "reedik.magi@ut.ee",
            "name": "Reedik Magi",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "apmorris@liverpool.ac.uk",
            "name": "Andrew P Morris",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Software for COrrelated Phenotype Analysis.",
    "documentation": [
        {
            "note": "Tutorial material",
            "type": [
                "Training material"
            ],
            "url": "https://www.geenivaramu.ee/en/tools/tutorial"
        }
    ],
    "download": [
        {
            "type": "Downloads page",
            "url": "https://www.geenivaramu.ee/en/tools/download-0"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://www.geenivaramu.ee/en/tools/scopa",
    "language": [
        "C++"
    ],
    "lastUpdate": "2020-06-16T10:55:22Z",
    "license": "Other",
    "maturity": "Mature",
    "name": "SCOPA",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12859-016-1437-3",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: Genome-wide association studies (GWAS) of single nucleotide polymorphisms (SNPs) have been successful in identifying loci contributing genetic effects to a wide range of complex human diseases and quantitative traits. The traditional approach to GWAS analysis is to consider each phenotype separately, despite the fact that many diseases and quantitative traits are correlated with each other, and often measured in the same sample of individuals. Multivariate analyses of correlated phenotypes have been demonstrated, by simulation, to increase power to detect association with SNPs, and thus may enable improved detection of novel loci contributing to diseases and quantitative traits. Results: We have developed the SCOPA software to enable GWAS analysis of multiple correlated phenotypes. The software implements \"reverse regression\" methodology, which treats the genotype of an individual at a SNP as the outcome and the phenotypes as predictors in a general linear model. SCOPA can be applied to quantitative traits and categorical phenotypes, and can accommodate imputed genotypes under a dosage model. The accompanying META-SCOPA software enables meta-analysis of association summary statistics from SCOPA across GWAS. Application of SCOPA to two GWAS of high-and low-density lipoprotein cholesterol, triglycerides and body mass index, and subsequent meta-analysis with META-SCOPA, highlighted stronger association signals than univariate phenotype analysis at established lipid and obesity loci. The META-SCOPA meta-analysis also revealed a novel signal of association at genome-wide significance for triglycerides mapping to GPC5 (lead SNP rs71427535, p = 1.1x10-8), which has not been reported in previous large-scale GWAS of lipid traits. Conclusions: The SCOPA and META-SCOPA software enable discovery and dissection of multiple phenotype association signals through implementation of a powerful reverse regression approach.",
                "authors": [
                    {
                        "name": "Magi R."
                    },
                    {
                        "name": "Suleimanov Y.V."
                    },
                    {
                        "name": "Clarke G.M."
                    },
                    {
                        "name": "Kaakinen M."
                    },
                    {
                        "name": "Fischer K."
                    },
                    {
                        "name": "Prokopenko I."
                    },
                    {
                        "name": "Morris A.P."
                    }
                ],
                "citationCount": 8,
                "date": "2017-01-11T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SCOPA and META-SCOPA: Software for the analysis and aggregation of genome-wide association studies of multiple correlated phenotypes"
            },
            "pmcid": "PMC5225593",
            "pmid": "28077070",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Membrane and lipoproteins",
            "uri": "http://edamontology.org/topic_0820"
        }
    ],
    "version": [
        "1.0.14"
    ]
}