{
    "additionDate": "2021-01-20T11:06:12Z",
    "biotoolsCURIE": "biotools:catnip",
    "biotoolsID": "catnip",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ole2001@med.cornell.edu",
            "name": "Olivier Elemento",
            "orcidid": "https://orcid.org/0000-0002-8061-9617",
            "typeEntity": "Person"
        }
    ],
    "description": "A machine learning and network framework to discover new indications for small molecules.\n\nCATNIP = Creating A Translational Network for Indication Prediction.\n\nThe CATNIP repurposing network can be searched either by specifying one or more drugs or diseases. The probability of CATNIP prediction that two drugs will share an indication is 0.95 by default, but can be changed by the user.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://www.github.com/coryandar/CATNIP",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-05-13T06:05:20Z",
    "license": "MIT",
    "name": "CATNIP",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1008098",
            "metadata": {
                "abstract": "© 2020 Gilvary et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Drug repurposing, identifying novel indications for drugs, bypasses common drug development pitfalls to ultimately deliver therapies to patients faster. However, most repurposing discoveries have been led by anecdotal observations (e.g. Viagra) or experimental-based repurposing screens, which are costly, time-consuming, and imprecise. Recently, more systematic computational approaches have been proposed, however these rely on utilizing the information from the diseases a drug is already approved to treat. This inherently limits the algorithms, making them unusable for investigational molecules. Here, we present a computational approach to drug repurposing, CATNIP, that requires only biological and chemical information of a molecule. CATNIP is trained with 2,576 diverse small molecules and uses 16 different drug similarity features, such as structural, target, or pathway based similarity. This model obtains significant predictive power (AUC = 0.841). Using our model, we created a repurposing network to identify broad scale repurposing opportunities between drug types. By exploiting this network, we identified literature-supported repurposing candidates, such as the use of systemic hormonal preparations for the treatment of respiratory illnesses. Furthermore, we demonstrated that we can use our approach to identify novel uses for defined drug classes. We found that adrenergic uptake inhibitors, specifically amitriptyline and trimipramine, could be potential therapies for Parkinson’s disease. Additionally, using CATNIP, we predicted the kinase inhibitor, vandetanib, as a possible treatment for Type 2 Diabetes. Overall, this systematic approach to drug repurposing lays the groundwork to streamline future drug development efforts.",
                "authors": [
                    {
                        "name": "Gilvary C."
                    },
                    {
                        "name": "Elkhader J."
                    },
                    {
                        "name": "Madhukar N."
                    },
                    {
                        "name": "Henchcliffe C."
                    },
                    {
                        "name": "Goncalves M.D."
                    },
                    {
                        "name": "Elemento O."
                    }
                ],
                "citationCount": 3,
                "date": "2020-08-07T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "A machine learning and network framework to discover new indications for small molecules"
            },
            "pmcid": "PMC7437923",
            "pmid": "32764756"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Drug development",
            "uri": "http://edamontology.org/topic_3373"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}