
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://prodom.prabi.fr/prodom/current/html/prodom_team.php"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://prodom.prabi.fr/prodom/xdom/mkdom2.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Local alignment",
                    "uri": "http://edamontology.org/operation_0495"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Perl"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Database management",
                "uri": "http://edamontology.org/topic_3489"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/mkdomxdom-2-build-prodom-database.html"
        }
    ],
    "publication": [
        {
            "abstract": "We present the outcome of a systematic analysis of protein domain shuffling in 17 completed microbial genomes. This analysis has been performed using MKDOM Version 2, a completely new version of the domain clustering program MKDOM based on PSI-BLAST recursive homology searches. It allows to delineate the most frequent protein domain building blocks, which domains are found specifically in Bacteria, Archaea or yeast, and which domains are shared between two or all three domains of life. The latter are good candidates as the basic protein building blocks underlying all forms of cellular life. Statistics of multi-domain proteins indicate that some organisms such as Bacillus subtilis or Mycobacterium tuberculosis contain an abnormally high number of large multi-domain proteins. We also provide examples of highly shuffled or circularly permutated domains. A WWW graphical interface has been made available to interactively browse domain arrangements of proteins in all 17 genomes, at http://www.toulouse.inra.fr/prodomCG.html. © 1999 Elsevier Science Ltd. All rights reserved.",
            "authors": [
                "Gouzy J.",
                "Corpet F.",
                "Kahn D."
            ],
            "cit_count": 57,
            "journal": "Computers and Chemistry",
            "pmid": "10404623",
            "title": "Whole genome protein domain analysis using a new method for domain clustering",
            "year": "1999-06-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:mkdom",
        "biotoolsID": "mkdom",
        "description": "Program we use routinely to build each new release of ProDom, Protein domain families automatically generated from protein databases. It relies on the assumption that the shortest amino acid sequence corresponds to a single domain, and may be used as a query to screen the database with the psi-blast program, in order to cluster homologous domains.",
        "homepage": "http://prodom.prabi.fr/prodom/xdom/welcome.html",
        "name": "mkdom"
    }
}