{
    "additionDate": "2020-01-14T09:48:13Z",
    "biotoolsCURIE": "biotools:tactile_glove",
    "biotoolsID": "tactile_glove",
    "confidence_flag": "very low",
    "credit": [
        {
            "email": "mfernandes@dca.ufrn.br",
            "name": "Marcelo A. C. Fernandes",
            "orcidid": "https://orcid.org/0000-0001-7536-2506",
            "typeEntity": "Person"
        }
    ],
    "description": "Proposal of the Tactile Glove Device.\n\nA tactile glove that let's you touch a virtual object and interact with it.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'tactile'",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/danielholanda/Tactile-Glove",
    "language": [
        "C++",
        "C"
    ],
    "lastUpdate": "2020-01-14T09:48:13Z",
    "license": "MIT",
    "name": "tactile glove",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3390/S19225029",
            "metadata": {
                "abstract": "© 2019 by the authors. Licensee MDPI, Basel, Switzerland.This project aims to develop a tactile glove device and a virtual environment inserted in the context of tactile internet. The tactile glove allows a human operator to interact remotely with objects from a 3D environment through tactile feedback or tactile sensation. In other words, the human operator is able to feel the contour and texture from virtual objects. Applications such as remote diagnostics, games, remote analysis of materials, and others in which objects could be virtualized can be significantly improved using this kind of device. These gloves have been an essential device in all research on the internet next generation called “Tactile Internet”, in which this project is inserted. Unlike the works presented in the literature, the novelty of this work is related to architecture, and tactile devices developed. They are within the 10 ms round trip latency limits required in a tactile internet environment. Details of hardware and software designs of a tactile glove, as well as the virtual environment, are described. Results and comparative analysis about round trip latency time in the tactile internet environment is developed.",
                "authors": [
                    {
                        "name": "Junior J.C.V.S."
                    },
                    {
                        "name": "Torquato M.F."
                    },
                    {
                        "name": "Noronha D.H."
                    },
                    {
                        "name": "Silva S.N."
                    },
                    {
                        "name": "Fernandes M.A.C."
                    }
                ],
                "citationCount": 1,
                "date": "2019-11-02T00:00:00Z",
                "journal": "Sensors (Switzerland)",
                "title": "Proposal of the tactile glove device"
            },
            "pmcid": "PMC6891499",
            "pmid": "31752187"
        }
    ],
    "topic": [
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        }
    ]
}