{
    "additionDate": "2019-11-14T19:57:12Z",
    "biotoolsCURIE": "biotools:FaceGen",
    "biotoolsID": "FaceGen",
    "confidence_flag": "tool",
    "cost": "Commercial",
    "description": "Create realistic 3D faces from photos or at random, edit with many controls, export for animation, rendering or 3D printing using a demographically diverse and customizable face space model",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://facegen.com",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2020-12-28T16:12:36Z",
    "name": "FaceGen",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1167/19.11.7",
            "metadata": {
                "abstract": "© 2019 The Authors.We introduce a novel face space model-parametric face drawings (or PFDs)-to generate schematic, though realistic, parameterized line drawings of faces based on the statistical distribution of human facial features. A review of existing face space models (including FaceGen Modeller, Synthetic Faces, MPI, and active appearance model) indicates that current models are constrained by their reliance on ethnically homogeneous face databases. This constraint has led to negative consequences for underrepresented populations, such as impairments in automatized identity recognition of certain demographic groups. Our model is based on a demographically diverse sample of 400 faces (200 female, 200 male; 100 East Asian/Pacific Islander, 100 Latinx/Hispanic, 100 black/ African-American, and 100 white/Caucasian) compiled from several face databases (including FERET face recognition technology and the Chicago Face Database). Each front-view face image is manually coded with 85 landmark points that are then normalized and rendered with MATLAB (MathWorks, Natick, MA) tools to produce a smooth, parameterized face line drawing. We present data from two behavioral experiments to validate our model and demonstrate its applicability. In Experiment 1 we show that PFDs produce a reliable ''inversion effect'' in short-term recognition, a hallmark of holistic processing. In Experiment 2, we conduct a celebrity recognition task, comparing performance on PFDs to performance on untextured renderings from FaceGen Modeller. Participants successfully recognized approximately 50% of celebrity faces based on the PFD models, comparable to performance based on FaceGen Modeler (also 50% correct). We highlight a range of potential applications of our model, list some limitations, and provide MATLAB resources for researchers to utilize our face space, including the ability to customize the demographic makeup of the face space, add new faces, and produce morphs and caricatures.",
                "authors": [
                    {
                        "name": "Day J."
                    },
                    {
                        "name": "Davidenko N."
                    }
                ],
                "date": "2019-09-01T00:00:00Z",
                "journal": "Journal of Vision",
                "title": "Parametric face drawings: A demographically diverse and customizable face space model"
            },
            "pmid": "31532469"
        }
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        },
        {
            "term": "Geriatric medicine",
            "uri": "http://edamontology.org/topic_3399"
        }
    ],
    "validated": 1
}