{
    "additionDate": "2021-01-18T09:44:54Z",
    "biotoolsCURIE": "biotools:gcnmda",
    "biotoolsID": "gcnmda",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "luojiawei@hnu.edu.cn",
            "name": "Jiawei Luo",
            "typeEntity": "Person"
        },
        {
            "email": "xlli@i2r.a-star.edu.sg",
            "name": "Xiaoli Li",
            "typeEntity": "Person"
        }
    ],
    "description": "Predicting human microbe-drug associations via graph convolutional network with conditional random field.\n\nGCNMDA: A novel Graph Convolution Network based framework for predicting Microbe-Drug Associations.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                }
            ]
        }
    ],
    "homepage": "https://github.com/longyahui/GCNMDA",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-22T17:58:20Z",
    "name": "GCNMDA",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA598",
            "metadata": {
                "abstract": "© 2020 Oxford University Press. All rights reserved.Motivation: Human microbes play critical roles in drug development and precision medicine. How to systematically understand the complex interaction mechanism between human microbes and drugs remains a challenge nowadays. Identifying microbe-drug associations can not only provide great insights into understanding the mechanism, but also boost the development of drug discovery and repurposing. Considering the high cost and risk of biological experiments, the computational approach is an alternative choice. However, at present, few computational approaches have been developed to tackle this task. Results: In this work, we leveraged rich biological information to construct a heterogeneous network for drugs and microbes, including a microbe similarity network, a drug similarity network and a microbe-drug interaction network. We then proposed a novel graph convolutional network (GCN)-based framework for predicting human Microbe- Drug Associations, named GCNMDA. In the hidden layer of GCN, we further exploited the Conditional Random Field (CRF), which can ensure that similar nodes (i.e. microbes or drugs) have similar representations. To more accurately aggregate representations of neighborhoods, an attention mechanism was designed in the CRF layer. Moreover, we performed a random walk with restart-based scheme on both drug and microbe similarity networks to learn valuable features for drugs and microbes, respectively. Experimental results on three different datasets showed that our GCNMDA model consistently achieved better performance than seven state-of-the-art methods. Case studies for three microbes including SARS-CoV-2 and two antimicrobial drugs (i.e. Ciprofloxacin and Moxifloxacin) further confirmed the effectiveness of GCNMDA in identifying potential microbe-drug associations. Availability and implementation: Python codes and dataset are available at: https://github.com/longyahui/ GCNMDA.",
                "authors": [
                    {
                        "name": "Long Y."
                    },
                    {
                        "name": "Wu M."
                    },
                    {
                        "name": "Kwoh C.K."
                    },
                    {
                        "name": "Luo J."
                    },
                    {
                        "name": "Li X."
                    }
                ],
                "citationCount": 8,
                "date": "2020-10-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Predicting human microbe-drug associations via graph convolutional network with conditional random field"
            },
            "pmcid": "PMC7559035",
            "pmid": "32597948"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "Drug development",
            "uri": "http://edamontology.org/topic_3373"
        },
        {
            "term": "Safety sciences",
            "uri": "http://edamontology.org/topic_3377"
        },
        {
            "term": "Biotherapeutics",
            "uri": "http://edamontology.org/topic_3374"
        }
    ],
    "validated": 1
}