{
    "additionDate": "2018-11-27T08:16:27Z",
    "biotoolsCURIE": "biotools:empprior",
    "biotoolsID": "empprior",
    "credit": [
        {
            "email": "jjanders@us.ibm.com",
            "name": "John J. Andersen",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "jembrown@lsu.edu",
            "name": "Jeremy Brown",
            "orcidid": "http://orcid.org/0000-0002-1447-8633",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "EmpPrior facilitates the collection and incorporation of relevant, outside information when setting branch-length priors for phylogenetics.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/jembrown/EmpPrior/blob/master/EmpPrior.0.21_Manual_6.3.16.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jembrown/EmpPrior",
    "language": [
        "R",
        "Java"
    ],
    "lastUpdate": "2019-01-13T17:01:24Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/jembrown/EmpPrior/issues"
        }
    ],
    "name": "EmpPrior",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1186/s12859-016-1132-4",
            "metadata": {
                "abstract": "© 2016 The Author(s).Background: Branch-length parameters are a central component of phylogenetic models and of intrinsic biological interest. Default branch-length priors in some Bayesian phylogenetic software can be unintentionally informative and lead to branch- and tree-length estimates that are unreasonable. Alternatively, priors may be uninformative, but lead to diffuse posterior estimates. Despite the widespread availability of relevant datasets from other groups, biologists rarely leverage outside information to specify branch-length priors that are specific to the analysis they are conducting. Results: We developed the software package EmpPrior to facilitate the collection and incorporation of relevant, outside information when setting branch-length priors for phylogenetics. EmpPrior efficiently queries TreeBASE to find data that are similar to focal data, in terms of taxonomic and genetic sampling, and uses them to inform branch-length priors for the focal analysis. EmpPrior consists of two components: EmpPrior-search, written in Java to query TreeBASE, and EmpPrior-fit, written in R to parameterize branch-length distributions. In an example analysis, we show how the use of relevant, outside data is made possible by EmpPrior and improves tree-length estimates from a focal dataset. Conclusion: EmpPrior is easy to use, fast, and improves both the accuracy and precision of branch-length estimates in many circumstances. While EmpPrior's focus is on branch lengths, the strategy it employs could easily be extended to address other prior parameterization problems in phylogenetics.",
                "authors": [
                    {
                        "name": "Andersen J.J."
                    },
                    {
                        "name": "Nelson B.J."
                    },
                    {
                        "name": "Brown J.M."
                    }
                ],
                "date": "2016-06-24T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "EmpPrior: Using outside empirical data to inform branch-length priors for Bayesian phylogenetics"
            },
            "pmcid": "PMC4919878",
            "pmid": "27342194",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Applied mathematics",
            "uri": "http://edamontology.org/topic_3569"
        }
    ],
    "validated": 1,
    "version": [
        "0.21"
    ]
}