{
    "additionDate": "2017-12-18T00:08:27Z",
    "biotoolsCURIE": "biotools:lnsignal",
    "biotoolsID": "lnsignal",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.csbio.sjtu.edu.cn/"
        }
    ],
    "description": "The web server LnSignal (Labelling N-terminal Signal petide cleavage site) was developed by integrating position-specific amino acid propensities based on the highest average positions and conditional random fields.",
    "documentation": [
        {
            "type": "General",
            "url": "http://www.csbio.sjtu.edu.cn/bioinf/LnSignal/Readme.htm"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "homepage": "http://www.csbio.sjtu.edu.cn/bioinf/LnSignal/",
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/lnsignal-predicting-protein-n-terminal-signal-peptides.html"
        }
    ],
    "name": "LnSignal",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.2174/1574893611308020006",
            "metadata": {
                "abstract": "Protein signal peptides play a vital role in targeting and translocation of most secreted proteins and many integral membrane proteins in both prokaryotes and eukaryotes. Consequently, accurate prediction of signal peptides and their cleavage sites is an important task in molecular biology. In the present study, firstly, we develop a novel discriminative scoring method for classifying proteins with or without signal peptides. This method successfully captured the characteristics of signal peptides and non-signal peptides by integrating hydrophobicity alignment and positionspecific amino acid propensities based on the highest average positions. As a result, this method is capable of discriminating proteins with signal peptides at the overall accuracies of 96.3%, 97.0% and 97.2% by leave-one-out jackknife tests on the constructed benchmark datasets for three different organisms, i.e. Eukaryotic, Gram-negative, and Gram-positive respectively. Secondly, we consider the prediction task of signal peptide cleavage sites as a sequence labeling problem and apply Conditional Random Fields (CRFs) algorithm to solve it. Experimental results demonstrate that the proposed CRFs-based cleavage site finding approach can achieve the prediction success rates of 80.8%, 89.4%, and 74.0% respectively, for the secretory proteins from three different organisms. An online tool, LnSignal, is established for labeling the N-terminal signal cleavage sites and is freely available for academic use at http://www.csbio.sjtu.edu.cn/bioinf/LnSignal. © 2013 Bentham Science Publishers.",
                "authors": [
                    {
                        "name": "Fan Y.-X."
                    },
                    {
                        "name": "Song J."
                    },
                    {
                        "name": "Xu C."
                    },
                    {
                        "name": "Shen H.-B."
                    }
                ],
                "citationCount": 1,
                "date": "2013-03-18T00:00:00Z",
                "journal": "Current Bioinformatics",
                "title": "Predicting protein N-terminal signal peptides using position-specific amino acid propensities and conditional random fields"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Peptides",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}