{
    "additionDate": "2021-01-18T08:48:52Z",
    "biotoolsCURIE": "biotools:pathme-clustering",
    "biotoolsID": "pathme-clustering",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "frohlich@bit.uni-bonn.de",
            "name": "Holger Fröhlich",
            "orcidid": "https://orcid.org/0000-0002-5328-1243",
            "typeEntity": "Person"
        }
    ],
    "description": "PathME is a pathway based multi-modal sparse autoencoders for clustering of patient-level multi-omics data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Expression profile pathway mapping",
                    "uri": "http://edamontology.org/operation_0533"
                },
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                }
            ]
        }
    ],
    "homepage": "https://github.com/AminaLEM/PathME",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2021-01-22T18:17:13Z",
    "name": "PathME",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12859-020-3465-2",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Recent years have witnessed an increasing interest in multi-omics data, because these data allow for better understanding complex diseases such as cancer on a molecular system level. In addition, multi-omics data increase the chance to robustly identify molecular patient sub-groups and hence open the door towards a better personalized treatment of diseases. Several methods have been proposed for unsupervised clustering of multi-omics data. However, a number of challenges remain, such as the magnitude of features and the large difference in dimensionality across different omics data sources. Results: We propose a multi-modal sparse denoising autoencoder framework coupled with sparse non-negative matrix factorization to robustly cluster patients based on multi-omics data. The proposed model specifically leverages pathway information to effectively reduce the dimensionality of omics data into a pathway and patient specific score profile. In consequence, our method allows us to understand, which pathway is a feature of which particular patient cluster. Moreover, recently proposed machine learning techniques allow us to disentangle the specific impact of each individual omics feature on a pathway score. We applied our method to cluster patients in several cancer datasets using gene expression, miRNA expression, DNA methylation and CNVs, demonstrating the possibility to obtain biologically plausible disease subtypes characterized by specific molecular features. Comparison against several competing methods showed a competitive clustering performance. In addition, post-hoc analysis of somatic mutations and clinical data provided supporting evidence and interpretation of the identified clusters. Conclusions: Our suggested multi-modal sparse denoising autoencoder approach allows for an effective and interpretable integration of multi-omics data on pathway level while addressing the high dimensional character of omics data. Patient specific pathway score profiles derived from our model allow for a robust identification of disease subgroups.",
                "authors": [
                    {
                        "name": "Lemsara A."
                    },
                    {
                        "name": "Ouadfel S."
                    },
                    {
                        "name": "Frohlich H."
                    }
                ],
                "citationCount": 2,
                "date": "2020-04-16T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "PathME: Pathway based multi-modal sparse autoencoders for clustering of patient-level multi-omics data"
            },
            "pmcid": "PMC7161108",
            "pmid": "32299344"
        }
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}