{"credit":[{"email":"tengzhagn156@126.com","name":"Teng Zhang","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://github.com/skyhorsetomoon/Trumpet/blob/master/README.md"}],"function":[{"operation":[{"term":"Alignment","uri":"http://edamontology.org/operation_2928"}]},{"operation":[{"term":"Validation","uri":"http://edamontology.org/operation_2428"}]}],"labels":{"language":["R"],"license":"GPL-2.0","operatingSystem":["Linux","Windows","Mac"],"toolType":["Library"],"topic":[{"term":"Sequencing","uri":"http://edamontology.org/topic_3168"},{"term":"RNA-seq","uri":"http://edamontology.org/topic_3170"},{"term":"methyl-seq","uri":"http://edamontology.org/topic_3674"},{"term":"Gene expression","uri":"http://edamontology.org/topic_0203"}]},"publication":[{"abstract":"© 2018 The Author(s).Background: Methylated RNA immunoprecipitation sequencing (MeRIP-seq or m6A-seq) has been extensively used for profiling transcriptome-wide distribution of RNA N6-Methyl-Adnosine methylation. However, due to the intrinsic properties of RNA molecules and the intricate procedures of this technique, m6A-seq data often suffer from various flaws. A convenient and comprehensive tool is needed to assess the quality of m6A-seq data to ensure that they are suitable for subsequent analysis. Results: From a technical perspective, m6A-seq can be considered as a combination of ChIP-seq and RNA-seq; hence, by effectively combing the data quality assessment metrics of the two techniques, we developed the trumpet R package for evaluation of m6A-seq data quality. The trumpet package takes the aligned BAM files from m6A-seq data together with the transcriptome information as the inputs to generate a quality assessment report in the HTML format. Conclusions: The trumpet R package makes a valuable tool for assessing the data quality of m6A-seq, and it is also applicable to other fragmented RNA immunoprecipitation sequencing techniques, including m1A-seq, CeU-Seq, Ψ-seq, etc.","authors":["Zhang T.","Zhang S.-W.","Zhang L.","Meng J."],"cit_count":0,"doi":"10.1186/s12859-018-2266-3","journal":"BMC Bioinformatics","title":"trumpet: Transcriptome-guided quality assessment of m6A-seq data","type":"Primary","year":"2018-07-13"}],"summary":{"biotoolsCURIE":"biotools:trumpet","biotoolsID":"trumpet","description":"The package is designed for the quality assessment of methylated RNA immunoprecipitation sequencing data.","homepage":"https://github.com/skyhorsetomoon/Trumpet","name":"trumpet","version":["0.3.6"]}}