{"credit":[{"email":"Swati.Kaushik@ucsf.edu","name":"Swati Kaushik, PhD","typeEntity":"Person","typeRoles":["Primary contact"],"url":"https://github.com/RSLabNCBS/C-HMM"}],"documentation":[{"url":"https://github.com/SwatiKaushik/C-HMM"}],"function":[{"operation":[{"term":"Protein sequence analysis","uri":"http://edamontology.org/operation_2479"}]}],"labels":{"language":["Java"],"operatingSystem":["Linux","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"},{"term":"Sequence sites, features and motifs","uri":"http://edamontology.org/topic_0160"},{"term":"Data submission, annotation and curation","uri":"http://edamontology.org/topic_0219"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/c-hmm-program-to-identify-remote-homologues-from-protein-sequence-database.html"}],"publication":[{"abstract":"© The Author 2015. Published by Oxford University Press.Motivation: In the post-genomic era, automatic annotation of protein sequences using computational homology-based methods is highly desirable. However, often protein sequences diverge to an extent where detection of homology and automatic annotation transfer is not straightforward. Sophisticated approaches to detect such distant relationships are needed. We propose a new approach to identify deep evolutionary relationships of proteins to overcome shortcomings of the available methods. Results: We have developed a method to identify remote homologues more effectively from any protein sequence database by using several cascading events with Hidden Markov Models (C-HMM). We have implemented clustering of hits and profile generation of hit clusters to effectively reduce the computational timings of the cascaded sequence searches. Our C-HMM approach could cover 94, 83 and 40% coverage at family, superfamily and fold levels, respectively, when applied on diverse protein folds. We have compared C-HMM with various remote homology detection methods and discuss the trade-offs between coverage and false positives.","authors":["Kaushik S.","Nair A.G.","Mutt E.","Subramanian H.P.","Sowdhamini R."],"cit_count":3,"journal":"Bioinformatics","pmid":"26454276","title":"Rapid and enhanced remote homology detection by cascading hidden Markov model searches in sequence space","year":"2015-04-23"}],"summary":{"biotoolsCURIE":"biotools:c-hmm","biotoolsID":"c-hmm","description":"Software to detect remote/distant homologues from protein sequence databases. It is based on HMMs(Hidden Markov Models) for identifying the deep evolutionary relationships of protein sequences.","homepage":"https://github.com/RSLabNCBS/C-HMM","name":"C-HMM"}}