{
    "accessibility": "Open access",
    "additionDate": "2022-06-11T23:15:48.699659Z",
    "biotoolsCURIE": "biotools:qpoweredcompound2denovodrugpropmax",
    "biotoolsID": "qpoweredcompound2denovodrugpropmax",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "bengeof@gmail.com",
            "name": "Ben Geoffrey A. S."
        },
        {
            "name": "Pavan Preetham Valluri"
        },
        {
            "name": "Rafal Madaj"
        }
    ],
    "description": "The main programmatic workflow to identify the bio-acitivity of a compound through AI and In-Silico methods",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Protein-protein docking",
                    "uri": "http://edamontology.org/operation_3899"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bengeof/Compound2DeNovoDrugPropMax",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2022-06-11T23:15:48.702034Z",
    "license": "Not licensed",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/bengeof/QPoweredCompound2DeNovoDrugPropMax"
        }
    ],
    "name": "QPoweredCompound2DeNovoDrugPropMax",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1080/07391102.2021.2024450",
            "metadata": {
                "abstract": "© 2022 Informa UK Limited, trading as Taylor & Francis Group.Network data is composed of nodes and edges. Successful application of machine learning/deep learning algorithms on network data to make node classification and link prediction have been shown in the area of social networks through which highly customized suggestions are offered to social network users. Similarly one can attempt the use of machine learning/deep learning algorithms on biological network data to generate predictions of scientific usefulness. In the presented work, compound-drug target interaction network data set from bindingDB has been used to train deep learning neural network and a multi class classification has been implemented to classify PubChem compound queried by the user into class labels of PBD IDs. This way target interaction prediction for PubChem compounds is carried out using deep learning. The user is required to input the PubChem Compound ID (CID) of the compound the user wishes to gain information about its predicted biological activity and the tool outputs the RCSB PDB IDs of the predicted drug target interaction for the input CID. Further the tool also optimizes the compound of interest of the user toward drug likeness properties through a deep learning based structure optimization protocol. The tool also incorporates a feature to perform automated In Silico modelling to find the interaction between the compounds and the predicted drug targets to uncover their protein-ligand interaction profiles. The program is hosted, supported and maintained at the following GitHub repository. https://github.com/bengeof/Compound2DeNovoDrugPropMax. Anticipating the use of quantum computing and quantum machine learning in drug discovery we use the Penny-lane interface to quantum hardware to turn classical Keras layers used in our machine/deep learning models into a quantum layer and introduce quantum layers into classical models to produce a quantum-classical machine/deep learning hybrid model of our tool and the code corresponding to the same is provided below. https://github.com/bengeof/QPoweredCompound2DeNovoDrugPropMax. HIGHLIGHTS Deep learning based network pharmacology approach to predict the bio-activity of compounds. Further optimization of the compound toward drug like properties using deep learning techniques. Automated in silico modeling and interaction profiling of deep learning predicted target protein-ligand interaction. Communicated by Ramaswamy H. Sarma.",
                "authors": [
                    {
                        "name": "Ben Geoffrey A.S."
                    },
                    {
                        "name": "Madaj R."
                    },
                    {
                        "name": "Valluri P.P."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Journal of Biomolecular Structure and Dynamics",
                "title": "QPoweredCompound2DeNovoDrugPropMax–a novel programmatic tool incorporating deep learning and in silico methods for automated in silico bio-activity discovery for any compound of interest"
            },
            "pmid": "35007471"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
