
{
    "credit": [
        {
            "email": "ramonimedea@uib-csic.es",
            "name": "Ramon Rosselló Móra",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://imedea.uib-csic.es/index.php"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://imedea.uib-csic.es/jspecies/about.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Genome comparison",
                    "uri": "http://edamontology.org/operation_3209"
                },
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Comparative genomics",
                "uri": "http://edamontology.org/topic_0797"
            },
            {
                "term": "Evolutionary biology",
                "uri": "http://edamontology.org/topic_3299"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Statistics and probability",
                "uri": "http://edamontology.org/topic_2269"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/jspecies-1-2-1-measure-probability-genomes-belonging-species.html"
        }
    ],
    "publication": [
        {
            "abstract": "DNA-DNA hybridization (DDH) has been used for nearly 50 years as the gold standard for prokaryotic species circumscriptions at the genomic level. It has been the only taxonomic method that offered a numerical and relatively stable species boundary, and its use has had a paramount influence on how the current classification has been constructed. However, now, in the era of genomics, DDH appears to be an outdated method for classification that needs to be substituted. The average nucleotide identity (ANI) between two genomes seems the most promising method since it mirrors DDH closely. Here we examine the work package JSpecies as a userfriendly, biologist-oriented interface to calculate ANI and the correlation of the tetranucleotide signatures between pairwise genomic comparisons. The results agreed with the use of ANI to substitute DDH, with a narrowed boundary that could be set at ≈95-96%. In addition, the JSpecies package implemented the tetranucleotide signature correlation index, an alignment-free parameter that generally correlates with ANI and that can be of help in deciding when a given pair of organisms should be classified in the same species. Moreover, for taxonomic purposes, the analyses can be produced by simply randomly sequencing at least 20% of the genome of the query strains rather than obtaining their full sequence.",
            "authors": [
                "Richter M.",
                "Rossello-Mora R."
            ],
            "cit_count": 1418,
            "journal": "Proceedings of the National Academy of Sciences of the United States of America",
            "pmid": "19855009",
            "title": "Shifting the genomic gold standard for the prokaryotic species definition",
            "year": "2009-11-10"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:jspecies",
        "biotoolsID": "jspecies",
        "description": "An easy to use, biologist-centric software designed to measure the probability if two genomes belonging to the same species or not.",
        "homepage": "http://www.imedea.uib-csic.es/jspecies/index.html",
        "name": "JSpecies"
    }
}