{
    "additionDate": "2021-01-18T08:16:45Z",
    "biotoolsCURIE": "biotools:squidlab",
    "biotoolsID": "squidlab",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Matthew J. Coak",
            "typeEntity": "Person"
        }
    ],
    "description": "user-friendly program for background subtraction and fitting of magnetization data.\n\nWe present an open-source program free to download for academic use with a full user-friendly graphical interface for performing flexible and robust background subtraction and dipole fitting on magnetization data. For magnetic samples with small moment sizes or sample environments with large or asymmetric magnetic backgrounds, it can become necessary to separate background and sample contributions to each measured raw voltage measurement before fitting the dipole signal to extract magnetic moments. Originally designed for use with pressure cells on a Quantum Design MPMS3 SQUID magnetometer, SquidLab is a modular object-oriented platform implemented in Matlab with a range of importers for different widely available magnetometer systems (including MPMS, MPMS-XL, MPMS-IQuantum, MPMS3, and S700X models) and has been tested with a broad variety of background and signal types",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://wrap.warwick.ac.uk/129665/",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-02-21T15:11:28Z",
    "name": "SquidLab",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1063/1.5137820",
            "metadata": {
                "abstract": "© 2020 Author(s).We present an open-source program free to download for academic use with a full user-friendly graphical interface for performing flexible and robust background subtraction and dipole fitting on magnetization data. For magnetic samples with small moment sizes or sample environments with large or asymmetric magnetic backgrounds, it can become necessary to separate background and sample contributions to each measured raw voltage measurement before fitting the dipole signal to extract magnetic moments. Originally designed for use with pressure cells on a Quantum Design MPMS3 SQUID magnetometer, SquidLab is a modular object-oriented platform implemented in Matlab with a range of importers for different widely available magnetometer systems (including MPMS, MPMS-XL, MPMS-IQuantum, MPMS3, and S700X models) and has been tested with a broad variety of background and signal types. The software allows background subtraction of baseline signals, signal preprocessing, and performing fits to dipole data using Levenberg-Marquardt non-linear least squares or a singular value decomposition linear algebra algorithm that excels at picking out noisy or weak dipole signals. A plugin system allows users to easily extend the built-in functionality with their own importers, processes, or fitting algorithms. SquidLab can be downloaded, under Academic License, from the University of Warwick depository (wrap.warwick.ac.uk/129665).",
                "authors": [
                    {
                        "name": "Coak M.J."
                    },
                    {
                        "name": "Liu C."
                    },
                    {
                        "name": "Jarvis D.M."
                    },
                    {
                        "name": "Park S."
                    },
                    {
                        "name": "Cliffe M.J."
                    },
                    {
                        "name": "Goddard P.A."
                    }
                ],
                "citationCount": 2,
                "date": "2020-02-01T00:00:00Z",
                "journal": "Review of Scientific Instruments",
                "title": "SquidLab - A user-friendly program for background subtraction and fitting of magnetization data"
            },
            "pmid": "32113437"
        }
    ],
    "topic": [
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Pure mathematics",
            "uri": "http://edamontology.org/topic_3570"
        }
    ]
}