{
    "additionDate": "2020-01-09T18:31:33Z",
    "biotoolsCURIE": "biotools:shamsaraj",
    "biotoolsID": "shamsaraj",
    "confidence_flag": "very low",
    "description": "A Random Forest Model to Predict the Activity of a Large Set of Soluble Epoxide Hydrolase Inhibitors Solely Based on a Set of Simple Fragmental Descriptors.\n\nBACKGROUND:The Soluble Epoxide Hydrolase (sEH) is a ubiquitously expressed enzyme in various tissues. The inhibition of the sEH has shown promising results to treat hypertension, alleviate pain and inflammation. OBJECTIVE:In this study, the power of machine learning has been employed to develop a predictive QSAR model for a large set of sEH inhibitors. METHODS:In this study, the random forest method was employed to make a valid model for the prediction of sEH inhibition. Besides, two new methods (Treeinterpreter python package and LIME, Local Interpretable Model-agnostic Explanations) have been exploited to explain and interpret the model.\n\n||| COMMON LINK WITH (PUB. & NAME DIFFERENT) bio.tools/pymzml (GITHUB.COM).\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'Treeinterpreter', 'pharm-sbg', 'sEH', 'sEH inhibitors'",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/shamsaraj",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-01-09T18:31:33Z",
    "name": "shamsaraj",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.2174/1386207322666191016110232",
            "metadata": {
                "abstract": "© 2019 Bentham Science Publishers.Background: The Soluble Epoxide Hydrolase (sEH) is a ubiquitously expressed enzyme in various tissues. The inhibition of the sEH has shown promising results to treat hypertension, alleviate pain and inflammation. Objective: In this study, the power of machine learning has been employed to develop a predictive QSAR model for a large set of sEH inhibitors. Methods: In this study, the random forest method was employed to make a valid model for the prediction of sEH inhibition. Besides, two new methods (Treeinterpreter python package and LIME, Local Interpretable Model-agnostic Explanations) have been exploited to explain and interpret the model. Results: The performance metrics of the model were as follows: R2=0.831, Q2=0.565, RMSE=0.552 and R2pred=0.595. The model also demonstrated good predictability on the two extra external test sets at least in terms of ranking. The Spearman’s rank correlation coefficients for external test set 1 and 2 were 0.872 and 0.673, respectively. The external test set 2 was a diverse one compared to the training set. Therefore, the model could be used for virtual screening to enrich potential sEH inhibitors among a diverse compound library. Conclusion: As the model was solely developed based on a set of simple fragmental descriptors, the model was explained by two local interpretation algorithms, and this could guide medicinal chemists to design new sEH inhibitors. Moreover, the most important general descriptors (fragments) suggested by the model were consistent with the available crystallographic data. The model is available as an executable binary at http://www.pharm-sbg.com and https://github.com/shamsaraj.",
                "authors": [
                    {
                        "name": "Shamsara J."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Combinatorial Chemistry and High Throughput Screening",
                "title": "A random forest model to predict the activity of a large set of soluble epoxide hydrolase inhibitors solely based on a set of simple fragmental descriptors"
            },
            "pmid": "31622216"
        }
    ],
    "topic": [
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Compound libraries and screening",
            "uri": "http://edamontology.org/topic_3343"
        }
    ]
}