{
    "additionDate": "2020-01-14T19:40:41Z",
    "biotoolsCURIE": "biotools:tealeaves",
    "biotoolsID": "tealeaves",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "cdmuir@hawaii.edu",
            "name": "Christopher D Muir",
            "orcidid": "https://orcid.org/0000-0003-2555-3878",
            "typeEntity": "Person"
        }
    ],
    "description": "an R package for modelling leaf temperature using energy budgets.\n\nSolve for leaf temperature using energy balance.\n\ntealeaves: an R package for modeling leaf temperature using energy budgets. Accepted in AoB PLANTS.\n\n{tealeaves} is a lightweight R package to model leaf temperature using leaf energy balance. It uses the R package units to ensure that parameters are properly specified and transformed before calculations. It allows separate lower and upper surface conductances to heat and water vapour, so sensible and latent heat loss are calculated for each surface separately. It’s straightforward to model leaf temperature over environmental gradients such as light, air temperature, humidity, and wind, or trait gradients such as leaf size or stomatal conductance.\n\nImplements models of leaf temperature using energy balance",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid temperature profile plotting",
                    "uri": "http://edamontology.org/operation_0460"
                },
                {
                    "term": "Phylogenetic tree reconstruction",
                    "uri": "http://edamontology.org/operation_3478"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "https://github.com/cdmuir/tealeaves-ms",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-01-14T19:40:41Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/cdmuir/tealeaves"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://CRAN.R-project.org/package=tealeaves"
        }
    ],
    "name": "tealeaves",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/AOBPLA/PLZ054",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press on behalf of the Annals of Botany Company.Plants must regulate leaf temperature to optimize photosynthesis, control water loss and prevent damage caused by overheating or freezing. Physical models of leaf energy budgets calculate the energy fluxes and leaf temperatures for a given set leaf and environmental parameters. These models can provide deep insight into the variation in leaf form and function, but there are few computational tools available to use these models. Here I introduce a new R package called tealeaves to make complex leaf energy budget models accessible to a broader array of plant scientists. This package enables novice users to start modelling leaf energy budgets quickly while allowing experts to customize their parameter settings. The code is open source, freely available and readily integrates with other R tools for scientific computing. This paper describes the current functionality of tealeaves, but new features will be added in future releases. This software tool will advance new research on leaf thermal physiology to advance our understanding of basic and applied plant science.",
                "authors": [
                    {
                        "name": "Muir C.D."
                    }
                ],
                "date": "2019-12-01T00:00:00Z",
                "journal": "AoB PLANTS",
                "title": "Tealeaves: An R package for modelling leaf temperature using energy budgets"
            },
            "pmcid": "PMC6899345",
            "pmid": "31844509"
        }
    ],
    "topic": [
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        }
    ]
}