{
    "additionDate": "2020-01-09T18:12:15Z",
    "biotoolsCURIE": "biotools:ARA",
    "biotoolsID": "ARA",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "szczurek@mimuw.edu.pl",
            "name": "Ewa Szczurek",
            "orcidid": "https://orcid.org/0000-0002-1320-6695",
            "typeEntity": "Person"
        }
    ],
    "description": "accurate, reliable and active histopathological image classification framework with Bayesian deep learning.\n\nThis repository contains an implementation of ARA-CNN - a Bayesian deep learning model intended for histopathological image classification.\n\nARA stands for Accurate, Reliable and Active. Any method that works on patient data needs to be accurate and reliable, meaning that in addition to very high classification accuracy it should also provide a measure of uncertainty for each prediction. ARA-CNN adheres to these requirements. Moreover, the uncertainty measurement can be used as an acquisition function in active learning, which significantly speeds up the learning process on new histopathological datasets. Uncertainty can also be used to identify mislabelled training images",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Image annotation",
                    "uri": "http://edamontology.org/operation_3553"
                },
                {
                    "term": "Anonymisation",
                    "uri": "http://edamontology.org/operation_3283"
                }
            ]
        }
    ],
    "homepage": "https://github.com/animgoeth/ARA-CNN",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-02T14:35:19.803130Z",
    "license": "MIT",
    "name": "ARA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1038/S41598-019-50587-1",
            "metadata": {
                "abstract": "© 2019, The Author(s).Machine learning algorithms hold the promise to effectively automate the analysis of histopathological images that are routinely generated in clinical practice. Any machine learning method used in the clinical diagnostic process has to be extremely accurate and, ideally, provide a measure of uncertainty for its predictions. Such accurate and reliable classifiers need enough labelled data for training, which requires time-consuming and costly manual annotation by pathologists. Thus, it is critical to minimise the amount of data needed to reach the desired accuracy by maximising the efficiency of training. We propose an accurate, reliable and active (ARA) image classification framework and introduce a new Bayesian Convolutional Neural Network (ARA-CNN) for classifying histopathological images of colorectal cancer. The model achieves exceptional classification accuracy, outperforming other models trained on the same dataset. The network outputs an uncertainty measurement for each tested image. We show that uncertainty measures can be used to detect mislabelled training samples and can be employed in an efficient active learning workflow. Using a variational dropout-based entropy measure of uncertainty in the workflow speeds up the learning process by roughly 45%. Finally, we utilise our model to segment whole-slide images of colorectal tissue and compute segmentation-based spatial statistics.",
                "authors": [
                    {
                        "name": "Raczkowski L."
                    },
                    {
                        "name": "Mozejko M."
                    },
                    {
                        "name": "Zambonelli J."
                    },
                    {
                        "name": "Szczurek E."
                    }
                ],
                "citationCount": 10,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "ARA: accurate, reliable and active histopathological image classification framework with Bayesian deep learning"
            },
            "pmcid": "PMC6778075",
            "pmid": "31586139"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}