{"credit":[{"email":"zhenling@tju.edu.cn","name":"Zhenling Peng","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"yangjy@nankai.edu.cn","name":"Jianyi Yang","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://yanglab.nankai.edu.cn/CoABind/output/CA000001/"}],"function":[{"operation":[{"term":"Protein-ligand docking","uri":"http://edamontology.org/operation_0482"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Protein sites, features and motifs","uri":"http://edamontology.org/topic_3510"},{"term":"Protein binding sites","uri":"http://edamontology.org/topic_3534"},{"term":"Protein interactions","uri":"http://edamontology.org/topic_0128"}]},"publication":[{"abstract":"© 2018 The Author(s). Motivation: Coenzyme A (CoA)-protein binding plays an important role in various cellular functions and metabolic pathways. However, no computational methods can be employed for CoA-binding residues prediction. Results: We developed three methods for the prediction of CoA- A nd CoA derivatives-binding residues, including an ab initio method SVMpred, a template-based method TemPred and a consensus-based method CoABind. In SVMpred, a comprehensive set of features are designed from two complementary sequence profiles and the predicted secondary structure and solvent accessibility. The engine for classification in SVMpred is selected as the support vector machine. For TemPred, the prediction is transferred from homologous templates in the training set, which are detected by the program HHsearch. The assessment on an independent test set consisting of 73 proteins shows that SVMpred and TemPred achieve Matthews correlation coefficient (MCC) of 0.438 and 0.481, respectively. Analysis on the predictions by SVMpred and TemPred shows that these two methods are complementary to each other. Therefore, we combined them together, forming the third method CoABind, which further improves the MCC to 0.489 on the same set. Experiments demonstrate that the proposed methods significantly outperform the state-of-the-art general-purpose ligand-binding residues prediction algorithm COACH. As the first-of-its-kind method, we anticipate CoABind to be helpful for studying CoA-protein interaction.","authors":["Meng Q.","Peng Z.","Yang J."],"cit_count":2,"doi":"10.1093/bioinformatics/bty162","journal":"Bioinformatics","title":"CoABind: A novel algorithm for Coenzyme A (CoA)- A nd CoA derivatives-binding residues prediction","year":"2018-01-01"}],"summary":{"biotoolsCURIE":"biotools:coabind","biotoolsID":"coabind","description":"Algorithm for Coenzyme A (CoA)- and CoA derivatives-binding residues prediction.","homepage":"http://yanglab.nankai.edu.cn/CoABind/","name":"CoABind"}}