{
    "additionDate": "2022-10-09T13:05:23.318327Z",
    "biotoolsCURIE": "biotools:dscn",
    "biotoolsID": "dscn",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Clj Cathy",
            "orcidid": "https://orcid.org/0000-0002-6336-5416"
        },
        {
            "name": "Enze Liu",
            "orcidid": "https://orcid.org/0000-0003-3162-461X"
        }
    ],
    "description": "DSCN (double-target selection guided by CRISPR screening and network), a method that matches expression levels in patients and gene essentialities in cell lines through spectral-clustered protein-protein interaction (PPI) network.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                }
            ]
        }
    ],
    "homepage": "https://github.com/tzcoolman/DSCN",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-10-09T13:05:36.545603Z",
    "license": "Not licensed",
    "name": "DSCN",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1009421",
            "metadata": {
                "abstract": "Copyright: © 2022 Liu et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Cancer is a complex disease with usually multiple disease mechanisms. Target combination is a better strategy than a single target in developing cancer therapies. However, target combinations are generally more difficult to be predicted. Current CRISPR-cas9 technology enables genome-wide screening for potential targets, but only a handful of genes have been screend as target combinations. Thus, an effective computational approach for selecting candidate target combinations is highly desirable. Selected target combinations also need to be translational between cell lines and cancer patients. We have therefore developed DSCN (double-target selection guided by CRISPR screening and network), a method that matches expression levels in patients and gene essentialities in cell lines through spectral-clustered protein-protein interaction (PPI) network. In DSCN, a sub-sampling approach is developed to model first-target knockdown and its impact on the PPI network, and it also facilitates the selection of a second target. Our analysis first demonstrated a high correlation of the DSCN sub-sampling-based gene knockdown model and its predicted differential gene expressions using observed gene expression in 22 pancreatic cell lines before and after MAP2K1 and MAP2K2 inhibition (R2 = 0.75). In DSCN algorithm, various scoring schemes were evaluated. The ‘diffusion-path’ method showed the most significant statistical power of differentialting known synthetic lethal (SL) versus non-SL gene pairs (P = 0.001) in pancreatic cancer. The superior performance of DSCN over existing network-based algorithms, such as OptiCon and VIPER, in the selection of target combinations is attributable to its ability to calculate combinations for any gene pairs, whereas other approaches focus on the combinations among optimized regulators in the network. DSCN’s computational speed is also at least ten times fast than that of other methods. Finally, in applying DSCN to predict target combinations and drug combinations for individual samples (DSCNi), DSCNi showed high correlation between target combinations predicted and real synergistic combinations (P = 1e-5) in pancreatic cell lines. In summary, DSCN is a highly effective computational method for the selection of target combinations.",
                "authors": [
                    {
                        "name": "Cheng L."
                    },
                    {
                        "name": "Huo Y."
                    },
                    {
                        "name": "Li L."
                    },
                    {
                        "name": "Liu E."
                    },
                    {
                        "name": "Wang L."
                    },
                    {
                        "name": "Wu H."
                    },
                    {
                        "name": "Wu X."
                    }
                ],
                "date": "2022-08-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "DSCN: Double-target selection guided by CRISPR screening and network"
            },
            "pmid": "35984840"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
