{
    "additionDate": "2021-01-18T10:01:01Z",
    "biotoolsCURIE": "biotools:mutcombinator",
    "biotoolsID": "mutcombinator",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "eunokpaek@hanyang.ac.kr",
            "name": "Eunok Paek",
            "typeEntity": "Person"
        }
    ],
    "description": "Identification of mutated peptides allowing combinatorial mutations using nucleotide-based graph search.\n\nMutCombinator - Combinatorial mutation search.\n\nMutCombinator enables us to practically identify mutated peptides from tandem mass spectra allowing combinatorial mutations during the database search. It uses an upgraded version of a variant graph, keeping track of frame information. The variant graph is indexed by nine nucleotides for fast access. Combinations of point mutations are considered, and also it can be practically applied together with a large mutation database such as COSMIC.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peptide database search",
                    "uri": "http://edamontology.org/operation_3646"
                },
                {
                    "term": "Tag-based peptide identification",
                    "uri": "http://edamontology.org/operation_3643"
                },
                {
                    "term": "de Novo sequencing",
                    "uri": "http://edamontology.org/operation_3644"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Protein molecular weight calculation",
                    "uri": "http://edamontology.org/operation_0398"
                }
            ]
        }
    ],
    "homepage": "https://prix.hanyang.ac.kr/download/mutcombinator.jsp",
    "language": [
        "Java"
    ],
    "lastUpdate": "2021-03-02T08:30:55Z",
    "name": "MutCombinator",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA504",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press.Motivation: Proteogenomics has proven its utility by integrating genomics and proteomics. Typical approaches use data from next-generation sequencing to infer proteins expressed. A sample-specific protein sequence database is often adopted to identify novel peptides from matched mass spectrometry-based proteomics; nevertheless, there is no software that can practically identify all possible forms of mutated peptides suggested by various genomic information sources. Results: We propose MutCombinator, which enables us to practically identify mutated peptides from tandem mass spectra allowing combinatorial mutations during the database search. It uses an upgraded version of a variant graph, keeping track of frame information. The variant graph is indexed by nine nucleotides for fast access. Using MutCombinator, we could identify more mutated peptides than previous methods, because combinations of point mutations are considered and also because it can be practically applied together with a large mutation database such as COSMIC. Furthermore, MutCombinator supports in-frame search for coding regions and three-frame search for non-coding regions.",
                "authors": [
                    {
                        "name": "Choi S."
                    },
                    {
                        "name": "Paek E."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "MutCombinator: Identification of mutated peptides allowing combinatorial mutations using nucleotide-based graph search"
            },
            "pmcid": "PMC7355298",
            "pmid": "32657416"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteogenomics",
            "uri": "http://edamontology.org/topic_3922"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ]
}