{
    "additionDate": "2024-02-08T18:33:16.801253Z",
    "biotoolsCURIE": "biotools:gpcrana",
    "biotoolsID": "gpcrana",
    "description": "GPCRana allows the quantitative conformational analysis of GPCR structures",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://gpcranalysis.com/#/",
    "lastUpdate": "2024-02-08T18:48:08.015019Z",
    "name": "GPCRana",
    "owner": "Friederike",
    "publication": [
        {
            "doi": "10.7554/eLife.50279",
            "metadata": {
                "abstract": "Class A G protein-coupled receptors (GPCRs) influence virtually every aspect of human physiology. Understanding receptor activation mechanism is critical for discovering novel therapeutics since about one-third of all marketed drugs target members of this family. GPCR activation is an allosteric process that couples agonist binding to G protein recruitment, with the hallmark outward movement of transmembrane helix 6 (TM6). However, what leads to TM6 movement and the key residue level changes of this movement remain less well understood. Here, we report a framework to quantify conformational changes. By analyzing the conformational changes in 234 structures from 45 class A GPCRs, we discovered a common GPCR activation pathway comprising of 34 residue pairs and 35 residues. The pathway unifies previous findings into a common activation mechanism and strings together the scattered key motifs such as CWxP, DRY, Na+ pocket, NPxxY and PIF, thereby directly linking the bottom of ligand-binding pocket with G protein coupling region. Site-directed mutagenesis experiments support this proposition and reveal that rational mutations of residues in this pathway can be used to obtain receptors that are constitutively active or inactive. The common activation pathway provides the mechanistic interpretation of constitutively activating, inactivating and disease mutations. As a module responsible for activation, the common pathway allows for decoupling of the evolution of the ligand binding site and G protein binding region. Such an architecture might have facilitated GPCRs to emerge as a highly successful family of proteins for signal transduction in nature.",
                "authors": [
                    {
                        "name": "Babu M.M."
                    },
                    {
                        "name": "Cai X."
                    },
                    {
                        "name": "Dai A."
                    },
                    {
                        "name": "Guo W."
                    },
                    {
                        "name": "Guo Y."
                    },
                    {
                        "name": "Jang W."
                    },
                    {
                        "name": "Lambert N.A."
                    },
                    {
                        "name": "Liu Z.-J."
                    },
                    {
                        "name": "Shakhnovich E."
                    },
                    {
                        "name": "Stevens R.C."
                    },
                    {
                        "name": "Wang M.-W."
                    },
                    {
                        "name": "Wu M."
                    },
                    {
                        "name": "Yang D."
                    },
                    {
                        "name": "Zhao S."
                    },
                    {
                        "name": "Zhong L."
                    },
                    {
                        "name": "Zhou Q."
                    }
                ],
                "citationCount": 251,
                "date": "2019-12-01T00:00:00Z",
                "journal": "eLife",
                "title": "Common activation mechanism of class a GPCRs"
            }
        }
    ]
}
