{
    "additionDate": "2021-11-01T12:24:37.561765Z",
    "biotoolsCURIE": "biotools:pempni",
    "biotoolsID": "pempni",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "liurong116@mail.hzau.edu.cn",
            "name": "Rong Liu",
            "orcidid": "https://orcid.org/0000-0001-9603-398X",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "PEMPNI (Predictors for Effects of Mutations on PNIs) is a computational method that could effectively predict the effects of missense mutations on protein-DNA and protein-RNA interactions. This algorithm includes an energy module and a nonenergy module. The former is based on the novel geometric partition-based energy features, and the latter is based on the structural and sequence features. The integration of multifaceted information could generate more robust predictions.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA-binding protein prediction",
                    "uri": "http://edamontology.org/operation_3901"
                },
                {
                    "term": "DNA-binding protein prediction",
                    "uri": "http://edamontology.org/operation_3900"
                },
                {
                    "term": "Variant effect prediction",
                    "uri": "http://edamontology.org/operation_0331"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Nucleic acids-binding site prediction",
                    "uri": "http://edamontology.org/operation_0420"
                }
            ]
        }
    ],
    "homepage": "http://liulab.hzau.edu.cn/PEMPNI",
    "language": [
        "Perl",
        "Python"
    ],
    "lastUpdate": "2021-11-01T12:24:37.564285Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/hzau-liulab/PEMPNI"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/hzau-liulab/PEMPNI/issues"
        }
    ],
    "name": "PEMPNI",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1008951",
            "metadata": {
                "abstract": "© 2021 Jiang et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.The binding affinities of protein-nucleic acid interactions could be altered due to missense mutations occurring in DNA- or RNA-binding proteins, therefore resulting in various diseases. Unfortunately, a systematic comparison and prediction of the effects of mutations on protein-DNA and protein-RNA interactions (these two mutation classes are termed MPDs and MPRs, respectively) is still lacking. Here, we demonstrated that these two classes of mutations could generate similar or different tendencies for binding free energy changes in terms of the properties of mutated residues. We then developed regression algorithms separately for MPDs and MPRs by introducing novel geometric partition-based energy features and interface-based structural features. Through feature selection and ensemble learning, similar computational frameworks that integrated energy- and nonenergy-based models were established to estimate the binding affinity changes resulting from MPDs and MPRs, but the selected features for the final models were different and therefore reflected the specificity of these two mutation classes. Furthermore, the proposed methodology was extended to the identification of mutations that significantly decreased the binding affinities. Extensive validations indicated that our algorithm generally performed better than the state-of-the-art methods on both the regression and classification tasks. The webserver and software are freely available at http://liulab.hzau.edu.cn/PEMPNI and https://github.com/hzau-liulab/ PEMPNI.",
                "authors": [
                    {
                        "name": "Jiang Y."
                    },
                    {
                        "name": "Liu H.-F."
                    },
                    {
                        "name": "Liu R."
                    }
                ],
                "date": "2021-04-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Systematic comparison and prediction of the effects of missense mutations on protein-DNA and protein-RNA interactions"
            },
            "pmcid": "PMC8084330",
            "pmid": "33872313",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Nucleic acids",
            "uri": "http://edamontology.org/topic_0077"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        }
    ]
}