{
    "accessibility": "Open access",
    "additionDate": "2021-02-18T12:08:51Z",
    "biotoolsCURIE": "biotools:carveme",
    "biotoolsID": "carveme",
    "cost": "Free of charge",
    "description": "CarveMe is a python-based tool for genome-scale metabolic model reconstruction.",
    "documentation": [
        {
            "type": [
                "Quick start guide"
            ],
            "url": "https://carveme.readthedocs.io/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "elixirNode": [
        "Norway"
    ],
    "homepage": "https://github.com/cdanielmachado/carveme",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-18T12:17:24Z",
    "license": "Apache-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/cdanielmachado/carveme"
        }
    ],
    "maturity": "Mature",
    "name": "CarveMe",
    "owner": "dmachado",
    "publication": [
        {
            "doi": "10.1093/nar/gky537",
            "metadata": {
                "abstract": "© The Author(s) 2018.Genome-scale metabolic models are instrumental in uncovering operating principles of cellular metabolism, for model-guided re-engineering, and unraveling cross-feeding in microbial communities. Yet, the application of genome-scale models, especially to microbial communities, is lagging behind the availability of sequenced genomes. This is largely due to the time-consuming steps of manual curation required to obtain good quality models. Here, we present an automated tool, CarveMe, for reconstruction of species and community level metabolic models. We introduce the concept of a universal model, which is manually curated and simulation ready. Starting with this universal model and annotated genome sequences, CarveMe uses a topdown approach to build single-species and community models in a fast and scalable manner. We show that CarveMe models perform closely to manually curated models in reproducing experimental phenotypes (substrate utilization and gene essentiality). Additionally, we build a collection of 74 models for human gut bacteria and test their ability to reproduce growth on a set of experimentally defined media. Finally, we create a database of 5587 bacterial models and demonstrate its potential for fast generation of microbial community models. Overall, CarveMe provides an open-source and user-friendly tool towards broadening the use of metabolic modeling in studying microbial species and communities.",
                "authors": [
                    {
                        "name": "Machado D."
                    },
                    {
                        "name": "Andrejev S."
                    },
                    {
                        "name": "Tramontano M."
                    },
                    {
                        "name": "Patil K.R."
                    }
                ],
                "citationCount": 80,
                "date": "2018-09-06T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Fast automated reconstruction of genome-scale metabolic models for microbial species and communities"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        },
        {
            "term": "Omics",
            "uri": "http://edamontology.org/topic_3391"
        }
    ],
    "version": [
        "1.4.1"
    ]
}