
{
    "credit": [
        {
            "email": "Simon.Dellicour@ulb.ac.be",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://ebe.ulb.ac.be/ebe/ebe-Welcome.html"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://ebe.ulb.ac.be/ebe/SPADS_files/SPADS_1.0_manual_221116.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical inference",
                    "uri": "http://edamontology.org/operation_3658"
                },
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R",
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Population genetics",
                "uri": "http://edamontology.org/topic_3056"
            },
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Statistics and probability",
                "uri": "http://edamontology.org/topic_2269"
            },
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/spads-1-1-spatial-population-analysis-dna-sequences.html"
        }
    ],
    "publication": [
        {
            "abstract": "spads 1.0 (for 'Spatial and Population Analysis of DNA Sequences') is a population genetic toolbox for characterizing genetic variability within and among populations from DNA sequences. In view of the drastic increase in genetic information available through sequencing methods, spads was specifically designed to deal with multilocus data sets of DNA sequences. It computes several summary statistics from populations or groups of populations, performs input file conversions for other population genetic programs and implements locus-by-locus and multilocus versions of two clustering algorithms to study the genetic structure of populations. The toolbox also includes two Matlab and r functions, Gdispal and Gdivpal, to display differentiation and diversity patterns across landscapes. These functions aim to generate interpolating surfaces based on multilocus distance and diversity indices. In the case of multiple loci, such surfaces can represent a useful alternative to multiple pie charts maps traditionally used in phylogeography to represent the spatial distribution of genetic diversity. These coloured surfaces can also be used to compare different data sets or different diversity and/or distance measures estimated on the same data set. © 2013 John Wiley & Sons Ltd.",
            "authors": [
                "Dellicour S.",
                "Mardulyn P."
            ],
            "cit_count": 48,
            "journal": "Molecular Ecology Resources",
            "pmid": "24215429",
            "title": "spads 1.0: A toolbox to perform spatial analyses on DNA sequence data sets",
            "year": "2014-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:spads",
        "biotoolsID": "spads",
        "description": "A population genetics software computing several summary statistics from populations or groups of populations, and implementing two clustering algorithms to study the genetic structure of populations. It has been specifically developed for the analysis of DNA sequences. The first aim of SPADS is to compute, on real datasets, the summary statistics computed by PhyloGeoSim on each simulated datasets.",
        "homepage": "http://ebe.ulb.ac.be/ebe/SPADS.html",
        "name": "SPADS"
    }
}