{
    "additionDate": "2020-01-14T09:45:16Z",
    "biotoolsCURIE": "biotools:TB_Portals",
    "biotoolsID": "TB_Portals",
    "confidence_flag": "tool",
    "description": "Prediction of multiple drug resistant pulmonary tuberculosis against drug sensitive pulmonary tuberculosis by CT nodular consolidation sign.\n\nInternational partnership for clinical informatics.\n\nand advanced research in tuberculosis.\n\nLeveraging clinical, genomic, and imaging data.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://tbportals.niaid.nih.gov",
    "lastUpdate": "2021-05-20T09:54:54Z",
    "name": "TB Portals",
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_016594"
        }
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/833954"
        },
        {
            "doi": "10.1016/J.MEEGID.2019.104137",
            "metadata": {
                "abstract": "© 2019Mycobacterium tuberculosis (M.tb) is the leading cause of death from an infectious disease. Drug resistant tuberculosis (DR-TB) threatens to exacerbate challenges in diagnostics and treatment. It is important to monitor strains circulating in countries with heavy burden of DR-TB, to make informed decisions about treatment, and because in these countries there is an elevated probability that DR-TB may advance to the totally drug resistant form. The TB Portals Program (TBPP, https://TBPortals.niaid.nih.gov) formed a global network of participating institutions and hospitals collecting and analyzing de-identified clinical, imaging and socioeconomic data, augmenting these with genomic sequencing results. TB Portals database includes complete M.tb genomes, with the information about spoligotypes, strains, and genomic variants related to drug resistance. Within the framework of TB Portals, we created Data Exploration Portal (DEPOT), to facilitate visualization and statistical analysis of user-defined cohorts from the entire TB Portals database. A continuing TB Portals research objective is to actively monitor and examine genomic variability that may account for observed differences in DR-TB incident rates and/or difficulties with diagnosis and treatment. Our analysis identified that several genomic variants implicated in drug resistance or improved fitness of the pathogen, were significantly more frequent in M.tb strains circulating in Belarus in comparison with other countries. Further studies are necessary to reveal whether the corresponding genomic variants may explain unusually high burden of drug-resistant M.tb in Belarus and suggest improvements for diagnostic and drug therapies.",
                "authors": [
                    {
                        "name": "Gabrielian A."
                    },
                    {
                        "name": "Engle E."
                    },
                    {
                        "name": "Harris M."
                    },
                    {
                        "name": "Wollenberg K."
                    },
                    {
                        "name": "Glogowski A."
                    },
                    {
                        "name": "Long A."
                    },
                    {
                        "name": "Hurt D.E."
                    },
                    {
                        "name": "Rosenthal A."
                    }
                ],
                "citationCount": 2,
                "date": "2020-03-01T00:00:00Z",
                "journal": "Infection, Genetics and Evolution",
                "title": "Comparative analysis of genomic variability for drug-resistant strains of Mycobacterium tuberculosis: The special case of Belarus"
            },
            "pmid": "31838261"
        }
    ],
    "toolType": [
        "Bioinformatics portal",
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        }
    ],
    "validated": 1
}