{
    "accessibility": "Open access",
    "additionDate": "2022-08-11T07:55:08.304745Z",
    "biotoolsCURIE": "biotools:autodc",
    "biotoolsID": "autodc",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "bin.cui@pku.edu.cn",
            "name": "Bin Cui",
            "typeEntity": "Person"
        },
        {
            "name": "Yang Bai",
            "orcidid": "https://orcid.org/0000-0003-3325-1642"
        }
    ],
    "description": "A tailored AutoML for disease classification from gene expression data",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                }
            ]
        }
    ],
    "homepage": "https://github.com/dingdian110/AutoDC",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-08-11T07:55:08.307214Z",
    "license": "MIT",
    "name": "AutoDC",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAC334",
            "metadata": {
                "abstract": "© 2022 The Author(s) 2022. Published by Oxford University Press. All rights reserved.Motivation: The emergence of next-generation sequencing techniques opens up tremendous opportunities for researchers to uncover the basic mechanisms of disease at the molecular level. Recently, automatic machine learning (AutoML) frameworks have been employed for genomic and epigenomic data analysis. However, to analyze those high-dimensional data, existing AutoML frameworks suffer from the following issues: (i) they could not effectively filter out the redundant features from the original data, and (ii) they usually obey the rule of feature engineering first and algorithm hyper-parameter tuning later to build the machine learning pipeline, which could lead to sub-optimal outcomes. Thus, it is an urgent need to design a new AutoML framework for high-dimensional omics data analysis. Results: We introduce a new method: AutoDC, a tailored AutoML framework, for different disease classification based on gene expression data. AutoDC designs two novel optimization strategies to improve the performance. One is that AutoDC designs a novel two-stage feature selection method to select the features with high gene contribution scores. The other is that AutoDC proposes a novel optimization method, based on a two-layer Multi-Armed Bandit framework, to jointly optimize the feature engineering, algorithm selection and algorithm hyper-parameter tuning. We apply our framework to two public gene expression datasets. Compared with three state-of-The-Art AutoML frameworks, AutoDC could effectively classify diseases with higher predictive accuracy.",
                "authors": [
                    {
                        "name": "Bai Y."
                    },
                    {
                        "name": "Cui B."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Shen Y."
                    },
                    {
                        "name": "Yang M."
                    },
                    {
                        "name": "Zhang W."
                    }
                ],
                "date": "2022-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "AutoDC: An automatic machine learning framework for disease classification"
            },
            "pmid": "35583303"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
