{
    "additionDate": "2020-01-14T08:57:16Z",
    "biotoolsCURIE": "biotools:Gplas",
    "biotoolsID": "Gplas",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "a.c.schurch@umcutrecht.nl",
            "name": "A.C. Schurch",
            "orcidid": "https://orcid.org/0000-0003-1894-7545",
            "typeRole": [
                "Maintainer"
            ]
        },
        {
            "email": "a.c.schurch@umcutrecht.nl",
            "name": "Sergio Arredondo-Alonso",
            "orcidid": "https://orcid.org/0000-0003-1894-7545",
            "typeRole": [
                "Developer",
                "Maintainer"
            ]
        }
    ],
    "description": "A comprehensive tool for plasmid analysis using short-read graphs.\n\ngplas: Binning plasmid-predicted contigs using short-read graphs",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://gitlab.com/sirarredondo/gplas/-/blob/master/README.md"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://gitlab.com/sirarredondo/gplas/-/releases/0.6.0",
            "version": "V0.6.0"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                }
            ]
        }
    ],
    "homepage": "https://gitlab.com/sirarredondo/gplas.git",
    "language": [
        "Bash",
        "R"
    ],
    "lastUpdate": "2021-09-21T12:37:15.168860Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://gitlab.com/sirarredondo/gplas/-/issues"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://gitlab.com/sirarredondo/gplas"
        }
    ],
    "name": "Gplas",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btaa233",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. Plasmids can horizontally transmit genetic traits, enabling rapid bacterial adaptation to new environments and hosts. Short-read whole-genome sequencing data are often applied to large-scale bacterial comparative genomics projects but the reconstruction of plasmids from these data is facing severe limitations, such as the inability to distinguish plasmids from each other in a bacterial genome. We developed gplas, a new approach to reliably separate plasmid contigs into discrete components using sequence composition, coverage, assembly graph information and network partitioning based on a pruned network of plasmid unitigs. Gplas facilitates the analysis of large numbers of bacterial isolates and allows a detailed analysis of plasmid epidemiology based solely on short-read sequence data.",
                "authors": [
                    {
                        "name": "Arredondo-Alonso S."
                    },
                    {
                        "name": "Bootsma M."
                    },
                    {
                        "name": "Corander J."
                    },
                    {
                        "name": "Hein Y."
                    },
                    {
                        "name": "Rogers M.R.C."
                    },
                    {
                        "name": "Schurch A.C."
                    },
                    {
                        "name": "Willems R.J.L."
                    }
                ],
                "citationCount": 6,
                "date": "2020-03-31T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Gplas: A comprehensive tool for plasmid analysis using short-read graphs"
            },
            "pmcid": "PMC7320608",
            "pmid": "32271863",
            "type": [
                "Primary"
            ],
            "version": "v0.3.0"
        },
        {
            "doi": "10.1186/s13073-020-00825-3",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Enterococcus faecium is a commensal of the gastrointestinal tract of animals and humans but also a causative agent of hospital-acquired infections. Resistance against glycopeptides and to vancomycin has motivated the inclusion of E. faecium in the WHO global priority list. Vancomycin resistance can be conferred by the vanA gene cluster on the transposon Tn1546, which is frequently present in plasmids. The vanA gene cluster can be disseminated clonally but also horizontally either by plasmid dissemination or by Tn1546 transposition between different genomic locations. Methods: We performed a retrospective study of the genomic epidemiology of 309 vancomycin-resistant E. faecium (VRE) isolates across 32 Dutch hospitals (2012–2015). Genomic information regarding clonality and Tn1546 characterization was extracted using hierBAPS sequence clusters (SC) and TETyper, respectively. Plasmids were predicted using gplas in combination with a network approach based on shared k-mer content. Next, we conducted a pairwise comparison between isolates sharing a potential epidemiological link to elucidate whether clonal, plasmid, or Tn1546 spread accounted for vanA-type resistance dissemination. Results: On average, we estimated that 59% of VRE cases with a potential epidemiological link were unrelated which was defined as VRE pairs with a distinct Tn1546 variant. Clonal dissemination accounted for 32% cases in which the same SC and Tn1546 variants were identified. Horizontal plasmid dissemination accounted for 7% of VRE cases, in which we observed VRE pairs belonging to a distinct SC but carrying an identical plasmid and Tn1546 variant. In 2% of cases, we observed the same Tn1546 variant in distinct SC and plasmid types which could be explained by mixed and consecutive events of clonal and plasmid dissemination. Conclusions: In related VRE cases, the dissemination of the vanA gene cluster in Dutch hospitals between 2012 and 2015 was dominated by clonal spread. However, we also identified outbreak settings with high frequencies of plasmid dissemination in which the spread of resistance was mainly driven by horizontal gene transfer (HGT). This study demonstrates the feasibility of distinguishing between modes of dissemination with short-read data and provides a novel assessment to estimate the relative contribution of nested genomic elements in the dissemination of vanA-type resistance.",
                "authors": [
                    {
                        "name": "Arredondo-Alonso S."
                    },
                    {
                        "name": "Corander J."
                    },
                    {
                        "name": "Schurch A.C."
                    },
                    {
                        "name": "Top J."
                    },
                    {
                        "name": "Willems R.J.L."
                    }
                ],
                "citationCount": 3,
                "date": "2021-12-01T00:00:00Z",
                "journal": "Genome Medicine",
                "title": "Mode and dynamics of vanA-type vancomycin resistance dissemination in Dutch hospitals"
            },
            "pmcid": "PMC7816424",
            "pmid": "33472670",
            "type": [
                "Usage"
            ],
            "version": "v0.6.0"
        },
        {
            "doi": "10.1101/2020.07.21.20158808",
            "type": [
                "Usage"
            ],
            "version": "v0.6.0"
        },
        {
            "doi": "10.1101/835900",
            "type": [
                "Primary"
            ],
            "version": "v0.3.0"
        }
    ],
    "relation": [
        {
            "biotoolsID": "mlplasmids",
            "type": "includes"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1,
    "version": [
        "V0.6.0",
        "V0.7.0"
    ]
}
