
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "topic": [
            {
                "term": "Machine learning",
                "uri": "http://edamontology.org/topic_3474"
            },
            {
                "term": "Medical informatics",
                "uri": "http://edamontology.org/topic_3063"
            },
            {
                "term": "Medical imaging",
                "uri": "http://edamontology.org/topic_3384"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019, © 2019 The Author(s). Published by Informa UK Limited, trading as Taylor & Francis Group.Aims: To evaluate the risk-of-hospitalization (ROH) models developed at Blue Cross Blue Shield of Louisiana (BCBSLA) and compare this approach to the DxCG risk-score algorithms utilized by many health plans. Materials and Methods: Time zero for this study was December 31, 2016. BCBSLA members were eligible for study inclusion if they were fully insured; aged 80 years or younger; and had continuous enrollment starting on or before June 1, 2016, through time zero. Up to 2 years of historical claims data from time zero per patient was included for model development. Members were excluded if they had cancer, renal failure, or were admitted for hospice. The Blue Cross ROH models were developed using (1) regularized logistic regression and (2) random decision forests (a tree ensemble learning classification method). All models were generated using Scikit-learn: Machine Learning in Python. Prognostic capabilities of DxCG risk-score algorithms were compared to those of the Blue Cross models. Results: When stratifying by the top 0.1% of members with the highest ROH, the Blue Cross logistic regression model had the highest area under the receiving operator characteristics curve (0.862) based on the result of 10-fold cross-validation. The Blue Cross random decision forests model had the highest positive predictive value (49.0%) and positive likelihood ratio (61.4), but sensitivity, specificity, negative predictive values, and negative likelihood ratios were similar across all four models. Limitations: The Blue Cross ROH models were developed and evaluated using BCBSLA data, and predictive power may fluctuate if applied to other databases. Conclusions: The predictability of the Blue Cross models show how member-specific, regional data can be used to accurately identify patients with a high ROH, which may allow healthcare workers to intervene earlier and subsequently reduce the healthcare burden for patients and providers.",
            "authors": [
                "Holloway J.",
                "Neely C.",
                "Yuan X.",
                "Zhang Y.",
                "Ouyang J.",
                "Cantrell D.",
                "Chaisson J.",
                "Bergeron T.",
                "Washington V.",
                "Nigam S."
            ],
            "cit_count": 0,
            "doi": "10.1080/13696998.2019.1666854",
            "journal": "Journal of Medical Economics",
            "pmid": "31505982",
            "title": "Evaluating the performance of a predictive modeling approach to identifying members at high-risk of hospitalization",
            "year": "2019-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:DxCG",
        "biotoolsID": "DxCG",
        "description": "> MEDIUM CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'BCBSLA', 'DxCG risk-score', 'risk-score', 'member-specific' | Evaluating the performance of a predictive modeling approach to identifying members at high-risk of hospitalization | The evolution of DxCG, the gold standard in risk adjustment and predictive modeling | Our white paper explores how DxCG risk-based predictive modeling has transformed the way healthcare is evaluated, delivered, and paid for, leading the way for value-based care initiatives across the country",
        "homepage": "https://resources.cotiviti.com/white-paper/the-evolution-of-dxcg",
        "name": "DxCG"
    }
}