{
    "accessibility": "Open access",
    "additionDate": "2022-06-09T08:46:42.005834Z",
    "biotoolsCURIE": "biotools:calmbelt",
    "biotoolsID": "calmbelt",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "suphavilaic@gis.a-star.edu.sg",
            "name": "Chayaporn Suphavilai",
            "typeEntity": "Person"
        }
    ],
    "description": "CalmBelt, an integrated framework for on-site whole genome characterization and outbreak tracking.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Dendrogram visualisation",
                    "uri": "http://edamontology.org/operation_2938"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://calmbelt-demo.mtms.dev",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-06-09T08:46:42.008438Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/BioML-CM/CalmBelt"
        }
    ],
    "name": "CalmBelt",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3389/FMED.2021.790662",
            "metadata": {
                "abstract": "Copyright © 2021 Yingtaweesittikul, Ko, Abdul Rahman, Tan, Nagarajan and Suphavilai.Background: The ongoing COVID-19 pandemic is a global health crisis caused by the spread of SARS-CoV-2. Establishing links between known cases is crucial for the containment of COVID-19. In the healthcare setting, the ability to rapidly identify potential healthcare-associated COVID-19 clusters is critical for healthcare worker and patient safety. Increasing sequencing technology accessibility has allowed routine clinical diagnostic laboratories to sequence SARS-CoV-2 in clinical samples. However, these laboratories often lack specialized informatics skills required for sequence analysis. Therefore, an on-site, intuitive sequence analysis tool that enables clinical laboratory users to analyze multiple genomes and derive clinically relevant information within an actionable timeframe is needed. Results: We propose CalmBelt, an integrated framework for on-site whole genome characterization and outbreak tracking. Nanopore sequencing technology enables on-site sequencing and construction of draft genomes for multiple SARS-CoV-2 samples within 12 h. CalmBelt's interactive interface allows users to analyse multiple SARS-CoV-2 genomes by utilizing whole genome information, collection date, and additional information such as predefined potential clusters from epidemiological investigations. CalmBelt also integrates established SARS-CoV-2 nomenclature assignments, GISAID clades and PANGO lineages, allowing users to visualize relatedness between samples together with the nomenclatures. We demonstrated multiple use cases including investigation of potential hospital transmission, mining transmission patterns in a large outbreak, and monitoring possible diagnostic-escape. Conclusions: This paper presents an on-site rapid framework for SARS-CoV-2 whole genome characterization. CalmBelt interactive web application allows non-technical users, such as routine clinical laboratory users in hospitals to determine SARS-CoV-2 variants of concern, as well as investigate the presence of potential transmission clusters. The framework is designed to be compatible with routine usage in clinical laboratories as it only requires readily available sample data, and generates information that impacts immediate infection control mitigations.",
                "authors": [
                    {
                        "name": "Abdul Rahman N."
                    },
                    {
                        "name": "Ko K."
                    },
                    {
                        "name": "Nagarajan N."
                    },
                    {
                        "name": "Suphavilai C."
                    },
                    {
                        "name": "Tan S.Y.L."
                    },
                    {
                        "name": "Yingtaweesittikul H."
                    }
                ],
                "citationCount": 2,
                "date": "2021-12-14T00:00:00Z",
                "journal": "Frontiers in Medicine",
                "title": "CalmBelt: Rapid SARS-CoV-2 Genome Characterization for Outbreak Tracking"
            },
            "pmcid": "PMC8712659",
            "pmid": "34970567"
        }
    ],
    "toolType": [
        "Web application",
        "Workbench"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ],
    "validated": 1
}
