{"credit":[{"email":"zhangjunpeng_411@yahoo.com","name":"Junpeng Zhang","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"url":"http://bioconductor.org/packages/release/bioc/manuals/miRsponge/man/miRsponge.pdf"}],"download":[{"url":"http://bioconductor.org/packages/release/bioc/src/contrib/miRsponge_1.6.0.tar.gz"}],"function":[{"operation":[{"term":"miRNA expression analysis","uri":"http://edamontology.org/operation_3792"}]}],"labels":{"collectionID":["BioConductor"],"cost":"Free of charge","language":["R"],"license":"GPL-3.0","operatingSystem":["Linux","Windows","Mac"],"toolType":["Library"],"topic":[{"term":"Medical informatics","uri":"http://edamontology.org/topic_3063"},{"term":"Gene expression","uri":"http://edamontology.org/topic_0203"},{"term":"Microarray experiment","uri":"http://edamontology.org/topic_3518"}]},"link":[{"type":"MIRROR","url":"http://bioconductor.org/packages/miRsponge/"}],"publication":[{"abstract":"© 2017 The Author(s). Background: MicroRNA (miRNA) sponges with multiple tandem miRNA binding sequences can sequester miRNAs from their endogenous target mRNAs. Therefore, miRNA sponge acting as a decoy is extremely important for long-term loss-of-function studies both in vivo and in silico. Recently, a growing number of in silico methods have been used as an effective technique to generate hypotheses for in vivo methods for studying the biological functions and regulatory mechanisms of miRNA sponges. However, most existing in silico methods only focus on studying miRNA sponge interactions or networks in cancer, the module-level properties of miRNA sponges in cancer is still largely unknown. Results: We propose a novel in silico method, called miRSM (miRNA Sponge Module) to infer miRNA sponge modules in breast cancer. We apply miRSM to the breast invasive carcinoma (BRCA) dataset provided by The Cancer Genome Altas (TCGA), and make functional validation of the computational results. We discover that most miRNA sponge interactions are module-conserved across two modules, and a minority of miRNA sponge interactions are module-specific, existing only in a single module. Through functional annotation and differential expression analysis, we also find that the modules discovered using miRSM are functional miRNA sponge modules associated with BRCA. Moreover, the module-specific miRNA sponge interactions among miRNA sponge modules may be involved in the progression and development of BRCA. Our experimental results show that miRSM is comparable to the benchmark methods in recovering experimentally confirmed miRNA sponge interactions, and miRSM outperforms the benchmark methods in identifying interactions that are related to breast cancer. Conclusions: Altogether, the functional validation results demonstrate that miRSM is a promising method to identify miRNA sponge modules and interactions, and may provide new insights for understanding the roles of miRNA sponges in cancer progression and development.","authors":["Zhang J.","Le T.D.","Liu L.","Li J."],"cit_count":4,"doi":"10.1186/s12859-017-1467-5","journal":"BMC Bioinformatics","title":"Identifying miRNA sponge modules using biclustering and regulatory scores","type":"Other","year":"2017-03-14"}],"summary":{"biotoolsCURIE":"biotools:mirsponge","biotoolsID":"mirsponge","description":"This package provides several functions to study miRNA sponge, including popular methods for identifying miRNA sponge interactions, and the integrative method to integrate miRNA sponge interactions from different methods, as well as the functions to validate miRNA sponge interactions, and infer miRNA sponge modules, conduct enrichment analysis of modules, and conduct survival analysis of modules.","homepage":"http://bioconductor.org/packages/release/bioc/html/miRsponge.html","name":"miRsponge","version":["1.6.0"]}}