
{
    "credit": [
        {
            "email": "zhuosong@gmail.com",
            "name": "Zhuo Song",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "Chengkun_wu@nudt.edu.cn",
            "name": "Chengkun Wu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/Genetalks/gtz/blob/master/README.md"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                }
            ]
        }
    ],
    "labels": {
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Data management",
                "uri": "http://edamontology.org/topic_3071"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2017 The Author(s). Background: The dramatic development of DNA sequencing technology is generating real big data, craving for more storage and bandwidth. To speed up data sharing and bring data to computing resource faster and cheaper, it is necessary to develop a compression tool than can support efficient compression and transmission of sequencing data onto the cloud storage. Results: This paper presents GTZ, a compression and transmission tool, optimized for FASTQ files. As a reference-free lossless FASTQ compressor, GTZ treats different lines of FASTQ separately, utilizes adaptive context modelling to estimate their characteristic probabilities, and compresses data blocks with arithmetic coding. GTZ can also be used to compress multiple files or directories at once. Furthermore, as a tool to be used in the cloud computing era, it is capable of saving compressed data locally or transmitting data directly into cloud by choice. We evaluated the performance of GTZ on some diverse FASTQ benchmarks. Results show that in most cases, it outperforms many other tools in terms of the compression ratio, speed and stability. Conclusions: GTZ is a tool that enables efficient lossless FASTQ data compression and simultaneous data transmission onto to cloud. It emerges as a useful tool for NGS data storage and transmission in the cloud environment. GTZ is freely available online at: https://github.com/Genetalks/gtz.",
            "authors": [
                "Xing Y.",
                "Li G.",
                "Wang Z.",
                "Feng B.",
                "Song Z.",
                "Wu C."
            ],
            "cit_count": 1,
            "doi": "10.1186/s12859-017-1973-5",
            "journal": "BMC Bioinformatics",
            "title": "GTZ: A fast compression and cloud transmission tool optimized for FASTQ files",
            "type": "Primary",
            "year": "2017-12-28"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:gtz",
        "biotoolsID": "gtz",
        "description": "A fast compression and cloud transmission tool optimized for FASTQ files.",
        "homepage": "https://github.com/Genetalks/gtz",
        "name": "GTZ"
    }
}