{
    "additionDate": "2021-03-19T08:49:09Z",
    "biotoolsCURIE": "biotools:deeplpi",
    "biotoolsID": "deeplpi",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "dshaw003@ucr.edu",
            "name": "Dipan Shaw",
            "orcidid": "https://orcid.org/0000-0001-9556-0243",
            "typeEntity": "Person"
        },
        {
            "email": "jiang@cs.ucr.edu",
            "name": "Tao Jiang",
            "typeEntity": "Person"
        },
        {
            "email": "xieminzhu@hotmail.com",
            "name": "Minzhu Xie",
            "typeEntity": "Person"
        }
    ],
    "description": "DeepLPI is a multimodal deep learning method for predicting the interactions between lncRNAs and protein isoforms.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein interaction network prediction",
                    "uri": "http://edamontology.org/operation_3094"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "RNA-binding protein prediction",
                    "uri": "http://edamontology.org/operation_3901"
                },
                {
                    "term": "Weighted correlation network analysis",
                    "uri": "http://edamontology.org/operation_3766"
                }
            ]
        }
    ],
    "homepage": "https://github.com/dls03/DeepLPI",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-27T18:23:45Z",
    "license": "MIT",
    "name": "DeepLPI",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03914-7",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Long non-coding RNAs (lncRNAs) regulate diverse biological processes via interactions with proteins. Since the experimental methods to identify these interactions are expensive and time-consuming, many computational methods have been proposed. Although these computational methods have achieved promising prediction performance, they neglect the fact that a gene may encode multiple protein isoforms and different isoforms of the same gene may interact differently with the same lncRNA. Results: In this study, we propose a novel method, DeepLPI, for predicting the interactions between lncRNAs and protein isoforms. Our method uses sequence and structure data to extract intrinsic features and expression data to extract topological features. To combine these different data, we adopt a hybrid framework by integrating a multimodal deep learning neural network and a conditional random field. To overcome the lack of known interactions between lncRNAs and protein isoforms, we apply a multiple instance learning (MIL) approach. In our experiment concerning the human lncRNA-protein interactions in the NPInter v3.0 database, DeepLPI improved the prediction performance by 4.7% in term of AUC and 5.9% in term of AUPRC over the state-of-the-art methods. Our further correlation analyses between interactive lncRNAs and protein isoforms also illustrated that their co-expression information helped predict the interactions. Finally, we give some examples where DeepLPI was able to outperform the other methods in predicting mouse lncRNA-protein interactions and novel human lncRNA-protein interactions. Conclusion: Our results demonstrated that the use of isoforms and MIL contributed significantly to the improvement of performance in predicting lncRNA and protein interactions. We believe that such an approach would find more applications in predicting other functional roles of RNAs and proteins.",
                "authors": [
                    {
                        "name": "Chen H."
                    },
                    {
                        "name": "Jiang T."
                    },
                    {
                        "name": "Shaw D."
                    },
                    {
                        "name": "Xie M."
                    }
                ],
                "citationCount": 2,
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "DeepLPI: a multimodal deep learning method for predicting the interactions between lncRNAs and protein isoforms"
            },
            "pmcid": "PMC7814738",
            "pmid": "33461501"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ]
}
