
{
    "credit": [
        {
            "email": "jianguox@ualberta.ca",
            "name": "Jianguo Xia",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.wishartlab.com/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://wishart.biology.ualberta.ca/metabominer/design.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic labeling",
                    "uri": "http://edamontology.org/operation_3715"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "NMR",
                "uri": "http://edamontology.org/topic_0593"
            },
            {
                "term": "Metabolomics",
                "uri": "http://edamontology.org/topic_3172"
            },
            {
                "term": "Imaging",
                "uri": "http://edamontology.org/topic_3382"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/metabominer-identification-metabolites-2d-nmr-spectra-complex-biofluids.html"
        }
    ],
    "publication": [
        {
            "abstract": "Background: One-dimensional (1D) 1H nuclear magnetic resonance (NMR) spectroscopy is widely used in metabolomic studies involving biofluids and tissue extracts. There are several software packages that support compound identification and quantification via 1D 1H NMR by spectral fitting techniques. Because 1D 1H NMR spectra are characterized by extensive peak overlap or spectral congestion, two-dimensional (2D) NMR, with its increased spectral resolution, could potentially improve and even automate compound identification or quantification. However, the lack of dedicated software for this purpose significantly restricts the application of 2D NMR methods to most metabolomic studies. Results: We describe a standalone graphics software tool, called MetaboMiner, which can be used to automatically or semi-automatically identify metabolites in complex biofluids from 2D NMR spectra. MetaboMiner is able to handle both 1H-1H total correlation spectroscopy (TOCSY) and 1H-13C heteronuclear single quantum correlation (HSQC) data. It identifies compounds by comparing 2D spectral patterns in the NMR spectrum of the biofluid mixture with specially constructed libraries containing reference spectra of ∼500 pure compounds. Tests using a variety of synthetic and real spectra of compound mixtures showed that MetaboMiner is able to identify >80% of detectable metabolites from good quality NMR spectra. Conclusion: MetaboMiner is a freely available, easy-to-use, NMR-based metabolomics tool that facilitates automatic peak processing, rapid compound identification, and facile spectrum annotation from either 2D TOCSY or HSQC spectra. Using comprehensive reference libraries coupled with robust algorithms for peak matching and compound identification, the program greatly simplifies the process of metabolite identification in complex 2D NMR spectra. © 2008 Xia et al; licensee BioMed Central Ltd.",
            "authors": [
                "Xia J.",
                "Bjorndahl T.C.",
                "Tang P.",
                "Wishart D.S."
            ],
            "cit_count": 117,
            "journal": "BMC Bioinformatics",
            "pmid": "19040747",
            "title": "MetaboMiner - Semi-automated identification of metabolites from 2D NMR spectra of complex biofluids",
            "year": "2008-11-28"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:metabominer",
        "biotoolsID": "metabominer",
        "description": "Tool which can be used to automatically or semi-automatically identify metabolites in complex biofluids from 2D NMR spectra. It is able to handle both 1H-1H total correlation spectroscopy (TOCSY) and 1H-13C heteronuclear single quantum correlation (HSQC) data.",
        "homepage": "http://wishart.biology.ualberta.ca/metabominer/",
        "name": "MetaboMiner"
    }
}