{
    "additionDate": "2017-02-10T11:35:50Z",
    "biotoolsCURIE": "biotools:gfinder",
    "biotoolsID": "gfinder",
    "description": "Characterize the different gene classes in the list using annotations of various types from several different sources.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene functional annotation",
                    "uri": "http://edamontology.org/operation_3672"
                }
            ]
        }
    ],
    "homepage": "http://www.medinfopoli.polimi.it/GFINDer/",
    "lastUpdate": "2021-04-15T06:16:14Z",
    "name": "GFINDer",
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_008868"
        }
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Phenotype analysis is commonly recognized to be of great importance for gaining insight into genetic interaction underlying inherited diseases. However, few computational contributions have been proposed for this purpose, mainly owing to lack of controlled clinical information easily accessible and structured for computational genome-wise analyses. We developed and made available through GFINDer web server an original approach for the analysis of genetic disorder related genes by exploiting the information on genetic diseases and their clinical phenotypes present in textual form within the Online Mendelian Inheritance in Man (OMIM) database. Because several synonyms for the same name and different names for overlapping concepts are often used in OMIM, we first normalized phenotype location descriptions reducing them to a list of unique controlled terms representing phenotype location categories. Then, we hierarchically structured them and the correspondent genetic diseases according to their topology and granularity of description, respectively. Thus, in GFINDer we could implement specific Genetic Disorders modules for the analysis of these structured data. Such modules allow to automatically annotate user-classified gene lists with updated disease and clinical information, classify them according to the genetic syndrome and the phenotypic location categories, and statistically identify the most relevant categories in each gene class. GFINDer is available for non-profit use at http://www.bioinformatics.polimi.it/GFINDer/. © 2005 Oxford University Press.",
                "authors": [
                    {
                        "name": "Galati O."
                    },
                    {
                        "name": "Masseroli M."
                    },
                    {
                        "name": "Pinciroli F."
                    }
                ],
                "citationCount": 50,
                "date": "2005-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "GFINDer: Genetic disease and phenotype location statistical analysis and mining of dynamically annotated gene lists"
            },
            "pmid": "15980570"
        },
        {
            "metadata": {
                "abstract": "Statistical and clustering analyses of gene expression results from high-density microarray experiments produce lists of hundreds of genes regulated differentially, or with particular expression profiles, in the conditions under study. Independent of the microarray platforms and analysis methods used, these lists must be biologically interpreted to gain a better knowledge of the patho-physiological phenomena involved. To this end, numerous biological annotations are available within heterogeneous and widely distributed databases. Although several tools have been developed for annotating lists of genes, most of them do not give methods for evaluating the relevance of the annotations provided, or for estimating the functional bias introduced by the gene set on the array used to identify the gene list considered. We developed Genome Functional INtegrated Discoverer (GFINDer), a web server able to automatically provide large-scale lists of user-classified genes with functional profiles biologically characterizing the different gene classes in the list. GFINDer automatically retrieves annotations of several functional categories from different sources, identifies the categories enriched in each class of a user-classified gene list and calculates statistical significance values for each category. Moreover, GFINDer enables the functional classification of genes according to mined functional categories and the statistical analysis is of the classifications obtained, aiding better interpretation of microarray experiment results. GFINDer is available online at http://www.medinfopoli.polimi.it/GFINDer/. © Oxford University Press 2004; all rights reserved.",
                "authors": [
                    {
                        "name": "Martucci D."
                    },
                    {
                        "name": "Masseroli M."
                    },
                    {
                        "name": "Pinciroli F."
                    }
                ],
                "citationCount": 59,
                "date": "2004-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "GFINDer: Genome Function INtegrated Discoverer through dynamic annotation, statistical analysis, and mining"
            },
            "pmid": "15215397"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1
}
