{
    "additionDate": "2019-11-14T19:48:27Z",
    "biotoolsCURIE": "biotools:PPNID",
    "biotoolsID": "PPNID",
    "confidence_flag": "tool",
    "description": "PPNID: a manually curated reference database and identification tool for plant-parasitic nematode.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/xueqing4083/PPNID/blob/master/Tutorial.pdf"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/xueqing4083/PPNID",
    "lastUpdate": "2021-01-17T20:14:06Z",
    "license": "GPL-3.0",
    "name": "PPNID",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ707",
            "metadata": {
                "abstract": "© 2020 Oxford University Press. All rights reserved.Motivation: The phylum Nematoda comprises the most cosmopolitan and abundant metazoans on Earth and plant-parasitic nematodes represent one of the most significant nematode groups, causing severe losses in agriculture. Practically, the demands for accurate nematode identification are high for ecological, agricultural, taxonomic and phylogenetic researches. Despite their importance, the morphological diagnosis is often a difficult task due to phenotypic plasticity and the absence of clear diagnostic characters while molecular identification is very difficult due to the problematic database and complex genetic background. Results: The present study attempts to make up for currently available databases by creating a manually-curated database including all up-to-date authentic barcoding sequences. To facilitate the laborious process associated with the interpretation and identification of a given query sequence, we developed an automatic software pipeline for rapid species identification. The incorporated alignment function facilitates the examination of mutation distribution and therefore also reveals nucleotide autapomorphies, which are important in species delimitation. The implementation of genetic distance, plot and maximum likelihood phylogeny analysis provides more powerful optimality criteria than similarity searching and facilitates species delimitation using evolutionary or phylogeny species concepts. The pipeline streamlines several functions to facilitate more precise data analyses, and the subsequent interpretation is easy and straightforward.",
                "authors": [
                    {
                        "name": "Bert W."
                    },
                    {
                        "name": "Braun-Miyara S."
                    },
                    {
                        "name": "Bucki P."
                    },
                    {
                        "name": "Karssen G."
                    },
                    {
                        "name": "Qing X."
                    },
                    {
                        "name": "Wang M."
                    }
                ],
                "citationCount": 7,
                "date": "2020-02-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "PPNID: A reference database and molecular identification pipeline for plant-parasitic nematodes"
            },
            "pmid": "31529041"
        }
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
