
{
    "credit": [
        {
            "name": "ugent.be",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "kathleen.marchal@intec.ugent.be",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://bioinformatics.intec.ugent.be/epsilon/index.html"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Gene expression data",
                        "uri": "http://edamontology.org/data_2603"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Gene expression QTL analysis",
                    "uri": "http://edamontology.org/operation_3232"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Pathway or network",
                        "uri": "http://edamontology.org/data_2600"
                    }
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BIG N2N",
            "UGent"
        ],
        "language": [
            "MATLAB",
            "C++"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Motivation: When genomic data are associated with gene expression data, the resulting expression quantitative trait loci (eQTL) will likely span multiple genes. eQTL prioritization techniques can be used to select the most likely causal gene affecting the expression of a target gene from a list of candidates. As an input, these techniques use physical interaction networks that often contain highly connected genes and unreliable or irrelevant interactions that can interfere with the prioritization process. We present EPSILON, an extendable framework for eQTL prioritization, which mitigates the effect of highly connected genes and unreliable interactions by constructing a local network before a network-based similaritymeasure is applied to select the true causal gene. Results: We tested the new method on three eQTL datasets derived from yeast data using three different association techniques. A physical interaction network was constructed, and each eQTL in each dataset was prioritized using the EPSILON approach: first, a local network was constructed using a k-trials shortest path algorithm, followed by the calculation of a network-based similarity measure. Three similarity measures were evaluated: random walks, the Laplacian Exponential Diffusion kernel and the Regularized Commute-Time kernel. The aim was to predict knockout interactions from a yeast knockout compendium. EPSILON outperformed two reference prioritization methods, random assignment and shortest path prioritization. Next, we found that using a local network significantly increased prioritization performance in terms of predicted knockout pairs when compared with using exactly the same network similarity measures on the global network, with an average increase in prioritization performance of 8 percentage points (P<10-5). © 2013 The Author. Published by Oxford University Press. All rights reserved.",
            "authors": [
                "Verbeke L.P.C.",
                "Cloots L.",
                "Demeester P.",
                "Fostier J.",
                "Marchal K."
            ],
            "cit_count": 7,
            "doi": "10.1093/bioinformatics/btt142",
            "journal": "Bioinformatics",
            "title": "EPSILON: An eQTL prioritization framework using similarity measures derived from local networks",
            "type": "Primary",
            "year": "2013-05-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:epsilon",
        "biotoolsID": "epsilon",
        "description": "EQTL prioritization using similarity measures derived from local interaction networks.",
        "homepage": "http://bioinformatics.intec.ugent.be/epsilon/index.html",
        "name": "EPSILON",
        "version": [
            "1"
        ]
    }
}