{"credit":[{"email":"ealexov@clemson.edu","name":"Emil Alexov","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://compbio.clemson.edu/SAMPDI/"}],"function":[{"operation":[{"term":"Residue interaction calculation","uri":"http://edamontology.org/operation_0248"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Biophysics","uri":"http://edamontology.org/topic_3306"},{"term":"Protein binding sites","uri":"http://edamontology.org/topic_3534"},{"term":"Sequence sites, features and motifs","uri":"http://edamontology.org/topic_0160"}]},"publication":[{"abstract":"© The Author 2017. Published by Oxford University Press. All rights reserved.Motivation Protein-DNA interactions are essential for regulating many cellular processes, such as transcription, replication, recombination and translation. Amino acid mutations occurring in DNA-binding proteins have profound effects on protein-DNA binding and are linked with many diseases. Hence, accurate and fast predictions of the effects of mutations on protein-DNA binding affinity are essential for understanding disease-causing mechanisms and guiding plausible treatments. Results Here we report a new method Single Amino acid Mutation binding free energy change of Protein-DNA Interaction (SAMPDI). The method utilizes modified Molecular Mechanics Poisson-Boltzmann Surface Area (MM/PBSA) approach along with an additional set of knowledge-based terms delivered from investigations of the physicochemical properties of protein-DNA complexes. The method is benchmarked against experimentally determined binding free energy changes caused by 105 mutations in 13 proteins (compiled ProNIT database and data from recent references), and results in correlation coefficient of 0.72.","authors":["Peng Y.","Sun L.","Jia Z.","Li L.","Alexov E."],"cit_count":5,"doi":"10.1093/bioinformatics/btx698","journal":"Bioinformatics","title":"Predicting protein-DNA binding free energy change upon missense mutations using modified MM/PBSA approach: SAMPDI webserver","year":"2018-03-01"}],"summary":{"biotoolsCURIE":"biotools:sampdi","biotoolsID":"sampdi","description":"Single Amino acid Mutation binding free energy change of Protein–DNA Interaction.","homepage":"http://compbio.clemson.edu/SAMPDI/","name":"SAMPDI"}}