{
    "name": "CellPD", 
    "description": "Quantifying differences in cell line population dynamics.", 
    "homepage": "https://sourceforge.net/projects/cellpd/", 
    "biotoolsID": "cellpd", 
    "biotoolsCURIE": "biotools:cellpd", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3660", 
                    "term": "Metabolic network modelling"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Library"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_2259", 
            "term": "Systems biology"
        }, 
        {
            "uri": "http://edamontology.org/topic_2229", 
            "term": "Cell biology"
        }, 
        {
            "uri": "http://edamontology.org/topic_0602", 
            "term": "Molecular interactions, pathways and networks"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "Python"
    ], 
    "license": "MIT", 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "https://sourceforge.net/projects/cellpd/", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1186/s12918-016-0337-5", 
            "pmid": null, 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Quantifying differences in cell line population dynamics using CellPD", 
                "abstract": "© 2016 The Author(s).Background: The increased availability of high-throughput datasets has revealed a need for reproducible and accessible analyses which can quantitatively relate molecular changes to phenotypic behavior. Existing tools for quantitative analysis generally require expert knowledge. Results: CellPD (cell phenotype digitizer) facilitates quantitative phenotype analysis, allowing users to fit mathematical models of cell population dynamics without specialized training. CellPD requires one input (a spreadsheet) and generates multiple outputs including parameter estimation reports, high-quality plots, and minable XML files. We validated CellPD's estimates by comparing it with a previously published tool (cellGrowth) and with Microsoft Excel's built-in functions. CellPD correctly estimates the net growth rate of cell cultures and is more robust to data sparsity than cellGrowth. When we tested CellPD's usability, biologists (without training in computational modeling) ran CellPD correctly on sample data within 30 min. To demonstrate CellPD's ability to aid in the analysis of high throughput data, we created a synthetic high content screening (HCS) data set, where a simulated cell line is exposed to two hypothetical drug compounds at several doses. CellPD correctly estimates the drug-dependent birth, death, and net growth rates. Furthermore, CellPD's estimates quantify and distinguish between the cytostatic and cytotoxic effects of both drugs-analyses that cannot readily be performed with spreadsheet software such as Microsoft Excel or without specialized computational expertise and programming environments. Conclusions: CellPD is an open source tool that can be used by scientists (with or without a background in computational or mathematical modeling) to quantify key aspects of cell phenotypes (such as cell cycle and death parameters). Early applications of CellPD may include drug effect quantification, functional analysis of gene knockout experiments, data quality control, minable big data generation, and integration of biological data with computational models.", 
                "date": "2016-09-21T00:00:00Z", 
                "citationCount": 4, 
                "authors": [
                    {
                        "name": "Juarez E.F."
                    }, 
                    {
                        "name": "Lau R."
                    }, 
                    {
                        "name": "Friedman S.H."
                    }, 
                    {
                        "name": "Ghaffarizadeh A."
                    }, 
                    {
                        "name": "Jonckheere E."
                    }, 
                    {
                        "name": "Agus D.B."
                    }, 
                    {
                        "name": "Mumenthaler S.M."
                    }, 
                    {
                        "name": "Macklin P."
                    }
                ], 
                "journal": "BMC Systems Biology"
            }
        }
    ], 
    "credit": [
        {
            "name": "Paul Macklin", 
            "email": "Paul.Macklin@MathCancer.org", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "d.gabrielaitis", 
    "additionDate": "2018-08-18T10:17:47Z", 
    "lastUpdate": "2018-12-10T12:59:01Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}