
{
    "credit": [
        {
            "email": "sebastien.artigaud@gmx.com",
            "name": "Sebastien Artigaud",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://bioconductor.org/packages/release/bioc/html/prot2D.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/prot2D_1.12.0.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Differential protein expression analysis",
                    "uri": "http://edamontology.org/operation_3741"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "language": [
            "R"
        ],
        "license": "GPL-2.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "Protein expression",
                "uri": "http://edamontology.org/topic_0108"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Background: Two-dimensional electrophoresis is a crucial method in proteomics that allows the characterization of proteins' function and expression. This usually implies the identification of proteins that are differentially expressed between two contrasting conditions, for example, healthy versus diseased in human proteomics biomarker discovery and stressful conditions versus control in animal experimentation. The statistical procedures that lead to such identifications are critical steps in the 2-DE analysis workflow. They include a normalization step and a test and probability correction for multiple testing. Statistical issues caused by the high dimensionality of the data and large-scale multiple testing have been a more active topic in transcriptomics than proteomics, especially in microarray analysis. We thus propose to adapt innovative statistical tools developed for microarray analysis and incorporate them in the 2-DE analysis pipeline. Results: In this article, we evaluate the performance of different normalization procedures, different statistical tests and false discovery rate calculation methods with both real and simulated datasets. We demonstrate that the use of statistical procedures adapted from microarrays lead to notable increase in power as well as a minimization of false-positive discovery rate. More specifically, we obtained the best results in terms of reliability and sensibility when using the 'moderate t-test' from Smyth in association with classic false discovery rate from Benjamini and Hochberg. Availability: The methods discussed are freely available in the 'prot2D' open source R-package from Bioconductor (http://www.bioconductor.org//) under the terms of the GNU General Public License (version 2 or later). © 2013 The Author 2013.",
            "authors": [
                "Artigaud S.",
                "Gauthier O.",
                "Pichereau V."
            ],
            "cit_count": 12,
            "doi": "10.1093/bioinformatics/btt464",
            "journal": "Bioinformatics",
            "pmid": "23986565",
            "title": "Identifying differentially expressed proteins in two-dimensional electrophoresis experiments: Inputs from transcriptomics statistical tools",
            "type": "Primary",
            "year": "2013-11-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:prot2d",
        "biotoolsID": "prot2d",
        "description": "The purpose of this package is to analyze (i.e. Normalize and select significant spots) data issued from 2D GEl experiments.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/prot2D.html",
        "name": "prot2D",
        "version": [
            "1.12.0"
        ]
    }
}