
{
    "credit": [
        {
            "email": "huanglab@hust.edu.cn",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://huanglab.phys.hust.edu.cn/hpepdock/help.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Blind peptide database search",
                    "uri": "http://edamontology.org/operation_3647"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Proteomics"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Small molecules",
                "uri": "http://edamontology.org/topic_0154"
            },
            {
                "term": "Molecular modelling",
                "uri": "http://edamontology.org/topic_2275"
            },
            {
                "term": "Proteomics",
                "uri": "http://edamontology.org/topic_0121"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author(s) 2018. Published by Oxford University Press on behalf of Nucleic Acids Research. Protein-peptide interactions are crucial in many cellular functions. Therefore, determining the structure of protein-peptide complexes is important for understanding the molecular mechanism of related biological processes and developing peptide drugs. HPEPDOCK is a novel web server for blind protein-peptide docking through a hierarchical algorithm. Instead of running lengthy simulations to refine peptide conformations, HPEPDOCK considers the peptide flexibility through an ensemble of peptide conformations generated by our MODPEP program. For blind global peptide docking, HPEPDOCK obtained a success rate of 33.3% in binding mode prediction on a benchmark of 57 unbound cases when the top 10 models were considered, compared to 21.1% for pepATTRACT server. HPEPDOCK also performed well in docking against homology models and obtained a success rate of 29.8% within top 10 predictions. For local peptide docking, HPEPDOCK achieved a high success rate of 72.6% on a benchmark of 62 unbound cases within top 10 predictions, compared to 45.2% for HADDOCK peptide protocol. Our HPEPDOCK server is computationally efficient and consumed an average of 29.8 mins for a global peptide docking job and 14.2 mins for a local peptide docking job. The HPEPDOCK web server is available at http://huanglab.phys.hust.edu.cn/hpepdock/.",
            "authors": [
                "Zhou P.",
                "Jin B.",
                "Li H.",
                "Huang S.-Y."
            ],
            "cit_count": 4,
            "doi": "10.1093/nar/gky357",
            "journal": "Nucleic Acids Research",
            "title": "HPEPDOCK: A web server for blind peptide-protein docking based on a hierarchical algorithm",
            "year": "2018-07-02"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:hpepdock",
        "biotoolsID": "hpepdock",
        "description": "Blind protein–peptide docking through a hierarchical algorithm. Instead of running lengthy simulations to refine peptide conformations, it considers the peptide flexibility through an ensemble of peptide conformations generated by our MODPEP program.",
        "homepage": "http://huanglab.phys.hust.edu.cn/hpepdock/",
        "name": "HPEPDOCK"
    }
}