{
    "accessibility": "Open access",
    "additionDate": "2017-01-13T13:13:50Z",
    "biotoolsCURIE": "biotools:blast",
    "biotoolsID": "blast",
    "collectionID": [
        "BLAST"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "email": "blast-help@ncbi.nlm.nih.gov",
            "name": "BLAST Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A tool that finds regions of similarity between biological sequences. The program compares nucleotide or protein sequences to sequence databases and calculates the statistical significance.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://blast.ncbi.nlm.nih.gov/Blast.cgi?CMD=Web&PAGE_TYPE=BlastDocs"
        }
    ],
    "editPermission": {
        "authors": [
            "ELIXIR-EE",
            "sergitobara"
        ],
        "type": "group"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence",
                        "uri": "http://edamontology.org/data_2044"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                },
                {
                    "term": "Sequence similarity search",
                    "uri": "http://edamontology.org/operation_0346"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Sequence search results",
                        "uri": "http://edamontology.org/data_0857"
                    }
                }
            ]
        }
    ],
    "homepage": "https://blast.ncbi.nlm.nih.gov/Blast.cgi",
    "lastUpdate": "2022-06-27T14:04:18.533624Z",
    "maturity": "Mature",
    "name": "BLAST",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btw305",
            "metadata": {
                "abstract": "© 2016 The Author 2016. Published by Oxford University Press.Motivation: Over the last decades, vast numbers of sequences were deposited in public databases. Bioinformatics tools allow homology and consequently functional inference for these sequences. New profile-based homology search tools have been introduced, allowing reliable detection of remote homologs, but have not been systematically benchmarked. To provide such a comparison, which can guide bioinformatics workflows, we extend and apply our previously developed benchmark approach to evaluate the 'next generation' of profile-based approaches, including CS-BLAST, HHSEARCH and PHMMER, in comparison with the non-profile based search tools NCBI-BLAST, USEARCH, UBLAST and FASTA. Method: We generated challenging benchmark datasets based on protein domain architectures within either the PFAM + Clan, SCOP/Superfamily or CATH/Gene3D domain definition schemes. From each dataset, homologous and non-homologous protein pairs were aligned using each tool, and standard performance metrics calculated. We further measured congruence of domain architecture assignments in the three domain databases. Results: CSBLAST and PHMMER had overall highest accuracy. FASTA, UBLAST and USEARCH showed large trade-offs of accuracy for speed optimization. Conclusion: Profile methods are superior at inferring remote homologs but the difference in accuracy between methods is relatively small. PHMMER and CSBLAST stand out with the highest accuracy, yet still at a reasonable computational cost. Additionally, we show that less than 0.1% of Swiss-Prot protein pairs considered homologous by one database are considered non-homologous by another, implying that these classifications represent equivalent underlying biological phenomena, differing mostly in coverage and granularity. Availability and Implementation: Benchmark datasets and all scripts are placed at (http://sonnhammer.org/download/Homology-benchmark).",
                "authors": [
                    {
                        "name": "Forslund K."
                    },
                    {
                        "name": "Saripella G.V."
                    },
                    {
                        "name": "Sonnhammer E.L.L."
                    }
                ],
                "citationCount": 6,
                "date": "2016-09-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Benchmarking the next generation of homology inference tools"
            },
            "pmcid": "PMC5013910",
            "pmid": "27256311",
            "type": [
                "Benchmarking study"
            ]
        },
        {
            "doi": "10.1093/nar/gkn201",
            "metadata": {
                "abstract": "Basic Local Alignment Search Tool (BLAST) is a sequence similarity search program. The public interface of BLAST, http://www.ncbi.nlm.nih.gov/blast, at the NCBI website has recently been reengineered to improve usability and performance. Key new features include simplified search forms, improved navigation, a list of recent BLAST results, saved search strategies and a documentation directory. Here, we describe the BLAST web application's new features, explain design decisions and outline plans for future improvement.",
                "authors": [
                    {
                        "name": "Johnson M."
                    },
                    {
                        "name": "Madden T.L."
                    },
                    {
                        "name": "McGinnis S."
                    },
                    {
                        "name": "Merezhuk Y."
                    },
                    {
                        "name": "Raytselis Y."
                    },
                    {
                        "name": "Zaretskaya I."
                    }
                ],
                "citationCount": 1895,
                "date": "2008-01-01T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "NCBI BLAST: a better web interface."
            },
            "pmcid": "PMC2447716",
            "pmid": "18440982",
            "type": [
                "Other"
            ]
        },
        {
            "doi": "10.1093/nar/gkt282",
            "metadata": {
                "abstract": "The Basic Local Alignment Search Tool (BLAST) website at the National Center for Biotechnology (NCBI) is an important resource for searching and aligning sequences. A new BLAST report allows faster loading of alignments, adds navigation aids, allows easy downloading of subject sequences and reports and has improved usability. Here, we describe these improvements to the BLAST report, discuss design decisions, describe other improvements to the search page and database documentation and outline plans for future development. The NCBI BLAST URL is http://blast.ncbi.nlm.nih.gov.",
                "authors": [
                    {
                        "name": "Boratyn G.M."
                    },
                    {
                        "name": "Camacho C."
                    },
                    {
                        "name": "Cooper P.S."
                    },
                    {
                        "name": "Coulouris G."
                    },
                    {
                        "name": "Fong A."
                    },
                    {
                        "name": "Ma N."
                    },
                    {
                        "name": "Madden T.L."
                    },
                    {
                        "name": "Matten W.T."
                    },
                    {
                        "name": "McGinnis S.D."
                    },
                    {
                        "name": "Merezhuk Y."
                    },
                    {
                        "name": "Raytselis Y."
                    },
                    {
                        "name": "Sayers E.W."
                    },
                    {
                        "name": "Tao T."
                    },
                    {
                        "name": "Ye J."
                    },
                    {
                        "name": "Zaretskaya I."
                    }
                ],
                "citationCount": 569,
                "date": "2013-01-01T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "BLAST: a more efficient report with usability improvements."
            },
            "pmcid": "PMC3692093",
            "pmid": "23609542",
            "type": [
                "Other"
            ]
        },
        {
            "doi": "10.1016/S0022-2836(05)80360-2",
            "metadata": {
                "abstract": "A new approach to rapid sequence comparison, basic local alignment search tool (BLAST), directly approximates alignments that optimize a measure of local similarity, the maximal segment pair (MSP) score. Recent mathematical results on the stochastic properties of MSP scores allow an analysis of the performance of this method as well as the statistical significance of alignments it generates. The basic algorithm is simple and robust; it can be implemented in a number of ways and applied in a variety of contexts including straight-forward DNA and protein sequence database searches, motif searches, gene identification searches, and in the analysis of multiple regions of similarity in long DNA sequences. In addition to its flexibility and tractability to mathematical analysis, BLAST is an order of magnitude faster than existing sequence comparison tools of comparable sensitivity. © 1990, Academic Press Limited. All rights reserved.",
                "authors": [
                    {
                        "name": "Altschul S.F."
                    },
                    {
                        "name": "Gish W."
                    },
                    {
                        "name": "Lipman D.J."
                    },
                    {
                        "name": "Miller W."
                    },
                    {
                        "name": "Myers E.W."
                    }
                ],
                "citationCount": 67583,
                "date": "1990-01-01T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "Basic local alignment search tool"
            },
            "pmid": "2231712",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web API",
        "Web application"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}
