{
    "additionDate": "2018-06-17T16:11:20Z",
    "biotoolsCURIE": "biotools:dimm-sc",
    "biotoolsID": "dimm-sc",
    "credit": [
        {
            "email": "wei.chen@chp.edu",
            "name": "Wei Chen",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "hum@ccf.org",
            "name": "Ming Hu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Dirichlet mixture model for clustering droplet-based single cell transcriptomic data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://www.pitt.edu/~wec47/singlecell.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence clustering",
                    "uri": "http://edamontology.org/operation_0291"
                }
            ]
        }
    ],
    "homepage": "https://www.pitt.edu/~wec47/singlecell.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "DIMM-SC",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btx490",
            "metadata": {
                "abstract": "© 2017 The Author.Motivation: Single cell transcriptome sequencing (scRNA-Seq) has become a revolutionary tool to study cellular and molecular processes at single cell resolution. Among existing technologies, the recently developed droplet-based platform enables efficient parallel processing of thousands of single cells with direct counting of transcript copies using Unique Molecular Identifier (UMI). Despite the technology advances, statistical methods and computational tools are still lacking for analyzing droplet-based scRNA-Seq data. Particularly, model-based approaches for clustering large-scale single cell transcriptomic data are still under-explored. Results: We developed DIMM-SC, a Dirichlet Mixture Model for clustering droplet-based Single Cell transcriptomic data. This approach explicitly models UMI count data from scRNA-Seq experiments and characterizes variations across different cell clusters via a Dirichlet mixture prior. We performed comprehensive simulations to evaluate DIMM-SC and compared it with existing clustering methods such as K-means, CellTree and Seurat. In addition, we analyzed public scRNA-Seq datasets with known cluster labels and in-house scRNA-Seq datasets from a study of systemic sclerosis with prior biological knowledge to benchmark and validate DIMM-SC. Both simulation studies and real data applications demonstrated that overall, DIMM-SC achieves substantially improved clustering accuracy and much lower clustering variability compared to other existing clustering methods. More importantly, as a model-based approach, DIMM-SC is able to quantify the clustering uncertainty for each single cell, facilitating rigorous statistical inference and biological interpretations, which are typically unavailable from existing clustering methods.",
                "authors": [
                    {
                        "name": "Sun Z."
                    },
                    {
                        "name": "Wang T."
                    },
                    {
                        "name": "Deng K."
                    },
                    {
                        "name": "Wang X.-F."
                    },
                    {
                        "name": "Lafyatis R."
                    },
                    {
                        "name": "Ding Y."
                    },
                    {
                        "name": "Hu M."
                    },
                    {
                        "name": "Chen W."
                    }
                ],
                "citationCount": 14,
                "date": "2018-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "DIMM-SC: A Dirichlet mixture model for clustering droplet-based single cell transcriptomic data"
            }
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        }
    ],
    "validated": 1
}