{
    "additionDate": "2018-10-31T17:53:15Z",
    "biotoolsCURIE": "biotools:revbayes",
    "biotoolsID": "revbayes",
    "credit": [
        {
            "email": "Sebastian.Hoehna@gmail.com",
            "name": "Sebastian Höhna",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "boussau@gmail.com",
            "name": "Bastien Boussau",
            "orcidid": "http://orcid.org/0000-0003-0776-4460",
            "typeEntity": "Person",
            "typeRole": [
                "Contributor"
            ]
        }
    ],
    "description": "RevBayes provides an interactive environment for statistical computation in phylogenetics. It is primarily intended for modeling, simulation, and Bayesian inference in evolutionary biology, particularly phylogenetics. However, the environment is quite general and can be useful for many complex modeling tasks.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://revbayes.github.io/tutorials/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical modelling",
                    "uri": "http://edamontology.org/operation_3664"
                }
            ]
        }
    ],
    "homepage": "https://revbayes.github.io/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2019-01-13T16:43:06Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/revbayes/revbayes"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/revbayes/revbayes/issues"
        }
    ],
    "name": "RevBayes",
    "operatingSystem": [
        "Windows",
        "Mac"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1093/sysbio/syw021",
            "metadata": {
                "abstract": "© The Author(s) 2016. Published by Oxford University Press, on behalf of the Society of Systematic Biologists.Programs for Bayesian inference of phylogeny currently implement a unique and fixed suite of models. Consequently, users of these software packages are simultaneously forced to use a number of programs for a given study, while also lacking the freedom to explore models that have not been implemented by the developers of those programs. We developed a new open-source software package, RevBayes, to address these problems. RevBayes is entirely based on probabilistic graphical models, a powerful generic framework for specifying and analyzing statistical models. Phylogeneticgraphical models can be specified interactively in RevBayes, piece by piece, using a new succinct and intuitive language called Rev. Rev is similar to the R language and the BUGS model-specification language, and should be easy to learn for most users. The strength of RevBayes is the simplicity with which one can design, specify, and implement new and complexmodels. Fortunately, this tremendous flexibility does not come at the cost of slower computation; aswe demonstrate, RevBayes outperforms competing software for several standard analyses. Compared with other programs, RevBayes has fewer black-box elements. Users need to explicitly specify each part of the model and analysis. Although this explicitness may initially be unfamiliar, we are convinced that this transparency will improve understanding of phylogenetic models in our field. Moreover, it will motivate the search for improvements to existing methods by brazenly exposing the model choices that we make to critical scrutiny. RevBayes is freely available at http://www.RevBayes.com.",
                "authors": [
                    {
                        "name": "Hohna S."
                    },
                    {
                        "name": "Landis M.J."
                    },
                    {
                        "name": "Heath T.A."
                    },
                    {
                        "name": "Boussau B."
                    },
                    {
                        "name": "Lartillot N."
                    },
                    {
                        "name": "Moore B.R."
                    },
                    {
                        "name": "Huelsenbeck J.P."
                    },
                    {
                        "name": "Ronquist F."
                    }
                ],
                "citationCount": 125,
                "date": "2016-01-01T00:00:00Z",
                "journal": "Systematic Biology",
                "title": "RevBayes: Bayesian phylogenetic inference using graphical models and an interactive model-specification language"
            },
            "pmcid": "PMC4911942",
            "pmid": "27235697",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Applied mathematics",
            "uri": "http://edamontology.org/topic_3569"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}