{
    "additionDate": "2021-01-18T11:20:46Z",
    "biotoolsCURIE": "biotools:acrdb",
    "biotoolsID": "acrdb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "yyin@unl.edu",
            "name": "Yanbin Yin",
            "typeEntity": "Person"
        }
    ],
    "description": "AcrDB is a database of computationally predicted anti-CRISPR (Acr) and Acr-associated (Aca) operon database.\nAcr (anti-CRISPR) proteins are short proteins usually found in phages prophages and other mobile genetic elements that can turn off the CRISPR-Cas system of their prokaryotic hosts.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Operon prediction",
                    "uri": "http://edamontology.org/operation_0435"
                },
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Operon drawing",
                    "uri": "http://edamontology.org/operation_0579"
                }
            ]
        }
    ],
    "homepage": "http://bcb.unl.edu/AcrDB",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-19T12:56:57Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/HaidYi/acrfinder"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/HaidYi/acrfinder/issues"
        },
        {
            "type": [
                "Other"
            ],
            "url": "http://acrcatalog.pythonanywhere.com/catalog/"
        }
    ],
    "name": "AcrDB",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA857",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research. This is an Open Access article distributed under the terms of the Creative Commons Attribution Non-Commercial License (http://creativecommons.org/licenses/by-nc/4.0/), which permits non-commercial re-use, distribution, and reproduction in any medium, provided the original work is properly cited.CRISPR-Cas is an anti-viral mechanism of prokaryotes that has been widely adopted for genome editing. To make CRISPR-Cas genome editing more controllable and safer to use, anti-CRISPR proteins have been recently exploited to prevent excessive/prolonged Cas nuclease cleavage. Anti-CRISPR (Acr) proteins are encoded by (pro)phages/(pro)viruses, and have the ability to inhibit their host's CRISPR-Cas systems. We have built an online database AcrDB (http://bcb.unl.edu/AcrDB) by scanning ∼19 000 genomes of prokaryotes and viruses with AcrFinder, a recently developed Acr-Aca (Acr-associated regulator) operon prediction program. Proteins in Acr-Aca operons were further processed by two machine learning-based programs (AcRanker and PaCRISPR) to obtain numerical scores/ranks. Compared to other anti-CRISPR databases, AcrDB has the following unique features: (i) It is a genome-scale database with the largest collection of data (39 799 Acr-Aca operons containing Aca or Acr homologs); (ii) It offers a user-friendly web interface with various functions for browsing, graphically viewing, searching, and batch downloading Acr-Aca operons; (iii) It focuses on the genomic context of Acr and Aca candidates instead of individual Acr protein family and (iv) It collects data with three independent programs each having a unique data mining algorithm for cross validation. AcrDB will be a valuable resource to the anti-CRISPR research community.",
                "authors": [
                    {
                        "name": "Huang L."
                    },
                    {
                        "name": "Yang B."
                    },
                    {
                        "name": "Yi H."
                    },
                    {
                        "name": "Asif A."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Lithgow T."
                    },
                    {
                        "name": "Zhang H."
                    },
                    {
                        "name": "ul Amir Afsar Minhas F."
                    },
                    {
                        "name": "Yin Y."
                    }
                ],
                "citationCount": 1,
                "date": "2021-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "AcrDB: A database of anti-CRISPR operons in prokaryotes and viruses"
            },
            "pmid": "33068435"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Gene structure",
            "uri": "http://edamontology.org/topic_0114"
        },
        {
            "term": "Genetic engineering",
            "uri": "http://edamontology.org/topic_3912"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        }
    ],
    "validated": 1
}