{
    "additionDate": "2021-10-12T17:07:17.555848Z",
    "biotoolsCURIE": "biotools:abm",
    "biotoolsID": "abm",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "sasha@hafnerconsulting.com",
            "name": "Sasha D. Hafner",
            "orcidid": "https://orcid.org/0000-0003-0955-0327",
            "typeEntity": "Person"
        },
        {
            "email": "sgs@bce.au.dk",
            "name": "Sven G. Sommer",
            "orcidid": "https://orcid.org/0000-0002-2673-0162",
            "typeEntity": "Person"
        },
        {
            "name": "Frederik R. Dalby",
            "orcidid": "https://orcid.org/0000-0003-2437-064X",
            "typeEntity": "Person"
        }
    ],
    "description": "ABM (Anaerobic Biodegradation Model). A mechanistic model of methane emission from animal slurry with a focus on microbial groups.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Retention time prediction",
                    "uri": "http://edamontology.org/operation_3633"
                }
            ]
        }
    ],
    "homepage": "https://github.com/sashahafner/ABM",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-10-12T17:07:17.558328Z",
    "name": "ABM",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0252881",
            "metadata": {
                "abstract": "Copyright: © 2021 Dalby et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Liquid manure (slurry) from livestock releases methane (CH4) that contributes significantly to global warming. Existing models for slurry CH4 production—used for mitigation and inventories—include effects of organic matter loading, temperature, and retention time but cannot predict important effects of management, or adequately capture essential temperature-driven dynamics. Here we present a new model that includes multiple methanogenic groups whose relative abundance shifts in response to changes in temperature or other environmental conditions. By default, the temperature responses of five groups correspond to those of four methanogenic species and one uncultured methanogen, although any number of groups could be defined. We argue that this simple mechanistic approach is able to describe both short- and long-term responses to temperature where other existing approaches fall short. The model is available in the open-source R package ABM (https://github.com/sashahafner/ABM) as a single flexible function that can include effects of slurry management (e.g., removal frequency and treatment methods) and changes in environmental conditions over time. Model simulations suggest that the reduction of CH4 emission by frequent emptying of slurry pits is due to washout of active methanogens. Application of the model to represent a full-scale slurry storage tank showed it can reproduce important trends, including a delayed response to temperature changes. However, the magnitude of predicted emission is uncertain, primarily as a result of sensitivity to the hydrolysis rate constant, due to a wide range in reported values. Results indicated that with additional work—particularly on the magnitude of hydrolysis rate—the model could be a tool for estimation of CH4 emissions for inventories.",
                "authors": [
                    {
                        "name": "Chantigny M.H."
                    },
                    {
                        "name": "Dalby F.R."
                    },
                    {
                        "name": "Dunfield K."
                    },
                    {
                        "name": "Habtewold J."
                    },
                    {
                        "name": "Hafner S.D."
                    },
                    {
                        "name": "Petersen S.O."
                    },
                    {
                        "name": "Sommer S.G."
                    },
                    {
                        "name": "Vanderzaag A."
                    }
                ],
                "citationCount": 1,
                "date": "2021-06-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "A mechanistic model of methane emission from animal slurry with a focus on microbial groups"
            },
            "pmcid": "PMC8191904",
            "pmid": "34111183"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ],
    "validated": 1
}
