{
    "additionDate": "2018-06-06T17:34:17Z",
    "biotoolsCURIE": "biotools:bat_detective",
    "biotoolsID": "bat_detective",
    "credit": [
        {
            "email": "kate.e.jones@ucl.ac.uk",
            "name": "Kate E. Jones",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "o.macaodha@cs.ucl.ac.uk",
            "name": "Oisin Mac Aodha",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Passive acoustic sensing has emerged as a powerful tool for quantifying anthropogenic impacts on biodiversity, especially for echolocating bat species. This tool helps better assess bat population trends accurately and allow the detection and classification of bat calls in large collections of audio recordings.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://www.batdetective.org/#!/about"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "https://www.batdetective.org/",
    "lastUpdate": "2024-11-25T14:38:56.286447Z",
    "name": "Bat Detective",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1371/journal.pcbi.1005995",
            "metadata": {
                "abstract": "Passive acoustic sensing has emerged as a powerful tool for quantifying anthropogenic impacts on biodiversity, especially for echolocating bat species. To better assess bat population trends there is a critical need for accurate, reliable, and open source tools that allow the detection and classification of bat calls in large collections of audio recordings. The majority of existing tools are commercial or have focused on the species classification task, neglecting the important problem of first localizing echolocation calls in audio which is particularly problematic in noisy recordings. We developed a convolutional neural network based open-source pipeline for detecting ultrasonic, full-spectrum, search-phase calls produced by echolocating bats. Our deep learning algorithms were trained on full-spectrum ultrasonic audio collected along road-transects across Europe and labelled by citizen scientists from www.batdetective.org. When compared to other existing algorithms and commercial systems, we show significantly higher detection performance of search-phase echolocation calls with our test sets. As an example application, we ran our detection pipeline on bat monitoring data collected over five years from Jersey (UK), and compared results to a widely-used commercial system. Our detection pipeline can be used for the automatic detection and monitoring of bat populations, and further facilitates their use as indicator species on a large scale. Our proposed pipeline makes only a small number of bat specific design decisions, and with appropriate training data it could be applied to detecting other species in audio. A crucial novelty of our work is showing that with careful, non-trivial, design and implementation considerations, state-of-the-art deep learning methods can be used for accurate and efficient monitoring in audio.",
                "authors": [
                    {
                        "name": "Barlow K.E."
                    },
                    {
                        "name": "Brostow G."
                    },
                    {
                        "name": "Browning E."
                    },
                    {
                        "name": "Firman M."
                    },
                    {
                        "name": "Freeman R."
                    },
                    {
                        "name": "Gibb R."
                    },
                    {
                        "name": "Girolami M."
                    },
                    {
                        "name": "Harder B."
                    },
                    {
                        "name": "Jones K.E."
                    },
                    {
                        "name": "Kinsey L."
                    },
                    {
                        "name": "Mac Aodha O."
                    },
                    {
                        "name": "Mead G.R."
                    },
                    {
                        "name": "Newson S.E."
                    },
                    {
                        "name": "Pandourski I."
                    },
                    {
                        "name": "Parsons S."
                    },
                    {
                        "name": "Russ J."
                    },
                    {
                        "name": "Szodoray-Paradi A."
                    },
                    {
                        "name": "Szodoray-Paradi F."
                    },
                    {
                        "name": "Tilova E."
                    }
                ],
                "citationCount": 154,
                "date": "2018-03-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Bat detective—Deep learning tools for bat acoustic signal detection"
            },
            "pmcid": "PMC5843167",
            "pmid": "29518076",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ],
    "validated": 1
}
