{
    "additionDate": "2017-08-03T18:48:39Z",
    "biotoolsCURIE": "biotools:macoed",
    "biotoolsID": "macoed",
    "credit": [
        {
            "email": "jingse@sjtu.edu.cn",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.csbio.sjtu.edu.cn/"
        },
        {
            "email": "hbshen@sjtu.edu.cn",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.csbio.sjtu.edu.cn/"
        }
    ],
    "description": "Multi-objective ant colony optimization algorithm for detecting the genetic interactions.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.csbio.sjtu.edu.cn/bioinf/MACOED/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Optimisation and refinement",
                    "uri": "http://edamontology.org/operation_2425"
                }
            ]
        }
    ],
    "homepage": "http://www.csbio.sjtu.edu.cn/bioinf/MACOED/",
    "language": [
        "MATLAB",
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:55Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/macoed-multi-objective-heuristic-optimization-methodology.html"
        }
    ],
    "name": "MACOED",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© The Author 2014. Published by Oxford University Press. All rights reserved. Motivation: The existing methods for genetic-interaction detection in genome-wide association studies are designed from different paradigms, and their performances vary considerably for different disease models. One important reason for this variability is that their construction is based on a single-correlation model between SNPs and disease. Due to potential model preference and disease complexity, a single-objective method will therefore not work well in general, resulting in low power and a high false-positive rate. Method: In this work, we present a multi-objective heuristic optimization methodology named MACOED for detecting genetic interactions. In MACOED, we combine both logistical regression and Bayesian network methods, which are from opposing schools of statistics. The combination of these two evaluation objectives proved to be complementary, resulting in higher power with a lower false-positive rate than observed for optimizing either objective independently. To solve the space and time complexity for high-dimension problems, a memory-based multi-objective ant colony optimization algorithm is designed in MACOED that is able to retain non-dominated solutions found in past iterations. Results: We compared MACOED with other recent algorithms using both simulated and real datasets. The experimental results demonstrate that our method outperforms others in both detection power and computational feasibility for large datasets.",
                "authors": [
                    {
                        "name": "Jing P.-J."
                    },
                    {
                        "name": "Shen H.-B."
                    }
                ],
                "citationCount": 21,
                "date": "2015-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "MACOED: A multi-objective ant colony optimization algorithm for SNP epistasis detection in genome-wide association studies"
            },
            "pmid": "25338719"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1
}