{
    "accessibility": "Open access",
    "additionDate": "2022-06-10T08:18:11.319892Z",
    "biotoolsCURIE": "biotools:stecfinder",
    "biotoolsID": "stecfinder",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "r.lan@unsw.edu.au",
            "name": "Ruiting Lan",
            "typeEntity": "Person"
        },
        {
            "name": "Michael Payne"
        },
        {
            "name": "Sandeep Kaur"
        },
        {
            "name": "Xiaomei Zhang"
        }
    ],
    "description": "Clustering and Serotyping of Shigatoxin producing E. coli (STEC) using genomic cluster specific markers",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Gene tree construction",
                    "uri": "http://edamontology.org/operation_0553"
                },
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://github.com/LanLab/STECFinder",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-06-10T08:18:11.322532Z",
    "license": "GPL-3.0",
    "name": "STECFinder",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/FCIMB.2021.772574",
            "metadata": {
                "abstract": "Copyright © 2022 Zhang, Payne, Kaur and Lan.Shiga toxin-producing Escherichia coli (STEC) have more than 470 serotypes. The well-known STEC O157:H7 serotype is a leading cause of STEC infections in humans. However, the incidence of non-O157:H7 STEC serotypes associated with foodborne outbreaks and human infections has increased in recent years. Current detection and serotyping assays are focusing on O157 and top six (“Big six”) non-O157 STEC serogroups. In this study, we performed phylogenetic analysis of nearly 41,000 publicly available STEC genomes representing 460 different STEC serotypes and identified 19 major and 229 minor STEC clusters. STEC cluster-specific gene markers were then identified through comparative genomic analysis. We further identified serotype-specific gene markers for the top 10 most frequent non-O157:H7 STEC serotypes. The cluster or serotype specific gene markers had 99.54% accuracy and more than 97.25% specificity when tested using 38,534 STEC and 14,216 non-STEC E. coli genomes, respectively. In addition, we developed a freely available in silico serotyping pipeline named STECFinder that combined these robust gene markers with established E. coli serotype specific O and H antigen genes and stx genes for accurate identification, cluster determination and serotyping of STEC. STECFinder can assign 99.85% and 99.83% of 38,534 STEC isolates to STEC clusters using assembled genomes and Illumina reads respectively and can simultaneously predict stx subtypes and STEC serotypes. Using shotgun metagenomic sequencing reads of STEC spiked food samples from a published study, we demonstrated that STECFinder can detect the spiked STEC serotypes, accurately. The cluster/serotype-specific gene markers could also be adapted for culture independent typing, facilitating rapid STEC typing. STECFinder is available as an installable package (https://github.com/LanLab/STECFinder) and will be useful for in silico STEC cluster identification and serotyping using genome data.",
                "authors": [
                    {
                        "name": "Kaur S."
                    },
                    {
                        "name": "Lan R."
                    },
                    {
                        "name": "Payne M."
                    },
                    {
                        "name": "Zhang X."
                    }
                ],
                "date": "2022-01-10T00:00:00Z",
                "journal": "Frontiers in Cellular and Infection Microbiology",
                "title": "Improved Genomic Identification, Clustering, and Serotyping of Shiga Toxin-Producing Escherichia coli Using Cluster/Serotype-Specific Gene Markers"
            },
            "pmcid": "PMC8785982",
            "pmid": "35083165"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Metagenomic sequencing",
            "uri": "http://edamontology.org/topic_3837"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ],
    "validated": 1
}
