{
    "additionDate": "2020-01-09T17:57:27Z",
    "biotoolsCURIE": "biotools:SVCA",
    "biotoolsID": "SVCA",
    "confidence_flag": "high",
    "description": "Modeling Cell-Cell Interactions from Spatial Molecular Data with Spatial Variance Component Analysis.\n\nSpatial Variance Components Analysis (SVCA).\n\nNB: If you are already a limix user, we recommend you install svca_limix and svca in a dedicated conda environment so there is no interference between your limix versions",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Expression profile clustering",
                    "uri": "http://edamontology.org/operation_0313"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                }
            ]
        }
    ],
    "homepage": "https://github.com/damienArnol/svca",
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2020-01-09T17:57:27Z",
    "license": "Apache-2.0",
    "name": "SVCA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.CELREP.2019.08.077",
            "metadata": {
                "abstract": "© 2019 The Author(s)Technological advances enable assaying multiplexed spatially resolved RNA and protein expression profiling of individual cells, thereby capturing molecular variations in physiological contexts. While these methods are increasingly accessible, computational approaches for studying the interplay of the spatial structure of tissues and cell-cell heterogeneity are only beginning to emerge. Here, we present spatial variance component analysis (SVCA), a computational framework for the analysis of spatial molecular data. SVCA enables quantifying different dimensions of spatial variation and in particular quantifies the effect of cell-cell interactions on gene expression. In a breast cancer Imaging Mass Cytometry dataset, our model yields interpretable spatial variance signatures, which reveal cell-cell interactions as a major driver of protein expression heterogeneity. Applied to high-dimensional imaging-derived RNA data, SVCA identifies plausible gene families that are linked to cell-cell interactions. SVCA is available as a free software tool that can be widely applied to spatial data from different technologies. © 2019 The Author(s)Arnol et al. present a statistical method for analyzing single-cell expression data in a spatial context. The method identifies the sources of gene expression variability by decomposing it into different components, each attributable to a different source. These sources include aspects of spatial variation, in particular cell-cell interactions.",
                "authors": [
                    {
                        "name": "Arnol D."
                    },
                    {
                        "name": "Schapiro D."
                    },
                    {
                        "name": "Bodenmiller B."
                    },
                    {
                        "name": "Saez-Rodriguez J."
                    },
                    {
                        "name": "Stegle O."
                    }
                ],
                "citationCount": 2,
                "date": "2019-10-01T00:00:00Z",
                "journal": "Cell Reports",
                "title": "Modeling Cell-Cell Interactions from Spatial Molecular Data with Spatial Variance Component Analysis"
            },
            "pmid": "31577949"
        }
    ],
    "topic": [
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        }
    ]
}