{
    "additionDate": "2020-01-14T09:15:46Z",
    "biotoolsCURIE": "biotools:Tripal_MapViewer",
    "biotoolsID": "Tripal_MapViewer",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "sook_jung@wsu.edu",
            "name": "Sook Jung",
            "orcidid": "https://orcid.org/0000-0003-3968-2769",
            "typeEntity": "Person"
        },
        {
            "email": "dorrie@wsu.edu",
            "name": "Dorrie Main",
            "typeEntity": "Person"
        }
    ],
    "description": "A tool for interactive visualization and comparison of genetic maps.\n\nTripal is an open-source, resource-efficient toolkit for construction of genomic, genetic and breeding databases. It facilitates development of biological websites by providing tools to integrate and display biological data using the generic database schema, Chado, together with Drupal, a popular website creation and content management system. Tripal MapViewer is a new interactive tool for visualizing genetic map data. Developed as a Tripal replacement for Comparative Map Viewer (CMap), it enables visualization of entire maps or linkage groups and features such as molecular markers, quantitative trait loci (QTLs) and heritable phenotypic markers. It also provides graphical comparison of maps sharing the same markers as well as dot plot and correspondence matrices",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                },
                {
                    "term": "Dot plot plotting",
                    "uri": "http://edamontology.org/operation_0490"
                }
            ]
        }
    ],
    "homepage": "https://gitlab.com/mainlabwsu/tripal_map",
    "lastUpdate": "2020-01-14T09:15:46Z",
    "name": "Tripal MapViewer",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAZ100",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Tripal is an open-source, resource-efficient toolkit for construction of genomic, genetic and breeding databases. It facilitates development of biological websites by providing tools to integrate and display biological data using the generic database schema, Chado, together with Drupal, a popular website creation and content management system. Tripal MapViewer is a new interactive tool for visualizing genetic map data. Developed as a Tripal replacement for Comparative Map Viewer (CMap), it enables visualization of entire maps or linkage groups and features such as molecular markers, quantitative trait loci (QTLs) and heritable phenotypic markers. It also provides graphical comparison of maps sharing the same markers as well as dot plot and correspondence matrices. MapViewer integrates directly with the Tripal application programming interface framework, improving data searching capability and providing a more seamless experience for site visitors. The Tripal MapViewer interface can be integrated in any Tripal map page and linked from any Tripal page for markers, QTLs, heritable morphological markers or genes. Configuration of the display is available through a control panel and the administration interface. The administration interface also allows configuration of the custom database query for building materialized views, providing better performance and flexibility in the way data is stored in the Chado database schema. MapViewer is implemented with the D3.js technology and is currently being used at the Genome Database for Rosaceae (https://www.rosaceae.org), CottonGen (https://www.cottongen.org), Citrus Genome Database (https://citrusgenomedb.org), Vaccinium Genome Database (https://www.vaccinium.org) and Cool Season Food Legume Database (https://www.coolseasonfoodlegume.org). It is also currently in development on the Hardwood Genomics Web (https://hardwoodgenomics.org) and TreeGenes (https://treegenesdb.org). Database URL: https://gitlab.com/mainlabwsu/tripal_map.",
                "authors": [
                    {
                        "name": "Buble K."
                    },
                    {
                        "name": "Jung S."
                    },
                    {
                        "name": "Humann J.L."
                    },
                    {
                        "name": "Yu J."
                    },
                    {
                        "name": "Cheng C.-H."
                    },
                    {
                        "name": "Lee T."
                    },
                    {
                        "name": "Ficklin S.P."
                    },
                    {
                        "name": "Hough H."
                    },
                    {
                        "name": "Condon B."
                    },
                    {
                        "name": "Staton M.E."
                    },
                    {
                        "name": "Wegrzyn J.L."
                    },
                    {
                        "name": "Main D."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Database",
                "title": "Tripal MapViewer: A tool for interactive visualization and comparison of genetic maps"
            },
            "pmcid": "PMC6829499",
            "pmid": "31688940"
        }
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        }
    ]
}