{"credit":[{"email":"wcftongji@gmail.com","name":"Chenfei Wang","typeEntity":"Person","typeRoles":["Primary contact"]}],"function":[{"operation":[{"term":"Nucleic acid feature detection","uri":"http://edamontology.org/operation_0415"}]}],"labels":{"language":["Python"],"maturity":"Legacy","operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Epigenomics","uri":"http://edamontology.org/topic_3173"},{"term":"ChIP-seq","uri":"http://edamontology.org/topic_3169"}]},"publication":[{"abstract":"Background: In vivo positioning and covalent modifications of nucleosomes play an important role in epigenetic regulation, but genome-wide studies of positioned nucleosomes and their modifications in human still remain limited. Results: This paper describes a novel computational framework to efficiently identify positioned nucleosomes and their histone modification profiles from nucleosome-resolution histone modification ChIP-Seq data. We applied the algorithm to histone methylation ChIP-Seq data in human CD4+T cells and identified over 438,000 positioned nucleosomes, which appear predominantly at functionally important regions such as genes, promoters, DNase I hypersensitive regions, and transcription factor binding sites. Our analysis shows the identified nucleosomes play a key role in epigenetic gene regulation within those functionally important regions via their positioning and histone modifications. Conclusion: Our method provides an effective framework for studying nucleosome positioning and epigenetic marks in mammalian genomes. The algorithm is open source and available at http://liulab.dfci.harvard.edu/ NPS/. © 2008 Zhang et al; licensee BioMed Central Ltd.","authors":["Zhang Y.","Shin H.","Song J.S.","Lei Y.","Shirley X.S."],"cit_count":97,"journal":"BMC Genomics","pmid":"19014516","title":"Identifying positioned nucleosomes with epigenetic marks in human from ChIP-Seq","year":"2008-11-13"}],"summary":{"biotoolsCURIE":"biotools:nps","biotoolsID":"nps","description":"Identify nucleosome positions given histone-modification ChIP-seq or nucleosome sequencing at the nucleosome level.","homepage":"http://liulab.dfci.harvard.edu/NPS/","name":"NPS"}}