{"credit":[{"name":"Micha Sammeth","typeEntity":"Person","typeRoles":["Developer"]},{"name":"Lab Roderic Guigo Group","typeEntity":"Institute","typeRoles":["Provider"]},{"name":"crg.eu","typeEntity":"Institute","typeRoles":["Provider"]},{"email":"micha@sammeth.net","name":"Micha Sammeth","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://sammeth.net/confluence/display/ASTA/2+-+Download"}],"download":[{"type":"Source code","url":"http://artifactory.sammeth.net/artifactory/barna/barna/barna.astalavista/3.2/astalavista-3.2.tgz"},{"type":"Binaries","url":"http://sammeth.net/confluence/display/ASTA/2+-+Download"}],"function":[{"input":[{"data":{"term":"Nucleic acid features","uri":"http://edamontology.org/data_1276"}}],"note":"The AStalavista web server extracts and displays alternative splicing (AS) events from a given genomic annotation of exon-intron gene coordinates. By comparing all given transcripts, AStalavista detects the variations in their splicing structure and identify all AS events (like exon skipping, alternate donor, etc) by assigning to each of them an AS code. AStalavista provides a vizual summary of the AS landscape in the analyzed dataset, the possibility to browse the results on the UCSC website or to download them in GTF or ASTA format. You can use AStalavista for any genome by providing your own annotation set, the identifier of your gene(s) of interest, or analyze the AS landscape of reference annotation datasets like Gencode, RefSeq, Ensembl, FlyBase,...","operation":[{"term":"Sequence visualisation","uri":"http://edamontology.org/operation_0564"},{"term":"Sequence annotation","uri":"http://edamontology.org/operation_0361"}],"output":[{"data":{"term":"Sequence features","uri":"http://edamontology.org/data_1255"},"format":[{"term":"Image format","uri":"http://edamontology.org/format_3547"}]}]}],"labels":{"cost":"Free of charge","language":["Java"],"license":"BSD-3-Clause","operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Nucleic acid structure analysis","uri":"http://edamontology.org/topic_0097"}]},"link":[{"type":"REPOSITORY","url":"http://sammeth.net/bitbucket/scm/barna/barna.git"}],"publication":[{"abstract":"DNA arrays have been widely used to perform transcriptome-wide analysis of gene expression, and many methods have been developed to measure gene expression variability and to compare gene expression between conditions. Because RNA-seq is also becoming increasingly popular for transcriptome characterization, the possibility exists for further quantification of individual alternative transcript isoforms, and therefore for estimating the relative ratios of alternative splice forms within a given gene. Changes in splicing ratios, even without changes in overall gene expression, may have important phenotypic effects. Here we have developed statistical methodology to measure variability in splicing ratios within conditions, to compare it between conditions, and to identify genes with condition-specific splicing ratios. Furthermore, we have developed methodology to deconvolute the relative contribution of variability in gene expression versus variability in splicing ratios to the overall variability of transcript abundances. As a proof of concept, we have applied this methodology to estimates of transcript abundances obtained from RNA-seq experiments in lymphoblastoid cells from Caucasian and Yoruban individuals. We have found that protein-coding genes exhibit low splicing variability within populations, with many genes exhibiting constant ratios across individuals. When comparing these two populations, we have found that up to 10% of the studied protein-coding genes exhibit population-specific splicing ratios. We estimate that ∼60% of the total variability observed in the abundance of transcript isoforms can be explained by variability in transcription. A large fraction of the remaining variability can likely result from variability in splicing. Finally, we also detected that variability in splicing is uncommon without variability in transcription. © 2012 by Cold Spring Harbor Laboratory Press.","authors":["Gonzalez-Porta M.","Calvo M.","Sammeth M.","Guigo R."],"cit_count":37,"doi":"10.1101/gr.121947.111","journal":"Genome Research","title":"Estimation of alternative splicing variability in human populations","type":"Primary","year":"2012-03-01"}],"summary":{"biotoolsCURIE":"biotools:astalavista","biotoolsID":"astalavista","description":"Alternative splicing trascriptional landscape visualization tool retrieves all alternative splicing events from generic transcript annotations.","homepage":"http://sammeth.net/confluence/display/ASTA/Home","name":"AStalavista","version":["3.2"]}}