{
    "accessibility": "Restricted access",
    "additionDate": "2020-01-14T09:34:33Z",
    "biotoolsCURIE": "biotools:OmicShare",
    "biotoolsID": "OmicShare",
    "confidence_flag": "tool",
    "cost": "Commercial",
    "credit": [
        {
            "email": "wglvv0325@163.com",
            "name": "Guiling Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "Competing endogenous RNA (ceRNA) hypothetic model based on comprehensive analysis of long non-coding RNA expression in lung adenocarcinoma.\n\nOmicShare Tools为完全免费开放生物信息云工具网站。OmicShare Tools云平台所涵盖的生物信息基础工具全面，云平台中所有工具皆为基迪奥开发，操作简单方便，工具输出结果可直接用于SCI文章发表。.\n\n如果您在数据处理过程中，使用了OmicShare Tools完成了分析或在OmicShare Forum得到了有价值的帮助，我们期望您在论文发表时，在方法学部分或致谢部分引用或提及OmicShare平台。例如：XXXX analysis was performed using the OmicShare tools,a free online platform for data analysis (http://www.omicshare.com/tools)。这样便于更多的同行了解和分享OmicShare平台。.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "http://www.omicshare.com/tools",
    "lastUpdate": "2021-01-04T13:28:56Z",
    "license": "Proprietary",
    "name": "OmicShare",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.7717/PEERJ.8024",
            "metadata": {
                "abstract": "© 2019 Wang et al.Background: Non-small cell lung cancer (NSCLC) is a major subtype of lung cancer with high malignancy and bad prognosis, consisted of lung adenocarcinomas (LUAD) and lung squamous cell carcinomas (LUSC) chiefly. Multiple studies have indicated that competing endogenous RNA (ceRNA) network centered long noncoding RNAs (lncRNAs) can regulate gene expression and the progression of various cancers. However, the research about lncRNAs-mediated ceRNA network in LUAD is still lacking. Methods: In this study, we analyzed the RNA-seq database from The Cancer Genome Atlas (TCGA) and obtained dysregulated lncRNAs in NSCLC, then further identified survival associated lncRNAs through Kaplan-Meier analysis. Quantitative real time PCR (qRT-PCR) was performed to confirm their expression in LUAD tissues and cell lines. The ceRNA networks were constructed based on DIANA-TarBase and TargetScan databases and visualized with OmicShare tools. Gene Ontology (GO) and Kyoto Encyclopedia of Genes and Genomes (KEGG) pathway analyses were performed to investigate the potential function of ceRNA networks. Results: In total, 1,437 and 1,699 lncRNAs were found to be up-regulated in LUAD and LUSC respectively with 895 lncRNAs overlapping (|log2FC| > 3, adjusted P value <0.01). Among which, 222 lncRNAs and 46 lncRNAs were associated with the overall survival (OS) of LUAD and LUSC, and 18 out of 222 up-regulated lncRNAs were found to have inverse correlation with LUAD patients' OS (|log2FC| > 3, adjusted P value < 0.02). We selected 3 lncRNAs (CASC8, LINC01842 and VPS9D1-AS1) out of these 18 lncRNAs and confirmed their overexpression in lung cancer tissues and cells. CeRNA networks were further constructed centered CASC8, LINC01842 and VPS9D1-AS1 with 3 miRNAs and 100 mRNAs included respectively. Conclusion: Through comprehensively analyses of TCGA, our study identified specific lncRNAs as candidate diagnostic and prognostic biomarkers for LUAD. The novel ceRNA network we created provided more insights into the regulatory mechanisms underlying LUAD.",
                "authors": [
                    {
                        "name": "Guo Q."
                    },
                    {
                        "name": "Liu J."
                    },
                    {
                        "name": "Ruan B."
                    },
                    {
                        "name": "Su R."
                    },
                    {
                        "name": "Wang G."
                    },
                    {
                        "name": "Wang X."
                    }
                ],
                "citationCount": 10,
                "date": "2019-01-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "Competing endogenous RNA (ceRNA) hypothetic model based on comprehensive analysis of long non-coding RNA expression in lung adenocarcinoma"
            },
            "pmcid": "PMC6842565",
            "pmid": "31720124"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
