
{
    "credit": [
        {
            "email": "xuan@vt.edu",
            "name": "Jianhua Xuan",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.cbil.ece.vt.edu/index.htm"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://www.cbil.ece.vt.edu/software.htm"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "MATLAB"
        ],
        "operatingSystem": [
            "Windows"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Systems biology",
                "uri": "http://edamontology.org/topic_2259"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Statistics and probability",
                "uri": "http://edamontology.org/topic_2269"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/ml-svr-identify-condition-specific-regulatory-networks.html"
        }
    ],
    "publication": [
        {
            "abstract": "Motivation: The identification of gene regulatory modules is an important yet challenging problem in computational biology. While many computational methods have been proposed to identify regulatory modules, their initial success is largely compromised by a high rate of false positives, especially when applied to human cancer studies. New strategies are needed for reliable regulatory module identification. Results: We present a new approach, namely multilevel support vector regression (ml-SVR), to systematically identify condition-specific regulatory modules. The approach is built upon a multilevel analysis strategy designed for suppressing false positive predictions. With this strategy, a regulatory module becomes ever more significant as more relevant gene sets are formed at finer levels. At each level, a two-stage support vector regression (SVR) method is utilized to help reduce false positive predictions by integrating binding motif information and gene expression data; a significant analysis procedure is followed to assess the significance of each regulatory module. To evaluate the effectiveness of the proposed strategy, we first compared the ml-SVR approach with other existing methods on simulation data and yeast cell cycle data. The resulting performance shows that the ml-SVR approach outperforms other methods in the identification of both regulators and their target genes. We then applied our method to breast cancer cell line data to identify condition-specific regulatory modules associated with estrogen treatment. Experimental results show that our method can identify biologically meaningful regulatory modules related to estrogen signaling and action in breast cancer. Availability and implementation: The ml-SVR MATLAB package can be downloaded at http://www.cbil.ece.vt.edu/software.htm Supplementary information: Supplementary data are available at Bioinformatics online. © The Author 2010. Published by Oxford University Press.",
            "authors": [
                "Chen L.",
                "Xuan J.",
                "Riggins R.B.",
                "Wang Y.",
                "Hoffman E.P.",
                "Clarke R."
            ],
            "cit_count": 16,
            "journal": "Bioinformatics",
            "pmid": "20375112",
            "title": "Multilevel support vector regression analysis to identify condition-specific regulatory networks",
            "year": "2010-04-07"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:ml-svr",
        "biotoolsID": "ml-svr",
        "description": "Implements regulatory module identification through multi-level support vector regression.",
        "homepage": "http://www.cbil.ece.vt.edu/software.htm",
        "name": "ml-SVR"
    }
}