{
    "accessibility": "Open access",
    "additionDate": "2022-08-16T14:37:42.537490Z",
    "biotoolsCURIE": "biotools:use-net",
    "biotoolsID": "use-net",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Gani Rahmon"
        },
        {
            "name": "Imad Eddine Toubal"
        },
        {
            "name": "Kannappan Palaniappan"
        }
    ],
    "description": "Extending U-Net Network for Improved Nuclei Instance Segmentation Accuracy in Histopathology Images.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/CIVA-Lab/USE-Net",
    "language": [
        "MATLAB",
        "Python"
    ],
    "lastUpdate": "2022-08-16T14:37:42.539958Z",
    "license": "Not licensed",
    "name": "USE-Net",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1109/AIPR52630.2021.9762213",
            "metadata": {
                "abstract": "© 2021 IEEE.Analysis of morphometric features of nuclei plays an important role in understanding disease progression and predict efficacy of treatment. First step towards this goal requires segmentation of individual nuclei within the imaged tissue. Accu-rate nuclei instance segmentation is one of the most challenging tasks in computational pathology due to broad morphological variances of individual nuclei and dense clustering of nuclei with indistinct boundaries. It is extremely laborious and costly to annotate nuclei instances, requiring experienced pathologists to manually draw the contours, which often results in the lack of annotated data. Inevitably subjective annotation and mislabeling prevent supervised learning approaches to learn from accurate samples and consequently decrease the generalization capacity to robustly segment unseen organ nuclei, leading to over- or under-segmentations as a result. To address these issues, we use a variation of U-Net that uses squeeze and excitation blocks (USE-Net) for robust nuclei segmentation. The squeeze and excitation blocks allow the network to perform feature recalibration by emphasizing informative features and suppressing less useful ones. Furthermore, we extend the proposed network USE-Net not to generate only a segmentation mask, but also to output shape markers to allow better separation of nuclei from each other particularly within dense clusters. The proposed network was trained, tested, and evaluated on 2018 MICCAI Multi-Organ-Nuclei-Segmentation (MoNuSeg) challenge dataset. Promising results were obtained on unseen data despite that the data used for training USE-Net was significantly small.",
                "authors": [
                    {
                        "name": "Palaniappan K."
                    },
                    {
                        "name": "Rahmon G."
                    },
                    {
                        "name": "Toubal I.E."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Proceedings - Applied Imagery Pattern Recognition Workshop",
                "title": "Extending U-Net Network for Improved Nuclei Instance Segmentation Accuracy in Histopathology Images"
            },
            "pmcid": "PMC9060239",
            "pmid": "35506043"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
