{
    "additionDate": "2020-01-09T17:46:54Z",
    "biotoolsCURIE": "biotools:CLIPS",
    "biotoolsID": "CLIPS",
    "confidence_flag": "tool",
    "description": "An interactive retrieval system for clinical trial studies with context-dependent protocol elements.\n\nClinical trial protocol includes all the steps that should be conducted in clinical trial and all clinical trial start with development of the protocol.\n\nThe purpose of our study is to provide context-dependent protocol element selection system for the development of objective and successful clinical trial protocols.\n\nWe have developed a database and search application for protocol structure retrieval",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                }
            ]
        }
    ],
    "homepage": "https://corus.kaist.edu/clips",
    "lastUpdate": "2020-12-16T14:44:27Z",
    "name": "CLIPS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/814996"
        },
        {
            "doi": "10.1371/journal.pone.0238290",
            "metadata": {
                "abstract": "© 2020 Park et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.A well-defined protocol for a clinical trial guarantees a successful outcome report. When designing the protocol, most researchers refer to electronic databases and extract protocol elements using a keyword search. However, state-of-the-art database systems only offer text-based searches for user-entered keywords. In this study, we present a database system with a context-dependent and protocol-element-selection function for successfully designing a clinical trial protocol. To do this, we first introduce a database for a protocol retrieval system constructed from individual protocol data extracted from 184,634 clinical trials and 13,210 frame structures of clinical trial protocols. The database contains a variety of semantic information that allows the filtering of protocols during the search operation. Based on the database, we developed a web application called the clinical trial protocol database system (CLIPS; available at https://corus.kaist.edu/clips). This system enables an interactive search by utilizing protocol elements. To enable an interactive search for combinations of protocol elements, CLIPS provides optional next element selection according to the previous element in the form of a connected tree. The validation results show that our method achieves better performance than that of existing databases in predicting phenotypic features.",
                "authors": [
                    {
                        "name": "Hwang W."
                    },
                    {
                        "name": "Kim K."
                    },
                    {
                        "name": "Lee D."
                    },
                    {
                        "name": "Park J."
                    },
                    {
                        "name": "Park S."
                    },
                    {
                        "name": "Yi G.-S."
                    },
                    {
                        "name": "Yoo S."
                    }
                ],
                "date": "2020-09-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "An interactive retrieval system for clinical trial studies with context-dependent protocol elements"
            },
            "pmcid": "PMC7500653",
            "pmid": "32946464"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "RNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3794"
        }
    ],
    "validated": 1
}
