{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"https://mullinslab.microbiol.washington.edu/contact/"},{"email":"mullspt+cfar@uw.edu","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://indra.mullins.microbiol.washington.edu/quality/readme.txt"},{"url":"https://indra.mullins.microbiol.washington.edu/quality/jqualinstructions.htm"}],"function":[{"operation":[{"term":"Statistical modelling","uri":"http://edamontology.org/operation_3664"}]}],"labels":{"language":["Java"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Desktop application"],"topic":[{"term":"Statistics and probability","uri":"http://edamontology.org/topic_2269"},{"term":"Mathematics","uri":"http://edamontology.org/topic_3315"},{"term":"PCR experiment","uri":"http://edamontology.org/topic_3519"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/quality-1-1-6-variant-of-the-minimum-chi-squared-method-for-limiting-dilution-assays.html"}],"publication":[{"abstract":"Polymerase chain reaction-based limiting dilution assays (PLDAs), commonly called end-point dilutions, are frequently used to quantify the copy numbers of human immunodeficiency virus (HIV) and other viruses in biological samples; however, the way in which these assays are done, and the mathematical method used to estimate copy numbers, vary from laboratory to laboratory. Here, we describe a statistical method for estimating the number of copies and the associated standard error of the estimate, using a PLDA. The copy number is estimated by the value that maximizes the goodness of fit between the observed numbers of negative reactions and the expected numbers of negative reactions (the latter estimated using a Poisson probability distribution) as measured by the χ2 statistic. The method described here also takes into account user-specified probabilities of obtaining a false- positive or a false-negative PCR result, a feature that is not generally available with other limiting dilution estimation procedures. QUALITY, a computer program that implements the estimation strategy, is also described. Simulations illustrate the efficiency of estimation with different numbers of PCR amplifications conducted at each dilution, and different dilution factors. Finally, a simple strategy for more efficient assays is proposed.","authors":["Rodrigo A.G.","Goracke P.C.","Rowhanian K.","Mullins J.I."],"cit_count":112,"journal":"AIDS Research and Human Retroviruses","pmid":"9171217","title":"Quantitation of target molecules from polymerase chain reaction-based limiting dilution assays","year":"1997-01-01"}],"summary":{"biotoolsCURIE":"biotools:quality","biotoolsID":"quality","description":"Variant of the minimum Chi-squared (MC) method for limiting dilution assays, and for which he has demonstrated by simulation desirable properties of minimum variance (i.e., high precision) and minimum bias. Our method modifies the MC method to allow the user to specify the probabilities of a false negative and false positive PCR.","homepage":"http://indra.mullins.microbiol.washington.edu/quality/","name":"QUALITY"}}