{
    "additionDate": "2020-01-14T09:32:05Z",
    "biotoolsCURIE": "biotools:MIGOU",
    "biotoolsID": "MIGOU",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "rutrilla@b105.upm.es",
            "name": "Ramiro Utrilla",
            "orcidid": "https://orcid.org/0000-0002-4464-0814",
            "typeEntity": "Person"
        }
    ],
    "description": "A Low-Power Experimental Platform with Programmable Logic Resources and Software-Defined Radio Capabilities.\n\nThe increase in the number of mobile and Internet of Things (IoT) devices, along with the demands of new applications and services, represents an important challenge in terms of spectral coexistence. As a result, these devices are now expected to make an efficient and dynamic use of the spectrum, and to provide processed information instead of simple raw sensor measurements. These communication and processing requirements have direct implications on the architecture of the systems. In this work, we present MIGOU, a wireless experimental platform that has been designed to address these challenges from the perspective of resource-constrained devices, such as wireless sensor nodes or IoT end-devices.\n\n||| HOMEPAGE MISSING!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'wireless', 'system-on-a-chip'",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31731745",
    "lastUpdate": "2020-01-14T09:32:05Z",
    "name": "MIGOU",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3390/S19224983",
            "metadata": {
                "abstract": "© MDPI AG. All rights reserved.The increase in the number of mobile and Internet of Things (IoT) devices, along with the demands of new applications and services, represents an important challenge in terms of spectral coexistence. As a result, these devices are now expected to make an efficient and dynamic use of the spectrum, and to provide processed information instead of simple raw sensor measurements. These communication and processing requirements have direct implications on the architecture of the systems. In this work, we present MIGOU, a wireless experimental platform that has been designed to address these challenges from the perspective of resource-constrained devices, such as wireless sensor nodes or IoT end-devices. At the radio level, the platform can operate both as a software-defined radio and as a traditional highly integrated radio transceiver, which demands less node resources. For the processing tasks, it relies on a system-on-a-chip that integrates an ARM Cortex-M3 processor, and a flash-based FPGA fabric, where high-speed processing tasks can be offloaded. The power consumption of the platform has been measured in the different modes of operation. In addition, these hardware features and power measurements have been compared with those of other representative platforms. The results obtained confirm that a state-of-the-art tradeoff between hardware flexibility and energy efficiency has been achieved. These characteristics will allow for the development of appropriate solutions to current end-devices’ challenges and to test them in real scenarios.",
                "authors": [
                    {
                        "name": "Utrilla R."
                    },
                    {
                        "name": "Rodriguez-Zurrunero R."
                    },
                    {
                        "name": "Martin J."
                    },
                    {
                        "name": "Rozas A."
                    },
                    {
                        "name": "Araujo A."
                    }
                ],
                "citationCount": 1,
                "date": "2019-11-02T00:00:00Z",
                "journal": "Sensors (Switzerland)",
                "title": "Migou: A low-power experimental platform with programmable logic resources and software-defined radio capabilities"
            },
            "pmcid": "PMC6891619",
            "pmid": "31731745"
        }
    ],
    "topic": [
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        }
    ]
}