{"credit":[{"name":"BioCatalogue","typeEntity":"Project","typeRoles":["Documentor"],"url":"https://www.biocatalogue.org"},{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://gmd.mpimp-golm.mpg.de/contact.aspx"}],"documentation":[{"type":"GENERAL","url":"http://gmd.mpimp-golm.mpg.de/webservices/wsPrediction.asmx"}],"function":[{"operation":[{"term":"Data retrieval","uri":"http://edamontology.org/operation_2422"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web service"],"topic":[{"term":"Cheminformatics","uri":"http://edamontology.org/topic_2258"},{"term":"Data management","uri":"http://edamontology.org/topic_3071"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"https://www.biocatalogue.org/services/2633"}],"publication":[{"abstract":"Gas chromatography coupled to mass spectrometry (GC-MS) is one of the most widespread routine technologies applied to the large scale screening and discovery of novel metabolic biomarkers. However, currently the majority of mass spectral tags (MSTs) remains unidentified due to the lack of authenticated pure reference substances required for compound identification by GC-MS. Here, we accessed the information on reference compounds stored in the Golm Metabolome Database (GMD) to apply supervised machine learning approaches to the classification and identification of unidentified MSTs without relying on library searches. Non-annotated MSTs with mass spectral and retention index (RI) information together with data of already identified metabolites and reference substances have been archived in the GMD. Structural feature extraction was applied to sub-divide the metabolite space contained in the GMD and to define the prediction target classes. Decision tree (DT)-based prediction of the most frequent substructures based on mass spectral features and RI information is demonstrated to result in highly sensitive and specific detections of sub-structures contained in the compounds. The underlying set of DTs can be inspected by the user and are made available for batch processing via SOAP (Simple Object Access Protocol)-based web services. The GMD mass spectral library with the integrated DTs is freely accessible for non-commercial use at http://gmd.mpimpgolm. mpg.de/. All matching and structure search functionalities are available as SOAP-based web services. A XML? HTTP interface, which follows Representational State Transfer (REST) principles, facilitates read-only access to data base entities. © Springer Science+Business Media, LLC 2010.","authors":["Hummel J.","Strehmel N.","Selbig J.","Walther D.","Kopka J."],"cit_count":163,"doi":"10.1007/s11306-010-0198-7","journal":"Metabolomics","title":"Decision tree supported substructure prediction of metabolites from GC-MS profiles","type":"Primary","year":"2010-06-01"}],"summary":{"biotoolsCURIE":"biotools:wsprediction","biotoolsID":"wsprediction","description":"Provide access to methods for prediction of chemical sub-groups by means of user submitted mass spectra.","homepage":"http://gmd.mpimp-golm.mpg.de/webservices/wsPrediction.asmx","name":"wsPrediction","version":["1"]}}