{"credit":[{"email":"k.strimmer@imperial.ac.uk","name":"Korbinian Strimmer","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://strimmerlab.org/"}],"documentation":[{"url":"http://cran.r-project.org/web/packages/binda/binda.pdf"}],"function":[{"operation":[{"term":"Analysis","uri":"http://edamontology.org/operation_2945"}]}],"labels":{"language":["R"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Library"],"topic":[{"term":"Data management","uri":"http://edamontology.org/topic_3071"},{"term":"Informatics","uri":"http://edamontology.org/topic_0605"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/binda-multi-class-discriminant-analysis-using-binary-predictors.html"}],"publication":[{"abstract":"© The Author 2015.Motivation: Proteomic mass spectrometry analysis is becoming routine in clinical diagnostics, for example to monitor cancer biomarkers using blood samples. However, differential proteomics and identification of peaks relevant for class separation remains challenging. Results: Here, we introduce a simple yet effective approach for identifying differentially expressed proteins using binary discriminant analysis. This approach works by data-adaptive thresholding of protein expression values and subsequent ranking of the dichotomized features using a relative entropy measure. Our framework may be viewed as a generalization of the 'peak probability contrast' approach of Tibshirani et al. (2004) and can be applied both in the two-group and the multi-group setting. Our approach is computationally inexpensive and shows in the analysis of a large-scale drug discovery test dataset equivalent prediction accuracy as a random forest. Furthermore, we were able to identify in the analysis of mass spectrometry data from a pancreas cancer study biological relevant and statistically predictive marker peaks unrecognized in the original study.","authors":["Gibb S.","Strimmer K."],"cit_count":10,"journal":"Bioinformatics","pmid":"26026136","title":"Differential protein expression and peak selection in mass spectrometry data by binary discriminant analysis","year":"2015-10-01"}],"summary":{"biotoolsCURIE":"biotools:binda","biotoolsID":"binda","description":"This package implements functions for multi-class discriminant analysis using binary predictors, for corresponding variable selection, and for dichotomizing continuous data.","homepage":"http://strimmerlab.org/software/binda/","name":"binda"}}