{
    "accessibility": "Open access",
    "additionDate": "2021-09-27T05:43:27.930654Z",
    "biotoolsCURIE": "biotools:hifu-beam",
    "biotoolsID": "hifu-beam",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Vera A. Khokhlova",
            "orcidid": "https://orcid.org/0000-0002-2585-8228",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "HIFU-beam is a free open source software with graphical user interface for modeling nonlinear axially symmetric focused ultrasound beams with account for possible formation of shock fronts.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Small molecule design",
                    "uri": "http://edamontology.org/operation_4009"
                }
            ]
        }
    ],
    "homepage": "http://limu.msu.ru/node/3555?language=en",
    "language": [
        "MATLAB",
        "Fortran"
    ],
    "lastUpdate": "2021-09-27T05:43:27.933268Z",
    "name": "HIFU beam",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1109/TUFFC.2021.3074611",
            "metadata": {
                "abstract": "IEEE&#x201C;HIFU beam&#x201D; is a freely available software tool that comprises a MATLAB toolbox combined with a user-friendly interface and binary executable compiled from FORTRAN source code HIFU beam. (2021). Available: http://limu.msu.ru/node/3555?language=en. It is designed for simulating high-intensity focused ultrasound (HIFU) fields generated by single-element transducers and annular arrays with propagation in flat-layered media that mimic biological tissues. Numerical models incorporated in the simulator include evolution-type equations, either the Khokhlov&#x2013;Zabolotskaya&#x2013;Kuznetsov (KZK) equation or one-way Westervelt equation, for radially symmetric ultrasound beams in homogeneous and layered media with thermoviscous or power law acoustic absorption. The software uses shock-capturing methods that allow for simulating strongly nonlinear acoustic fields with high-amplitude shocks. In this paper, a general description of the software is given along with three representative simulation cases of ultrasound transducers and focusing conditions typical for therapeutic applications. The examples illustrate major nonlinear wave effects in HIFU fields including shock formation. Two examples simulate propagation in water, involving a single-element source (1 MHz frequency, 100 mm diameter, 90 mm radius of curvature) and a 16-element annular array (3 MHz frequency, 48 mm diameter, and 35 mm radius of curvature). The third example mimics the scenario of a HIFU treatment in a &#x2018;water-muscle-kidney&#x2019; layered medium using a source typical for abdominal HIFU applications (1.2 MHz frequency, 120 mm diameter and radius of curvature). Linear, quasi-linear, and shock-wave exposure protocols are considered. It is intended that &#x201C;HIFU beam&#x201D; can be useful in teaching nonlinear acoustics; designing and characterizing high-power transducers; and developing exposure protocols for a wide range of therapeutic applications such as shock-based HIFU, boiling histotripsy, drug delivery, immunotherapy, and others.",
                "authors": [
                    {
                        "name": "Yuldashev P.V."
                    },
                    {
                        "name": "Karzova M.M."
                    },
                    {
                        "name": "Kreider W."
                    },
                    {
                        "name": "Rosnitskiy P.B."
                    },
                    {
                        "name": "Sapozhnikov O.A."
                    },
                    {
                        "name": "Khokhlova V.A."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Ultrasonics, Ferroelectrics, and Frequency Control",
                "title": "&#x201C;HIFU beam&#x201D;: a Simulator for Predicting Axially Symmetric Nonlinear Acoustic Fields Generated by Focused Transducers in a Layered Medium"
            },
            "pmid": "33877971",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Suite",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Echography",
            "uri": "http://edamontology.org/topic_3954"
        },
        {
            "term": "Biotherapeutics",
            "uri": "http://edamontology.org/topic_3374"
        }
    ]
}