{
    "additionDate": "2020-01-14T09:50:20Z",
    "biotoolsCURIE": "biotools:opendata",
    "biotoolsID": "opendata",
    "confidence_flag": "very low",
    "credit": [
        {
            "email": "tsyong212@yuhs.ac",
            "name": "Tai-Soon Yong",
            "orcidid": "https://orcid.org/0000-0002-3445-0769",
            "typeEntity": "Person"
        }
    ],
    "description": "Parasitic infections and medical expenses according to Health Insurance Review Assessment claims data in South Korea, 2011-2018.\n\n1월 15일부터 SAS Studio는 windows10 환경에 internet Explorer 브라우져에서만 사용이 가능합니다.\n\n의료빅데이터 연구과제 이용 관련 변경사항 안내 2019-07-05.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'anisakiasis', 'anisakiasis pinworm', 'cysticercosis anisakiasis pinworm', 'claims cysticercosis anisakiasis pinworm'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                },
                {
                    "term": "Heat map generation",
                    "uri": "http://edamontology.org/operation_0531"
                }
            ]
        }
    ],
    "homepage": "http://opendata.hira.or.kr",
    "lastUpdate": "2020-01-14T09:50:20Z",
    "name": "opendata",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0225508",
            "metadata": {
                "abstract": "© 2019 Kim et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Introduction In South Korea, Health Insurance Review and Assessment claims data contain comprehensive information on healthcare services for almost the entire population. The present study used claims data on parasitic diseases from 2011 to 2018, and associated medical expenses to investigate infection trends associated with endemic parasitic diseases in South Korea, including those not monitored by Korea Centers for Disease Control and Prevention. Methods Basic data regarding each parasitic disease were curated from the Healthcare Bigdata Hub (http://opendata.hira.or.kr). Ten endemic parasitic diseases, three pandemic protozoan diseases, and three ectoparasitic diseases were evaluated between 2011 and 2018. Data on each parasitic disease included the number of patients of each sex, age range within 5 years, province, and total medical expenses. Heatmap and principal component analysis were performed to visualize the incidence pattern of parasitic diseases by provinces. Results Clonorchiasis and pinworm infections decreased remarkably from 6,097 and 4,018 infections in 2011 to 3,008 and 1,988 infections in 2018, respectively. Other endemic parasitic diseases mostly declined or remained steady over the 8-year period, except for anisakiasis, which doubled from 409 in 2011 to 818 in 2018. Provinces close to North Korea had a higher frequency of claims for Plasmodium vivax infection. The highest rate of clonorchiasis was in Gyeongsangnam-do, while that of anisakiasis was in southern Korea. Jeju province had the highest number of claims for cysticercosis, anisakiasis, pinworm infection, and soil-transmitted helminth infections. The total medical expense for anisakiasis was 65 million Korean won (57,000 US$) in 2011, rising to 237 million Korean won (206,000 US$) in 2018. The medical expense for trichomoniasis was 6,063 million won and for scabies was 1,669 million won in 2018. Since the claims data include only data reported by healthcare providers, some discrepancies might have occurred. Conclusion Our findings provide the basis for a health policy to reduce further infections and medical expense.",
                "authors": [
                    {
                        "name": "Kim J.Y."
                    },
                    {
                        "name": "Yi M.-H."
                    },
                    {
                        "name": "Yong T.-S."
                    }
                ],
                "date": "2019-11-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Parasitic infections and medical expenses according to Health Insurance Review Assessment claims data in South Korea, 2011–2018"
            },
            "pmcid": "PMC6879140",
            "pmid": "31770393"
        }
    ],
    "topic": [
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Parasitology",
            "uri": "http://edamontology.org/topic_3302"
        },
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        }
    ]
}