{
    "accessibility": "Open access",
    "additionDate": "2019-08-11T11:29:59Z",
    "biotoolsCURIE": "biotools:QuantumInformation.j",
    "biotoolsID": "QuantumInformation.j",
    "cost": "Free of charge",
    "description": "Quantum information theory library that provides functions for creating and analyzing quantum states, and for creating quantum operations in various representations.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/ZKSI/QuantumInformation.jl/blob/master/README.md"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/ZKSI/QuantumInformation.jl/releases"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/ZKSI/QuantumInformation.jl",
    "language": [
        "Julia"
    ],
    "lastUpdate": "2020-06-16T10:55:24Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/ZKSI/QuantumInformation.jl/issues"
        }
    ],
    "maturity": "Mature",
    "name": "QuantumInformation.j",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0209358",
            "metadata": {
                "abstract": "© 2018 Gawron et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Numerical investigations are an important research tool in quantum information theory. There already exists a wide range of computational tools for quantum information theory implemented in various programming languages. However, there is little effort in implementing this kind of tools in the Julia language. Julia is a modern programming language designed for numerical computation with excellent support for vector and matrix algebra, extended type system that allows for implementation of elegant application interfaces and support for parallel and distributed computing. QuantumInformation.jl is a new quantum information theory library implemented in Julia that provides functions for creating and analyzing quantum states, and for creating quantum operations in various representations. An additional feature of the library is a collection of functions for sampling random quantum states and operations such as unitary operations and generic quantum channels.",
                "authors": [
                    {
                        "name": "Gawron P."
                    },
                    {
                        "name": "Kurzyk D."
                    },
                    {
                        "name": "Pawela L."
                    }
                ],
                "citationCount": 5,
                "date": "2018-12-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "QuantumInformation.jl—A Julia package for numerical computation in quantum information theory"
            },
            "pmcid": "PMC6306216",
            "pmid": "30586393",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Pure mathematics",
            "uri": "http://edamontology.org/topic_3570"
        },
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        }
    ],
    "validated": 1
}