{
    "accessibility": "Open access",
    "additionDate": "2022-08-24T14:40:37.469602Z",
    "biotoolsCURIE": "biotools:glider",
    "biotoolsID": "glider",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "cowen@cs.tufts.edu",
            "name": "Lenore J Cowen",
            "orcidid": "https://orcid.org/0000-0001-6698-6413",
            "typeEntity": "Person"
        }
    ],
    "description": "GLIDER, a method that replaces a protein-protein interaction or association network with a new graph-based similarity network.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                }
            ]
        }
    ],
    "homepage": "https://github.com/kap-devkota/GLIDER",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-08-24T14:40:37.472309Z",
    "license": "Not licensed",
    "name": "GLIDER",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAC322",
            "metadata": {
                "abstract": "© 2022 The Author(s) 2022. Published by Oxford University Press.Motivation: Protein function prediction, based on the patterns of connection in a protein-protein interaction (or association) network, is perhaps the most studied of the classical, fundamental inference problems for biological networks. A highly successful set of recent approaches use random walk-based low-dimensional embeddings that tend to place functionally similar proteins into coherent spatial regions. However, these approaches lose valuable local graph structure from the network when considering only the embedding. We introduce GLIDER, a method that replaces a protein-protein interaction or association network with a new graph-based similarity network. GLIDER is based on a variant of our previous GLIDE method, which was designed to predict missing links in protein-protein association networks, capturing implicit local and global (i.e. embedding-based) graph properties. Results: GLIDER outperforms competing methods on the task of predicting GO functional labels in cross-validation on a heterogeneous collection of four human protein-protein association networks derived from the 2016 DREAM Disease Module Identification Challenge, and also on three different protein-protein association networks built from the STRING database. We show that this is due to the strong functional enrichment that is present in the local GLIDER neighborhood in multiple different types of protein-protein association networks. Furthermore, we introduce the GLIDER graph neighborhood as a way for biologists to visualize the local neighborhood of a disease gene. As an application, we look at the local GLIDER neighborhoods of a set of known Parkinson's Disease GWAS genes, rediscover many genes which have known involvement in Parkinson's disease pathways, plus suggest some new genes to study.",
                "authors": [
                    {
                        "name": "Arsenescu V."
                    },
                    {
                        "name": "Cowen L.J."
                    },
                    {
                        "name": "Devkota K."
                    },
                    {
                        "name": "Erden M."
                    },
                    {
                        "name": "Murphy J.M."
                    },
                    {
                        "name": "Schmidt H."
                    },
                    {
                        "name": "Werenski M."
                    }
                ],
                "date": "2022-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "GLIDER: Function prediction from GLIDE-based neighborhoods"
            },
            "pmcid": "PMC9237677",
            "pmid": "35575379"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ],
    "validated": 1
}
