{
    "accessibility": "Open access",
    "additionDate": "2018-02-08T12:10:44Z",
    "biotoolsCURIE": "biotools:hmtdb",
    "biotoolsID": "hmtdb",
    "collectionID": [
        "RD-connect",
        "Rare Disease"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "name": "ELIXIR-ITA-BARI",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "hmtdb.update@uniba.it",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.hmtdb.uniba.it/hmdb/contacts"
        }
    ],
    "description": "Database of human mitochondrial genomes from primary INSDC databases, personal submissions and application of MtoolBox to NGS data.",
    "editPermission": {
        "authors": [
            "lmatalonga"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence database search",
                    "uri": "http://edamontology.org/operation_0338"
                }
            ]
        }
    ],
    "homepage": "http://www.hmtdb.uniba.it/",
    "lastUpdate": "2020-06-16T10:55:22Z",
    "maturity": "Mature",
    "name": "HmtDB",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "roberto.preste",
    "publication": [
        {
            "doi": "10.1093/nar/gkw1066",
            "metadata": {
                "abstract": "© The Author(s) 2016. Published by Oxford University Press on behalf of Nucleic Acids Research.The HmtDB resource hosts a database of human mitochondrial genome sequences fromindividuals with healthy and disease phenotypes. The database is intended to support both population geneticists as well as clinicians undertaking the task to assess the pathogenicity of specific mtDNAmutations. The wide application of next-generation sequencing (NGS) has provided an enormous volume of high-resolution data at a low price, increasing the availability of humanmitochondrial sequencing data, which called for a cogent and significant expansion of HmtDB data content that has more than tripled in the current release. We here describe additional novel features, including: (i) a complete, user-friendly restyling of the web interface, (ii) links to the command-line standalone and web versions of the MToolBox package, an up-to-date tool to reconstruct and analyze human mitochondrial DNA from NGS data and (iii) the implementation of the Reconstructed Sapiens Reference Sequence (RSRS) as mitochondrial reference sequence. The overall update renders HmtDB an even more handy and useful resource as it enables a more rapid data access, processing and analysis. HmtDB is accessible at http://www.hmtdb.uniba.it/.",
                "authors": [
                    {
                        "name": "Clima R."
                    },
                    {
                        "name": "Preste R."
                    },
                    {
                        "name": "Calabrese C."
                    },
                    {
                        "name": "Diroma M.A."
                    },
                    {
                        "name": "Santorsola M."
                    },
                    {
                        "name": "Scioscia G."
                    },
                    {
                        "name": "Simone D."
                    },
                    {
                        "name": "Shen L."
                    },
                    {
                        "name": "Gasparre G."
                    },
                    {
                        "name": "Attimonelli M."
                    }
                ],
                "citationCount": 13,
                "date": "2017-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "HmtDB 2016: Data update, a better performing query system and human mitochondrial DNA haplogroup predictor"
            },
            "pmcid": "PMC5210550",
            "pmid": "27899581",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/nar/gkr1086",
            "metadata": {
                "abstract": "HmtDB (http://www.hmtdb.uniba.it:8080/hmdb) is a open resource created to support population genetics and mitochondrial disease studies. The database hosts human mitochondrial genome sequences annotated with population and variability data, the latter being estimated through the application of the SiteVar software based on site-specific nucleotide and amino acid variability calculations. The annotations are manually curated thus adding value to the quality of the information provided to the end-user. Classifier tools implemented in HmtDB allow the prediction of the haplogroup for any human mitochondrial genome currently stored in HmtDB or externally submitted de novo by an end-user. Haplogroup definition is based on the Phylotree system. End-users accessing HmtDB are hence allowed to (i) browse the database through the use of a multi-criterion 'query' system; (ii) analyze their own human mitochondrial sequences via the 'classify' tool (for complete genomes) or by downloading the 'fragment-classifier' tool (for partial sequences); (iii) download multi-alignments with reference genomes as well as variability data. © The Author(s) 2011. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Rubino F."
                    },
                    {
                        "name": "Piredda R."
                    },
                    {
                        "name": "Calabrese F.M."
                    },
                    {
                        "name": "Simone D."
                    },
                    {
                        "name": "Lang M."
                    },
                    {
                        "name": "Calabrese C."
                    },
                    {
                        "name": "Petruzzella V."
                    },
                    {
                        "name": "Tommaseo-Ponzetta M."
                    },
                    {
                        "name": "Gasparre G."
                    },
                    {
                        "name": "Attimonelli M."
                    }
                ],
                "citationCount": 64,
                "date": "2012-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "HmtDB, a genomic resource for mitochondrion-based human variability studies"
            },
            "pmcid": "PMC3245114",
            "pmid": "22139932",
            "type": [
                "Other"
            ]
        },
        {
            "doi": "10.1186/1471-2105-6-S4-S4",
            "metadata": {
                "abstract": "Background: Population genetics studies based on the analysis of mtDNA and mitochondrial disease studies have produced a huge quantity of sequence data and related information. These data are at present worldwide distributed in differently organised databases and web sites not well integrated among them. Moreover it is not generally possible for the user to submit and contemporarily analyse its own data comparing them with the content of a given database, both for population genetics and mitochondrial disease data. Results: HmtDB is a well-integrated web-based human mitochondrial bioinformatic resource aimed at supporting population genetics and mitochondrial disease studies, thanks to a new approach based on site-specific nucleotide and aminoacid variability estimation. HmtDB consists of a database of Human Mitochondrial Genomes, annotated with population data, and a set of bioinformatic tools, able to produce site-specific variability data and to automatically characterize newly sequenced human mitochondrial genomes. A query system for the retrieval of genomes and a web submission tool for the annotation of new genomes have been designed and will soon be implemented. The first release contains 1255 fully annotated human mitochondrial genomes. Nucleotide site-specific variability data and multialigned genomes can be downloaded. Intra-human and inter-species aminoacid variability data estimated on the 13 coding for proteins genes of the 1255 human genomes and 60 mammalian species are also available. HmtDB is freely available, upon registration, at http://www.hmdb.uniba.it. Conclusion: The HmtDB project will contribute towards completing and/or refining haplogroup classification and revealing the real pathogenic potential of mitochondrial mutations, on the basis of variability estimation.",
                "authors": [
                    {
                        "name": "Attimonelli M."
                    },
                    {
                        "name": "Accetturo M."
                    },
                    {
                        "name": "Santamaria M."
                    },
                    {
                        "name": "Lascaro D."
                    },
                    {
                        "name": "Scioscia G."
                    },
                    {
                        "name": "Pappada G."
                    },
                    {
                        "name": "Russo L."
                    },
                    {
                        "name": "Zanchetta L."
                    },
                    {
                        "name": "Tommaseo-Ponzetta M."
                    }
                ],
                "citationCount": 37,
                "date": "2005-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "HmtDB, a human mitochondrial genomic resource based on variability studies supporting population genetics and biomedical research"
            },
            "pmcid": "PMC1866381",
            "pmid": "16351753",
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Web API",
        "Web application",
        "Database portal"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        }
    ]
}