{"credit":[{"email":"dibernardo@tigem.it","name":"Diego di Bernardo","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"f.napolitano@tigem.it","name":"Francesco Napolitano","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"d.carrella@tigem.it","name":"Diego Carrella","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://dsea.tigem.it/about.php"}],"download":[{"type":"Biological data","url":"http://dsea.tigem.it/downloads.php"}],"function":[{"operation":[{"term":"Enrichment analysis","uri":"http://edamontology.org/operation_3501"}]}],"labels":{"accessibility":["Open access"],"cost":"Free of charge","license":"Other","maturity":"Mature","operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Pharmacology","uri":"http://edamontology.org/topic_0202"},{"term":"Small molecules","uri":"http://edamontology.org/topic_0154"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"}]},"publication":[{"abstract":"© 2015 The Author 2015. Published by Oxford University Press. Motivation: Automated screening approaches are able to rapidly identify a set of small molecules inducing a desired phenotype from large small-molecule libraries. However, the resulting set of candidate molecules is usually very diverse pharmacologically, thus little insight on the shared mechanism of action (MoA) underlying their efficacy can be gained. Results: We introduce a computational method (Drug-Set Enrichment Analysis - DSEA) based on drug-induced gene expression profiles, which is able to identify the molecular pathways that are targeted by most of the drugs in the set. By diluting drug-specific effects unrelated to the phenotype of interest, DSEA is able to highlight phenotype-specific pathways, thus helping to formulate hypotheses on the MoA shared by the drugs in the set. We validated the method by analysing five different drug-sets related to well-known pharmacological classes. We then applied DSEA to identify the MoA shared by drugs known to be partially effective in rescuing mutant cystic fibrosis transmembrane conductance regulator (CFTR) gene function in Cystic Fibrosis. Availability and implementation: The method is implemented as an online web tool publicly available at http://dsea.tigem.it. Contact: Supplementary information: Supplementary data are available at Bioinformatics online.","authors":["Napolitano F.","Sirci F.","Carrella D.","Di Bernardo D."],"cit_count":21,"doi":"10.1093/bioinformatics/btv536","journal":"Bioinformatics","title":"Drug-set enrichment analysis: A novel tool to investigate drug mode of action","type":"Primary","year":"2016-01-15"}],"summary":{"biotoolsCURIE":"biotools:DSEA","biotoolsID":"DSEA","description":"Drug-Set Enrichment Analysis (DSEA) - computational method based on drug-induced gene expression profiles, which is able to identify the molecular pathways that are targeted by most of the drugs in the set.","homepage":"http://dsea.tigem.it/","name":"DSEA"}}