{
    "additionDate": "2020-01-09T17:38:36Z",
    "biotoolsCURIE": "biotools:BUGSnet",
    "biotoolsID": "BUGSnet",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "audrey.beliveau@waterloo.ca",
            "name": "Audrey Béliveau",
            "orcidid": "https://orcid.org/0000-0003-4124-2498",
            "typeEntity": "Person"
        }
    ],
    "description": "an R package to facilitate the conduct and reporting of Bayesian network Meta-analyses.\n\nBayesian inference Using Gibbs Sampling to conduct NETwork meta-analysis”].\n\nBUGSnet: Bayesian inference Using Gibbs Sampling to conduct NETwork meta-analysis.\n\n[Home] [Installation] [RStudio Server] [Vignettes].\n\nBUGSnet is a new feature-rich R package to conduct high-quality Bayesian NMA analyses and facilitate compliance with best practice guidelines and reporting. Bayesian analyses are conducted with JAGS (BUGS code is automatically generated by the package based on the user’s inputs.) Outputs are highly customizable and include network plots, tables of network characteristics, data plots, league tables and league heat plots, SUCRA plots, rankograms, forest plots, leverage plots, traceplots and posterior mean deviance comparison plots",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "https://bugsnetsoftware.github.io/",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-09T15:43:16.841903Z",
    "name": "BUGSnet",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12874-019-0829-2",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Several reviews have noted shortcomings regarding the quality and reporting of network meta-analyses (NMAs). We suspect that this issue may be partially attributable to limitations in current NMA software which do not readily produce all of the output needed to satisfy current guidelines. Results: To better facilitate the conduct and reporting of NMAs, we have created an R package called \"BUGSnet\" (Bayesian inference Using Gibbs Sampling to conduct a Network meta-analysis). This R package relies upon Just Another Gibbs Sampler (JAGS) to conduct Bayesian NMA using a generalized linear model. BUGSnet contains a suite of functions that can be used to describe the evidence network, estimate a model and assess the model fit and convergence, assess the presence of heterogeneity and inconsistency, and output the results in a variety of formats including league tables and surface under the cumulative rank curve (SUCRA) plots. We provide a demonstration of the functions contained within BUGSnet by recreating a Bayesian NMA found in the second technical support document composed by the National Institute for Health and Care Excellence Decision Support Unit (NICE-DSU). We have also mapped these functions to checklist items within current reporting and best practice guidelines. Conclusion: BUGSnet is a new R package that can be used to conduct a Bayesian NMA and produce all of the necessary output needed to satisfy current scientific and regulatory standards. We hope that this software will help to improve the conduct and reporting of NMAs.",
                "authors": [
                    {
                        "name": "Beliveau A."
                    },
                    {
                        "name": "Boyne D.J."
                    },
                    {
                        "name": "Slater J."
                    },
                    {
                        "name": "Brenner D."
                    },
                    {
                        "name": "Arora P."
                    }
                ],
                "citationCount": 7,
                "date": "2019-10-22T00:00:00Z",
                "journal": "BMC Medical Research Methodology",
                "title": "BUGSnet: An R package to facilitate the conduct and reporting of Bayesian network Meta-analyses"
            },
            "pmcid": "PMC6805536",
            "pmid": "31640567"
        }
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ]
}