{
    "additionDate": "2017-12-18T00:06:20Z",
    "biotoolsCURIE": "biotools:floss",
    "biotoolsID": "floss",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://faculty.washington.edu/browning/"
        }
    ],
    "description": "FLOSS (flexible ordered subset analysis) software package uses input and output files from the MERLIN linkage analysis package (Abecasis et al, 2002) to perform an ordered subset analysis using either nonparametric linkage analysis z-scores or linear allele sharing model LOD scores.",
    "documentation": [
        {
            "type": "General",
            "url": "http://faculty.washington.edu/browning/floss/floss.htm"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Linkage analysis",
                    "uri": "http://edamontology.org/operation_0283"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "http://faculty.washington.edu/browning/floss/floss.htm",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/floss-1-4-1-ordered-subset-linkage-analysis.html"
        }
    ],
    "name": "FLOSS",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1038/ng786",
            "metadata": {
                "abstract": "Efforts to find disease genes using high-density single-nucleotide polymorphism (SNP) maps will produce data sets that exceed the limitations of current computational tools. Here we describe a new, efficient method for the analysis of dense genetic maps in pedigree data that provides extremely fast solutions to common problems such as allele-sharing analyses and haplotyping. We show that sparse binary trees represent patterns of gene flow in general pedigrees in a parsimonious manner, and derive a family of related algorithms for pedigree traversal. With these trees, exact likelihood calculations can be carried out efficiently for single markers or for multiple linked markers. Using an approximate multipoint calculation that ignores the unlikely possibility of a large number of recombinants further improves speed and provides accurate solutions in dense maps with thousands of markers. Our multipoint engine for rapid likelihood inference (Merlin) is a computer program that uses sparse inheritance trees for pedigree analysis; it performs rapid haplotyping, genotype error detection and affected pair linkage analyses and can handle more markers than other pedigree analysis packages.",
                "authors": [
                    {
                        "name": "Abecasis G.R."
                    },
                    {
                        "name": "Cherny S.S."
                    },
                    {
                        "name": "Cookson W.O."
                    },
                    {
                        "name": "Cardon L.R."
                    }
                ],
                "citationCount": 2529,
                "date": "2002-01-01T00:00:00Z",
                "journal": "Nature Genetics",
                "title": "Merlin — Rapid analysis of dense genetic maps using sparse gene flow trees"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Linkage",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1,
    "version": [
        "1.4.1"
    ]
}