
{
    "credit": [
        {
            "email": "yjtseng@csie.ntu.edu.tw",
            "name": "Yufeng J. Tseng",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/CMDM-Lab/GAME"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Service composition",
                    "uri": "http://edamontology.org/operation_3762"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "license": "GPL-3.0",
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Cheminformatics",
                "uri": "http://edamontology.org/topic_2258"
            },
            {
                "term": "Software engineering",
                "uri": "http://edamontology.org/topic_3372"
            },
            {
                "term": "Computational chemistry",
                "uri": "http://edamontology.org/topic_3332"
            },
            {
                "term": "Metabolomics",
                "uri": "http://edamontology.org/topic_3172"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2017 The Author(s).GPU acceleration is useful in solving complex chemical information problems. Identifying unknown structures from the mass spectra of natural product mixtures has been a desirable yet unresolved issue in metabolomics. However, this elucidation process has been hampered by complex experimental data and the inability of instruments to completely separate different compounds. Fortunately, with current high-resolution mass spectrometry, one feasible strategy is to define this problem as extending a scaffold database with sidechains of different probabilities to match the high-resolution mass obtained from a high-resolution mass spectrum. By introducing a dynamic programming (DP) algorithm, it is possible to solve this NP-complete problem in pseudo-polynomial time. However, the running time of the DP algorithm grows by orders of magnitude as the number of mass decimal digits increases, thus limiting the boost in structural prediction capabilities. By harnessing the heavily parallel architecture of modern GPUs, we designed a \"compute unified device architecture\" (CUDA)-based GPU-accelerated mixture elucidator (G.A.M.E.) that considerably improves the performance of the DP, allowing up to five decimal digits for input mass data. As exemplified by four testing datasets with verified constitutions from natural products, G.A.M.E. allows for efficient and automatic structural elucidation of unknown mixtures for practical procedures.",
            "authors": [
                "Schurz A.",
                "Su B.-H.",
                "Tu Y.-S.",
                "Lu T.T.-Y.",
                "Lin O.A.",
                "Tseng Y.J."
            ],
            "cit_count": 0,
            "doi": "10.1186/s13321-017-0238-7",
            "journal": "Journal of Cheminformatics",
            "title": "G.A.M.E.: GPU-accelerated mixture elucidator",
            "year": "2017-09-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:game",
        "biotoolsID": "game",
        "description": "GPU-Accelerated Mixture Elucidator. GPU acceleration is useful in solving complex chemical information problems. Identifying unknown structures from the mass spectra of natural product mixtures has been a desirable yet unresolved issue in metabolomics.",
        "homepage": "https://github.com/CMDM-Lab/GAME",
        "name": "G.A.M.E"
    }
}