{
    "accessibility": "Open access",
    "additionDate": "2023-01-27T01:39:52.853100Z",
    "biotoolsCURIE": "biotools:openedc",
    "biotoolsID": "openedc",
    "collectionID": [
        "RD-Candidate"
    ],
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "leonard.greulich@uni-muenster.de",
            "name": "Leonard Greulich",
            "orcidid": "https://orcid.org/0000-0003-3148-2105",
            "typeEntity": "Person"
        },
        {
            "name": "Martin Dugas",
            "orcidid": "https://orcid.org/0000-0001-9740-0788"
        },
        {
            "name": "Stefan Hegselmann",
            "orcidid": "https://orcid.org/0000-0002-2145-3258"
        }
    ],
    "description": "An Open-Source, Standard-Compliant, and Mobile Electronic Data Capture System for Medical Research (OpenEDC).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://openedc.org",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2023-01-27T01:39:52.855875Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/imi-muenster/OpenEDC"
        }
    ],
    "name": "OpenEDC",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.2196/29176",
            "metadata": {
                "abstract": "© 2021 Eesti Rakenduslingvistika Uhingu Aastaraamat. All rights reserved.Background: Medical research and machine learning for health care depend on high-quality data. Electronic data capture (EDC) systems have been widely adopted for metadata-driven digital data collection. However, many systems use proprietary and incompatible formats that inhibit clinical data exchange and metadata reuse. In addition, the configuration and financial requirements of typical EDC systems frequently prevent small-scale studies from benefiting from their inherent advantages. Objective: The aim of this study is to develop and publish an open-source EDC system that addresses these issues. We aim to plan a system that is applicable to a wide range of research projects. Methods: We conducted a literature-based requirements analysis to identify the academic and regulatory demands for digital data collection. After designing and implementing OpenEDC, we performed a usability evaluation to obtain feedback from users. Results: We identified 20 frequently stated requirements for EDC. According to the International Organization for Standardization/International Electrotechnical Commission (ISO/IEC) 25010 norm, we categorized the requirements into functional suitability, availability, compatibility, usability, and security. We developed OpenEDC based on the regulatory-compliant Clinical Data Interchange Standards Consortium Operational Data Model (CDISC ODM) standard. Mobile device support enables the collection of patient-reported outcomes. OpenEDC is publicly available and released under the MIT open-source license. Conclusions: Adopting an established standard without modifications supports metadata reuse and clinical data exchange, but it limits item layouts. OpenEDC is a stand-alone web app that can be used without a setup or configuration. This should foster compatibility between medical research and open science. OpenEDC is targeted at observational and translational research studies by clinicians.",
                "authors": [
                    {
                        "name": "Dugas M."
                    },
                    {
                        "name": "Greulich L."
                    },
                    {
                        "name": "Hegselmann S."
                    }
                ],
                "date": "2021-11-01T00:00:00Z",
                "journal": "JMIR Medical Informatics",
                "title": "An open-source, standard-compliant, and mobile electronic data capture system for medical research (openedc): Design and evaluation study"
            },
            "pmcid": "PMC8663450",
            "pmid": "34806987"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medicines research and development",
            "uri": "http://edamontology.org/topic_3376"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        }
    ]
}
