{
    "name": "Codonome", 
    "description": "CODONOME collects the expression value of each codon (just called \"codonome\") and of each aminoacyl-tRNA synthetase (aaRS). To do this, the software is able to count the total mRNA codon number of any organism and to import and integrate any mRNA expression data source in tabulated text format.", 
    "homepage": "http://apollo11.isto.unibo.it/software/Codonome/", 
    "biotoolsID": "Codonome", 
    "biotoolsCURIE": "biotools:Codonome", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [], 
    "toolType": [
        "Desktop application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0204", 
            "term": "Gene regulation"
        }, 
        {
            "uri": "http://edamontology.org/topic_3512", 
            "term": "Gene transcripts"
        }
    ], 
    "operatingSystem": [
        "Windows", 
        "Mac"
    ], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "http://apollo11.isto.unibo.it/software/Codonome/CODONOME_Guide.html", 
            "type": "Tutorial", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1016/j.ygeno.2013.02.009", 
            "pmid": "23466472", 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "Universal tight correlation of codon bias and pool of RNA codons (codonome): The genome is optimized to allow any distribution of gene expression values in the transcriptome from bacteria to humans", 
                "abstract": "Codon bias is the phenomenon in which distinct synonymous codons are used with different frequencies. We define here the \"codonome value\" as the total number of codons present across all the expressed mRNAs in a given biological condition. We have developed the \"CODONOME\" software, which calculates the codon bias and, following integration with a gene expression profile, estimates the actual frequency of each codon at the transcriptome level (codonome bias) of a given tissue. Systematic analysis across different human tissues and multiple species shows a surprisingly tight correlation between the codon bias and the codonome bias. An aneuploidy and cancer condition such as that of Down Syndrome-related acute megakaryoblastic leukemia (DS-AMKL), does not appear to alter this relationship. The law of correlation between codon bias and codonome emerges as a property of the distribution and range of the number, sequence and expression level of the genes in a genome. © 2013 Elsevier Inc.", 
                "date": "2013-05-01T00:00:00Z", 
                "citationCount": 15, 
                "authors": [
                    {
                        "name": "Piovesan A."
                    }, 
                    {
                        "name": "Vitale L."
                    }, 
                    {
                        "name": "Pelleri M.C."
                    }, 
                    {
                        "name": "Strippoli P."
                    }
                ], 
                "journal": "Genomics"
            }
        }
    ], 
    "credit": [], 
    "owner": "allison.piovesan2", 
    "additionDate": "2019-07-26T16:40:37Z", 
    "lastUpdate": "2019-07-26T16:42:17Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 0, 
    "homepage_status": 0, 
    "elixir_badge": 0
}