{
    "additionDate": "2018-06-20T18:50:29Z",
    "biotoolsCURIE": "biotools:hicaptools",
    "biotoolsID": "hicaptools",
    "credit": [
        {
            "email": "pelinak@kth.se",
            "name": "Pelin Sahlén",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Probe design and proximity detection for targeted chromosome conformation capture applications.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/sahlenlab/HiCapTools"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Primer and probe design",
                    "uri": "http://edamontology.org/operation_2419"
                }
            ]
        }
    ],
    "homepage": "https://github.com/sahlenlab/HiCapTools",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "HiCapTools",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btx625",
            "metadata": {
                "abstract": "© The Author 2017. Published by Oxford University Press. All rights reserved. For Permissions, please e-mail: journals.permissions@oup.com.Summary Folding of eukaryotic genomes within nuclear space enables physical and functional contacts between regions that are otherwise kilobases away in sequence space. Targeted chromosome conformation capture methods (T2C, chi-C and HiCap) are capable of informing genomic contacts for a subset of regions targeted by probes. We here present HiCapTools, a software package that can design sequence capture probes for targeted chromosome capture applications and analyse sequencing output to detect proximities involving targeted fragments. Two probes are designed for each feature while avoiding repeat elements and non-unique regions. The data analysis suite processes alignment files to report genomic proximities for each feature at restriction fragment level and is isoform-aware for gene features. Statistical significance of contact frequencies is evaluated using an empirically derived background distribution. Targeted chromosome conformation capture applications are invaluable for locating target genes of disease-associated variants found by genome-wide association studies. Hence, we believe our software suite will prove to be useful for a wider user base within clinical and functional applications. Availability https://github.com/sahlenlab/HiCapTools. Contact pelinak@kth.se Supplementary informationSupplementary dataare available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Akerborg O."
                    },
                    {
                        "name": "Anil A."
                    },
                    {
                        "name": "Sahlen P."
                    },
                    {
                        "name": "Spalinskas R."
                    }
                ],
                "citationCount": 11,
                "date": "2018-02-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "HiCapTools: A software suite for probe design and proximity detection for targeted chromosome conformation capture applications"
            }
        }
    ],
    "toolType": [
        "Suite"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}
