{
    "additionDate": "2017-01-13T13:14:06Z",
    "biotoolsCURIE": "biotools:clipcrop",
    "biotoolsID": "clipcrop",
    "credit": [
        {
            "email": "masao@hgc.jp",
            "name": "Masao Nagasaki",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A new method and implementation named ClipCrop for detecting SVs with single-base resolution",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/shinout/clipcrop"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/shinout/clipcrop",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2019-03-12T13:15:01Z",
    "name": "ClipCrop",
    "owner": "seqwiki_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-12-s14-s7",
            "metadata": {
                "abstract": "Structural variations (SVs) change the structure of the genome and are therefore the causes of various diseases. Next-generation sequencing allows us to obtain a multitude of sequence data, some of which can be used to infer the position of SVs. We developed a new method and implementation named ClipCrop for detecting SVs with single-base resolution using soft-clipping information. A soft-clipped sequence is an unmatched fragment in a partially mapped read. To assess the performance of ClipCrop with other SV-detecting tools, we generated various patterns of simulation data - SV lengths, read lengths, and the depth of coverage of short reads - with insertions, deletions, tandem duplications, inversions and single nucleotide alterations in a human chromosome. For comparison, we selected BreakDancer, CNVnator and Pindel, each of which adopts a different approach to detect SVs, e.g. discordant pair approach, depth of coverage approach and split read approach, respectively. Our method outperformed BreakDancer and CNVnator in both discovering rate and call accuracy in any type of SV. Pindel offered a similar performance as our method, but our method crucially outperformed for detecting small duplications. From our experiments, ClipCrop infer reliable SVs for the data set with more than 50 bases read lengths and 20x depth of coverage, both of which are reasonable values in current NGS data set. ClipCrop can detect SVs with higher discovering rate and call accuracy than any other tool in our simulation data set.",
                "authors": [
                    {
                        "name": "Suzuki S."
                    },
                    {
                        "name": "Yasuda T."
                    },
                    {
                        "name": "Shiraishi Y."
                    },
                    {
                        "name": "Miyano S."
                    },
                    {
                        "name": "Nagasaki M."
                    }
                ],
                "citationCount": 27,
                "date": "2011-01-01T00:00:00Z",
                "journal": "BMC bioinformatics",
                "title": "ClipCrop: a tool for detecting structural variations with single-base resolution using soft-clipping information."
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ]
}