{
    "additionDate": "2020-01-09T17:33:21Z",
    "biotoolsCURIE": "biotools:ROMOP",
    "biotoolsID": "ROMOP",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Nicholas Giangreco",
            "typeEntity": "Person"
        },
        {
            "name": "Phyllis M. Thangaraj",
            "typeEntity": "Person"
        }
    ],
    "description": "a light-weight R package for interfacing with OMOP-formatted electronic health record data.\n\nR package to easily interface with OMOP-formatted EHR data.\n\nROMOP, please wait... This may take a minute or two.\n\nLaunching ROMOP, please wait... This may take a minute or two. ...\n\nROMOP is a flexible R package to interface with the Observational Health Data Sciences and Informatics (OHDSI) OMOP Common Data Model. Briefly, OMOP is a standardized relational database schema for Electronic Health Record (EHR) or Electronic Medical Record (EMR) data (i.e., patient data collected during clinical visits to a health system). The main benefit of a standardized schema is that it allows for interoperability between institutions, even if the underlying EHR vendors are disparate.\n\nBenjamin S. Glicksberg 9/14/2018",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://romop.ucsf.edu",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-13T16:45:27Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "http://github.com/BenGlicksberg/ROMOP"
        }
    ],
    "name": "ROMOP",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/JAMIAOPEN/OOY059",
            "metadata": {
                "abstract": "© 2019 The Author(s).Objectives: Electronic health record (EHR) data are increasingly used for biomedical discoveries. The nature of the data, however, requires expertise in both data science and EHR structure. The Observational Medical Outcomes Partnership (OMOP) common data model (CDM) standardizes the language and structure of EHR data to promote interoperability of EHR data for research. While the OMOP CDM is valuable and more attuned to research purposes, it still requires extensive domain knowledge to utilize effectively, potentially limiting more widespread adoption of EHR data for research and quality improvement. Materials and methods: We have created ROMOP: an R package for direct interfacing with EHR data in the OMOP CDM format. Results: ROMOP streamlines typical EHR-related data processes. Its functions include exploration of data types, extraction and summarization of patient clinical and demographic data, and patient searches using any CDM vocabulary concept. Conclusion: ROMOP is freely available under the Massachusetts Institute of Technology (MIT) license and can be obtained from GitHub (http://github.com/BenGlicksberg/ROMOP). We detail instructions for setup and use in the Supplementary Materials. Additionally, we provide a public sandbox server containing synthesized clinical data for users to explore OMOP data and ROMOP (http://romop.ucsf.edu).",
                "authors": [
                    {
                        "name": "Glicksberg B.S."
                    },
                    {
                        "name": "Oskotsky B."
                    },
                    {
                        "name": "Giangreco N."
                    },
                    {
                        "name": "Thangaraj P.M."
                    },
                    {
                        "name": "Rudrapatna V."
                    },
                    {
                        "name": "Datta D."
                    },
                    {
                        "name": "Frazier R."
                    },
                    {
                        "name": "Lee N."
                    },
                    {
                        "name": "Larsen R."
                    },
                    {
                        "name": "Tatonetti N.P."
                    },
                    {
                        "name": "Butte A.J."
                    }
                ],
                "citationCount": 3,
                "date": "2019-01-04T00:00:00Z",
                "journal": "JAMIA Open",
                "title": "ROMOP: A light-weight R package for interfacing with OMOP-formatted electronic health record data"
            },
            "pmcid": "PMC6800657",
            "pmid": "31633087"
        }
    ],
    "topic": [
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        }
    ],
    "validated": 1
}