{
    "additionDate": "2018-09-03T08:42:53Z",
    "biotoolsCURIE": "biotools:slimscape",
    "biotoolsID": "slimscape",
    "collectionID": [
        "Cytoscape"
    ],
    "credit": [
        {
            "email": "slimscape.cytoscape@gmail.com",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "Emily Olorin",
            "orcidid": "http://orcid.org/0000-0003-0913-7487",
            "typeEntity": "Person",
            "typeRole": [
                "Contributor"
            ]
        }
    ],
    "description": "Perform short linear motif analyses of protein interaction networks by integrating motif discovery and search tools in a network visualization environment. This aims to aid in the discovery of novel short linear motifs, as well as visualisation of the distribution of known motifs.",
    "documentation": [
        {
            "type": [
                "Training material"
            ],
            "url": "https://github.com/passeridae/SLiMscape/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence motif discovery",
                    "uri": "http://edamontology.org/operation_0238"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                }
            ]
        }
    ],
    "homepage": "http://apps.cytoscape.org/apps/slimscape",
    "language": [
        "Java"
    ],
    "lastUpdate": "2019-02-16T14:50:22Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/slimsuite/SLiMScape"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "http://apps.cytoscape.org/apps/slimscape"
        }
    ],
    "name": "SLiMScape 3",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.12688/F1000RESEARCH.6773.1",
            "metadata": {
                "abstract": "© 2015 Olorin E et al.Short linear motifs (SLiMs) are small protein sequence patterns that mediate a large number of critical protein-protein interactions, involved in processes such as complex formation, signal transduction, localisation and stabilisation. SLiMs show rapid evolutionary dynamics and are frequently the targets of molecular mimicry by pathogens. Identifying enriched sequence patterns due to convergent evolution in non-homologous proteins has proven to be a successful strategy for computational SLiM prediction. Tools of the SLiMSuite package use this strategy, using a statistical model to identify SLiM enrichment based on the evolutionary relationships, amino acid composition and predicted disorder of the input proteins. The quality of input data is critical for successful SLiM prediction. Cytoscape provides a user-friendly, interactive environment to explore interaction networks and select proteins based on common features, such as shared interaction partners. SLiMScape embeds tools of the SLiMSuite package for de novo SLiM discovery (SLiMFinder and QSLiMFinder) and identifying occurrences/enrichment of known SLiMs (SLiMProb) within this interactive framework. SLiMScape makes it easier to (1) generate high quality hypothesis-driven datasets for these tools, and (2) visualise predicted SLiM occurrences within the context of the network. To generate new predictions, users can select nodes from a protein network or provide a set of Uniprot identifiers. SLiMProb also requires additional query motif input. Jobs are then run remotely on the SLiMSuite server ( http://rest.slimsuite.unsw.edu.au) for subsequent retrieval and visualisation. SLiMScape can also be used to retrieve and visualise results from jobs run directly on the server. SLiMScape and SLiMSuite are open source and freely available via GitHub under GNU licenses.",
                "authors": [
                    {
                        "name": "Edwards R.J."
                    },
                    {
                        "name": "Olorin E."
                    },
                    {
                        "name": "O'Brien K.T."
                    },
                    {
                        "name": "Palopoli N."
                    },
                    {
                        "name": "Perez-Bercoff"
                    },
                    {
                        "name": "Shields D.C."
                    }
                ],
                "citationCount": 1,
                "date": "2015-01-01T00:00:00Z",
                "journal": "F1000Research",
                "title": "SLiMScape 3.x: A Cytoscape 3 app for discovery of Short Linear Motifs in protein interaction networks"
            },
            "pmcid": "PMC4670012",
            "pmid": "26674271",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Plug-in"
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Protein targeting and localisation",
            "uri": "http://edamontology.org/topic_0140"
        }
    ],
    "validated": 1,
    "version": [
        "3.0.1"
    ]
}