
{
    "credit": [
        {
            "email": "hbshen@sjtu.edu.cn",
            "name": "Hong-Bin",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.csbio.sjtu.edu.cn/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://www.csbio.sjtu.edu.cn/bioinf/LabCaS/Readme.htm"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid feature detection",
                    "uri": "http://edamontology.org/operation_0415"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Nucleic acids",
                "uri": "http://edamontology.org/topic_0077"
            },
            {
                "term": "Machine learning",
                "uri": "http://edamontology.org/topic_3474"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/labcas-prediction-of-the-calpain-substrate-cleavage-sites.html"
        }
    ],
    "publication": [
        {
            "abstract": "The calpain family of Ca2+-dependent cysteine proteases plays a vital role in many important biological processes which is closely related with a variety of pathological states. Activated calpains selectively cleave relevant substrates at specific cleavage sites, yielding multiple fragments that can have different functions from the intact substrate protein. Until now, our knowledge about the calpain functions and their substrate cleavage mechanisms are limited because the experimental determination and validation on calpain binding are usually laborious and expensive. In this work, we aim to develop a new computational approach (LabCaS) for accurate prediction of the calpain substrate cleavage sites from amino acid sequences. To overcome the imbalance of negative and positive samples in the machine-learning training which have been suffered by most of the former approaches when splitting sequences into short peptides, we designed a conditional random field algorithm that can label the potential cleavage sites directly from the entire sequences. By integrating the multiple amino acid features and those derived from sequences, LabCaS achieves an accurate recognition of the cleave sites for most calpain proteins. In a jackknife test on a set of 129 benchmark proteins, LabCaS generates an AUC score 0.862. The LabCaS program is freely available at: http://www.csbio.sjtu.edu.cn/bioinf/LabCaS. © 2012 Wiley Periodicals, Inc.",
            "authors": [
                "Fan Y.-X.",
                "Zhang Y.",
                "Shen H.-B."
            ],
            "cit_count": 9,
            "journal": "Proteins: Structure, Function and Bioinformatics",
            "pmid": "23180633",
            "title": "LabCaS: Labeling calpain substrate cleavage sites from amino acid sequence using conditional random fields",
            "year": "2013-04-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:labcas",
        "biotoolsID": "labcas",
        "description": "New computational approach for accurate prediction of the calpain substrate cleavage sites from amino acid sequences.",
        "homepage": "http://www.csbio.sjtu.edu.cn/bioinf/LabCaS/",
        "name": "LabCaS"
    }
}