{
    "additionDate": "2016-06-27T16:11:14Z",
    "biotoolsCURIE": "biotools:gennon-h",
    "biotoolsID": "gennon-h",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "crg.eu",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "malapoczta@gmail.com",
            "name": "Anna  Kedzierska",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Software designed to generate multiple sequence alignments of DNA evolving on any phylogenetic tree.",
    "download": [
        {
            "type": "Source code",
            "url": "http://genome.crg.es/phylo_mod/gennonhom/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Phylogenetic tree",
                        "uri": "http://edamontology.org/data_0872"
                    },
                    "format": [
                        {
                            "term": "newick",
                            "uri": "http://edamontology.org/format_1910"
                        }
                    ]
                }
            ],
            "note": "Continuous-time evolutionary models given by an instantaneous rate matrix (usually common across the entire tree), admit a given formula that relates this rate matrix to the substitution matrices. In a more general case of the discrete-time models (JC69*, K81*, K80*, SSM and GMM) it is not a trivial task to generate a substitution matrix corresponding to a given branch length. The task boils down to obtaining a stochastic matrix with a given determinant and was solved for the most well-known discrete-time models in \"Generating Markov evolutionary matrices for a given branch length\" by Marta Casanellas and Anna M. Kedzierska Linear Algebra and its Applications (2013), 438, 2484-2499. We based the algorithm on the findings presented in the above work and extended it to generating ''biologically relevant'' and identifiable the substitution matrices.",
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Sequence alignment (nucleic acid)",
                        "uri": "http://edamontology.org/data_1383"
                    },
                    "format": [
                        {
                            "term": "Alignment format",
                            "uri": "http://edamontology.org/format_1921"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://genome.crg.es/cgi-bin/phylo_mod_sel/AlgGenNonH.pl",
    "lastUpdate": "2019-01-15T02:50:52Z",
    "license": "GPL-3.0",
    "name": "GenNon-h",
    "owner": "francisco.camara@crg.eu",
    "publication": [
        {
            "doi": "10.1186/1471-2105-13-216",
            "metadata": {
                "abstract": "Background: A number of software packages are available to generate DNA multiple sequence alignments (MSAs) evolved under continuous-time Markov processes on phylogenetic trees. On the other hand, methods of simulating the DNA MSA directly from the transition matrices do not exist. Moreover, existing software restricts to the time-reversible models and it is not optimized to generate nonhomogeneous data (i.e. placing distinct substitution rates at different lineages).Results: We present the first package designed to generate MSAs evolving under discrete-time Markov processes on phylogenetic trees, directly from probability substitution matrices. Based on the input model and a phylogenetic tree in the Newick format (with branch lengths measured as the expected number of substitutions per site), the algorithm produces DNA alignments of desired length. GenNon-h is publicly available for download.Conclusion: The software presented here is an efficient tool to generate DNA MSAs on a given phylogenetic tree. GenNon-h provides the user with the nonstationary or nonhomogeneous phylogenetic data that is well suited for testing complex biological hypotheses, exploring the limits of the reconstruction algorithms and their robustness to such models. © 2012 Kedzierska and Casanellas; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Kedzierska A.M."
                    },
                    {
                        "name": "Casanellas M."
                    }
                ],
                "citationCount": 3,
                "date": "2012-08-28T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "GenNon-h: Generating multiple sequence alignments on nonhomogeneous phylogenetic trees"
            },
            "pmcid": "PMC3532078",
            "pmid": "22928840",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}