{
    "additionDate": "2020-01-14T09:45:02Z",
    "biotoolsCURIE": "biotools:vert_71",
    "biotoolsID": "vert_71",
    "confidence_flag": "tool",
    "description": "Expression analysis of LTR-derived miR-1269a and target gene, KSR2 in Sebastes schlegelii.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                }
            ]
        }
    ],
    "homepage": "http://www.targetscan.org/vert_71/",
    "lastUpdate": "2021-01-16T17:58:46Z",
    "name": "vert_71",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/S13258-019-00880-0",
            "metadata": {
                "abstract": "© 2019, The Genetics Society of Korea.Background: Sebastes schlegelii are an important species of fish found in the coastal areas of the Korea with significant commercial importance. Most studies thus far have been primarily focused on environmental factors; behavioural patterns, aquaculture, diseases and limited genetic studies with little to none related to either microRNAs (miRNAs) or transposable elements (TE). Objectives: In order to understand biological roles of TE-derived miR-1269a, we examined expression pattern for miR-1269a and its target gene, KSR2, in various tissues of Sebastes schlegelii. Also, we performed luciferase reporter assay in HINAE cells. Methods: UCSC Genome Browser (https://genome.ucsc.edu/) was used to examine which TE is associated with miR-1269a. For the target genes for miR-1269a, the target genes associated with the miRNA were identified using miRDB (http://www.mirdb.org/) and TargetScan 7.1 (http://www.targetscan.org/vert_71/). A two-step miRNA kit, HB miR Multi Assay Kit™ System. I was used for the analysis of TE-derived miRNA expression patterns. The 3′UTR of KSR2 gene was cloned into the psiCHECK-2 vector. Subsequently co-transfected with miR-1269a mimics to HINAE cells for luciferase reporter assay. Results: MiR-1269a was found to be derived from LTR retrotransposon, MLT2B. LTR-derived miR-1269a was highly expressed in the muscle, liver and gonad tissues of Sebastes schlegelii, but KSR2 revealed high expression in the brain. Co-transfection of KSR2 and miR-1269a mimic to HINAE cells showed high activity of miR-1269a in relation to KSR2. Conclusion: LTR-derived miR-1269a showed enhancer activity with relation to KSR2 in Sebastes schlegelii. The data may be used as a foundation for further investigation regarding correlation of miRNA and target genes in addition to other functional studies of biological significance in Sebastes schlegelii.",
                "authors": [
                    {
                        "name": "Im J."
                    },
                    {
                        "name": "Kim W.R."
                    },
                    {
                        "name": "Lee H.-E."
                    },
                    {
                        "name": "Kim A."
                    },
                    {
                        "name": "Kim D.-H."
                    },
                    {
                        "name": "Choi Y.H."
                    },
                    {
                        "name": "Cha H.-J."
                    },
                    {
                        "name": "Kim S."
                    },
                    {
                        "name": "Kim H.-S."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Genes and Genomics",
                "title": "Expression analysis of LTR-derived miR-1269a and target gene, KSR2 in Sebastes schlegelii"
            },
            "pmid": "31721105"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        }
    ],
    "validated": 1
}