{
    "additionDate": "2020-01-14T09:24:24Z",
    "biotoolsCURIE": "biotools:DeLinker",
    "biotoolsID": "DeLinker",
    "confidence_flag": "tool",
    "description": "Deep Generative Models for 3D Compound Design.\n\nThis repository contains our implementation of Deep Generative Models for 3D Compound Design (DeLinker).\n\nWe provide two settings of DeLinker. The first setting generates linkers with the same number of atoms as the reference molecule. The second setting generates linkers with a specified number of atoms",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "homepage": "https://github.com/oxpig/DeLinker",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-20T12:18:24Z",
    "name": "DeLinker",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/830497"
        },
        {
            "doi": "10.1021/acs.jcim.9b01120",
            "metadata": {
                "abstract": "Copyright © 2020 American Chemical Society.Rational compound design remains a challenging problem for both computational methods and medicinal chemists. Computational generative methods have begun to show promising results for the design problem. However, they have not yet used the power of three-dimensional (3D) structural information. We have developed a novel graph-based deep generative model that combines state-of-the-art machine learning techniques with structural knowledge. Our method (\"DeLinker\") takes two fragments or partial structures and designs a molecule incorporating both. The generation process is protein-context-dependent, utilizing the relative distance and orientation between the partial structures. This 3D information is vital to successful compound design, and we demonstrate its impact on the generation process and the limitations of omitting such information. In a large-scale evaluation, DeLinker designed 60% more molecules with high 3D similarity to the original molecule than a database baseline. When considering the more relevant problem of longer linkers with at least five atoms, the outperformance increased to 200%. We demonstrate the effectiveness and applicability of this approach on a diverse range of design problems: fragment linking, scaffold hopping, and proteolysis targeting chimera (PROTAC) design. As far as we are aware, this is the first molecular generative model to incorporate 3D structural information directly in the design process. The code is available at http://github.com/oxpig/DeLinker.",
                "authors": [
                    {
                        "name": "Imrie F."
                    },
                    {
                        "name": "Bradley A.R."
                    },
                    {
                        "name": "Van Der Schaar M."
                    },
                    {
                        "name": "Deane C.M."
                    }
                ],
                "citationCount": 15,
                "date": "2020-04-27T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "Deep Generative Models for 3D Linker Design"
            },
            "pmcid": "PMC7189367",
            "pmid": "32195587"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        }
    ],
    "validated": 1
}