{
    "additionDate": "2020-01-14T19:42:33Z",
    "biotoolsCURIE": "biotools:SEQdata-BEACON",
    "biotoolsID": "SEQdata-BEACON",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "huangjin@genomics.cn",
            "name": "Jin Huang",
            "typeEntity": "Person"
        },
        {
            "email": "tianzhijian@genomics.cn",
            "name": "Zhijian Tian",
            "typeEntity": "Person"
        }
    ],
    "description": "SEQdata-BEACON is a comprehensive database of sequencing performance and statistical tools for performance evaluation and yield simulation in BGISEQ-500.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://seqbeacon.genomics.cn/",
    "lastUpdate": "2021-01-16T13:28:01Z",
    "name": "SEQdata-BEACON",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S13040-019-0209-9",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: The sequencing platform BGISEQ-500 is based on DNBSEQ technology and provides high throughput with low costs. This sequencer has been widely used in various areas of scientific and clinical research. A better understanding of the sequencing process and performance of this system is essential for stabilizing the sequencing process, accurately interpreting sequencing results and efficiently solving sequencing problems. To address these concerns, a comprehensive database, SEQdata-BEACON, was constructed to accumulate the run performance data in BGISEQ-500. Results: A total of 60 BGISEQ-500 instruments in the BGI-Wuhan lab were used to collect sequencing performance data. Lanes in paired-end 100 (PE100) sequencing using 10 bp barcode were chosen, and each lane was assigned a unique entry number as its identification number (ID). From November 2018 to April 2019, 2236 entries were recorded in the database containing 65 metrics about sample, yield, quality, machine state and supplies information. Using a correlation matrix, 52 numerical metrics were clustered into three groups signifying yield-quality, machine state and sequencing calibration. The distributions of the metrics also delivered information about patterns and rendered clues for further explanation or analysis of the sequencing process. Using the data of a total of 200 cycles, a linear regression model well simulated the final outputs. Moreover, the predicted final yield could be provided in the 15th cycle of the early stage of sequencing, and the corresponding R2 of the 200th and 15th cycle models were 0.97 and 0.81, respectively. The model was run with the test sets obtained from May 2019 to predict the yield, which resulted in an R2 of 0.96. These results indicate that our simulation model was reliable and effective. Conclusions: Data sources, statistical findings and application tools provide a constantly updated reference for BGISEQ-500 users to comprehensively understand DNBSEQ technology, solve sequencing problems and optimize run performance.",
                "authors": [
                    {
                        "name": "Chen L."
                    },
                    {
                        "name": "Huang B."
                    },
                    {
                        "name": "Huang J."
                    },
                    {
                        "name": "Liu C."
                    },
                    {
                        "name": "Liu L."
                    },
                    {
                        "name": "Lu A."
                    },
                    {
                        "name": "Luo B."
                    },
                    {
                        "name": "Tian Z."
                    },
                    {
                        "name": "Zhou R."
                    },
                    {
                        "name": "Zhou Y."
                    }
                ],
                "citationCount": 6,
                "date": "2019-11-15T00:00:00Z",
                "journal": "BioData Mining",
                "title": "SEQdata-BEACON: A comprehensive database of sequencing performance and statistical tools for performance evaluation and yield simulation in BGISEQ-500"
            },
            "pmcid": "PMC6857306",
            "pmid": "31807141"
        }
    ],
    "topic": [
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
