{
    "additionDate": "2021-11-01T10:42:29.646058Z",
    "biotoolsCURIE": "biotools:paramol",
    "biotoolsID": "paramol",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "c.skylaris@soton.ac.uk",
            "name": "Chris-Kriton Skylaris",
            "orcidid": "https://orcid.org/0000-0003-0258-3433",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "j.w.essex@soton.ac.uk",
            "name": "Jonathan W. Essex",
            "orcidid": "https://orcid.org/0000-0003-2639-2746",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "ParaMol is a package for automatic parameterization of molecular mechanics force fields. ParaMol is a Python library that aims to ease the process of force field parametrization of molecules.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://paramol.readthedocs.io"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Forcefield parameterisation",
                    "uri": "http://edamontology.org/operation_3893"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                }
            ]
        }
    ],
    "homepage": "https://github.com/JMorado/ParaMol",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-11-01T10:42:29.648407Z",
    "license": "MIT",
    "name": "ParaMol",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.0C01444",
            "metadata": {
                "abstract": "© 2021 American Chemical Society.The ensemble of structures generated by molecular mechanics (MM) simulations is determined by the functional form of the force field employed and its parameterization. For a given functional form, the quality of the parameterization is crucial and will determine how accurately we can compute observable properties from simulations. While accurate force field parameterizations are available for biomolecules, such as proteins or DNA, the parameterization of new molecules, such as drug candidates, is particularly challenging as these may involve functional groups and interactions for which accurate parameters may not be available. Here, in an effort to address this problem, we present ParaMol, a Python package that has a special focus on the parameterization of bonded and nonbonded terms of druglike molecules by fitting to ab initio data. We demonstrate the software by deriving bonded terms' parameters of three widely known drug molecules, viz. aspirin, caffeine, and a norfloxacin analogue, for which we show that, within the constraints of the functional form, the methodologies implemented in ParaMol are able to derive near-ideal parameters. Additionally, we illustrate the best practices to follow when employing specific parameterization routes. We also determine the sensitivity of different fitting data sets, such as relaxed dihedral scans and configurational ensembles, to the parameterization procedure, and discuss the features of the various weighting methods available to weight configurations. Owing to ParaMol's capabilities, we propose that this software can be introduced as a routine step in the protocol normally employed to parameterize druglike molecules for MM simulations.",
                "authors": [
                    {
                        "name": "Morado J."
                    },
                    {
                        "name": "Mortenson P.N."
                    },
                    {
                        "name": "Verdonk M.L."
                    },
                    {
                        "name": "Ward R.A."
                    },
                    {
                        "name": "Essex J.W."
                    },
                    {
                        "name": "Skylaris C.-K."
                    }
                ],
                "citationCount": 2,
                "date": "2021-04-26T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "ParaMol: A Package for Automatic Parameterization of Molecular Mechanics Force Fields"
            },
            "pmid": "33750120",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ]
}