{
    "additionDate": "2021-01-18T09:55:56Z",
    "biotoolsCURIE": "biotools:fastachar",
    "biotoolsID": "fastachar",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "lucas.merckelbach@hzg.de",
            "name": "Lucas M. Merckelbach",
            "typeEntity": "Person"
        }
    ],
    "description": "Fastachar is a graphical user interface that allows a simple comparison of two sets of DNA sequences. A typical working example is to have a selection of DNA sequences of different, but related species. These sequences are divided in a set A, which are thought to be a single taxon (species) and a set B, which is a collection of different taxa.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA barcoding",
                    "uri": "http://edamontology.org/operation_3200"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Sequence masking",
                    "uri": "http://edamontology.org/operation_0368"
                }
            ]
        }
    ],
    "homepage": "https://github.com/smerckel/FastaChar",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-10T20:12:51Z",
    "license": "GPL-3.0",
    "name": "Fastachar",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1111/1755-0998.13222",
            "metadata": {
                "abstract": "© 2020 The Authors. Molecular Ecology Resources published by John Wiley & Sons LtdOnly a fraction of species found so far has been described, particularly cryptic species uncovered by molecular data. The latter might require the use of molecular data for its diagnosis, but it is important to make use of the diagnostic content of the molecular data itself. The molecular character-based model provides discrete molecular diagnostic characters within DNA sequences that can be used in species descriptions fulfilling the requirement of most codes of nomenclature for a character-based description of species. Here, we introduce fastachar, a software developed to extract molecular diagnostic characters from one or several taxonomically informative DNA markers of a selected taxon compared with those of other taxa in a single step. The input data consist of a single file with aligned sequences in the fasta format, which can be created using alignment software such as mega or geneious. fastachar is an easy-to-use software with a graphical interface. Thus, the software does not require the user to have any knowledge of the underlying programming environment (Python). We hope this software, based on the method proposed by Jörger and Schrödl (Frontiers in Zoology, 10, 59, 2013) to describe cryptic species, will encourage researchers to take the final step in taxonomy: the formal description of species. We propose the use of this method and fastachar also for the inclusion of molecular data in the description of any species. fastachar is released as open-source software under GNU General Public License V3 and is freely available for all major operating systems from https://github.com/smerckel/FastaChar.",
                "authors": [
                    {
                        "name": "Borges L.M.S."
                    },
                    {
                        "name": "Merckelbach L.M."
                    }
                ],
                "citationCount": 1,
                "date": "2020-11-01T00:00:00Z",
                "journal": "Molecular Ecology Resources",
                "title": "Make every species count: fastachar software for rapid determination of molecular diagnostic characters to describe species"
            },
            "pmid": "32623815"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}
