
{
    "credit": [
        {
            "name": "SIB Swiss Institute of Bioinformatics",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "evgeny.zdobnov@unige.ch",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://mirmap.ezlab.org/#documentation"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Functional, regulatory and non-coding RNA",
                "uri": "http://edamontology.org/topic_0659"
            }
        ]
    },
    "publication": [
        {
            "abstract": "MicroRNAs, or miRNAs, post-transcriptionally repress the expression of protein-coding genes. The human genome encodes over 1000 miRNA genes that collectively target the majority of messenger RNAs (mRNAs). Base pairing of the so-called miRNA 'seed' region with mRNAs identifies many thousands of putative targets. Evaluating the strength of the resulting mRNA repression remains challenging, but is essential for a biologically informative ranking of potential miRNA targets. To address these challenges, predictors may use thermodynamic, evolutionary, probabilistic or sequence-based features. We developed an open-source software library, miRmap, which for the first time comprehensively covers all four approaches using 11 predictor features, 3 of which are novel. This allowed us to examine feature correlations and to compare their predictive power in an unbiased way using high-throughput experimental data from immunopurification, transcriptomics, proteomics and polysome fractionation experiments. Overall, target site accessibility appears to be the most predictive feature. Our novel feature based on PhyloP, which evaluates the significance of negative selection, is the best performing predictor in the evolutionary category. We combined all the features into an integrated model that almost doubles the predictive power of TargetScan. miRmap is freely available from http://cegg.unige.ch/mirmap. © 2012 The Author(s).",
            "authors": [
                "Vejnar C.E.",
                "Zdobnov E.M."
            ],
            "cit_count": 96,
            "doi": "10.1093/nar/gks901",
            "journal": "Nucleic Acids Research",
            "title": "MiRmap: Comprehensive prediction of microRNA target repression strength",
            "type": "Primary",
            "year": "2012-12-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:mirmap",
        "biotoolsID": "mirmap",
        "description": "Provides comprehensive prediction of microRNA target repression strength. MicroRNAs, or miRNAs, post-transcriptionally repress the expression of protein-coding genes. Our resource enables to search precompiled and predict online miRNA targets with miRmap.",
        "homepage": "http://mirmap.ezlab.org/",
        "name": "miRmap"
    }
}