{
    "additionDate": "2018-03-06T21:05:26Z",
    "biotoolsCURIE": "biotools:uninovo",
    "biotoolsID": "uninovo",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "email": "kwj@ucsd.edu",
            "name": "K. Jeong",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A universal tool for de novo peptide sequencing.",
    "download": [
        {
            "type": "Source code",
            "url": "http://proteomics.ucsd.edu/Software/UniNovo/UniNovo.20130520.zip"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peptide identification",
                    "uri": "http://edamontology.org/operation_3631"
                }
            ]
        }
    ],
    "homepage": "http://proteomics.ucsd.edu/Software/UniNovo/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2019-03-26T08:41:45Z",
    "name": "UniNovo",
    "owner": "jison",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btt338",
            "metadata": {
                "abstract": "Motivation: Mass spectrometry (MS) instruments and experimental protocols are rapidly advancing, but de novo peptide sequencing algorithms to analyze tandem mass (MS/MS) spectra are lagging behind. Although existing de novo sequencing tools perform well on certain types of spectra [e.g. Collision Induced Dissociation (CID) spectra of tryptic peptides], their performance often deteriorates on other types of spectra, such as Electron Transfer Dissociation (ETD), Higher-energy Collisional Dissociation (HCD) spectra or spectra of non-tryptic digests. Thus, rather than developing a new algorithm for each type of spectra, we develop a universal de novo sequencing algorithm called UniNovo that works well for all types of spectra or even for spectral pairs (e.g. CID/ETD spectral pairs). UniNovo uses an improved scoring function that captures the dependences between different ion types, where such dependencies are learned automatically using a modified offset frequency function. Results: The performance of UniNovo is compared with PepNovo+, PEAKS and pNovo using various types of spectra. The results show that the performance of UniNovo is superior to other tools for ETD spectra and superior or comparable with others for CID and HCD spectra. UniNovo also estimates the probability that each reported reconstruction is correct, using simple statistics that are readily obtained from a small training dataset. We demonstrate that the estimation is accurate for all tested types of spectra (including CID, HCD, ETD, CID/ETD and HCD/ETD spectra of trypsin, LysC or AspN digested peptides). Availability: UniNovo is implemented in JAVA and tested onWindows, Ubuntu and OS X machines. UniNovo is available at http://proteomics. ucsd.edu/Software/UniNovo.html along with the manual. Contact: kwj@ucsd.edu or ppevzner@ucsd.edu Supplementary information: Supplementary data are available at Bioinformatics online. © 2013 The Author 2013. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Jeong K."
                    },
                    {
                        "name": "Kim S."
                    },
                    {
                        "name": "Pevzner P.A."
                    }
                ],
                "citationCount": 46,
                "date": "2013-08-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "UniNovo: A universal tool for de novo peptide sequencing"
            },
            "pmcid": "PMC3722526",
            "pmid": "23766417",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ]
}