{
    "additionDate": "2017-08-03T18:37:57Z",
    "biotoolsCURIE": "biotools:cab-align",
    "biotoolsID": "cab-align",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "email": "shitakam@pharm.kitasato-u.ac.jp",
            "name": "Mayuko Takeda-Shitaka",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.pharm.kitasato-u.ac.jp/bmd/bmd/Welcome.html"
        }
    ],
    "description": "Contact area-based alignment is a flexible protein structure alignment method based on the residue-residue contact area.",
    "documentation": [
        {
            "type": "General",
            "url": "http://www.pharm.kitasato-u.ac.jp/bmd/bmd/Download_files/CABalign/index.html"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Structure alignment",
                    "uri": "http://edamontology.org/operation_0295"
                }
            ]
        }
    ],
    "homepage": "http://www.pharm.kitasato-u.ac.jp/bmd/bmd/Publications.html",
    "lastUpdate": "2019-03-26T08:12:58Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/cab-align-residue-residue-contact-area-based-alignment.html"
        }
    ],
    "name": "CAB-align",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2015 Terashi, Takeda-Shitaka. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited. Proteins are flexible, and this flexibility has an essential functional role. Flexibility can be observed in loop regions, rearrangements between secondary structure elements, and conformational changes between entire domains. However, most protein structure alignment methods treat protein structures as rigid bodies. Thus, these methods fail to identify the equivalences of residue pairs in regions with flexibility. In this study, we considered that the evolutionary relationship between proteins corresponds directly to the residue-residue physical contacts rather than the three-dimensional (3D) coordinates of proteins. Thus, we developed a new protein structure alignment method, contact area-based alignment (CABalign), which uses the residue-residue contact area to identify regions of similarity. The main purpose of CAB-align is to identify homologous relationships at the residue level between related protein structures. The CAB-align procedure comprises two main steps: First, a rigid-body alignment method based on local and global 3D structure superposition is employed to generate a sufficient number of initial alignments. Then, iterative dynamic programming is executed to find the optimal alignment. We evaluated the performance and advantages of CAB-align based on four main points: (1) agreement with the gold standard alignment, (2) alignment quality based on an evolutionary relationship without 3D coordinate superposition, (3) consistency of the multiple alignments, and (4) classification agreement with the gold standard classification. Comparisons of CAB-align with other state-ofthe-art protein structure alignment methods (TM-align, FATCAT, and DaliLite) using our benchmark dataset showed that CAB-align performed robustly in obtaining high-quality alignments and generating consistent multiple alignments with high coverage and accuracy rates, and it performed extremely well when discriminating between homologous and nonhomologous pairs of proteins in both single and multi-domain comparisons. The CAB-align software is freely available to academic users as stand-alone software at http://www.pharm. kitasato-u.ac.jp/bmd/bmd/Publications.html.",
                "authors": [
                    {
                        "name": "Terashi G."
                    },
                    {
                        "name": "Takeda-Shitaka M."
                    }
                ],
                "date": "2015-10-26T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "CAB-align: A flexible protein structure alignment method based on the residue-residue contact area"
            },
            "pmid": "26502070"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        }
    ]
}