{
    "accessibility": "Open access",
    "additionDate": "2022-10-10T21:42:31.889551Z",
    "biotoolsCURIE": "biotools:pdgpcs",
    "biotoolsID": "pdgpcs",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "guowf@zzu.edu.cn",
            "name": "Wei-Feng Guo",
            "typeEntity": "Person"
        },
        {
            "email": "zhangsw@nwpu.edu.cn",
            "name": "Shao-Wu Zhang",
            "typeEntity": "Person"
        },
        {
            "name": "Yan Li"
        },
        {
            "name": "Zhen-Nan Wang"
        }
    ],
    "description": "PDGPCS is a driver genes prediction method; PDGPCS uesd gene expression data, gene mutation data and pathway data to predict driver genes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Gene expression profile",
                        "uri": "http://edamontology.org/data_0928"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Gene regulatory network prediction",
                    "uri": "http://edamontology.org/operation_2437"
                }
            ]
        }
    ],
    "homepage": "https://github.com/NWPU-903PR/PDGPCS",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2022-10-10T21:42:31.892079Z",
    "license": "Not licensed",
    "name": "PDGPCS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S12859-022-04802-Y",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: Cancer is a heterogeneous disease in which tumor genes cooperate as well as adapt and evolve to the changing conditions for individual patients. It is a meaningful task to discover the personalized cancer driver genes that can provide diagnosis and target drug for individual patients. However, most of existing methods mainly ranks potential personalized cancer driver genes by considering the patient-specific nodes information on the gene/protein interaction network. These methods ignore the personalized edge weight information in gene interaction network, leading to false positive results. Results: In this work, we presented a novel algorithm (called PDGPCS) to predict the Personalized cancer Driver Genes based on the Prize-Collecting Steiner tree model by considering the personalized edge weight information. PDGPCS first constructs the personalized weighted gene interaction network by integrating the personalized gene expression data and prior known gene/protein interaction network knowledge. Then the gene mutation data and pathway data are integrated to quantify the impact of each mutant gene on every dysregulated pathway with the prize-collecting Steiner tree model. Finally, according to the mutant gene’s aggregated impact score on all dysregulated pathways, the mutant genes are ranked for prioritizing the personalized cancer driver genes. Experimental results on four TCGA cancer datasets show that PDGPCS has better performance than other personalized driver gene prediction methods. In addition, we verified that the personalized edge weight of gene interaction network can improve the prediction performance. Conclusions: PDGPCS can more accurately identify the personalized driver genes and takes a step further toward personalized medicine and treatment. The source code of PDGPCS can be freely downloaded from https://github.com/NWPU-903PR/PDGPCS.",
                "authors": [
                    {
                        "name": "Guo W.-F."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Wang Z.-N."
                    },
                    {
                        "name": "Zhang S.-W."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Prioritization of cancer driver gene with prize-collecting steiner tree by introducing an edge weighted strategy in the personalized gene interaction network"
            },
            "pmcid": "PMC9380343",
            "pmid": "35974311"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        }
    ]
}
