{
    "additionDate": "2021-11-29T09:35:22.578882Z",
    "biotoolsCURIE": "biotools:rdp5",
    "biotoolsID": "rdp5",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "darrenpatrickmartin@gmail.com",
            "name": "Darren P Martin",
            "orcidid": "https://orcid.org/0000-0002-8785-0870",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Recombination Detection Program (RDP) is a computer program for analyzing recombination in, and removing signals of recombination from, nucleotide sequence datasets.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://web.cbio.uct.ac.za/~darren/RDP4Manual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic inference",
                    "uri": "http://edamontology.org/operation_0323"
                },
                {
                    "term": "Recombination detection",
                    "uri": "http://edamontology.org/operation_0451"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://web.cbio.uct.ac.za/~darren/rdp.html",
    "lastUpdate": "2021-11-29T09:35:22.582276Z",
    "name": "RDP5",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/VE/VEAA087",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press.For the past 20 years, the recombination detection program (RDP) project has focused on the development of a fast, flexible, and easy to use Windows-based recombination analysis tool. Whereas previous versions of this tool have relied on considerable user-mediated verification of detected recombination events, the latest iteration, RDP5, is automated enough that it can be integrated within analysis pipelines and run without any user input. The main innovation enabling this degree of automation is the implementation of statistical tests to identify recombination signals that could be attributable to evolutionary processes other than recombination. The additional analysis time required for these tests has been offset by algorithmic improvements throughout the program such that, relative to RDP4, RDP5 will still run up to five times faster and be capable of analyzing alignments containing twice as many sequences (up to 5000) that are five times longer (up to 50 million sites). For users wanting to remove signals of recombination from their datasets before using them for downstream phylogenetics-based molecular evolution analyses, RDP5 can disassemble detected recombinant sequences into their constituent parts and output a variety of different recombination-free datasets in an array of different alignment formats. For users that are interested in exploring the recombination history of their datasets, all the manual verification, data management and data visualization components of RDP5 have been extensively updated to minimize the amount of time needed by users to individually verify and refine the program's interpretation of each of the individual recombination events that it detects.",
                "authors": [
                    {
                        "name": "Botha G."
                    },
                    {
                        "name": "Kelz Z."
                    },
                    {
                        "name": "Kumar V."
                    },
                    {
                        "name": "Martin D.P."
                    },
                    {
                        "name": "Maslamoney S."
                    },
                    {
                        "name": "Murrell B."
                    },
                    {
                        "name": "Roumagnac P."
                    },
                    {
                        "name": "Schwab T."
                    },
                    {
                        "name": "Varsani A."
                    }
                ],
                "citationCount": 15,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Virus Evolution",
                "title": "RDP5: A computer program for analyzing recombination in, and removing signals of recombination from, nucleotide sequence datasets"
            },
            "pmcid": "PMC8062008",
            "pmid": "33936774",
            "type": [
                "Primary"
            ]
        }
    ],
    "topic": [
        {
            "term": "DNA replication and recombination",
            "uri": "http://edamontology.org/topic_3127"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Virology",
            "uri": "http://edamontology.org/topic_0781"
        }
    ]
}
