
{
    "credit": [
        {
            "name": "csc.fi",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "chipster@csc.fi",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://chipster.csc.fi/manual/"
        }
    ],
    "function": [
        {
            "note": "Several interactive visualizations including a genome browser. Also Bioconductor visualizations are available.",
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "labels": {
        "cost": "Free of charge",
        "elixirNode": [
            "Finland"
        ],
        "elixirPlatform": [
            "Tools"
        ],
        "language": [
            "Java"
        ],
        "license": "GPL-3.0",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Desktop application",
            "Workbench"
        ],
        "topic": [
            {
                "term": "Bioinformatics",
                "uri": "http://edamontology.org/topic_0091"
            }
        ]
    },
    "link": [
        {
            "type": "Repository",
            "url": "http://chipster.github.io/chipster/"
        }
    ],
    "publication": [
        {
            "abstract": "Background: The growth of high-throughput technologies such as microarrays and next generation sequencing has been accompanied by active research in data analysis methodology, producing new analysis methods at a rapid pace. While most of the newly developed methods are freely available, their use requires substantial computational skills. In order to enable non-programming biologists to benefit from the method development in a timely manner, we have created the Chipster software.Results: Chipster (http://chipster.csc.fi/) brings a powerful collection of data analysis methods within the reach of bioscientists via its intuitive graphical user interface. Users can analyze and integrate different data types such as gene expression, miRNA and aCGH. The analysis functionality is complemented with rich interactive visualizations, allowing users to select datapoints and create new gene lists based on these selections. Importantly, users can save the performed analysis steps as reusable, automatic workflows, which can also be shared with other users. Being a versatile and easily extendable platform, Chipster can be used for microarray, proteomics and sequencing data. In this article we describe its comprehensive collection of analysis and visualization tools for microarray data using three case studies.Conclusions: Chipster is a user-friendly analysis software for high-throughput data. Its intuitive graphical user interface enables biologists to access a powerful collection of data analysis and integration tools, and to visualize data interactively. Users can collaborate by sharing analysis sessions and workflows. Chipster is open source, and the server installation package is freely available. © 2011 Kallio et al; licensee BioMed Central Ltd.",
            "authors": [
                "Kallio M.A.",
                "Tuimala J.T.",
                "Hupponen T.",
                "Klemela P.",
                "Gentile M.",
                "Scheinin I.",
                "Koski M.",
                "Kaki J.",
                "Korpelainen E.I."
            ],
            "cit_count": 143,
            "doi": "10.1186/1471-2164-12-507",
            "journal": "BMC Genomics",
            "title": "Chipster: User-friendly analysis software for microarray and other high-throughput data",
            "type": "Primary",
            "year": "2011-10-14"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:chipster",
        "biotoolsID": "chipster",
        "description": "Free, open source software for analyzing high-throughput data such as NGS. It is available as a ready-to-run virtual machine (VM) containing a large collection of up-to-date analysis tools and reference data, such as Ensembl genomes indexed for aligners. The tools can be used on command line, or via an intuitive client GUI.",
        "homepage": "http://chipster.csc.fi/",
        "name": "Chipster",
        "version": [
            "1"
        ]
    }
}