{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2021-01-18T10:34:37Z",
    "biotoolsCURIE": "biotools:eview",
    "biotoolsID": "eview",
    "confidence_flag": "tool",
    "description": "EView is an on-line platform for 3D electric field simulation in electroporation-based treatments using needle-shaped electrodes. EView provides an easy way to obtain approximate estimations of the electric field distribution for arbitrary electrode positions and orientations. EView has been developed with the aim of facilitating the understanding of how the electric field distribution depends on the geometry of the electrode setup and the applied voltage.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://eview.upf.edu",
    "lastUpdate": "2021-03-08T09:57:26Z",
    "name": "EView",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.CMPB.2020.105682",
            "metadata": {
                "abstract": "© 2020Background and objectives: Electroporation is the phenomenon by which cell membrane permeability to ions and macromolecules is increased when the cell is briefly exposed to high electric fields. In electroporation-based treatments, such exposure is typically performed by delivering high voltage pulses across needle electrodes in tissue. For a given tissue and pulsing protocol, an electric field magnitude threshold exists that must be overreached for treatment efficacy. However, it is hard to preoperatively infer the treatment volume because the electric field distribution intricately depends on the electrodes’ positioning and length, the applied voltage, and the electric conductivity of the treated tissues. For illustrating such dependencies, we have created EView (https://eview.upf.edu), a web platform that estimates the electric field distribution for arbitrary needle electrode locations and orientations and overlays it on 3D medical images. Methods: A client-server approach has been implemented to let the user set the electrode configuration easily on the web browser, whereas the simulation is computed on a dedicated server. By means of the finite element method, the electric field is solved in a 3D volume. For the sake of simplicity, only a homogeneous tissue is modeled, assuming the same properties for healthy and pathologic tissues. The non-linear dependence of tissue conductivity on the electric field due to the electroporation effect is modeled. The implemented model has been validated against a state of the art finite element solver, and the server has undergone a heavy load test to ensure reliability and to report execution times. Results: The electric field is rapidly computed for any electrode and tissue configuration, and alternative setups can be easily compared. The platform provides the same results as the state of the art finite element solver (Dice = 98.3 ± 0.4%). During the high load test, the server remained responsive. Simulations are computed in less than 2 min for simple cases consisting of two electrodes and take up to 40 min for complex scenarios consisting of 6 electrodes. Conclusions: With this free platform we provide expert and non-expert electroporation users a way to rapidly model the electric field distribution for arbitrary electrode configurations.",
                "authors": [
                    {
                        "name": "Perera-Bel E."
                    },
                    {
                        "name": "Yague C."
                    },
                    {
                        "name": "Mercadal B."
                    },
                    {
                        "name": "Ceresa M."
                    },
                    {
                        "name": "Beitel-White N."
                    },
                    {
                        "name": "Davalos R.V."
                    },
                    {
                        "name": "Ballester M.A.G."
                    },
                    {
                        "name": "Ivorra A."
                    }
                ],
                "citationCount": 1,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Computer Methods and Programs in Biomedicine",
                "title": "EView: An electric field visualization web platform for electroporation-based therapies"
            },
            "pmid": "32795723"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}