{
    "additionDate": "2020-01-14T09:22:11Z",
    "biotoolsCURIE": "biotools:InfiniumPurify-R",
    "biotoolsID": "InfiniumPurify-R",
    "confidence_flag": "tool",
    "description": "Detection of differentially methylated CpG sites between tumor samples with uneven tumor purities.\n\nR package for DNA methylation analysis.\n\nR package for DNA methylation analysis The proposition of cancer cells in a tumor sample, named as tumor purity, is an intrinsic factor of tumor samples and has potentially great influence in variety of analyses including differential methylation, subclonal deconvolution and subtype clustering. InfiniumPurify is an integrated R pa ckage for est imatin g and accoun ting for tum or puri ty based on DNA methylation Infinium 450 k array data. InfiniumPurify has three main functions getPurity, InfiniumDMC and InfiniumClust, which could infer tumor purity, differential methylation analysis and tumor sample c luster accounting for estimated or user-provided tumor purities, respectively. The InfiniumPurify package provides a comprehensive analysis of tumor purity in cancer methylation research.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Methylation analysis",
                    "uri": "http://edamontology.org/operation_3204"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Xiaoqizheng/InfiniumPurify",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-14T08:07:40Z",
    "name": "InfiniumPurify-R",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ885",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press.Motivation: Inference of differentially methylated (DM) CpG sites between two groups of tumor samples with different geno-or pheno-types is a critical step to uncover the epigenetic mechanism of tumorigenesis, and identify biomarkers for cancer subtyping. However, as a major source of confounding factor, uneven distributions of tumor purity between two groups of tumor samples will lead to biased discovery of DM sites if not properly accounted for. Results: We here propose InfiniumDM, a generalized least square model to adjust tumor purity effect for differential methylation analysis. Our method is applicable to a variety of experimental designs including with or without normal controls, different sources of normal tissue contaminations. We compared our method with conventional methods including minfi, limma and limma corrected by tumor purity using simulated datasets. Our method shows significantly better performance at different levels of differential methylation thresholds, sample sizes, mean purity deviations and so on. We also applied the proposed method to breast cancer samples from TCGA database to further evaluate its performance. Overall, both simulation and real data analyses demonstrate favorable performance over existing methods serving similar purpose.",
                "authors": [
                    {
                        "name": "Zhang W."
                    },
                    {
                        "name": "Li Z."
                    },
                    {
                        "name": "Wei N."
                    },
                    {
                        "name": "Wu H.-J."
                    },
                    {
                        "name": "Zheng X."
                    }
                ],
                "date": "2020-04-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Detection of differentially methylated CpG sites between tumor samples with uneven tumor purities"
            },
            "pmid": "31769783"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        }
    ],
    "validated": 1
}