
{
    "credit": [
        {
            "email": "mdy89@snu.ac.kr",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://epigenomics.snu.ac.kr/RDDpred/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://epigenomics.snu.ac.kr/RDDpred/images/RDDpred_PaperSummary.pdf"
        },
        {
            "type": "User manual",
            "url": "http://epigenomics.snu.ac.kr/RDDpred/manual.php"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "RNA-Seq analysis",
                    "uri": "http://edamontology.org/operation_3680"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "RNA-Seq",
                "uri": "http://edamontology.org/topic_3170"
            },
            {
                "term": "Structure prediction",
                "uri": "http://edamontology.org/topic_0082"
            },
            {
                "term": "Gene transcripts",
                "uri": "http://edamontology.org/topic_3512"
            },
            {
                "term": "Machine learning",
                "uri": "http://edamontology.org/topic_3474"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/rddpred-random-forest-rdd-classifier.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2015 Kim et al. Background: RNA-editing is an important post-transcriptional RNA sequence modification performed by two catalytic enzymes, \"ADAR\"(A-to-I) and \"APOBEC\"(C-to-U). By utilizing high-throughput sequencing technologies, the biological function of RNA-editing has been actively investigated. Currently, RNA-editing is considered to be a key regulator that controls various cellular functions, such as protein activity, alternative splicing pattern of mRNA, and substitution of miRNA targeting site. DARNED, a public RDD database, reported that there are more than 300-thousands RNA-editing sites detected in human genome(hg19). Moreover, multiple studies suggested that RNA-editing events occur in highly specific conditions. According to DARNED, 97.62 % of registered editing sites were detected in a single tissue or in a specific condition, which also supports that the RNA-editing events occur condition-specifically. Since RNA-seq can capture the whole landscape of transcriptome, RNA-seq is widely used for RDD prediction. However, significant amounts of false positives or artefacts can be generated when detecting RNA-editing from RNA-seq. Since it is difficult to perform experimental validation at the whole-transcriptome scale, there should be a powerful computational tool to distinguish true RNA-editing events from artefacts. Result: We developed RDDpred, a Random Forest RDD classifier. RDDpred reports potentially true RNA-editing events from RNA-seq data. RDDpred was tested with two publicly available RNA-editing datasets and successfully reproduced RDDs reported in the two studies (90 %, 95 %) while rejecting false-discoveries (NPV: 75 %, 84 %). Conclusion: RDDpred automatically compiles condition-specific training examples without experimental validations and then construct a RDD classifier. As far as we know, RDDpred is the very first machine-learning based automated pipeline for RDD prediction. We believe that RDDpred will be very useful and can contribute significantly to the study of condition-specific RNA-editing. RDDpred is available at http://biohealth.snu.ac.kr/software/RDDpred.",
            "authors": [
                "Kim M.-S.",
                "Hur B.",
                "Kim S."
            ],
            "cit_count": 7,
            "journal": "BMC Genomics",
            "pmid": "26817607",
            "title": "RDDpred: A condition-specific RNA-editing prediction model from RNA-seq data",
            "year": "2016-01-11"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:rddpred",
        "biotoolsID": "rddpred",
        "description": "This is a condition-specific RNA-editing prediction model from RNA-seq data.",
        "homepage": "http://epigenomics.snu.ac.kr/RDDpred/",
        "name": "RDDpred"
    }
}