{
    "additionDate": "2017-01-17T15:04:23Z",
    "biotoolsCURIE": "biotools:synapter",
    "biotoolsID": "synapter",
    "collectionID": [
        "Proteomics",
        "BioConductor"
    ],
    "credit": [
        {
            "email": "lg390@cam.ac.uk",
            "name": "Laurent Gatto",
            "orcidid": "http://orcid.org/0000-0002-1520-2268",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "mail@sebastiangibb.de",
            "name": "Sebastian Gibb",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "This package provides functionality to reanalyse label-free proteomics data acquired on a Synapt G2 mass spectrometer. One or several runs, possibly processed with additional ion mobility separation to increase identification accuracy can be combined to other quantitation files to maximise identification and quantitation accuracy.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/synapter.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/synapter_1.16.0.tar.gz"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Protein quantification",
                    "uri": "http://edamontology.org/operation_3630"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/synapter.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-03-26T08:40:40Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Mirror"
            ],
            "url": "http://lgatto.github.com/synapter/"
        }
    ],
    "name": "synapter",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1021/pr300775k",
            "metadata": {
                "abstract": "qTOF mass spectrometry and traveling wave ion mobility separation (TWIMS) hybrid instruments (q-TWIMS-TOF) have recently become commercially available. Ion mobility separation allows an additional dimension of precursor separation inside the instrument, without incurring an increase in instrument time. We comprehensively investigated the effects of TWIMS on data-independent acquisition on a Synapt G2 instrument. We observed that if fragmentation is performed post TWIMS, more accurate assignment of fragment ions to precursors is possible in data independent acquisition. This allows up to 60% higher proteome coverage and higher confidence of protein and peptide identifications. Moreover, the majority of peptides and proteins identified upon application of TWIMS span the lower intensity range of the proteome. It has also been demonstrated in several studies that employing IMS results in higher peak capacity of separation and consequently more accurate and precise quantitation of lower intensity precursor ions. We observe that employing TWIMS results in an attenuation of the detected ion current. We postulate that this effect is binary; sensitivity is reduced due to ion scattering during transfer into a high pressure \"IMS zone\", sensitivity is reduced due to the saturation of detector digitizer as a result of the IMS concentration effect. This latter effect limits the useful linear range of quantitation, compromising quantitation accuracy of high intensity peptides. We demonstrate that the signal loss from detector saturation and transmission loss can be deconvoluted by investigation of the peptide isotopic envelope. We discuss the origin and extent of signal loss and suggest methods to minimize these effects on q-TWIMS-TOF instrument in the light of different experimental designs and other IMS/MS platforms described previously. © 2013 American Chemical Society.",
                "authors": [
                    {
                        "name": "Shliaha P.V."
                    },
                    {
                        "name": "Bond N.J."
                    },
                    {
                        "name": "Gatto L."
                    },
                    {
                        "name": "Lilley K.S."
                    }
                ],
                "citationCount": 50,
                "date": "2013-07-01T00:00:00Z",
                "journal": "Journal of Proteome Research",
                "title": "Effects of traveling wave ion mobility separation on data independent acquisition in proteomics studies"
            },
            "pmid": "23514362",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ],
    "version": [
        "1.16.0"
    ]
}