{"credit":[{"email":"tsung@iis.sinica.edu.tw","name":"T.-Y. Sung","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://ms.iis.sinica.edu.tw/COmics/Software_MAGIC.html"}],"function":[{"operation":[{"term":"Peptide identification","uri":"http://edamontology.org/operation_3631"}]}],"labels":{"collectionID":["Proteomics"],"operatingSystem":["Windows","Mac"],"toolType":["Desktop application"],"topic":[{"term":"Proteins","uri":"http://edamontology.org/topic_0078"},{"term":"Proteomics experiment","uri":"http://edamontology.org/topic_3520"},{"term":"Structural biology","uri":"http://edamontology.org/topic_1317"}]},"publication":[{"abstract":"© 2015 American Chemical Society. Glycosylation is a highly complex modification influencing the functions and activities of proteins. Interpretation of intact glycopeptide spectra is crucial but challenging. In this paper, we present a mass spectrometry-based automated glycopeptide identification platform (MAGIC) to identify peptide sequences and glycan compositions directly from intact N-linked glycopeptide collision-induced-dissociation spectra. The identification of the Y1 (peptideY0 + GlcNAc) ion is critical for the correct analysis of unknown glycoproteins, especially without prior knowledge of the proteins and glycans present in the sample. To ensure accurate Y1-ion assignment, we propose a novel algorithm called Trident that detects a triplet pattern corresponding to [Y0, Y1, Y2] or [Y0-NH<inf>3</inf>, Y0, Y1] from the fragmentation of the common trimannosyl core of N-linked glycopeptides. To facilitate the subsequent peptide sequence identification by common database search engines, MAGIC generates in silico spectra by overwriting the original precursor with the naked peptide m/z and removing all of the glycan-related ions. Finally, MAGIC computes the glycan compositions and ranks them. For the model glycoprotein horseradish peroxidase (HRP) and a 5-glycoprotein mixture, a 2- to 31-fold increase in the relative intensities of the peptide fragments was achieved, which led to the identification of 7 tryptic glycopeptides from HRP and 16 glycopeptides from the mixture via Mascot. In the HeLa cell proteome data set, MAGIC processed over a thousand MS<sup>2</sup> spectra in 3 min on a PC and reported 36 glycopeptides from 26 glycoproteins. Finally, a remarkable false discovery rate of 0 was achieved on the N-glycosylation-free Escherichia coli data set. MAGIC is available at http://ms.iis.sinica.edu.tw/COmics/Software-MAGIC.html.","authors":["Lynn K.-S.","Chen C.-C.","Lih T.M.","Cheng C.-W.","Su W.-C.","Chang C.-H.","Cheng C.-Y.","Hsu W.-L.","Chen Y.-J.","Sung T.-Y."],"cit_count":31,"doi":"10.1021/AC5044829","journal":"Analytical Chemistry","pmid":"25629585","title":"MAGIC: An automated N-linked glycoprotein identification tool using a y1-ion pattern matching algorithm and in silico MS<sup>2</sup> approach","year":"2015-02-17"}],"summary":{"biotoolsCURIE":"biotools:magic_ms","biotoolsID":"magic_ms","description":"Automated N-Linked Glycoprotein Identification Tool Using a Y1-Ion Pattern Matching Algorithm and in Silico MS2 Approach.","homepage":"http://ms.iis.sinica.edu.tw/COmics/Software_MAGIC.html","name":"MAGIC"}}