{
    "additionDate": "2017-03-25T17:08:11Z",
    "biotoolsCURIE": "biotools:gwas3d",
    "biotoolsID": "gwas3d",
    "credit": [
        {
            "email": "junwen@uw.edu",
            "name": "GWAS3 Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "mulin0424.li@gmail.com",
            "name": "GWAS3 Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "GWAS3D web server computes the probability of genetics variants affecting regulatory pathways and underlying disease/trait associations by integrating chromatin state, functional genomics, sequence motif, and conservation information when given GWAS data or variant list. GWAS3D also provides comprehensive annotations and visualizations to help users interpreting the results.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://jjwanglab.org/gwas3d"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "homepage": "http://jjwanglab.org/gwas3d",
    "lastUpdate": "2018-12-11T19:09:56Z",
    "name": "GWAS3D",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Interpreting the genetic variants located in the regulatory regions, such as enhancers and promoters, is an indispensable step to understand molecular mechanism of complex traits. Recent studies show that genetic variants detected by genome-wide association study (GWAS) are significantly enriched in the regulatory regions. Therefore, detecting, annotating and prioritizing of genetic variants affecting gene regulation are critical to our understanding of genotype-phenotype relationships. Here, we developed a web server GWAS3D to systematically analyze the genetic variants that could affect regulatory elements, by integrating annotations from cell type-specific chromatin states, epigenetic modifications, sequence motifs and cross-species conservation. The regulatory elements are inferred from the genome-wide chromosome interaction data, chromatin marks in 16 different cell types and 73 regulatory factors motifs from the Encyclopedia of DNA Element project. Furthermore, we used these function elements, as well as risk haplotype, binding affinity, conservation and P-values reported from the original GWAS to reprioritize the genetic variants. Using studies from low-density lipoprotein cholesterol, we demonstrated that our reprioritizing approach was effective and cell type specific. In conclusion, GWAS3D provides a comprehensive annotation and visualization tool to help users interpreting their results. The web server is freely available at http://jjwanglab.org/gwas3d.",
                "authors": [
                    {
                        "name": "Li M.J."
                    },
                    {
                        "name": "Wang L.Y."
                    },
                    {
                        "name": "Xia Z."
                    },
                    {
                        "name": "Sham P.C."
                    },
                    {
                        "name": "Wang J."
                    }
                ],
                "citationCount": 73,
                "date": "2013-01-01T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "GWAS3D: Detecting human regulatory variants by integrative analysis of genome-wide associations, chromosome interactions and histone modifications."
            },
            "pmid": "23723249"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}