{
    "additionDate": "2017-08-03T18:37:08Z",
    "biotoolsCURIE": "biotools:braker1",
    "biotoolsID": "braker1",
    "credit": [
        {
            "email": "bioinformatik.greifswald@gmail.com",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.gatech.edu/"
        }
    ],
    "description": "Pipeline for unsupervised RNA-Seq-based genome annotation with GeneMark-ET and AUGUSTUS.",
    "documentation": [
        {
            "type": "General",
            "url": "http://bioinf.uni-greifswald.de/bioinf/braker/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                }
            ]
        }
    ],
    "homepage": "http://bioinf.uni-greifswald.de/bioinf/braker/index.html",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/braker1-rna-seq-based-eukaryotic-genome-annotation-pipeline.html"
        }
    ],
    "name": "BRAKER1",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© The Author 2015. Published by Oxford University Press. Motivation: Gene finding in eukaryotic genomes is notoriously difficult to automate. The task is to design a work flow with a minimal set of tools that would reach state-of-the-art performance across a wide range of species. GeneMark-ET is a gene prediction tool that incorporates RNA-Seq data into unsupervised training and subsequently generates ab initio gene predictions. AUGUSTUS is a gene finder that usually requires supervised training and uses information from RNA-Seq reads in the prediction step. Complementary strengths of GeneMark-ET and AUGUSTUS provided motivation for designing a new combined tool for automatic gene prediction. Results: We present BRAKER1, a pipeline for unsupervised RNA-Seq-based genome annotation that combines the advantages of GeneMark-ET and AUGUSTUS. As input, BRAKER1 requires a genome assembly file and a file in bam-format with spliced alignments of RNA-Seq reads to the genome. First, GeneMark-ET performs iterative training and generates initial gene structures. Second, AUGUSTUS uses predicted genes for training and then integrates RNA-Seq read information into final gene predictions. In our experiments, we observed that BRAKER1 was more accurate than MAKER2 when it is using RNA-Seq as sole source for training and prediction. BRAKER1 does not require pre-trained parameters or a separate expert-prepared training step.",
                "authors": [
                    {
                        "name": "Hoff K.J."
                    },
                    {
                        "name": "Lange S."
                    },
                    {
                        "name": "Lomsadze A."
                    },
                    {
                        "name": "Borodovsky M."
                    },
                    {
                        "name": "Stanke M."
                    }
                ],
                "citationCount": 113,
                "date": "2015-05-08T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "BRAKER1: Unsupervised RNA-Seq-based genome annotation with GeneMark-ET and AUGUSTUS"
            },
            "pmid": "26559507"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}