{
    "additionDate": "2024-04-19T08:15:18.576654Z",
    "biotoolsCURIE": "biotools:itaxalogue",
    "biotoolsID": "itaxalogue",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "N.Noll@leibniz-lib.de",
            "name": "Niklas W. Noll",
            "typeEntity": "Person"
        }
    ],
    "description": "Toolkit to create comprehensive CO1 reference databases.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA barcoding",
                    "uri": "http://edamontology.org/operation_3200"
                },
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                }
            ]
        }
    ],
    "homepage": "https://github.com/nwnoll/taxalogue",
    "language": [
        "Ruby"
    ],
    "lastUpdate": "2024-04-19T08:15:18.578562Z",
    "license": "GPL-3.0",
    "name": "itaxalogue",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.7717/PEERJ.16253",
            "metadata": {
                "abstract": "Background. Taxonomic identification through DNA barcodes gained considerable traction through the invention of next-generation sequencing and DNA metabarcoding. Metabarcoding allows for the simultaneous identification of thousands of organisms from bulk samples with high taxonomic resolution. However, reliable identifications can only be achieved with comprehensive and curated reference databases. Therefore, custom reference databases are often created to meet the needs of specific research questions. Due to taxonomic inconsistencies, formatting issues, and technical difficulties, building a custom reference database requires tremendous effort. Here, we present taxalogue, an easy-to-use software for creating comprehensive and customized reference databases that provide clean and taxonomically harmonized records. In combination with extensive geographical filtering options, taxalogue opens up new possibilities for generating and testing evolutionary hypotheses. Methods. taxalogue collects DNA sequences from several online sources and combines them into a reference database. Taxonomic incongruencies between the different data sources can be harmonized according to available taxonomies. Dereplication and various filtering options are available regarding sequence quality or metadata information. taxalogue is implemented in the open-source Ruby programming language, and the source code is available at https://github.com/nwnoll/taxalogue. We benchmark four reference databases by sequence identity against eight queries from different localities and trapping devices. Subsamples from each reference database were used to compare how well another one is covered. Results. taxalogue produces reference databases with the best coverage at high identities for most tested queries, enabling more accurate, reliable predictions with higher certainty than the other benchmarked reference databases. Additionally, the performance of taxalogue is more consistent while providing good coverage for a variety of habitats, regions, and sampling methods. taxalogue simplifies the creation of reference databases and makes the process reproducible and transparent. Multiple available output formats for commonly used downstream applications facilitate the easy adoption of taxalogue in many different software pipelines. The resulting reference databases improve the taxonomic classification accuracy through high coverage of the query sequences at high identities.",
                "authors": [
                    {
                        "name": "Noll N.W."
                    },
                    {
                        "name": "Schaffler L."
                    },
                    {
                        "name": "Scherber C."
                    }
                ],
                "date": "2023-01-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "taxalogue: a toolkit to create comprehensive CO1 reference databases"
            },
            "pmcid": "PMC10702336",
            "pmid": "38077427"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Biological databases",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        }
    ]
}
