{
    "additionDate": "2018-05-03T16:12:08Z",
    "biotoolsCURIE": "biotools:kimosys",
    "biotoolsID": "kimosys",
    "credit": [
        {
            "name": "Contact form",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://kimosys.org/documentation/contact"
        }
    ],
    "description": "Web-based repository of experimental data for KInetic MOdels of biological SYStems.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://kimosys.org/documentation"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "https://kimosys.org/",
    "language": [
        "Java",
        "Ruby"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "license": "GPL-2.0",
    "name": "KiMoSys",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/S12918-014-0085-3",
            "metadata": {
                "abstract": "© 2014 Costa et al.; licensee BioMed Central.Background: The kinetic modeling of biological systems is mainly composed of three steps that proceed iteratively: model building, simulation and analysis. In the first step, it is usually required to set initial metabolite concentrations, and to assign kinetic rate laws, along with estimating parameter values using kinetic data through optimization when these are not known. Although the rapid development of high-throughput methods has generated much omics data, experimentalists present only a summary of obtained results for publication, the experimental data files are not usually submitted to any public repository, or simply not available at all. In order to automatize as much as possible the steps of building kinetic models, there is a growing requirement in the systems biology community for easily exchanging data in combination with models, which represents the main motivation of KiMoSys development.Description: KiMoSys is a user-friendly platform that includes a public data repository of published experimental data, containing concentration data of metabolites and enzymes and flux data. It was designed to ensure data management, storage and sharing for a wider systems biology community. This community repository offers a web-based interface and upload facility to turn available data into publicly accessible, centralized and structured-format data files. Moreover, it compiles and integrates available kinetic models associated with the data.KiMoSys also integrates some tools to facilitate the kinetic model construction process of large-scale metabolic networks, especially when the systems biologists perform computational research.Conclusions: KiMoSys is a web-based system that integrates a public data and associated model(s) repository with computational tools, providing the systems biology community with a novel application facilitating data storage and sharing, thus supporting construction of ODE-based kinetic models and collaborative research projects.The web application implemented using Ruby on Rails framework is freely available for web access at http://kimosys.org, along with its full documentation.",
                "authors": [
                    {
                        "name": "Costa R.S."
                    },
                    {
                        "name": "Verissimo A."
                    },
                    {
                        "name": "Vinga S."
                    }
                ],
                "citationCount": 16,
                "date": "2014-08-13T00:00:00Z",
                "journal": "BMC Systems Biology",
                "title": "KiMoSys: A web-based repository of experimental data for KInetic MOdels of biological SYStems"
            },
            "pmcid": "PMC4236735",
            "pmid": "25115331"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        },
        {
            "term": "Medicines research and development",
            "uri": "http://edamontology.org/topic_3376"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        }
    ],
    "validated": 1
}
