{
    "accessibility": "Open access",
    "additionDate": "2024-01-01T22:56:04.098558Z",
    "biotoolsCURIE": "biotools:scmeb",
    "biotoolsID": "scmeb",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ylyang@mail.xidian.edu.cn",
            "name": "Youlong Yang",
            "typeEntity": "Person"
        }
    ],
    "description": "Fast and clustering-independent method for detecting differentially expressed genes in single-cell RNA-seq data.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Expression profile clustering",
                    "uri": "http://edamontology.org/operation_0313"
                }
            ]
        }
    ],
    "homepage": "https://github.com/FocusPaka/scMEB",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-01-01T22:56:04.101177Z",
    "name": "scMEB",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12864-023-09374-6",
            "metadata": {
                "abstract": "Background: Cell clustering is a prerequisite for identifying differentially expressed genes (DEGs) in single-cell RNA sequencing (scRNA-seq) data. Obtaining a perfect clustering result is of central importance for subsequent analyses, but not easy. Additionally, the increase in cell throughput due to the advancement of scRNA-seq protocols exacerbates many computational issues, especially regarding method runtime. To address these difficulties, a new, accurate, and fast method for detecting DEGs in scRNA-seq data is needed. Results: Here, we propose single-cell minimum enclosing ball (scMEB), a novel and fast method for detecting single-cell DEGs without prior cell clustering results. The proposed method utilizes a small part of known non-DEGs (stably expressed genes) to build a minimum enclosing ball and defines the DEGs based on the distance of a mapped gene to the center of the hypersphere in a feature space. Conclusions: We compared scMEB to two different approaches that could be used to identify DEGs without cell clustering. The investigation of 11 real datasets revealed that scMEB outperformed rival methods in terms of cell clustering, predicting genes with biological functions, and identifying marker genes. Moreover, scMEB was much faster than the other methods, making it particularly effective for finding DEGs in high-throughput scRNA-seq data. We have developed a package scMEB for the proposed method, which could be available at https://github.com/FocusPaka/scMEB .",
                "authors": [
                    {
                        "name": "Yang Y."
                    },
                    {
                        "name": "Zhu J."
                    }
                ],
                "date": "2023-12-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "scMEB: a fast and clustering-independent method for detecting differentially expressed genes in single-cell RNA-seq data"
            },
            "pmcid": "PMC10210493",
            "pmid": "37231345",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
