{
    "additionDate": "2017-08-20T15:57:54Z",
    "biotoolsCURIE": "biotools:maldsoft",
    "biotoolsID": "maldsoft",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "email": "g.montana@imperial.ac.uk",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Admixture mapping of complex trait loci, using case-control data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://web.stanford.edu/group/pritchardlab/software/MALDsoft.pdf"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "homepage": "https://web.stanford.edu/group/pritchardlab/software/maldsoft_download.html",
    "lastUpdate": "2020-01-19T17:47:47Z",
    "license": "Not licensed",
    "name": "MALDsoft",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1086/425281",
            "metadata": {
                "abstract": "Admixture mapping is a promising new tool for discovering genes that contribute to complex traits. This mapping approach uses samples from recently admixed populations to detect susceptibility loci at which the risk alleles have different frequencies in the original contributing populations. Although the idea for admixture mapping has been around for more than a decade, the genomic tools are only now becoming available to make this a feasible and attractive option for complex-trait mapping. In this article, we describe new statistical methods for analyzing multipoint data from admixture-mapping studies to detect \"ancestry association.\" The new test statistics do not assume a particular disease model; instead, they are based simply on the extent to which the sample's ancestry proportions at a locus deviate from the genome average. Our power calculations show that, for loci at which the underlying risk-allele frequencies are substantially different in the ancestral populations, the power of admixture mapping can be comparable to that of association mapping but with a far smaller number of markers. We also show that, although \"ancestry informative markers\" (AIMs) are superior to random single-nucleotide polymorphisms (SNPs), random SNPs can perform quite well when AIMs are not available. Hence, researchers who study admixed populations in which AIMs are not available can perform admixture mapping with the use of modestly higher densities of random markers. Software to perform the gene-mapping calculations, \"MALDsoft,\" is freely available on the Pritchard Lab Web site.",
                "authors": [
                    {
                        "name": "Montana G."
                    },
                    {
                        "name": "Pritchard J.K."
                    }
                ],
                "citationCount": 116,
                "date": "2004-01-01T00:00:00Z",
                "journal": "American Journal of Human Genetics",
                "title": "Statistical tests for admixture mapping with case-control and cases-only data"
            },
            "pmcid": "PMC1182107",
            "pmid": "15386213",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        }
    ],
    "validated": 1
}