{"credit":[{"email":"hayoun@usc.edu","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.hayounlee.org/"}],"documentation":[{"type":"GENERAL","url":"http://p512.usc.edu/"}],"function":[{"note":"Estimates the infection duration of a HIV infection","operation":[{"term":"Prediction and recognition","uri":"http://edamontology.org/operation_2423"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"DNA","uri":"http://edamontology.org/topic_0654"},{"term":"Virology","uri":"http://edamontology.org/topic_0781"},{"term":"Infectious disease","uri":"http://edamontology.org/topic_3324"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/spmm-estimating-infection-duration-of-multi-variant-hiv-1-infections.html"}],"publication":[{"abstract":"© The Author 2015. Published by Oxford University Press.Motivation: Illustrating how HIV-1 is transmitted and how it evolves in the following weeks is an important step for developing effective vaccination and prevention strategies. It is currently possible through DNA sequencing to account for the diverse array of viral strains within an infected individual. This provides an unprecedented opportunity to pinpoint when each patient was infected and which viruses were transmitted. Results: Here we develop a mathematical tool for early HIV-1 evolution within a subject whose infection originates either from a single or multiple viral variants. The shifted Poisson mixture model (SPMM) provides a quantitative guideline for segregating viral lineages, which in turn enables us to assess when a subject was infected. The infection duration estimated by SPMM showed a statistically significant linear relationship with that by Fiebig laboratory staging (P = 0.00059) among 37 acutely infected subjects. Our tool provides a functional approach to understanding early genetic diversity, one of the most important parameters for deciphering HIV-1 transmission and predicting the rate of disease progression.","authors":["Love T.M.T.","Park S.Y.","Giorgi E.E.","Mack W.J.","Perelson A.S.","Lee H.Y."],"cit_count":5,"journal":"Bioinformatics","pmid":"26722117","title":"SPMM: Estimating infection duration of multivariant HIV-1 infections","year":"2016-05-01"}],"summary":{"biotoolsCURIE":"biotools:spmm","biotoolsID":"spmm","description":"The tool estimates the infection duration of a single variant or multi-variant HIV infections based on the characteristics of HIV transmission and early evolution.","homepage":"http://p512.usc.edu/","name":"SPMM"}}