{
    "additionDate": "2017-08-03T19:02:39Z",
    "biotoolsCURIE": "biotools:tera",
    "biotoolsID": "tera",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://mbb.univ-montp2.fr/MBB/subsection/Help.php#h_fac_15"
        }
    ],
    "description": "Given a dated species tree S, a set of gene trees G, and a set of costs for gene events (duplications, transfers and losses), the program computes the score of a most parsimonious reconciliation (MPR).",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://mbb.univ-montp2.fr/MBB/subsection/downloads.php?section=all&from_src=0&nb_src=100#src_accordion16"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree analysis",
                    "uri": "http://edamontology.org/operation_0324"
                }
            ]
        }
    ],
    "homepage": "http://mbb.univ-montp2.fr/MBB/download_sources/16__TERA",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/tera-1-0-tree-estimating-using-reconciliation-and-amalgamation.html"
        }
    ],
    "name": "TERA",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2014 © The Author 2014. Published by Oxford University Press. © The Author 2014. Published by Oxford University Press. All rights reserved.Motivation: Traditionally, gene phylogenies have been reconstructed solely on the basis of molecular sequences; this, however, often does not provide enough information to distinguish between statistically equivalent relationships. To address this problem, several recent methods have incorporated information on the species phylogeny in gene tree reconstruction, leading to dramatic improvements in accuracy. Although probabilistic methods are able to estimate all model parameters but are computationally expensive, parsimony methods - generally computationally more efficient - require a prior estimate of parameters and of the statistical support. Results: Here, we present the Tree Estimation using Reconciliation (TERA) algorithm, a parsimony based, species tree aware method for gene tree reconstruction based on a scoring scheme combining duplication, transfer and loss costs with an estimate of the sequence likelihood. TERA explores all reconciled gene trees that can be amalgamated from a sample of gene trees. Using a large scale simulated dataset, we demonstrate that TERA achieves the same accuracy as the corresponding probabilistic method while being faster, and outperforms other parsimony-based methods in both accuracy and speed. Running TERA on a set of 1099 homologous gene families from complete cyanobacterial genomes, we find that incorporating knowledge of the species tree results in a two thirds reduction in the number of apparent transfer events.",
                "authors": [
                    {
                        "name": "Jacox E."
                    },
                    {
                        "name": "Scornavacca C."
                    },
                    {
                        "name": "Szollosi G.J."
                    }
                ],
                "citationCount": 27,
                "date": "2015-03-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Joint amalgamation of most parsimonious reconciled gene trees"
            },
            "pmid": "25380957"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        }
    ],
    "validated": 1
}
