{
    "additionDate": "2021-12-06T13:29:02.539959Z",
    "biotoolsCURIE": "biotools:streme",
    "biotoolsID": "streme",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "timothybailey@unr.edu",
            "name": "Timothy L Bailey",
            "orcidid": "https://orcid.org/0000-0002-7018-9342",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "STREME is accurate and versatile sequence motif discovery tool. The MEME Suite allows you to discover novel motifs in collections of unaligned nucleotide or protein sequences, and to perform a wide variety of other motif-based analyses. It provides motif discovery algorithms using both probabilistic (MEME) and discrete models (STREME), which have complementary strengths. It also allows discovery of motifs with arbitrary insertions and deletions (GLAM2). MEME-ChIP performs a comprehensive motif-based analysis of ChIP-seq and other large sequence datasets.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence motif comparison",
                    "uri": "http://edamontology.org/operation_0240"
                },
                {
                    "term": "Sequence motif discovery",
                    "uri": "http://edamontology.org/operation_0238"
                },
                {
                    "term": "Sequence motif recognition",
                    "uri": "http://edamontology.org/operation_0239"
                },
                {
                    "term": "Transcriptional regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0438"
                }
            ]
        }
    ],
    "homepage": "http://meme-suite.org",
    "lastUpdate": "2024-11-24T20:14:52.922980Z",
    "name": "STREME",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btab203",
            "metadata": {
                "abstract": "Motivation: Sequence motif discovery algorithms can identify novel sequence patterns that perform biological functions in DNA, RNA and protein sequences - for example, the binding site motifs of DNA- and RNA-binding proteins. Results: The STREME algorithm presented here advances the state-of-the-art in ab initio motif discovery in terms of both accuracy and versatility. Using in vivo DNA (ChIP-seq) and RNA (CLIP-seq) data, and validating motifs with reference motifs derived from in vitro data, we show that STREME is more accurate, sensitive and thorough than several widely used algorithms (DREME, HOMER, MEME, Peak-motifs) and two other representative algorithms (ProSampler and Weeder). STREME's capabilities include the ability to find motifs in datasets with hundreds of thousands of sequences, to find both short and long motifs (from 3 to 30 positions), to perform differential motif discovery in pairs of sequence datasets, and to find motifs in sequences over virtually any alphabet (DNA, RNA, protein and user-defined alphabets). Unlike most motif discovery algorithms, STREME reports a useful estimate of the statistical significance of each motif it discovers. STREME is easy to use individually via its web server or via the command line, and is completely integrated with the widely used MEME Suite of sequence analysis tools. The name STREME stands for 'Simple, Thorough, Rapid, Enriched Motif Elicitation'.",
                "authors": [
                    {
                        "name": "Bailey T.L."
                    }
                ],
                "citationCount": 254,
                "date": "2021-09-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "STREME: accurate and versatile sequence motif discovery"
            },
            "pmcid": "PMC8479671",
            "pmid": "33760053",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Suite"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "RNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3794"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
