{
    "additionDate": "2018-07-18T10:41:37Z",
    "biotoolsCURIE": "biotools:mtctscan",
    "biotoolsID": "mtctscan",
    "credit": [
        {
            "email": "mulin0424.li@gmail.com",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "Hongchengyaonk@gmail.com",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "junwen@uw.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Mutation To Cancer Therapy Scan. Systematically analyze mutations affecting cancer drug sensitivity based on individual genomic profiles. It was developed by leveraging the latest knowledge on mutation-cancer drug sensitivity associations and the results from large-scale chemical screening using human cancer cell lines.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://mtctscanhelp.github.io/mTCTScanHelp/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://jjwanglab.org/mTCTScan",
    "lastUpdate": "2018-12-11T17:08:13Z",
    "name": "mTCTScan",
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.1093/nar/gkx400",
            "metadata": {
                "abstract": "© 2017 The Author(s).Cancer therapies have experienced rapid progress in recent years, with a number of novel smallmolecule kinase inhibitors and monoclonal antibodies now being widely used to treat various types of human cancers. During cancer treatments, mutations can have important effects on drug sensitivity. However, the relationship between tumor genomic profiles and the effectiveness of cancer drugs remains elusive. We introduce Mutation To Cancer Therapy Scan (mTCTScan) web server (http: //jjwanglab.org/mTCTScan) that can systematically analyze mutations affecting cancer drug sensitivity based on individual genomic profiles. The platform was developed by leveraging the latest knowledge on mutation-cancer drug sensitivity associations and the results from large-scale chemical screening using human cancer cell lines. Using an evidencebased scoring scheme based on current integrative evidences, mTCTScan is able to prioritize mutations according to their associations with cancer drugs and preclinical compounds. It can also show related drugs/compounds with sensitivity classification by considering the context of the entire genomic profile. In addition, mTCTScan incorporates comprehensive filtering functions and cancer-related annotations to better interpret mutation effects and their association with cancer drugs. This platform will greatly benefit both researchers and clinicians for interrogating mechanisms of mutation-dependent drug response, which will have a significant impact on cancer precision medicine.",
                "authors": [
                    {
                        "name": "Li M.J."
                    },
                    {
                        "name": "Yao H."
                    },
                    {
                        "name": "Huang D."
                    },
                    {
                        "name": "Liu H."
                    },
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Xu H."
                    },
                    {
                        "name": "Qin Y."
                    },
                    {
                        "name": "Prinz J."
                    },
                    {
                        "name": "Xia W."
                    },
                    {
                        "name": "Wang P."
                    },
                    {
                        "name": "Yan B."
                    },
                    {
                        "name": "Tran N.L."
                    },
                    {
                        "name": "Kocher J.-P."
                    },
                    {
                        "name": "Sham P.C."
                    },
                    {
                        "name": "Wang J."
                    }
                ],
                "citationCount": 2,
                "date": "2017-07-03T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "MTCTScan: A comprehensive platform for annotation and prioritization of mutations affecting drug sensitivity in cancers"
            },
            "pmcid": "PMC5793836",
            "pmid": "28482068",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pharmacogenomics",
            "uri": "http://edamontology.org/topic_0208"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        }
    ],
    "validated": 1
}