{
    "additionDate": "2021-03-19T08:47:03Z",
    "biotoolsCURIE": "biotools:probabilistic-graphlets",
    "biotoolsID": "probabilistic-graphlets",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "natasha@bsc.es",
            "name": "Nataša Pržulj",
            "typeEntity": "Person"
        }
    ],
    "description": "Probabilistic graphlets capture biological function in probabilistic molecular networks.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Serdobe/Probabilistic_Graphlets",
    "language": [
        "C",
        "C++",
        "Python"
    ],
    "lastUpdate": "2021-03-28T14:14:14Z",
    "license": "Apache-2.0",
    "name": "probabilistic graphlets",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA812",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.comMotivation: Molecular interactions have been successfully modeled and analyzed as networks, where nodes represent molecules and edges represent the interactions between them. These networks revealed that molecules with similar local network structure also have similar biological functions. The most sensitive measures of network structure are based on graphlets. However, graphlet-based methods thus far are only applicable to unweighted networks, whereas real-world molecular networks may have weighted edges that can represent the probability of an interaction occurring in the cell. This information is commonly discarded when applying thresholds to generate unweighted networks, which may lead to information loss. Results: We introduce probabilistic graphlets as a tool for analyzing the local wiring patterns of probabilistic networks. To assess their performance compared to unweighted graphlets, we generate synthetic networks based on different well-known random network models and edge probability distributions and demonstrate that probabilistic graphlets outperform their unweighted counterparts in distinguishing network structures. Then we model different real-world molecular interaction networks as weighted graphs with probabilities as weights on edges and we analyze them with our new weighted graphlets-based methods. We show that due to their probabilistic nature, probabilistic graphlet-based methods more robustly capture biological information in these data, while simultaneously showing a higher sensitivity to identify condition-specific functions compared to their unweighted graphlet-based method counterparts.",
                "authors": [
                    {
                        "name": "Bottcher R."
                    },
                    {
                        "name": "Doria-Belenguer S."
                    },
                    {
                        "name": "Malod-Dognin N."
                    },
                    {
                        "name": "Przulj N."
                    },
                    {
                        "name": "Youssef M.K."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Probabilistic graphlets capture biological function in probabilistic molecular networks"
            },
            "pmid": "33381834"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
