{
    "additionDate": "2021-01-18T09:11:22Z",
    "biotoolsCURIE": "biotools:antrax",
    "biotoolsID": "antrax",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "agal@rockefeller.edu",
            "name": "Asaf Gal",
            "orcidid": "https://orcid.org/0000-0003-0834-2649",
            "typeEntity": "Person"
        },
        {
            "email": "dkronauer@rockefeller.edu",
            "name": "Daniel J. C. Kronauer",
            "orcidid": "https://orcid.org/0000-0002-4103-7729",
            "typeEntity": "Person"
        },
        {
            "name": "Jonathan Saragosti",
            "typeEntity": "Person"
        }
    ],
    "description": "anTraX is an algorithm and software package for high-throughput video tracking of color-tagged insects. anTraX combines neural network classification of animals with a novel approach for representing tracking data as a graph, enabling individual tracking even in cases where it is difficult to segment animals from one another, or where tags are obscured.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://antrax.readthedocs.io",
    "language": [
        "MATLAB",
        "Python"
    ],
    "lastUpdate": "2021-01-23T17:42:21Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "http://github.com/Social-Evolution-and-Behavior/anTraX"
        }
    ],
    "name": "anTraX",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1101/2020.04.29.068478"
        },
        {
            "doi": "10.7554/elife.58145",
            "metadata": {
                "abstract": "© Gal et al.Recent years have seen a surge in methods to track and analyze animal behavior. Nevertheless, tracking individuals in closely interacting, group-living organisms remains a challenge. Here, we present anTraX, an algorithm and software package for high-throughput video tracking of color-tagged insects. anTraX combines neural network classification of animals with a novel approach for representing tracking data as a graph, enabling individual tracking even in cases where it is difficult to segment animals from one another, or where tags are obscured. The use of color tags, a well-established and robust method for marking individual insects in groups, relaxes requirements for image size and quality, and makes the software broadly applicable. anTraX is readily integrated into existing tools and methods for automated image analysis of behavior to further augment its output. anTraX can handle large-scale experiments with minimal human involvement, allowing researchers to simultaneously monitor many social groups over long time periods.",
                "authors": [
                    {
                        "name": "Gal A."
                    },
                    {
                        "name": "Saragosti J."
                    },
                    {
                        "name": "Kronauer D.J.C."
                    }
                ],
                "citationCount": 6,
                "date": "2020-10-01T00:00:00Z",
                "journal": "eLife",
                "title": "Antrax, a software package for high-throughput video tracking of color-tagged insects"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ],
    "validated": 1
}