{
    "additionDate": "2019-11-14T19:28:30Z",
    "biotoolsCURIE": "biotools:MeLAD",
    "biotoolsID": "MeLAD",
    "confidence_flag": "tool",
    "description": "An integrated resource for metalloenzyme-ligand associations | The Metalloenzyme-Ligand Association Database (MeLAD)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Metal-binding site prediction",
                    "uri": "http://edamontology.org/operation_3898"
                },
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                }
            ]
        }
    ],
    "homepage": "https://melad.ddtmlab.org",
    "lastUpdate": "2020-12-23T08:38:08Z",
    "name": "MeLAD",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ648",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: Metalloenzymes are attractive targets for therapeutic intervention owing to their central roles in various biological processes and pathological situations. The fast-growing body of structural data on metalloenzyme-ligand interactions is facilitating efficient drug discovery targeting metalloenzymes. However, there remains a shortage of specific databases that can provide centralized, interconnected information exclusive to metalloenzyme-ligand associations. Results: We created a Metalloenzyme-Ligand Association Database (MeLAD), which is designed to provide curated structural data and information exclusive to metalloenzyme-ligand interactions, and more uniquely, present expanded associations that are represented by metal-binding pharmacophores (MBPs), metalloenzyme structural similarity (MeSIM) and ligand chemical similarity (LigSIM). MeLAD currently contains 6086 structurally resolved interactions of 1416 metalloenzymes with 3564 ligands, of which classical metal-binding, non-classical metal-binding, non-metal-binding and metal water-bridging interactions account for 63.0%, 2.3%, 34.4% and 0.3%, respectively. A total of 263 monodentate, 191 bidentate and 15 tridentate MBP chemotypes were included in MeLAD, which are linked to different active site metal ions and coordination modes. 3726 and 52 740 deductive metalloenzyme-ligand associations by MeSIM and LigSIM analyses, respectively, were included in MeLAD. An online server is provided for users to conduct metalloenzyme profiling prediction for small molecules of interest. MeLAD is searchable by multiple criteria, e.g. metalloenzyme name, ligand identifier, functional class, bioinorganic class, metal ion and metal-containing cofactor, which will serve as a valuable, integrative data source to foster metalloenzyme related research, particularly involved in drug discovery targeting metalloenzymes.",
                "authors": [
                    {
                        "name": "Dai Q.-Q."
                    },
                    {
                        "name": "Fu C."
                    },
                    {
                        "name": "Huang C."
                    },
                    {
                        "name": "Li G."
                    },
                    {
                        "name": "Li G.-B."
                    },
                    {
                        "name": "McDonough M.A."
                    },
                    {
                        "name": "Ning X.-L."
                    },
                    {
                        "name": "Peng J.-Y."
                    },
                    {
                        "name": "Schofield C.J."
                    },
                    {
                        "name": "Su Y."
                    },
                    {
                        "name": "Yan Y.-H."
                    },
                    {
                        "name": "Zhu C.-L."
                    }
                ],
                "citationCount": 6,
                "date": "2020-02-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "MeLAD: An integrated resource for metalloenzyme-ligand associations"
            },
            "pmid": "31504189"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        },
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
