{
    "accessibility": "Open access",
    "additionDate": "2022-02-16T07:26:22.867466Z",
    "biotoolsCURIE": "biotools:deleat",
    "biotoolsID": "deleat",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "rosario.gil@uv.es",
            "name": "Rosario Gil",
            "orcidid": "https://orcid.org/0000-0002-9397-1003",
            "typeEntity": "Person"
        }
    ],
    "description": "DELEAT (deletion design by essentiality analysis tool). Gene essentiality prediction and deletion design for bacterial genome reduction.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jime-sg/deleat",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-04-12T11:00:17.566340Z",
    "license": "GPL-3.0",
    "name": "DELEAT",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "jimenasg",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04348-5",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: The study of gene essentiality is fundamental to understand the basic principles of life, as well as for applications in many fields. In recent decades, dozens of sets of essential genes have been determined using different experimental and bioinformatics approaches, and this information has been useful for genome reduction of model organisms. Multiple in silico strategies have been developed to predict gene essentiality, but no optimal algorithm or set of gene features has been found yet, especially for non-model organisms with incomplete functional annotation. Results: We have developed DELEAT v0.1 (DELetion design by Essentiality Analysis Tool), an easy-to-use bioinformatic tool which integrates an in silico gene essentiality classifier in a pipeline allowing automatic design of large-scale deletions in any bacterial genome. The essentiality classifier consists of a novel logistic regression model based on only six gene features which are not dependent on experimental data or functional annotation. As a proof of concept, we have applied this pipeline to the determination of dispensable regions in the genome of Bartonella quintana str. Toulouse. In this already reduced genome, 35 possible deletions have been delimited, spanning 29% of the genome. Conclusions: Built on in silico gene essentiality predictions, we have developed an analysis pipeline which assists researchers throughout multiple stages of bacterial genome reduction projects, and created a novel classifier which is simple, fast, and universally applicable to any bacterial organism with a GenBank annotation file.",
                "authors": [
                    {
                        "name": "Garrote-Sanchez E."
                    },
                    {
                        "name": "Gil R."
                    },
                    {
                        "name": "Solana J."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "DELEAT: gene essentiality prediction and deletion design for bacterial genome reduction"
            },
            "pmcid": "PMC8449488",
            "pmid": "34537011"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Synthetic biology",
            "uri": "http://edamontology.org/topic_3895"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "version": [
        "0.1"
    ]
}
