
{
    "credit": [
        {
            "email": "jkrueger@cebitec.uni-bielefeld.de",
            "name": "Jan Krüger",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "https://bibiserv.cebitec.uni-bielefeld.de/rnamovies?id=rnamovies_manual"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "RNA secondary structure analysis",
                    "uri": "http://edamontology.org/operation_2439"
                },
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                },
                {
                    "term": "RNA secondary structure alignment",
                    "uri": "http://edamontology.org/operation_0502"
                },
                {
                    "term": "RNA secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0278"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "RNA",
                "uri": "http://edamontology.org/topic_0099"
            },
            {
                "term": "Nucleic acid structure analysis",
                "uri": "http://edamontology.org/topic_0097"
            },
            {
                "term": "Zoology",
                "uri": "http://edamontology.org/topic_3500"
            },
            {
                "term": "Structure prediction",
                "uri": "http://edamontology.org/topic_0082"
            },
            {
                "term": "Protein secondary structure",
                "uri": "http://edamontology.org/topic_3542"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Motivation: RNA Movies is a system for the visualization of RNA secondary structure spaces. Its input is a script consisting of primary and secondary structure information. From this script, the system fully automatically generates animated graphical structure representations. In this way, it creates the impression of an RNA molecule exploring its own two-dimensional structure space. Results: RNA Movies has been used to generate animations of a switching structure in the spliced leader RNA of Leptomonas collosoma and sequential foldings of potato spindle tuber viroid transcripts. Availability: Demonstrations of the animations mentioned in this paper can be viewed on our Bioinformatics web server under the following address: http://BiBiServ.TechFak.Uni-Bielefeld.DE/rnamovies/. The RNA Movies software is available upon request from the authors. Contact: dirk@TechFak.Uni-Bielefeld.DE .",
            "authors": [
                "Evers D.",
                "Giegerich R."
            ],
            "cit_count": 31,
            "journal": "Bioinformatics",
            "pmid": "10068690",
            "title": "RNA movies: Visualizing RNA secondary structure spaces",
            "year": "1999-01-01"
        },
        {
            "abstract": "RNA Movies is a simple, yet powerful visualization tool in likeness to a media player application, which enables to browse sequential paths through RNA secondary structure landscapes. It can be used to visualize structural rearrangement processes of RNA, such as folding pathways and conformational switches, or to browse lists of alternative structure candidates. Besides extending the feature set, retaining and improving usability and availability in the web is the main aim of this new version. RNA Movies now supports the DCSE and RNAStructML input formats besides its own RNM format. Pseudoknots and 'entangled helices' can be superimposed on the RNA secondary structure layout. Publication quality output is provided through the Scalable Vector Graphics output format understood by most current drawing programs. The software has been completely re-implemented in Java to enable pure client-side operation as applet and web-start application available at the Bielefeld Bioinformatics Server http://bibiserv.techfak. uni-bielefeld.de/rnamovies. © 2007 The Author(s).",
            "authors": [
                "Kaiser A.",
                "Kruger J.",
                "Evers D.J."
            ],
            "cit_count": 5,
            "journal": "Nucleic Acids Research",
            "pmid": "17567618",
            "title": "RNA Movies 2: Sequential animation of RNA secondary structures",
            "year": "2007-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:rna_movies",
        "biotoolsID": "rna_movies",
        "description": "RNA Movies is a tool for the visualization of RNA secondary structure spaces. The program creates an interpolated animation of user provided sets of secondary structure data.",
        "homepage": "http://bibiserv.techfak.uni-bielefeld.de/rnamovies/",
        "name": "RNA Movies"
    }
}