{
    "additionDate": "2021-03-19T08:28:44Z",
    "biotoolsCURIE": "biotools:probselect",
    "biotoolsID": "probselect",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "lkurgan@vcu.edu",
            "name": "Lukasz Kurgan",
            "typeEntity": "Person"
        }
    ],
    "description": "PROBselect is an accurate prediction of protein-binding residues from proteins sequences via dynamic predictor selection.\n\nPROBselect suggests a predictor that is likely to provide the best prediction of protein-binding residues the for the input proteins. PROBselect uses predictions generated by SCRIBER and estimated AUC of SSWRF and CRFPPI to make the recommendation.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein-protein docking",
                    "uri": "http://edamontology.org/operation_3899"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Residue contact prediction",
                    "uri": "http://edamontology.org/operation_0272"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Protein disorder prediction",
                    "uri": "http://edamontology.org/operation_3904"
                }
            ]
        }
    ],
    "homepage": "http://bioinformatics.csu.edu.cn/PROBselect/home/index",
    "lastUpdate": "2021-03-28T14:25:32Z",
    "name": "PROBselect",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA806",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.comMotivation: Knowledge of protein-binding residues (PBRs) improves our understanding of protein-protein interactions, contributes to the prediction of protein functions and facilitates protein-protein docking calculations. While many sequence-based predictors of PBRs were published, they offer modest levels of predictive performance and most of them cross-predict residues that interact with other partners. One unexplored option to improve the predictive quality is to design consensus predictors that combine results produced by multiple methods. Results: We empirically investigate predictive performance of a representative set of nine predictors of PBRs. We report substantial differences in predictive quality when these methods are used to predict individual proteins, which contrast with the dataset-level benchmarks that are currently used to assess and compare these methods. Our analysis provides new insights for the cross-prediction concern, dissects complementarity between predictors and demonstrates that predictive performance of the top methods depends on unique characteristics of the input protein sequence. Using these insights, we developed PROBselect, first-of-its-kind consensus predictor of PBRs. Our design is based on the dynamic predictor selection at the protein level, where the selection relies on regression-based models that accurately estimate predictive performance of selected predictors directly from the sequence. Empirical assessment using a low-similarity test dataset shows that PROBselect provides significantly improved predictive quality when compared with the current predictors and conventional consensuses that combine residue-level predictions. Moreover, PROBselect informs the users about the expected predictive quality for the prediction generated from a given input protein.",
                "authors": [
                    {
                        "name": "Zhang F."
                    },
                    {
                        "name": "Shi W."
                    },
                    {
                        "name": "Zhang J."
                    },
                    {
                        "name": "Zeng M."
                    },
                    {
                        "name": "Li M."
                    },
                    {
                        "name": "Kurgan L."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "PROBselect: Accurate prediction of protein-binding residues from proteins sequences via dynamic predictor selection"
            },
            "pmid": "33381815"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Protein secondary structure",
            "uri": "http://edamontology.org/topic_3542"
        }
    ]
}