{"credit":[{"email":"aksen7575@gmail.com","typeEntity":"Person","typeRoles":["Primary contact"],"url":"https://www.kobic.re.kr/newkobic/index.php?mid=eng"},{"email":"fly2skynow@hanmail.net","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"mack97hyuk@gmail.com","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://psb.kobic.re.kr/nmre/index.cgi"}],"function":[{"operation":[{"term":"Molecular model refinement","uri":"http://edamontology.org/operation_0322"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"NMR","uri":"http://edamontology.org/topic_0593"},{"term":"Molecular modelling","uri":"http://edamontology.org/topic_2275"},{"term":"Protein structure analysis","uri":"http://edamontology.org/topic_2814"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/nmre-web-based-server-for-nmr-structure-refinement.html"}],"publication":[{"abstract":"© 2015 The Author 2015. Published by Oxford University Press. All rights reserved. Summary: Protein structure refinement is a necessary step for the study of protein function. In particular, some nuclear magnetic resonance (NMR) structures are of lower quality than X-ray crystallographic structures. Here, we present NMRe, a web-based server for NMR structure refinement. The previously developed knowledge-based energy function STAP (Statistical Torsion Angle Potential) was used for NMRe refinement. With STAP, NMRe provides two refinement protocols using two types of distance restraints. If a user provides NOE (Nuclear Overhauser Effect) data, the refinement is performed with the NOE distance restraints as a conventional NMR structure refinement. Additionally, NMRe generates NOE-like distance restraints based on the inter-hydrogen distances derived from the input structure. The efficiency of NMRe refinement was validated on 20 NMR structures. Most of the quality assessment scores of the refined NMR structures were better than those of the original structures. The refinement results are provided as a three-dimensional structure view, a secondary structure scheme, and numerical and graphical structure validation scores. Availability and implementation: NMRe is available at http://psb.kobic.re.kr/nmre/ Contact: Supplementary information: Supplementary data are available at Bioinformatics online.","authors":["Ryu H.","Lim G.","Sung B.H.","Lee J."],"cit_count":3,"journal":"Bioinformatics","pmid":"26504145","title":"NMRe: A web server for NMR protein structure refinement with high-quality structure validation scores","year":"2015-09-15"}],"summary":{"biotoolsCURIE":"biotools:nmre","biotoolsID":"nmre","description":"Provides a simple and fast NMR protein structure refinement.","homepage":"http://psb.kobic.re.kr/nmre/","name":"NMRe"}}