{
    "additionDate": "2017-02-10T14:15:31Z",
    "biotoolsCURIE": "biotools:treedet",
    "biotoolsID": "treedet",
    "credit": [
        {
            "email": "pazos@cnb.csic.es",
            "name": "TreeDet Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Tree Determinant (TreeDet) is a tool for predicting functional residues in protein sequence alignments.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Residue interaction prediction",
                    "uri": "http://edamontology.org/operation_0272"
                },
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                },
                {
                    "term": "Protein function prediction",
                    "uri": "http://edamontology.org/operation_1777"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "homepage": "http://treedetv2.bioinfo.cnio.es/treedet/index.html",
    "language": [
        "PHP",
        "Perl",
        "Fortran",
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:53Z",
    "name": "TreeDet",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "The TreeDet (Tree Determinant) Server is the first release of a system designed to integrate results from methods that predict functional sites in protein families. These methods take into account the relation between sequence conservation and evolutionary importance. TreeDet fully analyses the space of protein sequences in either user-uploaded or automatically generated multiple sequence alignments. The methods implemented in the server represent three main classes of methods for the detection of family-dependent conserved positions, a tree-based method, a correlation based method and a method that employs a principal component analyses coupled to a cluster algorithm. An additional method is provided to highlight the reliability of the position in the alignments. The server is available at http://www.pdg.cnb.uam.es/servers/ treedet. © The Author 2006. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Carro A."
                    },
                    {
                        "name": "Tress M."
                    },
                    {
                        "name": "de Juan D."
                    },
                    {
                        "name": "Pazos F."
                    },
                    {
                        "name": "Lopez-Romero P."
                    },
                    {
                        "name": "del Sol A."
                    },
                    {
                        "name": "Valencia A."
                    },
                    {
                        "name": "Rojas A.M."
                    }
                ],
                "citationCount": 21,
                "date": "2006-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "TreeDet: A web server to explore sequence space"
            },
            "pmid": "16844971"
        },
        {
            "metadata": {
                "abstract": "Sequence analysis is often the first guide for the prediction of residues in a protein family that may have functional significance. A few methods have been proposed which use the division of protein families into subfamilies in the search for those positions that could have some functional significance for the whole family, but at the same time which exhibit the specificity of each subfamily (\"Tree-determinant residues\"). However, there are still many unsolved questions like the best division of a protein family into subfamilies, or the accurate detection of sequence variation patterns characteristic of different subfamilies. Here we present a systematic study in a significant number of protein families, testing the statistical meaning of the Tree-determinant residues predicted by three different methods that represent the range of available approaches. The first method takes as a starting point a phylogenetic representation of a protein family and, following the principle of Relative Entropy from Information Theory, automatically searches for the optimal division of the family into subfamilies. The second method looks for positions whose mutational behavior is reminiscent of the mutational behavior of the full-length proteins, by directly comparing the corresponding distance matrices. The third method is an automation of the analysis of distribution of sequences and amino acid positions in the corresponding multidimensional spaces using a vector-based principal component analysis. These three methods have been tested on two non-redundant lists of protein families: one composed by proteins that bind a variety of ligand groups, and the other composed by proteins with annotated functionally relevant sites. In most cases, the residues predicted by the three methods show a clear tendency to be close to bound ligands of biological relevance and to those amino acids described as participants in key aspects of protein function. These three automatic methods provide a wide range of possibilities for biologists to analyze their families of interest, in a similar way to the one presented here for the family of proteins related with ras-p21. © 2003 Elsevier Science Ltd. All rights reserved.",
                "authors": [
                    {
                        "name": "Del Sol Mesa A."
                    },
                    {
                        "name": "Pazos F."
                    },
                    {
                        "name": "Valencia A."
                    }
                ],
                "citationCount": 168,
                "date": "2003-02-28T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "Automatic methods for predicting functionally important residues"
            },
            "pmid": "12589769"
        },
        {
            "metadata": {
                "abstract": "The biological activity of a protein typically depends on the presence of a small number of functional residues. Identifying these residues from the amino acid sequences alone would be useful. Classically, strictly conserved residues are predicted to be functional but often conservation patterns are more complicated. Here, we present a novel method that exploits such patterns for the prediction of functional residues. The method uses a simple but powerful representation of entire proteins, as well as sequence residues as vectors in a generalised 'sequence space'. Projection of these vectors onto a lower-dimensional space reveals groups of residues specific for particular subfamilies that are predicted to be directly involved in protein function. Based on the method we present testable predictions for sets of functional residues in SH2 domains and in the conserved box of cydins. © 1995 Nature Publishing Group.",
                "authors": [
                    {
                        "name": "Casari G."
                    },
                    {
                        "name": "Sander C."
                    },
                    {
                        "name": "Valencia A."
                    }
                ],
                "citationCount": 325,
                "date": "1995-01-01T00:00:00Z",
                "journal": "Nature Structural Biology",
                "title": "A method to predict functional residues in proteins"
            },
            "pmid": "7749921"
        },
        {
            "metadata": {
                "abstract": "Summary: The Server for Quick Alignment Reliability Evaluation (SQUARE) is a Web-based version of the method we developed to predict regions of reliably aligned residues in sequence alignments. Given an alignment between a query sequence and a sequence of known structure, SQUARE is able to predict which residues are reliably aligned. The server accesses a database of profiles of sequences of known three-dimensional structures in order to calculate the scores for each residue in the alignment. SQUARE produces a graphical output of the residue profile-derived alignment scores along with an indication of the reliability of the alignment. In addition, the scores can be compared against template secondary structure, conserved residues and important sites. © Oxford University Press 2004; all rights reserved.",
                "authors": [
                    {
                        "name": "Tress M.L."
                    },
                    {
                        "name": "Grana O."
                    },
                    {
                        "name": "Valencia A."
                    }
                ],
                "citationCount": 16,
                "date": "2004-04-12T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "SQUARE - Determining reliable regions in sequence alignments"
            },
            "pmid": "14764569"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Function analysis",
            "uri": "http://edamontology.org/topic_1775"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Protein sites, features and motifs",
            "uri": "http://edamontology.org/topic_3510"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}