
{
    "credit": [
        {
            "email": "rost@columbia.edu",
            "name": "Burkhard Rost",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://rostlab.org/owiki/index.php/NORSp_-_predictor_of_NOn-Regular_Secondary_Structure"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein secondary structure prediction (helices)",
                    "uri": "http://edamontology.org/operation_0468"
                },
                {
                    "term": "Protein secondary structure prediction (coils)",
                    "uri": "http://edamontology.org/operation_0470"
                },
                {
                    "term": "Protein secondary structure comparison",
                    "uri": "http://edamontology.org/operation_2488"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Protein secondary structure",
                "uri": "http://edamontology.org/topic_3542"
            },
            {
                "term": "Structure prediction",
                "uri": "http://edamontology.org/topic_0082"
            },
            {
                "term": "Protein disordered structure",
                "uri": "http://edamontology.org/topic_3538"
            },
            {
                "term": "Protein folds and structural domains",
                "uri": "http://edamontology.org/topic_0736"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Over the last decade, structural biologists have unravelled many proteins that appear natively disordered. Common assumptions are that many of these proteins adopt structure through binding and that the structural flexibility enables them to adopt different functions. Here, we investigated regions of more than 70 sequence-consecutive residues that have no regular secondary structure (NORS). Analysing 31 entirely sequenced organisms, we predicted five times as many proteins with NORS regions (loopy proteins) in eukaryotes (20%) than in prokaryotes and archaeas (4%). Thousands of these NORS regions were over 150 residues long. The amino acid composition of NORS regions differed from that of loops in PDB. Although NORS proteins had significantly more residues in low-complexity regions than other proteins, simple cut-off thresholds for sequence bias missed most NORS regions. On average, NORS regions were evolutionarily at least as conserved as their flanking regions. Furthermore, yeast proteins with NORS regions had more protein-protein interaction partners than other proteins. Regulatory and transcription-related functions were over-represented in loopy proteins, biosynthesis and energy metabolism were under-represented. Overall, our analysis confirmed that proteins with non-regular structures appear to play important functional roles, and they may adopt as yet unknown types of protein structures. © 2002 Published by Elsevier Science Ltd.",
            "authors": [
                "Liu J.",
                "Tan H.",
                "Rost B."
            ],
            "cit_count": 152,
            "journal": "Journal of Molecular Biology",
            "pmid": "12215414",
            "title": "Loopy proteins appear conserved in evolution",
            "year": "2002-01-01"
        },
        {
            "abstract": "Many structurally flexible regions play important roles in biological processes. It has been shown that extended loopy regions are very abundant in the protein universe and that they have been conserved through evolution. Here, we present NORSp, a publicly available predictor for disordered regions in protein. Specifically, NORSp predicts long regions with NO Regular Secondary structure. Upon user submission of a protein sequence, NORSp will analyse the protein for its secondary structure, presence of transmembrane helices and coiled-coil. It will then return email to the user about the presence and position of disordered regions. NORSp can be accessed from http://cubic.bioc.columbia.edu/services/NORSp/.",
            "authors": [
                "Liu J.",
                "Rost B."
            ],
            "cit_count": 115,
            "journal": "Nucleic Acids Research",
            "pmid": "12824431",
            "title": "NORSp: Predictions of long regions without regular secondary structure",
            "year": "2003-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:norsp",
        "biotoolsID": "norsp",
        "description": "NORSp (predictor of NOn-Regular Secondary Structure) is a tool for predicting disordered regions in proteins.",
        "homepage": "https://rostlab.org/owiki/index.php/NORSp_-_predictor_of_NOn-Regular_Secondary_Structure",
        "name": "NORSp"
    }
}