{
    "additionDate": "2022-10-30T10:11:11.735961Z",
    "biotoolsCURIE": "biotools:circgpa",
    "biotoolsID": "circgpa",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "petr.rysavy@fel.cvut.cz",
            "name": "Petr Ryšavý",
            "typeEntity": "Person"
        },
        {
            "name": "Jiří Kléma"
        },
        {
            "name": "Michaela Dostálová Merkerová"
        }
    ],
    "description": "An annotation algorithm circGPA that identifies prospective links between circRNAs and annotation terms. The algorithm is deterministic and based on generating polynomials.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                }
            ]
        }
    ],
    "homepage": "https://github.com/petrrysavy/circgpa-paper",
    "language": [
        "C++",
        "R"
    ],
    "lastUpdate": "2024-11-24T15:25:13.576369Z",
    "license": "Not licensed",
    "name": "circGPA",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/s12859-022-04957-8",
            "metadata": {
                "abstract": "Recent research has already shown that circular RNAs (circRNAs) are functional in gene expression regulation and potentially related to diseases. Due to their stability, circRNAs can also be used as biomarkers for diagnosis. However, the function of most circRNAs remains unknown, and it is expensive and time-consuming to discover it through biological experiments. In this paper, we predict circRNA annotations from the knowledge of their interaction with miRNAs and subsequent miRNA–mRNA interactions. First, we construct an interaction network for a target circRNA and secondly spread the information from the network nodes with the known function to the root circRNA node. This idea itself is not new; our main contribution lies in proposing an efficient and exact deterministic procedure based on the principle of probability-generating functions to calculate the p-value of association test between a circRNA and an annotation term. We show that our publicly available algorithm is both more effective and efficient than the commonly used Monte-Carlo sampling approach that may suffer from difficult quantification of sampling convergence and subsequent sampling inefficiency. We experimentally demonstrate that the new approach is two orders of magnitude faster than the Monte-Carlo sampling, which makes summary annotation of large circRNA files feasible; this includes their reannotation after periodical interaction network updates, for example. We provide a summary annotation of a current circRNA database as one of our outputs. The proposed algorithm could be generalized towards other types of RNA in way that is straightforward.",
                "authors": [
                    {
                        "name": "Klema J."
                    },
                    {
                        "name": "Merkerova M.D."
                    },
                    {
                        "name": "Rysavy P."
                    }
                ],
                "citationCount": 2,
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "circGPA: circRNA functional annotation based on probability-generating functions"
            },
            "pmcid": "PMC9513885",
            "pmid": "36167495"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
