{
    "additionDate": "2018-07-21T10:15:41Z",
    "biotoolsCURIE": "biotools:netlang",
    "biotoolsID": "netlang",
    "credit": [
        {
            "email": "lluis.barcelo@uib.cat",
            "name": "Lluís Barceló-Coblijn",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Linguistic analysis of corpora by means of complex networks.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/lluisbc/Netlang-Software"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "homepage": "https://github.com/lluisbc/Netlang-Software",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "license": "GPL-3.0",
    "name": "Netlang",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0181341",
            "metadata": {
                "abstract": "© 2017 Barceló-Coblijn et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.To date there is no software that directly connects the linguistic analysis of a conversation to a network program. Networks programs are able to extract statistical information from data basis with information about systems of interacting elements. Language has also been conceived and studied as a complex system. However, most proposals do not analyze language according to linguistic theory, but use instead computational systems that should save time at the price of leaving aside many crucial aspects for linguistic theory. Some approaches to network studies on language do apply precise linguistic analyses, made by a linguist. The problem until now has been the lack of interface between the analysis of a sentence and its integration into the network that could be managed by a linguist and that could save the analysis of any language. Previous works have used old software that was not created for these purposes and that often produced problems with some idiosyncrasies of the target language. The desired interface should be able to deal with the syntactic peculiarities of a particular language, the options of linguistic theory preferred by the user and the preservation of morpho-syntactic information (lexical categories and syntactic relations between items). Netlang is the first program able to do that. Recently, a new kind of linguistic analysis has been developed, which is able to extract a complexity pattern from the speaker’s linguistic production which is depicted as a network where words are inside nodes, and these nodes connect each other by means of edges or links (the information inside the edge can be syntactic, semantic, etc.). The Netlang software has become the bridge between rough linguistic data and the network program. Netlang has integrated and improved the functions of programs used in the past, namely the DGA annotator and two scripts (ToXML.pl and Xml2Pairs.py) used for transforming and pruning data. Netlang allows the researcher to make accurate linguistic analysis by means of syntactic dependency relations between words, while tracking record of the nature of such syntactic relationships (subject, object, etc). The Netlang software is presented as a new tool that solve many problems detected in the past. The most important improvement is that Netlang integrates three past applications into one program, and is able to produce a series of file formats that can be read by a network program. Through the Netlang software, the linguistic network analysis based on syntactic analyses, characterized for its low cost and the completely non-invasive procedure aims to evolve into a sufficiently fine grained tool for clinical diagnosis in potential cases of language disorders.",
                "authors": [
                    {
                        "name": "Barcelo-Coblijn L."
                    },
                    {
                        "name": "Serna Salazar D."
                    },
                    {
                        "name": "Isaza G."
                    },
                    {
                        "name": "Castillo Ossa L.F."
                    },
                    {
                        "name": "Bedia M.G."
                    }
                ],
                "citationCount": 1,
                "date": "2017-08-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Netlang: A software for the linguistic analysis of corpora by means of complex networks"
            },
            "pmcid": "PMC5568436",
            "pmid": "28832598"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        }
    ],
    "validated": 1
}