{
    "additionDate": "2021-01-18T10:49:48Z",
    "biotoolsCURIE": "biotools:biopetsurv",
    "biotoolsID": "biopetsurv",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "chirag.parikh@jhmi.edu",
            "name": "Chirag R. Parikh",
            "typeEntity": "Person"
        }
    ],
    "description": "BioPETsurv is a web application to evaluate biomarkers for prognostic enrichment of time-to-event clinical trials. BioPETsurv is a suite of methods for estimating these elements to evaluate a prognostic enrichment biomarker and or plan a prognostically enriched clinical trial with a time-to-event primary endpoint. BioPETsurv allows investigators to analyze data on a candidate biomarker and potentially censored survival times",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Incident curve plotting",
                    "uri": "http://edamontology.org/operation_3503"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://www.prognosticenrichment.com/surv",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-04T14:42:53Z",
    "name": "BioPETsurv",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0239486",
            "metadata": {
                "abstract": "© 2020 Cheng et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Biomarkers can be used to enrich a clinical trial for patients at higher risk for an outcome, a strategy termed \"prognostic enrichment.\" Methodology is needed to evaluate biomarkers for prognostic enrichment of trials with time-to-event endpoints such as survival. Key considerations when considering prognostic enrichment include: clinical trial sample size; the number of patients one must screen to enroll the trial; and total patient screening costs and total per-patient trial costs. The Biomarker Prognostic Enrichment Tool for Survival Outcomes (BioPETsurv) is a suite of methods for estimating these elements to evaluate a prognostic enrichment biomarker and/or plan a prognostically enriched clinical trial with a time-to-event primary endpoint. BioPETsurv allows investigators to analyze data on a candidate biomarker and potentially censored survival times. Alternatively, BioPETsurv can simulate data to match a particular clinical setting. BioPETsurv's data simulator enables investigators to explore the potential utility of a prognostic enrichment biomarker for their clinical setting. Results demonstrate that both modestly prognostic and strongly prognostic biomarkers can improve trial metrics such as reducing sample size or trial costs. In addition to the quantitative analysis provided by BioPETsurv, investigators should consider the generalizability of trial results and evaluate the ethics of trial eligibility criteria. BioPETsurv is freely available as a package for the R statistical computing platform, and as a webtool at www.prognosticenrichment.com/surv.",
                "authors": [
                    {
                        "name": "Cheng S."
                    },
                    {
                        "name": "Coca S.G."
                    },
                    {
                        "name": "Kerr K.F."
                    },
                    {
                        "name": "Parikh C.R."
                    },
                    {
                        "name": "Thiessen-Philbrook H."
                    }
                ],
                "citationCount": 1,
                "date": "2020-09-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "BioPETsurv: Methodology and open source software to evaluate biomarkers for prognostic enrichment of time-to-event clinical trials"
            },
            "pmcid": "PMC7500596",
            "pmid": "32946505"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ]
}
