{
    "accessibility": "Open access",
    "additionDate": "2022-08-29T09:21:05.474901Z",
    "biotoolsCURIE": "biotools:vqamix",
    "biotoolsID": "vqamix",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Mingzhi Mao"
        },
        {
            "name": "Guanbin Li",
            "orcidid": "https://orcid.org/0000-0002-4805-0926"
        },
        {
            "name": "Guanqi Chen",
            "orcidid": "https://orcid.org/0000-0002-1440-3340"
        },
        {
            "name": "Haifan Gong",
            "orcidid": "https://orcid.org/0000-0002-2749-6830"
        },
        {
            "name": "Zhen Li",
            "orcidid": "https://orcid.org/0000-0002-7669-2686"
        }
    ],
    "description": "Conditional Triplet Mixup for Medical Visual Question Answering.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/haifangong/VQAMix",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2022-08-29T09:21:05.477487Z",
    "license": "MIT",
    "name": "VQAMix",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1109/TMI.2022.3185008",
            "metadata": {
                "abstract": "IEEEMedical visual question answering (VQA) aims to correctly answer a clinical question related to a given medical image. Nevertheless, owing to the expensive manual annotations of medical data, the lack of labeled data limits the development of medical VQA. In this paper, we propose a simple yet effective data augmentation method, VQAMix, to mitigate the data limitation problem. Specifically, VQAMix generates more labeled training samples by linearly combining a pair of VQA samples, which can be easily embedded into any visual-language model to boost performance. However, mixing two VQA samples would construct new connections between images and questions from different samples, which will cause the answers for those new fabricated image-question pairs to be missing or meaningless. To solve the missing answer problem, we first develop the Learning with Missing Labels (LML) strategy, which roughly excludes the missing answers. To alleviate the meaningless answer issue, we design the Learning with Conditional-mixed Labels (LCL) strategy, which further utilizes language-type prior to forcing the mixed pairs to have reasonable answers that belong to the same category. Experimental results on the VQA-RAD and PathVQA benchmarks show that our proposed method significantly improves the performance of the baseline by about 7% and 5% on the averaging result of two backbones, respectively. More importantly, VQAMix could improve confidence calibration and model interpretability, which is significant for medical VQA models in practical applications. All code and models are available at https://github.com/haifangong/VQAMix.",
                "authors": [
                    {
                        "name": "Chen G."
                    },
                    {
                        "name": "Gong H."
                    },
                    {
                        "name": "Li G."
                    },
                    {
                        "name": "Li Z."
                    },
                    {
                        "name": "Mao M."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Medical Imaging",
                "title": "VQAMix: Conditional Triplet Mixup for Medical Visual Question Answering"
            },
            "pmid": "35727773"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
