{
    "additionDate": "2019-11-14T18:18:22Z",
    "biotoolsCURIE": "biotools:AutoPVS1",
    "biotoolsID": "AutoPVS1",
    "confidence_flag": "tool",
    "description": "An automatic classification tool for PVS1 interpretation of null variants | Abstract Null variants are prevalent within human genome, and their accurate interpretation is critical for clinical management. In 2018, the ClinGen Sequence Variant Interpretation (SVI) Working Group refined the only criterion (PVS1) for pathogenicity in the American College of Medical Genetics and Genomics and the Association for Molecular Pathology (ACMG AMP) guidelines. The refinement may improve interpretation consistency, but it also brings hurdles to biocurators because of the complicated workflows and multiple bioinformatics sources required. To address these issues, we developed an automatic classification tool called AutoPVS1 to streamline PVS1 interpretation. We assessed the performance of AutoPVS1 using 56 variants manually curated by ClinGen’s SVI Working Group and achieved an interpretation concordance of 95% (53 56)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant classification",
                    "uri": "http://edamontology.org/operation_3225"
                }
            ]
        }
    ],
    "homepage": "http://autopvs1.genetics.bgi.com/",
    "lastUpdate": "2020-12-02T16:53:05Z",
    "name": "AutoPVS1",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/humu.24051",
            "metadata": {
                "abstract": "© 2020 Wiley Periodicals LLCNull variants are prevalent within the human genome, and their accurate interpretation is critical for clinical management. In 2018, the ClinGen Sequence Variant Interpretation (SVI) Working Group refined the only criterion with a very strong pathogenicity rating (PVS1). To streamline PVS1 interpretation, we have developed an automatic classification tool with a graphical user interface called AutoPVS1. The performance of AutoPVS1 was assessed using 56 variants manually curated by the ClinGen's SVI Working Group; it achieved an interpretation concordance of 93% (52/56). A further analysis of 28,586 putative loss-of-function variants by AutoPVS1 demonstrated that at least 27.7% of them do not reach a very strong strength level, 17.5% because of variant-specific issues and 10.2% due to disease mechanism considerations. Notably, 41.0% (1,936/4,717) of splicing variants were assigned a decreased preliminary PVS1 strength level, a significantly greater fraction than in frameshift variants (13.2%) and nonsense variants (10.8%). Our results reinforce the necessity of considering variant-specific issues and disease mechanisms in variant interpretation and demonstrate that AutoPVS1 meets an urgent need by enabling biocurators to easily assign accurate, reliable and reproducible PVS1 strength levels in the process of variant interpretation. AutoPVS1 is publicly available at http://autopvs1.genetics.bgi.com/.",
                "authors": [
                    {
                        "name": "Xiang J."
                    },
                    {
                        "name": "Peng J."
                    },
                    {
                        "name": "Baxter S."
                    },
                    {
                        "name": "Peng Z."
                    }
                ],
                "date": "2020-09-01T00:00:00Z",
                "journal": "Human Mutation",
                "title": "AutoPVS1: An automatic classification tool for PVS1 interpretation of null variants"
            }
        }
    ],
    "topic": [
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        }
    ],
    "validated": 1
}