
{
    "credit": [
    ],
    "labels": {
        "language": [
            "MATLAB",
            "Python"
        ],
        "license": "BSD-3-Clause",
        "topic": [
            {
                "term": "Machine learning",
                "uri": "http://edamontology.org/topic_3474"
            },
            {
                "term": "Probes and primers",
                "uri": "http://edamontology.org/topic_0632"
            },
            {
                "term": "Statistics and probability",
                "uri": "http://edamontology.org/topic_2269"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019 The Authors. Published by WILEY-VCH Verlag GmbH & Co. KGaA, WeinheimDesigning future-proof materials goes beyond a quest for the best. The next generation of materials needs to be adaptive, multipurpose, and tunable. This is not possible by following the traditional experimentally guided trial-and-error process, as this limits the search for untapped regions of the solution space. Here, a computational data-driven approach is followed for exploring a new metamaterial concept and adapting it to different target properties, choice of base materials, length scales, and manufacturing processes. Guided by Bayesian machine learning, two designs are fabricated at different length scales that transform brittle polymers into lightweight, recoverable, and supercompressible metamaterials. The macroscale design is tuned for maximum compressibility, achieving strains beyond 94% and recoverable strengths around 0.1 kPa, while the microscale design reaches recoverable strengths beyond 100 kPa and strains around 80%. The data-driven code is available to facilitate future design and analysis of metamaterials and structures (https://github.com/mabessa/F3DAS).",
            "authors": [
                "Bessa M.A.",
                "Glowacki P.",
                "Houlder M."
            ],
            "cit_count": 0,
            "doi": "10.1002/ADMA.201904845",
            "journal": "Advanced Materials",
            "pmid": "31608516",
            "title": "Bayesian Machine Learning in Metamaterial Design: Fragile Becomes Supercompressible",
            "year": "2019-11-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:F3DAS",
        "biotoolsID": "F3DAS",
        "description": "Bayesian Machine Learning in Metamaterial Design.\n\nFramework for Data-Driven Design and Analysis of Structures (F3DAS).\n\nThe main code is called \"STEP1_F3DAS.m\". This code includes inputs that should be changed by the user when dealing with a new problem. The user typically needs to change the \"generate_mesh.m\" file as well, to create the parametric geometries of the structure/metamaterial that is simulated by Finite Element Analysis (FEA).\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'Bayesian Machine Learning Metamaterial Design', 'brittle', 'supercompressible', 'polymers'",
        "homepage": "https://github.com/mabessa/F3DAS",
        "name": "F3DAS"
    }
}