{
    "additionDate": "2018-07-17T14:22:04Z",
    "biotoolsCURIE": "biotools:bionanoanalyst",
    "biotoolsID": "bionanoanalyst",
    "credit": [
        {
            "email": "yuxuan.yuan@research.uwa.edu.au",
            "name": "Yuxuan Yuan",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "GUI to assess the genome assembly quality using BioNano data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/AppliedBioinformatics/BioNanoAnalyst/wiki/How-to-run-BioNanoAnalyst"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly validation",
                    "uri": "http://edamontology.org/operation_3180"
                }
            ]
        }
    ],
    "homepage": "https://github.com/AppliedBioinformatics/BioNanoAnalyst",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "BioNanoAnalyst",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s12859-017-1735-4",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: Reference genome assemblies are valuable, as they provide insights into gene content, genetic evolution and domestication. The higher the quality of a reference genome assembly the more accurate the downstream analysis will be. During the last few years, major efforts have been made towards improving the quality of genome assemblies. However, erroneous and incomplete assemblies are still common. Complementary to DNA sequencing technologies, optical mapping has advanced genomic studies by facilitating the production of genome scaffolds and assessing structural variation. However, there are few tools available to comprehensively examine misassemblies in reference genome sequences using optical map data. Results: We present BioNanoAnalyst, a software package to examine genome assemblies based on restriction endonuclease cut sites and optical map data. A graphical user interface (GUI) allows users to assess reference genome sequences on different computer platforms without the requirement of programming knowledge. The zoom function makes visualisation convenient, while a GFF3 format output file gives an option to directly visualise questionable assembly regions by location and nucleotides following import into a local genome browser. Conclusions: BioNanoAnalyst is a tool to identify misassemblies in a reference genome sequence using optical map data. With the reported information, users can rapidly identify assembly errors and correct them using other software tools, which could facilitate an accurate downstream analysis.",
                "authors": [
                    {
                        "name": "Yuan Y."
                    },
                    {
                        "name": "Bayer P.E."
                    },
                    {
                        "name": "Scheben A."
                    },
                    {
                        "name": "Chan C.-K.K."
                    },
                    {
                        "name": "Edwards D."
                    }
                ],
                "citationCount": 2,
                "date": "2017-06-30T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "BioNanoAnalyst: A visualisation tool to assess genome assembly quality using BioNano data"
            },
            "pmcid": "PMC5493081",
            "pmid": "28666410"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Quality affairs",
            "uri": "http://edamontology.org/topic_3393"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}