{
    "name": "MiRmat", 
    "description": "MiRmat is a software designed to predict mature microRNA from pri-microRNA. This tool can be divided into two parts, one is for predicting Drosha processing site, which is based on energy distribution pattern along primary microRNA’s secondary structure; the other is for predicting Dicer processing site, which is based on precursor microRNA’s structure feature", 
    "homepage": "http://mcube.nju.edu.cn/jwang/lab/soft/MiRmat/index.html", 
    "biotoolsID": "mirmat", 
    "biotoolsCURIE": "biotools:mirmat", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0278", 
                    "term": "RNA secondary structure prediction"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0659", 
            "term": "Functional, regulatory and non-coding RNA"
        }, 
        {
            "uri": "http://edamontology.org/topic_0099", 
            "term": "RNA"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "MATLAB", 
        "Perl"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/mirmat-predict-mature-microrna-pri-microrna.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://mcube.nju.edu.cn/jwang/lab/soft/MiRmat/help.html", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "23300555", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "MiRmat: Mature microRNA Sequence Prediction", 
                "abstract": "Background: MicroRNAs are known to be generated from primary transcripts mainly through the sequential cleavages by two enzymes, Drosha and Dicer. The sequence of a mature microRNA, especially the 'seeding sequence', largely determines its binding ability and specificity to target mRNAs. Therefore, methods that predict mature microRNA sequences with high accuracy will benefit the identification and characterization of novel microRNAs and their targets, and contribute to inferring the post-transcriptional regulation network at a genome scale. Methodology/Principal Findings: We have developed a method, MiRmat, to predict the mature microRNA sequence. MiRmat is essentially composed of two parts: the prediction of Drosha processing site and the identification of Dicer processing site. Based on the analysis of microRNAs from 12 species, we found that the patterns of free energy profiles are conserved among vertebrate microRNA hairpins. Therefore, we introduced in our method the free energy distribution pattern of the downstream part of pri-microRNA secondary structure and Random Forest algorithm to predict the mature microRNA sequence. Based on the evaluation on an independent test dataset from 10 vertebrates, MiRmat was shown to identify 77.8% of the Drosha processing sites and 92.8% of the Dicer sites within a deviation of 2 nt. In a more stringent evaluation by excluding the microRNAs sharing the same family between the training set and test set, MiRmat kept a rather well performance of 71.9% and 87.2% of the identification rate on the Drosha and Dicer site respectively, which represents the ability to deal with the novel microRNA family. MiRmat outperforms other state-of-the-art methods and has a high degree of efficacy for the prediction of mature microRNA sequences of vertebrates. Conclusion: MiRmat was developed for identifying microRNA mature sequence(s) by introducing the free energy distribution of RNA stem-loop structure and the Random Forest algorithm. We prove that MiRmat has better performance than the existing tools and is applicable among vertebrates. MiRmat is freely available at http://mcube.nju.edu.cn/jwang/lab/soft/MiRmat/. © 2012 He et al.", 
                "date": "2012-12-27T00:00:00Z", 
                "citationCount": 16, 
                "authors": [
                    {
                        "name": "He C."
                    }, 
                    {
                        "name": "Li Y.-X."
                    }, 
                    {
                        "name": "Zhang G."
                    }, 
                    {
                        "name": "Gu Z."
                    }, 
                    {
                        "name": "Yang R."
                    }, 
                    {
                        "name": "Li J."
                    }, 
                    {
                        "name": "Lu Z.J."
                    }, 
                    {
                        "name": "Zhou Z.-H."
                    }, 
                    {
                        "name": "Zhang C."
                    }, 
                    {
                        "name": "Wang J."
                    }
                ], 
                "journal": "PLoS ONE"
            }
        }
    ], 
    "credit": [
        {
            "name": "Prof. J.Wang (Other)", 
            "email": "jwang@nju.edu.cn", 
            "url": "http://mcube.nju.edu.cn/jwang/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }, 
        {
            "name": "Chenfeng He (suggestions on online tool)", 
            "email": "hechenfon@163.com", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T18:51:25Z", 
    "lastUpdate": "2018-12-10T12:58:49Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}