{
    "additionDate": "2021-01-18T07:05:22Z",
    "biotoolsCURIE": "biotools:pykneer",
    "biotoolsID": "pykneer",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "serena.bonaretti.research@gmail.com",
            "name": "Serena Bonaretti",
            "typeEntity": "Person"
        }
    ],
    "description": "An image analysis workflow for open and reproducible research on femoral knee cartilage.\n\nTransparent research in musculoskeletal imaging is fundamental to reliably investigate diseases such as knee osteoarthritis (OA), a chronic disease impairing femoral knee cartilage. To study cartilage degeneration, researchers have developed algorithms to segment femoral knee cartilage from magnetic resonance (MR) images and to measure cartilage morphology and relaxometry. The majority of these algorithms are not publicly available or require advanced programming skills to be compiled and run. However, to accelerate discoveries and findings, it is crucial to have open and reproducible workflows. We present pyKNEEr, a framework for open and reproducible research on femoral knee cartilage from MR images. pyKNEEr is written in python, uses Jupyter notebook as a user interface, and is available on GitHub with a GNU GPLv3 license",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://sbonaretti.github.io/pyKNEEr/index.html",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-30T16:17:18Z",
    "license": "GPL-3.0",
    "name": "pyKNEEr",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0226501",
            "metadata": {
                "abstract": "© 2020 Public Library of Science. All rights reserved.Transparent research in musculoskeletal imaging is fundamental to reliably investigate diseases such as knee osteoarthritis (OA), a chronic disease impairing femoral knee cartilage. To study cartilage degeneration, researchers have developed algorithms to segment femoral knee cartilage from magnetic resonance (MR) images and to measure cartilage morphology and relaxometry. The majority of these algorithms are not publicly available or require advanced programming skills to be compiled and run. However, to accelerate discoveries and findings, it is crucial to have open and reproducible workflows. We present pyKNEEr, a framework for open and reproducible research on femoral knee cartilage from MR images. pyKNEEr is written in python, uses Jupyter notebook as a user interface, and is available on GitHub with a GNU GPLv3 license. It is composed of three modules: 1) image preprocessing to standardize spatial and intensity characteristics; 2) femoral knee cartilage segmentation for intersubject, multimodal, and longitudinal acquisitions; and 3) analysis of cartilage morphology and relaxometry. Each module contains one or more Jupyter notebooks with narrative, code, visualizations, and dependencies to reproduce computational environments. pyKNEEr facilitates transparent image-based research of femoral knee cartilage because of its ease of installation and use, and its versatility for publication and sharing among researchers. Finally, due to its modular structure, pyKNEEr favors code extension and algorithm comparison. We tested our reproducible workflows with experiments that also constitute an example of transparent research with pyKNEEr, and we compared pyKNEEr performances to existing algorithms in literature review visualizations. We provide links to executed notebooks and executable environments for immediate reproducibility of our findings.",
                "authors": [
                    {
                        "name": "Beaupre G.S."
                    },
                    {
                        "name": "Bonaretti S."
                    },
                    {
                        "name": "Gold G.E."
                    }
                ],
                "citationCount": 5,
                "date": "2020-01-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "PyKNEEr: An image analysis workflow for open and reproducible research on femoral knee cartilage"
            },
            "pmcid": "PMC6980400",
            "pmid": "31978052"
        }
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
