{
    "additionDate": "2023-01-28T15:04:30.257808Z",
    "biotoolsCURIE": "biotools:hnc-predictor",
    "biotoolsID": "hnc-predictor",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Clifton D. Fuller"
        }
    ],
    "description": "Development, international multi-institutional validation, and web implementation of clinic-ready model-based risk stratification for head and neck cancer', 'clinic-ready'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "https://uic-evl.github.io/hnc-predictor/",
    "lastUpdate": "2023-01-28T15:04:30.260262Z",
    "license": "Not licensed",
    "name": "HNC-PREDICTOR",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.EJCA.2022.10.011",
            "metadata": {
                "abstract": "© 2022 The AuthorsBackground: Personalised radiotherapy can improve treatment outcomes of patients with head and neck cancer (HNC), where currently a ‘one-dose-fits-all’ approach is the standard. The aim was to establish individualised outcome prediction based on multi-institutional international ‘big-data’ to facilitate risk-based stratification of patients with HNC. Methods: The data of 4611 HNC radiotherapy patients from three academic cancer centres were split into four cohorts: a training (n = 2241), independent test (n = 786), and external validation cohorts 1 (n = 1087) and 2 (n = 497). Tumour- and patient-related clinical variables were considered in a machine learning pipeline to predict overall survival (primary end-point) and local and regional tumour control (secondary end-points); serially, imaging features were considered for optional model improvement. Finally, patients were stratified into high-, intermediate-, and low-risk groups. Results: Performance score, AJCC8th stage, pack-years, and Age were identified as predictors for overall survival, demonstrating good performance in both the training cohort (c-index = 0.72 [95% CI, 0.66–0.77]) and in all three validation cohorts (c-indices: 0.76 [0.69–0.83], 0.73 [0.68–0.77], and 0.75 [0.68–0.80]). Excellent stratification of patients with HNC into high, intermediate, and low mortality risk was achieved; with 5-year overall survival rates of 17–46% for the high-risk group compared to 92–98% for the low-risk group. The addition of morphological image feature further improved the performance (c-index = 0.73 [0.64–0.81]). These models are integrated in a clinic-ready interactive web interface: https://uic-evl.github.io/hnc-predictor/ Conclusions: Robust model-based prediction was able to stratify patients with HNC in distinct high, intermediate, and low mortality risk groups. This can effectively be capitalised for personalised radiotherapy, e.g., for tumour radiation dose escalation/de-escalation.",
                "authors": [
                    {
                        "name": "Ahmed S."
                    },
                    {
                        "name": "Fuller C.D."
                    },
                    {
                        "name": "Garden A.S."
                    },
                    {
                        "name": "Gunn B."
                    },
                    {
                        "name": "Hope A.J."
                    },
                    {
                        "name": "Langendijk J.A."
                    },
                    {
                        "name": "Marai G.E."
                    },
                    {
                        "name": "Mohamed A.S."
                    },
                    {
                        "name": "Moreno A."
                    },
                    {
                        "name": "Nipu N."
                    },
                    {
                        "name": "Sijtsema N.M."
                    },
                    {
                        "name": "Wahid K."
                    },
                    {
                        "name": "van Dijk L.V."
                    }
                ],
                "date": "2023-01-01T00:00:00Z",
                "journal": "European Journal of Cancer",
                "title": "Head and neck cancer predictive risk estimator to determine control and therapeutic outcomes of radiotherapy (HNC-PREDICTOR): development, international multi-institutional validation, and web implementation of clinic-ready model-based risk stratification for head and neck cancer"
            },
            "pmid": "36442460"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}
