{"credit":[{"email":"huxihao@gmail.com","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://github.com/huxihao/ProbRNA"}],"function":[{"operation":[{"term":"RNA structure prediction","uri":"http://edamontology.org/operation_2441"}]}],"labels":{"language":["R","Perl"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"RNA","uri":"http://edamontology.org/topic_0099"},{"term":"Structure prediction","uri":"http://edamontology.org/topic_0082"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/probrna-1-0-modeling-rna-structure-probing-data.html"}],"publication":[{"abstract":"Motivation: High-throughput sequencing has been used to probe RNA structures, by treating RNAs with reagents that preferentially cleave or mark certain nucleotides according to their local structures, followed by sequencing of the resulting fragments. The data produced contain valuable information for studying various RNA properties.Results: We developed methods for statistically modeling these structure-probing data and extracting structural features from them. We show that the extracted features can be used to predict RNA 'zipcodes' in yeast, regions bound by the She complex in asymmetric localization. The prediction accuracy was better than using raw RNA probing data or sequence features. We further demonstrate the use of the extracted features in identifying binding sites of RNA binding proteins from whole-transcriptome global photoactivatable-ribonucleoside-enhanced cross-linking and immunopurification (gPAR-CLIP) data. © 2014 The Author.","authors":["Hu X.","Wong T.K.F.","Lu Z.J.","Chan T.F.","Lau T.C.K.","Yiu S.M.","Yip K.Y."],"cit_count":2,"journal":"Bioinformatics","pmid":"24376038","title":"Computational identification of protein binding sites on RNAs using high-throughput RNA structure-probing data","year":"2014-01-01"}],"summary":{"biotoolsCURIE":"biotools:probrna","biotoolsID":"probrna","description":"Produce features found to be related to both the secondary and tertiary structures of the RNAs.","homepage":"http://hkbic.cuhk.edu.hk/software/probrna","name":"ProbRNA"}}