{
    "accessibility": "Open access",
    "additionDate": "2022-06-09T08:03:57.782194Z",
    "biotoolsCURIE": "biotools:bacpi",
    "biotoolsID": "bacpi",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "limin@mail.csu.edu.cn",
            "name": "Min Li",
            "typeEntity": "Person"
        }
    ],
    "description": "A bi-directional attention neural network for compound-protein interaction and binding affinity prediction.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein interaction network prediction",
                    "uri": "http://edamontology.org/operation_3094"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                }
            ]
        }
    ],
    "homepage": "https://github.com/CSUBioGroup/BACPI",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-06-09T08:03:57.786100Z",
    "license": "Not licensed",
    "name": "BACPI",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAC035",
            "metadata": {
                "abstract": "© 2022 The Author(s) 2022. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: The identification of compound-protein interactions (CPIs) is an essential step in the process of drug discovery. The experimental determination of CPIs is known for a large amount of funds and time it consumes. Computational model has therefore become a promising and efficient alternative for predicting novel interactions between compounds and proteins on a large scale. Most supervised machine learning prediction models are approached as a binary classification problem, which aim to predict whether there is an interaction between the compound and the protein or not. However, CPI is not a simple binary on-off relationship, but a continuous value reflects how tightly the compound binds to a particular target protein, also called binding affinity. Results: In this study, we propose an end-to-end neural network model, called BACPI, to predict CPI and binding affinity. We employ graph attention network and convolutional neural network (CNN) to learn the representations of compounds and proteins and develop a bi-directional attention neural network model to integrate the representations. To evaluate the performance of BACPI, we use three CPI datasets and four binding affinity datasets in our experiments. The results show that, when predicting CPIs, BACPI significantly outperforms other available machine learning methods on both balanced and unbalanced datasets. This suggests that the end-to-end neural network model that predicts CPIs directly from low-level representations is more robust than traditional machine learning-based methods. And when predicting binding affinities, BACPI achieves higher performance on large datasets compared to other state-of-the-art deep learning methods. This comparison result suggests that the proposed method with bi-directional attention neural network can capture the important regions of compounds and proteins for binding affinity prediction.",
                "authors": [
                    {
                        "name": "Li M."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Lu Z."
                    },
                    {
                        "name": "Wu Y."
                    }
                ],
                "citationCount": 1,
                "date": "2022-04-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "BACPI: A bi-directional attention neural network for compound-protein interaction and binding affinity prediction"
            },
            "pmid": "35043942"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
