{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:21:11Z",
    "biotoolsCURIE": "biotools:Sci-LMM",
    "biotoolsID": "Sci-LMM",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "iris.kalka@weizmann.ac.il",
            "name": "I. Kalka",
            "orcidid": "https://orcid.org/0000-0003-1432-7461",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Modeling framework for studying population-scale family trees that combines techniques from the animal and plant breeding literature and from human genetics literature.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/TalShor/SciLMM/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/TalShor/SciLMM",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:26Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/TalShor/SciLMM/issues"
        }
    ],
    "maturity": "Mature",
    "name": "Sci-LMM",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PGEN.1008124",
            "metadata": {
                "abstract": "© 2019 Shor et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.The rapid digitization of genealogical and medical records enables the assembly of extremely large pedigree records spanning millions of individuals and trillions of pairs of relatives. Such pedigrees provide the opportunity to investigate the sociological and epidemiological history of human populations in scales much larger than previously possible. Linear mixed models (LMMs) are routinely used to analyze extremely large animal and plant pedigrees for the purposes of selective breeding. However, LMMs have not been previously applied to analyze population-scale human family trees. Here, we present Sparse Cholesky factorIzation LMM (Sci-LMM), a modeling framework for studying population-scale family trees that combines techniques from the animal and plant breeding literature and from human genetics literature. The proposed framework can construct a matrix of relationships between trillions of pairs of individuals and fit the corresponding LMM in several hours. We demonstrate the capabilities of Sci-LMM via simulation studies and by estimating the heritability of longevity and of reproductive fitness (quantified via number of children) in a large pedigree spanning millions of individuals and over five centuries of human history. Sci-LMM provides a unified framework for investigating the epidemiological history of human populations via genealogical records.",
                "authors": [
                    {
                        "name": "Shor T."
                    },
                    {
                        "name": "Kalka I."
                    },
                    {
                        "name": "Geiger D."
                    },
                    {
                        "name": "Erlich Y."
                    },
                    {
                        "name": "Weissbrod O."
                    }
                ],
                "citationCount": 4,
                "date": "2019-01-01T00:00:00Z",
                "journal": "PLoS Genetics",
                "title": "Estimating variance components in population scale family trees"
            },
            "pmcid": "PMC6529016",
            "pmid": "31071088",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ],
    "validated": 1
}