{"credit":[{"email":"1987ccpacer@163.com","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://bioinfo.hupo.org.cn/silver/Contact.php"},{"email":"zjjyyang@163.com","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://bioinfo.hupo.org.cn/silver/"}],"function":[{"operation":[{"term":"SILAC","uri":"http://edamontology.org/operation_3638"}]}],"labels":{"collectionID":["Proteomics"],"language":["C++"],"operatingSystem":["Windows"],"toolType":["Desktop application"],"topic":[{"term":"Biomarkers","uri":"http://edamontology.org/topic_3360"},{"term":"Proteomics","uri":"http://edamontology.org/topic_0121"},{"term":"Proteomics experiment","uri":"http://edamontology.org/topic_3520"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/silver-1-1-stable-isotope-labeling-lc-ms-data-quantitative-analysis-with-quality-control-methods.html"}],"publication":[{"abstract":"Summary: With the advance of experimental technologies, different stable isotope labeling methods have been widely applied to quantitative proteomics. Here, we present an efficient tool named SILVER for processing the stable isotope labeling mass spectrometry data. SILVER implements novel methods for quality control of quantification at spectrum, peptide and protein levels, respectively. Several new quantification confidence filters and indices are used to improve the accuracy of quantification results. The performance of SILVER was verified and compared with MaxQuant and Proteome Discoverer using a large-scale dataset and two standard datasets. The results suggest that SILVER shows high accuracy and robustness while consuming much less processing time. Additionally, SILVER provides user-friendly interfaces for parameter setting, result visualization, manual validation and some useful statistics analyses.Availability and implementation: SILVER and its source codes are freely available under the GNU General Public License v3.0 at http://bioinfo.hupo.org. cn/silver.Contact:, hefc@nic.bmi.ac.cn and xhwei65@163.comSupplementary information: Supplementary data are available at Bioinformatics online © 2013 The Author.","authors":["Chang C.","Zhang J.","Han M.","Ma J.","Zhang W.","Wu S.","Liu K.","Xie H.","He F.","Zhu Y."],"cit_count":12,"journal":"Bioinformatics","pmid":"24344194","title":"SILVER: An efficient tool for stable isotope labeling LC-MS data quantitative analysis with quality control methods","year":"2014-02-15"}],"summary":{"biotoolsCURIE":"biotools:silver","biotoolsID":"silver","description":"An efficient tool for quantification of the stable isotope labeling mass spectrometry data. It implements novel methods for quality control of quantification at spectrum, peptide and protein levels respectively. Several new confidence filters and indices are applied to improve the accuracy of quantification results.","homepage":"http://bioinfo.hupo.org.cn/silver/","name":"SILVER"}}