
{
    "credit": [
        {
            "email": "afsar@pieas.edu.pk",
            "name": "Fayyaz-ul-Amir Afsar Minhas",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://camels.pythonanywhere.com/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Protein binding sites",
                "uri": "http://edamontology.org/topic_3534"
            },
            {
                "term": "Protein interactions",
                "uri": "http://edamontology.org/topic_0128"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2017 Wiley Periodicals, Inc. Due to Ca2+-dependent binding and the sequence diversity of Calmodulin (CaM) binding proteins, identifying CaM interactions and binding sites in the wet-lab is tedious and costly. Therefore, computational methods for this purpose are crucial to the design of such wet-lab experiments. We present an algorithm suite called CaMELS (CalModulin intEraction Learning System) for predicting proteins that interact with CaM as well as their binding sites using sequence information alone. CaMELS offers state of the art accuracy for both CaM interaction and binding site prediction and can aid biologists in studying CaM binding proteins. For CaM interaction prediction, CaMELS uses protein sequence features coupled with a large-margin classifier. CaMELS models the binding site prediction problem using multiple instance machine learning with a custom optimization algorithm which allows more effective learning over imprecisely annotated CaM-binding sites during training. CaMELS has been extensively benchmarked using a variety of data sets, mutagenic studies, proteome-wide Gene Ontology enrichment analyses and protein structures. Our experiments indicate that CaMELS outperforms simple motif-based search and other existing methods for interaction and binding site prediction. We have also found that the whole sequence of a protein, rather than just its binding site, is important for predicting its interaction with CaM. Using the machine learning model in CaMELS, we have identified important features of protein sequences for CaM interaction prediction as well as characteristic amino acid sub-sequences and their relative position for identifying CaM binding sites. Python code for training and evaluating CaMELS together with a webserver implementation is available at the URL: http://faculty.pieas.edu.pk/fayyaz/software.html#camels.",
            "authors": [
                "Abbasi W.A.",
                "Asif A.",
                "Andleeb S.",
                "Minhas F.U.A.A."
            ],
            "cit_count": 1,
            "doi": "10.1002/PROT.25330",
            "journal": "Proteins: Structure, Function and Bioinformatics",
            "pmid": "28598584",
            "title": "CaMELS: In silico prediction of calmodulin binding proteins and their binding sites",
            "year": "2017-09-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:camels",
        "biotoolsID": "camels",
        "description": "In silico prediction of calmodulin binding proteins and their binding sites.",
        "homepage": "https://camels.pythonanywhere.com/",
        "name": "CaMELS"
    }
}