{
    "additionDate": "2020-01-09T17:32:53Z",
    "biotoolsCURIE": "biotools:SwiftOrtho",
    "biotoolsID": "SwiftOrtho",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "idoerg@iastate.edu",
            "name": "Iddo Friedberg",
            "orcidid": "https://orcid.org/0000-0002-1789-8000",
            "typeEntity": "Person"
        }
    ],
    "description": "A fast, memory-efficient, multiple genome orthology classifier.\n\nA high performance tool to identify orthologs and paralogs across genomes.\n\nSwiftOrtho is orthology analysis tool which identifies orthologs, paralogs and co-orthologs for genomes. It is a graph-based approach",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic footprinting",
                    "uri": "http://edamontology.org/operation_0327"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Phylogenetic species tree construction",
                    "uri": "http://edamontology.org/operation_0544"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Rinoahu/SwiftOrtho",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-27T12:58:29Z",
    "license": "GPL-3.0",
    "name": "SwiftOrtho",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/GIGASCIENCE/GIZ118",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Background: Gene homology type classification is required for many types of genome analyses, including comparative genomics, phylogenetics, and protein function annotation. Consequently, a large variety of tools have been developed to perform homology classification across genomes of different species. However, when applied to large genomic data sets, these tools require high memory and CPU usage, typically available only in computational clusters. Findings: Here we present a new graph-based orthology analysis tool, SwiftOrtho, which is optimized for speed and memory usage when applied to large-scale data. SwiftOrtho uses long k-mers to speed up homology search, while using a reduced amino acid alphabet and spaced seeds to compensate for the loss of sensitivity due to long k-mers. In addition, it uses an affinity propagation algorithm to reduce the memory usage when clustering large-scale orthology relationships into orthologous groups. In our tests, SwiftOrtho was the only tool that completed orthology analysis of proteins from 1,760 bacterial genomes on a computer with only 4 GB RAM. Using various standard orthology data sets, we also show that SwiftOrtho has a high accuracy. Conclusions: SwiftOrtho enables the accurate comparative genomic analyses of thousands of genomes using low-memory computers. SwiftOrtho is available at https://github.com/Rinoahu/SwiftOrtho",
                "authors": [
                    {
                        "name": "Hu X."
                    },
                    {
                        "name": "Friedberg I."
                    }
                ],
                "citationCount": 6,
                "date": "2019-10-01T00:00:00Z",
                "journal": "GigaScience",
                "title": "SwiftOrtho: A fast, memory-efficient, multiple genome orthology classifier"
            },
            "pmcid": "PMC6812468",
            "pmid": "31648300"
        }
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Gene structure",
            "uri": "http://edamontology.org/topic_0114"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ],
    "validated": 1
}