{
    "additionDate": "2022-09-26T06:18:10.063686Z",
    "biotoolsCURIE": "biotools:elssi",
    "biotoolsID": "elssi",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "kingjun@sdu.edu.cn",
            "name": "Jun Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "Ensemble learning-based approach (ELSSI): parallel SNP-SNP interactions detection by ensemble multi-type detectors.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "SNP annotation",
                    "uri": "http://edamontology.org/operation_3661"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                }
            ]
        }
    ],
    "homepage": "https://www.sdu-idea.cn/codes.php?name=ELSSI",
    "lastUpdate": "2022-09-26T06:18:10.066157Z",
    "name": "ELSSI",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAC213",
            "metadata": {
                "abstract": "© 2022 The Author(s). Published by Oxford University Press. All rights reserved.With the development of high-throughput genotyping technology, single nucleotide polymorphism (SNP)-SNP interactions (SSIs) detection has become an essential way for understanding disease susceptibility. Various methods have been proposed to detect SSIs. However, given the disease complexity and bias of individual SSI detectors, these single-detector-based methods are generally unscalable for real genome-wide data and with unfavorable results. We propose a novel ensemble learning-based approach (ELSSI) that can significantly reduce the bias of individual detectors and their computational load. ELSSI randomly divides SNPs into different subsets and evaluates them by multi-type detectors in parallel. Particularly, ELSSI introduces a four-stage pipeline (generate, score, switch and filter) to iteratively generate new SNP combination subsets from SNP subsets, score the combination subset by individual detectors, switch high-score combinations to other detectors for re-scoring, then filter out combinations with low scores. This pipeline makes ELSSI able to detect high-order SSIs from large genome-wide datasets. Experimental results on various simulated and real genome-wide datasets show the superior efficacy of ELSSI to state-of-the-art methods in detecting SSIs, especially for high-order ones. ELSSI is applicable with moderate PCs on the Internet and flexible to assemble new detectors. The code of ELSSI is available at https://www.sdu-idea.cn/codes.php?name=ELSSI.",
                "authors": [
                    {
                        "name": "Cao X."
                    },
                    {
                        "name": "Feng Y."
                    },
                    {
                        "name": "Guo M."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Yu G."
                    }
                ],
                "date": "2022-07-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "ELSSI: Parallel SNP-SNP interactions detection by ensemble multi-type detectors"
            },
            "pmid": "35696639"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ]
}
