{
    "additionDate": "2017-01-13T13:16:55Z",
    "biotoolsCURIE": "biotools:unoseq",
    "biotoolsID": "unoseq",
    "credit": [
        {
            "name": "Fabian Birzele",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://sourceforge.net/u/birzele/profile/"
        }
    ],
    "description": "Java library to analyze next generation sequencing data (e.g. data generated by Illumina's mRNAseq method) and especially perform expression profiling in organisms where no well-annotated reference genome exists.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Sequence annotation",
                    "uri": "http://edamontology.org/operation_0361"
                }
            ]
        }
    ],
    "homepage": "http://sourceforge.net/projects/unoseq/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:54Z",
    "name": "UnoSeq",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "doi": "10.1093/nar/gkq116",
            "metadata": {
                "abstract": "The arrival of next-generation sequencing (NGS) technologies has led to novel opportunities for expression profiling and genome analysis by utilizing vast amounts of short read sequence data. Here, we demonstrate that expression profiling in organisms lacking any genome or transcriptome sequence information is feasible by combining Illumina's mRNA-seq technology with a novel bioinformatics pipeline that integrates assembled and annotated Chinese hamster ovary (CHO) sequences with information derived from related organisms. We applied this pipeline to the analysis of CHO cells which were chosen as a model system owing to its relevance in the production of therapeutic proteins. Specifically, we analysed CHO cells undergoing butyrate treatment which is known to affect cell cycle regulation and to increase the specific productivity of recombinant proteins. By this means, we identified sequences for >13 000 CHO genes which added sequence information of ~5000 novel genes to the CHO model. More than 6000 transcript sequences are predicted to be complete, as they covered >95% of the corresponding mouse orthologs. Detailed analysis of selected biological functions such as DNA replication and cell cycle control, demonstrated the potential of NGS expression profiling in organisms without extended genome sequence to improve both data quantity and quality. © The Author(s) 2010. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Birzele F."
                    },
                    {
                        "name": "Schaub J."
                    },
                    {
                        "name": "Rust W."
                    },
                    {
                        "name": "Clemens C."
                    },
                    {
                        "name": "Baum P."
                    },
                    {
                        "name": "Kaufmann H."
                    },
                    {
                        "name": "Weith A."
                    },
                    {
                        "name": "Schulz T.W."
                    },
                    {
                        "name": "Hildebrandt T."
                    }
                ],
                "citationCount": 75,
                "date": "2010-02-27T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Into the unknown: Expression profiling without genome sequence information in CHO by next generation sequencing"
            },
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ],
    "validated": 1
}