{
    "additionDate": "2017-08-03T18:55:32Z",
    "biotoolsCURIE": "biotools:peptidereranking",
    "biotoolsID": "peptidereranking",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "email": "yorkey@ust.hk",
            "name": "Chao Yang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://bioinformatics.ust.hk/"
        }
    ],
    "description": "Includes three peptide reranking methods: PPMRanker, PPIRanker, and MIRanker. PPMRanker only uses Protein-Peptide Map (PPM) information from the protein database, PPIRanker only uses Precursor Peak Intensity (PPI) information, and MIRanker employs both PPM information and PPI information.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bioinformatics.ust.hk/pepreranking/"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Classification",
                    "uri": "http://edamontology.org/operation_2990"
                }
            ]
        }
    ],
    "homepage": "http://bioinformatics.ust.hk/pepreranking/",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2024-11-25T14:12:32.265154Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/peptidereranking-peptide-re-ranking-with-protein-peptide-correspondence-and-precursor-peak-intensity-information.html"
        }
    ],
    "name": "PeptideReranking",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1109/tcbb.2012.29",
            "metadata": {
                "abstract": "Searching tandem mass spectra against a protein database has been a mainstream method for peptide identification. Improving peptide identification results by ranking true Peptide-Spectrum Matches (PSMs) over their false counterparts leads to the development of various reranking algorithms. In peptide reranking, discriminative information is essential to distinguish true PSMs from false PSMs. Generally, most peptide reranking methods obtain discriminative information directly from database search scores or by training machine learning models. Information in the protein database and MS1 spectra (i.e., single stage MS spectra) is ignored. In this paper, we propose to use information in the protein database and MS1 spectra to rerank peptide identification results. To quantitatively analyze their effects to peptide reranking results, three peptide reranking methods are proposed: PPMRanker, PPIRanker, and MIRanker. PPMRanker only uses Protein-Peptide Map (PPM) information from the protein database, PPIRanker only uses Precursor Peak Intensity (PPI) information, and MIRanker employs both PPM information and PPI information. According to our experiments on a standard protein mixture data set, a human data set and a mouse data set, PPMRanker and MIRanker achieve better peptide reranking results than PetideProphet, PeptideProphet+NSP (number of sibling peptides) and a score regularization method SRPI. The source codes of PPMRanker, PPIRanker, and MIRanker, and all supplementary documents are available at our website: http://bioinformatics.ust.hk/pepreranking/. Alternatively, these documents can also be downloaded from: http://sourceforge. net/projects/pepreranking/. © 2012 IEEE.",
                "authors": [
                    {
                        "name": "He Z."
                    },
                    {
                        "name": "Yang C."
                    },
                    {
                        "name": "Yang C."
                    },
                    {
                        "name": "Yu W."
                    }
                ],
                "citationCount": 1,
                "date": "2012-05-31T00:00:00Z",
                "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
                "title": "Peptide reranking with protein-peptide correspondence and precursor peak intensity information"
            },
            "pmid": "22350209"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
