{
    "additionDate": "2017-02-10T11:35:51Z",
    "biotoolsCURIE": "biotools:ndb_tools",
    "biotoolsID": "ndb_tools",
    "credit": [
        {
            "email": "ndbadmin@ndbserver.rutgers.edu",
            "name": "NDB Admin",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The Nucleic Acid Database (NDB) Tools page includes RNAView and BPView, programs for the visualization and classification of RNA base pairs, motifs, and structures.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://ndbserver.rutgers.edu/ndbmodule/about_ndb/about.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                },
                {
                    "term": "Nucleic acid structure prediction",
                    "uri": "http://edamontology.org/operation_0475"
                },
                {
                    "term": "Nucleic acid structure analysis",
                    "uri": "http://edamontology.org/operation_2481"
                },
                {
                    "term": "Nucleic acid folding analysis",
                    "uri": "http://edamontology.org/operation_0279"
                }
            ]
        }
    ],
    "homepage": "http://ndbserver.rutgers.edu/ndbmodule/services/index.html",
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "NDB Tools",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "authors": [
                    {
                        "name": "Berman H.M."
                    },
                    {
                        "name": "Olson W.K."
                    },
                    {
                        "name": "Beveridge D.L."
                    },
                    {
                        "name": "Westbrook J."
                    },
                    {
                        "name": "Gelbin A."
                    },
                    {
                        "name": "Demeny T."
                    },
                    {
                        "name": "Hsieh S.H."
                    },
                    {
                        "name": "Srinivasan A.R."
                    },
                    {
                        "name": "Schneider B."
                    }
                ],
                "citationCount": 798,
                "date": "1992-01-01T00:00:00Z",
                "journal": "Biophysical Journal",
                "title": "The nucleic acid database. A comprehensive relational database of three-dimensional structures of nucleic acids"
            },
            "pmid": "1384741"
        },
        {
            "metadata": {
                "abstract": "Three programs have been developed to aid in the classification and visualization of RNA structure. BPViewer provides a web interface for displaying three-dimensional (3D) coordinates of individual base pairs or base pair collections. A web server, RNAview, automatically identifies and classifies the types of base pairs that are formed in nucleic acid structures by various combinations of the three edges, Watson-Crick, Hoogsteen and the Sugar edge. RNAView produces two-dimensional (2D) diagrams of secondary and tertiary structure in either Postscript, VRML or RNAML formats. The application RNAMLview can be used to rearrange various parts of the RNAView 2D diagram to generate a standard representation (like the cloverleaf structure of tRNAs) or any layout desired by the user. A 2D diagram can be rapidly reformatted using RNAMLview since all the parts of RNA (like helices and single strands) are dynamically linked while moving the selected parts. With the base pair annotation and the 2D graphic display, RNA motifs are rapidly identified and classified. A survey has been carried out for 41 unique structures selected from the NDB database. The statistics for the occurrence of each edge and of each of the 12 bp families are given for the combinations of the four bases: A, G, U and C. The program also allows for visualization of the base pair interactions by using a symbolic convention previously proposed for base pairs. The web servers for BPViewer and RNAview are available at http://ndbserver.rutgers.edu/services/. The application RNAMLview can also be downloaded from this site. The 2D diagrams produced by RNAview are available for RNA structures in the Nucleic Acid Database (NDB) at http://ndbserver.rutgers.edu/atlas/.",
                "authors": [
                    {
                        "name": "Yang H."
                    },
                    {
                        "name": "Jossinet F."
                    },
                    {
                        "name": "Leontis N."
                    },
                    {
                        "name": "Chen L."
                    },
                    {
                        "name": "Westbrook J."
                    },
                    {
                        "name": "Berman H."
                    },
                    {
                        "name": "Westhof E."
                    }
                ],
                "citationCount": 186,
                "date": "2003-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Tools for the automatic identification and classification of RNA base pairs"
            },
            "pmid": "12824344"
        },
        {
            "metadata": {
                "abstract": "Non-Watson-Crick base pairs mediate specific interactions responsible for RNA-RNA self-assembly and RNA-protein recognition. An unambiguous and descriptive nomenclature with well-defined and nonoverlapping parameters is needed to communicate concisely structural information about RNA base pairs. The definitions should reflect underlying molecular structures and interactions and, thus, facilitate automated annotation, classification, and comparison of new RNA structures. We propose a classification based on the observation that the planar edge-to-edge, hydrogen-bonding interactions between RNA bases involve one of three distinct edges: the Watson-Crick edge, the Hoogsteen edge, and the Sugar edge (which includes the 2′-OH and which has also been referred to as the Shallow-groove edge). Bases can interact in either of two orientations with respect to the glycosidic bonds, cis or trans relative to the hydrogen bonds. This gives rise to 12 basic geometric types with at least two H bonds connecting the bases. For each geometric type, the relative orientations of the strands can be easily deduced. High-resolution examples of 11 of the 12 geometries are presently available. Bifurcated pairs, in which a single exocyclic carbonyl or amino group of one base directly contacts the edge of a second base, and water-inserted pairs, in which single functional groups on each base interact directly, are intermediate between two of the standard geometries. The nomenclature facilitates the recognition of isosteric relationships among base pairs within each geometry, and thus facilitates the recognition of recurrent three-dimensional motifs from comparison of homologous sequences. Graphical conventions are proposed for displaying non-Watson-Crick interactions on a secondary structure diagram. The utility of the classification in homology modeling of RNA tertiary motifs is illustrated.",
                "authors": [
                    {
                        "name": "Leontis N.B."
                    },
                    {
                        "name": "Westhof E."
                    }
                ],
                "citationCount": 563,
                "date": "2001-05-20T00:00:00Z",
                "journal": "RNA",
                "title": "Geometric nomenclature and classification of RNA base pairs"
            },
            "pmid": "11345429"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "Nucleic acids",
            "uri": "http://edamontology.org/topic_0077"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        },
        {
            "term": "Sequence composition, complexity and repeats",
            "uri": "http://edamontology.org/topic_0157"
        },
        {
            "term": "Nucleic acid sites, features and motifs",
            "uri": "http://edamontology.org/topic_3511"
        }
    ],
    "validated": 1
}