{
    "additionDate": "2021-01-18T10:58:18Z",
    "biotoolsCURIE": "biotools:chromonomer",
    "biotoolsID": "chromonomer",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jcatchen@illinois.edu",
            "name": "Julian Catchen",
            "orcidid": "https://orcid.org/0000-0002-4798-660X",
            "typeEntity": "Person"
        }
    ],
    "description": "Chromonomer is a program designed to integrate a genome assembly with a genetic map. Chromonomer tries very hard to identify and remove markers that are out of order in the genetic map, when considered against their local assembly order; and to identify scaffolds that have been incorrectly assembled according to the genetic map, and split those scaffolds.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                },
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                },
                {
                    "term": "Mapping assembly",
                    "uri": "http://edamontology.org/operation_0523"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "homepage": "http://catchenlab.life.illinois.edu/chromonomer",
    "lastUpdate": "2021-02-11T16:16:12Z",
    "name": "Chromonomer",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1534/G3.120.401485",
            "metadata": {
                "abstract": "Copyright © 2020 Catchen et al.The pace of the sequencing and computational assembly of novel reference genomes is accelerating. Though DNA sequencing technologies and assembly software tools continue to improve, biological features of genomes such as repetitive sequence as well as molecular artifacts that often accompany sequencing library preparation can lead to fragmented or chimeric assemblies. If left uncorrected, defects like these trammel progress on understanding genome structure and function, or worse, positively mislead this research. Fortunately, integration of additional, independent streams of information, such as a marker-dense genetic map and conserved orthologous gene order from related taxa, can be used to scaffold together unlinked, disordered fragments and to restructure a reference genome where it is incorrectly joined. We present a tool set for automating these processes, one that additionally tracks any changes to the assembly and to the genetic map, and which allows the user to scrutinize these changes with the help of web-based, graphical visualizations. Chromonomer takes a user-defined reference genome, a map of genetic markers, and, optionally, conserved synteny information to construct an improved reference genome of chromosome models: a “chromonome”. We demonstrate Chromonomer's performance on genome assemblies and genetic maps that have disparate characteristics and levels of quality.",
                "authors": [
                    {
                        "name": "Amores A."
                    },
                    {
                        "name": "Bassham S."
                    },
                    {
                        "name": "Catchen J."
                    }
                ],
                "citationCount": 7,
                "date": "2020-11-01T00:00:00Z",
                "journal": "G3: Genes, Genomes, Genetics",
                "title": "Chromonomer: A tool set for repairing and enhancing assembled genomes through integration of genetic maps and conserved synteny"
            },
            "pmcid": "PMC7642942",
            "pmid": "32912931"
        }
    ],
    "toolType": [
        "Suite"
    ],
    "topic": [
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ]
}
