
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://girke.bioinformatics.ucr.edu/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://github.com/baoe/AlignGraph"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Scaffold gap completion",
                    "uri": "http://edamontology.org/operation_3217"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequence assembly",
                "uri": "http://edamontology.org/topic_0196"
            },
            {
                "term": "Sequence sites, features and motifs",
                "uri": "http://edamontology.org/topic_0160"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/aligngraph-secondary-de-novo-genome-assembly-guided-by-closely-related-references.html"
        }
    ],
    "publication": [
        {
            "abstract": "Motivation: De novo assemblies of genomes remain one of the most challenging applications in next-generation sequencing. Usually, their results are incomplete and fragmented into hundreds of contigs. Repeats in genomes and sequencing errors are the main reasons for these complications. With the rapidly growing number of sequenced genomes, it is now feasible to improve assemblies by guiding them with genomes from related species. Results: Here we introduce AlignGraph, an algorithm for extending and joining de novo-assembled contigs or scaffolds guided by closely related reference genomes. It aligns paired-end (PE) reads and preassembled contigs or scaffolds to a close reference. From the obtained alignments, it builds a novel data structure, called the PE multipositional de Bruijn graph. The incorporated positional information from the alignments and PE reads allows us to extend the initial assemblies, while avoiding incorrect extensions and early terminations. In our performance tests, AlignGraph was able to substantially improve the contigs and scaffolds from several assemblers. For instance, 28.7-62.3% of the contigs of Arabidopsis thaliana and human could be extended, resulting in improvements of common assembly metrics, such as an increase of the N50 of the extendable contigs by 89.9-94.5% and 80.3-165.8%, respectively. In another test, AlignGraph was able to improve the assembly of a published genome (Arabidopsis strain Landsberg) by increasing the N50 of its extendable scaffolds by 86.6%. These results demonstrate AlignGraph's efficiency in improving genome assemblies by taking advantage of closely related references. © 2014 The Author. Published by Oxford University Press. All rights reserved.",
            "authors": [
                "Bao E.",
                "Jiang T.",
                "Girke T."
            ],
            "cit_count": 24,
            "journal": "Bioinformatics",
            "pmid": "24932000",
            "title": "AlignGraph: Algorithm for secondary de novo genome assembly guided by closely related references",
            "year": "2014-06-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:aligngraph",
        "biotoolsID": "aligngraph",
        "description": "Software that extends and joins contigs or scaffolds by reassembling them with help provided by a reference genome of a closely related organism.",
        "homepage": "https://github.com/baoe/AlignGraph",
        "name": "AlignGraph"
    }
}