{
    "accessibility": "Open access",
    "additionDate": "2021-10-31T08:57:35.134808Z",
    "biotoolsCURIE": "biotools:dart-ms",
    "biotoolsID": "dart-ms",
    "confidence_flag": "tool",
    "description": "Library-Search Algorithm for Mixture Analysis Using DART-MS.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Spectral library search",
                    "uri": "http://edamontology.org/operation_3801"
                },
                {
                    "term": "Spectrum calculation",
                    "uri": "http://edamontology.org/operation_3860"
                }
            ]
        }
    ],
    "homepage": "https://github.com/asm3-nist/DART-MS-DST",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-10-31T08:57:35.137396Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/asm3-nist/DART-MS-DBB"
        }
    ],
    "name": "DART-MS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1021/JASMS.1C00097",
            "metadata": {
                "abstract": "© Not subject to U.S. Copyright. Published 2021 by American Chemical Society.Forensic analysis of seized drug evidence often involves determining whether the components of an unknown mixture are illicit compounds. One approach to this task is to screen the evidence using direct analysis in real time mass spectrometry (DART-MS) to make presumptive identifications. This manuscript introduces a new library-search algorithm that enhances presumptive identifications of mixture components using a series of in-source collision-induced dissociation mass spectra collected through DART-MS. The multistage search, titled the Inverted Library-Search Algorithm (ILSA), identifies potential components in a mixture by first searching the lowest fragmentation mass spectrum for target peaks, assuming these peaks are protonated molecules, and then scoring each target peak with possible library matches. As a proof of concept, the ILSA is demonstrated through several example searches of model seized drug mixtures of acetyl fentanyl, benzyl fentanyl, amphetamine, and methamphetamine searched against a small library of select compounds and the freely available NIST DART-MS Forensics Database. Discussion of the search results and several open areas of research to further extend the method are provided. This new approach for presumptive identification provides analysts with refined information about mixture components and will be of immediate importance in forensic analysis using DART-MS. A prototype implementation of the ILSA is available at https://github.com/asm3-nist/DART-MS-DST.",
                "authors": [
                    {
                        "name": "Moorthy A.S."
                    },
                    {
                        "name": "Sisco E."
                    }
                ],
                "date": "2021-07-07T00:00:00Z",
                "journal": "Journal of the American Society for Mass Spectrometry",
                "title": "A New Library-Search Algorithm for Mixture Analysis Using DART-MS"
            },
            "pmid": "34137604"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Compound libraries and screening",
            "uri": "http://edamontology.org/topic_3343"
        },
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
