{
    "additionDate": "2017-01-23T16:31:07Z",
    "biotoolsCURIE": "biotools:nastiseq",
    "biotoolsID": "nastiseq",
    "credit": [
        {
            "email": "rbc@denbi.de",
            "name": "de.NBI-RBC"
        },
        {
            "email": "Uwe.Ohler@mdc-berlin.de",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "To identify cis-NATs using ssRNA-seq, a new computational method was developed based on model comparison that incorporates the inherent variable efficiency of generating perfectly strand-specific libraries.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www-huber.embl.de/users/anders/DESeq/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence tag profile",
                        "uri": "http://edamontology.org/data_2535"
                    },
                    "format": [
                        {
                            "term": "Sequence feature table format",
                            "uri": "http://edamontology.org/format_2548"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Sequence feature detection",
                    "uri": "http://edamontology.org/operation_0253"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Sequence features",
                        "uri": "http://edamontology.org/data_1255"
                    },
                    "format": [
                        {
                            "term": "Sequence feature table format",
                            "uri": "http://edamontology.org/format_2548"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "https://ohlerlab.mdc-berlin.de/software/NASTIseq_104/",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:55Z",
    "name": "NASTIseq",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Yusufujiangaili.Dilimulati@mdc",
    "publication": [
        {
            "doi": "10.1101/gr.149310.112",
            "metadata": {
                "abstract": "Pairs of RNA molecules transcribed from partially or entirely complementary loci are called cis-natural antisense transcripts (cis-NATs), and they play key roles in the regulation of gene expression in many organisms. A promising experimental tool for profiling sense and antisense transcription is strand-specific RNA sequencing (ssRNA-seq). To identify cis- NATs using ssRNA-seq, we developed a new computational method based on a model comparison framework that incorporates the inherent variable efficiency of generating perfectly strand-specific libraries. Applying the method to new ssRNA-seq data from whole-root and cell-type-specific Arabidopsis libraries confirmed most of the known cis-NAT pairs and identified 918 additional cis-NAT pairs. Newly identified cis-NAT pairs are supported by polyadenylation data, alternative splicing patterns, and RT-PCR validation. We found 209 cis-NAT pairs that have opposite expression levels in neighboring cell types, implying cell-type-specific roles for cis-NATs. By integrating a genome-wide epigenetic profile of Arabidopsis, we identified a unique chromatin signature of cis-NATs, suggesting a connection between cis-NAT transcription and chromatin modification in plants. An analysis of small-RNA sequencing data showed that ~4% of cis-NAT pairs produce putative cis-NAT-induced siRNAs. Taken together, our data and analyses illustrate the potential for multifaceted regulatory roles of plant cis-NATs. © 2013, Published by Cold Spring Harbor Laboratory Press.",
                "authors": [
                    {
                        "name": "Li S."
                    },
                    {
                        "name": "Liberman L.M."
                    },
                    {
                        "name": "Mukherjee N."
                    },
                    {
                        "name": "Benfey P.N."
                    },
                    {
                        "name": "Ohler U."
                    }
                ],
                "citationCount": 39,
                "date": "2013-10-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "Integrated detection of natural antisense transcripts using strand-specific RNA sequencing data"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}