{
    "additionDate": "2021-01-18T10:34:21Z",
    "biotoolsCURIE": "biotools:veganbagel",
    "biotoolsID": "veganbagel",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Julian Caspers",
            "typeEntity": "Person"
        }
    ],
    "description": "Automated age- and sex-specific volumetric estimation of regional brain atrophy.\n\nBrain Imaging Accessoires: Volumetric estimation of gross atrophy and brain age longitudinally (veganbagel).\n\nEstimating regional deviations of brain volume from a patient’s normative age cohort is challenging and entails immense inter-reader variation. We propose an automated workflow for sex- and age-dependent estimation of brain volume changes relative to a normative population.\n\nThe veganbagel script takes a directory with DICOM files of a non-enhanced 3D T1-weighted structural MR brain scan as input and then generates a map of regional volume changes in relation to an age- and sex-matched cohort of pre-processed normal scans.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BrainImAccs/veganbagel",
    "language": [
        "MATLAB",
        "Shell"
    ],
    "lastUpdate": "2021-03-11T10:32:04Z",
    "name": "veganbagel",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1007/S00330-020-07196-8",
            "metadata": {
                "abstract": "© 2020, The Author(s).Objectives: An automated workflow for age- and sex-specific estimation of regional brain volume changes from structural MRI relative to a standard population is presented and evaluated for feasibility. Methods: T1w MRI scans are preprocessed in a standardized way comprising gray matter (GM) segmentation, normalization, modulation, and spatial smoothing. Resulting GM images are then compared to precomputed age- and sex-specific GM templates derived from the population-based Nathan Kline Institute Rockland Sample, and voxel-wise z-maps are compiled. z-maps are color-coded and fused with the subject’s T1w images. The rate of technical success of the proposed workflow was evaluated in 1330 subjects of the Alzheimer’s Disease Neuroimaging Initiative (ADNI). Furthermore, medial temporal atrophy (MTA) was assessed using the color-coded maps and with the MTA visual rating scale in these subjects. Sensitivities and specificity of color-coded maps and MTA scale were compared using McNemar’s test. Results: One test dataset was excluded due to severe motion artifacts. Out of the remaining 1329 datasets, atrophy map generation was successful in 1323 ADNI subjects (99.5%). Sensitivity for AD diagnosis (71.4 % vs. 53.3%, p < 0.0001 for left; 70.4% vs. 55.3%, p < 0.0001 for right hemisphere) and for MCI (45.4% vs. 17.4, p < 0.0001 for left; 43.5% vs. 14.6%, p < 0.0001 for right hemisphere) based on medial temporal atrophy assessment in color-coded maps was significantly higher than for MTA visual rating scale, while specificity was lower (78.4% vs. 93.8%, p < 0.0001 for left; 79.4% vs. 95.8%, p < 0.0001 for right hemisphere). The workflow is named veganbagel and is published as open-source software with an integrated PACS interface. Conclusions: Automated brain volume change estimation with the proposed workflow is feasible and technically dependable. It provides high potential for radiologic assessment of brain volume changes and neurodegenerative diseases. Key Points: • A workflow combining techniques from voxel-based morphometry and population-based neuroimaging data is feasible and technically highly dependable. • The workflow is provided as open-source software, named veganbagel. • Sensitivity of medial temporal atrophy assessment in atrophy maps from veganbagel exceeds the sensitivity of MTA visual rating scale for the diagnosis of Alzheimer’s disease.",
                "authors": [
                    {
                        "name": "Caspers J."
                    },
                    {
                        "name": "Heeger A."
                    },
                    {
                        "name": "Rubbert C."
                    },
                    {
                        "name": "Turowski B."
                    }
                ],
                "date": "2021-02-01T00:00:00Z",
                "journal": "European Radiology",
                "title": "Automated age- and sex-specific volumetric estimation of regional brain atrophy: workflow and feasibility"
            },
            "pmid": "32852588"
        }
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
