{
    "additionDate": "2021-01-18T12:05:30Z",
    "biotoolsCURIE": "biotools:ct-org",
    "biotoolsID": "ct-org",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "blaine@stanford.edu",
            "name": "Blaine Rister",
            "orcidid": "https://orcid.org/0000-0002-4490-0444",
            "typeEntity": "Person"
        }
    ],
    "description": "CT-ORG is a dataset for multiple organ segmentation in computed tomography. Morphological image segmentation scripts for CT scans. All scripts take an image, an optional vector of units, and possibly a mask of voxels to ignore. All scripts can be run with just the image, although the accuracy may be degraded.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bbrister/ctOrganSegmentation",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-02-18T17:56:00Z",
    "license": "MIT",
    "name": "CT-ORG",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1038/S41597-020-00715-8",
            "metadata": {
                "abstract": "© 2020, The Author(s).Despite the relative ease of locating organs in the human body, automated organ segmentation has been hindered by the scarcity of labeled training data. Due to the tedium of labeling organ boundaries, most datasets are limited to either a small number of cases or a single organ. Furthermore, many are restricted to specific imaging conditions unrepresentative of clinical practice. To address this need, we developed a diverse dataset of 140 CT scans containing six organ classes: liver, lungs, bladder, kidney, bones and brain. For the lungs and bones, we expedited annotation using unsupervised morphological segmentation algorithms, which were accelerated by 3D Fourier transforms. Demonstrating the utility of the data, we trained a deep neural network which requires only 4.3 s to simultaneously segment all the organs in a case. We also show how to efficiently augment the data to improve model generalization, providing a GPU library for doing so. We hope this dataset and code, available through TCIA, will be useful for training and evaluating organ segmentation models.",
                "authors": [
                    {
                        "name": "Nobashi T."
                    },
                    {
                        "name": "Rister B."
                    },
                    {
                        "name": "Rubin D.L."
                    },
                    {
                        "name": "Shivakumar K."
                    },
                    {
                        "name": "Yi D."
                    }
                ],
                "citationCount": 1,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Scientific Data",
                "title": "CT-ORG, a new dataset for multiple organ segmentation in computed tomography"
            },
            "pmcid": "PMC7658204",
            "pmid": "33177518"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ]
}
