{
    "additionDate": "2022-10-09T12:27:39.309837Z",
    "biotoolsCURIE": "biotools:deeppse",
    "biotoolsID": "deeppse",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Shenggeng Lin"
        },
        {
            "name": "Yi Xiong"
        }
    ],
    "description": "A deep learning-based method, DeepPSE, to predict polypharmacy side effects in an end-to-end way.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/ShenggengLin/DeepPSE",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-10-09T12:27:39.312456Z",
    "license": "Not licensed",
    "name": "DeepPSE",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.COMPBIOMED.2022.105984",
            "metadata": {
                "abstract": "© 2022 Elsevier LtdPolypharmacy (multiple use of drugs) is an effective strategy for combating complex or co-existing diseases. However, a major consequence of polypharmacy is a higher risk of adverse side effects due to drug-drug interactions, which are rare and observed in relatively small clinical testing. Thus, identification of polypharmacy side effects remains challenging. Here, we propose a deep learning-based method, DeepPSE, to predict polypharmacy side effects in an end-to-end way. DeepPSE is composed of two main modules. First, multiple types of neural networks are constructed and fused to learn the deep representation of a drug pair. Second, the encoder block of transformer that includes self-attention mechanism is built to get latent features, which are further fed into the fully connected layer to predict polypharmacy side effects of drug pairs. Further, DeepPSE is compared with five baseline or state-of-the-art methods on a benchmark dataset of 964 types of polypharmacy side effects across 63473 drug pairs. Experimental results demonstrate that DeepPSE achieves better performance than that of all five methods. The source codes and data are available at https://github.com/ShenggengLin/DeepPSE",
                "authors": [
                    {
                        "name": "Lin S."
                    },
                    {
                        "name": "Wei D.-Q."
                    },
                    {
                        "name": "Xiong Y."
                    },
                    {
                        "name": "Zhang G."
                    }
                ],
                "date": "2022-10-01T00:00:00Z",
                "journal": "Computers in Biology and Medicine",
                "title": "DeepPSE: Prediction of polypharmacy side effects by fusing deep representation of drug pairs and attention mechanism"
            },
            "pmid": "35994933"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
