{
    "additionDate": "2020-01-14T20:07:36Z",
    "biotoolsCURIE": "biotools:GMCLDA",
    "biotoolsID": "GMCLDA",
    "confidence_flag": "tool",
    "description": "Predicting human lncRNA-disease associations based on geometric matrix completion.\n\nRecently, increasing evidences have indicated that dysregulations of long non-coding RNAs (lncRNAs) are implicated in various complex diseases. However, only a limited number of lncRNA-disease associations are experimentally verified. Prioritizing potential lncRNA-disease associations is beneficial not only for understanding disease mechanisms at lncRNA level, but also for disease diagnosis. Various computational methods have been proposed, but precise prediction and full use of data's intrinsic structure are still challenging. In this study, we propose a new method, named GMCLDA (Geometric Matrix Completion lncRNA-Disease Association), to infer potential lncRNA-disease associations based on geometric matrix completion.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence similarity search",
                    "uri": "http://edamontology.org/operation_0346"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bioinfomaticsCSU/GMCLDA",
    "lastUpdate": "2020-12-03T12:05:50Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/bioinfomaticsCSU/GMCLDA"
        }
    ],
    "name": "GMCLDA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1109/JBHI.2019.2958389",
            "metadata": {
                "abstract": "© 2013 IEEE.Recently, increasing evidences reveal that dysregulations of long non-coding RNAs (lncRNAs) are relevant to diverse diseases. However, the number of experimentally verified lncRNA-disease associations is limited. Prioritizing potential associations is beneficial not only for disease diagnosis, but also disease treatment, more important apprehending disease mechanisms at lncRNA level. Various computational methods have been proposed, but precise prediction and full use of data's intrinsic structure are still challenging. In this work, we design a new method, denominated GMCLDA (Geometric Matrix Completion lncRNA-Disease Association), to infer underlying associations based on geometric matrix completion. Utilizing association patterns among functionally similar lncRNAs and phenotypically similar diseases, GMCLCA makes use of the intrinsic structure embedded in the association matrix. Besides, limiting the scope of the predicted values gives rise to a certain sparsity in computation and enhances the robustness of GMCLDA. GMCLDA computes disease semantic similarity according to the Disease Ontology (DO) hierarchy and lncRNA Gaussian interaction profile kernel similarity according to known interaction profiles. Then, GMCLDA measures lncRNA sequence similarity using Needleman-Wunsch algorithm. For a new lncRNA, GMCLDA prefills interaction profile on account of its K-nearest neighbors defined by sequence similarity. Finally, GMCLDA estimates the missing entries of the association matrix based on geometric matrix completion model. Compared with state-of-the-art methods, GMCLDA can provide more accurate lncRNA-disease prediction. Further case studies prove that GMCLDA is able to correctly infer possible lncRNAs for renal cancer.",
                "authors": [
                    {
                        "name": "Lu C."
                    },
                    {
                        "name": "Yang M."
                    },
                    {
                        "name": "Li M."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Wu F.-X."
                    },
                    {
                        "name": "Wang J."
                    }
                ],
                "citationCount": 3,
                "date": "2020-08-01T00:00:00Z",
                "journal": "IEEE Journal of Biomedical and Health Informatics",
                "title": "Predicting human lncRNA-Disease associations based on geometric matrix completion"
            },
            "pmid": "31825885"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ],
    "validated": 1
}