{
    "additionDate": "2020-01-14T19:55:45Z",
    "biotoolsCURIE": "biotools:ICGRM",
    "biotoolsID": "ICGRM",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "fangming618@126.com",
            "name": "Ming Fang",
            "orcidid": "https://orcid.org/0000-0003-3066-4855",
            "typeEntity": "Person"
        }
    ],
    "description": "Integrative construction of genomic relationship matrix combining multiple genomic regions for big dataset.\n\nBACKGROUND:Genomic prediction is an advanced method for estimating genetic values, which has been widely accepted for genetic evaluation in animal and disease-risk prediction in human. It estimates genetic values with genome-wide distributed SNPs instead of pedigree. The key step of it is to construct genomic relationship matrix (GRM) via genome-wide SNPs; however, usually the calculation of GRM needs huge computer memory especially when the SNP number and sample size are big, so that sometimes it will become computationally prohibitive even for super computer clusters. We herein developed an integrative algorithm to compute GRM.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "https://github.com/mingfang618/CLGRM",
    "language": [
        "C",
        "C++"
    ],
    "lastUpdate": "2021-01-14T08:33:52Z",
    "name": "ICGRM",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3319-Y",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Genomic prediction is an advanced method for estimating genetic values, which has been widely accepted for genetic evaluation in animal and disease-risk prediction in human. It estimates genetic values with genome-wide distributed SNPs instead of pedigree. The key step of it is to construct genomic relationship matrix (GRM) via genome-wide SNPs; however, usually the calculation of GRM needs huge computer memory especially when the SNP number and sample size are big, so that sometimes it will become computationally prohibitive even for super computer clusters. We herein developed an integrative algorithm to compute GRM. To avoid calculating GRM for the whole genome, ICGRM freely divides the genome-wide SNPs into several segments and computes the summary statistics related to GRM for each segment that requires quite few computer RAM; then it integrates these summary statistics to produce GRM for whole genome. Results: It showed that the computer memory of ICGRM was reduced by 15 times (from 218Gb to 14Gb) after the genome SNPs were split into 5 to 200 parts in terms of the number of SNPs in our simulation dataset, making it computationally feasible for almost all kinds of computer servers. ICGRM is implemented in C/C++ and freely available via https://github.com/mingfang618/CLGRM. Conclusions: ICGRM is computationally efficient software to build GRM and can be used for big dataset.",
                "authors": [
                    {
                        "name": "Fang M."
                    },
                    {
                        "name": "Jiang D."
                    },
                    {
                        "name": "Xin C."
                    },
                    {
                        "name": "Ye J."
                    },
                    {
                        "name": "Yuan Y."
                    }
                ],
                "date": "2019-12-26T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "ICGRM: Integrative construction of genomic relationship matrix combining multiple genomic regions for big dataset"
            },
            "pmcid": "PMC6933885",
            "pmid": "31878869"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ],
    "validated": 1
}
