{
    "additionDate": "2017-01-17T15:01:53Z",
    "biotoolsCURIE": "biotools:agimicrorna",
    "biotoolsID": "agimicrorna",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "plopez@cnic.es",
            "name": "Pedro Lopez-Romero",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Processing and Analysis of Agilent microRNA data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/AgiMicroRna.html"
        }
    ],
    "download": [
        {
            "type": "Software package",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/AgiMicroRna_2.24.0.tar.gz"
        },
        {
            "type": "Source code",
            "url": "http://bioconductor.org/packages/release/bioc/vignettes/AgiMicroRna/inst/doc/AgiMicroRna.R"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/AgiMicroRna.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-25T14:33:33.231721Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Mirror"
            ],
            "url": "http://bioconductor.org/packages/AgiMicroRna/"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://git.bioconductor.org/packages/AgiMicroRna"
        }
    ],
    "name": "AgiMicroRna",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1186/1471-2164-12-64",
            "metadata": {
                "abstract": "Background: The main research tool for identifying microRNAs involved in specific cellular processes is gene expression profiling using microarray technology. Agilent is one of the major producers of microRNA arrays, and microarray data are commonly analyzed by using R and the functions and packages collected in the Bioconductor project. However, an analytical package that integrates the specific characteristics of microRNA Agilent arrays has been lacking.Results: This report presents the new bioinformatic tool AgiMicroRNA for the pre-processing and differential expression analysis of Agilent microRNA array data. The software is implemented in the open-source statistical scripting language R and is integrated in the Bioconductor project (http://www.bioconductor.org) under the GPL license. For the pre-processing of the microRNA signal, AgiMicroRNA incorporates the robust multiarray average algorithm, a method that produces a summary measure of the microRNA expression using a linear model that takes into account the probe affinity effect. To obtain a normalized microRNA signal useful for the statistical analysis, AgiMicroRna offers the possibility of employing either the processed signal estimated by the robust multiarray average algorithm or the processed signal produced by the Agilent image analysis software. The AgiMicroRNA package also incorporates different graphical utilities to assess the quality of the data. AgiMicroRna uses the linear model features implemented in the limma package to assess the differential expression between different experimental conditions and provides links to the miRBase for those microRNAs that have been declared as significant in the statistical analysis.Conclusions: AgiMicroRna is a rational collection of Bioconductor functions that have been wrapped into specific functions in order to ease and systematize the pre-processing and statistical analysis of Agilent microRNA data. The development of this package contributes to the Bioconductor project filling the gap in microRNA array data analysis. © 2011 López-Romero; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Lopez-Romero P."
                    }
                ],
                "citationCount": 127,
                "date": "2011-01-26T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Pre-processing and differential expression analysis of Agilent microRNA arrays using the AgiMicroRna Bioconductor library"
            },
            "pmcid": "PMC3037903",
            "pmid": "21269452",
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1,
    "version": [
        "2.24.0"
    ]
}
