{
    "accessibility": "Open access",
    "additionDate": "2023-08-24T10:11:15.264912Z",
    "biotoolsCURIE": "biotools:cenfind",
    "biotoolsID": "cenfind",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "pierre.gonczy@epfl.ch",
            "name": "Pierre Gönczy",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "Adrien Journé",
            "typeEntity": "Person"
        },
        {
            "name": "Georgios Hatzopoulos",
            "typeEntity": "Person"
        },
        {
            "name": "Léo Bürgy",
            "typeEntity": "Person"
        },
        {
            "name": "Martin Weigert",
            "typeEntity": "Person"
        },
        {
            "name": "Matthias Minder",
            "typeEntity": "Person"
        },
        {
            "name": "Sahand Jamal Rahi",
            "typeEntity": "Person"
        }
    ],
    "description": "Deep-learning pipeline for efficient centriole detection in microscopy datasets.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Image annotation",
                    "uri": "http://edamontology.org/operation_3553"
                },
                {
                    "term": "Microscope image visualisation",
                    "uri": "http://edamontology.org/operation_3552"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "https://figshare.com/articles/dataset/Cenfind_datasets/21581358",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-08-24T10:11:15.267355Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://figshare.com/articles/software/Cenfind_model_weights/21724421"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/UPGON/cenfind"
        }
    ],
    "name": "CenFind",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-023-05214-2",
            "metadata": {
                "abstract": "Background: High-throughput and selective detection of organelles in immunofluorescence images is an important but demanding task in cell biology. The centriole organelle is critical for fundamental cellular processes, and its accurate detection is key for analysing centriole function in health and disease. Centriole detection in human tissue culture cells has been achieved typically by manual determination of organelle number per cell. However, manual cell scoring of centrioles has a low throughput and is not reproducible. Published semi-automated methods tally the centrosome surrounding centrioles and not centrioles themselves. Furthermore, such methods rely on hard-coded parameters or require a multichannel input for cross-correlation. Therefore, there is a need for developing an efficient and versatile pipeline for the automatic detection of centrioles in single channel immunofluorescence datasets. Results: We developed a deep-learning pipeline termed CenFind that automatically scores cells for centriole numbers in immunofluorescence images of human cells. CenFind relies on the multi-scale convolution neural network SpotNet, which allows the accurate detection of sparse and minute foci in high resolution images. We built a dataset using different experimental settings and used it to train the model and evaluate existing detection methods. The resulting average F1-score achieved by CenFind is > 90% across the test set, demonstrating the robustness of the pipeline. Moreover, using the StarDist-based nucleus detector, we link the centrioles and procentrioles detected with CenFind to the cell containing them, overall enabling automatic scoring of centriole numbers per cell. Conclusions: Efficient, accurate, channel-intrinsic and reproducible detection of centrioles is an important unmet need in the field. Existing methods are either not discriminative enough or focus on a fixed multi-channel input. To fill this methodological gap, we developed CenFind, a command line interface pipeline that automates cell scoring of centrioles, thereby enabling channel-intrinsic, accurate and reproducible detection across experimental modalities. Moreover, the modular nature of CenFind enables its integration in other pipelines. Overall, we anticipate CenFind to prove critical for accelerating discoveries in the field.",
                "authors": [
                    {
                        "name": "Burgy L."
                    },
                    {
                        "name": "Gonczy P."
                    },
                    {
                        "name": "Hatzopoulos G."
                    },
                    {
                        "name": "Journe A."
                    },
                    {
                        "name": "Minder M."
                    },
                    {
                        "name": "Rahi S.J."
                    },
                    {
                        "name": "Weigert M."
                    }
                ],
                "date": "2023-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "CenFind: a deep-learning pipeline for efficient centriole detection in microscopy datasets"
            },
            "pmcid": "PMC10045196",
            "pmid": "36977999"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
