
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://bipad.cmh.edu/cbi.html"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://bipad.cmh.edu"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Local alignment",
                    "uri": "http://edamontology.org/operation_0495"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++"
        ],
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequences",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/bipad-web-server-modeling-bipartite-sequence-elements.html"
        }
    ],
    "publication": [
        {
            "abstract": "Since the completion of human genome sequencing, cataloging of all genomic functional elements has been one of the challenging problems in bioinformatics. Deciphering cis-regulatory elements in the human genome still remains elusive although much effort has been expended. This paper reviews a suite of methods for two-block motif discovery including mathematical modeling, de novo motif-finding based on multiple local alignment, and genomic sequence scanning method for putative sites. We formulate a general method to address this challenge and compare two major existing algorithms (i.e., greedy local search and Gibbs sampling) implemented to solve the popular two-block structured motif discovery issue. We demonstrate how to use this suite of methods and apply them to human nuclear receptor response elements (i.e., protein binding sites of several relevant nuclear receptors, HNF4α, CAR/RXR, and PXR/RXR). © 2008 American Chemical Society.",
            "authors": [
                "Bi C.",
                "Leeder J.S.",
                "Vyhlidal C.A."
            ],
            "cit_count": 11,
            "doi": "10.1021/mp7001126",
            "journal": "Molecular Pharmaceutics",
            "title": "A comparative study on computational two-block motif detection: Algorithms and applications",
            "type": "Primary",
            "year": "2008-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:bipad",
        "biotoolsID": "bipad",
        "description": "A web interface to predict sequence elements embedded within unaligned sequences. Either a bipartite model, consisting of a pair of one-block position weight matrices with a gap distribution, or a single PWM matrix for contiguous single block motifs may be produced. It performs multiple local alignment by entropy minimization and cyclic refinement using a stochastic greedy search strategy.",
        "homepage": "http://bipad.cmh.edu/",
        "name": "BiPad"
    }
}