{
    "accessibility": "Open access",
    "additionDate": "2022-12-12T21:51:44.278028Z",
    "biotoolsCURIE": "biotools:scatacpipe",
    "biotoolsID": "scatacpipe",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "Julie.Zhu@umassmed.edu",
            "name": "Lihua Julie Zhu",
            "typeEntity": "Person"
        },
        {
            "name": "Haibo Liu"
        },
        {
            "name": "Kai Hu"
        },
        {
            "name": "Nathan D Lawson"
        }
    ],
    "description": "A nextflow pipeline for comprehensive and reproducible analyses of single cell ATAC-seq data.",
    "documentation": [
        {
            "type": [
                "Code of conduct"
            ],
            "url": "https://github.com/hukai916/scATACpipe/blob/main/CODE_OF_CONDUCT.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Demultiplexing",
                    "uri": "http://edamontology.org/operation_3933"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                }
            ]
        }
    ],
    "homepage": "https://github.com/hukai916/scATACpipe",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2022-12-12T21:51:44.280646Z",
    "license": "MIT",
    "name": "scATACpipe",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/FCELL.2022.981859",
            "metadata": {
                "abstract": "Copyright © 2022 Hu, Liu, Lawson and Zhu.Single cell ATAC-seq (scATAC-seq) has become the most widely used method for profiling open chromatin landscape of heterogeneous cell populations at a single-cell resolution. Although numerous software tools and pipelines have been developed, an easy-to-use, scalable, reproducible, and comprehensive pipeline for scATAC-seq data analyses is still lacking. To fill this gap, we developed scATACpipe, a Nextflow pipeline, for performing comprehensive analyses of scATAC-seq data including extensive quality assessment, preprocessing, dimension reduction, clustering, peak calling, differential accessibility inference, integration with scRNA-seq data, transcription factor activity and footprinting analysis, co-accessibility inference, and cell trajectory prediction. scATACpipe enables users to perform the end-to-end analysis of scATAC-seq data with three sub-workflow options for preprocessing that leverage 10x Genomics Cell Ranger ATAC software, the ultra-fast Chromap procedures, and a set of custom scripts implementing current best practices for scATAC-seq data preprocessing. The pipeline extends the R package ArchR for downstream analysis with added support to any eukaryotic species with an annotated reference genome. Importantly, scATACpipe generates an all-in-one HTML report for the entire analysis and outputs cluster-specific BAM, BED, and BigWig files for visualization in a genome browser. scATACpipe eliminates the need for users to chain different tools together and facilitates reproducible and comprehensive analyses of scATAC-seq data from raw reads to various biological insights with minimal changes of configuration settings for different computing environments or species. By applying it to public datasets, we illustrated the utility, flexibility, versatility, and reliability of our pipeline, and demonstrated that our scATACpipe outperforms other workflows.",
                "authors": [
                    {
                        "name": "Hu K."
                    },
                    {
                        "name": "Lawson N.D."
                    },
                    {
                        "name": "Liu H."
                    },
                    {
                        "name": "Zhu L.J."
                    }
                ],
                "date": "2022-09-27T00:00:00Z",
                "journal": "Frontiers in Cell and Developmental Biology",
                "title": "scATACpipe: A nextflow pipeline for comprehensive and reproducible analyses of single cell ATAC-seq data"
            },
            "pmcid": "PMC9551270",
            "pmid": "36238687"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Chromosome conformation capture",
            "uri": "http://edamontology.org/topic_3940"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
