{
    "additionDate": "2018-09-03T16:41:02Z",
    "biotoolsCURIE": "biotools:cerebroviz",
    "biotoolsID": "cerebroviz",
    "credit": [
        {
            "email": "ethan-bahl@uiowa.edu",
            "name": "Ethan Bahl",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "cerebroViz is an R package that can map spatiotemporal brain data to vector graphic diagrams of the human brain.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://ethanbahl.github.io/cerebroViz/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ethanbahl/cerebroViz",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/ethanbahl/cerebroViz/issues"
        }
    ],
    "name": "cerebroViz",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btw726",
            "metadata": {
                "abstract": "© The Author 2016. Published by Oxford University Press.Spatiotemporal transcriptomic profiling has provided valuable insight into the patterning of gene expression throughout the human brain from early fetal development to adulthood. When combined with prior knowledge of a disease's age at onset and region-specificity, these expression profiles have provided the necessary context to both strengthen putative gene-disease associations and infer new associations. While a wealth of spatiotemporal expression data exists, there are currently no tools available to visualize this data within the anatomical context of the brain, thus limiting the intuitive interpretation of many such findings. We present cerebroViz, an R package to map spatiotemporal brain data to vector graphic diagrams of the human brain. Our tool allows rapid generation of publication-quality figures that highlight spatiotemporal trends in the input data, while striking a balance between usability and customization. cerebroViz is generalizable to any data quantifiable at a brain-regional resolution and currently supports visualization of up to thirty regions of the brain found in databases such as BrainSpan, GTEx and Roadmap Epigenomics.",
                "authors": [
                    {
                        "name": "Bahl E."
                    },
                    {
                        "name": "Koomar T."
                    },
                    {
                        "name": "Michaelson J.J."
                    }
                ],
                "citationCount": 6,
                "date": "2017-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "cerebroViz: An R package for anatomical visualization of spatiotemporal brain data"
            },
            "pmcid": "PMC5870797",
            "pmid": "28011779",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        }
    ],
    "validated": 1
}