{
    "additionDate": "2019-11-14T18:41:42Z",
    "biotoolsCURIE": "biotools:Human_Factors_Integration_Toolset",
    "biotoolsID": "Human_Factors_Integration_Toolset",
    "confidence_flag": "low",
    "description": "> LOW CONFIDENCE! | Assessing human factors and ergonomics capability in organisations | Human Factors Integration Toolset- see update for free file download | Human Factors Integration Toolset- see update for free file download : Creation of a tool that reports the level of HF integration and maturity in an organization | Human Factors Integration Toolset- see update for free file download : Michael Greig : 1 updates : Research Project",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.researchgate.net/project/Human-Factors-Integration-Toolset",
    "lastUpdate": "2019-11-14T18:41:42Z",
    "name": "Human Factors Integration Toolset",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1080/00140139.2019.1572228",
            "metadata": {
                "abstract": "© 2019, © 2019 Informa UK Limited, trading as Taylor & Francis Group.This paper presents the development of a tool that allows an organisation to assess its level of human factors (HF) and ergonomics integration and maturity within the organisation. The Human Factors Integration Toolset (available at: https://www.researchgate.net/project/Human-Factors-Integration-Toolset) has been developed and validated through a series of workshops with 45 participants from industry and academia and through industry partnered field-testing. HF maturity is assessed across five levels in 16 organisational functions based on any of 31 discrete elements contributing to HF. Summing element scores in a function determines a percent of ideal HF for the function. Industry stakeholders engaged in field-testing found the tool helped to establish the status of HF in the organisation, plan projects to further develop HF capabilities, and initiate discussions on HF for performance and well-being. Improvement suggestions included adding an IT function, refining the language for non-HF specialists, including knowledge work and creating a digital version to improve usability. Practitioner summary: A tool scoring HF capability in 16 organisation functions has been developed collaboratively. Industry stakeholders expressed a need for the tool and provided validation of tool design decisions. Field-testing improved tool usability and showed that beyond scoring HF capability, the tool created opportunities for discussions of HF-related improvement possibilities. Abbreviations: HF: human factors; HFIT: Human Factors Integration Toolset.",
                "authors": [
                    {
                        "name": "Greig M.A."
                    },
                    {
                        "name": "Village J."
                    },
                    {
                        "name": "Dixon S.M."
                    },
                    {
                        "name": "Salustri F.A."
                    },
                    {
                        "name": "Neumann W.P."
                    }
                ],
                "date": "2019-10-03T00:00:00Z",
                "journal": "Ergonomics",
                "title": "Assessing human factors and ergonomics capability in organisations–the Human Factors Integration Toolset"
            },
            "pmid": "31466512"
        }
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        }
    ]
}