{
    "additionDate": "2019-11-14T18:06:20Z",
    "biotoolsCURIE": "biotools:ROBOKOP",
    "biotoolsID": "ROBOKOP",
    "confidence_flag": "tool",
    "description": "An Abstraction Layer and User Interface for Knowledge Graphs to Support Question Answering | ROBOKOP is a tool for reasoning over structured biomedical knowledge databases as part of the NCATS translator and reasoner programs. The ROBOKOP system consists of a web based user interface, an API server, and several worker servers. The code is separated into three separate repositories",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://robokop.renci.org",
    "language": [
        "JavaScript",
        "Python"
    ],
    "lastUpdate": "2020-12-14T08:37:45Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://robokopkg.renci.org"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/NCATS-Gamma/robokop"
        }
    ],
    "name": "ROBOKOP",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ604",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Knowledge graphs (KGs) are quickly becoming a common-place tool for storing relationships between entities from which higher-level reasoning can be conducted. KGs are typically stored in a graph-database format, and graph-database queries can be used to answer questions of interest that have been posed by users such as biomedical researchers. For simple queries, the inclusion of direct connections in the KG and the storage and analysis of query results are straightforward; however, for complex queries, these capabilities become exponentially more challenging with each increase in complexity of the query. For instance, one relatively complex query can yield a KG with hundreds of thousands of query results. Thus, the ability to efficiently query, store, rank and explore sub-graphs of a complex KG represents a major challenge to any effort designed to exploit the use of KGs for applications in biomedical research and other domains. We present Reasoning Over Biomedical Objects linked in Knowledge Oriented Pathways as an abstraction layer and user interface to more easily query KGs and store, rank and explore query results.",
                "authors": [
                    {
                        "name": "Balhoff J."
                    },
                    {
                        "name": "Bizon C."
                    },
                    {
                        "name": "Cox S."
                    },
                    {
                        "name": "Fecho K."
                    },
                    {
                        "name": "Kebede Y."
                    },
                    {
                        "name": "Morton K."
                    },
                    {
                        "name": "Tropsha A."
                    },
                    {
                        "name": "Wang P."
                    }
                ],
                "citationCount": 8,
                "date": "2019-12-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "ROBOKOP: An abstraction layer and user interface for knowledge graphs to support question answering"
            },
            "pmid": "31410449"
        }
    ],
    "topic": [
        {
            "term": "Environmental science",
            "uri": "http://edamontology.org/topic_3855"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        }
    ],
    "validated": 1
}
