{
    "additionDate": "2017-03-27T12:32:50Z",
    "biotoolsCURIE": "biotools:niasgbdb",
    "biotoolsID": "niasgbdb",
    "credit": [
        {
            "name": "Contact Form",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.gene.affrc.go.jp/contacts_en.php"
        }
    ],
    "description": "Genetic resource database and a plant diseases database, linked by a web retrieval database. The genetic resources database has plant and microorganism search systems to provide information on research materials, including passport and evaluation data for genetic resources with the desired properties. A database of plant diseases in Japan has been developed based on the listing of common names of plant diseases compiled by the Phytopathological Society of Japan.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.gene.affrc.go.jp/manuals_en.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                },
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://www.gene.affrc.go.jp/databases_en.php",
    "lastUpdate": "2018-12-10T12:58:55Z",
    "name": "NIASGBdb",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "The National Institute of Agrobiological Sciences (NIAS) is implementing the NIAS Genebank Project for conservation and promotion of agrobiological genetic resources to contribute to the development\\ and utilization of agriculture and agricultural products. The project's databases (NIASGBdb; http://www.gene.affrc.go.jp/databases-en.php) consist of a genetic resource database and a plant diseases database, linked by a web retrieval database. The genetic resources database has plant and microorganism search systems to provide information on research materials, including passport and evaluation data for genetic resources with the desired properties. To facilitate genetic diversity research, several NIAS Core Collections have been developed. The NIAS Rice (Oryza sativa) Core Collection of Japanese Landraces contains information on simple sequence repeat (SSR) polymorphisms. SSR marker information for azuki bean (Vigna angularis) and black gram (V. mungo) and DNA sequence data from some selected Japanese strains of the genus Fusarium are also available. A database of plant diseases in Japan has been developed based on the listing of common names of plant diseases compiled by the Phytopathological Society of Japan. Relevant plant and microorganism genetic resources are associated with the plant disease names by the web retrieval database and can be obtained from the NIAS Genebank for research or educational purposes. © The Author(s) 2010.",
                "authors": [
                    {
                        "name": "Takeya M."
                    },
                    {
                        "name": "Yamasaki F."
                    },
                    {
                        "name": "Uzuhashi S."
                    },
                    {
                        "name": "Aoki T."
                    },
                    {
                        "name": "Sawada H."
                    },
                    {
                        "name": "Nagai T."
                    },
                    {
                        "name": "Tomioka K."
                    },
                    {
                        "name": "Tomooka N."
                    },
                    {
                        "name": "Sato T."
                    },
                    {
                        "name": "Kawase M."
                    }
                ],
                "citationCount": 17,
                "date": "2011-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "NIASGBdb: NIAS Genebank databases for genetic resources and plant disease information"
            },
            "pmid": "20952407"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1
}