{"credit":[],"function":[{"operation":[{"term":"Gene functional annotation","uri":"http://edamontology.org/operation_3672"},{"term":"EST assembly","uri":"http://edamontology.org/operation_0526"}]}],"labels":{"toolType":["Web application"],"topic":[{"term":"Gene transcripts","uri":"http://edamontology.org/topic_3512"},{"term":"Model organisms","uri":"http://edamontology.org/topic_0621"},{"term":"Workflows","uri":"http://edamontology.org/topic_0769"},{"term":"Function analysis","uri":"http://edamontology.org/topic_1775"}]},"publication":[{"abstract":"The generation of expressed sequence tag (EST) libraries offers an affordable approach to investigate organisms, if no genome sequence is available. OREST (http://mips.gsf.de/genre/proj/orest/index.html) is a server-based EST analysis pipeline, which allows the rapid analysis of large amounts of ESTs or cDNAs from mammalia and fungi. In order to assign the ESTs to genes or proteins OREST maps DNA sequences to reference datasets of gene products and in a second step to complete genome sequences. Mapping against genome sequences recovers additional 13% of EST data, which otherwise would escape further analysis. To enable functional analysis of the datasets, ESTs are functionally annotated using the hierarchical FunCat annotation scheme as well as GO annotation terms. OREST also allows to predict the association of gene products and diseases by Morbid Map (OMIM) classification. A statistical analysis of the results of the dataset is possible with the included PROMPT software, which provides information about enrichment and depletion of functional and disease annotation terms. OREST was successfully applied for the identification and functional characterization of more than 3000 EST sequences of the common marmoset monkey (Callithrix jacchus) as part of an international collaboration.","authors":["Waegele B.","Schmidt T.","Mewes H.W.","Ruepp A."],"cit_count":5,"journal":"Nucleic acids research","pmid":"18463135","title":"OREST: the online resource for EST analysis.","year":"2008-01-01"}],"summary":{"biotoolsCURIE":"biotools:orest","biotoolsID":"orest","description":"EST analysis pipeline which allows rapid analysis of large amounts of ESTs or cDNAs from mammals and fungi. Functional annotation of the dataset is also included via either FunCat or GO annotation.","homepage":"http://mips.gsf.de/genre/proj/orest/index.html","name":"OREST"}}