{
    "additionDate": "2020-01-09T18:19:13Z",
    "biotoolsCURIE": "biotools:MLCS",
    "biotoolsID": "MLCS",
    "confidence_flag": "tool",
    "description": "A Fast and Memory Efficient MLCS Algorithm by Character Merging for DNA Sequences Alignment.\n\nThis is a fast MLCS algorithm for DNA sequence",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                },
                {
                    "term": "Sequence merging",
                    "uri": "http://edamontology.org/operation_0232"
                },
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "homepage": "https://github.com/liusen1006/MLCS",
    "language": [
        "C++"
    ],
    "lastUpdate": "2020-12-29T09:29:36Z",
    "name": "MLCS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ725",
            "metadata": {
                "abstract": "© 2020 Oxford University Press. All rights reserved.Motivation: Multiple longest common subsequence (MLCS) problem is searching all longest common subsequences of multiple character sequences. It appears in many fields such as data mining, DNA alignment, bioinformatics, text editing and so on. With the increasing in sequence length and number of sequences, the existing dynamic programming algorithms and the dominant point-based algorithms become ineffective and inefficient, especially for large-scale MLCS problems. Results: In this paper, by considering the characteristics of DNA sequences with many consecutively repeated characters, we first design a character merging scheme which merges the consecutively repeated characters in the sequences. As a result, it shortens the length of sequences considered and saves the space of storing all sequences. To further reduce the space and time costs, we construct a weighted directed acyclic graph which is much smaller than widely used directed acyclic graph for MLCS problems. Based on these techniques, we propose a fast and memory efficient algorithm for MLCS problems. Finally, the experiments are conducted and the proposed algorithm is compared with several state-of-the art algorithms. The experimental results show that the proposed algorithm performs better than the compared state-of-the art algorithms in both time and space costs.",
                "authors": [
                    {
                        "name": "Liu S."
                    },
                    {
                        "name": "Tong W."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Wei S."
                    }
                ],
                "citationCount": 3,
                "date": "2020-02-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "A fast and memory efficient MLCS algorithm by character merging for DNA sequences alignment"
            },
            "pmid": "31584616"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Sequence composition, complexity and repeats",
            "uri": "http://edamontology.org/topic_0157"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        }
    ],
    "validated": 1
}
