{
    "accessibility": "Open access",
    "additionDate": "2024-05-24T08:58:39.557449Z",
    "biotoolsCURIE": "biotools:sand",
    "biotoolsID": "sand",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "frank.delaglio@nist.gov",
            "name": "Frank Delaglio",
            "orcidid": "https://orcid.org/0000-0003-1264-2556",
            "typeEntity": "Person"
        },
        {
            "name": "Yue Wu",
            "typeEntity": "Person"
        }
    ],
    "description": "Automated Time-Domain Modeling of NMR Spectra Applied to Metabolite Quantification.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Peak detection",
                    "uri": "http://edamontology.org/operation_3215"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/edisonomics/SAND",
    "language": [
        "MATLAB",
        "R"
    ],
    "lastUpdate": "2024-05-24T08:58:39.559738Z",
    "license": "MIT",
    "name": "SAND",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/acs.analchem.3c03078",
            "metadata": {
                "abstract": "Developments in untargeted nuclear magnetic resonance (NMR) metabolomics enable the profiling of thousands of biological samples. The exploitation of this rich source of information requires a detailed quantification of spectral features. However, the development of a consistent and automatic workflow has been challenging because of extensive signal overlap. To address this challenge, we introduce the software Spectral Automated NMR Decomposition (SAND). SAND follows on from the previous success of time-domain modeling and automatically quantifies entire spectra without manual interaction. The SAND approach uses hybrid optimization with Markov chain Monte Carlo methods, employing subsampling in both time and frequency domains. In particular, SAND randomly divides the time-domain data into training and validation sets to help avoid overfitting. We demonstrate the accuracy of SAND, which provides a correlation of ∼0.9 with ground truth on cases including highly overlapped simulated data sets, a two-compound mixture, and a urine sample spiked with different amounts of a four-compound mixture. We further demonstrate an automated annotation using correlation networks derived from SAND decomposed peaks, and on average, 74% of peaks for each compound can be recovered in single clusters. SAND is available in NMRbox, the cloud computing environment for NMR software hosted by the Network for Advanced NMR (NAN). Since the SAND method uses time-domain subsampling (i.e., random subset of time-domain points), it has the potential to be extended to a higher dimensionality and nonuniformly sampled data.",
                "authors": [
                    {
                        "name": "Delaglio F."
                    },
                    {
                        "name": "Edison A.S."
                    },
                    {
                        "name": "Hoch J.C."
                    },
                    {
                        "name": "Krishnamurthy K."
                    },
                    {
                        "name": "Sanati O."
                    },
                    {
                        "name": "Uchimiya M."
                    },
                    {
                        "name": "Wedell J."
                    },
                    {
                        "name": "Wu Y."
                    }
                ],
                "citationCount": 1,
                "date": "2024-02-06T00:00:00Z",
                "journal": "Analytical Chemistry",
                "title": "SAND: Automated Time-Domain Modeling of NMR Spectra Applied to Metabolite Quantification"
            },
            "pmcid": "PMC10896553",
            "pmid": "38273718"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
