{"credit":[{"email":"brent@wustl.edu","name":"Michael Brent","typeEntity":"Person","typeRoles":["Primary contact"]}],"function":[{"operation":[{"term":"Splice site prediction","uri":"http://edamontology.org/operation_0433"},{"term":"Gene prediction","uri":"http://edamontology.org/operation_2454"},{"term":"Mapping","uri":"http://edamontology.org/operation_2429"}]}],"labels":{"language":["Perl"],"operatingSystem":["Linux","Mac"],"toolType":["Web application"],"topic":[{"term":"Mapping","uri":"http://edamontology.org/topic_0102"},{"term":"Gene transcripts","uri":"http://edamontology.org/topic_3512"},{"term":"Sequence assembly","uri":"http://edamontology.org/topic_0196"},{"term":"Sequencing","uri":"http://edamontology.org/topic_3168"}]},"publication":[{"abstract":"The availability of draft sequences for both the mouse and human genomes makes it possible, for the first time, to annotate whole mammalian genomes using comparative methods. TWINSCAN is a gene-prediction system that combines the methods of single-genome predictors like GENSCAN with information derived from genome comparison, thereby improving accuracy. Because TWINSCAN uses genomic sequence only, it is less biased toward highly and/or ubiquitously expressed genes than GENEWISE, GENOMESCAN, and other methods based on evidence derived from transcripts. We show that TWINSCAN improves gene prediction in human using intermediate products from various stages of the sequencing and analysis of the mouse genome, from low-redundancy, whole-genome shotgun reads to the draft assembly and the synteny map. TWINSCAN improves on the prior state of the art even when alignments from only 1X coverage of the mouse genome are available. Gene prediction accuracy improves steadily from 1X through 3X, more slowly from 3X to 4X, and relatively little thereafter. The assembly and the synteny map greatly speed the computations, however. Our human annotation using the mouse assembly is conservative, predicting only 25,622 genes, and appears to be one of the best de novo annotations of the human genome to date.","authors":["Flicek P.","Keibler E.","Hu P.","Korf I.","Brent M.R."],"cit_count":75,"journal":"Genome research","pmid":"12529305","title":"Leveraging the mouse genome for gene prediction in human: from whole-genome shotgun reads to a global synteny map.","year":"2003-01-01"},{"abstract":"TWINSCAN is a new gene-structure prediction system that directly extends the probability model of GENSCAN, allowing it to exploit homology between two related genomes. Separate probability models are used for conservation in exons, introns, splice sites, and UTRs, reflecting the differences among their patterns of evolutionary conservation. TWINSCAN is specifically designed for the analysis of high-throughput genomic sequences containing an unknown number of genes. In experiments on high-throughput mouse sequences, using homologous sequences from the human genome, TWINSCAN shows notable improvement over GENSCAN in exon sensitivity and specificity and dramatic improvement in exact gene sensitivity and specificity. This improvement can be attributed entirely to modeling the patterns of evolutionary conservation in genomic sequence. © Oxford University Press 2001.","authors":["Korf I.","Flicek P.","Duan D.","Brent M.R."],"cit_count":322,"journal":"Bioinformatics","pmid":"11473003","title":"Integrating genomic homology into gene structure prediction","year":"2001-01-01"}],"summary":{"biotoolsCURIE":"biotools:twinscan","biotoolsID":"twinscan","description":"Twinscan is a system for predicting gene-structure in eukaryotic genomic sequences. In order to make its predictions, Twinscan combines the information from predicted coding regions and splice sites with conserservation measurements between the target sequence and sequences from a closely related genome. Currently sequences from mammalian genomes, and those of Arabidopsis thaliana, C. elegans, C. briggsae and strains JEC21 and H99 of Cryptococcus neoformans can be processed using Twinscan.","homepage":"http://genes.cs.wustl.edu/","name":"Twinscan"}}