{
    "accessibility": [
        "Open access"
    ],
    "additionDate": "2016-03-25T13:24:42Z",
    "biotoolsCURIE": "biotools:fastme",
    "biotoolsID": "fastme",
    "collectionID": [
        "galaxyPasteur",
        "FastME"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "name": "LIRMM",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ],
            "url": "http://www.lirmm.fr/"
        },
        {
            "email": "vincent.lefort@lirmm.fr",
            "name": "Vincent Lefort",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Distance algorithms to infer phylogenies. It's based on balanced minimum evolution, which is the very principle of NJ. It includes Nearest Neighbor Interchange (NNI) and also Subtree Pruning and Regrafting (SPR), while remaining as fast as NJ and providing a number of facilities: distance estimation for DNA and proteins with various models and options, bootstrapping, and parallel computations.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.atgc-montpellier.fr/fastme/usersguide.php"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://www.atgc-montpellier.fr/download/sources/fastme/fastme-2.1.4.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence",
                        "uri": "http://edamontology.org/data_2044"
                    },
                    "format": [
                        {
                            "term": "Phylip distance matrix",
                            "uri": "http://edamontology.org/format_1423"
                        },
                        {
                            "term": "PHYLIP format",
                            "uri": "http://edamontology.org/format_1997"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Phylogenetic tree generation (from molecular sequences)",
                    "uri": "http://edamontology.org/operation_0540"
                },
                {
                    "term": "Phylogenetic tree analysis",
                    "uri": "http://edamontology.org/operation_0324"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Phylogenetic tree",
                        "uri": "http://edamontology.org/data_0872"
                    },
                    "format": [
                        {
                            "term": "Phylip tree distance format",
                            "uri": "http://edamontology.org/format_1445"
                        },
                        {
                            "term": "newick",
                            "uri": "http://edamontology.org/format_1910"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://www.atgc-montpellier.fr/fastme/",
    "lastUpdate": "2020-01-21T14:19:33Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Galaxy service"
            ],
            "url": "https://galaxy.pasteur.fr/tool_runner?tool_id=toolshed.pasteur.fr/repos/fmareuil/fastme/fastme/2.1.5.1"
        },
        {
            "type": [
                "Service"
            ],
            "url": "http://www.atgc-montpellier.fr/fastme/"
        }
    ],
    "maturity": "Mature",
    "name": "FastME",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "vincent.lefort",
    "publication": [
        {
            "doi": "10.1093/molbev/msv150",
            "metadata": {
                "abstract": "© The Author 2015. Published by Oxford University Press on behalf of the Society for Molecular Biology and Evolution.FastME provides distance algorithms to infer phylogenies. FastME is based on balanced minimum evolution, which is the very principle of Neighbor Joining (NJ). FastME improves over NJ by performing topological moves using fast, sophisticated algorithms. The first version of FastME only included Nearest Neighbor Interchange. The new 2.0 version also includes Subtree Pruning and Regrafting, while remaining as fast as NJ and providing a number of facilities: Distance estimation for DNA and proteins with various models and options, bootstrapping, and parallel computations.",
                "authors": [
                    {
                        "name": "Lefort V."
                    },
                    {
                        "name": "Desper R."
                    },
                    {
                        "name": "Gascuel O."
                    }
                ],
                "citationCount": 122,
                "date": "2015-10-01T00:00:00Z",
                "journal": "Molecular Biology and Evolution",
                "title": "FastME 2.0: A comprehensive, accurate, and fast distance-based phylogeny inference program"
            },
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1089/106652702761034136",
            "metadata": {
                "abstract": "The Minimum Evolution (ME) approach to phylogeny estimation has been shown to be statistically consistent when it is used in conjunction with ordinary least-squares (OLS) fitting of a metric to a tree structure. The traditional approach to using ME has been to start with the Neighbor Joining (NJ) topology for a given matrix and then do a topological search from that starting point. The first stage requires O(n 3) time, where n is the number of taxa, while the current implementations of the second are in O(p n3) or more, where p is the number of swaps performed by the program. In this paper, we examine a greedy approach to minimum evolution which produces a starting topology in O(n2) time. Moreover, we provide an algorithm that searches for the best topology using nearest neighbor interchanges (NNIs), where the cost of doing p NNIs is O(n2 + p n), i.e., O(n2) in practice because p is always much smaller than n. The Greedy Minimum Evolution (GME) algorithm, when used in combination with NNIs, produces trees which are fairly close to NJ trees in terms of topological accuracy. We also examine ME under a balanced weighting scheme, where sibling subtrees have equal weight, as opposed to the standard \"unweighted\" OLS, where all taxa have the same weight so that the weight of a subtree is equal to the number of its taxa. The balanced minimum evolution scheme (BME) runs slower than the OLS version, requiring O(n2 x diam(T)) operations to build the starting tree and O(p n x diam(T)) to perform the NNIs, where diam(T) is the topological diameter of the output tree. In the usual Yule-Harding distribution on phylogenetic trees, the diameter expectation is in log(n), so our algorithms are in practice faster that NJ. Moreover, this BME scheme yields a very significant improvement over NJ and other distance-based algorithms, especially with large trees, in terms of topological accuracy.",
                "authors": [
                    {
                        "name": "Desper R."
                    },
                    {
                        "name": "Gascuel O."
                    }
                ],
                "citationCount": 271,
                "date": "2002-12-01T00:00:00Z",
                "journal": "Journal of Computational Biology",
                "title": "Fast and accurate phylogeny reconstruction algorithms based on the Minimum-Evolution principle"
            },
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        }
    ],
    "version": [
        "2.1.4"
    ]
}