{
    "additionDate": "2017-08-20T15:00:08Z",
    "biotoolsCURIE": "biotools:alder",
    "biotoolsID": "alder",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "email": "loh@hsph.harvard.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "alder detects and dates population admixtures based on patterns of linkage disequilibrium.",
    "documentation": [
        {
            "type": "General",
            "url": "https://groups.csail.mit.edu/cb/alder/alder_v1.03.tar.gz"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree analysis",
                    "uri": "http://edamontology.org/operation_0324"
                }
            ]
        }
    ],
    "homepage": "https://groups.csail.mit.edu/cb/alder/",
    "language": [
        "C"
    ],
    "lastUpdate": "2019-09-04T08:37:54Z",
    "license": "MIT",
    "name": "alder",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1534/genetics.112.147330",
            "metadata": {
                "abstract": "Long-range migrations and the resulting admixtures between populations have been important forces shaping human genetic diversity. Most existing methods for detecting and reconstructing historical admixture events are based on allele frequency divergences or patterns of ancestry segments in chromosomes of admixed individuals. An emerging new approach harnesses the exponential decay of admixture-induced linkage disequilibrium (LD) as a function of genetic distance. Here, we comprehensively develop LD-based inference into a versatile tool for investigating admixture. We present a new weighted LD statistic that can be used to infer mixture proportions as well as dates with fewer constraints on reference populations than previous methods. We define an LDbased three-population test for admixture and identify scenarios in which it can detect admixture events that previous formal tests cannot. We further show that we can uncover phylogenetic relationships among populations by comparing weighted LD curves obtained using a suite of references. Finally, we describe several improvements to the computation and fitting of weighted LD curves that greatly increase the robustness and speed of the calculations. We implement all of these advances in a software package, ALDER, which we validate in simulations and apply to test for admixture among all populations from the Human Genome Diversity Project (HGDP), highlighting insights into the admixture history of Central African Pygmies, Sardinians, and Japanese. © 2013 by the Genetics Society of America.",
                "authors": [
                    {
                        "name": "Loh P.-R."
                    },
                    {
                        "name": "Lipson M."
                    },
                    {
                        "name": "Patterson N."
                    },
                    {
                        "name": "Moorjani P."
                    },
                    {
                        "name": "Pickrell J.K."
                    },
                    {
                        "name": "Reich D."
                    },
                    {
                        "name": "Berger B."
                    }
                ],
                "citationCount": 132,
                "date": "2013-01-01T00:00:00Z",
                "journal": "Genetics",
                "title": "Inferring admixture histories of human populations using linkage disequilibrium"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        }
    ],
    "validated": 1,
    "version": [
        "1.03"
    ]
}