{
    "accessibility": "Open access",
    "additionDate": "2022-10-11T20:08:12.675277Z",
    "biotoolsCURIE": "biotools:nae",
    "biotoolsID": "nae",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Shiyu Xu"
        },
        {
            "name": "Chuanyuan Wang",
            "orcidid": "https://orcid.org/0000-0002-3206-1372"
        },
        {
            "name": "Zhi-Ping Liu",
            "orcidid": "https://orcid.org/0000-0001-7742-9161"
        }
    ],
    "description": "Evaluating gene regulatory network activity from dynamic expression data by regularized constraint programming.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                },
                {
                    "term": "Gene regulatory network prediction",
                    "uri": "http://edamontology.org/operation_2437"
                },
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                }
            ]
        }
    ],
    "homepage": "https://github.com/zpliulab/NAE",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2022-10-11T20:08:12.677810Z",
    "license": "MIT",
    "name": "NAE",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1109/JBHI.2022.3199243",
            "metadata": {
                "abstract": "IEEEBy extracting molecular interactions identified by experiments, gene regulatory networks or gene circuits have documented in a large number of knowledge-based repositories. They provide systematic information and guidance of the functional connections between regulators, e.g. transcription factor proteins and miRNAs, and target genes. Network activity is defined as the degree of consistency between a regulatory network architecture and a specific cellular context of gene expression and can also be measured as a score of statistical significance. The gene network activities are closely related to the dynamics of cell states. To evaluate the activity of regulatory events in the form of network, we propose a network activity evaluation (NAE) framework by measuring the consistency between network architecture and gene expression data across specific states based on mathematical programming. NAE firstly employs the dynamic Bayesian network model to formulate the network structure with time series profiling data. For the constraints of prior knowledge about gene regulatory network, NAE introduces an interpretable general loss function with regularization penalties to calculate the degree of consistency between gene network and gene expression data. Moreover, we design a fast and convergent alternating direction method of multipliers (ADMM) algorithm to optimize the regularized constraint programming. The efficiency and advantage of the NAE framework is deduced through numerous experiments and comparison studies. It reflects the possibility and potential of the match between network and data, thereby helping to reveal the network activity and to explain the dynamic responds underlying the network structure caused by changes in molecular environment of living cells. The code of NAE is freely available for academic use (https:&#x002F;&#x002F;github.com&#x002F;zpliulab&#x002F;NAE).",
                "authors": [
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Wang C."
                    },
                    {
                        "name": "Xu S."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "IEEE Journal of Biomedical and Health Informatics",
                "title": "Evaluating gene regulatory network activity from dynamic expression data by regularized constraint programming"
            },
            "pmid": "35976846"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}
