{
    "accessibility": "Open access",
    "additionDate": "2024-01-01T18:09:44.997686Z",
    "biotoolsCURIE": "biotools:roseap",
    "biotoolsID": "roseap",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "y_jiaotong@163.com",
            "name": "Jiaotong Yang",
            "typeEntity": "Person"
        },
        {
            "email": "zhanghui@nwnu.edu.cn",
            "name": "Hui Zhang",
            "typeEntity": "Person"
        }
    ],
    "description": "RoseAP is an analytical platform for gene function of Rosa rugosa . Users can submit locus IDs to quickly search for co-expression networks, expression profile. Additionally, the basic structural and functional annotations of each gene can be obtained, such as Pfam domains, gene families, KEGG metabolic pathways, GO terms, InterPro annotation, trEMBL annotation, SwissProt annotation and orthologues in 11 species. In addition, several tools are provided, including BLAST, orthologue convertion, sequence extraction and expression value extraction.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Gene functional annotation",
                    "uri": "http://edamontology.org/operation_3672"
                },
                {
                    "term": "Weighted correlation network analysis",
                    "uri": "http://edamontology.org/operation_3766"
                }
            ]
        }
    ],
    "homepage": "http://www.gzybioinformatics.cn/RoseAP/index.php",
    "lastUpdate": "2024-01-01T18:09:45.000358Z",
    "license": "CC-BY-4.0",
    "name": "RoseAP",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FPLS.2023.1197119",
            "metadata": {
                "abstract": "Rosa rugosa, a perennial shrub belonging to family Rosaceae, is a well-known ornamental plant. Its petals contain an abundance of essential oils and anthocyanins with enormous economic and health benefits when used as edible or cosmetic ingredients. The whole genome of R. rugosa was sequenced in 2021, which provided opportunities and challenges for gene regulation. However, many gene functions remain unknown. Therefore, an analytical platform named RoseAP (http://www.gzybioinformatics.cn/RoseAP/index.php) for the functional analysis of R. rugosa genes was constructed. It improved the gene annotation rate by integrating and analyzing genomic and transcriptomic datasets. First, 38,815 genes, covering 97.76% of the coding genes, were annotated functionally and structurally using a variety of algorithms and rules. Second, a total of 33 transcriptome samples were integrated, including 23 samples from our lab and 10 samples from the SRA database. A co-expression network containing approximately 29,657 positive or negative gene pairs, covering 74.7% of the coding genes, was constructed based on PCC and MR algorithms. Network analysis revealed that the DFR function was closely related to anthocyanin metabolism. It demonstrated the reliability of the network. Several SAUR genes of R. rugosa shared similar expression patterns. RoseAP was used to determine the sequence, structure, functional annotation, expression profile, regulatory network, and functional modules at the transcriptional and protein levels by inputting gene IDs. In addition, auxiliary analytical tools, including BLAST, gene set enrichment, orthologue conversion, gene sequence extraction, gene expression value extraction, and JBrowse, were utilized. Regular updates to RoseAP are expected to facilitate mining of gene function and promote genetic improvement in R. rugosa.",
                "authors": [
                    {
                        "name": "Da L."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Liu H."
                    },
                    {
                        "name": "Shi P."
                    },
                    {
                        "name": "Shi S."
                    },
                    {
                        "name": "Yang J."
                    },
                    {
                        "name": "Zhang H."
                    },
                    {
                        "name": "Zhang X."
                    },
                    {
                        "name": "Zhao F."
                    }
                ],
                "date": "2023-01-01T00:00:00Z",
                "journal": "Frontiers in Plant Science",
                "title": "RoseAP: an analytical platform for gene function of Rosa rugosa"
            },
            "pmcid": "PMC10348015",
            "pmid": "37457357"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
