{"collectionID": [], "accessibility": [], "topic": [{"term": "Transcription factors and regulatory sites", "uri": "http://edamontology.org/topic_0749"}, {"term": "Gene expression", "uri": "http://edamontology.org/topic_0203"}, {"term": "Gene regulation", "uri": "http://edamontology.org/topic_0204"}, {"term": "Molecular interactions, pathways and networks", "uri": "http://edamontology.org/topic_0602"}], "owner": "ELIXIR-EE", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": null, "note": null, "version": null, "pmid": "17485471", "type": null, "pmcid": null, "metadata": {"title": "SCOPE: A web server for practical de novo motif discovery", "abstract": "SCOPE is a novel parameter-free method for the de novo identification of potential regulatory motifs in sets of coordinately regulated genes. The SCOPE algorithm combines the output of three component algorithms, each designed to identify a particular class of motifs. Using an ensemble learning approach, SCOPE identifies the best candidate motifs from its component algorithms. In tests on experimentally determined datasets, SCOPE identified motifs with a significantly higher level of accuracy than a number of other web-based motif finders run with their default parameters. Because SCOPE has no adjustable parameters, the web server has an intuitive interface, requiring only a set of gene names or FASTA sequences and a choice of species. The most significant motifs found by SCOPE are displayed graphically on the main results page with a table containing summary statistics for each motif. Detailed motif information, including the sequence logo, PWM, consensus sequence and specific matching sites can be viewed through a single click on a motif. SCOPE's efficient, parameter-free search strategy has enabled the development of a web server that is readily accessible to the practising biologist while providing results that compare favorably with those of other motif finders. The SCOPE web server is at5http://genie.dartmouth.edu/scope4. © 2007 The Author(s).", "citationCount": 79, "authors": [{"name": "Carlson J.M."}, {"name": "Chakravarty A."}, {"name": "DeZiel C.E."}, {"name": "Gross R.H."}], "date": "2007-07-01T00:00:00Z", "journal": "Nucleic Acids Research"}}, {"doi": null, "note": null, "version": null, "pmid": "16706719", "type": null, "pmcid": null, "metadata": {"title": "BEAM: A beam search algorithm for the identification of cis-regulatory elements in groups of genes", "abstract": "The identification of potential protein binding sites (cis-regulatory elements) in the upstream regions of genes is key to understanding the mechanisms that regulate gene expression. To this end, we present a simple, efficient algorithm, BEAM (beam-search enumerative algorithm for motif finding), aimed at the discovery of cis-regulatory elements in the DNA sequences upstream of a related group of genes. This algorithm dramatically limits the search space of expanded sequences, converting the problem from one that is exponential in the length of motifs sought to one that is linear. Unlike sampling algorithms, our algorithm converges and is capable of finding statistically overrepresented motifs with a low failure rate. Further, our algorithm is not dependent on the objective function or the organism used. Limiting the space of candidate motifs enables the algorithm to focus only on those motifs that are most likely to be biologically relevant and enables the algorithm to use direct evaluations of background frequencies instead of resorting to probabilistic estimates. In addition, limiting the space of candidate motifs makes it possible to use computationally expensive objective functions that are able to correctly identify biologically relevant motifs. © Mary Ann Liebert, Inc.", "citationCount": 16, "authors": [{"name": "Carlson J.M."}, {"name": "Chakravarty A."}, {"name": "Gross R.H."}], "date": "2006-04-01T00:00:00Z", "journal": "Journal of Computational Biology"}}, {"doi": null, "note": null, "version": null, "pmid": "16700920", "type": null, "pmcid": null, "metadata": {"title": "Bounded search for de novo identification of degenerate cis-regulatory elements", "abstract": "Background: The identification of statistically overrepresented sequences in the upstream regions of coregulated genes should theoretically permit the identification of potential cis-regulatory elements. However, in practice many cis-regulatory elements are highly degenerate, precluding the use of an exhaustive word-counting strategy for their identification. While numerous methods exist for inferring base distributions using a position weight matrix, recent studies suggest that the independence assumptions inherent in the model, as well as the inability to reach a global optimum, limit this approach. Results: In this paper, we report PRISM, a degenerate motif finder that leverages the relationship between the statistical significance of a set of binding sites and that of the individual binding sites. PRISM first identifies overrepresented, non-degenerate consensus motifs, then iteratively relaxes each one into a high-scoring degenerate motif. This approach requires no tunable parameters, thereby lending itself to unbiased performance comparisons. We therefore compare PRISM's performance against nine popular motif finders on 28 well-characterized S. cerevisiae regulons. PRISM consistently outperforms all other programs. Finally, we use PRISM to predict the binding sites of uncharacterized regulons. Our results support a proposed mechanism of action for the yeast cell-cycle transcription factor Stb 1, whose binding site has not been determined experimentally. Conclusion: The relationship between statistical measures of the binding sites and the set as a whole leads to a simple means of identifying the diverse range of cis-regulatory elements to which a protein binds. This approach leverages the advantages of word-counting, in that position dependencies are implicitly accounted for and local optima are more easily avoided. While we sacrifice guaranteed optimality to prevent the exponential blowup of exhaustive search, we prove that the error is bounded and experimentally show that the performance is superior to other methods. A Java implementation of this algorithm can be downloaded from our web server at http://genie.dartmouth.edu/prism. © 2006 Carlson et al; licensee BioMed Central Ltd.", "citationCount": 17, "authors": [{"name": "Carlson J.M."}, {"name": "Chakravarty A."}, {"name": "Khetani R.S."}, {"name": "Gross R.H."}], "date": "2006-05-15T00:00:00Z", "journal": "BMC Bioinformatics"}}, {"doi": null, "note": null, "version": null, "pmid": "17470480", "type": null, "pmcid": null, "metadata": {"title": "SPACER: Identification of cis-regulatory elements with non-contiguous critical residues", "abstract": "Motivation: Many transcription factors bind to sites that are long and loosely related to each other. De novo identification of such motifs is computationally challenging. In this article, we propose a novel semi-greedy algorithm over the space of all IUPAC degenerate strings to identify the most over-represented highly degenerate motifs. Results: We present an implementation of this algorithm, named SPACER (Separated Pattern-based Algorithm for cis-Element Recognition) and demonstrate its effectiveness in identifying 'gapped' and highly degenerate motifs. We compare SPACER's performance against ten motif finders on 42 experimentally defined regulons from Bacillus subtilis, Escherichia coli and Saccharomyces cerevisiae. These motif finders cover a wide range of both enumerative and statistical approaches, including programs specifically designed for prokaryotic and 'gapped' motifs. © The Author 2007. Published by Oxford University Press. All rights reserved.", "citationCount": 18, "authors": [{"name": "Chakravarty A."}, {"name": "Carlson J.M."}, {"name": "Khetani R.S."}, {"name": "DeZiel C.E."}, {"name": "Gross R.H."}], "date": "2007-04-15T00:00:00Z", "journal": "Bioinformatics"}}, {"doi": null, "note": null, "version": null, "pmid": "17626633", "type": null, "pmcid": null, "metadata": {"title": "A novel ensemble learning method for de novo computational identification of DNA binding sites", "abstract": "Background: Despite the diversity of motif representations and search algorithms, the de novo computational identification of transcription factor binding sites remains constrained by the limited accuracy of existing algorithms and the need for user-specified input parameters that describe the motif being sought. Results: We present a novel ensemble learning method, SCOPE, that is based on the assumption that transcription factor binding sites belong to one of three broad classes of motifs: non-degenerate, degenerate and gapped motifs. SCOPE employs a unified scoring metric to combine the results from three motif finding algorithms each aimed at the discovery of one of these classes of motifs. We found that SCOPE's performance on 78 experimentally characterized regulons from four species was a substantial and statistically significant improvement over that of its component algorithms. SCOPE outperformed a broad range of existing motif discovery algorithms on the same dataset by a statistically significant margin. Conclusion: SCOPE demonstrates that combining multiple, focused motif discovery algorithms can provide a significant gain in performance. By building on components that efficiently search for motifs without user-defined parameters, SCOPE requires as input only a set of upstream sequences and a species designation, making it a practical choice for non-expert users. A user-friendly web interface, Java source code and executables are available at http://genie.dartmouth.edu/scope. © 2007 Chakravarty et al; licensee BioMed Central Ltd.", "citationCount": 35, "authors": [{"name": "Chakravarty A."}, {"name": "Carlson J.M."}, {"name": "Khetani R.S."}, {"name": "Gross R.H."}], "date": "2007-07-12T00:00:00Z", "journal": "BMC Bioinformatics"}}, {"doi": null, "note": null, "version": null, "pmid": "21047389", "type": null, "pmcid": null, "metadata": null}, {"doi": null, "note": null, "version": null, "pmid": "21673638", "type": null, "pmcid": null, "metadata": {"title": "Using SCOPE to identify potential regulatory motifs in coregulated genes.", "abstract": "SCOPE is an ensemble motif finder that uses three component algorithms in parallel to identify potential regulatory motifs by over-representation and motif position preference. Each component algorithm is optimized to find a different kind of motif. By taking the best of these three approaches, SCOPE performs better than any single algorithm, even in the presence of noisy data. In this article, we utilize a web version of SCOPE to examine genes that are involved in telomere maintenance. SCOPE has been incorporated into at least two other motif finding programs and has been used in other studies. The three algorithms that comprise SCOPE are BEAM, which finds non-degenerate motifs (ACCGGT), PRISM, which finds degenerate motifs (ASCGWT), and SPACER, which finds longer bipartite motifs (ACCnnnnnnnnGGT). These three algorithms have been optimized to find their corresponding type of motif. Together, they allow SCOPE to perform extremely well. Once a gene set has been analyzed and candidate motifs identified, SCOPE can look for other genes that contain the motif which, when added to the original set, will improve the motif score. This can occur through over-representation or motif position preference. Working with partial gene sets that have biologically verified transcription factor binding sites, SCOPE was able to identify most of the rest of the genes also regulated by the given transcription factor. Output from SCOPE shows candidate motifs, their significance, and other information both as a table and as a graphical motif map. FAQs and video tutorials are available at the SCOPE web site which also includes a \"Sample Search\" button that allows the user to perform a trial run. Scope has a very friendly user interface that enables novice users to access the algorithm's full power without having to become an expert in the bioinformatics of motif finding. As input, SCOPE can take a list of genes, or FASTA sequences. These can be entered in browser text fields, or read from a file. The output from SCOPE contains a list of all identified motifs with their scores, number of occurrences, fraction of genes containing the motif, and the algorithm used to identify the motif. For each motif, result details include a consensus representation of the motif, a sequence logo, a position weight matrix, and a list of instances for every motif occurrence (with exact positions and \"strand\" indicated). Results are returned in a browser window and also optionally by email. Previous papers describe the SCOPE algorithms in detail.", "citationCount": 2, "authors": [{"name": "Martyanov V."}, {"name": "Gross R.H."}], "date": "2011-01-01T00:00:00Z", "journal": "Journal of visualized experiments : JoVE"}}], "homepage_status": 1, "credit": [], "biotoolsCURIE": "biotools:scope", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "http://genie.dartmouth.edu/scope/", "function": [{"note": null, "input": [], "operation": [{"term": "Sequence motif discovery", "uri": "http://edamontology.org/operation_0238"}, {"term": "Transcription factor binding site prediction", "uri": "http://edamontology.org/operation_0445"}, {"term": "Over-representation analysis", "uri": "http://edamontology.org/operation_3501"}, {"term": "Regulatory element prediction", "uri": "http://edamontology.org/operation_0438"}, {"term": "Transcriptional regulatory element prediction", "uri": "http://edamontology.org/operation_0438"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:40Z", "otherID": [], "description": "Set of programs aimed at identifying novel cis-regulatory elements from groups of upstream sequences. It does not have any nuisance parameters so does not require the user to guess what the results might be. It is also very robust to noisy data and is still 50% as accurate even in the presence of 4-fold noise. It can also identify other genes in the genome that might be coregulated with the original gene set.", "toolType": ["Web application"], "editPermission": {"type": "private", "authors": []}, "language": [], "link": [], "biotoolsID": "scope", "additionDate": "2017-03-24T11:45:12Z", "name": "SCOPE", "license": null, "documentation": [], "maturity": null, "confidence_flag": null, "operatingSystem": []}