{
    "additionDate": "2022-09-30T07:09:48.904816Z",
    "biotoolsCURIE": "biotools:chemopred",
    "biotoolsID": "chemopred",
    "credit": [
        {
            "name": "Gajendra P.S. Raghava",
            "url": "https://webs.iiitd.edu.in/raghava/chemopred/index.html"
        }
    ],
    "description": "A server to predict chemokines and their receptors.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/chemopred/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "https://webs.iiitd.edu.in/raghava/chemopred/index.html",
    "lastUpdate": "2022-09-30T07:10:55.860800Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/chemopred/index.html"
        }
    ],
    "name": "chemopred",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "raghavagps",
    "publication": [
        {
            "doi": "10.1093/protein/gzp016",
            "metadata": {
                "abstract": "Chemokines are low molecular mass cytokine-like proteins that orchestrate myriads of immune functions like leukocyte trafficking, T cell differentiation, angiogenesis, hematopeosis and mast cell degranulation. Chemokines also play a role as HIV-1 inhibitor and act as potent natural adjuvant in antitumor immunotherapy. Receptors for these molecules are all seven-pass transmembrane G-protein-coupled receptors that are intimately involved with chemokines in a wide array of physiological and pathological conditions. These receptors also have a major role as co-receptors for HIV-1 entry into target cells. Therefore, chemokine receptors have proven to be excellent targets for small molecule in pharmaceutical industry. The immense importance of chemokines and their receptors motivated us to develop a support vector machine-based method ChemoPred to predict this important class of proteins and further classify them into subfamilies. ChemoPred is capable of predicting chemokines and chemokine receptors with an accuracy of 95.08% and 92.19%, respectively. The overall accuracy of classification of chemokines into three subfamilies was 96.00% and that of chemokine receptors into three families was 92.87%. The server ChemoPred is freely available at www.imtech.res.in/raghava/chemopred. © The Author 2009. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Lata S."
                    },
                    {
                        "name": "Raghava G.P.S."
                    }
                ],
                "citationCount": 8,
                "date": "2009-07-01T00:00:00Z",
                "journal": "Protein Engineering, Design and Selection",
                "title": "Prediction and classification of chemokines and their receptors"
            },
            "pmid": "19491216"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ]
}
