{
    "accessibility": [],
    "additionDate": "2017-01-13T13:14:54Z",
    "biotoolsCURIE": "biotools:geoseq",
    "biotoolsID": "geoseq",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": "anthony.cancio@mssm.edu",
            "gridid": null,
            "name": "Anthony Cancio",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        }
    ],
    "description": "Instead of mapping the reads to reference genomes or sequences, Geoseq maps a reference sequence against the sequencing data. It is web-based, and holds pre-computed data from public libraries.",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "http://katahdin.mssm.edu/web_tools/geoseq/pdf/geoseq_bmc.pdf"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://katahdin.mssm.edu/web_tools/geoseq/",
    "homepage_status": 1,
    "language": [],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "license": null,
    "link": [],
    "maturity": "Mature",
    "name": "Geoseq",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "seqwiki_import",
    "publication": [
        {
            "doi": null,
            "metadata": {
                "abstract": "Background: Datasets generated on deep-sequencing platforms have been deposited in various public repositories such as the Gene Expression Omnibus (GEO), Sequence Read Archive (SRA) hosted by the NCBI, or the DNA Data Bank of Japan (ddbj). Despite being rich data sources, they have not been used much due to the difficulty in locating and analyzing datasets of interest.Results: Geoseq http://geoseq.mssm.edu provides a new method of analyzing short reads from deep sequencing experiments. Instead of mapping the reads to reference genomes or sequences, Geoseq maps a reference sequence against the sequencing data. It is web-based, and holds pre-computed data from public libraries. The analysis reduces the input sequence to tiles and measures the coverage of each tile in a sequence library through the use of suffix arrays. The user can upload custom target sequences or use gene/miRNA names for the search and get back results as plots and spreadsheet files. Geoseq organizes the public sequencing data using a controlled vocabulary, allowing identification of relevant libraries by organism, tissue and type of experiment.Conclusions: Analysis of small sets of sequences against deep-sequencing datasets, as well as identification of public datasets of interest, is simplified by Geoseq. We applied Geoseq to, a) identify differential isoform expression in mRNA-seq datasets, b) identify miRNAs (microRNAs) in libraries, and identify mature and star sequences in miRNAS and c) to identify potentially mis-annotated miRNAs. The ease of using Geoseq for these analyses suggests its utility and uniqueness as an analysis tool. © 2010 Gurtowski et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Gurtowski J."
                    },
                    {
                        "name": "Cancio A."
                    },
                    {
                        "name": "Shah H."
                    },
                    {
                        "name": "Levovitz C."
                    },
                    {
                        "name": "George A."
                    },
                    {
                        "name": "Homann R."
                    },
                    {
                        "name": "Sachidanandam R."
                    }
                ],
                "citationCount": 3,
                "date": "2010-10-12T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Geoseq: A tool for dissecting deep-sequencing datasets"
            },
            "note": null,
            "pmcid": null,
            "pmid": "20939882",
            "type": null,
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1,
    "version": []
}