{
    "additionDate": "2018-11-27T07:44:43Z",
    "biotoolsCURIE": "biotools:skelesim",
    "biotoolsID": "skelesim",
    "credit": [
        {
            "email": "stranda@gmail.com",
            "name": "Allan Strand",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "Christian Parobek",
            "orcidid": "http://orcid.org/0000-0002-4511-3493",
            "typeEntity": "Person",
            "typeRole": [
                "Contributor"
            ]
        }
    ],
    "description": "skeleSim guides users in choosing appropriate simulations, setting parameters, calculating genetic summary statistics, and organizing data output, in a reproducible pipeline within the R environment.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://cran.r-project.org/web/packages/skeleSim/skeleSim.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical modelling",
                    "uri": "http://edamontology.org/operation_3664"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/skeleSim/index.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-13T17:48:12Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/christianparobek/skeleSim"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/christianparobek/skeleSim/issues"
        }
    ],
    "name": "skeleSim",
    "operatingSystem": [
        "Windows",
        "Mac"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1111/1755-0998.12607",
            "metadata": {
                "abstract": "© 2016 John Wiley & Sons LtdSimulations are a key tool in molecular ecology for inference and forecasting, as well as for evaluating new methods. Due to growing computational power and a diversity of software with different capabilities, simulations are becoming increasingly powerful and useful. However, the widespread use of simulations by geneticists and ecologists is hindered by difficulties in understanding these softwares' complex capabilities, composing code and input files, a daunting bioinformatics barrier and a steep conceptual learning curve. skelesim (an R package) guides users in choosing appropriate simulations, setting parameters, calculating genetic summary statistics and organizing data output, in a reproducible pipeline within the R environment. skelesim is designed to be an extensible framework that can ‘wrap’ around any simulation software (inside or outside the R environment) and be extended to calculate and graph any genetic summary statistics. Currently, skelesim implements coalescent and forward-time models available in the fastsimcoal2 and rmetasim simulation engines to produce null distributions for multiple population genetic statistics and marker types, under a variety of demographic conditions. skelesim is intended to make simulations easier while still allowing full model complexity to ensure that simulations play a fundamental role in molecular ecology investigations. skelesim can also serve as a teaching tool: demonstrating the outcomes of stochastic population genetic processes; teaching general concepts of simulations; and providing an introduction to the R environment with a user-friendly graphical user interface (using shiny).",
                "authors": [
                    {
                        "name": "Parobek C.M."
                    },
                    {
                        "name": "Archer F.I."
                    },
                    {
                        "name": "DePrenger-Levin M.E."
                    },
                    {
                        "name": "Hoban S.M."
                    },
                    {
                        "name": "Liggins L."
                    },
                    {
                        "name": "Strand A.E."
                    }
                ],
                "citationCount": 6,
                "date": "2017-01-01T00:00:00Z",
                "journal": "Molecular Ecology Resources",
                "title": "skelesim: an extensible, general framework for population genetic simulation in R"
            },
            "pmcid": "PMC5161633",
            "pmid": "27736016",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}