{"credit":[{"email":"luis.serrano@crg.es","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://serrano.crg.es/"}],"documentation":[{"url":"http://software.crg.es/smartcell/smartcell-simulation-description"}],"function":[{"operation":[{"term":"Network simulation","uri":"http://edamontology.org/operation_3562"}]}],"labels":{"operatingSystem":["Linux","Windows"],"toolType":["Desktop application"],"topic":[{"term":"Systems biology","uri":"http://edamontology.org/topic_2259"},{"term":"Cell biology","uri":"http://edamontology.org/topic_2229"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/smartcell-v4-3-beta3-a-cell-network-simulation-program.html"}],"publication":[{"abstract":"SmartCell has been developed to be a general framework for modelling and simulation of diffusion-reaction networks in a whole-cell context. It supports localisation and diffusion by using a mesoscopic stochastic reaction model. The SmartCell package can handle any cell geometry, considers different cell compartments, allows localisation of species, supports DNA transcription and translation, membrane diffusion and multistep reactions, as well as cell growth. Moreover, different temporal and spatial constraints can be applied to the model. A GUI interface that facilitates model making is also available. In this work we discuss limitations and advantages arising from the approach used in SmartCell and determine the impact of localisation on the behaviour of simple well-defined networks, previously analysed with differential equations. Our results show that this factor might play an important role in the response of networks and cannot be neglected in cell simulations.","authors":["Ander M.","Beltrao P.","Di Ventura B.","Ferkinghoff-Borg J.","Foglierini M.","Kaplan A.","Lemerle C.","Tomas-Oliveira I.","Serrano L."],"cit_count":98,"journal":"Systems biology","pmid":"17052123","title":"SmartCell, a framework to simulate cellular processes that combines stochastic approximation with diffusion and localisation: analysis of simple networks.","year":"2004-01-01"}],"summary":{"biotoolsCURIE":"biotools:smartcell","biotoolsID":"smartcell","description":"A program developed to provide an idea of the evolution of a network in a whole, single cell. Based on stochastic algorithms, the program needs multiple runs to have mean results.","homepage":"http://software.crg.es/smartcell/","name":"SmartCell v4.3"}}