{
    "additionDate": "2021-01-18T12:15:48Z",
    "biotoolsCURIE": "biotools:pdmethdb",
    "biotoolsID": "pdmethdb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "GarryGWong@um.edu.mo",
            "name": "Garry Wong",
            "typeEntity": "Person"
        }
    ],
    "description": "A curated Parkinson's disease associated methylation information database.\n\nParkinson's disease (PD) is the second most common neurodegenerative disease, of which the histopathological hallmark is the formation of Lewy bodies consisting of α-synuclein as the major component. α-Synuclein can sequester DNA Methyltransferase 1 (DNMT1), the maintenance DNA methylation enzyme, from the nucleus and into the cytoplasm, leading to global DNA hypomethylation in human brain. As DNA methylation is a major epigenetic modification that regulates gene expression and there is no specific database storing PD associated methylation information, PDmethDB (Parkinson's Disease Methylation Database) aims to curate PD associated methylation information from literature to facilitate the study of the relationship between PD and methylation",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene methylation analysis",
                    "uri": "http://edamontology.org/operation_3207"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Network visualisation",
                    "uri": "http://edamontology.org/operation_3925"
                }
            ]
        }
    ],
    "homepage": "https://ageing.shinyapps.io/pdmethdb/",
    "lastUpdate": "2021-01-23T07:21:34Z",
    "name": "PDmethDB",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1016/J.CSBJ.2020.11.015",
            "metadata": {
                "abstract": "© 2020 The AuthorsParkinson's disease (PD) is the second most common neurodegenerative disease, of which the histopathological hallmark is the formation of Lewy bodies consisting of α-synuclein as the major component. α-Synuclein can sequester DNA Methyltransferase 1 (DNMT1), the maintenance DNA methylation enzyme, from the nucleus and into the cytoplasm, leading to global DNA hypomethylation in human brain. As DNA methylation is a major epigenetic modification that regulates gene expression and there is no specific database storing PD associated methylation information, PDmethDB (Parkinson's Disease Methylation Database) aims to curate PD associated methylation information from literature to facilitate the study of the relationship between PD and methylation. Currently, PDmethDB contains 97,077 PD methylation associated entries among 12,308 molecules, 37,944 CpG sites, 31 tissues and 3 species through a review of about 1600 published papers. This includes information concerning the gene/molecule name, CpG site, methylation alteration, expression alteration, tissue, PMID, experimental method, and a brief description about the entry. PDmethDB provides a user-friendly interface to search, browse, download and submit data. PDmethDB supports browsing by molecule, species, tissue, gene region, methylation alteration and experimental methods. PDmethDB also shows the entry gene interaction network including protein–protein interactions and miRNA-targets interactions with a highlight of PD associated genes from DisGeNET database. PDmethDB aims to facilitate the understanding of the relationship between PD and methylation. Database URL: https://ageing.shinyapps.io/pdmethdb/",
                "authors": [
                    {
                        "name": "Wang C."
                    },
                    {
                        "name": "Chen L."
                    },
                    {
                        "name": "Zhang M."
                    },
                    {
                        "name": "Yang Y."
                    },
                    {
                        "name": "Wong G."
                    }
                ],
                "citationCount": 1,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Computational and Structural Biotechnology Journal",
                "title": "PDmethDB: A curated Parkinson's disease associated methylation information database"
            },
            "pmcid": "PMC7714663",
            "pmid": "33304468"
        }
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        }
    ],
    "validated": 1
}