{
    "name": "AffyProbeMiner", 
    "description": "AffyProbeMiner is to re-define chip definition files (CDFs) for Affymetrix chips taking into account the most recent genomic sequence information. It re-groups probes in Affymetrix chips into probe sets according to a list of non-redundant verified complete coding sequences available in GenBank and RefSeq. Pre-computed CDFs for several chips are available for download.", 
    "homepage": "http://discover.nci.nih.gov/affyprobeminer/", 
    "biotoolsID": "affyprobeminer", 
    "biotoolsCURIE": "biotools:affyprobeminer", 
    "version": [
        "1.0"
    ], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2495", 
                    "term": "Microarray data analysis"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0080", 
            "term": "Sequences"
        }, 
        {
            "uri": "http://edamontology.org/topic_0632", 
            "term": "Probes"
        }, 
        {
            "uri": "http://edamontology.org/topic_3179", 
            "term": "ChiP"
        }
    ], 
    "operatingSystem": [
        "Linux"
    ], 
    "language": [
        "Perl"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/affyprobeminer-1-0-computing-retrieving-accurately-redefined-affymetrix-probe-sets.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://bioinformatics.oxfordjournals.org/content/23/18/2385.full.pdf", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btm360", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "AffyProbeMiner: A web resource for computing or retrieving accurately redefined Affymetrix probe sets", 
                "abstract": "Motivation: Affymetrix microarrays are widely used to measure global expression of mRNA transcripts. That technology is based on the concept of a probe set. Individual probes within a probe set were originally designated by Affymetrix to hybridize with the same unique mRNA transcript. Because of increasing accuracy in knowledge of genomic sequences, however, a substantial number of the manufacturer's original probe groupings and mappings are now known to be inaccurate and must be corrected. Otherwise, analysis and interpretation of an Affymetrix microarray experiment will be in error. Results: AffyProbeMiner is a computationally efficient platform-independent tool that uses all RefSeq mature RNA protein coding transcripts and validated complete coding sequences in GenBank to (1) regroup the individual probes into consistent probe sets and (2) remap the probe sets to the correct sets of mRNA transcripts. The individual probes are grouped into probe sets that are 'transcript-consistent' in that they hybridize to the same mRNA transcript (or transcripts) and, therefore, measure the same entity (or entities). About 65.6% of the probe sets on the HG-U133A chip were affected by the remapping. Pre-computed regrouped and remapped probe sets for many Affymetrix microarrays are made freely available at the AffyProbeMiner web site. Alternatively, we provide a web service that enables the user to perform the remapping for any type of short-oligo commercial or custom array that has an Affymetrix-format Chip Definition File (CDF). Important features that differentiate AffyProbeMiner from other approaches are flexibility in the handling of splice variants, computational efficiency, extensibility, customizability and user-friendliness of the interface. © 2007 The Author(s).", 
                "date": "2007-09-15T00:00:00Z", 
                "citationCount": 56, 
                "authors": [
                    {
                        "name": "Liu H."
                    }, 
                    {
                        "name": "Zeeberg B.R."
                    }, 
                    {
                        "name": "Qu G."
                    }, 
                    {
                        "name": "Koru A.G."
                    }, 
                    {
                        "name": "Ferrucci A."
                    }, 
                    {
                        "name": "Kahn A."
                    }, 
                    {
                        "name": "Ryan M.C."
                    }, 
                    {
                        "name": "Nuhanovic A."
                    }, 
                    {
                        "name": "Munson P.J."
                    }, 
                    {
                        "name": "Reinhold W.C."
                    }, 
                    {
                        "name": "Kane D.W."
                    }, 
                    {
                        "name": "Weinstein J.N."
                    }
                ], 
                "journal": "Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": "barry@discover.nci.nih.gov", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-12-18T00:03:24Z", 
    "lastUpdate": "2018-12-10T12:58:57Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}