{
    "additionDate": "2018-05-29T11:05:57Z",
    "biotoolsCURIE": "biotools:aureolib",
    "biotoolsID": "aureolib",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "email": "info@aureolib.de",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Proteomic signature library of Staphylococcus aureus Pathophysiology for inter-experimental expression data analyses.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.aureolib.de/index.php?page=about"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                }
            ]
        }
    ],
    "homepage": "http://www.aureolib.de/index.php",
    "language": [
        "PHP",
        "SQL"
    ],
    "lastUpdate": "2019-03-26T08:11:48Z",
    "name": "Aureolib",
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0070669",
            "metadata": {
                "abstract": "Gel-based proteomics is a powerful approach to study the physiology of Staphylococcus aureus under various growth restricting conditions. We analyzed 679 protein spots from a reference 2-dimensional gel of cytosolic proteins of S. aureus COL by mass spectrometry resulting in 521 different proteins. 4,692 time dependent protein synthesis profiles were generated by exposing S. aureus to nine infection-related stress and starvation stimuli (H2O2, diamide, paraquat, NO, fermentation, nitrate respiration, heat shock, puromycin, mupirocin). These expression profiles are stored in an online resource called Aureolib (http://www.aureolib.de). Moreover, information on target genes of 75 regulators and regulatory elements were included in the database. Cross-comparisons of this extensive data collection of protein synthesis profiles using the tools implemented in Aureolib lead to the identification of stress and starvation specific marker proteins. Altogether, 226 protein synthesis profiles showed induction ratios of 2.5-fold or higher under at least one of the tested conditions with 157 protein synthesis profiles specifically induced in response to a single stimulus. The respective proteins might serve as marker proteins for the corresponding stimulus. By contrast, proteins whose synthesis was increased or repressed in response to more than four stimuli are rather exceptional. The only protein that was induced by six stimuli is the universal stress protein SACOL1759. Most strikingly, cluster analyses of synthesis profiles of proteins differentially synthesized under at least one condition revealed only in rare cases a grouping that correlated with known regulon structures. The most prominent examples are the GapR, Rex, and CtsR regulon. In contrast, protein synthesis profiles of proteins belonging to the CodY and σB regulon are widely distributed. In summary, Aureolib is by far the most comprehensive protein expression database for S. aureus and provides an essential tool to decipher more complex adaptation processes in S. aureus during host pathogen interaction. © 2013 Fuchs et al.",
                "authors": [
                    {
                        "name": "Albrecht D."
                    },
                    {
                        "name": "Binh L.T.N."
                    },
                    {
                        "name": "Engelmann S."
                    },
                    {
                        "name": "Fuchs S."
                    },
                    {
                        "name": "Hecker M."
                    },
                    {
                        "name": "Kusch H."
                    },
                    {
                        "name": "Pane-Farre J."
                    },
                    {
                        "name": "Reiss S."
                    },
                    {
                        "name": "Riedel K."
                    },
                    {
                        "name": "Wolf C."
                    },
                    {
                        "name": "Zuhlke D."
                    }
                ],
                "citationCount": 23,
                "date": "2013-08-13T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Aureolib - A Proteome Signature Library: Towards an Understanding of Staphylococcus aureus Pathophysiology"
            },
            "pmcid": "PMC3742771",
            "pmid": "23967085"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ],
    "validated": 1,
    "version": [
        "1.2"
    ]
}
