{
    "additionDate": "2019-11-14T19:43:20Z",
    "biotoolsCURIE": "biotools:bAIcis",
    "biotoolsID": "bAIcis",
    "confidence_flag": "tool",
    "description": "A Novel Bayesian Network Structural Learning Algorithm and Its Comprehensive Performance Evaluation Against Open-Source Software | Structural learning of Bayesian networks (BNs) from observational data has gained increasing applied use and attention from various scientific and industrial areas. The mathematical theory of BNs and their optimization is well developed. Although there are several open-source BN learners in the public domain, none of them are able to handle both small and large feature space data and recover network structures with acceptable accuracy. bAIcis® is a novel BN learning and simulation software from BERG. It was developed with the goal of learning BNs from \"Big Data\" in health care, often exceeding hundreds of thousands features when research is conducted in genomics or multi-omics. This article provides a comprehensive performance evaluation of bAIcis and its comparison with the open-source BN learners",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31486672",
    "lastUpdate": "2020-12-03T07:32:19Z",
    "name": "bAIcis",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1089/CMB.2019.0210",
            "metadata": {
                "abstract": "© Lixia Zhang, et al., 2020. Published by Mary Ann Liebert, Inc. 2020.Structural learning of Bayesian networks (BNs) from observational data has gained increasing applied use and attention from various scientific and industrial areas. The mathematical theory of BNs and their optimization is well developed. Although there are several open-source BN learners in the public domain, none of them are able to handle both small and large feature space data and recover network structures with acceptable accuracy. bAIcis® is a novel BN learning and simulation software from BERG. It was developed with the goal of learning BNs from \"Big Data\" in health care, often exceeding hundreds of thousands features when research is conducted in genomics or multi-omics. This article provides a comprehensive performance evaluation of bAIcis and its comparison with the open-source BN learners. The study investigated synthetic datasets of discrete, continuous, and mixed data in small and large feature space, respectively. The results demonstrated that bAIcis outperformed the publicly available algorithms in structure recovery precision in almost all of the evaluated settings, achieving the true positive rates of 0.9 and precision of 0.8. In addition, bAIcis supports all data types, including continuous, discrete, and mixed variables. It is effectively parallelized on a distributed system and can work with datasets of thousands of features that are infeasible for any of the publicly available tools with a desired level of recovery accuracy.",
                "authors": [
                    {
                        "name": "Zhang L."
                    },
                    {
                        "name": "Rodrigues L.O."
                    },
                    {
                        "name": "Narain N.R."
                    },
                    {
                        "name": "Akmaev V.R."
                    }
                ],
                "citationCount": 1,
                "date": "2020-05-01T00:00:00Z",
                "journal": "Journal of Computational Biology",
                "title": "BAIcis: A Novel Bayesian Network Structural Learning Algorithm and Its Comprehensive Performance Evaluation Against Open-Source Software"
            },
            "pmid": "31486672"
        }
    ],
    "topic": [
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Electron microscopy",
            "uri": "http://edamontology.org/topic_0611"
        }
    ],
    "validated": 1
}