{
    "additionDate": "2025-07-10T12:32:00.838316Z",
    "biotoolsCURIE": "biotools:inmoose",
    "biotoolsID": "inmoose",
    "credit": [
        {
            "name": "Maximilien Colange",
            "orcidid": "https://orcid.org/0000-0003-4769-3302",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "Epigene Labs",
            "url": "https://www.epigenelabs.com/"
        }
    ],
    "description": "InMoose, the INtegrated Multi-Omic Open-Source environment, ports to Python state-of-the-art R tools for the analysis of transcriptomic data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://inmoose.readthedocs.io/en/stable/"
        },
        {
            "type": [
                "Quick start guide"
            ],
            "url": "https://colab.research.google.com/drive/1bzmNDZeaw1A6tSgfx61O6PFtaQDve6SV?usp=sharing"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Count matrix",
                        "uri": "http://edamontology.org/data_3917"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                }
            ]
        }
    ],
    "homepage": "https://github.com/epigenelabs/inmoose",
    "language": [
        "Python"
    ],
    "lastUpdate": "2025-07-10T13:00:37.310588Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/epigenelabs/inmoose/issues"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/epigenelabs/inmoose"
        }
    ],
    "maturity": "Mature",
    "name": "InMoose",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "maximilien.colange",
    "publication": [
        {
            "doi": "10.1038/s41598-025-03376-y",
            "metadata": {
                "abstract": "We introduce InMoose, an open-source Python environment aimed at omic data analysis. We illustrate its capabilities for bulk transcriptomic data analysis. Due to its wide adoption, Python has grown as a de facto standard in fields increasingly important for bioinformatic pipelines, such as data science, machine learning, or artificial intelligence (AI). As a general-purpose language, Python is also recognized for its versatility and scalability. InMoose aims at bringing state-of-the-art tools, historically written in R, to the Python ecosystem. InMoose focuses on providing drop-in replacements for R tools, to ensure consistency and reproducibility between R-based and Python-based pipelines. The first development phase has focused on bulk transcriptomic data, with current capabilities encompassing data simulation, batch effect correction, and differential analysis and meta-analysis.",
                "authors": [
                    {
                        "name": "Appe G."
                    },
                    {
                        "name": "Behdenna A."
                    },
                    {
                        "name": "Colange M."
                    },
                    {
                        "name": "Johnson W.E."
                    },
                    {
                        "name": "Meunier L."
                    },
                    {
                        "name": "Nordor A."
                    },
                    {
                        "name": "Weill S."
                    }
                ],
                "citationCount": 1,
                "date": "2025-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "Bridging the gap between R and Python in bulk transcriptomic data analysis with InMoose"
            },
            "type": [
                "Primary",
                "Usage"
            ]
        },
        {
            "doi": "10.1186/s12859-023-05578-5",
            "metadata": {
                "abstract": "Background: Variability in datasets is not only the product of biological processes: they are also the product of technical biases. ComBat and ComBat-Seq are among the most widely used tools for correcting those technical biases, called batch effects, in, respectively, microarray and RNA-Seq expression data. Results: In this technical note, we present a new Python implementation of ComBat and ComBat-Seq. While the mathematical framework is strictly the same, we show here that our implementations: (i) have similar results in terms of batch effects correction; (ii) are as fast or faster than the original implementations in R and; (iii) offer new tools for the bioinformatics community to participate in its development. pyComBat is implemented in the Python language and is distributed under GPL-3.0 (https://www.gnu.org/licenses/gpl-3.0.en.html) license as a module of the inmoose package. Source code is available at https://github.com/epigenelabs/inmoose and Python package at https://pypi.org/project/inmoose . Conclusions: We present a new Python implementation of state-of-the-art tools ComBat and ComBat-Seq for the correction of batch effects in microarray and RNA-Seq data. This new implementation, based on the same mathematical frameworks as ComBat and ComBat-Seq, offers similar power for batch effect correction, at reduced computational cost.",
                "authors": [
                    {
                        "name": "Appe G."
                    },
                    {
                        "name": "Azencott C.-A."
                    },
                    {
                        "name": "Behdenna A."
                    },
                    {
                        "name": "Colange M."
                    },
                    {
                        "name": "Gema A."
                    },
                    {
                        "name": "Haziza J."
                    },
                    {
                        "name": "Nordor A."
                    }
                ],
                "citationCount": 30,
                "date": "2023-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "pyComBat, a Python tool for batch effects correction in high-throughput molecular data using empirical Bayes methods"
            },
            "type": [
                "Benchmarking study",
                "Method"
            ]
        },
        {
            "doi": "10.1186/s12859-025-06180-7",
            "metadata": {
                "abstract": "Background: Differential gene expression analysis is a prominent technique for the analysis of biomolecular data to identify genetic features associated with phenotypes. Limma—for microarray data –, and edgeR and DESeq2—for RNA-Seq data–, are the most widely used tools for differential gene expression analysis of bulk transcriptomic data. Results: We present the differential expression features of InMoose, a Python implementation of R tools limma, edgeR, and DESeq2. We experimentally show that InMoose stands as a drop-in replacement for those tools, with nearly identical results. This ensures reproducibility when interfacing both languages in bioinformatic pipelines. InMoose is an open source software released under the GPL3 license, available at www.github.com/epigenelabs/inmoose and https://inmoose.readthedocs.io. Conclusions: We present a new Python implementation of state-of-the-art tools limma, edgeR, and DESeq2, to perform differential gene expression analysis of bulk transcriptomic data. This new implementation exhibits results nearly identical to the original tools, improving interoperability and reproducibility between Python and R bioinformatics pipelines.",
                "authors": [
                    {
                        "name": "Appe G."
                    },
                    {
                        "name": "Behdenna A."
                    },
                    {
                        "name": "Colange M."
                    },
                    {
                        "name": "Meunier L."
                    },
                    {
                        "name": "Nordor A."
                    },
                    {
                        "name": "Weill S."
                    }
                ],
                "date": "2025-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Differential expression analysis with inmoose, the integrated multi-omic open-source environment in Python"
            },
            "type": [
                "Benchmarking study",
                "Method"
            ]
        }
    ],
    "relation": [
        {
            "biotoolsID": "deseq2",
            "type": "isNewVersionOf"
        },
        {
            "biotoolsID": "edger",
            "type": "isNewVersionOf"
        },
        {
            "biotoolsID": "limma",
            "type": "isNewVersionOf"
        }
    ],
    "toolType": [
        "Library"
    ],
    "version": [
        "0.8.0"
    ]
}
