{
    "accessibility": "Open access",
    "additionDate": "2022-10-02T21:26:59.773752Z",
    "biotoolsCURIE": "biotools:iifdti",
    "biotoolsID": "iifdti",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jxwang@mail.csu.edu.cn",
            "name": "Jianxin Wang",
            "orcidid": "https://orcid.org/0000-0003-1516-0480",
            "typeEntity": "Person"
        },
        {
            "name": "Yaohang Li"
        },
        {
            "name": "Zhongjian Cheng"
        },
        {
            "name": "Qichang Zhao",
            "orcidid": "https://orcid.org/0000-0002-8319-9793"
        }
    ],
    "description": "Predicting drug-target interactions through interactive and independent features based on attention mechanism.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Small molecule design",
                    "uri": "http://edamontology.org/operation_4009"
                },
                {
                    "term": "Transmembrane protein prediction",
                    "uri": "http://edamontology.org/operation_0269"
                }
            ]
        }
    ],
    "homepage": "https://github.com/czjczj/IIFDTI",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:32:03.897979Z",
    "license": "Not licensed",
    "name": "IIFDTI",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btac485",
            "metadata": {
                "abstract": "Motivation: Identifying drug–target interactions is a crucial step for drug discovery and design. Traditional biochemical experiments are credible to accurately validate drug–target interactions. However, they are also extremely laborious, time-consuming and expensive. With the collection of more validated biomedical data and the advancement of computing technology, the computational methods based on chemogenomics gradually attract more attention, which guide the experimental verifications. Results: In this study, we propose an end-to-end deep learning-based method named IIFDTI to predict drug–target interactions (DTIs) based on independent features of drug–target pairs and interactive features of their substructures. First, the interactive features of substructures between drugs and targets are extracted by the bidirectional encoder–decoder architecture. The independent features of drugs and targets are extracted by the graph neural networks and convolutional neural networks, respectively. Then, all extracted features are fused and inputted into fully connected dense layers in downstream tasks for predicting DTIs. IIFDTI takes into account the independent features of drugs/targets and simulates the interactive features of the substructures from the biological perspective. Multiple experiments show that IIFDTI outperforms the state-of-the-art methods in terms of the area under the receiver operating characteristics curve (AUC), the area under the precision-recall curve (AUPR), precision, and recall on benchmark datasets. In addition, the mapped visualizations of attention weights indicate that IIFDTI has learned the biological knowledge insights, and two case studies illustrate the capabilities of IIFDTI in practical applications. Availability and implementation: The data and codes underlying this article are available in Github at https://github.com/czjczj/IIFDTI.",
                "authors": [
                    {
                        "name": "Cheng Z."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Zhao Q."
                    }
                ],
                "citationCount": 30,
                "date": "2022-09-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "IIFDTI: predicting drug–target interactions through interactive and independent features based on attention mechanism"
            },
            "pmid": "35801934"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
