{
    "additionDate": "2020-05-07T08:30:43Z",
    "biotoolsCURIE": "biotools:dadaist2",
    "biotoolsID": "dadaist2",
    "description": "Command line wrapper to run DADA2 and obtain feature table and representative sequences from a set of FASTQ files.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://quadram-institute-bioscience.github.io/dadaist2"
        }
    ],
    "download": [
        {
            "note": "Releases from GitHub",
            "type": "Software package",
            "url": "https://github.com/quadram-institute-bioscience/dadaist2/releases"
        },
        {
            "type": "Software package",
            "url": "https://anaconda.org/bioconda/dadaist2"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/quadram-institute-bioscience/dadaist2",
    "lastUpdate": "2021-07-23T12:52:40Z",
    "name": "dadaist2",
    "owner": "telatin",
    "publication": [
        {
            "doi": "10.3390/ijms22105309",
            "metadata": {
                "abstract": "© 2021 by the authors. Licensee MDPI, Basel, Switzerland.The taxonomic composition of microbial communities can be assessed using universal marker amplicon sequencing. The most common taxonomic markers are the 16S rDNA for bacterial communities and the internal transcribed spacer (ITS) region for fungal communities, but various other markers are used for barcoding eukaryotes. A crucial step in the bioinformatic analysis of amplicon sequences is the identification of representative sequences. This can be achieved using a clustering approach or by denoising raw sequencing reads. DADA2 is a widely adopted algorithm, released as an R library, that denoises marker-specific amplicons from next-generation sequencing and produces a set of representative sequences referred to as ‘Amplicon Sequence Variants’ (ASV). Here, we present Dadaist2, a modular pipeline, providing a complete suite for the analysis that ranges from raw sequencing reads to the statistics of numerical ecology. Dadaist2 implements a new approach that is specifically optimised for amplicons with variable lengths, such as the fungal ITS. The pipeline focuses on streamlining the data flow from the command line to R, with multiple options for statistical analysis and plotting, both interactive and automatic.",
                "authors": [
                    {
                        "name": "Ansorge R."
                    },
                    {
                        "name": "Birolo G."
                    },
                    {
                        "name": "James S.A."
                    },
                    {
                        "name": "Telatin A."
                    }
                ],
                "date": "2021-05-02T00:00:00Z",
                "journal": "International Journal of Molecular Sciences",
                "title": "Dadaist2: A toolkit to automate and simplify statistical analysis and plotting of metabarcoding experiments"
            },
            "pmcid": "PMC8157834",
            "pmid": "34069990",
            "type": [
                "Primary"
            ]
        }
    ],
    "validated": 1,
    "version": [
        "0.1",
        "0.8",
        "0.9",
        "1.0",
        "1.0.2"
    ]
}