{
    "additionDate": "2019-11-14T18:01:46Z",
    "biotoolsCURIE": "biotools:MicroPro",
    "biotoolsID": "MicroPro",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "fsun@usc.edu",
            "name": "Fengzhu Sun",
            "orcidid": "https://orcid.org/0000-0002-8552-043X",
            "typeEntity": "Person"
        }
    ],
    "description": "using metagenomic unmapped reads to provide insights into human microbiota and disease associations | A microbial profiling framework for metagenomic analysis | MicroPro is a software to perform profiling of both known and unknown microbial organisms for metagenomic dataset. A microbe is considered known/unknown if its whole genome is known/unknown according to the NCBI Reference Sequence Database. MicroPro has two pipelines: MicrobialPip and ViralPip. MicrobialPip considers all the microbial organisms including bacteria, archaea and viruses while ViralPip only extracts known and unknown viruses from the provided metagenomics dataset. More details of MicroPro are provided in the following paper:",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Cross-assembly",
                    "uri": "http://edamontology.org/operation_3730"
                }
            ]
        }
    ],
    "homepage": "https://github.com/zifanzhu/MicroPro",
    "language": [
        "R",
        "C++"
    ],
    "lastUpdate": "2019-11-14T18:01:46Z",
    "license": "GPL-3.0",
    "name": "MicroPro",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S13059-019-1773-5",
            "metadata": {
                "abstract": "© 2019 The Author(s).We develop a metagenomic data analysis pipeline, MicroPro, that takes into account all reads from known and unknown microbial organisms and associates viruses with complex diseases. We utilize MicroPro to analyze four metagenomic datasets relating to colorectal cancer, type 2 diabetes, and liver cirrhosis and show that including reads from unknown organisms significantly increases the prediction accuracy of the disease status for three of the four datasets. We identify new microbial organisms associated with these diseases and show viruses play important prediction roles in colorectal cancer and liver cirrhosis, but not in type 2 diabetes. MicroPro is freely available at https://github.com/zifanzhu/MicroPro.",
                "authors": [
                    {
                        "name": "Zhu Z."
                    },
                    {
                        "name": "Ren J."
                    },
                    {
                        "name": "Michail S."
                    },
                    {
                        "name": "Sun F."
                    }
                ],
                "citationCount": 1,
                "date": "2019-08-06T00:00:00Z",
                "journal": "Genome Biology",
                "title": "MicroPro: Using metagenomic unmapped reads to provide insights into human microbiota and disease associations"
            },
            "pmcid": "PMC6683435",
            "pmid": "31387630"
        }
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Metagenomic sequencing",
            "uri": "http://edamontology.org/topic_3837"
        }
    ]
}