{
    "additionDate": "2018-08-09T07:28:15Z",
    "biotoolsCURIE": "biotools:pager",
    "biotoolsID": "pager",
    "credit": [
        {
            "email": "zongyue@uab.edu",
            "name": "Zongliang Yue",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Pathway, Annotated-list, and Gene-signature Electronic Repository.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://discovery.informatics.uab.edu/PAGER/index.php/pages/help"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://discovery.informatics.uab.edu/PAGER/",
    "lastUpdate": "2018-12-10T12:59:01Z",
    "name": "PAGER",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s12859-017-1889-0",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: Much effort has been devoted to the discovery of specific mechanisms between drugs and single targets to date. However, as biological systems maintain homeostasis at the level of functional networks robustly controlling the internal environment, such networks commonly contain multiple redundant mechanisms designed to counteract loss or perturbation of a single member of the network. As such, investigation of therapeutics that target dysregulated pathways or processes, rather than single targets, may identify agents that function at a level of the biological organization more relevant to the pathology of complex diseases such as Parkinson's Disease (PD). Genome-wide association studies (GWAS) in PD have identified common variants underlying disease susceptibility, while gene expression microarray data provide genome-wide transcriptional profiles. These genomic studies can illustrate upstream perturbations causing the dysfunction in signaling pathways and downstream biochemical mechanisms leading to the PD phenotype. We hypothesize that drugs acting at the level of a gene expression module specific to PD can overcome the lack of efficacy associated with targeting a single gene in polygenic diseases. Thus, this approach represents a promising new direction for module-based drug discovery in human diseases such as PD. Results: We built a framework that integrates GWAS data with gene co-expression modules from tissues representing three brain regions-the frontal gyrus, the lateral substantia, and the medial substantia in PD patients. Using weighted gene correlation network analysis (WGCNA) software package in R, we conducted enrichment analysis of data from a GWAS of PD. This led to the identification of two over-represented PD-specific gene co-expression network modules: the Brown Module (Br) containing 449 genes and the Turquoise module (T) containing 905 genes. Further enrichment analysis identified four functional pathways within the Br module (cellular respiration, intracellular transport, energy coupled proton transport against the electrochemical gradient, and microtubule-based movement), and one functional pathway within the T module (M-phase). Next, we utilized drug-protein regulatory relationship databases (DMAP) and developed a Drug Effect Sum Score (DESS) to evaluate all candidate drugs that might restore gene expression to normal level across the Br and T modules. Among the drugs with the 12 highest DESS scores, 5 had been reported as potential treatments for PD and 6 hold potential repositioning applications. Conclusion: In this study, we present a systems pharmacology framework which draws on genetic data from GWAS and gene expression microarray data to reposition drugs for PD. Our innovative approach integrates gene co-expression modules with biomolecular interaction network analysis to identify network modules critical to the PD pathway and disease mechanism. We quantify the positive effects of drugs in a DESS score that is based on known drug-target activity profiles. Our results illustrate that this modular approach is promising for repositioning drugs for use in polygenic diseases such as PD, and is capable of addressing challenges of the hindered gene target in drug repositioning approaches to date.",
                "authors": [
                    {
                        "name": "Yue Z."
                    },
                    {
                        "name": "Arora I."
                    },
                    {
                        "name": "Zhang E.Y."
                    },
                    {
                        "name": "Laufer V."
                    },
                    {
                        "name": "Bridges S.L."
                    },
                    {
                        "name": "Chen J.Y."
                    }
                ],
                "citationCount": 12,
                "date": "2017-12-28T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Repositioning drugs by targeting network modules: A Parkinson's disease case study"
            },
            "pmcid": "PMC5751600",
            "pmid": "29297292"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Data management",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Drug development",
            "uri": "http://edamontology.org/topic_3373"
        }
    ],
    "validated": 1
}