{
    "accessibility": "Open access",
    "additionDate": "2023-03-18T10:22:41.504265Z",
    "biotoolsCURIE": "biotools:pymic",
    "biotoolsID": "pymic",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Shaoting Zhang"
        },
        {
            "name": "Xiangde Luo"
        },
        {
            "name": "Guotai Wang",
            "orcidid": "https://orcid.org/0000-0002-8632-158X"
        },
        {
            "name": "Kang Li",
            "orcidid": "https://orcid.org/0000-0002-8136-9816"
        }
    ],
    "description": "A deep learning toolkit for annotation-efficient medical image segmentation.",
    "documentation": [
        {
            "type": [
                "General",
                "User manual"
            ],
            "url": "https://pymic.readthedocs.io/en/latest/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Image annotation",
                    "uri": "http://edamontology.org/operation_3553"
                }
            ]
        }
    ],
    "homepage": "https://github.com/HiLab-git/PyMIC",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-03-18T10:22:41.508278Z",
    "license": "Apache-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/HiLab-git/PyMIC_examples"
        }
    ],
    "name": "PyMIC",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.CMPB.2023.107398",
            "metadata": {
                "abstract": "Background and Objective: Open-source deep learning toolkits are one of the driving forces for developing medical image segmentation models that are essential for computer-assisted diagnosis and treatment procedures. Existing toolkits mainly focus on fully supervised segmentation that assumes full and accurate pixel-level annotations are available. Such annotations are time-consuming and difficult to acquire for segmentation tasks, which makes learning from imperfect labels highly desired for reducing the annotation cost. We aim to develop a new deep learning toolkit to support annotation-efficient learning for medical image segmentation, which can accelerate and simplify the development of deep learning models with limited annotation budget, e.g., learning from partial, sparse or noisy annotations. Methods: Our proposed toolkit named PyMIC is a modular deep learning library for medical image segmentation tasks. In addition to basic components that support development of high-performance models for fully supervised segmentation, it contains several advanced components that are tailored for learning from imperfect annotations, such as loading annotated and unannounced images, loss functions for unannotated, partially or inaccurately annotated images, and training procedures for co-learning between multiple networks, etc. PyMIC is built on the PyTorch framework and supports development of semi-supervised, weakly supervised and noise-robust learning methods for medical image segmentation. Results: We present several illustrative medical image segmentation tasks based on PyMIC: (1) Achieving competitive performance on fully supervised learning; (2) Semi-supervised cardiac structure segmentation with only 10% training images annotated; (3) Weakly supervised segmentation using scribble annotations; and (4) Learning from noisy labels for chest radiograph segmentation. Conclusions: The PyMIC toolkit is easy to use and facilitates efficient development of medical image segmentation models with imperfect annotations. It is modular and flexible, which enables researchers to develop high-performance models with low annotation cost. The source code is available at:https://github.com/HiLab-git/PyMIC.",
                "authors": [
                    {
                        "name": "Gu R."
                    },
                    {
                        "name": "Li K."
                    },
                    {
                        "name": "Luo X."
                    },
                    {
                        "name": "Qu Y."
                    },
                    {
                        "name": "Wang G."
                    },
                    {
                        "name": "Yang S."
                    },
                    {
                        "name": "Zhai S."
                    },
                    {
                        "name": "Zhang S."
                    },
                    {
                        "name": "Zhao Q."
                    }
                ],
                "date": "2023-04-01T00:00:00Z",
                "journal": "Computer Methods and Programs in Biomedicine",
                "title": "PyMIC: A deep learning toolkit for annotation-efficient medical image segmentation"
            },
            "pmid": "36773591"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ]
}
