{
    "additionDate": "2020-01-14T09:29:29Z",
    "biotoolsCURIE": "biotools:LutzoDexTM",
    "biotoolsID": "LutzoDexTM",
    "confidence_flag": "tool",
    "description": "Digital key for Brazilian sand flies (Diptera, Phlebotominae) within an Android App.\n\nHere we present an Android mobile application (app) for the identification of Brazilian phlebotomine sand fly species. The app, which is named LutzoDex™, relies on information included in a data source with morphological and morphometrical characters. This tool can present up to seven answer options to a question. Images of morphological structures can be referenced to make identification easier, and users can see a list of possible species based on the features they report. Maps are also used to determine the geographical distribution and whether the species is incriminated or suspected as a vector of Leishmania spp. in Brazil. The app is available free of charge in both English and Portuguese in the Google Play Store at https: play.google.com store apps details?id=max.com.lutzodexhl=pt_BR.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://play.google.com/store/apps/details?id=max.com.lutzodexhl=pt_BR.",
    "lastUpdate": "2020-12-22T13:37:08Z",
    "name": "LutzoDexTM",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.11646/ZOOTAXA.4688.3.4",
            "metadata": {
                "abstract": "Copyright © 2019 Magnolia PressHere we present an Android mobile application (app) for the identification of Brazilian phlebotomine sand fly species. The app, which is named LutzoDex™, relies on information included in a data source with morphological and morphometrical characters. This tool can present up to seven answer options to a question. Images of morphological structures can be referenced to make identification easier, and users can see a list of possible species based on the features they report. Maps are also used to determine the geographical distribution and whether the species is incriminated or suspected as a vector of Leishmania spp. in Brazil. The app is available free of charge in both English and Portuguese in the Google Play Store at https://play.google.com/store/apps/details?id=max.com.lutzodex&hl=pt_BR.",
                "authors": [
                    {
                        "name": "De Almeida M.R."
                    },
                    {
                        "name": "De Almeida Rocha D."
                    },
                    {
                        "name": "De Andrade A.J."
                    },
                    {
                        "name": "De Sena Batista J.A."
                    }
                ],
                "citationCount": 3,
                "date": "2019-10-23T00:00:00Z",
                "journal": "Zootaxa",
                "title": "LutzoDex™-A digital key for Brazilian sand flies (Diptera, Phlebotominae) within an Android App"
            },
            "pmid": "31719438"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ],
    "validated": 1
}
