{"credit":[{"name":"BioCatalogue","typeEntity":"Project","typeRoles":["Documentor"],"url":"https://www.biocatalogue.org"},{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.neuroelectro.org/contact_info/"}],"documentation":[{"type":"GENERAL","url":"http://neuroelectro.org/api/docs/"}],"function":[{"operation":[{"term":"Data retrieval","uri":"http://edamontology.org/operation_2422"},{"term":"Literature search","uri":"http://edamontology.org/operation_0305"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web API"],"topic":[{"term":"Literature and language","uri":"http://edamontology.org/topic_3068"},{"term":"Data management","uri":"http://edamontology.org/topic_3071"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"https://www.biocatalogue.org/services/3727"}],"publication":[{"abstract":"The behavior of neural circuits is determined largely by the electrophysiological properties of the neurons they contain. Understanding the relationships of these properties requires the ability to first identify and catalog each property. However, information about such properties is largely locked away in decades of closed-access journal articles with heterogeneous conventions for reporting results, making it difficult to utilize the underlying data. We solve this problem through the NeuroElectro project: a Python library, RESTful API, and web application (at http://neuroelectro.org) for the extraction, visualization, and summarization of published data on neurons' electrophysiological properties. Information is organized both by neuron type (using neuron definitions provided by NeuroLex) and by electrophysiological property (using a newly developed ontology). We describe the techniques and challenges associated with the automated extraction of tabular electrophysiological data and methodological metadata from journal articles. We further discuss strategies for how to best combine, normalize and organize data across these heterogeneous sources. NeuroElectro is a valuable resource for experimental physiologists attempting to supplement their own data, for computational modelers looking to constrain their model parameters, and for theoreticians searching for undiscovered relationships among neurons and their properties. © 2014 Tripathy, Savitskaya, Burton, Urban and Gerkin.","authors":["Tripathy S.J.","Savitskaya J.","Burton S.D.","Urban N.N.","Gerkin R.C."],"cit_count":29,"doi":"10.3389/fninf.2014.00040","journal":"Frontiers in Neuroinformatics","title":"NeuroElectro: A window to the world's neuron electrophysiology data","type":"Primary","year":"2014-04-29"}],"summary":{"biotoolsCURIE":"biotools:neuroelectro","biotoolsID":"neuroelectro","description":"RESTful API which enables the extraction, visualization, and summarization of published data on neurons’ electrophysiological properties.","homepage":"http://neuroelectro.org/api/docs/","name":"NeuroElectro","version":["1"]}}