{
    "accessibility": "Open access",
    "additionDate": "2022-11-05T19:28:43.505636Z",
    "biotoolsCURIE": "biotools:pkglite",
    "biotoolsID": "pkglite",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Keaven Anderson"
        },
        {
            "name": "Yilong Zhang"
        },
        {
            "name": "Nan Xiao",
            "orcidid": "https://orcid.org/0000-0002-0250-5673"
        },
        {
            "name": "Yujie Zhao",
            "orcidid": "https://orcid.org/0000-0003-2896-4955"
        }
    ],
    "description": "Electronic common technical document submission with analysis using R.",
    "documentation": [
        {
            "type": [
                "General",
                "User manual"
            ],
            "url": "https://cran.r-project.org/web/packages/pkglite/pkglite.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                }
            ]
        }
    ],
    "homepage": "https://merck.github.io/pkglite/",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-11-05T19:28:43.508215Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://cran.r-project.org/web/packages/pkglite/index.html"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/Merck/pkglite"
        }
    ],
    "name": "pkglite",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1177/17407745221123244",
            "metadata": {
                "abstract": "© The Author(s) 2022.Background: In clinical trial development, it is a critical step to submit applications, amendments, supplements, and reports on medicinal products to regulatory agencies. The electronic common technical document is the standard format to enable worldwide regulatory submission. There is a growing trend of using R for clinical trial analysis and reporting as part of regulatory submissions, where R functions, analysis scripts, analysis results, and all proprietary code dependencies are required to be included. One unmet and significant gap is the lack of tools, guidance, and publicly available examples to prepare submission R programs following the electronic common technical document specification. Methods: We introduce a simple and sufficient R package, pkglite, to convert analysis scripts and associated proprietary dependency R packages into a compact, text-based file, which makes the submission document self-contained, easy to restore, transfer, review, and submit following the electronic common technical document specification and regulatory guidelines (e.g. the study data technical conformance guide from the US Food and Drug Administration). The pkglite R package is published on Comprehensive R Archive Network and developed on GitHub. Results: As a tool, pkglite can pack and unpack multiple R packages with their dependencies to facilitate the reproduction and make it an off-the-shelf tool for both sponsors and reviewers. As a grammar, pkglite provides an explicit trace of the packing scope using the concept of file specifications. As a standard, pkglite offers an open file format to represent and exchange R packages as a text file. We use a mock-up example to demonstrate the workflow of using pkglite to prepare submission programs following the electronic common technical document specification. Conclusion: pkglite and the proposed workflow enable the sponsor to submit well-organized R scripts following the electronic common technical document specification. The workflow has been used in the first publicly available R-based submission to the US Food and Drug Administration by the R Consortium R submission working group (https://www.r-consortium.org/blog/2022/03/16/update-successful-r-based-test-package-submitted-to-fda).",
                "authors": [
                    {
                        "name": "Anderson K."
                    },
                    {
                        "name": "Xiao N."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Zhao Y."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Clinical Trials",
                "title": "Electronic common technical document submission with analysis using R"
            },
            "pmid": "36169229"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
