{
    "additionDate": "2021-01-18T08:00:13Z",
    "biotoolsCURIE": "biotools:cryprocessor",
    "biotoolsID": "cryprocessor",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "a.shikov@arriam.ru",
            "name": "Anton E. Shikov",
            "orcidid": "https://orcid.org/0000-0001-7084-0177",
            "typeEntity": "Person"
        },
        {
            "email": "k.antonets@arriam.ru",
            "name": "Kirill S. Antonets",
            "orcidid": "https://orcid.org/0000-0002-8575-2601",
            "typeEntity": "Person"
        }
    ],
    "description": "CryProcessor is a python-written tool for searching and extracting Cry toxins from illumina sequence data or from the protein fasta files. It includes several parts: an hmm-based scanning for potential Cry toxins, obtaining information about the domains, extracting Cry toxins with 3 domains only and comparing found toxins with Bt nomenclature.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                }
            ]
        }
    ],
    "homepage": "https://lab7.arriam.ru/tools/cry_processor",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-18T16:26:18Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/lab7arriam/cry_processor"
        }
    ],
    "name": "CryProcessor",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3390/TOXINS12030204",
            "metadata": {
                "abstract": "© 2020 by the authors.Bacillus thuringiensis (Bt) is a natural pathogen of insects and some other groups of invertebrates that produces three-domain Cry (3d-Cry) toxins, which are highly host-specific pesticidal proteins. These proteins represent the most commonly used bioinsecticides in the world and are used for commercial purposes on the market of insecticides, being convergent with the paradigm of sustainable growth and ecological development. Emerging resistance to known toxins in pests stresses the need to expand the list of known toxins to broaden the horizons of insecticidal approaches. For this purpose, we have elaborated a fast and user-friendly tool called CryProcessor, which allows productive and precise mining of 3d-Cry toxins. The only existing tool for mining Cry toxins, called a BtToxin_scanner, has significant limitations such as limited query size, lack of accuracy and an outdated database. In order to find a proper solution to these problems, we have developed a robust pipeline, capable of precise 3d-Cry toxin mining. The unique feature of the pipeline is the ability to search for Cry toxins sequences directly on assembly graphs, providing an opportunity to analyze raw sequencing data and overcoming the problem of fragmented assemblies. Moreover, CryProcessor is able to predict precisely the domain layout in arbitrary sequences, allowing the retrieval of sequences of definite domains beyond the bounds of a limited number of toxins presented in CryGetter. Our algorithm has shown efficiency in all its work modes and outperformed its analogues on large amounts of data. Here, we describe its main features and provide information on its benchmarking against existing analogues. CryProcessor is a novel, fast, convenient, open source (https://github.com/lab7arriam/cry_processor), platform-independent, and precise instrument with a console version and elaborated web interface (https://lab7.arriam.ru/tools/cry_processor). Its major merits could make it possible to carry out massive screening for novel 3d-Cry toxins and obtain sequences of specific domains for further comprehensive in silico experiments in constructing artificial toxins.",
                "authors": [
                    {
                        "name": "Shikov A.E."
                    },
                    {
                        "name": "Malovichko Y.V."
                    },
                    {
                        "name": "Skitchenko R.K."
                    },
                    {
                        "name": "Nizhnikov A.A."
                    },
                    {
                        "name": "Antonets K.S."
                    }
                ],
                "citationCount": 5,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Toxins",
                "title": "No more tears: Mining sequencing data for novel Bt cry toxins with cryprocessor"
            },
            "pmcid": "PMC7150774",
            "pmid": "32210056"
        }
    ],
    "toolType": [
        "Web application",
        "Workflow",
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        }
    ]
}