{
    "additionDate": "2021-01-18T10:48:47Z",
    "biotoolsCURIE": "biotools:mbend",
    "biotoolsID": "mbend",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mohammad.nilforooshan@lic.co.nz",
            "name": "Mohammad Ali Nilforooshan",
            "orcidid": "https://orcid.org/0000-0003-0339-5442",
            "typeEntity": "Person"
        }
    ],
    "description": "An R package for bending non-positive-definite symmetric matrices to positive-definite.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/package=mbend",
    "lastUpdate": "2021-02-20T17:23:45Z",
    "license": "GPL-3.0",
    "name": "mbend",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12863-020-00881-Z",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: R package mbend was developed for bending symmetric non-positive-definite matrices to positive-definite (PD). Bending is a procedure of transforming non-PD matrices to PD. The covariance matrices used in multi-trait best linear unbiased prediction (BLUP) should be PD. Two bending methods are implemented in mbend. The first is an unweighted bending with small positive values in a descending order replacing negative eigenvalues (LRS14), and the second method is a weighted (precision-based) bending with a custom small positive value (ϵ) replacing smaller eigenvalues (HJ03). Weighted bending is beneficial, as it relaxes low precision elements to change and it reduces or prohibits the change in high precision elements. Therefore, a weighted version of LRS14 was developed in mbend. In cases where the precision of matrix elements is unknown, the package provides an unweighted version of HJ03. Another unweighted bending method (DB88) was tested, by which all eigenvalues are changed (eigenvalues less than ϵ replaced with 100 × ϵ), and it is originally designed for correlation matrices. Results: Different bending procedures were conducted on a 5 × 5 covariance matrix (V), V converted to a correlation matrix (C) and an ill-conditioned 1000 × 1000 genomic relationship matrix (G). Considering weighted distance statistics between matrix elements before and after bending, weighting considerably improved the bending quality. For weighted and unweighted bending of V and C, HJ03-4 (HJ03, ϵ = 10-4) performed the best. HJ03-2 (HJ03, ϵ = 10-2) ranked better than LRS14 for V, but not for C. Though the differences were marginal, LRS14 performed the best for G. DB88-4 (DB88, ϵ = 10-4) was used for unweighted bending and it ranked the last. This method could perform considerably better with a lower ϵ. Conclusions: R package mbend provides necessary tools for transforming symmetric non-PD matrices to PD, using different methods and parameters. There were benefits in both weighted bending and small positive values in a descending order replacing negative eigenvalues. Thus, weighted LRS14 was implemented in mbend. Different bending methods might be preferable for different matrices, depending on the matrix type (covariance vs. correlation), number and the magnitude of negative eigenvalues, and the matrix size.",
                "authors": [
                    {
                        "name": "Nilforooshan M.A."
                    }
                ],
                "date": "2020-09-03T00:00:00Z",
                "journal": "BMC Genetics",
                "title": "Mbend: An R package for bending non-positive-definite symmetric matrices to positive-definite"
            },
            "pmcid": "PMC7469428",
            "pmid": "32883199"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ]
}