{"credit":[{"email":"shapirbr@mail.nih.gov","name":"Bruce A. Shapiro","typeEntity":"Person","typeRoles":["Primary contact"],"url":"https://binkley2.ncifcrf.gov/users/bshapiro//group.html"}],"documentation":[{"type":"GENERAL","url":"https://binkley2.ncifcrf.gov/users/bshapiro//mpgaFold/mpgaFold.html"}],"function":[{"operation":[{"term":"RNA secondary structure prediction","uri":"http://edamontology.org/operation_0278"}]}],"labels":{"operatingSystem":["Linux"],"toolType":["Desktop application"],"topic":[{"term":"RNA","uri":"http://edamontology.org/topic_0099"},{"term":"Structure prediction","uri":"http://edamontology.org/topic_0082"},{"term":"Genetics","uri":"http://edamontology.org/topic_3053"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/mpgafoldmpgafold-visualizer-massively-parallel-genetic-algorithm-predicts-rna-secondary-structure.html"}],"publication":[{"abstract":"Studies indicate that RNA may enter intermediate and multiple conformational states, which may impact gene expression and molecular function. It is known that the biologically functional states of RNA molecules may not correspond to their minimum energy conformations, that kinetic barriers may trap the molecule in a local minimum, that folding often occurs during transcription, and that cases exist in which a molecule will transition between one or more functional conformations. Thus, methods for simulating the folding pathway and dynamic behavior of an RNA molecule are important for the prediction of RNA structure and its associated functions. We have developed several data mining techniques guided by interactive visualization tools associated with our massively parallel genetic algorithm for RNA/DNA secondary structure prediction, MPGAfold, and StructureLab analysis workbench. Most of the methods and tools are also applicable to dynamic programming algorithm (DPA) folding data analysis. When applied to MPGAfold results these methodologies are used to determine the significant intermediate and final structures associated with co-transcriptional and full length RNA folding. Since the genetic algorithm is essentially stochastic, multiple runs are required to develop a consensus understanding of an RNA structure. The interactive visualizations facilitate interpretation of results from sequential or full length individual MPGAfold runs, final results of multiple folding runs, including multiple population sizes, and the results from multiple RNA sequences of one family. This paper describes several of these techniques and shows how they are used to help solve this highly combinatoric problem. © 2006 Elsevier Inc. All rights reserved.","authors":["Shapiro B.A.","Kasprzak W.","Grunewald C.","Aman J."],"cit_count":23,"journal":"Journal of Molecular Graphics and Modelling","pmid":"16725358","title":"Graphical exploratory data analysis of RNA secondary structure dynamics predicted by the massively parallel genetic algorithm","year":"2006-12-01"}],"summary":{"biotoolsCURIE":"biotools:mpgafold","biotoolsID":"mpgafold","description":"Massively parallel genetic algorithm that predicts RNA secondary structure.","homepage":"https://binkley2.ncifcrf.gov/users/bshapiro//mpgaFold/mpgaFold.html","name":"MPGAfold"}}