{
    "additionDate": "2019-11-14T19:28:12Z",
    "biotoolsCURIE": "biotools:NPA",
    "biotoolsID": "NPA",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Florian.Martin@pmi.com",
            "name": "Florian Martin",
            "typeEntity": "Person"
        }
    ],
    "description": "An R package for computing network perturbation amplitudes using gene expression data and two-layer networks | NPA - Network Perturbation Amplitude | R package and data for NPA models | The NPA (Network Perturbation Amplitude) and BIF (Biological Impact Factor) methods allow to understand the mechanisms behind and predict the effect of exposure based on transcriptomics datasets.This approach enables to translate the gene expression fold-changes into differential values for each network node, and to summarize this at the network level to provide aquantitative assessment of the degree of perturbation of the network model, the Network Perturbation Amplitude (NPA).Combining multiple relevant network models, the overall biological impact of a perturbing agent, the Biological Impact Factor (BIF),can be calculated by aggregating individual NPA scores | After package installation, networks are installed with no precomputed data",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                },
                {
                    "term": "Pathway or network comparison",
                    "uri": "http://edamontology.org/operation_0277"
                }
            ]
        }
    ],
    "homepage": "https://github.com/philipmorrisintl/NPA",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-04T08:56:26Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/philipmorrisintl/NPAModels"
        }
    ],
    "name": "NPA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3016-X",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: High-throughput gene expression technologies provide complex datasets reflecting mechanisms perturbed in an experiment, typically in a treatment versus control design. Analysis of these information-rich data can be guided based on a priori knowledge, such as networks of related proteins or genes. Assessing the response of a specific mechanism and investigating its biological basis is extremely important in systems toxicology; as compounds or treatment need to be assessed with respect to a predefined set of key mechanisms that could lead to toxicity. Two-layer networks are suitable for this task, and a robust computational methodology specifically addressing those needs was previously published. The NPA package (https://github.com/philipmorrisintl/NPA) implements the algorithm, and a data package of eight two-layer networks representing key mechanisms, such as xenobiotic metabolism, apoptosis, or epithelial immune innate activation, is provided. Results: Gene expression data from an animal study are analyzed using the package and its network models. The functionalities are implemented using R6 classes, making the use of the package seamless and intuitive. The various network responses are analyzed using the leading node analysis, and an overall perturbation, called the Biological Impact Factor, is computed. Conclusions: The NPA package implements the published network perturbation amplitude methodology and provides a set of two-layer networks encoded in the Biological Expression Language.",
                "authors": [
                    {
                        "name": "Martin F."
                    },
                    {
                        "name": "Gubian S."
                    },
                    {
                        "name": "Talikka M."
                    },
                    {
                        "name": "Hoeng J."
                    },
                    {
                        "name": "Peitsch M.C."
                    }
                ],
                "citationCount": 3,
                "date": "2019-09-03T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "NPA: An R package for computing network perturbation amplitudes using gene expression data and two-layer networks"
            },
            "pmcid": "PMC6724309",
            "pmid": "31481014"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Toxicology",
            "uri": "http://edamontology.org/topic_2840"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}