{
    "additionDate": "2020-03-30T09:00:12Z",
    "biotoolsCURIE": "biotools:hipmcl",
    "biotoolsID": "hipmcl",
    "credit": [
        {
            "name": "Ariful Azad",
            "orcidid": "https://orcid.org/0000-0003-1332-8630"
        },
        {
            "name": "Aydin Buluc",
            "orcidid": "https://orcid.org/0000-0001-7253-9038"
        },
        {
            "name": "Georgios Pavlopoulos",
            "orcidid": "http://orcid.org/0000-0002-4577-8276"
        }
    ],
    "description": "HipMCL: A High-Performance Parallel Algorithm for Large-Scale Network Clustering",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://bitbucket.org/azadcse/hipmcl/wiki/Home",
    "language": [
        "C++"
    ],
    "lastUpdate": "2024-11-25T13:58:43.218554Z",
    "license": "Other",
    "maturity": "Mature",
    "name": "HipMCL",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "g.pavlopoulos",
    "publication": [
        {
            "doi": "10.1093/nar/gkx1313",
            "metadata": {
                "abstract": "Biological networks capture structural or functional properties of relevant entities such as molecules, proteins or genes. Characteristic examples are gene expression networks or protein-protein interaction networks, which hold information about functional affinities or structural similarities. Such networks have been expanding in size due to increasing scale and abundance of biological data.While various clustering algorithms have been proposed to find highly connected regions, Markov Clustering (MCL) has been one of the most successful approaches to cluster sequence similarity or expression networks. Despite its popularity, MCL's scalability to cluster large datasets still remains a bottleneck due to high running times and memory demands. Here, we present High-performance MCL (HipMCL), a parallel implementation of the original MCL algorithm that can run on distributed-memory computers.We show that HipMCL can efficiently utilize 2000 compute nodes and cluster a network of ∼70 million nodes with ∼68 billion edges in ∼2.4 h. By exploiting distributedmemory environments, HipMCL clusters large-scale networks several orders of magnitude faster than MCL and enables clustering of even bigger networks. HipMCL is based on MPI and OpenMP and is freely available under a modified BSD license.",
                "authors": [
                    {
                        "name": "Azad A."
                    },
                    {
                        "name": "Buluc A."
                    },
                    {
                        "name": "Kyrpides N.C."
                    },
                    {
                        "name": "Ouzounis C.A."
                    },
                    {
                        "name": "Pavlopoulos G.A."
                    }
                ],
                "citationCount": 105,
                "date": "2018-04-06T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "HipMCL: a high-performance parallel implementation of the Markov clustering algorithm for large-scale networks"
            },
            "pmcid": "PMC5888241",
            "pmid": "29315405"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}
