{
    "additionDate": "2020-01-09T17:38:56Z",
    "biotoolsCURIE": "biotools:Binner",
    "biotoolsID": "Binner",
    "confidence_flag": "tool",
    "description": "Binner is a Java application for deep annotation of untargeted LC-MS metabolomics data.\n\nIt takes a numerical feature table obtained from any preprocessing software (e.g. XCMS, MZmine) as input and outputs a file with clusters of closely eluting, highly correlated metabolite features that are most related, along with their pairwise correlations, mass differences, and putative annotations.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "http://binner.med.umich.edu",
    "language": [
        "Java"
    ],
    "lastUpdate": "2024-11-24T20:49:14.749060Z",
    "name": "Binner",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btz798",
            "metadata": {
                "abstract": "Motivation: When metabolites are analyzed by electrospray ionization (ESI)-mass spectrometry, they are usually detected as multiple ion species due to the presence of isotopes, adducts and in-source fragments. The signals generated by these degenerate features (along with contaminants and other chemical noise) obscure meaningful patterns in MS data, complicating both compound identification and downstream statistical analysis. To address this problem, we developed Binner, a new tool for the discovery and elimination of many degenerate feature signals typically present in untargeted ESI-LC-MS metabolomics data. Results: Binner generates feature annotations and provides tools to help users visualize informative feature relationships that can further elucidate the underlying structure of the data. To demonstrate the utility of Binner and to evaluate its performance, we analyzed data from reversed phase LC-MS and hydrophilic interaction chromatography (HILIC) platforms and demonstrated the accuracy of selected annotations using MS/MS. When we compared Binner annotations of 75 compounds previously identified in human plasma samples with annotations generated by three similar tools, we found that Binner achieves superior performance in the number and accuracy of annotations while simultaneously minimizing the number of incorrectly annotated principal ions. Data reduction and pattern exploration with Binner have allowed us to catalog a number of previously unrecognized complex adducts and neutral losses generated during the ionization of molecules in LC-MS. In summary, Binner allows users to explore patterns in their data and to efficiently and accurately eliminate a significant number of the degenerate features typically found in various LC-MS modalities.",
                "authors": [
                    {
                        "name": "Burant C."
                    },
                    {
                        "name": "Duren W."
                    },
                    {
                        "name": "Habra H."
                    },
                    {
                        "name": "Kachman M."
                    },
                    {
                        "name": "Karnovsky A."
                    },
                    {
                        "name": "Michailidis G."
                    },
                    {
                        "name": "Sajjakulnukit P."
                    },
                    {
                        "name": "Wigginton J."
                    }
                ],
                "citationCount": 45,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Deep annotation of untargeted LC-MS metabolomics data with Binner"
            },
            "pmcid": "PMC7828469",
            "pmid": "31642507"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
