{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:25:54Z",
    "biotoolsCURIE": "biotools:MLM",
    "biotoolsID": "MLM",
    "cost": "Free of charge",
    "description": "Morais-Lima-Martin (MLM) algorithm for data splitting for classification applications in spectrochemical analyses employing a random-mutation Kennard-Stone algorithm approach.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "https://figshare.com/articles/MLM_Algorithm/7393517/1",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2024-11-24T21:02:52.446600Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "MLM",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btz421",
            "metadata": {
                "abstract": "Motivation: Data splitting is a fundamental step for building classification models with spectral data, especially in biomedical applications. This approach is performed following pre-processing and prior to model construction, and consists of dividing the samples into at least training and test sets; herein, the training set is used for model construction and the test set for model validation. Some of the most-used methodologies for data splitting are the random selection (RS) and the Kennard-Stone (KS) algorithms; here, the former works based on a random splitting process and the latter is based on the calculation of the Euclidian distance between the samples. We propose an algorithm called the Morais-Lima-Martin (MLM) algorithm, as an alternative method to improve data splitting in classification models. MLM is a modification of KS algorithm by adding a random-mutation factor. Results: RS, KS and MLM performance are compared in simulated and six real-world biospectroscopic applications using principal component analysis linear discriminant analysis (PCA-LDA). MLM generated a better predictive performance in comparison with RS and KS algorithms, in particular regarding sensitivity and specificity values. Classification is found to be more well-equilibrated using MLM. RS showed the poorest predictive response, followed by KS which showed good accuracy towards prediction, but relatively unbalanced sensitivities and specificities. These findings demonstrate the potential of this new MLM algorithm as a sample selection method for classification applications in comparison with other regular methods often applied in this type of data.",
                "authors": [
                    {
                        "name": "Lima K.M.G."
                    },
                    {
                        "name": "Martin F.L."
                    },
                    {
                        "name": "Morais C.L.M."
                    },
                    {
                        "name": "Santos M.C.D."
                    }
                ],
                "citationCount": 79,
                "date": "2019-12-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Improving data splitting for classification applications in spectrochemical analyses employing a random-mutation Kennard-Stone algorithm approach"
            },
            "pmcid": "PMC6954661",
            "pmid": "31116391",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
