{"credit":[{"email":"harveywi@cse.ohio-state.edu","name":"Dr. William Harvey","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.aylasoftware.org/"}],"documentation":[{"type":"GENERAL","url":"https://github.com/harveywi/Ayla-Visual-Analytics#ayla-visual-analytics"}],"function":[{"operation":[{"term":"Visualisation","uri":"http://edamontology.org/operation_0337"}]}],"labels":{"language":["Java"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Desktop application"],"topic":[{"term":"Molecular dynamics","uri":"http://edamontology.org/topic_0176"},{"term":"Biochemistry","uri":"http://edamontology.org/topic_3292"},{"term":"Protein folding, stability and design","uri":"http://edamontology.org/topic_0130"},{"term":"Protein structural motifs and surfaces","uri":"http://edamontology.org/topic_0166"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/ayla-0-1-1-visualization-tool-for-researchers-in-biochemistry-molecular-dynamics-and-protein-folding.html"}],"publication":[{"abstract":"Molecular dynamics (MD) simulation is a crucial tool for understanding principles behind important biochemical processes such as protein folding and molecular interaction. With the rapidly increasing power of modern computers, large-scale MD simulation experiments can be performed regularly, generating huge amounts of MD data. An important question is how to analyze and interpret such massive and complex data. One of the (many) challenges involved in analyzing MD simulation data computationally is the high-dimensionality of such data. Given a massive collection of molecular conformations, researchers typically need to rely on their expertise and prior domain knowledge in order to retrieve certain conformations of interest. It is not easy to make and test hypotheses as the data set as a whole is somewhat \"invisible\" due to its high dimensionality. In other words, it is hard to directly access and examine individual conformations from a sea of molecular structures, and to further explore the entire data set. There is also no easy and convenient way to obtain a global view of the data or its various modalities of biochemical information. To this end, we present an interactive, collaborative visual analytics tool for exploring massive, high-dimensional molecular dynamics simulation data sets. The most important utility of our tool is to provide a platform where researchers can easily and effectively navigate through the otherwise \"invisible\" simulation data sets, exploring and examining molecular conformations both as a whole and at individual levels. The visualization is based on the concept of a topological landscape, which is a 2D terrain metaphor preserving certain topological and geometric properties of the high dimensional protein energy landscape. In addition to facilitating easy exploration of conformations, this 2D terrain metaphor also provides a platform where researchers can visualize and analyze various properties (such as contact density) overlayed on the top of the 2D terrain. Finally, the software provides a collaborative environment where multiple researchers can assemble observations and biochemical events into storyboards and share them in real time over the Internet via a client-server architecture. The software is written in Scala and runs on the cross-platform Java Virtual Machine. Binaries and source code are available at http://www.aylasoftware.org and have been released under the GNU General Public License. © 2014 Elsevier Inc.","authors":["Harvey W.","Park I.-H.","Rubel O.","Pascucci V.","Bremer P.-T.","Li C.","Wang Y."],"cit_count":2,"journal":"Journal of Molecular Graphics and Modelling","pmid":"25068440","title":"A collaborative visual analytics suite for protein folding research","year":"2014-01-01"}],"summary":{"biotoolsCURIE":"biotools:ayla","biotoolsID":"ayla","description":"A free, open source visualization tool for researchers in biochemistry, molecular dynamics, and protein folding.","homepage":"http://www.aylasoftware.org/","name":"Ayla"}}