{
    "additionDate": "2024-06-19T08:22:21.868813Z",
    "biotoolsCURIE": "biotools:scnovel",
    "biotoolsID": "scnovel",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "liyu@cse.cuhk.edu.hk",
            "name": "Yu Li",
            "typeEntity": "Person"
        }
    ],
    "description": "A scalable deep learning-based network for novel rare cell discovery in single-cell transcriptomics.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Dot plot plotting",
                    "uri": "http://edamontology.org/operation_0490"
                }
            ]
        }
    ],
    "homepage": "https://github.com/chuanyang-Zheng/scNovel",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-06-19T08:22:21.871029Z",
    "license": "MIT",
    "name": "scNovel",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bib/bbae112",
            "metadata": {
                "abstract": "Single-cell RNA sequencing has achieved massive success in biological research fields. Discovering novel cell types from single-cell transcriptomics has been demonstrated to be essential in the field of biomedicine, yet is time-consuming and needs prior knowledge. With the unprecedented boom in cell atlases, auto-annotation tools have become more prevalent due to their speed, accuracy and user-friendly features. However, existing tools have mostly focused on general cell-type annotation and have not adequately addressed the challenge of discovering novel rare cell types. In this work, we introduce scNovel, a powerful deep learning-based neural network that specifically focuses on novel rare cell discovery. By testing our model on diverse datasets with different scales, protocols and degrees of imbalance, we demonstrate that scNovel significantly outperforms previous state-of-the-art novel cell detection models, reaching the most AUROC performance(the only one method whose averaged AUROC results are above 94%, up to 16.26% more comparing to the second-best method). We validate scNovel’s performance on a million-scale dataset to illustrate the scalability of scNovel further. Applying scNovel on a clinical COVID-19 dataset, three potential novel subtypes of Macrophages are identified, where the COVID-related differential genes are also detected to have consistent expression patterns through deeper analysis. We believe that our proposed pipeline will be an important tool for high-throughput clinical data in a wide range of applications.",
                "authors": [
                    {
                        "name": "Cheng Y."
                    },
                    {
                        "name": "King I."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Wei H."
                    },
                    {
                        "name": "Zheng C."
                    }
                ],
                "date": "2024-05-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "scNovel: a scalable deep learning-based network for novel rare cell discovery in single-cell transcriptomics"
            },
            "pmcid": "PMC10981759",
            "pmid": "38555470"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Chromosome conformation capture",
            "uri": "http://edamontology.org/topic_3940"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
