{
    "additionDate": "2020-01-09T18:10:35Z",
    "biotoolsCURIE": "biotools:ETNA",
    "biotoolsID": "ETNA",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "raffaele.decaterina@unipi.it",
            "name": "Raffaele De Caterina",
            "typeEntity": "Person"
        }
    ],
    "description": "The global Edoxaban Treatment in routine cliNical prActice (ETNA) noninterventional study program.\n\nBACKGROUND:Randomized controlled trials showed the nonvitamin K oral anticoagulant (NOAC) edoxaban was effective and safe for stroke and systemic embolism prevention in nonvalvular atrial fibrillation (AF) and for the prevention and treatment of venous thromboembolism (VTE; including pulmonary embolism and deep vein thrombosis). Additional research is needed to evaluate the effects of edoxaban in routine clinical practice. Therefore, the Edoxaban Treatment in routine cliNical prActice (ETNA) program is being conducted to provide routine clinical care data on characteristics and outcomes in patients with AF or VTE receiving edoxaban.\n\n||| HOMEPAGE MISSING!",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31650560",
    "lastUpdate": "2020-01-09T18:10:35Z",
    "name": "ETNA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/CLC.23279",
            "metadata": {
                "abstract": "© 2019 The Authors. Clinical Cardiology published by Wiley Periodicals, Inc.Background: Randomized controlled trials showed the nonvitamin K oral anticoagulant (NOAC) edoxaban was effective and safe for stroke and systemic embolism prevention in nonvalvular atrial fibrillation (AF) and for the prevention and treatment of venous thromboembolism (VTE; including pulmonary embolism and deep vein thrombosis). Additional research is needed to evaluate the effects of edoxaban in routine clinical practice. Therefore, the Edoxaban Treatment in routine cliNical prActice (ETNA) program is being conducted to provide routine clinical care data on characteristics and outcomes in patients with AF or VTE receiving edoxaban. Methods: The Global ETNA program integrates prospectively collected data from edoxaban patients in regional ETNA noninterventional studies across Europe, Japan, and East and Southeast Asia into indication-specific databases for AF and VTE. Targeted enrollment is >31 000 patients (AF >26 000; VTE >4500), with a follow-up of 2 years for AF and 1 year for VTE. Data integration will be possible using consistent terminology, parameter definitions, and data collection across the regional noninterventional studies. Safety and effectiveness data will be assessed. Crude rates of outcomes including bleeding and thromboembolic events will be reported. Results: Globally, enrollment began in early 2015 and is ongoing. Conclusions: Global ETNA will generate the largest integrated prospective repository of routine clinical care data for a single NOAC in patients with AF or VTE. It will provide important information on the safety of edoxaban in routine clinical care and gather further information on its effectiveness.",
                "authors": [
                    {
                        "name": "De Caterina R."
                    },
                    {
                        "name": "Agnelli G."
                    },
                    {
                        "name": "Laeis P."
                    },
                    {
                        "name": "Unverdorben M."
                    },
                    {
                        "name": "Rauer H."
                    },
                    {
                        "name": "Wang C.-C."
                    },
                    {
                        "name": "Nakamura M."
                    },
                    {
                        "name": "Chiu K.-M."
                    },
                    {
                        "name": "Reimitz P.-E."
                    },
                    {
                        "name": "Koretsune Y."
                    },
                    {
                        "name": "Chen C."
                    },
                    {
                        "name": "Thee U."
                    },
                    {
                        "name": "Kaburagi J."
                    },
                    {
                        "name": "Kim Y.-H."
                    },
                    {
                        "name": "Choi W.-I."
                    },
                    {
                        "name": "Yamashita T."
                    },
                    {
                        "name": "Cohen A."
                    },
                    {
                        "name": "Kirchhof P."
                    }
                ],
                "citationCount": 1,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Clinical Cardiology",
                "title": "The global Edoxaban Treatment in routine cliNical prActice (ETNA) noninterventional study program: rationale and design"
            },
            "pmcid": "PMC6906985",
            "pmid": "31650560"
        }
    ],
    "topic": [
        {
            "term": "Pharmacovigilance",
            "uri": "http://edamontology.org/topic_3378"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Quality affairs",
            "uri": "http://edamontology.org/topic_3393"
        }
    ]
}