{
    "additionDate": "2021-03-19T08:44:47Z",
    "biotoolsCURIE": "biotools:geco",
    "biotoolsID": "geco",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "habowski@uci.edu",
            "name": "A. N. Habowski",
            "orcidid": "https://orcid.org/0000-0003-1107-3208",
            "typeEntity": "Person"
        }
    ],
    "description": "gene expression clustering optimization app for non-linear data visualization of patterns.\n\nWelcome to GECO (Gene Expression Clustering Optimization), the straightforward, user friendly Streamlit app to visualize and investigate data patterns with non-linear reduced dimensionality plots. Although developed for bulk RNA-seq data, GECO can be used to analyze any .csv data matrix with sample names (columns) and type (rows) [type = genes, protein, any other unique ID].",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Expression data visualisation",
                    "uri": "http://edamontology.org/operation_0571"
                },
                {
                    "term": "Expression profile clustering",
                    "uri": "http://edamontology.org/operation_0313"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                }
            ]
        }
    ],
    "homepage": "http://www.theGECOapp.com",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-26T09:14:25Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/starstorms9/geco"
        }
    ],
    "name": "GECO",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03951-2",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Due to continued advances in sequencing technology, the limitation in understanding biological systems through an “-omics” lens is no longer the generation of data, but the ability to analyze it. Importantly, much of this rich -omics data is publicly available waiting to be further investigated. Although many code-based pipelines exist, there is a lack of user-friendly and accessible applications that enable rapid analysis or visualization of data. Results: GECO (Gene Expression Clustering Optimization; http://www.theGECOapp.com) is a minimalistic GUI app that utilizes non-linear reduction techniques to rapidly visualize expression trends in many types of biological data matrices (such as bulk RNA-seq or proteomics). The required input is a data matrix with samples and any type of expression level of genes/protein/other with a unique ID. The output is an interactive t-SNE or UMAP analysis that clusters genes (or proteins/other unique IDs) based on their expression patterns across the multiple samples enabling visualization of expression trends. Customizable settings for dimensionality reduction, data normalization, along with visualization parameters including coloring and filters, ensure adaptability to a variety of user uploaded data. Conclusion: This local and cloud-hosted web browser app enables investigation of any -omic data matrix in a rapid and code-independent manner. With the continued growth of available -omic data, the ability to quickly evaluate a dataset, including specific genes of interest, is more important than ever. GECO is intended to supplement traditional statistical analysis methods and is particularly useful when visualizing clusters of genes with similar trajectories across many samples (ex: multiple cell types, time course, dose response). Users will be empowered to investigate -omic data with a new lens of visualization and analysis that has the potential to uncover genes of interest, cohorts of co-regulated genes programs, and previously undetected patterns of expression.",
                "authors": [
                    {
                        "name": "Habowski A.N."
                    },
                    {
                        "name": "Habowski T.J."
                    },
                    {
                        "name": "Waterman M.L."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "GECO: gene expression clustering optimization app for non-linear data visualization of patterns"
            },
            "pmcid": "PMC7831185",
            "pmid": "33494695"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
