
{
    "credit": [
        {
            "email": "kent@soe.ucsc.edu",
            "name": "Jim Kent",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://users.soe.ucsc.edu/~kent/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://affymetrix2.bioinf.fbb.msu.ru/description.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Genome visualisation",
                    "uri": "http://edamontology.org/operation_3208"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                },
                {
                    "term": "Microarray probe design",
                    "uri": "http://edamontology.org/operation_0309"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Gene transcripts",
                "uri": "http://edamontology.org/topic_3512"
            },
            {
                "term": "Probes and primers",
                "uri": "http://edamontology.org/topic_0632"
            },
            {
                "term": "DNA polymorphism",
                "uri": "http://edamontology.org/topic_2885"
            },
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "Microarray experiment",
                "uri": "http://edamontology.org/topic_3518"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Standard Affymetrix technology evaluates gene expression by measuring the intensity of mRNA hybridization with a panel of the 25-mer oligonucleotide probes, and summarizing the probe signal intensities by a robust average method. However, in many cases, signal intensity of the probe does not correlate with gene expression. This could be due to the hybridization of the probe to a transcript of another gene, mapping of the probe to an intron, alternative splicing, single nucleotide polymorphisms and other reasons. We have developed a database, PLANdbAffy (available at http://affymetrix2.bioinf.fbb.msu.ru), that contains the results of the alignment of probe sequences from five Affymetrix expression microarrays to the human genome. We have determined the probes matching the transcript-coding regions in the correct orientation. For each such probe alignment region, we determined the mRNA and EST sequences that contain the probe sequence. In the textual part of the database interface we summarize the data on the sequences that cover the probe alignment region and SNPs that are located inside it. The graphical part of our database interface is implemented as custom tracks to the UCSC genome browser that allows one to utilize all the data that are offered by UCSC browser. © The Author(s) 2009. Published by Oxford University Press.",
            "authors": [
                "Nurtdinov R.N.",
                "Vasiliev M.O.",
                "Ershova A.S.",
                "Lossev I.S.",
                "Karyagina A.S."
            ],
            "cit_count": 22,
            "journal": "Nucleic Acids Research",
            "pmid": "19906711",
            "title": "PLANdbAffy: Probe-level annotation database for Affymetrix expression microarrays",
            "year": "2009-11-10"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:plandbaffy",
        "biotoolsID": "plandbaffy",
        "description": "Contains the results of the alignment of probe sequences from five Affymetrix expression microarrays to the human genome. Probes matching the transcript-coding regions in the correct orientation have been determined. For each such probe alignment region, the mRNA and EST sequences that contain the probe sequence have also been determined. In the textual part of the database interface, data on the sequences that cover the probe alignment region and SNPs that are located inside it is summarized.",
        "homepage": "http://affymetrix2.bioinf.fbb.msu.ru",
        "name": "PLANdbAffy"
    }
}