{
    "accessibility": "Open access",
    "additionDate": "2022-10-03T23:23:56.559965Z",
    "biotoolsCURIE": "biotools:epiconv",
    "biotoolsID": "epiconv",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "linli@shanghaitech.edu.cn",
            "name": "Li Lin",
            "typeEntity": "Person"
        },
        {
            "email": "zhangly@shanghaitech.edu.cn",
            "name": "Liye Zhang",
            "typeEntity": "Person"
        }
    ],
    "description": "EpiConv is an algorithm of clustering scATAC-seq data and correcting batch effects.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/LiLin-biosoft/epiConv",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T15:31:00.523543Z",
    "license": "MIT",
    "name": "epiConv",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/s12859-022-04858-w",
            "metadata": {
                "abstract": "Background: Technical improvement in ATAC-seq makes it possible for high throughput profiling the chromatin states of single cells. However, data from multiple sources frequently show strong technical variations, which is referred to as batch effects. In order to perform joint analysis across multiple datasets, specialized method is required to remove technical variations between datasets while keep biological information. Results: Here we present an algorithm named epiConv to perform joint analyses on scATAC-seq datasets. We first show that epiConv better corrects batch effects and is less prone to over-fitting problem than existing methods on a collection of PBMC datasets. In a collection of mouse brain data, we show that epiConv is capable of aligning low-depth scATAC-Seq from co-assay data (simultaneous profiling of transcriptome and chromatin) onto high-quality ATAC-seq reference and increasing the resolution of chromatin profiles of co-assay data. Finally, we show that epiConv can be used to integrate cells from different biological conditions (T cells in normal vs. germ-free mouse; normal vs. malignant hematopoiesis), which reveals hidden cell populations that would otherwise be undetectable. Conclusions: In this study, we introduce epiConv to integrate multiple scATAC-seq datasets and perform joint analysis on them. Through several case studies, we show that epiConv removes the batch effects and retains the biological signal. Moreover, joint analysis across multiple datasets improves the performance of clustering and differentially accessible peak calling, especially when the biological signal is weak in single dataset.",
                "authors": [
                    {
                        "name": "Lin L."
                    },
                    {
                        "name": "Zhang L."
                    }
                ],
                "citationCount": 4,
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Joint analysis of scATAC-seq datasets using epiConv"
            },
            "pmcid": "PMC9338487",
            "pmid": "35906531"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Immunoprecipitation experiment",
            "uri": "http://edamontology.org/topic_3656"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
