{
    "additionDate": "2021-01-18T09:18:44Z",
    "biotoolsCURIE": "biotools:polya-miner",
    "biotoolsID": "polya-miner",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhandong.liu@bcm.edu",
            "name": "Zhandong Liu",
            "orcidid": "https://orcid.org/0000-0002-7608-0831",
            "typeEntity": "Person"
        }
    ],
    "description": "PolyA-miner is an accurate assessment of differential alternative poly-adenylation from 3'Seq data using vector projections and non-negative matrix factorization.\n\nMore than half of human genes exercise alternative polyadenylation (APA) and generate mRNA transcripts with varying 3' untranslated regions (UTR).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Neurite measurement",
                    "uri": "http://edamontology.org/operation_3450"
                }
            ]
        }
    ],
    "homepage": "http://www.liuzlab.org/PolyA-miner/",
    "lastUpdate": "2021-01-24T14:53:32Z",
    "name": "PolyA-miner",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA398",
            "metadata": {
                "abstract": "© 2020 The Author(s). Published by Oxford University Press on behalf of Nucleic Acids Research.Almost 70% of human genes undergo alternative polyadenylation (APA) and generate mRNA transcripts with varying lengths, typically of the 3′ untranslated regions (UTR). APA plays an important role in development and cellular differentiation, and its dysregulation can cause neuropsychiatric diseases and increase cancer severity. Increasing awareness of APA's role in human health and disease has propelled the development of several 3′ sequencing (3′Seq) techniques that allow for precise identification of APA sites. However, despite the recent data explosion, there are no robust computational tools that are precisely designed to analyze 3′Seq data. Analytical approaches that have been used to analyze these data predominantly use proximal to distal usage. With about 50% of human genes having more than two APA isoforms, current methods fail to capture the entirety of APA changes and do not account for non-proximal to non-distal changes. Addressing these key challenges, this study demonstrates PolyA-miner, an algorithm to accurately detect and assess differential alternative polyadenylation specifically from 3′Seq data. Genes are abstracted as APA matrices, and differential APA usage is inferred using iterative consensus non-negative matrix factorization (NMF) based clustering. PolyA-miner accounts for all non-proximal to non-distal APA switches using vector projections and reflects precise gene-level 3′UTR changes. It can also effectively identify novel APA sites that are otherwise undetected when using reference-based approaches. Evaluation on multiple datasets-first-generation MicroArray Quality Control (MAQC) brain and Universal Human Reference (UHR) PolyA-seq data, recent glioblastoma cell line NUDT21 knockdown Poly(A)-ClickSeq (PAC-seq) data, and our own mouse hippocampal and human stem cell-derived neuron PAC-seq data-strongly supports the value and protocol-independent applicability of PolyA-miner. Strikingly, in the glioblastoma cell line data, PolyA-miner identified more than twice the number of genes with APA changes than initially reported. With the emerging importance of APA in human development and disease, PolyA-miner can significantly improve data analysis and help decode the underlying APA dynamics.",
                "authors": [
                    {
                        "name": "Yalamanchili H.K."
                    },
                    {
                        "name": "Alcott C.E."
                    },
                    {
                        "name": "Ji P."
                    },
                    {
                        "name": "Wagner E.J."
                    },
                    {
                        "name": "Zoghbi H.Y."
                    },
                    {
                        "name": "Liu Z."
                    }
                ],
                "citationCount": 4,
                "date": "2020-07-09T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PolyA-miner: Accurate assessment of differential alternative poly-adenylation from 3′Seq data using vector projections and non-negative matrix factorization"
            },
            "pmcid": "PMC7337927",
            "pmid": "32463457"
        }
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        }
    ],
    "validated": 1
}