{
    "name": "Nephele", 
    "description": "NIAID, a cloud based tool for microbiome or metagenomics data analysis. Nephele allows you to process and analyze 16S raw data using pipelines based on QIIME and mothur. It also facilitates WGS functional analyses using bioBakery tools such as MetaPhlAn, HUMMAnN and metagenomic assembly using the a5-miseq/UDBA-UD.", 
    "homepage": "https://nephele.niaid.nih.gov", 
    "biotoolsID": "nephele", 
    "biotoolsCURIE": "biotools:nephele", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3460", 
                    "term": "Taxonomic classification"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Workflow"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3697", 
            "term": "Microbial ecology"
        }, 
        {
            "uri": "http://edamontology.org/topic_3174", 
            "term": "Metagenomics"
        }, 
        {
            "uri": "http://edamontology.org/topic_1775", 
            "term": "Function analysis"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": "Mature", 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "https://nephele.niaid.nih.gov/#guide", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1145/1646468.1646476", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "Nephele: Efficient parallel data processing in the cloud", 
                "abstract": "In recent years Cloud Computing has emerged as a promising new approach for ad-hoc parallel data processing. Major cloud computing companies have started to integrate frameworks for parallel data processing in their product portfolio, making it easy for customers to access these services and to deploy their programs. However, the processing frameworks which are currently used stem from the field of cluster computing and disregard the particular nature of a cloud. As a result, the allocated compute resources may be inadequate for big parts of the submitted job and unnecessarily increase processing time and cost. In this paper we discuss the opportunities and challenges for efficient parallel data processing in clouds and present our ongoing research project Nephele. Nephele is the first data processing framework to explicitly exploit the dynamic resource allocation offered by today's compute clouds for both, task scheduling and execution. It allows assigning the particular tasks of a processing job to different types of virtual machines and takes care of their instantiation and termination during the job execution. Based on this new framework, we perform evaluations on a compute cloud system and compare the results to the existing data processing framework Hadoop. Copyright 2009 ACM.", 
                "date": "2009-12-01T00:00:00Z", 
                "citationCount": 76, 
                "authors": [
                    {
                        "name": "Warneke D."
                    }, 
                    {
                        "name": "Kao O."
                    }
                ], 
                "journal": "Proceedings of the 2nd ACM Workshop on Many-Task Computing on Grids and Supercomputers 2009, MTAGS '09"
            }
        }
    ], 
    "credit": [
        {
            "name": "Nephele Support", 
            "email": "NEPHELESUPPORT@ocicb-bcbb.atlassian.net", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "seqwiki_import", 
    "additionDate": "2017-01-13T13:15:38Z", 
    "lastUpdate": "2018-12-10T12:58:53Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}