{
    "accessibility": "Open access",
    "additionDate": "2023-05-31T07:46:01.760391Z",
    "biotoolsCURIE": "biotools:mybrain-seq",
    "biotoolsID": "mybrain-seq",
    "collectionID": [
        "MBS"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "email": "daniel.prz.rodriguez@gmail.com",
            "name": "Daniel Pérez-Rodríguez",
            "orcidid": "https://orcid.org/0000-0002-8110-3567",
            "typeEntity": "Person",
            "url": "https://www.linkedin.com/in/daniel-p%C3%A9rez-rodr%C3%ADguez-26a921264/"
        },
        {
            "email": "hlfernandez@uvigo.gal",
            "name": "Hugo López-Fernández",
            "orcidid": "https://orcid.org/0000-0002-6476-7206",
            "typeEntity": "Person",
            "url": "https://es.linkedin.com/in/hugo-l%C3%B3pez-fern%C3%A1ndez-80307589"
        },
        {
            "email": "roberto.carlos.agis.balboa@sergas.es",
            "name": "Roberto Carlos Agís-Balboa",
            "orcidid": "https://orcid.org/0000-0001-9899-9569",
            "typeEntity": "Person",
            "url": "https://es.linkedin.com/in/robertocarlosagisbalboa"
        }
    ],
    "description": "MyBrain-Seq is a Compi pipeline for performing full analyses of miRNA-Seq data, with particular interest on neuropsychiatric data. It can automatically identify differentially expressed microRNAs (DE miRNAs) between two conditions using two differential expression analysis software, namely DESeq2 and EdgeR, and is able to offer an integrated result suitable for experimental validation. Additionally, a functional analysis module puts biological meaning behind the list of DE miRNAs and eases the process of biomarker identification.",
    "documentation": [
        {
            "note": "Case study using myBrain-Seq.",
            "type": [
                "Other"
            ],
            "url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC10135678/"
        },
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/sing-group/my-brain-seq"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dendrogram visualisation",
                    "uri": "http://edamontology.org/operation_2938"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Heat map generation",
                    "uri": "http://edamontology.org/operation_0531"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Heat map generation",
                    "uri": "http://edamontology.org/operation_0531"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Network visualisation",
                    "uri": "http://edamontology.org/operation_3925"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Nucleic acid sequence analysis",
                    "uri": "http://edamontology.org/operation_2478"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "RNA-Seq quantification",
                    "uri": "http://edamontology.org/operation_3800"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Sequence contamination filtering",
                    "uri": "http://edamontology.org/operation_3187"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Sequencing quality control",
                    "uri": "http://edamontology.org/operation_3218"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                }
            ]
        }
    ],
    "homepage": "https://github.com/sing-group/my-brain-seq",
    "lastUpdate": "2023-05-31T07:46:52.130710Z",
    "license": "MIT",
    "link": [
        {
            "note": "MyBrain-Seq  Compi Hub repository.",
            "type": [
                "Repository"
            ],
            "url": "https://sing-group.org/compihub/explore/625e719acc1507001943ab7f#overview"
        },
        {
            "note": "MyBrain-Seq Docker Hub repository.",
            "type": [
                "Repository"
            ],
            "url": "https://hub.docker.com/r/singgroup/my-brain-seq"
        },
        {
            "note": "MyBrain-Seq GitHub repository.",
            "type": [
                "Repository"
            ],
            "url": "https://github.com/sing-group/my-brain-seq"
        },
        {
            "note": "MyBrain-Seq publication.",
            "type": [
                "Other"
            ],
            "url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC10135678/"
        }
    ],
    "maturity": "Emerging",
    "name": "myBrain-Seq",
    "owner": "dannyzimm",
    "publication": [
        {
            "doi": "10.1007/978-3-030-86258-9_5",
            "metadata": {
                "abstract": "MiRNAs are attracting considerable interest as potential biomarkers on neuropsychiatric diseases due to their expression plasticity. In the last decade, a large number of studies have been published in this regard with promising results; however, there is widespread concern about the reproducibility of these results. This study aims to compare the differentially expressed miRNAs reported by 5 recent studies of neuropsychiatric diseases, with those obtained through the miARma-Seq pipeline [1]. In general, we found a low reproducibility (0–74%), and some variations related to the software used for the differential expression analysis. Our results support the idea that miRNAs reported as potential biomarkers in neuropsychiatric diseases are strongly correlated with the analytical methodology and the biological references used; nonetheless, further research is needed to establish the magnitude of this problem and spot its main causes.",
                "authors": [
                    {
                        "name": "Agis-Balboa R.C."
                    },
                    {
                        "name": "Lopez-Fernandez H."
                    },
                    {
                        "name": "Perez-Rodriguez D."
                    }
                ],
                "citationCount": 3,
                "date": "2022-01-01T00:00:00Z",
                "journal": "Lecture Notes in Networks and Systems",
                "title": "On the Reproducibility of MiRNA-Seq Differential Expression Analyses in Neuropsychiatric Diseases"
            },
            "type": [
                "Review"
            ]
        },
        {
            "doi": "10.1007/978-3-031-17024-9_4",
            "metadata": {
                "abstract": "In the last decade, miRNAs have attracted noticeable interest as potential biomarkers of neuropsychiatric conditions. However, a standard methodology for miRNA-Seq analysis does not yet exist, raising concerns about the reproducibility of the in-silico results and limiting their usefulness. This situation motivated us to design a miRNA-Seq pipeline specialized in the analysis of neuropsychiatric data, aiming to integrate the results of several bioinformatics tools in a highly reproducible workflow. In this study, we performed an initial test of the usefulness of our new pipeline, named myBrain-Seq, by reanalyzing four recent miRNA-Seq studies of neuropsychiatric conditions. We then compared the myBrain-Seq results with the original results and with an additional reanalysis done with another pipeline in order to make an estimation of the overall replicability. We found one of the three myBrain-Seq methodologies to be the one with best replicability, although the heterogeneity of the results and the absence of an experimental validation limits our conclusions. Further work is required to assess myBrain-Seq’ performance using a bigger dataset of studies with experimental validation data available.",
                "authors": [
                    {
                        "name": "Agis-Balboa R.C."
                    },
                    {
                        "name": "Lopez-Fernandez H."
                    },
                    {
                        "name": "Perez-Rodriguez D."
                    },
                    {
                        "name": "Perez-Rodriguez M."
                    }
                ],
                "citationCount": 2,
                "date": "2023-01-01T00:00:00Z",
                "journal": "Lecture Notes in Networks and Systems",
                "title": "Towards a Flexible and Portable Workflow for Analyzing miRNA-Seq Neuropsychiatric Data: An Initial Replicability Assessment"
            },
            "type": [
                "Benchmarking study"
            ]
        },
        {
            "doi": "10.3390/ijms24031891",
            "metadata": {
                "abstract": "Schizophrenia (SZ) is a serious mental disorder that is typically treated with antipsychotic medication. Treatment-resistant schizophrenia (TRS) is the condition where symptoms remain after pharmacological intervention, resulting in long-lasting functional and social impairments. As the identification and treatment of a TRS patient requires previous failed treatments, early mechanisms of detection are needed in order to quicken the access to effective therapy, as well as improve treatment adherence. In this study, we aim to find a microRNA (miRNA) signature for TRS, as well as to shed some light on the molecular pathways potentially involved in this severe condition. To do this, we compared the blood miRNAs of schizophrenia patients that respond to medication and TRS patients, thus obtaining a 16-miRNA TRS profile. Then, we assessed the ability of this signature to separate responders and TRS patients using hierarchical clustering, observing that most of them are grouped correctly (~70% accuracy). We also conducted a network, pathway analysis, and bibliography search to spot molecular pathways potentially altered in TRS. We found that the response to stress seems to be a key factor in TRS and that proteins p53, SIRT1, MDM2, and TRIM28 could be the potential mediators of such responses. Finally, we suggest a molecular pathway potentially regulated by the miRNAs of the TRS profile.",
                "authors": [
                    {
                        "name": "Agis-Balboa R.C."
                    },
                    {
                        "name": "Burkhardt S."
                    },
                    {
                        "name": "Fischer A."
                    },
                    {
                        "name": "Lopez-Fernandez H."
                    },
                    {
                        "name": "Olivares J.M."
                    },
                    {
                        "name": "Pena-Centeno T."
                    },
                    {
                        "name": "Penedo M.A."
                    },
                    {
                        "name": "Perez-Rodriguez D."
                    },
                    {
                        "name": "Prieto-Gonzalez J.M."
                    },
                    {
                        "name": "Rivera-Baltanas T."
                    }
                ],
                "citationCount": 1,
                "date": "2023-02-01T00:00:00Z",
                "journal": "International Journal of Molecular Sciences",
                "title": "MiRNA Differences Related to Treatment-Resistant Schizophrenia"
            },
            "type": [
                "Usage"
            ]
        },
        {
            "doi": "10.3390/biomedicines11041230",
            "metadata": {
                "abstract": "High-throughput sequencing of small RNA molecules such as microRNAs (miRNAs) has become a widely used approach for studying gene expression and regulation. However, analyzing miRNA-Seq data can be challenging because it requires multiple steps, from quality control and preprocessing to differential expression and pathway-enrichment analyses, with many tools and databases available for each step. Furthermore, reproducibility of the analysis pipeline is crucial to ensure that the results are accurate and reliable. Here, we present myBrain-Seq, a comprehensive and reproducible pipeline for analyzing miRNA-Seq data that incorporates miRNA-specific solutions at each step of the analysis. The pipeline was designed to be flexible and user-friendly, allowing researchers with different levels of expertise to perform the analysis in a standardized and reproducible manner, using the most common and widely used tools for each step. In this work, we describe the implementation of myBrain-Seq and demonstrate its capacity to consistently and reproducibly identify differentially expressed miRNAs and enriched pathways by applying it to a real case study in which we compared schizophrenia patients who responded to medication with treatment-resistant schizophrenia patients to obtain a 16-miRNA treatment-resistant schizophrenia profile.",
                "authors": [
                    {
                        "name": "Agis-Balboa R.C."
                    },
                    {
                        "name": "Lopez-Fernandez H."
                    },
                    {
                        "name": "Perez-Rodriguez D."
                    }
                ],
                "date": "2023-04-01T00:00:00Z",
                "journal": "Biomedicines",
                "title": "MyBrain-Seq: A Pipeline for MiRNA-Seq Data Analysis in Neuropsychiatric Disorders"
            },
            "type": [
                "Primary"
            ],
            "version": "1.1.0"
        },
        {
            "doi": "10.1016/j.compbiomed.2021.104603",
            "type": [
                "Review"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Workflow"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        },
        {
            "term": "Psychiatry",
            "uri": "http://edamontology.org/topic_3419"
        }
    ],
    "version": [
        "1.1.0"
    ]
}
