{
    "additionDate": "2020-01-09T17:45:01Z",
    "biotoolsCURIE": "biotools:SEPATH",
    "biotoolsID": "SEPATH",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "A.Gihawi@uea.ac.uk",
            "name": "Abraham Gihawi",
            "orcidid": "https://orcid.org/0000-0002-3676-5561",
            "typeEntity": "Person"
        }
    ],
    "description": "benchmarking the search for pathogens in human tissue whole genome sequence data leads to template pipelines.\n\nSEPATH template pipelines optimised for UEA high performance computing cluster.\n\nSEPATH - Searching for Pathogens Computational Pipeline.\n\nA repository containing scripts and results required for the SEPATH manuscript.\n\nSEPATH is a software designed to obtain accurate taxonomic classifications from within host tissue sequences. It is implemented in python 3 and relies on the Snakemake workflow management system. SEPATH was produced specifically to provide researchers with the ability to conduct ultra high throughput metagenomic studies from raw data to classification and has been benchmarked on simulated human cancer whole genome sequence datasets",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                }
            ]
        }
    ],
    "homepage": "https://github.com/UEA-Cancer-Genetics-Lab/sepath_tool_UEA",
    "language": [
        "R",
        "Shell",
        "Python"
    ],
    "lastUpdate": "2020-01-09T17:45:01Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/UEA-Cancer-Genetics-Lab/sepath_paper"
        }
    ],
    "name": "SEPATH",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S13059-019-1819-8",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Human tissue is increasingly being whole genome sequenced as we transition into an era of genomic medicine. With this arises the potential to detect sequences originating from microorganisms, including pathogens amid the plethora of human sequencing reads. In cancer research, the tumorigenic ability of pathogens is being recognized, for example, Helicobacter pylori and human papillomavirus in the cases of gastric non-cardia and cervical carcinomas, respectively. As of yet, no benchmark has been carried out on the performance of computational approaches for bacterial and viral detection within host-dominated sequence data. Results: We present the results of benchmarking over 70 distinct combinations of tools and parameters on 100 simulated cancer datasets spiked with realistic proportions of bacteria. mOTUs2 and Kraken are the highest performing individual tools achieving median genus-level F1 scores of 0.90 and 0.91, respectively. mOTUs2 demonstrates a high performance in estimating bacterial proportions. Employing Kraken on unassembled sequencing reads produces a good but variable performance depending on post-classification filtering parameters. These approaches are investigated on a selection of cervical and gastric cancer whole genome sequences where Alphapapillomavirus and Helicobacter are detected in addition to a variety of other interesting genera. Conclusions: We provide the top-performing pipelines from this benchmark in a unifying tool called SEPATH, which is amenable to high throughput sequencing studies across a range of high-performance computing clusters. SEPATH provides a benchmarked and convenient approach to detect pathogens in tissue sequence data helping to determine the relationship between metagenomics and disease.",
                "authors": [
                    {
                        "name": "Gihawi A."
                    },
                    {
                        "name": "Rallapalli G."
                    },
                    {
                        "name": "Hurst R."
                    },
                    {
                        "name": "Cooper C.S."
                    },
                    {
                        "name": "Leggett R.M."
                    },
                    {
                        "name": "Brewer D.S."
                    }
                ],
                "citationCount": 1,
                "date": "2019-10-22T00:00:00Z",
                "journal": "Genome Biology",
                "title": "SEPATH: Benchmarking the search for pathogens in human tissue whole genome sequence data leads to template pipelines"
            },
            "pmcid": "PMC6805339",
            "pmid": "31639030"
        }
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Computer science",
            "uri": "http://edamontology.org/topic_3316"
        }
    ]
}