{
    "additionDate": "2021-01-18T07:35:53Z",
    "biotoolsCURIE": "biotools:p6ma",
    "biotoolsID": "p6ma",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "kongqp@mail.kiz.ac.cn",
            "name": "Qing-Peng Kong",
            "orcidid": "https://orcid.org/0000-0002-6046-4494",
            "typeEntity": "Person"
        }
    ],
    "description": "Identification of DNA N6-methyladenine sites by integration of sequence features.\n\np6mA is a N^6-methyladenine predictor which is trained by multiple species' data. There are 6 built-in models and you can choose a proper one. If your data is some species not included in the 4 species (O. sativa, C. elegans, D. melanogaster and H. sapiens), you can choose the Compre or Compre2 model. Compre model is trained by comprehensive samples without redunction of dedundancy and Compre2 model is trained by non-redundant comprehensive dataset.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                },
                {
                    "term": "Nucleosome position prediction",
                    "uri": "http://edamontology.org/operation_0432"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Konglab404/p6mA",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-15T14:28:47Z",
    "name": "p6mA",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S13072-020-00330-2",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: An increasing number of nucleic acid modifications have been profiled with the development of sequencing technologies. DNA N6-methyladenine (6mA), which is a prevalent epigenetic modification, plays important roles in a series of biological processes. So far, identification of DNA 6mA relies primarily on time-consuming and expensive experimental approaches. However, in silico methods can be implemented to conduct preliminary screening to save experimental resources and time, especially given the rapid accumulation of sequencing data. Results: In this study, we constructed a 6mA predictor, p6mA, from a series of sequence-based features, including physicochemical properties, position-specific triple-nucleotide propensity (PSTNP), and electron-ion interaction pseudopotential (EIIP). We performed maximum relevance maximum distance (MRMD) analysis to select key features and used the Extreme Gradient Boosting (XGBoost) algorithm to build our predictor. Results demonstrated that p6mA outperformed other existing predictors using different datasets. Conclusions: P6mA can predict the methylation status of DNA adenines, using only sequence files. It may be used as a tool to help the study of 6mA distribution pattern. Users can download it from https://github.com/Konglab404/p6mA.",
                "authors": [
                    {
                        "name": "Kong Q.-P."
                    },
                    {
                        "name": "Li G.-H."
                    },
                    {
                        "name": "Wang H.-T."
                    },
                    {
                        "name": "Xiao F.-H."
                    }
                ],
                "citationCount": 5,
                "date": "2020-02-24T00:00:00Z",
                "journal": "Epigenetics and Chromatin",
                "title": "Identification of DNA N6-methyladenine sites by integration of sequence features"
            },
            "pmcid": "PMC7038560",
            "pmid": "32093759"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        }
    ]
}
