{
    "additionDate": "2021-01-18T11:36:36Z",
    "biotoolsCURIE": "biotools:mendevar",
    "biotoolsID": "mendevar",
    "confidence_flag": "tool",
    "description": "A Rapid and Accessible Tool That Exploits Genomic Data in Public Health and Clinical Microbiology Applications.\n\nPublic databases for molecular typing and microbial genome diversity.\n\nA collection of open-access, curated databases that integrate population sequence data with provenance and phenotype information for over 100 different microbial species and genera.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Multilocus sequence typing",
                    "uri": "http://edamontology.org/operation_3840"
                },
                {
                    "term": "Peptide immunogenicity prediction",
                    "uri": "http://edamontology.org/operation_0252"
                },
                {
                    "term": "DNA vaccine design",
                    "uri": "http://edamontology.org/operation_0560"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "https://pubmlst.org",
    "lastUpdate": "2021-02-20T18:02:19Z",
    "name": "MenDeVAR",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/S0140-6736(14)60842-4",
            "metadata": {
                "abstract": "© 2014 Elsevier Ltd.Background Meningococcal conjugate vaccines protect individuals directly, but can also confer herd protection by interrupting carriage transmission. We assessed the effects of meningococcal quadrivalent glycoconjugate (MenACWY-CRM) or serogroup B (4CMenB) vaccination on meningococcal carriage rates in 18-24-year-olds.Methods In this phase 3, observer-blind, randomised controlled trial, university students aged 18-24 years from ten sites in England were randomly assigned (1:1:1, block size of three) to receive two doses 1 month apart of Japanese Encephalitis vaccine (controls), 4CMenB, or one dose of MenACWY-CRM then placebo. Participants were randomised with a validated computer-generated random allocation list. Participants and outcome-assessors were masked to the treatment group. Meningococci were isolated from oropharyngeal swabs collected before vaccination and at five scheduled intervals over 1 year. Primary outcomes were cross-sectional carriage 1 month after each vaccine course. Secondary outcomes included comparisons of carriage at any timepoint after primary analysis until study termination. Reactogenicity and adverse events were monitored throughout the study. Analysis was done on the modified intention-to-treat population, which included all enrolled participants who received a study vaccination and provided at least one assessable swab after baseline. This trial is registered with ClinicalTrials.gov, registration number NCT01214850.Findings Between Sept 21 and Dec 21, 2010, 2954 participants were randomly assigned (987 assigned to control [984 analysed], 979 assigned to 4CMenB [974 analysed], 988 assigned to MenACWY-CRM [983 analysed]); 33% of the 4CMenB group, 34% of the MenACWY-CRM group, and 31% of the control group were positive for meningococcal carriage at study entry. By 1 month, there was no significant difference in carriage between controls and 4CMenB (odds ratio 1·2, 95% CI 0·8-1·7) or MenACWY-CRM (0·9, [0·6-1·3]) groups. From 3 months after dose two, 4CMenB vaccination resulted in significantly lower carriage of any meningococcal strain (18·2% [95% CI 3·4-30·8] carriage reduction), capsular groups BCWY (26·6% [10·5-39·9] carriage reduction), capsular groups CWY (29·6% [8·1-46·0] carriage reduction), and serogroups CWY (28·5% [2·8-47·5] carriage reduction) compared with control vaccination. Significantly lower carriage rates were also noted in the MenACWY-CRM group compared with controls: 39·0% (95% CI 17·3-55·0) carriage reduction for serogroup Y and 36·2% (15·6-51·7) carriage reduction for serogroup CWY. Study vaccines were generally well tolerated, with increased rates of transient local injection pain and myalgia in the 4CMenB group. No safety concerns were identified.Interpretation Although we detected no significant difference between groups at 1 month after vaccine course, MenACWY-CRM and 4CMenB vaccines reduced meningococcal carriage rates during 12 months after vaccination and therefore might affect transmission when widely implemented.Funding Novartis Vaccines.",
                "authors": [
                    {
                        "name": "Read R.C."
                    },
                    {
                        "name": "Baxter D."
                    },
                    {
                        "name": "Chadwick D.R."
                    },
                    {
                        "name": "Faust S.N."
                    },
                    {
                        "name": "Finn A."
                    },
                    {
                        "name": "Gordon S.B."
                    },
                    {
                        "name": "Heath P.T."
                    },
                    {
                        "name": "Lewis D.J.M."
                    },
                    {
                        "name": "Pollard A.J."
                    },
                    {
                        "name": "Turner D.P.J."
                    },
                    {
                        "name": "Bazaz R."
                    },
                    {
                        "name": "Ganguli A."
                    },
                    {
                        "name": "Havelock T."
                    },
                    {
                        "name": "Neal K.R."
                    },
                    {
                        "name": "Okike I.O."
                    },
                    {
                        "name": "Morales-Aza B."
                    },
                    {
                        "name": "Patel K."
                    },
                    {
                        "name": "Snape M.D."
                    },
                    {
                        "name": "Williams J."
                    },
                    {
                        "name": "Gilchrist S."
                    },
                    {
                        "name": "Gray S.J."
                    },
                    {
                        "name": "Maiden M.C.J."
                    },
                    {
                        "name": "Toneatto D."
                    },
                    {
                        "name": "Wang H."
                    },
                    {
                        "name": "McCarthy M."
                    },
                    {
                        "name": "Dull P.M."
                    },
                    {
                        "name": "Borrow R."
                    }
                ],
                "citationCount": 185,
                "date": "2014-01-01T00:00:00Z",
                "journal": "The Lancet",
                "title": "Effect of a quadrivalent meningococcal ACWY glycoconjugate or a serogroup B meningococcal vaccine on meningococcal carriage: An observer-blind, phase 3 randomised clinical trial"
            },
            "pmid": "33055180"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ]
}