{
    "additionDate": "2022-08-11T08:21:55.520181Z",
    "biotoolsCURIE": "biotools:bexcis",
    "biotoolsID": "bexcis",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "zhoujiyuan5460@hotmail.com",
            "name": "Ji-Yuan Zhou",
            "typeEntity": "Person"
        },
        {
            "name": "Wen-Yi Yu"
        }
    ],
    "description": "Measuring the degree of the skewness of the X chromosome inactivation by the Bayesian method, the penalized Fieller's method and the Fieller's method.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Wen-YiYu/BEXCIS",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-08-11T08:21:55.522823Z",
    "license": "Not licensed",
    "name": "BEXCIS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/S12859-022-04721-Y",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: X chromosome inactivation (XCI) is an epigenetic phenomenon that one of two X chromosomes in females is transcriptionally silenced during early embryonic development. Skewed XCI has been reported to be associated with some X-linked diseases. There have been several methods measuring the degree of the skewness of XCI. However, these methods may still have several limitations. Results: We propose a Bayesian method to obtain the point estimate and the credible interval of the degree of XCI skewing by incorporating its prior information of being between 0 and 2. We consider a normal prior and a uniform prior for it (respectively denoted by BN and BU). We also propose a penalized point estimate based on the penalized Fieller’s method and derive the corresponding confidence interval. Simulation results demonstrate that the BN and BU methods can solve the problems of extreme point estimates, noninformative intervals, empty sets and discontinuous intervals. The BN method generally outperforms other methods with the lowest mean squared error in the point estimation, and well controls the coverage probability with the smallest median and the least variation of the interval width in the interval estimation. We apply all the methods to the Graves’ disease data and the Minnesota Center for Twin and Family Research data, and find that SNP rs3827440 in the Graves’ disease data may undergo skewed XCI towards the allele C. Conclusions: We recommend the BN method for measuring the degree of the skewness of XCI in practice. The R package BEXCIS is publicly available at https://github.com/Wen-YiYu/BEXCIS.",
                "authors": [
                    {
                        "name": "Fung W.K."
                    },
                    {
                        "name": "Li M.-K."
                    },
                    {
                        "name": "Yang Z.-Y."
                    },
                    {
                        "name": "Yu W.-Y."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Zhao P.-Z."
                    },
                    {
                        "name": "Zhou J.-Y."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "BEXCIS: Bayesian methods for estimating the degree of the skewness of X chromosome inactivation"
            },
            "pmcid": "PMC9128296",
            "pmid": "35610583"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Gynaecology and obstetrics",
            "uri": "http://edamontology.org/topic_3411"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
