{
    "additionDate": "2020-01-09T17:32:58Z",
    "biotoolsCURIE": "biotools:MPIC",
    "biotoolsID": "MPIC",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Shun H. Yip",
            "typeEntity": "Person"
        },
        {
            "name": "Naoto Fujiwara",
            "typeEntity": "Person"
        },
        {
            "email": "Shijia.Zhu@UTSouthwestern.edu",
            "name": "Shijia Zhu",
            "typeEntity": "Person"
        },
        {
            "email": "Yujin.Hoshida@UTSouthwestern.edu",
            "name": "Yujin Hoshida",
            "typeEntity": "Person"
        }
    ],
    "description": "Molecular Prognostic Indicators in Cirrhosis Database for Clinical Context-Specific in Silico Prognostic Biomarker Validation.\n\nMolecular Prognostic Indicators in Cirrhosis.\n\nDatabase for clinical context-specific in silico prognostic biomarker validation.\n\nThis is a system that enables quick and easy assessment of user’s prognostic gene signature in various liver disease patient cohorts for a specific clinical outcome",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://www.mpic-app.org",
    "language": [
        "Java",
        "SQL"
    ],
    "lastUpdate": "2020-12-29T10:20:13Z",
    "name": "MPIC",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FGENE.2019.00830",
            "metadata": {
                "abstract": "© Copyright © 2019 Yip, Fujiwara, Burke, Shetler, Peralta, Qian, Hoshida, Zhu and Hoshida.Prognostic biomarkers are vital in the management of progressive chronic diseases such as liver cirrhosis, affecting 1–2% of the global population and causing over 1 million deaths every year. Despite numerous candidate biomarkers in literature, the costly and lengthy process of validation hampers their clinical translation. Existing omics databases are not suitable for in silico validation due to the ignorance of critical factors, i.e., study design, clinical context of biomarker application, and statistical power. To address the unmet need, we have developed the Molecular Prognostic Indicators in Cirrhosis (MPIC) database as a representative example of an omics database tailored for prognostic biomarker validation. MPIC consists of (i) a molecular and clinical database structured by defined disease context and specific clinical outcome and annotated with employed study design and anticipated statistical power by disease domain experts, (ii) a bioinformatics analysis engine for user-provided gene-signature- or gene-based prognostic prediction, and (iii) a user interface for interactive exploration of relevant clinical cohort/scenario and assessment of significance and reliability of the result for prognostic prediction. MPIC assists cost-effective prognostic biomarker development by facilitating the process of validation, and will transform the care of chronic diseases such as cirrhosis. MPIC is freely available at www.mpic-app.org. The website is implemented in Java, Apache, and MySQL with all major browsers supported.",
                "authors": [
                    {
                        "name": "Yip S.H."
                    },
                    {
                        "name": "Fujiwara N."
                    },
                    {
                        "name": "Burke J."
                    },
                    {
                        "name": "Shetler A."
                    },
                    {
                        "name": "Peralta C."
                    },
                    {
                        "name": "Qian T."
                    },
                    {
                        "name": "Hoshida H."
                    },
                    {
                        "name": "Zhu S."
                    },
                    {
                        "name": "Hoshida Y."
                    }
                ],
                "date": "2019-09-18T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "MPIC: Molecular Prognostic Indicators in Cirrhosis Database for Clinical Context-Specific in Silico Prognostic Biomarker Validation"
            },
            "pmcid": "PMC6759478",
            "pmid": "31620162"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}