{
    "additionDate": "2018-04-29T10:36:35Z",
    "biotoolsCURIE": "biotools:shinyheatmap",
    "biotoolsID": "shinyheatmap",
    "credit": [
        {
            "name": "Bohdan Khomtchouk",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/Bohdan-Khomtchouk"
        }
    ],
    "description": "Ultra fast low memory heatmap web interface for big data genomics.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/Bohdan-Khomtchouk/shinyheatmap"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Heat map generation",
                    "uri": "http://edamontology.org/operation_0531"
                }
            ]
        }
    ],
    "homepage": "http://shinyheatmap.com/",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "shinyheatmap",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0176334",
            "metadata": {
                "abstract": "© 2017 Khomtchouk et al.This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Background Transcriptomics, metabolomics, metagenomics, and other various next-generation sequencing (-omics) fields are known for their production of large datasets, especially across single-cell sequencing studies. Visualizing such big data has posed technical challenges in biology, both in terms of available computational resources as well as programming acumen. Since heatmaps are used to depict high-dimensional numerical data as a colored grid of cells, efficiency and speed have often proven to be critical considerations in the process of successfully converting data into graphics. For example, rendering interactive heatmaps from large input datasets (e.g., 100k+ rows) has been computationally infeasible on both desktop computers and web browsers. In addition to memory requirements, programming skills and knowledge have frequently been barriers-to-entry for creating highly customizable heatmaps. Results We propose shinyheatmap: an advanced user-friendly heatmap software suite capable of efficiently creating highly customizable static and interactive biological heatmaps in a web browser. shinyheatmap is a low memory footprint program, making it particularly well-suited for the interactive visualization of extremely large datasets that cannot typically be computed in-memory due to size restrictions. Also, shinyheatmap features a built-in high performance web plug-in, fastheatmap, for rapidly plotting interactive heatmaps of datasets as large as 105-107 rows within seconds, effectively shattering previous performance benchmarks of heatmap rendering speed. Conclusions shinyheatmap is hosted online as a freely available web server with an intuitive graphical user interface: http://shinyheatmap.com. The methods are implemented in R, and are available as part of the shinyheatmap project at: https://github.com/Bohdan-Khomtchouk/ shinyheatmap. Users can access fastheatmap directly from within the shinyheatmap web interface, and all source code has been made publicly available on Github: https://github. com/Bohdan-Khomtchouk/fastheatmap.",
                "authors": [
                    {
                        "name": "Khomtchouk B.B."
                    },
                    {
                        "name": "Hennessy J.R."
                    },
                    {
                        "name": "Wahlestedt C."
                    }
                ],
                "citationCount": 30,
                "date": "2017-05-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Shinyheatmap: Ultra fast low memory heatmap web interface for big data genomics"
            },
            "pmcid": "PMC5426587",
            "pmid": "28493881"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        }
    ],
    "validated": 1
}