{
    "additionDate": "2018-08-22T10:44:53Z",
    "biotoolsCURIE": "biotools:etcal",
    "biotoolsID": "etcal",
    "credit": [
        {
            "email": "pawel@kasprowski.pl",
            "name": "Pawel Kasprowski",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A common platform that may be used in different calibration scenarios in video based oculography.",
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/kasprowski/etcal/blob/master/etcal/src/doc/Software%20description.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://github.com/kasprowski/etcal",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "LGPL-2.0",
    "link": [
        {
            "type": "Issue tracker",
            "url": "https://github.com/kasprowski/etcal/issues"
        }
    ],
    "name": "ETCAL",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1016/j.softx.2017.12.005",
            "metadata": {
                "abstract": "© 2017Recently eye tracking has become a popular technique that may be used for variety of applications starting from medical ones, through psychological, analyzinguser experience, ending with interactive games. Video based oculography (VOG) is the most popular technique because it is non-intrusive, can be use in users’ natural environment and are relatively cheap as it uses only classic cameras. There are already well established methods for eye detection on a camera capture. However, to be usable in gaze position estimation, this information must be associated with an area in an observer scene, which requires evaluating several parameters. These parameters are typically estimated during the process called calibration. The main purpose of the software described in this paper is to establish a common platform that is easy to use and may be used in different calibration scenarios. Apart from the normal regression based calibration the ETCAL library allows also to use more sophisticated methods like automatic parameters optimization or the automatic detection of gaze targets. The library is also easily extendable and may be accessed with a convenient Web/REST interface.",
                "authors": [
                    {
                        "name": "Kasprowski P."
                    },
                    {
                        "name": "Harezlak K."
                    }
                ],
                "date": "2018-07-01T00:00:00Z",
                "journal": "SoftwareX",
                "title": "ETCAL - A versatile and extendable library for eye tracker calibration"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Opthalmology",
            "uri": "http://edamontology.org/topic_3417"
        }
    ],
    "validated": 1,
    "version": [
        "0.1"
    ]
}