{
    "additionDate": "2017-02-10T14:15:21Z",
    "biotoolsCURIE": "biotools:pcons",
    "biotoolsID": "pcons",
    "credit": [
        {
            "email": "arne@bioinfo.se",
            "name": "Elofsson Lab",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Pcons.net is a protein structure prediction meta server that provides automated tools for protein structure prediction and analysis using a consensus approach.",
    "documentation": [
        {
            "type": "General",
            "url": "http://pcons.net/index.php?about=pcons"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein super-secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0268"
                },
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Protein structure analysis",
                    "uri": "http://edamontology.org/operation_2406"
                }
            ]
        }
    ],
    "homepage": "http://pcons.net/",
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "Pcons.net",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "In this study we present two methods to predict the local quality of a protein model: ProQres and ProQprof. ProQres is based on structural features that can be calculated from a model, while ProQprof uses alignment information and can only be used if the model is created from an alignment. In addition, we also propose a simple approach based on local consensus, Pcons-local. We show that all these methods perform better than state-of-the-art methodologies and that, when applicable, the consensus approach is by far the best approach to predict local structure quality. It was also found that ProQprof performed better than other methods for models based on distant relationships, while ProQres performed best for models based on closer relationship, i.e., a model has to be reasonably good to make a structural evaluation useful. Finally, we show that a combination of ProQprof and ProQres (ProQlocal) performed better than any other nonconsensus method for both high- and low-quality models. Additional information and Web servers are available at: http://www.sbc.su.se/ ~bjorn/ProQ/. Copyright © 2006 The Protein Society.",
                "authors": [
                    {
                        "name": "Wallner B."
                    },
                    {
                        "name": "Elofsson A."
                    }
                ],
                "citationCount": 129,
                "date": "2006-04-01T00:00:00Z",
                "journal": "Protein Science",
                "title": "Identification of correct regions in protein models using structural, alignment, and consensus information"
            },
            "pmid": "16522791"
        },
        {
            "metadata": {
                "abstract": "CASP provides a unique opportunity to compare the performance of automatic fold recognition methods with the performance of manual experts who might use these methods. Here, we show that a novel automatic fold recognition server, Pmodeller, is getting close to the performance of manual experts. Although a small group of experts still perform better, most of the experts participating in CASP5 actually performed worse even though they had full access to all automatic predictions. Pmodeller is based on Pcons (Lundström et al., Protein Sci 2001; 10(11):2354-2365) the first \"consensus\" predictor that uses predictions from many other servers. Therefore, the success of Pmodeller and other consensus servers should be seen as a tribute to the collective of all developers of fold recognition servers. Furthermore we show that the inclusion of another novel method, ProQ2, to evaluate the quality of the protein models improves the predictions. © 2003 Wiley-Liss, Inc.",
                "authors": [
                    {
                        "name": "Wallner B."
                    },
                    {
                        "name": "Fang H."
                    },
                    {
                        "name": "Elofsson A."
                    }
                ],
                "citationCount": 92,
                "date": "2003-11-12T00:00:00Z",
                "journal": "Proteins: Structure, Function and Genetics",
                "title": "Automatic Consensus-Based Fold Recognition Using Pcons, ProQ, and Pmodeller"
            },
            "pmid": "14579343"
        },
        {
            "metadata": {
                "abstract": "The Pcons.net Meta Server (http://pcons.net) provides improved automated tools for protein structure prediction and analysis using consensus. It essentially implements all the steps necessary to produce a high quality model of a protein. The whole process is fully automated and a potential user only submits the protein sequence. For PSI-BLAST detectable targets, an accurate model is generated within minutes of submission. For more difficult targets the sequence is automatically submitted to publicly available fold-recognition servers that use more advanced approaches to find distant structural homologs. The results from these servers are analyzed and assessed for structural correctness using Pcons and ProQ; and the user is presented with a ranked list of possible models. In addition, if the protein sequence contains more than one domain, these are automatically parsed out and resubmitted to the server as individual queries. © 2007 The Author(s).",
                "authors": [
                    {
                        "name": "Wallner B."
                    },
                    {
                        "name": "Larsson P."
                    },
                    {
                        "name": "Elofsson A."
                    }
                ],
                "citationCount": 44,
                "date": "2007-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Pcons.net: Protein structure prediction meta server"
            },
            "pmid": "17584798"
        },
        {
            "metadata": {
                "abstract": "Motivation: The success of the consensus approach to the protein structure prediction problem has led to development of several different consensus methods. Most of them only rely on a structural comparison of a number of different models. However, there are other types of information that might be useful such as the score from the server and structural evaluation. Results: Pcons5 is a new and improved version of the consensus predictor Pcons. Pcons5 integrates information from three different sources: the consensus analysis, structural evaluation and the score from the fold recognition servers. We show that Pcons5 is better than the previous version of Pcons and that it performs better than using only the consensus analysis. In addition, we also present a version of Pmodeller based on Pcons5, which performs significantly better than Pcons5. © The Author 2005. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Wallner B."
                    },
                    {
                        "name": "Elofsson A."
                    }
                ],
                "citationCount": 74,
                "date": "2005-12-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Pcons5: Combining consensus, structural evaluation and fold recognition scores"
            },
            "pmid": "16204344"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        }
    ],
    "validated": 1
}