{
    "additionDate": "2020-01-14T08:55:20Z",
    "biotoolsCURIE": "biotools:PlantAPAdb",
    "biotoolsID": "PlantAPAdb",
    "confidence_flag": "tool",
    "description": "a comprehensive database for alternative polyadenylation sites in plants.\n\nPlantAPAdb provides a comprehensive and manually curated catalog of APA sites in plants based on a large volume of data from diverse biological samples generated by 3′ seq. Currently, PlantAPAdb contains APA sites in seven plant organisms, including Oryza sativa L. (japonica and indica), Arabidopsis thaliana, Chlamydomonas reinhardtii, Medicago truncatula, Trifolium pratense, Populus trichocarpa and Phyllostachys edulis",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "PolyA signal detection",
                    "uri": "http://edamontology.org/operation_0428"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "http://www.bmibig.cn/plantAPAdb/",
    "lastUpdate": "2020-12-05T11:44:50.167662Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://www.bmibig.cn/plantAPAdb"
        }
    ],
    "name": "PlantAPAdb",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1104/PP.19.00943",
            "metadata": {
                "abstract": "© 2020 The authors.Alternative cleavage and polyadenylation (APA) is increasingly recognized as an important regulatory mechanism in eukaryotic gene expression and is dynamically modulated in a developmental, tissue-specific, or environmentally responsive manner. Given the functional importance of APA and the rapid accumulation of APA sites in plants, a comprehensive and easily accessible APA site database is necessary for improved understanding of APA-mediated gene expression regulation. We present a database called PlantAPAdb that catalogs the most comprehensive APA site data derived from sequences from diverse 39 sequencing protocols and biological samples in plants. Currently, PlantAPAdb contains APA sites in six species, Oryza sativa (japonica and indica), Arabidopsis (Arabidopsis thaliana), Medicago truncatula, Trifolium pratense, Phyllostachys edulis, and Chlamydomonas reinhardtii. APA sites in PlantAPAdb are available for bulk download and can be queried in a Google-like manner. PlantAPAdb provides rich information of the whole-genome APA sites, including genomic locations, heterogeneous cleavage sites, expression levels, and sample information. It also provides comprehensive poly(A) signals for APA sites in different genomic regions according to distinct profiles of cis-elements in plants. In addition, PlantAPAdb contains events of 39 untranslated region shortening/lengthening resulting from APA, which helps to understand the mechanisms underlying systematic changes in 39 untranslated region lengths. Additional information about conservation of APA sites in plants is also available, providing insights into the evolutionary polyadenylation configuration across species. As a user-friendly database, PlantAPAdb is a large and extendable resource for elucidating APA mechanisms, APA conservation, and gene expression regulation.",
                "authors": [
                    {
                        "name": "Zhu S."
                    },
                    {
                        "name": "Ye W."
                    },
                    {
                        "name": "Ye L."
                    },
                    {
                        "name": "Fu H."
                    },
                    {
                        "name": "Ye C."
                    },
                    {
                        "name": "Xiao X."
                    },
                    {
                        "name": "Ji Y."
                    },
                    {
                        "name": "Lin W."
                    },
                    {
                        "name": "Ji G."
                    },
                    {
                        "name": "Wu X."
                    }
                ],
                "citationCount": 4,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Plant Physiology",
                "title": "PlantAPAdb: A comprehensive database for alternative polyadenylation sites in plants"
            },
            "pmid": "31767692"
        }
    ],
    "topic": [
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}