{
    "additionDate": "2018-07-03T15:43:40Z",
    "biotoolsCURIE": "biotools:pulse-phage",
    "biotoolsID": "pulse-phage",
    "credit": [
        {
            "email": "s.shave@ed.ac.uk",
            "name": "Steven Shave",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "manfred.auer@ed.ac.uk",
            "name": "Manfred Auer",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Tool to analyse protein sequence coverage of phage display libraries.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/stevenshave/PuLSE/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "homepage": "https://github.com/stevenshave/PuLSE",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "PuLSE",
    "operatingSystem": [
        "Windows",
        "Mac"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0193332",
            "metadata": {
                "abstract": "© 2018 Shave et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited. The design of highly diverse phage display libraries is based on assumption that DNA bases are incorporated at similar rates within the randomized sequence. As library complexity increases and expected copy numbers of unique sequences decrease, the exploration of library space becomes sparser and the presence of truly random sequences becomes critical. We present the program PuLSE (Phage Library Sequence Evaluation) as a tool for assessing randomness and therefore diversity of phage display libraries. PuLSE runs on a collection of sequence reads in the fastq file format and generates tables profiling the library in terms of unique DNA sequence counts and positions, translated peptide sequences, and normalized ‘expected’ occurrences from base to residue codon frequencies. The output allows at-a-glance quantitative quality control of a phage library in terms of sequence coverage both at the DNA base and translated protein residue level, which has been missing from toolsets and literature. The open source program PuLSE is available in two formats, a C++ source code package for compilation and integration into existing bioinformatics pipelines and precompiled binaries for ease of use.",
                "authors": [
                    {
                        "name": "Shave S."
                    },
                    {
                        "name": "Mann S."
                    },
                    {
                        "name": "Koszela J."
                    },
                    {
                        "name": "Kerr A."
                    },
                    {
                        "name": "Auer M."
                    }
                ],
                "date": "2018-02-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "PuLSE: Quality control and quantification of peptide sequences explored by phage display libraries"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Data quality management",
            "uri": "http://edamontology.org/topic_3572"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Virology",
            "uri": "http://edamontology.org/topic_0781"
        }
    ],
    "validated": 1
}