{"credit":[{"name":"CERM","typeEntity":"Institute","typeRoles":["Provider"]},{"name":"BioMedBridges","typeEntity":"Consortium","typeRoles":["Documentor"],"url":"http://www.biomedbridges.eu"},{"email":"rosato@cerm.unifi.it","name":"Antonio Rosato","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://py-enmr.cerm.unifi.it/access/index"}],"function":[{"input":[{"data":{"term":"Structure","uri":"http://edamontology.org/data_0883"},"format":[{"term":"PDB","uri":"http://edamontology.org/format_1476"}]}],"operation":[{"term":"Protein structure assignment","uri":"http://edamontology.org/operation_0320"},{"term":"Molecular dynamics","uri":"http://edamontology.org/operation_2476"}]}],"labels":{"collectionID":["BioMedBridges Tools"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Structural biology","uri":"http://edamontology.org/topic_1317"}]},"publication":[{"abstract":"Motivation: The typical workflow for NMR structure determination involves collecting thousands of conformational restraints, calculating a bundle of 20-40 conformers in agreement with them and refining the energetics of these conformers. The structure calculation step employs simulated annealing based on molecular dynamics (MD) simulations with very simplified force fields. The value of refining the calculated conformers using restrained MD (rMD) simulations with state-of-art force fields is documented. This refinement however presents various subtleties, from the proper formatting of conformational restraints to the definition of suitable protocols. Results: We describe a web interface to set up and run calculations with the AMBER package, which we called AMPS-NMR (AMBERbased Portal Server for NMR structures). The interface allows the refinement of NMR structures through rMD. Some predefined protocols are provided for this purpose, which can be personalized; it is also possible to create an entirely new protocol. AMPS-NMR can handle various restraint types. Standard rMD refinement in explicit water of the structures of three different proteins are shown as examples. AMPS-NMR additionally includes a workspace for the user to store different calculations. As an ancillary service, a web interface to AnteChamber is available, enabling the calculation of force field parameters for organic molecules such as ligands in protein-ligand adducts. © The Author 2011. Published by Oxford University Press. All rights reserved.","authors":["Bertini I.","Case D.A.","Ferella L.","Giachetti A.","Rosato A."],"cit_count":49,"doi":"10.1093/bioinformatics/btr415","journal":"Bioinformatics","title":"A grid-enabled web portal for NMR structure refinement with AMBER","type":"Primary","year":"2011-09-01"}],"summary":{"biotoolsCURIE":"biotools:amps-nmr","biotoolsID":"amps-nmr","description":"NMR protein structure refinement. Amber (acronym to Assisted Model Building with Energy Refinement) is a suite of programs  1N3L that allow users to perform molecular dynamics (MD) simulations on biological systems. This web portal makes available the entire functionality of AMBER, in particular (but not only) using NMR-derived information as restraints for MD.","homepage":"http://py-enmr.cerm.unifi.it/access/index","name":"AMPS-NMR","version":["1"]}}