{
    "accessibility": "Open access",
    "additionDate": "2021-11-28T12:51:12.073552Z",
    "biotoolsCURIE": "biotools:field-rt",
    "biotoolsID": "field-rt",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Concetta Piazzese",
            "orcidid": "https://orcid.org/0000-0002-3605-1809"
        }
    ],
    "description": "Open-source platform for the assessment of target volume delineation in radiation therapy.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "https://github.com/concettapiazzese/FIELDRT-GitHub",
    "language": [
        "MATLAB",
        "Shell"
    ],
    "lastUpdate": "2021-11-28T12:51:12.078106Z",
    "license": "GPL-3.0",
    "name": "FIELD-RT",
    "operatingSystem": [
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1259/BJR.20210356",
            "metadata": {
                "abstract": "© 2021 British Institute of Radiology. All rights reserved.Objectives: Target volume delineation (TVD) has been identified as a weakness in the accuracy of radiotherapy, both within and outside of clinical trials due to the intra/interobserver variations affecting the TVD quality. Sources of variations such as poor compliance or protocol violation may have adverse effect on treatment outcomes. In this paper, we present and describe the FIELDRT software developed for the ARENA project to improve the quality of TVD through qualitative and quantitative feedbacks and individual and personalized summary of trainee\"s performance. Methods: For each site-specific clinical case included in the FIELDRT software, reference volumes, minimum and maximum \"acceptable\" volumes and organ at risk were derived by outlines of consultants and senior trainees. The software components currently developed include: (a) user-friendly importing interface (b) analysis toolbox to compute quantitative and qualitative (c) visualiser and (d) structured report generator for personalised feedback. The FIELDRT software was validated by comparing the performance of 63 trainees and by measuring performance over time. In addition, a trainee evaluation day was held in 2019 to collect feedback on FIELDRT. Results: Results show the trainees' improvement when reoutlining a case after reviewing the feedback generated from the FIELDRT software. Comments and feedback received after evaluation day were positive and confirmed that FIELDRT can be a useful application for training purposes. Conclusion: We presented a new open-source software to support education in TVD and ongoing continuous professional development for clinical oncology trainees and consultants. ARENA in combination with FIELDRT implements site-specific modules with reference target and organs at risk volumes and automatically evaluates individual performance using several quantitative and qualitative feedbacks. Pilot results suggests this software could be used as an education tool to reduce variation in TVD so to guarantee high quality in radiotherapy.",
                "authors": [
                    {
                        "name": "EVANS E."
                    },
                    {
                        "name": "GWYNNE S."
                    },
                    {
                        "name": "PIAZZESE C."
                    },
                    {
                        "name": "SPEZI E."
                    },
                    {
                        "name": "STAFFURTH J."
                    },
                    {
                        "name": "THOMAS B."
                    }
                ],
                "date": "2021-10-01T00:00:00Z",
                "journal": "British Journal of Radiology",
                "title": "Fieldrt: An open-source platform for the assessment of target volume delineation in radiation therapy"
            },
            "pmid": "34289317"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ]
}
