{
    "additionDate": "2020-01-09T17:31:38Z",
    "biotoolsCURIE": "biotools:gutMDisorder",
    "biotoolsID": "gutMDisorder",
    "confidence_flag": "tool",
    "description": "a comprehensive database for dysbiosis of the gut microbiota in disorders and interventions.\n\ngutMDisorder (http: bio-annotation.cn gutMDisorder), a manually curated database, aims at providing a comprehensive resource of dysbiosis of the gut microbiota in disorders and interventions. Alterations in the composition of the gut microbial community play crucial roles in the development of chronic disorders. And the beneficial effects of drugs, foods and other intervention measures on disorders could be microbially mediated. The current version of gutMDisorder documents 2263 curated associations between 579 gut microbes and 123 disorders or 77 intervention measures in Human, and 930 curated associations between 273 gut microbes and 33 disorders or 151 intervention measures in Mouse",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "http://bio-annotation.cn/gutMDisorder",
    "lastUpdate": "2020-12-07T08:44:53.514464Z",
    "name": "gutMDisorder",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/NAR/GKZ843",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press on behalf of Nucleic Acids Research.gutMDisorder (http://bio-annotation.cn/gutMDisorder), a manually curated database, aims at providing a comprehensive resource of dysbiosis of the gut microbiota in disorders and interventions. Alterations in the composition of the gut microbial community play crucial roles in the development of chronic disorders. And the beneficial effects of drugs, foods and other intervention measures on disorders could be microbially mediated. The current version of gutMDisorder documents 2263 curated associations between 579 gut microbes and 123 disorders or 77 intervention measures in Human, and 930 curated associations between 273 gut microbes and 33 disorders or 151 intervention measures in Mouse. Each entry in the gutMDisorder contains detailed information on an association, including an intestinal microbe, a disorder name, intervention measures, experimental technology and platform, characteristic of samples, web sites for downloading the sequencing data, a brief description of the association, a literature reference, and so on. gutMDisorder provides a user-friendly interface to browse, retrieve each entry using gut microbes, disorders, and intervention measures. It also offers pages for downloading all the entries and submitting new experimentally validated associations.",
                "authors": [
                    {
                        "name": "Cheng L."
                    },
                    {
                        "name": "Qi C."
                    },
                    {
                        "name": "Zhuang H."
                    },
                    {
                        "name": "Fu T."
                    },
                    {
                        "name": "Zhang X."
                    }
                ],
                "citationCount": 39,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "GutMDisorder: A comprehensive database for dysbiosis of the gut microbiota in disorders and interventions"
            },
            "pmid": "31584099"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ]
}