{
    "additionDate": "2019-11-14T18:25:52Z",
    "biotoolsCURIE": "biotools:TTAgP",
    "biotoolsID": "TTAgP",
    "confidence_flag": "tool",
    "description": "A computational tool for the specific prediction of tumor T cell antigens | Nowadays, cancer is considered a global pandemic and millions of people die every year because this disease remains a challenge for the world scientific community. Even with the efforts made to combat it, there is a growing need to discover and design new drugs and vaccines. Among these alternatives, antitumor peptides are a promising therapeutic solution to reduce the incidence of deaths caused by cancer. In the present study, we developed TTAgP, an accurate bioinformatic tool that uses the random forest algorithm for antitumor peptide predictions, which are presented in the context of MHC class I. The predictive model of TTAgP was trained and validated based on several features of 922 peptides",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peptide immunogenicity prediction",
                    "uri": "http://edamontology.org/operation_0252"
                },
                {
                    "term": "Peptide identification",
                    "uri": "http://edamontology.org/operation_3631"
                }
            ]
        }
    ],
    "homepage": "https://github.com/reumandc/tsvr",
    "lastUpdate": "2020-12-31T12:08:52Z",
    "name": "TTAgP",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.COMPBIOLCHEM.2019.107103",
            "metadata": {
                "abstract": "© 2019 Elsevier LtdNowadays, cancer is considered a global pandemic and millions of people die every year because this disease remains a challenge for the world scientific community. Even with the efforts made to combat it, there is a growing need to discover and design new drugs and vaccines. Among these alternatives, antitumor peptides are a promising therapeutic solution to reduce the incidence of deaths caused by cancer. In the present study, we developed TTAgP, an accurate bioinformatic tool that uses the random forest algorithm for antitumor peptide predictions, which are presented in the context of MHC class I. The predictive model of TTAgP was trained and validated based on several features of 922 peptides. During the model validation we achieved sensitivity = 0.89, specificity = 0.92, accuracy = 0.90 and the Matthews correlation coefficient = 0.79 performance measures, which are indicative of a robust model. TTAgP is a fast, accurate and intuitive software focused on the prediction of tumor T cell antigens.",
                "authors": [
                    {
                        "name": "Beltran Lissabet J.F."
                    },
                    {
                        "name": "Herrera Belen L."
                    },
                    {
                        "name": "Farias J.G."
                    }
                ],
                "citationCount": 3,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Computational Biology and Chemistry",
                "title": "TTAgP 1.0: A computational tool for the specific prediction of tumor T cell antigens"
            },
            "pmid": "31437642"
        }
    ],
    "topic": [
        {
            "term": "Immunology",
            "uri": "http://edamontology.org/topic_0804"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ],
    "validated": 1
}