{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://kiharalab.org/"}],"documentation":[{"type":"GENERAL","url":"http://kiharalab.org/3d-surfer/tutorial.php"}],"function":[{"operation":[{"term":"Protein sequence analysis","uri":"http://edamontology.org/operation_2479"}]},{"operation":[{"term":"Molecular surface comparison","uri":"http://edamontology.org/operation_3666"}]},{"operation":[{"term":"Molecular surface analysis","uri":"http://edamontology.org/operation_3351"}]}],"labels":{"toolType":["Web application"],"topic":[{"term":"Protein structural motifs and surfaces","uri":"http://edamontology.org/topic_0166"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/3d-surfer-2-0-real-time-search-and-characterization-of-protein-surfaces.html"}],"publication":[{"abstract":"© Springer Science+Business Media New York 2014. The increasing number of uncharacterized protein structures necessitates the development of computational approaches for function annotation using the protein tertiary structures. Protein structure database search is the basis of any structure-based functional elucidation of proteins. 3D-SURFER is a web platform for real-time protein surface comparison of a given protein structure against the entire PDB using 3D Zernike descriptors. It can smoothly navigate the protein structure space in real-time from one query structure to another. A major new feature of Release 2.0 is the ability to compare the protein surface of a single chain, a single domain, or a single complex against databases of protein chains, domains, complexes, or a combination of all three in the latest PDB. Additionally, two types of protein structures can now be compared: all-atom-surface and backbone-atom-surface. The server can also accept a batch job for a large number of database searches. Pockets in protein surfaces can be identified by VisGrid and LIGSITE<sup>csc</sup>.","authors":["Xiong Y.","Esquivel-Rodriguez J.","Sael L.","Kihara D."],"cit_count":3,"journal":"Methods in Molecular Biology","pmid":"24573477","title":"3d-surfer 2.0: Web platform for real-time search and characterization of protein surfaces","year":"2014-01-01"}],"summary":{"biotoolsCURIE":"biotools:3d-surfer","biotoolsID":"3d-surfer","description":"3D-SURFER is a web-based tool for real-time protein surface comparison and analysis. The server integrates a repertoire of methods to assist in high throughput screening and visualization of protein surface comparisons.","homepage":"http://kiharalab.org/3d-surfer/","name":"3D-SURFER"}}