{
    "accessibility": "Open access",
    "additionDate": "2022-06-08T09:34:39.762581Z",
    "biotoolsCURIE": "biotools:aspediafi",
    "biotoolsID": "aspediafi",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Doyeong Yu"
        },
        {
            "name": "Kyubin Lee"
        }
    ],
    "description": "This package provides functionalities for a systematic and integrative analysis of alternative splicing events and their functional interactions.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Alternative splicing prediction",
                    "uri": "http://edamontology.org/operation_0264"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Named-entity and concept recognition",
                    "uri": "http://edamontology.org/operation_3280"
                }
            ]
        }
    ],
    "homepage": "https://bioconductor.org/packages/ASpediaFI",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T20:08:44.794883Z",
    "license": "GPL-3.0",
    "name": "ASpediaFI",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/j.gpb.2021.10.004",
            "metadata": {
                "abstract": "Alternative splicing (AS) regulates biological processes governing phenotypes and diseases. Differential AS (DAS) gene test methods have been developed to investigate important exonic expression from high-throughput datasets. However, the DAS events extracted using statistical tests are insufficient to delineate relevant biological processes. In this study, we developed a novel application, Alternative Splicing Encyclopedia: Functional Interaction (ASpediaFI), to systemically identify DAS events and co-regulated genes and pathways. ASpediaFI establishes a heterogeneous interaction network of genes and their feature nodes (i.e., AS events and pathways) connected by co-expression or pathway gene set knowledge. Next, ASpediaFI explores the interaction network using the random walk with restart algorithm and interrogates the proximity from a query gene set. Finally, ASpediaFI extracts significant AS events, genes, and pathways. To evaluate the performance of our method, we simulated RNA sequencing (RNA-seq) datasets to consider various conditions of sequencing depth and sample size. The performance was compared with that of other methods. Additionally, we analyzed three public datasets of cancer patients or cell lines to evaluate how well ASpediaFI detects biologically relevant candidates. ASpediaFI exhibits strong performance in both simulated and public datasets. Our integrative approach reveals that DAS events that recognize a global co-expression network and relevant pathways determine the functional importance of spliced genes in the subnetwork. ASpediaFI is publicly available at https://bioconductor.org/packages/ASpediaFI.",
                "authors": [
                    {
                        "name": "Cho S.Y."
                    },
                    {
                        "name": "Hyung D."
                    },
                    {
                        "name": "Lee K."
                    },
                    {
                        "name": "Park C."
                    },
                    {
                        "name": "Yu D."
                    }
                ],
                "citationCount": 1,
                "date": "2022-06-01T00:00:00Z",
                "journal": "Genomics, Proteomics and Bioinformatics",
                "title": "ASpediaFI: Functional Interaction Analysis of Alternative Splicing Events"
            },
            "pmcid": "PMC9801047",
            "pmid": "35085775"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
