
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence motif discovery",
                    "uri": "http://edamontology.org/operation_0238"
                },
                {
                    "term": "RNA structure prediction",
                    "uri": "http://edamontology.org/operation_2441"
                },
                {
                    "term": "RNA secondary structure alignment",
                    "uri": "http://edamontology.org/operation_0502"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "topic": [
            {
                "term": "RNA",
                "uri": "http://edamontology.org/topic_0099"
            },
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "Nucleic acid structure analysis",
                "uri": "http://edamontology.org/topic_0097"
            },
            {
                "term": "Sequence sites, features and motifs",
                "uri": "http://edamontology.org/topic_0160"
            },
            {
                "term": "Protein structural motifs and surfaces",
                "uri": "http://edamontology.org/topic_0166"
            }
        ]
    },
    "link": [
        {
            "type": "Repository",
            "url": "https://github.com/moss-lab/ScanFold"
        }
    ],
    "publication": [
        {
            "abstract": "© 2019 Elsevier Inc.Functional RNA structures are prevalent in viral genomes, and have been shown to play roles in almost every aspect of their biology. However, the majority of viral RNA remains structurally uncharacterized. This is likely to remain true as the cost of sequencing decreases much faster than the cost of structural characterizations. Because of this, there is a need for rapid, inexpensive methods to highlight regions of viral RNA which are ideal candidates for structure–function analyses. The ScanFold method was developed as a single sequence alternative to traditional RNA structural motif discovery pipelines, which rely heavily on well curated sequence alignments to identify conserved RNA structures. ScanFold focuses on identifying (based on their more stable than expected folding energies) the most likely functional structures encoded within a single large RNA sequence, while allowing predicted motifs to be tested for evidence of structural conservation later. Decoupling these processes can be a benefit to researchers studying viruses lacking the ideal phylogenetic depth to yield evidence of structural conservation. Here, we demonstrate how the most significant ScanFold predicted structures correspond to higher base pairing probabilities, SHAPE reactivities, and predict known functional structures within the ZIKV and HIV-1 genomes with accuracy. Best practices and examples are also shown to aid users in utilizing ScanFold for their own systems of interest. ScanFold is available as a Webserver (https://mosslabtools.bb.iastate.edu/scanfold) or can be downloaded (https://github.com/moss-lab/ScanFold) and run locally.",
            "authors": [
                "Andrews R.J.",
                "Baber L.",
                "Moss W.N."
            ],
            "cit_count": 0,
            "doi": "10.1016/J.YMETH.2019.11.001",
            "journal": "Methods",
            "pmid": "31711930",
            "title": "Mapping the RNA structural landscape of viral genomes",
            "year": "2019-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:ScanFold",
        "biotoolsID": "ScanFold",
        "description": "Mapping the RNA structural landscape of viral genomes.\n\nScanFold is an RNA sequence scanning pipeline which attempts to identify potentially functional RNA secondary structures. This is done by first scanning a single input sequence to identify regions which generate negative thermodynamic z-scores (a hallmark of functional RNA sequences), and subsequently identifying the specific base pairs which we….\n\nWelcome to the ScanFold web server.\n\nUsing the ScanFold web server you can identify regions of an RNA sequence which generate unusually stable secondary structures (one of the hallmarks of a functional RNA)",
        "homepage": "https://mosslabtools.bb.iastate.edu/scanfold",
        "name": "ScanFold"
    }
}