{
    "additionDate": "2017-05-01T17:08:46Z",
    "biotoolsCURIE": "biotools:cogs",
    "biotoolsID": "cogs",
    "credit": [
        {
            "email": "cogs@ncbi.nlm.nih.gov",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.ncbi.nlm.nih.gov/"
        }
    ],
    "description": "Collections of Clusters of Orthologous Genes provide indispensable tools for comparative genomic analysis, evolutionary reconstruction and functional annotation of new genomes.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://www.ncbi.nlm.nih.gov/COG/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                },
                {
                    "term": "Annotation",
                    "uri": "http://edamontology.org/operation_0226"
                }
            ]
        }
    ],
    "homepage": "http://www.ncbi.nlm.nih.gov/COG/",
    "lastUpdate": "2018-12-10T12:58:44Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/cogs-201204-phylogenetic-classification-proteins-encoded-complete-genomes.html"
        }
    ],
    "name": "COGs",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "In order to extract the maximum amount of information from the rapidly accumulating genome sequences, all conserved genes need to be classified according to their homologous relationships. Comparison of proteins encoded in seven complete genomes from five major phylogenetic lineages and elucidation of consistent patterns of sequence similarities allowed the delineation of 720 clusters of orthologous groups (COGs). Each COG consists of individual orthologous proteins or orthologous sets of paralogs from at least three lineages. Orthologs typically have the same function, allowing transfer of functional information from one member to an entire COG. This relation automatically yields a number of functional predictions for poorly characterized genomes. The COGs comprise a framework for functional and evolutionary genome analysis.",
                "authors": [
                    {
                        "name": "Tatusov R.L."
                    },
                    {
                        "name": "Koonin E.V."
                    },
                    {
                        "name": "Lipman D.J."
                    }
                ],
                "citationCount": 2632,
                "date": "1997-10-24T00:00:00Z",
                "journal": "Science",
                "title": "A genomic perspective on protein families"
            },
            "pmid": "9381173"
        },
        {
            "metadata": {
                "abstract": "The database of Clusters of Orthologous Groups of proteins (COGs), which represents an attempt on a phylogenetic classification of the proteins encoded in complete genomes, currently consists of 2791 COGs including 45 350 proteins from 30 genomes of bacteria, archaea and the yeast Saccharomyces cerevisiae (http://www.ncbi.nlm.nih.gov/COG). In addition, a supplement to the COGs is available, in which proteins encoded in the genomes of two multicellular eukaryotes, the nematode Caenorhabditis elegans and the fruit fly Drosophila melanogaster, and shared with bacteria and/or archaea were included. The new features added to the COG database include information pages with structural and functional details on each COG and literature references, improvements of the COGNITOR program that is used to fit new proteins into the COGs, and classification of genomes and COGs constructed by using principal component analysis.",
                "authors": [
                    {
                        "name": "Tatusov R.L."
                    },
                    {
                        "name": "Natale D.A."
                    },
                    {
                        "name": "Garkavtsev I.V."
                    },
                    {
                        "name": "Tatusova T.A."
                    },
                    {
                        "name": "Shankavaram U.T."
                    },
                    {
                        "name": "Rao B.S."
                    },
                    {
                        "name": "Kiryutin B."
                    },
                    {
                        "name": "Galperin M.Y."
                    },
                    {
                        "name": "Fedorova N.D."
                    },
                    {
                        "name": "Koonin E.V."
                    }
                ],
                "citationCount": 1456,
                "date": "2001-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "The COG database: New developments in phylogenetic classification of proteins from complete genomes"
            },
            "pmid": "11125040"
        },
        {
            "metadata": {
                "abstract": "Background: Collections of Clusters of Orthologous Genes (COGs) provide indispensable tools for comparative genomic analysis, evolutionary reconstruction and functional annotation of new genomes. Initially, COGs were made for all complete genomes of cellular life forms that were available at the time. However, with the accumulation of thousands of complete genomes, construction of a comprehensive COG set has become extremely computationally demanding and prone to error propagation, necessitating the switch to taxon-specific COG collections. Previously, we reported the collection of COGs for 41 genomes of Archaea (arCOGs). Here we present a major update of the arCOGs and describe evolutionary reconstructions to reveal general trends in the evolution of Archaea.Results: The updated version of the arCOG database incorporates 91% of the pangenome of 120 archaea (251,032 protein-coding genes altogether) into 10,335 arCOGs. Using this new set of arCOGs, we performed maximum likelihood reconstruction of the genome content of archaeal ancestral forms and gene gain and loss events in archaeal evolution. This reconstruction shows that the last Common Ancestor of the extant Archaea was an organism of greater complexity than most of the extant archaea, probably with over 2,500 protein-coding genes. The subsequent evolution of almost all archaeal lineages was apparently dominated by gene loss resulting in genome streamlining. Overall, in the evolution of Archaea as well as a representative set of bacteria that was similarly analyzed for comparison, gene losses are estimated to outnumber gene gains at least 4 to 1. Analysis of specific patterns of gene gain in Archaea shows that, although some groups, in particular Halobacteria, acquire substantially more genes than others, on the whole, gene exchange between major groups of Archaea appears to be largely random, with no major 'highways' of horizontal gene transfer.Conclusions: The updated collection of arCOGs is expected to become a key resource for comparative genomics, evolutionary reconstruction and functional annotation of new archaeal genomes. Given that, in spite of the major increase in the number of genomes, the conserved core of archaeal genes appears to be stabilizing, the major evolutionary trends revealed here have a chance to stand the test of time.Reviewers: This article was reviewed by (for complete reviews see the Reviewers' Reports section): Dr. PLG, Prof. PF, Dr. PL (nominated by Prof. JPG). © 2012 Wolf et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Wolf Y.I."
                    },
                    {
                        "name": "Makarova K.S."
                    },
                    {
                        "name": "Yutin N."
                    },
                    {
                        "name": "Koonin E.V."
                    }
                ],
                "citationCount": 114,
                "date": "2012-12-14T00:00:00Z",
                "journal": "Biology Direct",
                "title": "Updated clusters of orthologous genes for Archaea: A complex ancestor of the Archaea and the byways of horizontal gene transfer"
            },
            "pmid": "23241446"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Data submission, annotation and curation",
            "uri": "http://edamontology.org/topic_0219"
        }
    ],
    "validated": 1
}