{
    "additionDate": "2021-01-18T10:06:02Z",
    "biotoolsCURIE": "biotools:saw",
    "biotoolsID": "saw",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "chao.huang@northwestern.edu",
            "name": "Chao Huang",
            "orcidid": "https://orcid.org/0000-0002-9300-1787",
            "typeEntity": "Person"
        }
    ],
    "description": "A Tool for Safety Analysis of Weakly-Hard Systems.\n\nThe virtual machine where the tool is ready to run can be found at https://www.csie.ntu.edu.tw/~r08922054/SAW.ova. To reproduce the results of all the examples in the paper, please follow the instruction in ./artifact_evaluation_readme.txt.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/551100kk/SAW",
    "language": [
        "C++"
    ],
    "lastUpdate": "2021-02-11T16:33:01Z",
    "name": "SAW",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1007/978-3-030-53288-8_26",
            "metadata": {
                "abstract": "© 2020, The Author(s).We introduce SAW, a tool for safety analysis of weakly-hard systems, in which traditional hard timing constraints are relaxed to allow bounded deadline misses for improving design flexibility and runtime resiliency. Safety verification is a key issue for weakly-hard systems, as it ensures system safety under allowed deadline misses. Previous works are either for linear systems only, or limited to a certain type of nonlinear systems (e.g., systems that satisfy exponential stability and Lipschitz continuity of the system dynamics). In this work, we propose a new technique for infinite-time safety verification of general nonlinear weakly-hard systems. Our approach first discretizes the safe state set into grids and constructs a directed graph, where nodes represent the grids and edges represent the reachability relation. Based on graph theory and dynamic programming, our approach can effectively find the safe initial set (consisting of a set of grids), from which the system can be proven safe under given weakly-hard constraints. Experimental results demonstrate the effectiveness of our approach, when compared with the state-of-the-art. An open source implementation of our tool is available at https://github.com/551100kk/SAW. The virtual machine where the tool is ready to run can be found at https://www.csie.ntu.edu.tw/~r08922054/SAW.ova.",
                "authors": [
                    {
                        "name": "Huang C."
                    },
                    {
                        "name": "Chang K.-C."
                    },
                    {
                        "name": "Lin C.-W."
                    },
                    {
                        "name": "Zhu Q."
                    }
                ],
                "citationCount": 4,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics)",
                "title": "SAW: A Tool for Safety Analysis of Weakly-Hard Systems"
            },
            "pmcid": "PMC7363216"
        }
    ],
    "topic": [
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        }
    ]
}