{
    "additionDate": "2021-01-18T10:11:01Z",
    "biotoolsCURIE": "biotools:identiflow",
    "biotoolsID": "identiflow",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "nils.bluethgen@charite.de",
            "name": "Nils Blüthgen",
            "typeEntity": "Person"
        }
    ],
    "description": "Identifiability and experimental design in perturbation studies.\n\nInteraction strengths between nodes in directed networks can be quantified from observations of the network's response to perturbations. This package reveals the identifiability of the inferred network parameters and optimizes experimental design for network perturbation studies. See our publication for details.\n\nYou can install the IdentiFlow package with pip:.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://github.com/GrossTor/IdentiFlow",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-30T10:32:09Z",
    "license": "MIT",
    "name": "IdentiFlow",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA404",
            "metadata": {
                "abstract": "© 2020 Oxford University Press. All rights reserved.Motivation: A common strategy to infer and quantify interactions between components of a biological system is to deduce them from the network's response to targeted perturbations. Such perturbation experiments are often challenging and costly. Therefore, optimizing the experimental design is essential to achieve a meaningful characterization of biological networks. However, it remains difficult to predict which combination of perturbations allows to infer specific interaction strengths in a given network topology. Yet, such a description of identifiability is necessary to select perturbations that maximize the number of inferable parameters. Results: We show analytically that the identifiability of network parameters can be determined by an intuitive maximum-flow problem. Furthermore, we used the theory of matroids to describe identifiability relationships between sets of parameters in order to build identifiable effective network models. Collectively, these results allowed to device strategies for an optimal design of the perturbation experiments. We benchmarked these strategies on a database of human pathways. Remarkably, full network identifiability was achieved, on average, with less than a third of the perturbations that are needed in a random experimental design. Moreover, we determined perturbation combinations that additionally decreased experimental effort compared to single-target perturbations. In summary, we provide a framework that allows to infer a maximal number of interaction strengths with a minimal number of perturbation experiments.",
                "authors": [
                    {
                        "name": "Gross T."
                    },
                    {
                        "name": "Bluthgen N."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Identifiability and experimental design in perturbation studies"
            },
            "pmcid": "PMC7355299",
            "pmid": "32657359"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Experimental design and studies",
            "uri": "http://edamontology.org/topic_3678"
        },
        {
            "term": "Laboratory techniques",
            "uri": "http://edamontology.org/topic_3361"
        }
    ]
}