{
    "additionDate": "2021-01-18T06:59:13Z",
    "biotoolsCURIE": "biotools:varifast",
    "biotoolsID": "varifast",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "shiyongyong@gmail.com",
            "name": "Yongyong Shi",
            "typeEntity": "Person"
        },
        {
            "email": "zhuowang@sjtu.edu.cn",
            "name": "Zhuo Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "a variant filter by automated scoring based on tagged-signatures.\n\nA tool for variant filtering.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Variant filtering",
                    "uri": "http://edamontology.org/operation_3675"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bioxsjtu/VariFAST",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-11T09:30:42Z",
    "name": "VariFAST",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3226-2",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Variant calling and refinement from whole genome/exome sequencing data is a fundamental task for genomics studies. Due to the limited accuracy of NGS sequencing and variant callers, IGV-based manual review is required for further false positive variant filtering, which costs massive labor and time, and results in high inter- and intra-lab variability. Results: To overcome the limitation of manual review, we developed a novel approach for Variant Filter by Automated Scoring based on Tagged-signature (VariFAST), and also provided a pipeline integrating GATK Best Practices with VariFAST, which can be easily used for high quality variants detection from raw data. Using the bam and vcf files, VariFAST calculates a v-score by sum of weighted metrics causing false positive variations, and marks tags in the manner of keeping high consistency with manual review, for each variant. We validated the performance of VariFAST for germline variant filtering using the benchmark sequencing data from GIAB, and also for somatic variant filtering using sequencing data of both malignant carcinoma and benign adenomas as well. VariFAST also includes a predictive model trained by XGBOOST algorithm for germline variants refinement, which reveals better MCC and AUC than the state-of-the-art VQSR, especially outcompete in INDEL variant filtering. Conclusion: VariFAST can assist researchers efficiently and conveniently to filter the false positive variants, including both germline and somatic ones, in NGS data analysis. The VariFAST source code and the pipeline integrating with GATK Best Practices are available at https://github.com/bioxsjtu/VariFAST.",
                "authors": [
                    {
                        "name": "Chen J."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Shi Y."
                    },
                    {
                        "name": "Sun R."
                    },
                    {
                        "name": "Wang D."
                    },
                    {
                        "name": "Wang K."
                    },
                    {
                        "name": "Wang Z."
                    },
                    {
                        "name": "Xu Y."
                    },
                    {
                        "name": "Zhang H."
                    },
                    {
                        "name": "Zhang M."
                    },
                    {
                        "name": "Zhou J."
                    }
                ],
                "date": "2019-12-30T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "VariFAST: A variant filter by automated scoring based on tagged-signatures"
            },
            "pmcid": "PMC6936113",
            "pmid": "31888441"
        }
    ],
    "topic": [
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ]
}
