
{
    "credit": [
        {
            "email": "edge.comments@gmail.com",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "https://ccb.jhu.edu/software/EDGE-pro/MANUAL"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                }
            ]
        }
    ],
    "labels": {
        "accessibility": [
            "Open access"
        ],
        "collectionID": [
            "Animal and Crop Genomics"
        ],
        "language": [
            "C++"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "RNA-seq",
                "uri": "http://edamontology.org/topic_3170"
            },
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Background: The expression levels of bacterial genes can be measured directly using next-generation sequencing (NGS) methods, offering much greater sensitivity and accuracy than earlier, microarray-based methods. Most bioinformatics software for estimating levels of gene expression from NGS data has been designed for eukaryotic genomes, with algorithms focusing particularly on detection of splicing patterns. These methods do not perform well on bacterial genomes. Results: Here we describe the first software system designed explicitly for quantifying the degree of gene expression in bacteria and other prokaryotes. EDGE-pro (Estimated Degree of Gene Expression in PROkaryotes) processes the raw data from an RNA-seq experiment on a bacterial or archaeal species and produces estimates of the expression levels for each gene in these gene-dense genomes. Software: The EDGE-pro tool is implemented as a pipeline of C++ and Perl programs and is freely available as open-source code at http://www.genomics.jhu.edu/software/EDGE/index.shtml. © the author(s), publisher and licensee Libertas Academica Ltd.",
            "authors": [
                "Magoc T.",
                "Wood D.",
                "Salzberg S.L."
            ],
            "cit_count": 37,
            "doi": "10.4137/EBO.S11250",
            "journal": "Evolutionary Bioinformatics",
            "title": "EDGE-pro: Eestimated Degree of Gene Expression in prokaryotic genomes",
            "type": "Primary",
            "year": "2013-03-10"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:edge-pro",
        "biotoolsID": "edge-pro",
        "description": "Estimate gene expression from prokaryotic RNA-seq.It uses Bowtie2 for alignment but, unlike TopHat and Cufflinks, does not allow spliced alignments. It also handles overlapping genes, a common phenomenon in bacteria that is largely absent in eukaryotes.",
        "homepage": "https://ccb.jhu.edu/software/EDGE-pro/index.shtml",
        "name": "EDGE-pro"
    }
}