
{
    "credit": [
        {
            "email": "d.curtis@ucl.ac.uk",
            "name": "David Curtis",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.davecurtis.net/dcurtis.html"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://www.davecurtis.net/dcurtis/software.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Linkage analysis",
                    "uri": "http://edamontology.org/operation_0283"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++",
            "C"
        ],
        "operatingSystem": [
            "Windows"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Statistics and probability",
                "uri": "http://edamontology.org/topic_2269"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/mflink-3-4-model-free-linkage-analysis.html"
        }
    ],
    "publication": [
        {
            "abstract": "Misspecification of transmission model parameters can produce artifactually negative lod scores at small recombination fractions and in multipoint analysis. To avoid this problem, we have tried to devise a test that aims to detect a genetic effect at a particular locus, rather than attempting to estimate the map position of a locus with specified effect. Maximizing likelihoods over transmission model parameters, as well as linkage parameters, can produce seriously biased parameter estimates and so yield tests that lack power for the detection of linkage. However, constraining the transmission model parameters to produce the correct population prevalence largely avoids this problem. For computational convenience, we recommend that the likelihoods under linkage and nonlinkage are independently maximized over a limited set of transmission models, ranging from Mendelian dominant to null effect and from null effect to Mendelian recessive. In order to test for a genetic effect at a given map position, the likelihood under linkage is maximized over admixture, the proportion of families linked. Application to simulated data for a wide range of transmission models in both affected sib pairs and pedigrees demonstrates that the new method is well behaved under the null hypothesis and provides a powerful test for linkage when it is present. This test requires no specification of transmission model parameters, apart from an approximate estimate of the population prevalence. It can be applied equally to sib pairs and pedigrees, and, since it does not diminish the lod score at test positions very close to a marker, it is suitable for application to multipoint data.",
            "authors": [
                "Curtis D.",
                "Sham P.C."
            ],
            "cit_count": 93,
            "journal": "American Journal of Human Genetics",
            "pmid": "7668300",
            "title": "Model-free linkage analysis using likelihoods",
            "year": "1995-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:mflink",
        "biotoolsID": "mflink",
        "description": "Simple program which automates setting up likelihood calculations for linkage analysis using a variety of different transmission models, and then collating the results in order to produce a (nearly) model free lod score.",
        "homepage": "http://www.davecurtis.net/dcurtis/software.html",
        "name": "MFLINK"
    }
}