{
    "accessibility": "Open access",
    "additionDate": "2019-11-14T20:02:45Z",
    "biotoolsCURIE": "biotools:MTiOpenScreen",
    "biotoolsID": "MTiOpenScreen",
    "collectionID": [
        "MTiOpenScreen"
    ],
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "maria.mitev@inserm.fr",
            "name": "Maria A. Miteva",
            "typeEntity": "Person"
        }
    ],
    "description": "Automated virtual screening with AutoDock Vina.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://bioserv.rpbs.univ-paris-diderot.fr/services/MTiOpenScreen/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein structure",
                        "uri": "http://edamontology.org/data_1460"
                    },
                    "format": [
                        {
                            "term": "Mol2",
                            "uri": "http://edamontology.org/format_3816"
                        },
                        {
                            "term": "PDB",
                            "uri": "http://edamontology.org/format_1476"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Small molecule structure",
                        "uri": "http://edamontology.org/data_1463"
                    },
                    "format": [
                        {
                            "term": "Mol2",
                            "uri": "http://edamontology.org/format_3816"
                        },
                        {
                            "term": "SDF",
                            "uri": "http://edamontology.org/format_3814"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Protein-ligand complex",
                        "uri": "http://edamontology.org/data_1461"
                    },
                    "format": [
                        {
                            "term": "PDB",
                            "uri": "http://edamontology.org/format_1476"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "https://mobyle.rpbs.univ-paris-diderot.fr/cgi-bin/portal.py#forms::MTiOpenScreen",
    "lastUpdate": "2020-06-16T10:55:27Z",
    "license": "Freeware",
    "maturity": "Mature",
    "name": "MTiOpenScreen",
    "owner": "reyjul",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2015 The Author(s).Open screening endeavors play and will play a key role to facilitate the identification of new bioactive compounds in order to foster innovation and to improve the effectiveness of chemical biology and drug discovery processes. In this line, we developed the new web server MTiOpenScreen dedicated to small molecule docking and virtual screening. It includes two services, MTiAutoDock and MTiOpenScreen, allowing performing docking into a user-defined binding site or blind docking using AutoDock 4.2 and automated virtual screening with AutoDock Vina. MTiOpenScreen provides valuable starting collections for screening, two in-house prepared drug-like chemical libraries containing 150 000 PubChem compounds: the Diverse-lib containing diverse molecules and the iPPI-lib enriched in molecules likely to inhibit protein-protein interactions. In addition, MTiOpenScreen offers users the possibility to screen up to 5000 small molecules selected outside our two libraries. The predicted binding poses and energies of up to 1000 top ranked ligands can be downloaded. In this way, MTiOpen-Screen enables researchers to apply virtual screening using different chemical libraries on traditional or more challenging protein targets such as protein- protein interactions. The MTiOpenScreen web server is free and open to all users at http://bioserv.rpbs. univ-Paris-diderot.fr/services/MTiOpenScreen/.",
                "authors": [
                    {
                        "name": "Labbe C.M."
                    },
                    {
                        "name": "Rey J."
                    },
                    {
                        "name": "Lagorce D."
                    },
                    {
                        "name": "Vavrusa M."
                    },
                    {
                        "name": "Becot J."
                    },
                    {
                        "name": "Sperandio O."
                    },
                    {
                        "name": "Villoutreix B.O."
                    },
                    {
                        "name": "Tuffery P."
                    },
                    {
                        "name": "Miteva M.A."
                    }
                ],
                "citationCount": 60,
                "date": "2015-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "MTiOpenScreen: A web server for structure-based virtual screening"
            },
            "pmid": "25855812",
            "type": [
                "Primary"
            ]
        },
        {
            "metadata": {
                "abstract": "© 2019 by the authors. Licensee MDPI, Basel, Switzerland.Chemical biology and drug discovery are complex and costly processes. In silico screening approaches play a key role in the identification and optimization of original bioactive molecules and increase the performance of modern chemical biology and drug discovery endeavors. Here, we describe a free web-based protocol dedicated to small-molecule virtual screening that includes three major steps: ADME-Tox filtering (via the web service FAF-Drugs4), docking-based virtual screening (via the web service MTiOpenScreen), and molecular mechanics optimization (via the web service AMMOS2 [Automatic Molecular Mechanics Optimization for in silico Screening]). The online tools FAF-Drugs4, MTiOpenScreen, and AMMOS2 are implemented in the freely accessible RPBS (Ressource Parisienne en Bioinformatique Structurale) platform. The proposed protocol allows users to screen thousands of small molecules and to download the top 1500 docked molecules that can be further processed online. Users can then decide to purchase a small list of compounds for in vitro validation. To demonstrate the potential of this online-based protocol, we performed virtual screening experiments of 4574 approved drugs against three cancer targets. The results were analyzed in the light of published drugs that have already been repositioned on these targets. We show that our protocol is able to identify active drugs within the top-ranked compounds. The web-based protocol is user-friendly and can successfully guide the identification of new promising molecules for chemical biology and drug discovery purposes.",
                "authors": [
                    {
                        "name": "Lagarde N."
                    },
                    {
                        "name": "Goldwaser E."
                    },
                    {
                        "name": "Pencheva T."
                    },
                    {
                        "name": "Jereva D."
                    },
                    {
                        "name": "Pajeva I."
                    },
                    {
                        "name": "Rey J."
                    },
                    {
                        "name": "Tuffery P."
                    },
                    {
                        "name": "Villoutreix B.O."
                    },
                    {
                        "name": "Miteva M.A."
                    }
                ],
                "citationCount": 6,
                "date": "2019-09-02T00:00:00Z",
                "journal": "International Journal of Molecular Sciences",
                "title": "A free web-based protocol to assist structure-based virtual screening experiments"
            },
            "pmid": "31546814",
            "type": [
                "Usage"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Compound libraries and screening",
            "uri": "http://edamontology.org/topic_3343"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}