{
    "additionDate": "2020-01-14T19:35:47Z",
    "biotoolsCURIE": "biotools:MPF-BML",
    "biotoolsID": "MPF-BML",
    "confidence_flag": "tool",
    "description": "A standalone GUI-based package for maximum entropy model inference.\n\nMinimum Probability Flow-Boltzmann Machine Learning (MPF-BML) standalone GUI-based application for the inference of maximum entropy distribution parameters.\n\nMPF-BML: A standalone GUI-based cross-platform package for maximum entropy model inference.\n\nMPF-BML-GUI is a standalone cross-platform package which features an easy-to-use GUI. The package only requires the input data (protein sequence data or data of multiple configura-tions of a complex system with large number of variables) and returns the maximum entropy model parameters inferred using the MPF-BML method",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/ahmedaq/MPF-BML-GUI",
    "lastUpdate": "2020-12-29T10:19:46Z",
    "license": "MIT",
    "name": "MPF-BML",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ925",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press.Summary: Learning underlying correlation patterns in data is a central problem across scientific fields. Maximum entropy models present an important class of statistical approaches for addressing this problem. However, accurately and efficiently inferring model parameters are a major challenge, particularly for modern high-dimensional applications such as in biology, for which the number of parameters is enormous. Previously, we developed a statistical method, minimum probability flow-Boltzmann Machine Learning (MPF-BML), for performing fast and accurate inference of maximum entropy model parameters, which was applied to genetic sequence data to estimate the fitness landscape for the surface proteins of human immunodeficiency virus and hepatitis C virus. To facilitate seamless use of MPF-BML and encourage more widespread application to data in diverse fields, we present a standalone cross-platform package of MPF-BML which features an easy-to-use graphical user interface. The package only requires the input data (protein sequence data or data of multiple configurations of a complex system with large number of variables) and returns the maximum entropy model parameters.",
                "authors": [
                    {
                        "name": "Barton J.P."
                    },
                    {
                        "name": "Louie R.H.Y."
                    },
                    {
                        "name": "McKay M.R."
                    },
                    {
                        "name": "Quadeer A.A."
                    }
                ],
                "date": "2020-04-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "MPF-BML: A standalone GUI-based package for maximum entropy model inference"
            },
            "pmid": "31851308"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
