{
    "additionDate": "2021-01-18T09:56:19Z",
    "biotoolsCURIE": "biotools:aemda",
    "biotoolsID": "aemda",
    "confidence_flag": "tool",
    "description": "Implementation of AEMDA for inferring potential disease-miRNA associations.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                }
            ]
        }
    ],
    "homepage": "https://github.com/CunmeiJi/AEMDA",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-21T14:43:48Z",
    "name": "AEMDA",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA670",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.MOTIVATION: MicroRNAs (miRNAs) are a class of non-coding RNAs that play critical roles in various biological processes. Many studies have shown that miRNAs are closely related to the occurrence, development and diagnosis of human diseases. Traditional biological experiments are costly and time consuming. As a result, effective computational models have become increasingly popular for predicting associations between miRNAs and diseases, which could effectively boost human disease diagnosis and prevention. RESULTS: We propose a novel computational framework, called AEMDA, to identify associations between miRNAs and diseases. AEMDA applies a learning-based method to extract dense and high-dimensional representations of diseases and miRNAs from integrated disease semantic similarity, miRNA functional similarity and heterogeneous related interaction data. In addition, AEMDA adopts a deep autoencoder that does not need negative samples to retrieve the underlying associations between miRNAs and diseases. Furthermore, the reconstruction error is used as a measurement to predict disease-associated miRNAs. Our experimental results indicate that AEMDA can effectively predict disease-related miRNAs and outperforms state-of-the-art methods. AVAILABILITY AND IMPLEMENTATION: The source code and data are available at https://github.com/CunmeiJi/AEMDA. SUPPLEMENTARY INFORMATION: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Ji C."
                    },
                    {
                        "name": "Gao Z."
                    },
                    {
                        "name": "Ma X."
                    },
                    {
                        "name": "Wu Q."
                    },
                    {
                        "name": "Ni J."
                    },
                    {
                        "name": "Zheng C."
                    }
                ],
                "citationCount": 1,
                "date": "2021-04-09T00:00:00Z",
                "journal": "Bioinformatics (Oxford, England)",
                "title": "AEMDA: inferring miRNA-disease associations based on deep autoencoder"
            },
            "pmid": "32726399"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}