{
    "additionDate": "2019-11-14T19:54:16Z",
    "biotoolsCURIE": "biotools:PaWFE",
    "biotoolsID": "PaWFE",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "manfredo.atzori@hevs.ch",
            "name": "Manfredo Atzori",
            "typeEntity": "Person"
        }
    ],
    "description": "Fast Signal Feature Extraction Using Parallel Time Windows | Motivation: Hand amputations can dramatically affect the quality of life of a person. Researchers are developing surface electromyography and machine learning solutions to control dexterous and robotic prosthetic hands, however long computational times can slow down this process. Objective: This paper aims at creating a fast signal feature extraction algorithm that can extract widely used features and allow researchers to easily add new ones. Methods: PaWFE (Parallel Window Feature Extractor) extracts the signal features from several time windows in parallel. The MATLAB code is publicly available and supports several time domain and frequency features",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://ninapro.hevs.ch/node/229",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2020-12-01T10:58:06Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/manfrat/PaWFE---Parallel-Window-Feature-Extraction"
        }
    ],
    "name": "PaWFE",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FNBOT.2019.00074",
            "metadata": {
                "abstract": "© 2019 Frontiers Media S.A.. All rights reserved.Motivation: Hand amputations can dramatically affect the quality of life of a person. Researchers are developing surface electromyography and machine learning solutions to control dexterous and robotic prosthetic hands, however long computational times can slow down this process. Objective: This paper aims at creating a fast signal feature extraction algorithm that can extract widely used features and allow researchers to easily add new ones. Methods: PaWFE (Parallel Window Feature Extractor) extracts the signal features from several time windows in parallel. The MATLAB code is publicly available and supports several time domain and frequency features. The code was tested and benchmarked using 1,2,4,8,16,32, and 48 threads on a server with four Xeon E7-4820 and 128 GB RAM using the first 5 datasets of the Ninapro database, that are recorded with different acquisition setups. Results: The parallel time window analysis approach allows to reduce the computational time up to 20 times when using 32 cores, showing a very good scalability. Signal features can be extracted in few seconds from an entire data acquisition and in 100ms from a single time window, easily reducing of up to over 15 times the feature extraction procedure in comparison to traditional approaches. The code allows users to easily add new signal feature extraction scripts, that can be added to the code and on the Ninapro website upon request. Significance: The code allows researchers in machine learning and biosignals data analysis to easily and quickly test modern machine learning approaches on big datasets and it can be used as a resource for real time data analysis too.",
                "authors": [
                    {
                        "name": "Atzori M."
                    },
                    {
                        "name": "Henning M."
                    }
                ],
                "citationCount": 6,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Frontiers in Neurorobotics",
                "title": "Pawfe: Fast signal feature extraction using parallel time windows"
            },
            "pmcid": "PMC6746931",
            "pmid": "31551749"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        }
    ],
    "validated": 1
}