{
    "additionDate": "2019-11-14T19:47:11Z",
    "biotoolsCURIE": "biotools:TCSM",
    "biotoolsID": "TCSM",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mdml@cs.umd.edu",
            "name": "Mark D M Leiserson",
            "orcidid": "https://orcid.org/0000-0002-1034-4363",
            "typeEntity": "Person"
        }
    ],
    "description": "> CORRECT NAME OF TOOL COULD ALSO BE 'IMPLEMENTATION:TCSM' | Modeling clinical and molecular covariates of mutational process activity in cancer | Tumor Covariate Signature Model (TCSM) | This repository contains the code for reproducing the results on real data from the paper Modeling Clinical and Molecular Covariates of Mutational Process Activity in Cancer, which implements the Tumor Covariate Signature Model (TCSM)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence motif recognition",
                    "uri": "http://edamontology.org/operation_0239"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                }
            ]
        }
    ],
    "homepage": "https://github.com/lrgr/tcsm",
    "language": [
        "R",
        "Python"
    ],
    "lastUpdate": "2020-12-27T14:59:31Z",
    "license": "MIT",
    "name": "TCSM",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ340",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press.Motivation: Somatic mutations result from processes related to DNA replication or environmental/ lifestyle exposures. Knowing the activity of mutational processes in a tumor can inform personalized therapies, early detection, and understanding of tumorigenesis. Computational methods have revealed 30 validated signatures of mutational processes active in human cancers, where each signature is a pattern of single base substitutions. However, half of these signatures have no known etiology, and some similar signatures have distinct etiologies, making patterns of mutation signature activity hard to interpret. Existing mutation signature detection methods do not consider tumor-level clinical/demographic (e.g. smoking history) or molecular features (e.g. inactivations to DNA damage repair genes). Results: To begin to address these challenges, we present the Tumor Covariate Signature Model (TCSM), the first method to directly model the effect of observed tumor-level covariates on mutation signatures. To this end, our model uses methods from Bayesian topic modeling to change the prior distribution on signature exposure conditioned on a tumor's observed covariates. We also introduce methods for imputing covariates in held-out data and for evaluating the statistical significance of signature-covariate associations. On simulated and real data, we find that TCSM outperforms both non-negative matrix factorization and topic modeling-based approaches, particularly in recovering the ground truth exposure to similar signatures. We then use TCSM to discover five mutation signatures in breast cancer and predict homologous recombination repair deficiency in heldout tumors. We also discover four signatures in a combined melanoma and lung cancer cohort' using cancer type as a covariate and provide statistical evidence to support earlier claims that three lung cancers from The Cancer Genome Atlas are misdiagnosed metastatic melanomas.",
                "authors": [
                    {
                        "name": "Robinson W."
                    },
                    {
                        "name": "Sharan R."
                    },
                    {
                        "name": "Leiserson M.D.M."
                    }
                ],
                "citationCount": 1,
                "date": "2019-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Modeling clinical and molecular covariates of mutational process activity in cancer"
            },
            "pmcid": "PMC6612886",
            "pmid": "31510643"
        }
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ],
    "validated": 1
}