{
    "additionDate": "2019-11-14T20:00:17Z",
    "biotoolsCURIE": "biotools:RametrixTM",
    "biotoolsID": "RametrixTM",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "senger@vt.edu",
            "name": "Ryan S. Senger",
            "orcidid": "https://orcid.org/0000-0002-2450-6693",
            "typeEntity": "Person"
        }
    ],
    "description": "Spectral characteristics of urine specimens from healthy human volunteers analyzed using Raman chemometric urinalysis (Rametrix) | Raman chemometric urinalysis (Rametrix™) was used to analyze 235 urine specimens from healthy individuals. The purpose of this study was to establish the \"range of normal\" for Raman spectra of urine specimens from healthy individuals. Ultimately, spectra falling outside of this range will be correlated with kidney and urinary tract disease. Rametrix™ analysis includes direct comparisons of Raman spectra but also principal component analysis (PCA), discriminant analysis of principal components (DAPC) models, multivariate statistics, and it is available through GitHub as the Rametrix™ LITE Toolbox for MATLAB®. Results showed consistently overlapping Raman spectra of urine specimens with significantly larger variances in Raman shifts, found by PCA, corresponding to urea, creatinine, and glucose concentrations",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                }
            ]
        }
    ],
    "homepage": "https://github.com/SengerLab/RametrixLITEToolbox",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2020-12-11T15:25:52Z",
    "name": "RametrixTM",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0222115",
            "metadata": {
                "abstract": "© 2019 Senger et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Raman chemometric urinalysis (Rametrix™) was used to analyze 235 urine specimens from healthy individuals. The purpose of this study was to establish the “range of normal” for Raman spectra of urine specimens from healthy individuals. Ultimately, spectra falling outside of this range will be correlated with kidney and urinary tract disease. Rametrix™ analysis includes direct comparisons of Raman spectra but also principal component analysis (PCA), discriminant analysis of principal components (DAPC) models, multivariate statistics, and it is available through GitHub as the Rametrix™ LITE Toolbox for MATLAB®. Results showed consistently overlapping Raman spectra of urine specimens with significantly larger variances in Raman shifts, found by PCA, corresponding to urea, creatinine, and glucose concentrations. A 2-way ANOVA test found that age of the urine specimen donor was statistically significant (p < 0.001) and donor sex (female or male identification) was less so (p = 0.0526). With DAPC models and blind leave-one-out build/test routines using the Rametrix™ PRO Toolbox (also available through GitHub), an accuracy of 71% (sensitivity = 72%; specificity = 70%) was obtained when predicting whether a urine specimen from a healthy unknown individual was from a female or male donor. Finally, from female and male donors (n = 4) who contributed first morning void urine specimens each day for 30 days, the co-occurrence of menstruation was found statistically insignificant to Rametrix™ results (p = 0.695). In addition, Rametrix™ PRO was able to link urine specimens with the individual donor with an average of 78% accuracy. Taken together, this study established the range of Raman spectra that could be expected when obtaining urine specimens from healthy individuals and analyzed by Rametrix™ and provides the methodology for linking results with donor characteristics.",
                "authors": [
                    {
                        "name": "Agnor B."
                    },
                    {
                        "name": "Baker E."
                    },
                    {
                        "name": "Carswell W."
                    },
                    {
                        "name": "Coogan H."
                    },
                    {
                        "name": "Dev D."
                    },
                    {
                        "name": "Du P."
                    },
                    {
                        "name": "Gouldin A."
                    },
                    {
                        "name": "Karageorge L."
                    },
                    {
                        "name": "Kavuru V."
                    },
                    {
                        "name": "Lundgren S."
                    },
                    {
                        "name": "Martinez G."
                    },
                    {
                        "name": "Merrifield K."
                    },
                    {
                        "name": "Orlando G."
                    },
                    {
                        "name": "Pirkle J."
                    },
                    {
                        "name": "Robertson J.L."
                    },
                    {
                        "name": "Senger R.S."
                    },
                    {
                        "name": "Sklar A."
                    },
                    {
                        "name": "Steen C."
                    },
                    {
                        "name": "Sullivan M."
                    },
                    {
                        "name": "Vu T."
                    }
                ],
                "citationCount": 6,
                "date": "2019-09-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Spectral characteristics of urine specimens from healthy human volunteers analyzed using Raman chemometric urinalysis (Rametrix)"
            },
            "pmcid": "PMC6764656",
            "pmid": "31560690"
        }
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Sample collections",
            "uri": "http://edamontology.org/topic_3277"
        },
        {
            "term": "Urology and nephrology",
            "uri": "http://edamontology.org/topic_3422"
        }
    ],
    "validated": 1
}
